{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-10-29T10:01:58+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic and motivated CCAB Qualified Accountant to join the finance team. We are looking for a driven individual who is self-motivated, pro-active with excellent planning and organisational skills. The post holder is required to have excellent verbal and written communication skills.&lt;/p&gt;\n&lt;p&gt;The post holder will be a senior member of the Financial Management and service area teams, demonstrating expert accounting and business knowledge, analytical support and clear presentation of highly complex or contentious financial and business information to clinical and non-clinical colleagues. He/she will constructively and positively challenge all aspects of service area financial and business performance and financial management processes to ensure efficiency and effectiveness.&lt;/p&gt;\n&lt;p&gt;Through a team of accountants the post holder is required to manage the delivery of accurate and timely monthly performance reports for agreement with the HoF for presentation at service area board meetings and to feed into the Trust’s position for internal and external corporate reporting. There will be a requirement to support the reported performance with an analytical review and to influence actions based upon these findings.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join a finance team within a large, specialist and complex organisation with great opportunities for learning and development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Maria Faroque maria.faroque@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prescot Street/Canary Wharf, London", "postalCode": "E1 8PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5116", "longitude": "-.070412"}}, "title": "Deputy Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247818", "validThrough": "2020-11-12T23:59:59+0000"}