{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 £31,841 to £50,068 Pa"}}, "datePosted": "2020-11-02T14:31:33+0000", "description": "&lt;p&gt;&lt;strong&gt;General Surgery Registrar&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Surgery Division has an two exciting posts based at King George Hospital, starting as soon as possible in the General Surgery Division. This post is on a Fixed Term Contract for 1 year with the likelihood of being extended beyond this point.&lt;/p&gt;\n&lt;p&gt;The Surgical Registrar will work with Colorectal, General Surgery and Breast. It offers an excellent opportunity to consolidate and build on existing operative and clinical skills in general, emergency and upper GI surgery. We have a busy team of 4 upper GI surgeons, who undertake various benign and cancer procedures at the trust.&lt;/p&gt;\n&lt;p&gt;They will have opportunity to get involved in quality improvement projects. We will support the appointee in their career progression.&lt;/p&gt;\n&lt;p&gt;The department has overseen the successful applications of 3 trust grade registrars having gone in to deanery surgical SpR rotations this year alone (2017). That exemplifies the quality of training and opportunities to build in to their portfolio.&lt;/p&gt;\n&lt;p&gt;The main duties of the applicant include managing and treating the elective and emergency general surgical admissions under Consultant supervision, leading and supporting the junior doctors. They will also support highly acclaimed novel surgical hot clinics which help provide ambulatory care surgical services and supporting elective work (such as Operating theatre and Clinics) in general surgery. You will report to your responsible consultant and will be expected to work as a part of a team and provide support to the junior members of your team. You may be required to take part in the Middle Grade on call rota along with the other surgical registrars.&lt;/p&gt;\n&lt;p&gt;We will support the appointee in their career progression.&lt;/p&gt;\n&lt;p&gt;The candidates would also have opportunities to rotate in to other surgical subspecialties in due course to get further experience that is suitable for their career progression.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. However, non-EEA candidates may not be appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Visas and Immigration department requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill the post. For further information please visit the UK Visas and Immigration website.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Patricia Murphy&lt;/p&gt;\n&lt;p&gt;Specialty Manager&lt;/p&gt;\n&lt;p&gt;Contact No: 01708435000 Ext :6411&lt;/p&gt;\n&lt;p&gt;Email: Patricia.murphy7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "KGH Surgery Medical Staff, Ilford", "postalCode": "IG3 8YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5805", "longitude": ".112133"}}, "title": "General Surgery Registrar", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252446", "validThrough": "2020-11-12T23:59:59+0000"}