{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21415", "minValue": "21415", "unitText": "YEAR", "value": "From £12.74 per hour"}}, "datePosted": "2020-11-05T13:31:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Various Locations across the Trust&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Various shift patterns - Weekdays, Weekends, Nights and Bank Holidays to cover the 24 hour/7 days a week period&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Are you looking for flexible work to fit in around responsibilities?&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Would you like the option to work some additional hours?&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Would you like to be paid weekly?&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Would you like to choose shifts that suit your circumstances and lifestyle?&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Are you looking for the opportunity to gain experience in working within a variety of wards and settings?&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Then consider joining our Staff Bank – Temporary Staffing Solutions.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Birmingham and Solihull Mental Health NHS Foundation Trust provides mental health care to those people living in Birmingham and Solihull who are experiencing mental health problems. We serve a culturally and socially-diverse population of over a million spread over 172 square miles. Some of our specialist services are provided further afield. With over 4000 staff and an income of over £230 million, we are one of the largest mental health foundation trusts in the country. Our Trust operates from over 50 sites in a variety of settings, from community based mental health teams through to acute wards and day centres.&lt;br /&gt;&lt;br /&gt;All our services provide specialist care for service users that often have complex mental health needs and offers support in people’s recovery through holistic treatments; promoting social inclusion, self-management, personnel autonomy and independence. We pride ourselves on valuing and supporting our staff team, which in turn allows us to deliver compassionate, none judgmental and evidence based care. We see each individual we care for as having the skills and ability for recovery.&lt;br /&gt;&lt;br /&gt;Our Temporary Staffing Service offers you full training and support, with the opportunity to work flexibly to suit your own commitments.&lt;br /&gt;&lt;br /&gt;Successful applicants must be a registered Mental Health nurse, able to work in challenging and dynamic, recovery focused environments and will need to demonstrate a range of skills including effective communication, empathy, self-awareness, compassion and critical self-reflection.&lt;br /&gt;&lt;br /&gt;Bank working offers flexible working, good training opportunities, access to occupational health services, access to the NHS Pension scheme and a number of discounts and benefits.&lt;br /&gt;&lt;br /&gt;You will receive support for your own personal/professional development and the opportunity to work across a range of different services/teams enhancing your experience and skills base.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Sites Across Trust, Birmingham", "postalCode": "B1 3RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4841", "longitude": "-1.91731"}}, "title": "Band 5 Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257907", "validThrough": "2020-11-19T23:59:59+0000"}