{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a."}}, "datePosted": "2020-11-03T09:49:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Experienced Mental Health Support Workers&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a number of Senior Mental Health Support Workers to work within the Crisis team in Portsmouth and the surrounding area.&lt;/p&gt;\n&lt;p&gt;This role will be to support trained practitioners in supporting patients at home and the community, patients who are in the acute phase of a mental illness and in crisis. This role will assist in the delivery of high standards of care to individual clients under the direction of a qualified nurse, occupational therapist or social worker.&lt;/p&gt;\n&lt;p&gt;We are looking for a experienced support workers whoare dedicated to making a difference to patients in the community. Candidates should be&lt;span&gt;able to manage their own caseload effectively, able to make clear documentation whilst working autonomously in the community or in a team. You must be empathetic to others and able to effectively escalate risk. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate must be available to work shifts covering a 24 hour seven day a week service, this is a full time opportunity.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please outline in your application how you meet the criteria outlined in the job description and person specification.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You must be a car driver and have access to a vehicle for work purposes&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Further details about this role can be found in the accompanying job description and person specification.&lt;/p&gt;\n&lt;p&gt;We recommend contacting us to find out more about this role. To find out more or to visit our team please contact Louise Norris on louise.norris@solent.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will take place on 25th November and 4th December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected. &lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO4 8LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7971", "longitude": "-1.05012"}}, "title": "Senior Mental Health Support Workers", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253330", "validThrough": "2020-11-17T23:59:59+0000"}