{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa pro rata for part time"}}, "datePosted": "2020-10-28T10:30:39+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Enhanced Primary Care Mental Health Service (EPCMHS)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PRIMARY CARE MENTAL HEALTH PRACTITIONER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;One Permanent full-time role (1.0 whole time equivalent)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term roles (1.6 whole time equivalent)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred base: Smallwood house, Redditch, however this may be negotiable at interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applications from staff who have one of the following professional backgrounds; nursing, occupational therapy, or social work, and who are interested in creating responsive and holistic services for people with mental health problems within a primary care setting.  Applicants must be fully qualified in the appropriate profession and registered with the relevant professional body.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the EPCMHS Team you will work with an identified primary care based population.  Responsibilities will include providing timely assessment and triage together with some brief psychological interventions. You will work closely with primary care general practices to undertake your clinical work as well as identifying specific project work where resources allow. As part of a multi-disciplined team you will support the work of the rest of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is essential applicants can meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Applicants must have the a&lt;/em&gt;&lt;em&gt;bility to communicate clearly and effectively in English in both verbal and written formats.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We would also like potential candidates to be aware that we are one of 12 areas to receive additional investment in line with the long term plan, with the aim of transforming how we deliver care to our local communities. Over the course of time we will be introducing a more fully integrated way of working which has significant opportunities and benefits for our patients and staff.  These include the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Working closely with our GP’s and Neighbourhood Teams to provide care for the patients registered with them. You will be working as a representative for our team with these agencies and your caseload will come largely from the GP practices that you are linked to.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Everyone registered to your linked surgery(s) will be able to access your expertise which will enable closer working relationships within your allocated area. There are no complex referral pathways and no discharges; people either ‘active’ or ‘inactive’ to mental health practitioners in your care. You have the autonomy to work closely with your Primary Care Network and shape your caseload to meet the needs of your community in conjunction with Voluntary Community Services.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Significantly more investment in Voluntary, Non-statutory services is being made to help support you in helping your patients access the services they need. The support of your professional Multi-Disciplinary Team will be readily available for you and your patients.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Therefore, it is important for any applicants to be aware that the EPCMHS service will be part of the transformation and your role will change over time, and this is accounted for within the job description for this advert.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To drive this programme forward we need qualified mental health professionals who have the passion, enthusiasm and skills to be part of this exciting, new way of providing community mental healthcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information about this opportunityplease contact Rob Coleman, Team Lead for EPCMHS, on 07841 804922.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR5 1JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1924", "longitude": "-2.18312"}}, "title": "Primary Care Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246060", "validThrough": "2020-11-22T23:59:59+0000"}