{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-27T11:43:06+0000", "description": "&lt;p&gt;As part of a national focus on Enhanced Health in Care Homes, Greater Peterborough Network are looking to recruit a team of proactive, resilient, and person-focused administrators with an interest in health and care to form a Care Co-ordination team. Working as a part of a larger Multi-Disciplinary Team (MDT) of clinical roles, care home staff, community practitioners and residents, the post holders will work to ensure that all those living in nursing and residential homes have their health needs met in a timely way.&lt;/p&gt;\n&lt;p&gt;You will build relationships with care home leads and their staff and act as a point of contact for other professionals who visit care homes, facilitating their ability to work together virtually. Your assistance in setting up the technology, acting as first contact for issues and supporting care home staff to use programs such as MS Teams, Outlook and bespoke systems will be key.&lt;/p&gt;\n&lt;p&gt;You will organise meetings, take minutes and set and chase actions to monitor progress of the MDT to support excellent resident care, effectively and efficiently. You will need to manage the needs and expectations of a number of different stakeholders, working at all levels of the Care sector.&lt;/p&gt;\n&lt;p&gt;You will work closely with the care homes and GPs to confirm that every resident has a Personalised Care and Support plan, tailored to their individual needs and desired outcomes and that this is updated as required, due to a change of circumstance or as a result of an MDT discussion.&lt;/p&gt;\n&lt;p&gt;The Co-ordinators will work flexibly including from home, GP Practices, Care Homes and Greater Peterborough Network Head Office at Allia Future Business Centre in the City Centre. You will need to travel between service sites, so having your own transport is essential.&lt;/p&gt;\n&lt;p&gt;As this is a new and evolving role, we are looking for applicants with a flexible attitude, keen to work and learn as part of a team. You’ll demonstrate excellent organisational and communication skills, have a strong working knowledge of Office 365 programs and general IT, be able to exercise initiative and demonstrate consistently high standards of professionalism, always aware of the need for confidentiality and integrity.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to make your mark in a successful, growing healthcare organisation that is committed to seeking new, creative and better ways to deliver and develop our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Own transport to move between sites&lt;/li&gt;\n&lt;li&gt;Highly computer literate (MS Office, MS Teams)&lt;/li&gt;\n&lt;li&gt;Efficient at multi-tasking and driving progress&lt;/li&gt;\n&lt;li&gt;A satisfactory Disclosure and Barring check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Basic knowledge of Health and Social Care including terminology, structures and pathways&lt;/li&gt;\n&lt;li&gt;HCA Training&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE2 8AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5651", "longitude": "-.241865"}}, "title": "Care Home Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244267", "validThrough": "2020-11-10T23:59:59+0000"}