{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-11-02T11:51:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Intensive Care Nurse – Acute Hospital&lt;/strong&gt; (flexible and long-term opportunities available)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Worcestershire Acute Hospitals NHS Trust - &lt;/strong&gt;Worcester Royal Hospital and Alexandra Hospital Redditch&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 – basic pay rate&lt;/strong&gt; £15.66 ph, Sat/Night £20.35 ph, Sun/Bank Hol £25.05 ph&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Winter Incentive Now Available (Only available for shifts worked at Worcester Acute NHS Trust)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at NHS Professionals we are looking for Intensive Care Nurses to join our team and help support Worcester Acute Hospitals NHS Trust. We have flexible shifts available to fit in with your schedule.&lt;/p&gt;\n&lt;p&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 130,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy.&lt;/p&gt;\n&lt;p&gt;The post holder is responsible for the assessment, planning, implementation and evaluation of patients care within the Ward/unit, working in accordance with the philosophy of patient centred care and to NSF and other Trust standards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 level within HDU and ICU environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In order to apply for this post you must have a minimum of 6 months experience within HDU and ICU within the last 2 years and be a qualified Registered Nurse.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Registration with NHS Professionals is subject to employment history and reference checking and offers of registration are therefore conditional upon the receipt of satisfactory references.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Flexible way of working&lt;/li&gt;\n&lt;li&gt;First Choice of available bank shifts&lt;/li&gt;\n&lt;li&gt;Access to the NHSP Stakeholder Pension&lt;/li&gt;\n&lt;li&gt;paid annual leave, statutory maternity/paternity pay (subject to qualifying criteria)&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;For more information on this role please contact natalie.peace@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Intensive Care Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251906", "validThrough": "2020-11-23T23:59:59+0000"}