{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907"}}, "datePosted": "2020-10-29T13:46:40+0000", "description": "&lt;p&gt;#WeAreElhtTheatres are a dedicated team of over 450 professionals working across our theatres every day to improve the quality of our patients lives. We are looking for dynamic RGN’s and ODP’s to join our visionary scrub/surgical team specialising in Hepatopancreaticobiliary (HPB) Surgery. There are exciting opportunities for both newly qualified and experienced scrub practitioners to work within this expanding speciality. Fully supported by a friendly theatre family, who are an extremely talented group of dedicated and engaged professionals at Royal Blackburn and Burnley General Teaching Hospitals.&lt;/p&gt;\n&lt;p&gt;Do you want to work in an environment that makes you feel valued and proud of the outstanding high quality personal care that our theatre practitioners deliver? Come and work for an NHS trust who’s commitment to progression in staff culture has earned the Health Service Journal Award 2018 “Creating a Supportive Staff Culture” Also, ELHT Theatres are proud to have been recognised as a Healthcare People Management Association (HPMA) finalist for ‘Academi Wales award for excellence in organisational development 2019’. The recent NHS National Staff Survey (2019) shows 75% of staff would recommend the organisation as a great place to work. The National Guardian Freedom to Speak up Index recognised ELHT as the best performing Trust within Lancashire and South Cumbria, the overall highest performing Acute Trust in the North West of which we are very proud of.&lt;/p&gt;\n&lt;p&gt;Although you will be predominantly working within HPB, theatres at East Lancashire Teaching Hospitals, there will be opportunity to cover various specialities including ENT, Maxfax, General surgery, Vascular, Urology, Obstetrics/Gynaecology, Ophthalmology, and both Trauma/Elective Orthopaedics, as well as the 24/7 NCEPOD Theatre.&lt;/p&gt;\n&lt;p&gt;As well as being highly professional, we’re looking for people who are committed, caring, team players, enthusiastic, great communicators and can adapt to change.&lt;/p&gt;\n&lt;p&gt;East Lancashire Teaching Hospitals NHS Trust is proud to be Lancashire and South Cumbria’s regional centre for HPB surgery. At East Lancashire Hospitals Trust (ELHT) our vision is to be widely recognised for providing safe, personal and effective care for the 750,000+ patients we treat each year at our five hospitals.&lt;/p&gt;\n&lt;p&gt;We are proud of our advancements in ground breaking robotic assisted surgery and were the first Trust in Lancashire to introduce a DaVinci robot in 2015. The robotic surgery has now advanced from Urology, onto major Head &amp; Neck and Colorectal surgery. The future program will incorporate Gynaecology and HPB surgery and to this end the Trust has secured two new DaVinci robots.&lt;/p&gt;\n&lt;p&gt;Our dedication to improving patient safety has led to our recent award by the Patient Safety Learning Organisation “for our widely recognised “below 10,000ft’ campaign. This is now being utilised by a number of Trusts nationwide.&lt;/p&gt;\n&lt;p&gt;We offer a comprehensive training programme which includes a personal development progression plan. You will be personally supported by our onsite Practice Educators and Team Managers to ensure you achieve your full potential.&lt;/p&gt;\n&lt;p&gt;Here at ELHT theatres, we value our staff, we recognise individual and team brilliance and pride ourselves in talent spotting excellence, which we highlight through ELHT STAR awards and Employee of the month nominations.&lt;/p&gt;\n&lt;p&gt;As an ELHT employee, you will be eligible for multiple staff benefits including staff lottery, onsite staff gym, secure onsite staff parking at both sites and salary sacrifice car scheme. Staff well-being is an essential service within ELHT, and to that end theatres have a staff well-being team embedded on each site.&lt;/p&gt;\n&lt;p&gt;Newly qualified staff could benefit from having their first years’ registration fees paid and existing staff may be rewarded through the ‘refer a friend scheme’.&lt;/p&gt;\n&lt;p&gt;Please ensure you regularly check the email account from which you apply as we may use this to contact you regarding your application. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristopher EmsleyEmail addresschristopher.emsley@elht.nhs.ukTelephone numberExt 87813 or 01254 733016Additional contact information&lt;/p&gt;\n&lt;p&gt;Karen Copeland - 01254 733016 - Karen.Copeland@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospital, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Theatre Practitioner - HPB", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248554", "validThrough": "2020-11-12T23:59:59+0000"}