{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-10-26T16:16:11+0000", "description": "&lt;p&gt;University Hospitals of North Midlands has two sites: Royal Stoke University Hospital, located&lt;br /&gt;in Stoke-on-Trent, and County Hospital, located in Stafford. From these hospitals we provide a full range of general acute hospital services for people living in and around Staffordshire and beyond. The Trust also provides specialised services for three million people in a wider area, including neighbouring counties and North Wales.&lt;/p&gt;\n&lt;p&gt;Role Summary&lt;/p&gt;\n&lt;p&gt;Applications are 2 year posts, depending on experience, grade and preference of specialty. Appointments would be at a level equivalent to junior, senior or advanced medics depending on the level of previous training. Posts are available in the majority of our specialties.&lt;/p&gt;\n&lt;p&gt;These posts would suit doctors from the UK or abroad that may be at various stages of their career and would include:&lt;/p&gt;\n&lt;p&gt;• Doctors who have completed their basic medical degree (MBBS) and the Foundation Programme or equivalent (currently holding full GMC registration), or 3 years of overseas continuous clinical experience post-qualification meeting the requirements on the Medical Training Initiative (MTI) scheme as per the Academy of Medical Royal Colleges (AoMRC) / post Professional Linguistic Assessment Board (PLAB) test passed with General Medical Council (GMC) registration (more junior resident)&lt;/p&gt;\n&lt;p&gt;• Doctors who have completed a recognised post-graduate qualification in General Medicine or allied specialties and are seeking further specialization or qualification or both (more senior resident) as well as UK NHS experience&lt;/p&gt;\n&lt;p&gt;• Doctors who have attained specialist status in any of the medical specialties and seek further specific experience and research opportunities (established practitioner)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The programme is standard for both UK and Overseas doctors, there being no differentiation or discrimination.&lt;/p&gt;\n&lt;p&gt;We are looking for the highest calibre and quality doctors. Such doctors are seeking to gain further experience, skills escalation, career progression and higher qualifications. Currently we are focused on Medicine and its subspecialties but opportunities in other Medical specialties, Surgical specialities, Paediatrics, Obstetrics and Gynaecology are also available for the suitable candidate with appropriate experience.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The terms and conditions of employment will be exactly equivalent to a UK NHS doctor of the same grade. The NHS will pay their salary and their remuneration will be exactly the same as an equivalent UK doctor.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Senior Training Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243347", "validThrough": "2020-11-09T23:59:59+0000"}