{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-20T10:16:40+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Consultant Psychiatrist in Older Peoples Liaison &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £82,096 - £110,683 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work in a CQC ‘Outstanding’ rated Mental Health and Learning Disability Trust? Do you want to influence the development of mental healthcare in physical health care settings? If you are passionate about delivering excellent patient care, we are looking for you to join our Medical Workforce team. In return you will get to work with a dynamic multi-disciplinary team, receive superb training and development opportunities and excellent staff benefits (including a relocation package).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;br /&gt;Newcastle Psychiatric Liaison Team: 10 PAs (including 2-2.5 SPAs) with a competitive salary of £79,860 to £107,668 per annum (or pro-rata) depending on experience. Applications are invited from psychiatrists with older people’s experience, though general adult applicants are also welcome to apply – a bespoke CPD/shadowing program to support older age competencies will be available to the successful applicant.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The team is based at the Royal Victoria Infirmary (RVI) in Newcastle upon Tyne and provides a service to the Emergency Department and wards of RVI and Freeman Hospitals. The service was successful in gaining transformation funding and is currently staffed to ‘Core 24’ specification. In 2019 we have expanded to include a Nurse Consultant and Psychological Therapist and have benefited from a social worker as part of a Better Care Fund pilot to reduce attendance at the Emergency Department.&lt;/p&gt;\n&lt;p&gt;The team maintains specialist streams of ‘working age’ and older people’s staffing and activity to meet the needs of the large tertiary teaching acute Trust we serve. We are fortunate to be accommodated on site at our host Trust NUTH, also ‘Outstanding’ and have close working relationships between the two organisations.&lt;/p&gt;\n&lt;p&gt;The team is a busy training environment for both doctors and nurses and benefits from regular foundation, core and higher specialist trainees in psychiatry.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why us? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;A flexible approach to job planning to ensure work-life balance.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated and protected SPA time.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent Continuing Professional Development (CPD) and study leave arrangements. &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation package available &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Focus on staff health and wellbeing &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A Global Digital Exemplar for Mental Health.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Trust is located in the North East of England and Cumbria which is an area of outstanding natural beauty, containing national parks, ancient heritage sites and major cities supported by excellent national and international transport links. The area is one of the best value regions for housing and offers an excellent standard of living with accomplished schools and Universities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Sarah Brown would be delighted to hear from any prospective applicant on 0191 282 4842 or via email sarah.brown@cntw.nhs.uk &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Victoria Infirmary (RVI), Newcastle upon Tyne", "postalCode": "NE1 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9786", "longitude": "-1.61846"}}, "title": "Consultant Psychiatrist in Older Peoples Liaison", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233767", "validThrough": "2020-11-17T23:59:59+0000"}