{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-03T15:47:03+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a dynamic, motivated and professional individual to join the Patient Support &amp; Complaints Team at University Hospitals Bristol. This position is offered on a fixed term basis, 30 hours per week, working over 4 days. The post holder will be responsible for independently managing their own caseload, which will include complaints management and providing advice, information and support to patients, their families/carers and members of the public.&lt;br /&gt;&lt;br /&gt;The post holder, along with the other complaints officers, will be responsible for delivering complaints training to all levels of Trust staff.&lt;br /&gt;&lt;br /&gt;If you are able to work well under pressure and enjoy dealing directly with people we would like to hear from you. Previous experience of managing complaints is essential and ideally you will have experience of working in the NHS and in a customer focused role. In return we can offer you a role where no two days are the same and which enables you to improve the experience of patients, visitors and carers who use our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Although this post is currently being offered on a fixed term basis until the end of March 2021, there is a possibility that the position may be made permanent.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTanya ToftsJob titlePatient Support and Complaints ManagerEmail addressTanya.Tofts@uhbw.nhs.ukTelephone number01173421049&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Patient Support &amp; Complaints Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254649", "validThrough": "2020-11-09T23:59:59+0000"}