{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-06T12:01:09+0000", "description": "&lt;p&gt;The Trauma and Orthopaedic care group at University Hospital Southampton NHS Foundation Trust (UHS) has an exciting opportunity (9 months fixed term to cover maternity leave) for an experienced allied health professional or registered nurse in the role of a Fracture Prevention Practitioner to lead and further develop the fragility service with support and guidance from the senior consultant fragility lead, orthopaedic surgeons, orthogeriatric and rheumatology consultants.&lt;/p&gt;\n&lt;p&gt;If you are looking to become part of an exciting and dynamic new team whilst making a significant contribution to the service in a complex yet stimulating environment we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE CARE GROUP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our trauma and orthopaedic unit provides an elective service for patients with conditions which have developed over time, and a trauma service for patients who have been injured in accidents. We have six wards, one major trauma ward, one elective ward, two trauma wards, a trauma Assessment unit, an outpatients department split over 2 sites and a step down ward at the Princess Anne Hospital.&lt;/p&gt;\n&lt;p&gt;We have a team of highly specialised consultants, many of whom are nationally and internationally recognised for their expertise and experience. We treat patients from across Hampshire, and provide second opinions and treatment for complex conditions for patients from a wider area. UHS is a Major Trauma Centre (established 2012) and T&amp;O house the Major Trauma ward in its footprint.&lt;/p&gt;\n&lt;p&gt;Our consultants are supported by nurses, therapists and other specialist clinical staff who are also experts in their field of orthopaedic care.&lt;/p&gt;\n&lt;p&gt;We are leading the way in innovative procedures including minimally invasive surgery, hip resurfacing and computer-navigated surgery. Our role as a teaching hospital and work in research and development help to keep us at the forefront of new developments and treatments.&lt;/p&gt;\n&lt;p&gt;Our service can be split into several areas:&lt;/p&gt;\n&lt;p&gt;- Major hip and knee joint replacements and revisions&lt;/p&gt;\n&lt;p&gt;- Hand, wrist and elbow surgery&lt;/p&gt;\n&lt;p&gt;- Shoulder surgery&lt;/p&gt;\n&lt;p&gt;- Foot and ankle surgery&lt;/p&gt;\n&lt;p&gt;- Trauma surgery including treating fractured neck of femur&lt;/p&gt;\n&lt;p&gt;- Pelvic fractures&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;- &lt;/strong&gt;Spinal surgery&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This will involve but not restricted to:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Finding appropriate cases, who have been assessed as requiring to be seen for fracture prevention by the team (men and women over the age of 50 who have experienced a low trauma fracture) within the Southampton City and West Hampshire areas.&lt;/li&gt;\n&lt;li&gt;Providing a specialist review for patients either as an inpatient or in dedicated outpatient clinics if assessed as appropriate. This may involve taking a history, examining the patient, referring for appropriate tests and devising a management plan. Full training and support will be provided to the post-holder to gain the relevant experience.&lt;/li&gt;\n&lt;li&gt;Provide patient education and support to families about osteoporosis and bone-specific medication.&lt;/li&gt;\n&lt;li&gt;Refer to community falls clinic and rehabilitation programmes where there is appropriate funding to enable this. This will involve working across professional, departmental and organisational boundaries to facilitate a patient-centred, integrated, seamless pathway of care.&lt;/li&gt;\n&lt;li&gt;Oversee and support the administration with data entry to national hip fracture and fracture liaison service databases. Engage with IT innovation and programmes within the trust to maximise efficiency and quality of data collection.&lt;/li&gt;\n&lt;li&gt;The post holder will work across professional, departmental and organisational boundaries as required to facilitate a patient-centred, integrated, seamless pathway of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have experience in Orthopaedic care and have completed an appropriate history taking and examination course. You will become part of an exciting and dynamic new team, developing your leadership skills, whilst making a significant contribution to the service in a complex yet stimulating environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Monday, 30 November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracy Mahon&lt;br /&gt;Matron&lt;br /&gt;Tracy.Mahon@uhs.nhs.uk&lt;br /&gt;02381206244&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Fracture prevention practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259557", "validThrough": "2020-11-19T23:59:59+0000"}