{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-23T11:30:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Cross Sectional Radiographers – Band 5/6 – Radiology – 37.5 hours per week – Permanent positions available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Fancy a career in cross sectional imaging? &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for staff to expand our cross-sectional team. We need more staff to allow us to extend our working day and keep waiting times low for our communities with Covid. The Trust has acquired a further CT and MRI scanner to help with this.&lt;/p&gt;\n&lt;p&gt;Whether you are an experienced CT/MRI radiographer looking for a change, a general radiographer who is interested in career progression, advanced practice or indeed a new graduate with little experience in the cross-sectional environment, we are keen to hear from you.&lt;/p&gt;\n&lt;p&gt;For those candidates with little/no cross-sectional experience we will offer a training programme to develop and support your cross-sectional skills and knowledge. For those with proven cross-sectional experience the West Suffolk offers exciting opportunities with the chance to broaden skills and enhance your cross-sectional career. We are fortunate to be able to offer post graduate opportunities having Radiographers who perform and report CTCs and MRI reporting. We will need to see enthusiasm at interview and are keen for candidates to contact us prior to interview to discuss what we can offer each other.&lt;/p&gt;\n&lt;p&gt;Candidates need to be keen team player, have a passion for a career in cross sectional imaging and have image quality and patient care at the forefront of their practice.&lt;/p&gt;\n&lt;p&gt;West Suffolk Foundation NHS Trust is a district general hospital in a beautiful town in Suffolk. Many of our staff have been here for years creating a real sense of community. We are at an extremely exciting phase in our development and are fortunate to be building a new state of the art hospital which will bring its own opportunities too. The department has QSI accreditation which confirms our commitment to quality care.&lt;/p&gt;\n&lt;p&gt;We have 2 GE CT scanners which scan about 26000 per annum and two 1.5T MRI scanners imaging about 14000 per annum. The services are remote to each other but an opportunity to train in both is an option. The scanners operate extended hours and weekends with bank holiday cover expected too. This recruitment drive is to help cover extra hours which come with mobile scanners.&lt;/p&gt;\n&lt;p&gt;We will consider job share applicants from part time applicants.&lt;/p&gt;\n&lt;p&gt;There is scope for extra hours and enhancements.&lt;/p&gt;\n&lt;p&gt;If you fancy a change and need a warm and friendly department which offers opportunity please contact Sam Melero CT Superintendent (sam.melero@WSH.nhs.uk or Claire.Moore@wsh.nhs.uk MRI Superintendent. We look forward to hearing from you 01284 713678.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Cross Sectional Radiographers - Band 5/6 - Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240316", "validThrough": "2020-11-16T23:59:59+0000"}