{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28526", "minValue": "28526", "unitText": "YEAR", "value": "£16.97 Per Hour"}}, "datePosted": "2020-10-14T15:23:13+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS Professionals in partnership with Livewell Southwest are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Psychiatric Nurse to join the bank.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Both Full Time &amp; Part Time Hours Available – Including Day &amp; Night Shifts&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations – working within community locations throughout the Plymouth area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay rate – Day rate: £16.97 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Night/Saturday rate: £22.06 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Sunday/Bank Holiday rate: £27.15 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 40,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our 62 NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Home Treatment Team provides Short term crisis work and longer term treatment at home. Both are designed to offer alternatives to inpatient bed use or to safely facilitate early discharges.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Home Treatment Team operates 24 hours per day, 365 days per year and works with people aged 18-65 years, who are experiencing an acute mental health crisis and are registered with a GP in a specific locality of Plymouth.&lt;/em&gt;&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;The post holder will provide mental health care and other interventions in the setting most appropriate to meet the patient’s needs. In addition they will provide support and supervision the junior staff.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In order to apply for this post you must have a minimum of 6 months’ experience in a similar role held within the last 2 years, and hold NMC Registered qualification and a valid PIN.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be required to provide a high quality assessment (including risk assessment) to those who are experiencing a mental health crisis and then signpost to the relevant service, this could be an inpatient admission, CMHT within secondary mental health services, or it may involve signposting to third sector organisations or back to GP. They will be required to provide support and supervision to junior staff, such as Community Support Workers, within the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The 5 Year Forward View (DH 2014) and Mental Health Crisis Care Concordat (DH 2014) are relevant to this post.&lt;/p&gt;\n&lt;p&gt;The Care Programme Approach (CPA) will be applicable to all service users with the Home Treatment Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To receive and triage referrals for those presenting in a mental health crisis&lt;/li&gt;\n&lt;li&gt;To be part of a multi-disciplinary team approach responding to individuals requiring a same day response or signposting due to a mental health crisis&lt;/li&gt;\n&lt;li&gt;To provide skilled telephone advice to referrers and patients and carers&lt;/li&gt;\n&lt;li&gt;To provide skilled telephone based support to help contain a crisis and avoid further escalation of an issue&lt;/li&gt;\n&lt;li&gt;To offer an urgent mental health assessment in a location most convenient/appropriate for the patient; this may be in their home, GP surgery or Emergency Department.&lt;/li&gt;\n&lt;li&gt;Identify the most appropriate intervention required for patient, with an emphasis on positive risk management, and refer as necessary.&lt;/li&gt;\n&lt;li&gt;Following assessments provide high quality assessment reports/letters to the relevant professionals. Monitor reports by junior staff to ensure they are of the same standards.&lt;/li&gt;\n&lt;li&gt;Support the Team Manager in the effective running of the team and monitoring of standards through effective clinical supervision of junior staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;p&gt;- Competitive, weekly pay&lt;/p&gt;\n&lt;p&gt;- Paid annual leave&lt;/p&gt;\n&lt;p&gt;- Training and development opportunities&lt;/p&gt;\n&lt;p&gt;- Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/p&gt;\n&lt;p&gt;- Access to a wealth of Health Service Discounts&lt;/p&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL4 7PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3788", "longitude": "-4.11685"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226872", "validThrough": "2021-01-31T23:59:59+0000"}