{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "68891", "minValue": "60058", "unitText": "YEAR", "value": "£60,058.00 - £68,891.00 p.a. inc HCA"}}, "datePosted": "2020-10-29T14:15:44+0000", "description": "&lt;p&gt;The Medical Specialties Directorate is looking for a talented and committed Deputy General Manager to manage our services.&lt;/p&gt;\n&lt;p&gt;The Medical Specialties Directorate at GSTT has a number of services of national and international reputation. The DGM portfolio covers a number of both clinical and non-clinical services, including several nationally commissioned and diagnostics services.&lt;/p&gt;\n&lt;p&gt;The DGM is be responsible for the operational delivery and improvement of all clinical and non-clinical services within these areas, and for managing the recovery of activity following the first wave of the COVID-19 pandemic. The directorate is rebuilding services in a way that makes them more resilient against future disruptions, and the current context provides significant opportunities to make services changes that benefit patients and staff.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely in a close-knit team with the General Manager, Clinical Director, Heads of Nursing and wider DMT along with the Clinical Leads and Services. They will have excellent communication skills, a commitment to care quality and performance delivery along with robust financial and workforce management experience. This is an excellent opportunity for those looking at furthering their operational and strategic experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note the following important dates:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: Wednesday 11th November&lt;br /&gt;Proposed Interview date: Monday 16th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIndia BrummittJob titleGeneral ManagerEmail addressindia.brummitt@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to learn more about this role, please contact India Brummitt, General Manager (india.brummitt@gstt.nhs.uk) for more information.&lt;/p&gt;\n&lt;p&gt;We may not be able to speak to all candidates prior to shortlisting, but will be able to discuss the role with shortlisted candidates prior to an interview.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Site, London", "postalCode": "SE1 7EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4999", "longitude": "-.116205"}}, "title": "Deputy General Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248659", "validThrough": "2020-11-06T23:59:59+0000"}