{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa"}}, "datePosted": "2020-11-06T10:46:55+0000", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals of Derby and Burton NHS Foundation Trust (UHDB)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pharmaceutical Services &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term / 2 year Secondment - Commencing February 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time (37.5 hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pre-registration Pharmacy Technician &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 4, £21,892 - £24,157pa (70% Band 4 in 1st year and 75% Band 4 in 2nd year)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role of the Pharmacy Technician is very challenging and rewarding. They are vital members of the Pharmacy Team, working under the supervision of a registered Pharmacist in providing pharmaceutical care to patients.&lt;/p&gt;\n&lt;p&gt;Minimum requirements for the post are &lt;strong&gt;GCSE’s&lt;/strong&gt;: Math’s B, English and Science (either one at B or above and one at C or above) 3 other subjects at a minimum of grade C .&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;GCSE’s : &lt;/strong&gt;Maths,English and a science at grade C (or equivalent) and two other GCSE’s at grade C &lt;strong&gt;and &lt;/strong&gt;successful achievement of the Pharmacy Service Skills Level 2 QCF qualification (or equivalent) &lt;strong&gt;and&lt;/strong&gt; have been working in the Trust where they are applying for a student Technician post for a minimum of 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Three ‘A’ levels&lt;/strong&gt;, one of which is a relevant science subject and Maths B (GCSE or equivalent).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Degree&lt;/strong&gt; in Science or Humanities and Maths B GCSE (or equivalent.)&lt;/p&gt;\n&lt;p&gt;You will be required to rotate around the areas of Pharmacy which will include dispensing prescriptions, patient counseling, ward top up, medicines information, medicines management and chemotherapy.&lt;/p&gt;\n&lt;p&gt;You will spend 1 day each week at college working towards the Level 3 Diploma in the Principles and Practice for Pharmacy Technicians , and 4 days gaining work experience within the hospital Pharmacy.&lt;/p&gt;\n&lt;p&gt;The posts are full time Monday to Friday and will include participation in our Weekend and Bank holiday rotas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date of applications: 22 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 4 December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Claire Eaton / Lorraine Ryder - Senior Technicians&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01283 511511 ext 5897&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital Burton, Burton-on-Trent", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Student Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259298", "validThrough": "2020-11-22T23:59:59+0000"}