{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15549", "minValue": "15549", "unitText": "YEAR", "value": "£9.25 Per Hour Free DBS check, Flu vaccination and"}}, "datePosted": "2020-10-26T13:47:14+0000", "description": "&lt;p&gt;Salary: £9.25 per hour&lt;/p&gt;\n&lt;p&gt;Requirements: Minimum oftwo years experience within social care and aQCF/NVQ Level 2 Health &amp; Social Care&lt;/p&gt;\n&lt;p&gt;Hours of Work: 37.5 hours per week, working on a rolling rota basis&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Work Place Pension&lt;/li&gt;\n&lt;li&gt;Company Funded DBS Check&lt;/li&gt;\n&lt;li&gt;Comprehensive Training Package&lt;/li&gt;\n&lt;li&gt;Progression Opportunities&lt;/li&gt;\n&lt;li&gt;We also offer Health &amp; Social Care QCF qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About the Role:We have a vacancy for you to join an existing friendly team, supporting individuals with a learning disability and Autism to lead a full a meaningful life. You will have the opportunity to develop your skills, share your experiences and really make a difference to the lives of those we support.&lt;/p&gt;\n&lt;p&gt;As a Team Leader you will take a key role in delivering the services within the home ensuring the promotion of good working practice and offering a role model to support staff. You will work closely with the Home Manager to provide professional support, supervision and guidance to a team of support workers, to ensure continuity of care.&lt;/p&gt;\n&lt;p&gt;If you are ready for an exciting and varied role where you may; assist someone to learn new skills this may be through local colleges or getting out and about visiting family and places of interest, enjoying hobbies, leisure interests and much more besides then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post will have experience in learning disabilities, mental health issues and possess experience in leading a team. Within this role you will need an understanding of medication procedures, safeguarding policies and procedures, motivation skills, be self-motivated, flexible and organised.&lt;/p&gt;\n&lt;p&gt;About MHC:We are committed to delivering the very best care within our health/social care services across England and North Wales. We provide a culture that empowers the people we work with - both individuals and colleagues - to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;By working together, we develop pathways for individuals and colleagues that enable them to achieve positive outcomes. Likewise, we work together with families and carers too, so they are always fully involved in their loved one&#39;s care while they are with us.&lt;/p&gt;\n&lt;p&gt;Skills:Strong communicator, creative, motivated, ability to cope in challenging situations. Experience of supporting adults with a learning disability/complex behaviours essential.&lt;/p&gt;\n&lt;p&gt;About the Service:Orchard is mixed gender service providing accommodation for up to 6 residents in apartment accommodation. We have an experienced and motivated staff team, supporting our individuals to develop social and adaptive skill to maintain and gain further independence. The service offers opportunities to enhance the quality of the lives of our residents.&lt;/p&gt;\n&lt;p&gt;Equal Opportunities:MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply:Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572 020&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llangwyfan, Denbighshire", "postalCode": "LL16 4LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1846", "longitude": "-3.31823"}}, "title": "TEAM LEADER - ORCHARD VIEW", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242763", "validThrough": "2020-11-25T23:59:59+0000"}