{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T15:01:25+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Previous Applicants should not apply. &lt;/strong&gt;&lt;/span&gt;&lt;span&gt;&lt;strong&gt;Please note this vacancy may be closed early if we have a sufficient number of applications.&lt;/strong&gt; &lt;/span&gt;&lt;br /&gt;&lt;br /&gt;The HRA was established in December 2011 to promote and protect the interests of patients in health research and to streamline the regulation of research. We aim, with partners, to make the UK a great place to do health research, to build confidence and participation in health research, and so improve the nation’s health. We are committed to promoting transparency and patient and public involvement in health research.&lt;br /&gt;&lt;br /&gt;HRA Approval is a system that simplifies the approvals process for research, to make it easier for studies to be set up and reduce duplication and bureaucracy. It provides a single application, single assessment and single approval for research in the NHS across all study types and incorporate assessments by NHS staff alongside the independent Research Ethics Committee opinion, allowing local resources to be focussed on successful local delivery of studies.&lt;br /&gt;&lt;br /&gt;This post is an exciting opportunity to be part of a team that delivers the operational function for HRA Approval. We are looking for individuals who can bring experience of health research and can demonstrate enthusiasm to deliver an effective and efficient approval system for research.&lt;/p&gt;\n&lt;p&gt;S/he must have an understanding of the HRA role and remit, knowledge of a range of administrative practices and procedures plus evidence of practical experience at a similar level. S/he will have a well-developed knowledge and expertise of operating systems within the NHS or similar field and excellent organisational skills with the ability to prioritise against a background of change and uncertainty. Experience of working to complex policies, of working with people at all levels in an organisation and of working to tight deadlines is essential.&lt;/p&gt;\n&lt;p&gt;Base: The vacancy can be based in Manchester, Newcastle, Nottingham or Bristol, (London - internal only) and will be offered to the most suitable candidate irrespective of location.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Tom Lucas - tom.lucas@hra.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Research Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG1 6FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9516", "longitude": "-1.15601"}}, "title": "Approvals Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260258", "validThrough": "2020-11-24T23:59:59+0000"}