{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50819", "minValue": "44606", "unitText": "YEAR", "value": "£44,606 to £50,819 pa"}}, "datePosted": "2020-10-06T13:55:28+0100", "description": "&lt;p&gt;&lt;strong&gt;8A Child and Adolescent Psychotherapist post (Full-Time, 10 sessions) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications for job shares will be considered&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the highly rated Birmingham Women’s and Children’s NHS Foundation Trust. In our last CQC report, the psychotherapy team was commended for outstanding good practice and we are looking for someone to contribute to shaping our service as well as deliver excellent clinical care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The 8a post is located in Forward Thinking Birmingham, our multi-disciplinary community mental health service. This innovative service model is leading the way in the mental health field, providing specialist mental health care to children and young people aged 0-25 years, across the city of Birmingham through four community hubs and other locations. Service user involvement in the design and delivery of care is actively sought.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a dynamic and motivated child psychotherapist with full membership of the Association of Child Psychotherapists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will join busy and evolving multi-disciplinary team. They will be able to demonstrate excellent clinical skills, specialist interests, flexibility in terms of how and where they provide treatment, capacity to work under pressure, and together with MDT colleagues manage young people who present with high levels of complexity and risk. Psychotherapy is valued by our MDT colleagues and there are many opportunities for collaboration. We are committed to offering a service which is inclusive and reaches out to all the communities we serve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to demonstrate highly developed clinical skills across a range of complex co-morbid presentations, excellent case management skills and an enthusiasm for passing on your knowledge to psychotherapy trainees following an ACP approved training, through supervision and co-working. We have a close relationship with the local training school, BTPP.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining a friendly, outward facing and creative psychotherapy team, strongly rooted in our clinical tradition while also developing new ways to contribute to the service. With appropriate support, you’ll develop skills working psychoanalytically with young adults (18-25) as well as children under five. Our specialist consultations to the MDT across a range of clinical pathways are highly valued by colleagues. We also have a research project underway in partnership with a local university. In return we offer excellent supervision, career development opportunities and in service training. Birmingham and the West Midlands have good transport links and offer a vibrant and diverse environment to live and work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and informal discussion please contact Helen Randall, Consultant Child and Adolescent Psychotherapist by email at hrandall1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Women&#39;s and Children Hospital", "postalCode": "B6 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5081", "longitude": "-1.89602"}}, "title": "Highly Specialist Child and Adolescent Psychoanalytic Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214921", "validThrough": "2020-11-06T23:59:59+0000"}