{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207"}}, "datePosted": "2020-11-04T16:01:29+0000", "description": "&lt;p&gt;Newham Talking Therapies (NTT), Centre for Clinical Excellence is looking to recruit 5 Psychological Wellbeing Practitioners to join a high performing and creative team. This is an opportunity for Psychological Wellbeing Practitioners (PWPs) to develop their career in the Low Intensity service. This role involves offering evidence-based practice in the delivering low intensity interventions within an IAPT service. We also value experience or interest of delivering therapy in a group format.&lt;/p&gt;\n&lt;p&gt;We are part of East London NHS Foundation Trust which has been rated Outstanding for the second year by Care Quality Commission (CQC) and are committed to ensuring a healthy work life balance and a positive working environment.&lt;/p&gt;\n&lt;p&gt;NTT is an exceptional talking therapies service with excellent development opportunities. We are committed to the progression of our team members and our posts are formulated to allow for development of clinical expertise in chosen clinical areas. As well as offering a range of therapies, the service also runs as a training centre, therefore offering opportunities for supervision and training.&lt;/p&gt;\n&lt;p&gt;The post-holder will be part of a very dynamic team and will work alongside PWPs as well as therapists trained in a range of therapies including systemic and couple therapies, EMDR, CBT psychodynamic and integrative therapies. We also have a dedicated team working with physical health related problems and long term conditions; this offers those who work with our team plenty of opportunities to enhance their job satisfaction by learning more about this area and developing skills in working with this population.&lt;/p&gt;\n&lt;p&gt;The post-holder will work with people with different cultural backgrounds and ages, using interpreters when necessary and work in various community settings (including GP surgeries) and psychological treatment centres.&lt;/p&gt;\n&lt;p&gt;We are looking for new members to join the team who are committed, enthusiastic and willing to contribute to the service and embrace different ways of working. This post offers opportunities to work with a range of professionals from different therapeutic backgrounds and to be part of an evolving, integrating team. Members of our team are committed to ensuring a healthy work life balance and a creating a positive working environment.&lt;/p&gt;\n&lt;p&gt;These vacancies are offered as permanent posts, with the expectation that all clinical staff work one late evening per week (12pm until 8pm).&lt;/p&gt;\n&lt;p&gt;If you have any further questions, please contact Joseph Croft, HI CBT Therapist &amp; PWP Team Manager on 020 8536 2161 for an informal discussion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoseph CroftEmail addressjoseph.croft@nhs.netTelephone number0208 536 2161Additional contact information&lt;/p&gt;\n&lt;p&gt;Joseph Croft, telephone 0208 536 2161, email joseph.croft@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham Talking Therapies, LONDON", "postalCode": "E13 8AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5267", "longitude": ".023805"}}, "title": "IAPT-Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256557", "validThrough": "2020-11-29T23:59:59+0000"}