{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum, pro rata"}}, "datePosted": "2020-10-23T14:31:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a Specialty Doctor with an interest in Early Intervention?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South Gloucestershire Early Intervention Team are looking for a part time specialty doctor to join their team based at Kingswood Civic Centre.&lt;/p&gt;\n&lt;p&gt;The South Gloucestershire Early Intervention in Psychosis team works with people aged 14- 65 who are experiencing a first episode psychosis or who may be at risk of developing a psychosis.&lt;/p&gt;\n&lt;p&gt;Following the implementation of the Access and Waiting Time Standards set out by NHS England, the team has expanded and developed to be able to provide specialist interventions to those experiencing a first episode of psychosis.&lt;/p&gt;\n&lt;p&gt;The service currently consists of a Team Manager, Consultant Psychiatrist, Clinical Psychologist, Senior Practitioner, Community Mental Health Practitioners, CBT Therapists, Mental Health Support Worker, Administrator as well as a specialist Physical Health and Vocational Practitioner.&lt;/p&gt;\n&lt;p&gt;The post includes one hour per week protected supervision time with the Consultant. Attendance at the weekly postgraduate programme is encouraged.&lt;/p&gt;\n&lt;p&gt;We are committed to your development, making the very best of your talent and helping you to achieve your career aspirations.&lt;/p&gt;\n&lt;p&gt;You will need to have completed at least four years’ full-time postgraduate training (or its equivalent gained on a part-time or flexible basis) at least two of which will be in a specialty training programme in Psychiatry or as a fixed term specialty trainee in Psychiatry; or shall have equivalent experience and competencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Andrew Brindley, Consultant Psychiatrist, Tel: 0117 378 7970&lt;/p&gt;\n&lt;p&gt;Ceri Webb, Team Manager, Tel: 0117 378 7970&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingswood Civic Centre, Bristol", "postalCode": "BS15 9TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4627", "longitude": "-2.50131"}}, "title": "Specialty Doctor - South Glos Early Intervention", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240941", "validThrough": "2020-11-09T23:59:59+0000"}