{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (pro-rata)"}}, "datePosted": "2020-11-02T11:06:46+0000", "description": "&lt;p&gt;Up to 22.5 hours per week - permanent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest is an award winning provider of NHS health and social care services in Plymouth and NHS community health services in South Hams and West Devon. Quality care is at the heart of our philosophy to help keep people safe, well and at home.&lt;/p&gt;\n&lt;p&gt;A leader in integrated care, we continue to innovate our services into multidisciplinary teams shaped around our localities. As a social enterprise, we offer excellent terms and conditions and future career development opportunities. Our locations offer an exciting work life balance, with Dartmoor and glorious beaches on the doorstep and Plymouth, Britain’s Ocean City offering culture and excellent travel links.&lt;/p&gt;\n&lt;p&gt;We are seeking registered nurses who are passionate to work within a community setting within the District Nursing Service within Livewell.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you confident about making autonomous decisions regarding patient care?&lt;/li&gt;\n&lt;li&gt;Do you want to be part of an exciting opportunity developing the traditional function of the service for a new innovative patient care pathway that deliver’s tangible benefits for patients and colleagues?&lt;/li&gt;\n&lt;li&gt;In line with our Service specification, why not be part of a service that ensures the patient receives the right care, by the right professional at the right time?&lt;/li&gt;\n&lt;li&gt;Would you enjoy the challenge of being an integral member of a diverse and skilled team of professionals helping to maintain continuity of care for patients in their own homes 24/7?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for a Community Registered Nurses who are passionate about providing high quality, competent care to people in their own homes. To promote a whole service, in a coordinated way and improve patients experiences.&lt;/p&gt;\n&lt;p&gt;You will be part of a Team and managed by a District Nurse Team Manager.&lt;/p&gt;\n&lt;p&gt;The role requires positivity, excellent communication, customer care and organisational skills, good time management and the ability to prioritise own workload.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL7 2AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3889", "longitude": "-4.05396"}}, "title": "Community Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251713", "validThrough": "2020-11-15T23:59:59+0000"}