{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata plus HCAS"}}, "datePosted": "2020-10-28T17:01:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Primary care roles for Mental Health Integrated Network Teams (MINT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Background;&lt;/p&gt;\n&lt;p&gt;The Long-Term Plan, together with NHSE’s Community Mental Health Framework, provides a historic opportunity to address gaps in the provision of Mental Health care within communities. Community teams will move away from hard-to-reach services towards joined-up care and whole population management approaches, establishing a revitalised purpose and identity for community mental health services. One of the LTP’s key objectives is to develop “new and integrated models of primary and community mental health care [which] will support adults and older adults with severe mental illnesses”. It supports the development of place based and personalised community mental health services wrapped around the Primary Care Networks (PCNs), and outlines how these developments will help to improving care for people with severe mental illnesses.&lt;/p&gt;\n&lt;p&gt;Following a successful bid as an early implementer site, we are expanding our Treatment and Recovery teams, together with our Primary Mental Health care services, and additional resources, to create teams in support of the vision outlined within the LTP. The newly formed MINT teams will be accessible wherever and whenever needed and will empower individuals to manage their condition with the support of their local communities. The teams will be closely aligned to Primary Care Networks in each of the Local Boroughs of Hammersmith &amp; Fulham, Ealing and Hounslow. As part of our expansion we are looking for skilled and experienced practitioners to fill roles across our 3 Boroughs.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit Band 6, Primary Care Mental Health Practitioners posts. This is an opportunity to utilise and further develop your skills in offering a range of interventions to patients within a primary care setting. Candidates should have robust clinical assessment skills, good communication and IT skills, with the ability to adjust to changes and challenges in the integration of Primary and Secondary care services into MINT teams. Moving forward the MINT teams will deliver mental health care within a smaller primary care network (group of GP practices) and offer service users mental health care with a geographical and community access focus.&lt;/p&gt;\n&lt;p&gt;Applicants must be a registered mental health professional; (nurse, social work practitioner, occupational therapist). You must have experience of working in the community as a clinician and managing a case load. You will need to understand recovery approaches, have a desire to learn about a range of brief interventions and to work alongside a range of community providers.&lt;/p&gt;\n&lt;p&gt;These primary care mental health posts will automatically join our integrated mental health teams and spearhead the delivery of effective clinical interventions that enhance recovery, community engagement and rapid access to a range of therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;Why Join Us?We are one of the most diverse providers of mental health and community care in the UK and our staff are dedicated to improving lives through the wide range of services we offer. Our ambition is to be the best organisation of our type in the UK.&lt;/p&gt;\n&lt;p&gt;We’d love to see you working in our Trust and contributing to some of the great work we do.&lt;/p&gt;\n&lt;p&gt;We positively welcome applications from people with a lived experience of either mental health conditions or learning disabilities and people who represent diverse communities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Mission&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“Promoting hope and wellbeing, together”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to be an outstanding healthcare provider, committed to improving quality, and caring with compassion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We work to a set of Trust Values and uphold these in all of our interactions. Our values are like our moral compass, reminding us of the things that matter most when we are caring for people in need. Our Trust values are: &lt;strong&gt;Togetherness Responsibility Excellence Caring&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you feel you are a person who lives our Trust values, then we’d like to meet you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an extensive reward package to our staff alongside an exciting and fulfilling career with our Trust. Some of the benefits you can enjoy when you join our team are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Up to 33 days annual leave as well as the opportunity to buy even more days or sell some leave days that you don’t need&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Support towards career development and promotion opportunities within the Trust&lt;/li&gt;\n&lt;li&gt;A supportive environment to develop clinical skills&lt;/li&gt;\n&lt;li&gt;Access to a comprehensive online library of training, development, and resources.&lt;/li&gt;\n&lt;li&gt;Discounted gym membership – from £10 per month at our on-site gym (St Bernard’s site)&lt;/li&gt;\n&lt;li&gt;Staff discounts at high street retailers&lt;/li&gt;\n&lt;li&gt;Paid DBS application upon offer&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion, please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Daniel Stockwell : Daniel.Stockwell@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;Robert White: Robert.White@westlondon.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Varied, Varied", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Primary Care Mental Health Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247459", "validThrough": "2020-11-11T23:59:59+0000"}