{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/pro rata"}}, "datePosted": "2020-10-29T11:45:10+0000", "description": "&lt;p&gt;&lt;strong&gt;SHEFFIELD&lt;/strong&gt;&lt;strong&gt; CHILDREN’S NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Junior Clinical Research Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;35 Hours per week (less hours considered, minimum 30 hrs per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;6 month fixed term contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and self-motivated individual to join the team in the Directorate of Research &amp; Innovation at Sheffield Children’s NHS Foundation Trust. This is a Junior Clinical Research Officer leading on our Patient and Public Involvement and Engagement (PPIE) work. You will be responsible for delivering a project which aims to engage more patients, families and carers from BAME and underserved and vulnerable communities in research at our Trust. The project is a fixed term 6 month project and it is funded by the Clinical Research Network for Yorkshire and the Humber.&lt;/p&gt;\n&lt;p&gt;Capacity allowing, you may be called upon to support a portfolio of paediatric clinical studies in a range of clinical areas from study set up to archiving in accordance with the clinical trial protocol and Good Clinical Practice. The post may also involve elements of data management for the Directorate’s governance team. You will take forward the Directorate’s plans for PPIE in research and may also support, and be responsible for, relevant studies in their own right.&lt;/p&gt;\n&lt;p&gt;You will have a good working knowledge of computer software packages and excellent word processing skills. You must have the proven ability to prioritise your workload and produce high standard, accurate work to tight deadlines. You must have excellent communication skills through face-to-face interactions and using virtual platforms. You will be comfortable and have experience with interacting with patients and members of the public of all ages including children and their parents/guardians.&lt;/p&gt;\n&lt;p&gt;You will also have a track record of integrating with teams; be aware of Good Clinical Practice (GCP) and the Research Governance Framework; be able to demonstrate awareness of your own limitations and be willing to work flexibly in terms of hours and duties to meet service needs.You will be expected to develop specialized skills and knowledge relating to the projects you support. &lt;br /&gt; &lt;br /&gt; The post will be based predominantly within the Directorate of Research &amp; Innovation at Sheffield Children’s Hospital but there may a requirement to work across Trust sites and to conduct external visits (e.g. community centers / school visits) as required for the project you are supporting. We will provide excellent opportunities for development and you will have the opportunity to attend training and meetings in the field of clinical research. In return, we are seeking enthusiastic and motivated candidates who have experience of and an interest in developing a career in clinical research. Successful applicants will be required to adopt a flexible working pattern and work autonomously.&lt;/p&gt;\n&lt;p&gt;This post is funded by the Clinical Research Network of Yorkshire and the Humber and is a 6 month fixed term post to commence as soon as possible. For more information about this post please contact Keith Pugh, Research &amp; Development Manager, at keith.pugh1@nhs.net &lt;br /&gt; &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122992.JPG", "name": "Sheffield Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3806", "longitude": "-1.49123"}}, "title": "Junior Clinical Research Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248151", "validThrough": "2020-11-11T23:59:59+0000"}