{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc."}}, "datePosted": "2020-10-29T16:01:12+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want to recruit a highly motivated and enthusiastic Band 5 (RN/RN&lt;br /&gt;MH/RGN/RNLD) with the possibility of a developmental role to a Band 6 to join our Memory Service in Waltham Forest.&lt;/p&gt;\n&lt;p&gt;Our last CQC overall rating is &#96;Good&#96;.&lt;/p&gt;\n&lt;p&gt;Our Memory Service is MSNAP Accredited for the last 5 years and also has been awarded a Sustainability Mental Health Service commendation recently.&lt;/p&gt;\n&lt;p&gt;It is a diagnostic service which offers follow-up group work and interventions for service users and carers.&lt;/p&gt;\n&lt;p&gt;We are keen in promoting Health and wellbeing for all staff and will be investing in their learning and development.&lt;/p&gt;\n&lt;p&gt;NELFT delivers services within the Dementia Pathway that are recovery-focused and socially inclusive. The time is right for innovative clinicians to provide skilled input within a multidisciplinary team to support a culture of assessment, treatment, recovery and social inclusion. Quality Improvement projects drive through continuous service improvements.&lt;/p&gt;\n&lt;p&gt;The successful candidates will use their evidence based clinical skills to manage a caseload of service users with memory issues, dementia and functional mental illnesses .&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to work within a diverse community in the London Borough of Waltham Forest, to develop quality services which improve the lives of local people.&lt;/p&gt;\n&lt;p&gt;You will provide specialist services and interventions in accordance with the national policies and clinical guidelines relating to dementia and functional mental health problems.&lt;/p&gt;\n&lt;p&gt;Essential criteria for the post are:&lt;br /&gt;&lt;br /&gt; • Demonstrate evidence of Continuous Professional Development&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working within the context of a multidisciplinary team liaising with other team members and with external agencies.&lt;/li&gt;\n&lt;li&gt;Have good time management and assessment skills with dementia and be able to prioritise and work on own initiative.&lt;/li&gt;\n&lt;li&gt;Be able to work autonomously in a safe manner in clients own homes.&lt;/li&gt;\n&lt;li&gt;Have excellent communication skills - written &amp; verbal.&lt;/li&gt;\n&lt;li&gt;Be able to assess care needs, plan and review them enabling service users to maximise opportunities for treatment and post diagnostic support.&lt;/li&gt;\n&lt;li&gt;Work closely within a multi- disciplinary team and with other agencies to deliver recovery focused health and social care interventions that includes managing risk and the safeguarding of adults at risk.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Wazir Khan&lt;/p&gt;\n&lt;p&gt;Clinical Lead, Memory Service&lt;/p&gt;\n&lt;p&gt;0300 555 1270&lt;/p&gt;\n&lt;p&gt;wazir.khan@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jane Atkinson Health and Wellbeing Centre, Walthamstow", "postalCode": "E17 3HP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5907", "longitude": "-.007842"}}, "title": "Community Nurse in the Memory Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248998", "validThrough": "2020-11-09T23:59:59+0000"}