{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-10-21T12:46:45+0100", "description": "&lt;p&gt;Applications are invited for the post of Clinical Fellow in Adult Cystic Fibrosis and Complex Lung Infection at Oxford University Hospitals NHS Foundation Trust. The post will provide training in the management of patients with cystic fibrosis (CF), bronchiectasis and respiratory infection. This is a fixed term post for twelve months starting beginning of February 2021, but may be extended if mutually agreed. The post will provide extensive experience in all aspects of the management of CF and our active transition programme. The service has established links with colleagues in related specialties including clinical immunology, haematology, ID/microbiology and diabetology. In addition to the clinical experience offered by the post, there will be opportunities to attend regular respiratory educational meetings and to pursue teaching, quality improvement and research. Some experience in the management of adults with Cystic Fibrosis is desirable but not absolutely necessary. Salary level will depend on seniority and experience and will attract a Band 1A supplement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Potential applicants are advised to contact Dr William Flight or Dr Stephen Chapman on 01865 225713 to discuss the post and arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr William FlightJob titleConsultant in Respiratory Medicine &amp; Cystic FibrosisEmail addresswilliam.flight@ouh.nhs.ukTelephone number01865 225713&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Respiratory Medicine Department, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Clinical Fellow in Adult Cystic Fibrosis Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236450", "validThrough": "2020-11-18T23:59:59+0000"}