{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-06T15:46:48+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant Neurophysiologist&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Department of Clinical Neurophysiology is currently looking to recruit a highly skilled and motivated Consultant Neurophysiologist to complement our dynamic and diverse team. Barking, Havering &amp; Redbridge University Hospitals NHS Trust is home to the Regional Neuroscience Centre whereby you will be welcomed to join our esteemed colleagues in providing a gold standard service to our patients. &lt;br /&gt;The post holder will be actively encouraged and given the opportunity to develop subspecialty interests to compliment those of the current teams . We are seeking an enthusiastic and ambitious individual to help develop the service as well as continued high quality care for our patients.&lt;/p&gt;\n&lt;p&gt;Applicants must have a CCT in Clinical Neurophysiology, or be within 6 months of obtaining CCT. Full registration with the GMC is required&lt;/p&gt;\n&lt;p&gt;The Regional Neuroscience Centre is managed by an experienced team of specialised staff responsible for the care of patients from both within and outside of our local CCG as a dedicated tertiary provider. As a tertiary centre, we provide a fully established Clinical Neurophysiology diagnostic services for both inpatient and outpatient users. The Neurophysiology service also provides a consultant led intra-operative monitoring service to our Neurosurgical colleagues aiding in both cranial and spinal surgeries to ensure our patients receive safe, high quality care.&lt;/p&gt;\n&lt;p&gt;This is a wonderful opportunity for the ideal candidate to showcase their skills whilst working with a supportive and innovative team&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Nizar MuhammedJob titleConsultant NeurophysiologistEmail addressNizar.Muhammed@nhs.netTelephone number Contact No: 2069&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neurophysiology, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant Neurophysiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260456", "validThrough": "2020-12-06T23:59:59+0000"}