{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-19T13:01:58+0100", "description": "&lt;p&gt;This is a prime opportunity to join as Speciality doctor in Obstetrics and Gynaecology with exciting opportunity to undergo fully supported CESR training in our modern and forward thinking Foundation Trust which is a medium sized Trust with big ambitions. This post is suitable for candidates who want to work in a dynamic unit and wish to enhance their skills and experience in Obstetrics and Gynaecology. Suitable and interested candidates will be supported in completion of two ATSMs. We’re aiming to be in the top 10% for everything we do. We serve a population of over 420,000 people across South Yorkshire and North Nottinghamshire. We are also an Associate Teaching Hospital of the University of Sheffield and an Associate College of Sheffield Hallam University.&lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, dynamic and enthusiastic individual who is committed to team working to join an existing team in providing a comprehensive Obstetric and Gynaecology service. The successful applicant should possess MRCOG part-1 (or equivalent) and must have experience of at least 1 year at ST3 level in UK hospital. Applicants must have, or be eligible to hold, full registration with the General Medical Council and hold a Licence to Practise.&lt;/p&gt;\n&lt;p&gt;We aim to provide a world class Obstetric and Gynaecology service and there has never been a better time to become a key member in taking our committed team forward in achieving this success.&lt;/p&gt;\n&lt;p&gt;The Hospitals are perfectly positioned, with the major regional centres, Nottingham, Leeds and Sheffield on our doorstep and the Robin Hood International airport is in close proximity to the Trust with flights to Europe. There is access to delightful countryside in North Nottinghamshire, Derbyshire and Yorkshire with excellent leisure facilities and low cost housing.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Miss Manju Singh Job title: Clinical Director Email address: manju.singh@nhs.net Telephone number: 01302 642210&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Manju Singh, Clinical Director or Lauren Ackroyd, General Manager at Doncaster Royal Infirmary Tel (01302) 642210.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bassetlaw", "postalCode": "S81 0BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Specialty Doctor in Obstetrics and Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232390", "validThrough": "2020-11-16T23:59:59+0000"}