{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 PA inc. HCAS"}}, "datePosted": "2020-11-02T08:16:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Nursing Associates to work with Wandsworth Night Nursing Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an individual who is passionate about providing individualised, holistic care to patients in their own community and who wants to work in a well led Trust who are committed to the quality of care that we provide? Then come and join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and highly motivated Registered Nursing Associates to join our dynamic Night Nursing team in Wandsworth. We provide care to patients in their own homes, working closely with the multidisciplinary team to avoid hospital admission and ensure care needs of housebound patients are met. We aim to ensure quality is at the heart of everything we do to ensure we have well resourced, well-structured, thoughtful and efficient services run by staff that care passionately about the patients we serve.&lt;/p&gt;\n&lt;p&gt;We provide all out of hours nursing care for patients on our caseload, support with admission avoidance and work closely with local providers to enable patients to stay at home. We have high standards and support all of the team to grow, encourage everyone to be involved in quality and service improvement and are proud of the care that we provide.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This opportunity is open to Registered Nursing Associates from all professional backgrounds; however, knowledge of community nursing would be beneficial. Service specific training and support will be provided to successful candidates as well as access to trust wide training opportunities. If you have just qualified as a Nursing Associate and have a passion to work within community nursing then this is the perfect opportunity.&lt;/p&gt;\n&lt;p&gt;In this role you will be working with a team of committed individuals to make a true difference to the lives of those under our care. You will be providing care to a diverse population of patients. We aim to facilitate self-care for our patients, working in partnership with them to provide holistic care, manage long-term conditions and support health promotion using innovative activities and projects, enhancing patient experience.&lt;/p&gt;\n&lt;p&gt;We are looking for Nursing Associates who reflect our core Trust Values:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To put quality at the heart of everything we do,&lt;/li&gt;\n&lt;li&gt;Value our relationships with others,&lt;/li&gt;\n&lt;li&gt;Deliver services that we are proud of,&lt;/li&gt;\n&lt;li&gt;Make a positive difference in our communities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The location:&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Wandsworth Community Nursing Teams have three main hubs: Battersea Studios, Trident Business Centre and Tudor Lodge Health Centre. All bases have excellent transport links and good access to local shops, cafés and restaurants. This role will be based within Wandsworth Night Nursing Services at Trident in Tooting. We cover the whole Borough.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;As a Trust, we are committed to the health, wellbeing and development of our staff and we welcome committed, proactive and highly enthusiastic individuals who wat to develop themselves and their career in Community Healthcare. You will be working within a supportive environment with access to clinical supervision, excellent education and training opportunities through our CLCH Academy and opportunities to grow in your role. The Trust also offer excellent benefits including assistance with transport, accommodation, child care, parking and comprehensive pension and health care schemes. We also have a number of flexible shift patterns available to you, as well as the opportunity of working as part of the day or night teams.&lt;/p&gt;\n&lt;p&gt;If you would like to join our team and continue your career with CLCH, please don’t hesitate to contact us and we will be more than happy to talk you through any further details relating to this opportunity.&lt;/p&gt;\n&lt;p&gt;Just as we care about our patients’ wellbeing, we care about yours!&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A comprehensive induction into the community service followed by a local induction to introduce you to the role&lt;/li&gt;\n&lt;li&gt;Single occupancy accommodation in Central London – (we can help you find accommodation in London, support you with your deposit)&lt;/li&gt;\n&lt;li&gt;Support with gaining your driving license *T&amp;C’s apply&lt;/li&gt;\n&lt;li&gt;Car lease scheme *T&amp;C’s apply&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Annual travel card loan&lt;/li&gt;\n&lt;li&gt;Training, support and development in your career&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "L5 Wandsworth Night Nursing, London", "postalCode": "SW17 9SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4227", "longitude": "-.165498"}}, "title": "Nursing Associate – Twilight / Night Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251313", "validThrough": "2020-11-16T23:59:59+0000"}