{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-27T16:46:17+0000", "description": "&lt;p&gt;We are delighted to be able to offer an opportunity for a highly motivated, ambitious individual to join our team at Royal Lancaster Infirmary. If you’re the type of health professional who truly has the patient at the heart of everything you do and you want to work in a Trust that shares your values, then this might just be the perfect role for you.&lt;/p&gt;\n&lt;p&gt;Working as a Band 5 Physiotherapist you will rotate across a variety of clinical areas including; orthopaedics, medicine, stroke, elderly rehab and supported discharge. The role offers opportunities to work with teams across in-patient, out-patient and community settings. You will have the opportunity to develop your skills with support from experienced Specialist Physiotherapists. As experience is gained you will become part of the Physiotherapy on-call rota at the Royal Lancaster Infirmary.&lt;br /&gt;&lt;br /&gt;The University Hospitals of Morecambe Bay Foundation Trust (UHMBT) wants to provide sustainable high quality medical services that fit with the Better Care Together integrated model of care – high quality specialist hospital services wrapping around community based teams to deliver responsive specialist expertise within both acute hospital and community settings and helping to keep people well and to manage their long term conditions closer to home. We work as a multi-disciplinary team and you will have the opportunity to contribute to service improvement, helping to develop and improve our pathways of care for our patients.&lt;br /&gt;&lt;br /&gt;As a Trust we actively support you to develop your knowledge and skills via our Annual Development Review programme and you will have the opportunity to learn from a team of experienced Specialist and Advanced Physiotherapists. We offer a clinical in-service training programme and Band 5 Physiotherapy Peer Support group who meet monthly.&lt;/p&gt;\n&lt;p&gt;In addition to UHMBT being a Trust that is striving for excellence, the geographic location of the Trust has an amazing amount to offer. The Lake District, also known as The Lakes or Lakeland, is a mountainous region in North West England. It is famous for its lakes, forests, mountains and fells. The Lake District is home to a great variety of wildlife. The lakes and mountains combine to form impressive scenery, so if you are a hiker, mountain biker, fell walker or just enjoy being in the great outdoors then this is the place for you. You won’t just reap the professional rewards working for UHMBT. Based on the edge of the Lake District, we really do have it all - sensational views, educational opportunities for all ages, affordable housing, and easy access by road and rail to Manchester, Liverpool and beyond.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElizabeth LawJob titleInpatient Lead Physiotherapy Team ManagerEmail addresselizabeth.law@mbht.nhs.ukTelephone number01524516177Additional contact information&lt;/p&gt;\n&lt;p&gt;Elizabeth Law, Physiotherapy Team Manager/Clinical Lead Orthopaedics: Elizabeth.Law@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245482", "validThrough": "2020-11-10T23:59:59+0000"}