{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-10-23T09:16:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Community Mental Health Nurse or Occupational Therapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Crisis Resolution &amp; Home Treatment Team (CRHT) North West Sussex; based at Langley Green Hospital Crawley&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Full Time) – 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CRHT is part of acute care and works closely with the acute hospital and community teams to support clients in mental health crisis. It offers clients care and support in their own homes together with a day service group programme based at Langley Green Hospital as an alternative to hospital admission. CRHT are able to offer all the benefit of a hospital admission while remaining at home including home visits from our experience team, with support from doctors and psychology. We also facilitate supportive discharge from hospital and managing the transition back to community based services.&lt;/p&gt;\n&lt;p&gt;We are looking for mental health professionals who are flexible, motivated, dynamic and forward thinking. The team has an inclusive approach to managing the service and all staff are encouraged to put forward ideas to constantly evaluate and improve person- centered care of the highest quality. The CQC have rated us as good. Working in a multi-disciplinary team, the successful candidates will demonstrates skills in risk assessment skills and holistic care planning together with excellent communication skills.&lt;/p&gt;\n&lt;p&gt;As a team we are committed to career development and future aspirations and career goals are discussed openly and supported.&lt;/p&gt;\n&lt;p&gt;The service operates 7 days a week and there will be an expectation to work weekends and shifts, which would involve early and late shifts. You will also need to be a car driver to complete home visits.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Clare Stoneman&lt;/p&gt;\n&lt;p&gt;Job title Acute Care Service Manager&lt;/p&gt;\n&lt;p&gt;Email address clare.stoneman@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01293 590400&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Langley Green Hospital, Crawley", "postalCode": "RH11 7EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": "-.188818"}}, "title": "Community Nurse or Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239787", "validThrough": "2020-11-08T23:59:59+0000"}