{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-05T12:16:15+0100", "description": "&lt;p&gt;An opportunity has arisen due to recent centralisation of oesophago-gastric (OG) surgery in Great Manchester, for a Clinical Lead for Gastro-intestinal pathology based at Salford Care Organisation, part of The Northern Care Alliance. SRFT now provides for the surgical management of malignant and complex benign OG disease for the region’s 3.5 million population. In partnership with our oncology colleagues at The Christie Hospital, the service is now the largest of its kind in the United Kingdom, and one of the largest in Europe. The surgical unit undertakes approximately 160 OG cancer resections annually (in addition to resections for GISTs) and is also the tertiary referral centre for complex benign surgery. There is also currently underway a process of centralisation of upper GI endoscopic resection cases within our region which will result in a total of 140-180 cases being performed across NCA.&lt;/p&gt;\n&lt;p&gt;The post holder will be the lead for this expanding GI Pathology service covering both oesophageal/gastric and colorectal cancers and complex benign conditions and a large Intestinal Failure Unit. The surgical services and Centre MDT are hosted by Salford Care Organisation and NCA pathologists are responsible for all specialist pathology opinion for the Centre MDT and one of the sector MDTs. All resected oesophago/gastric pathology specimens are analysed and reported by the core specialist pathologists at Salford. Such a large, coordinated clinical service also enables clinical data collection on a large scale, which presents unrivalled opportunities for involvement in important clinical research, in conjunction with medical, surgical and oncology colleagues. We anticipate that the new unit in Salford has the potential to have a significant impact nationally and internationally, not only continuing to deliver excellent clinical outcomes for patients, but also delivering excellence in research, education, training and clinical innovation.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for a consultant Histopathologist to support the delivery and transformation of histopathology services particularly GI pathology across the NCA.&lt;/p&gt;\n&lt;p&gt;The Department is UKAS Accredited.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Putting your needs under the microscope&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to providing you with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A consultant team with clear vision for the continued success of their department&lt;/li&gt;\n&lt;li&gt;Support for your own personal development utilising our strong links with external stakeholders&lt;/li&gt;\n&lt;li&gt;A flexible approach to job planning that delivers a working environment to best suit you and your team&lt;/li&gt;\n&lt;li&gt;An opportunity for additional PA’s and coronial post mortem work&lt;/li&gt;\n&lt;li&gt;A workload that is distributed amongst the team using Royal College guidelines for Histopathology and Cytopathology departments&lt;/li&gt;\n&lt;li&gt;Opportunities to work with other local organisations to enhance your skills and experience&lt;/li&gt;\n&lt;li&gt;Participation and support with local and national clinical trials&lt;/li&gt;\n&lt;li&gt;Networking and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All new starters to these posts will be employed by Salford Royal NHS Foundation Trust and be on a Salford Contract.In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;Salford Royal has teamed up with housing association Salix Homes to provide a 26-apartment complex for doctors, nurses and other clinical staff new to the Trust. Please enquire upon appointment to review availability.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Stephen HayesJob titleConsultant HistopathologistEmail addressStephen.Hayes@srft.nhs.ukTelephone number0161 789 7373Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Stephen Hayes, Consultant Histopathologist on 0161 789 7373 or via email&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Stephen.Hayes@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Dr Sami Titi, Clinical Director for Cellular Pathology on 0161 656 1364 or via email:&lt;/p&gt;\n&lt;p&gt;Sami.Titi@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern Care Alliance, Salford and Oldham", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Consultant Gastro Intestinal Pathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212632", "validThrough": "2020-11-29T23:59:59+0000"}