{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc HCAS pro rata"}}, "datePosted": "2020-10-20T10:16:44+0100", "description": "&lt;p&gt;We have an exciting opportunity for a Home Treatment Team Highly Specialist Clinical Psychologist to work within our adult acute home treatment team.&lt;/p&gt;\n&lt;p&gt;The Home Treatment Team (HTT) provides crisis response and acute home treatment to service users with acute mental health problems with the aim of avoiding the need for the service user to be admitted to an acute mental health ward and / or to facilitate the early discharge from an acute mental health ward.&lt;/p&gt;\n&lt;p&gt;You will play a key role in the team, working closely with the Operational Manager, Consultant Psychiatrist and other senior team members. You will provide professional clinical psychology services to patients, act as a senior to support and empower the team to perform their roles including delivering reflective sessions, supervision, teaching as well as developing specific training to enhance the systematic provision of psychological interventions offered to service users, including the roll out of the Trauma Informed Approach across CNWL.&lt;/p&gt;\n&lt;p&gt;This is a part-time (2.5 days/18.75 hours per week) role based in a North West London borough including Brent, Harrow, Hillingdon, Kensington &amp; Chelsea, and Westminster. There is also an option to work across two boroughs as a full-time role (5 days/37.5 hours per week). Please indicate on your application your preference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We currently have a post within inner and Outer areas so high cost allowance (HCAS) will vary depending on base.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information, contact Kris Ho kris.ho@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kris Ho&lt;/p&gt;\n&lt;p&gt;Email address kris.ho@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 317 5370&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Borough Based, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Brent HTT Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233769", "validThrough": "2020-11-15T23:59:59+0000"}