{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum (plus 10% premia)"}}, "datePosted": "2020-10-15T09:49:18+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant in Emergency Medicine (with special interest options)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Are you looking for a &lt;strong&gt;different &lt;/strong&gt;Consultant Life?” Join us in The Lake District&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Cumbria is a unique place to work as a Consultant in Emergency Medicine! We are a team of specialists who provide care to patients in big towns and cities as well as remote and rural communities of the Lake District. We place a strong focus on sustainable careers with a good work-life balance.&lt;/p&gt;\n&lt;p&gt;We are an innovative group of 13 Consultants (10.6 WTE) who pride ourselves in delivering the best for our patients. We have rapidly modernised the local provision of Emergency Medicine over the last few years and consistently sit within the top third of performing Trusts. We pride ourselves in being “shopfloor” Consultants accessible, friendly and hands-on.&lt;/p&gt;\n&lt;p&gt;Your job will have variety and challenge delivering care between our two unique hospital sites. You will find a great balance of a busy extended Trauma Unit seeing a case mix of complex major trauma being distant from our Regional Major Trauma Centre and you will also work in a rural setting with the ability to develop extended clinical skills and lead an established composite workforce.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Cumberland Infirmary site &lt;/strong&gt;has annual footfall of approximately 55’000 pts per year (11,000 Paeds cases). The department has a co-located OOH GP service run by Cumbria Health On Call (CHOC). We run an active Clinical fellowship programme and our trainee ACP programme has received national acclaim. Three of the Consultants contribute to the NHS England Clinical Educator programme, and other Consultant interests include Paediatric Emergency Medicine, Pre-Hospital Emergency Medicine and Education/Simulation.&lt;/p&gt;\n&lt;p&gt;Its proximity to the mountains of the Lake District and major trunk motorways ensure a regular influx of trauma patients. The unit is a trauma + unit in the Northern Trauma Network. We have admitting rites for Major trauma patients with chest and head injuries who do not require MTC level care. The department accepts patients from various helicopter emergency medical schemes and has its own landing pad!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The West Cumberland Hospital&lt;/strong&gt; serves the rural Lake District population of West Cumbria. It has a newly purpose-built Emergency Department with excellent facilities. We see an annual attendance of around 39,000 patients (8,000 children) with a high acuity-mix of patients. The department is Consultant-led between 08:00 and 22:00 with a friendly team of Specialty Doctors, Deanery Trainee Doctors, Advanced Clinical Practitioners, Physicians Assistants and Nurse Practitioners. The Tea Trolley is always ready! We work very closely with Consultant colleagues in Acute Medicine, Surgery, Paediatrics, Critical Care and Obstetrics and Gynaecology to provide a rural integrated system of acute care. We have onsite primary care support and streaming through extended operating hours. The team have close links in delivering Fellowships in Pre-hospital Care, Retrieval Medicine and the Diploma in Mountain Medicine. A number of our colleagues work within Mountain Rescue Teams.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A unique time to join our team……….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have recognised that critically ill and injured patients in a remote and rural county such as Cumbria require special attention. The Emergency Medicine Team is collaborating with the Trust’s Anaesthetic &amp; ICU Teams and The Great North Air Ambulance Service to deploy an integrated “trauma-transfer and critical care retrieval service” in to our model. Clinicians with formal training or just enthusiasm in critical care, retrieval and pre-hospital medicine would all be particularly welcome, training will be provided for suitable candidates.&lt;/p&gt;\n&lt;p&gt;We have flexibility within our job plans to accommodate candidates with unique skill sets, so whether it’s Simulation, Research, Intensive Care, PHEM or Paediatrics we want you and will value your special interests.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about these exciting opportunities and to enquire about the posts further, please contact Dr Craig Melrose, Clinical Director for Emergency Care on 07764 535209&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation assistance of up to £8,000 may be available for successful applicants moving to the region.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle &amp; Whitehaven", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227584", "validThrough": "2020-11-11T23:59:59+0000"}