{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-11-04T15:46:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Care Coordinator/&lt;/strong&gt;&lt;strong&gt;CPN/Social Worker - Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At South West London and St George’s Mental Health NHS Trust our mission is “making life better together”.&lt;br /&gt;&lt;br /&gt;The Wandsworth community teams were re-organised and they are continuing to improve client care and facilitate a greater recovery focus. We now have 5 full time posts for Band 6 CPN/Care Coordinator to work in one 3 CMHTs based at Springfield Hospital and Queen Marys Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The CMHT provides a specialist Borough based mental health support and recovery service for adults (18-75) with more complex and longer term needs which, because of their seriousness or complexity, cannot be effectively treated within primary care. Clinical/professional judgement will determine priority for treatment and support, but in line with policy implementation guidance. They work in close partnership with GPs and other key partners, including voluntary organisations. Services are provided through a recovery and evidence based approach within the framework of the CPA.&lt;/p&gt;\n&lt;p&gt;The CMHT forms part of the pathway for mental health services for adults and their relatives/ carers which includes recovery, inpatient, crisis, and early intervention services. Our trust is committed to providing high quality health and social care for the local people with mental health problems in South West London.&lt;/p&gt;\n&lt;p&gt;We are committed to delivering exemplary service and have a strong culture of training and education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful applicant should be committed to high quality service provision with knowledge of psychosocial techniques, a desire to drive forward the social inclusion and recovery agendas, and understand and be committed to promoting and leadership, a high standard of patient care.&lt;br /&gt;&lt;br /&gt;The post holder will communicate and collaborate effectively with all agencies and agents involved in supporting adults with severe mental health problems.&lt;br /&gt;&lt;br /&gt;You will be part of the multi-disciplinary team, hold a designated caseload and be able to work independently. You will be expected to provide both generic healthcare specific assessments. You must have good personal organisational skills, be willing to work flexibly and able to supervise students on placements and Recovery Support Workers. &lt;br /&gt;&lt;br /&gt;You should have demonstrable skills of working with people who experience serious mental health problems, experience of working in a multidisciplinary team and experience of assessing and managing crisis for people with a severe mental illness. &lt;br /&gt;&lt;br /&gt;A car driver/owner is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sandie Belcher&lt;/p&gt;\n&lt;p&gt;Job title Clinical Service Lead&lt;/p&gt;\n&lt;p&gt;Telephone number 07789 176483&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, Tooting", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Care Co-ordinator/CPN/SW", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256489", "validThrough": "2020-11-11T23:59:59+0000"}