{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £30,401 - £37,267 p.a. (pro rata"}}, "datePosted": "2020-11-02T13:16:45+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Manchester Foundation trust (MFT) severe asthma service for a band 6 nurse based at Wythenshawe hospital and providing care within all the MFT sites. The severe asthma service is one of the leading national centres in the delivery of specialist severe asthma treatment and the successful recruit would be part of an established multi-disciplinary team who take pride in the excellent care that is delivered.&lt;/p&gt;\n&lt;p&gt;The role is centred around the care of the severe asthma patient, providing assessment, treatment, education and support to the patient, family and healthcare professionals aiming to provide the highest standards of care and quality of life for patients affected by this disease.&lt;/p&gt;\n&lt;p&gt;Prior knowledge and understanding of care and management of patients with respiratory diseases is essential. Applicants must be conscientious, highly motivated, forward thinking, demonstrate leadership skills, able to work within a fast-paced environment with a strong desire to provide the highest standards of care for the severe asthma patient. In return, a strong support network and comprehensive training package working alongside highly skilled nurses will be provided and we actively encourage growth and development of our employees through providing access to academic courses and conference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLeanne Jo HolmesJob titleLead CNS Severe AsthmaEmail addressleannejo.holmes@mft.nhs.ukTelephone number01612915026Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to become part of the team that pride itself on the care it delivers. Please do not hesitate to contact Leanne Jo Holmes or Kerry Hince on 0161 2915026 for further information or to arrange and informal visit.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M239LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Specialist Asthma Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252212", "validThrough": "2020-11-18T23:59:59+0000"}