{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-29T16:00:46+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;THE ROYAL UNITED HOSPITALS BATH NHS FOUNDATION TRUST&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;ONCOLOGY CONSULTANT EXPANSION PROGRAMME&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;With the development of our brand new Comprehensive Cancer Centre (The Dyson Cancer Centre) well underway we are significantly expanding our consultant body in preparation for the fantastic opportunities the new centre will bring. We are recruiting up to a further 5 new posts and are looking for enthusiastic and ambitious oncologists to join our cohesive and committed team. The expansion will be for 4 Clinical Oncologist and 1 Medical Oncologist posts with the following special interests to ensure a robust clinical service with protected time individuals to develop additional roles. &lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post 1 &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;10 PA Clinical Oncologist Breast and Skin Cancers &lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Post 2&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;10 PA Clinical Oncologist Head and Neck and Lung Cancers&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post 3&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;10 PA Clinical Oncologist Urological Cancers and Neuro-Oncology &lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Post 4 &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;10 PA Clinical Oncologist Colorectal Cancers and Lymphoma Radiotherapy&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Post 5&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;10 PA Medical Oncologist Upper GI and Gynaecological Cancers &lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;You will be joining a dynamic, friendly and cohesive team of oncologists who have a high profile with many national research and organisational roles. We are also very happy to discuss flexibility of the tumour sites covered in each role.&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Why choose us?&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The new Dyson Cancer Centre will be architecturally and functionally unique with a major focus on the positive impact of the aesthetic and environment on patient and staff experience. The current Cancer Centre already provides comprehensive in and outpatient specialist services for most cancers with close links to Bristol for the treatment of rare cancers for our population of 500,000. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is an exceptionally strong research ethos both within the clinical trials unit and through Cancer Research at Bath University (CR@B) with Bath consistently among the top recruiters for national trials as well running a number of local investigator-led studies. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Provision of radiotherapy with VMAT, IGRT and Varian RPM is standard of care for with plans for implementation of new technical radiotherapy including SABR delivery in the near future. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our most recent outstanding rating for end of life and palliative care reflects the excellent patient-centered care delivered throughout the Trust and our award-winning comprehensive Acute Oncology Service continues to evolve to meet changing practice and demand. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a dedicated on site PET-CT scanner with engaged radiologists enthusiastic to implement new technologies and procedures in diagnostics radiotherapy planning and trials. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are consistently rated excellent for training from the Severn Deanery Clinical Oncology registrars to core medical trainees rotating through our department. The RUH was ranked 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; in last years &lt;/span&gt;&lt;span&gt;GMC National Trainee Survey and is ranked 1&lt;/span&gt;&lt;span&gt;st&lt;/span&gt;&lt;span&gt; in the GMC National Trainer Survey across South West acute trusts. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you want to balance these professional opportunities with quality of life then Bath has it all; a beautiful and historic World Heritage City with a wealth of cultural and leisure opportunities, some of the best state and independent schools in the UK, whilst only 1 hour from London and on the doorstep of the beautiful and diverse southwest countryside and beaches. Come and see for yourself. An attractive relocation package is attached to this post, as well as reduced outpatient clinic commitment and mentoring for new consultants in the first year.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For Further Information and to arrange a visit please contact:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Prof Mark Beresford Clinical Oncologist (clinical lead) 01225 824797.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Clinical Oncology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248971", "validThrough": "2020-11-19T23:59:59+0000"}