{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 equivalent"}}, "datePosted": "2020-11-02T11:08:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Radiographer | CT and X-ray | Band 6 equivalent  | Hove | training and development opportunities available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Montefiore Hospital is recruiting for a skilled and experienced CT and X-ray trained Senior Radiographer to join their friendly team. The Radiology team plays a vital role in providing excellent patient outcomes. The successful applicant will be rewarded with advancement opportunities and an interesting and varied role.&lt;/p&gt;\n&lt;p&gt;The Spire Montefiore Hospital in Hove is rated “Outstanding” by the Care Quality Commission (CQC). We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, cardiology and general surgery all delivered through our expert and caring clinical team. The hospital is well positioned to maximise the excellent local public transport. There are buses that stop in the vicinity and is also walking distance of both Hove and Brighton train station&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll work collaboratively to deliver a high quality, professional radiographic service that adapts in line with new technologies and clinical developments&lt;/li&gt;\n&lt;li&gt;Make sound considered judgements and informed decisions on the imaging required and then provide highly skilled and specialised imaging for patients&lt;/li&gt;\n&lt;li&gt;Team working is a big part of this role, so successful working relationships with our Nurses, Physiotherapists and expert Consultants will be a defining factor in delivering the outstanding patient care we are proud of&lt;/li&gt;\n&lt;li&gt;Participate in audit, hospital wide focus groups and IRMER QA programmes.&lt;/li&gt;\n&lt;li&gt;In this role you will find you can quickly build your clinical knowledge by working closely with fellow clinicians and some of the best regional consultants&lt;/li&gt;\n&lt;li&gt;Play your part in delivering clinical leadership and education to the team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current HCPC registration, UK based experience and a Degree in Radiography or its equivalent is essential as is experience in CT, plain film imaging, fluoroscopy, operating theatres and imaging intensifier&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please email Sherine Lowers @ sherine.lowers@spirehealthcare.com &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN3 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8318", "longitude": "-.154902"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251718", "validThrough": "2020-12-02T23:59:59+0000"}