{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-11-06T15:30:51+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic Community Nursery Nurse to work with a dynamic and friendly team of Health Visitors. NNEB, Diploma in Childcare and Education (CACHE) or NVQ Child Care Level 3 Qualification is required. &lt;br /&gt;&lt;br /&gt;This is a fixed term position for a year (which may be able to be extended) to cover maternity leave) is based in Chichester House, High Wycombe, working full time (37.5 hours per week). The role is one of support for a health visiting team who work with a diverse community delivering the Healthy Child programme, this includes Developmental reviews, Breastfeeding Support, Child Behaviour Management, Sleep, and Nutrition. &lt;br /&gt;&lt;br /&gt;You will be offered a variety of training opportunities as well as on-going support to enable you to develop your existing skills and knowledge to support and advise families &lt;br /&gt;&lt;br /&gt;We are looking for excellent communication skills to enable you to work confidently with colleagues, partners in the community, children and their families.&lt;br /&gt;&lt;br /&gt;The successful applicant must have a professional attitude, ability to be open to change and quick to learn new ways of working. &lt;br /&gt;&lt;br /&gt;Basic IT skills required and an ability to travel essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Mayger Locality Lead 07976597991&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eden Health Visitors office Wycombe Hospital High Wycombe, High Wycombe", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Community Nursery Nurse - SCPHN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260377", "validThrough": "2020-11-20T23:59:59+0000"}