{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc"}}, "datePosted": "2020-10-28T14:31:11+0000", "description": "&lt;p&gt;Major Trauma, Acute Orthopaedics and Plastics, Valentine Ellis Ward, St Mary’s Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Nurse Band 5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Expand your nursing skills within a supportive team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“There’s a lot of laughter and the whole team supports each other. It’s not about wanting to be the best, it’s about always giving the best, and I’m really proud of what we do every day.” &lt;/strong&gt;&lt;em&gt;Petrina Linehan, Matron, Valentine Ellis Ward&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This is the perfect ward to expand your nursing skills as part of a highly capable team where you’re guaranteed opportunities to learn and develop.&lt;/p&gt;\n&lt;p&gt;We are a dynamic team that specialises in the acute management of surgical patients following traumatic and often life changing injuries. Our diverse group of patients includes those requiring acute management following major trauma, orthopaedic and plastic surgeries.&lt;/p&gt;\n&lt;p&gt;Our multidisciplinary approach ensures exceptional clinical care to patients, including those with head and spinal cord injuries. The work is fast paced, but with a fantastic team dynamic in place it is also a fun environment to be in. Our patient feedback is excellent and we were proudly awarded a gold ward accreditation in 2017 – a testament to the quality of work we do.&lt;/p&gt;\n&lt;p&gt;Your career goals are important to us and we believe in supporting our staff to develop the career that’s right for them. Our team members have an excellent track record for career progression into more senior nursing roles. We offer strong support networks for preceptorship, mentorship and professional development to ensure you get the very best from your career with us.&lt;/p&gt;\n&lt;p&gt;We welcome applications from both experienced and newly qualified nurses. We also have a very supportive environment for overseas nurses who are joining the NHS for the first time.&lt;/p&gt;\n&lt;p&gt;Fast forward your nursing career by joining our specialist team in the acute trauma, orthopaedic and plastics ward at St Mary’s Hospital. With five world-renowned hospitals, Imperial College Healthcare NHS Trust is full of opportunity for nurses who are starting out in surgical care or looking to develop new skills, get involved in quality improvement and collaborate with leading surgical teams.&lt;/p&gt;\n&lt;p&gt;Benefits include opportunities for career development, flexible working and wellbeing, plus a staff recognition scheme. Also, take advantage of optional benefits including the cycle to work and car lease schemes, season ticket loan or membership options for onsite leisure facilities.&lt;/p&gt;\n&lt;p&gt;All of our hospitals have quick transport access to the Westfield shopping and leisure centre, the West End and a range of local bars, cafes and restaurants - ideal for team socials!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more details or to arrange an informal visit, please contact &lt;strong&gt;Keltia Araujo De Leon, Ward Matron on 020 3312 6234 or email keltia.araujodeleon@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 5 Staff Nurse - Major Trauma, Acute Orthopaedics and Plastics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246990", "validThrough": "2020-11-08T23:59:59+0000"}