{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18005", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 Per Annum"}}, "datePosted": "2020-10-23T11:01:56+0100", "description": "&lt;p&gt;Southend University Hospital NHS Foundation Trust is looking for a Cardiographer.&lt;br /&gt;&lt;br /&gt;We are a busy department who are able to provide a wide range of investigations for both Cardiology and Respiratory, and are looking for someone a motivated individual to join our existing team in our expanding department. &lt;br /&gt;&lt;br /&gt;We have a dynamic and inter professional cardiology team consisting of 6 Consultant Cardiologists who offer a wide range of invasive and non-invasive services across the cardiac spectrum to our local community. &lt;br /&gt;&lt;br /&gt;The cardiographer&#39;s role covers performing of 12 lead ECG&#39;s, the fitting of a variety of ambulatory monitors and performing spirometries. The postholder will perform the various tests within the cardiology department including.&lt;br /&gt; Perform routine E.C.G. recordings.&lt;br /&gt; Perform 24 hour ambulatory monitoring including programming, downloading on to a computer, fitting and removing.&lt;br /&gt; Performing R.Tests and 24 hour blood pressure monitoring including&lt;br /&gt;programming, downloading on to a computer, fitting, and removal.&lt;br /&gt;&lt;br /&gt;You will also be expected to visit Satellite Clinics, enter patient demographic data and clinical information onto the Cardiac Database and assist Clinical Physiologists in preparation of the patient for advanced investigations.&lt;br /&gt;&lt;br /&gt;To be successful in this post you should be self-motivated, well organised and demonstrate excellent interpersonal skills. For this role, previous hospital experience would be an advantage but not necessary.&lt;br /&gt;&lt;br /&gt;On the job training will be given to the most appropriate candidate.&lt;br /&gt;&lt;br /&gt;Our philosophy is to deliver an excellent standard of patient focused care in line with NICE guidelines, National Service Frameworks and evidence based practice.&lt;br /&gt;&lt;br /&gt;This is a part time permanent post of 30 hours per week. Please see attached job description.&lt;br /&gt;&lt;br /&gt;At Southend Hospital NHS Trust we strongly believe in patient care and want to attract like-minded people to help build and maintain a supportive and enjoyable place to work. We have set our trust values to reflect our passion for patient care; we believe ‘Care with Compassion, Working Together and being Professional and Accountable’. &lt;br /&gt;&lt;br /&gt;If you are interested in the role and believe you hold the qualities we require then apply today!&lt;br /&gt;&lt;br /&gt;***Previous applicants need no apply***&lt;br /&gt;&lt;br /&gt;Please note the advert may close early if we receive a high volume of applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaty DonaldsonAdditional contact information&lt;/p&gt;\n&lt;p&gt;Katy Donaldson on: 01702 435555 ext 8209or katy.donaldson@southend.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend Univeristy Hospital NHS Foundation Trust, Wescliff-on-Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Cardiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240197", "validThrough": "2020-11-06T23:59:59+0000"}