{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-26T08:25:07+0000", "description": "&lt;p&gt;We are looking for a qualified mental health nurse (RMN) to work at the heart of our multi disciplinary Community Mental Health Service in the beautiful coastal town of Minehead, to engage with service users, and their families and carers, in a focussed and therapeutic way.&lt;/p&gt;\n&lt;p&gt;We have significant additional investment in our mental health services in Somerset as a trailblazer site for the Community Mental Health Framework, so that we can offer an excellent service to people with mental health difficulties ensuring that people can have the right help at the right time in the right place.&lt;/p&gt;\n&lt;p&gt;As part of this expansion in our provision, we are developing a comprehensive package of training and supervision for all our staff in CMHS. Regardless of where you are in your career, we are confident that we can offer opportunities for you to develop your clinical skills and knowledge. We will ensure you have all the core skills you need to confidently build relationships with our service users in order to best create and deliver an effective and personalised treatment plan with them.&lt;/p&gt;\n&lt;p&gt;Alongside these core skills, you may be interested in offering psychological interventions, from brief clinical interventions through to specific psychological therapies, such as CAT, CBT or DBT. In this case we can either enable you to utilise your existing skills in this area and/or we can offer the chance to train in these approaches. There will also be opportunities to develop skills in non medical prescribing and other areas, as appropriate to your needs and interests.&lt;/p&gt;\n&lt;p&gt;We are excited to welcome you to the team, and provide you with the support and training that will make you want to stay with us.&lt;/p&gt;\n&lt;p&gt;Minehead is the Gateway to Exmoor and attracts visitors to it&#39;s coastal location. With beaches to explore, a fishing quarter and historic harbour, a 14th Century church and easy access to dramatic moorland and coastal walking paths, there is plenty to explore!&lt;/p&gt;\n&lt;p&gt;You are welcome to contact us for an informal discussion about the post, please contact Michael French, Team Manager on 01643 701735 or 07879 661811 or Tracy Jardine, Operational Service Manager on 07825 844202&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnfield Unit, Minehead", "postalCode": "TA24 6DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2022", "longitude": "-3.46432"}}, "title": "Community Mental Health Nurse, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241754", "validThrough": "2020-11-09T23:59:59+0000"}