{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-10-20T11:46:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Radiographer in Palliative Radiotherapy &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent – 37.5 hours per week – Band 8a (£40,028 to £48,034 pa pro rata) moving to 8b (£47,092 to £58,217) once fully trained. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Clatterbridge Cancer Centre NHS Foundation Trust is one of the UK’s leading providers of non-surgical cancer treatment, caring for a population of 2.4 million people across Cheshire &amp; Merseyside, North Wales, the Isle of Man and parts of Lancashire.&lt;/p&gt;\n&lt;p&gt;Our flagship specialist cancer hospital in Liverpool opened in June 2020, supported by our hospital on the Clatterbridge Health Park in Wirral providing outpatient cancer treatment and supportive care, and our radiotherapy treatment centre on the Aintree Hospital site. &lt;br /&gt;&lt;br /&gt;Together, working across three sites and operating specialist chemotherapy clinics in four of Merseyside’s district hospitals, we are able to deliver a comprehensive range of inpatient care, advanced radiotherapy, chemotherapy and other systemic anti-cancer therapies including gene therapies and immunotherapies. We also deliver a pioneering Treatment at Home and Work service; are the only facility in the UK providing low-energy proton beam therapy to treat rare eye cancers and host the region’s Teenage and Young Adult Unit, (supported by the Teenage Cancer Trust).&lt;/p&gt;\n&lt;p&gt;Working with leading experts from The University of Liverpool and the Cancer Research UK Liverpool Cancer Trials Unit we strive to stay at the forefront of novel treatments and techniques to deliver more effective and personalised treatments than ever before.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Department at The Clatterbridge Cancer Centre have recently developed and trained 6 radiographers to Consultant level (2 Breast, 2 Prostate, 1 Lung and 1 Palliative). The Radiation Services Directorate has demonstrated the successful introduction and proven benefit of Consultant radiographers in to the Trust over the last couple of years.&lt;/p&gt;\n&lt;p&gt;The palliative service has grown and developed under the leadership of our existing Consultant Radiographer and in order to support further development of the service and increase resilience we have managed to secure funding for a further Palliative Consultant radiographer This new consultant role will be pivotal in developing our first class cancer service and the post holder will be fully supported during training and in their future practice.&lt;/p&gt;\n&lt;p&gt;The post holder will be provided with the necessary training to be able to provide a comprehensive therapeutic radiographer consultant service for patients requiring palliative radiotherapy, improving service delivery to this group of patients. The successful candidate will be a highly experienced radiographer and be able to work autonomously with the ability to assess and manage their own daily workload of patients to ensure the provision of the highest standards of care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to act as an expert resource for patients receiving palliative radiotherapy treatment and further develop a team approach with the Medical &amp; Clinical Oncologists&lt;/p&gt;\n&lt;p&gt;We’re here to deliver the best cancer care to the people we serve and are looking for applications from those who share that commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would normally encourage those considering applying to visit the department. However, due to the current restrictions and local lockdowns due to COVID, we would recommend you contact one of the names below to provide you with further information via email, phone or Microsoft teams. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Clatterbridge Cancer Centre NHS Foundation Trust &lt;/em&gt;&lt;em&gt;is committed to safeguarding and promoting the welfare of children, young people and adults and expects all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We take an active responsibility for &lt;/em&gt;&lt;em&gt;ensuring systems, policies and processes are in place to safeguard children, young people and adults. We support the national and local safeguarding agenda, including local arrangements for the protection of children young person and adults at risk.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This job is unlikely to attract a Tier 2 Certificate of Sponsorship (formerly a work permit). Applications from candidates who require Tier 2 immigration status to work in the UK may not be considered if there are a sufficient number of other suitable candidates. To apply for a Tier 2 Certificate of Sponsorship, employers need to demonstrate that they are unable to recruit a resident worker before recruiting an individual overseas. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Kieran Woods, Business and Clinical Development Manager for Radiotherapy on 0151 556 5073 or via kieranwoods@nhs.net or Julie Massey, General Manager of Radiation Services on 0151 556 5831 or Palliative Consultant Radiographer, Conor Fitzpatrick via conor.fitzpatrick@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKieran WoodsJob titleBusiness and Clinical Development ManagerEmail addresskieranwoods@nhs.netTelephone numbercontact by email or M teamsAdditional contact information&lt;/p&gt;\n&lt;p&gt;Also please contact Conor Fitzpatrick conor.fitzpatrick@nhs.net or Julie Massey julie.massey@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121459.png", "name": "The Clatterbridge Cancer Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121459"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ClatterbridgeCancer Centre Liverpool, Liverpool", "postalCode": "L7 8YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4087", "longitude": "-2.96503"}}, "title": "Consultant Radiographer in Palliative Radiotherapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234217", "validThrough": "2020-11-14T23:59:59+0000"}