{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29333", "minValue": "28577", "unitText": "YEAR", "value": "£17 - £17.45 p/h (DOE) + Enhancements + £4,000"}}, "datePosted": "2020-10-22T09:30:45+0100", "description": "&lt;p&gt;We are looking for a confident&lt;strong&gt;Clinical Practice Leader&lt;/strong&gt;who can inspire, support and oversee the delivery of the very best care.&lt;/p&gt;\n&lt;p&gt;You’ll be working 38.5hours a week, based at&lt;strong&gt;Cygnet Beckton&lt;/strong&gt;to work&lt;strong&gt;Hansa Ward&lt;/strong&gt;, our Female Mental Health with Learning Disabilities Ward.&lt;/p&gt;\n&lt;p&gt;Cygnet Hospital Becktonis a smoke free gender specific hospital for women with complex mental health needs. We accept emergency and planned, pre-assessed admissions. We provide a multi-disciplinary approach, to help service users return home as quickly as possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the hospitals through clinical practice development and quality improvement.&lt;/li&gt;\n&lt;li&gt;Have a lead responsibility in undertaking regular audits of care through monitoring and analysis of documentation, assessment and observation of the lived experience of patients.&lt;/li&gt;\n&lt;li&gt;Work with the Clinical ServiceManager to deliver targeted intervention where themes, trends and lessons learnt indicate a need for skills development.&lt;/li&gt;\n&lt;li&gt;Work within services focusing on the development of nursing practice, through clinical leadership, coaching and mentoring.&lt;/li&gt;\n&lt;li&gt;Be responsible for a planned programme of support across your area of focus as determined by the annual plan for Quality and Compliance.&lt;/li&gt;\n&lt;li&gt;Be an active member of clinical working committees relevant to role.&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge &amp; promote nursing&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals.&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;£17.00 - £17.45 per hour depending on experience + Enhancments and £4,000 location package&lt;/li&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Plus many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have…&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experienced Registered Mental Health Nurse (RMN) or Registered Learning Disability Nurse / RNLD with a current Pin Number (at least 2 years’ post qualification experience.&lt;/li&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;Well informed of the Mental Health Act 1983 &amp; have an understanding of latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to deputise in a clinical lead role&lt;/li&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;li&gt;Ward specific experience e.g. Learning Disabilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt;has been providing a national network of high quality specialist mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Beckton&lt;/strong&gt;provides a robust programme of care for women with challenging high risk behaviour who experience difficulties with engagement or motivation with therapeutic programmes. We aim to meet the needs of these women, who may have had previous inappropriate placements, in a less restrictive setting.&lt;/p&gt;\n&lt;p&gt;The hospital is split into four distinct wards, each offering specialist mental health services:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hooper Ward - Female PICU&lt;/li&gt;\n&lt;li&gt;New Dawn Ward - Female Tier 4 Personality Disorder Service&lt;/li&gt;\n&lt;li&gt;Upping Ward - Personality Disorder, Intensive Support Service for Women&lt;/li&gt;\n&lt;li&gt;Hansa Ward - Mental Health and Learning Disabilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Hansa Ward&lt;/strong&gt;at Cygnet Hospital Beckton is a high dependency complex care service for women with learning disabilities, associated complex needs and who may have behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beckton", "postalCode": "E6 6ZB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5138", "longitude": ".064697"}}, "title": "Clinical Practice Leader - Female Learning Disability (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237698", "validThrough": "2020-11-22T23:59:59+0000"}