{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T08:16:56+0000", "description": "&lt;p&gt;Are you a communications professional who wants to improve the way we share information about research with the public and across research infrastructures? Could you deliver an existing effective internal and external communications service in a complex, diverse and challenging environment? If so, you could be the person we are looking for to join a forward thinking organisation whose aim is to maximise opportunities for members of the public and healthcare staff to take part in clinical research, making the North East and North Cumbria the best place to deliver clinical research in the NHS.&lt;/p&gt;\n&lt;p&gt;The Newcastle upon Tyne Hospitals NHS Foundation Trust is seeking to appoint an enthusiastic and committed Communications Officer on behalf of the National Institute for Health Research Clinical Research Network North East and North Cumbria (NIHR CRN NENC). The Communications Officer will promote the benefits of clinical research and will support a comprehensive communications function for our healthcare partners and members of the public across the NIHR CRN NENC region.&lt;/p&gt;\n&lt;p&gt;As a member of the Engagement Team, working alongside Patient and Public Involvement and Engagement (PPIE) and other communications professionals, the post holder will manage promotional campaigns for brand marketing and engagement, and ensure reputation management for the NIHR CRN NENC. This work will include liaison with other NIHR partners and a wide range of stakeholders, to ensure a consistent and joined up approach to communication and PPIE activities across all areas of activity. Regular travel across the region is expected.&lt;/p&gt;\n&lt;p&gt;The NIHR CRN NENC invites applications from people who have excellent interpersonal, communication and presentation skills and the ability to drive innovation or novel ideas across organisational boundaries. The successful applicant will also need to illustrate how they manage time effectively, prioritise work and demonstrate the ability to deliver results consistently to tight timelines, with minimal supervision.&lt;/p&gt;\n&lt;p&gt;Essential requirements include a higher-level qualification (degree or equivalent) or an equivalent level of experience, extensive experience of working within a communications function, project management skills and experience. The post holder will also require experience of working in a digital environment, as the role includes development and promotion of a range of digital media communications, including video, twitter, Facebook and website content.&lt;/p&gt;\n&lt;p&gt;Full Time 37 hours 30 minutes/week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Justine Smith&lt;/p&gt;\n&lt;p&gt;0777 501 2050&lt;/p&gt;\n&lt;p&gt;Justine.smith@nihr.ac.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 Regent Point", "postalCode": "NE3 3HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0111", "longitude": "-1.63016"}}, "title": "LCRN Communications Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258883", "validThrough": "2020-11-19T23:59:59+0000"}