{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-07T13:01:02+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Emergency Surgery Consultant&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Emergency Surgery&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Milton Keynes&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£82,096 - £110,683 per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Programmed Activities: &lt;/strong&gt;10&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Programmed Activities:&lt;/strong&gt; 2&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited to apply for a Consultant in Emergency Surgery at Milton Keynes University Hospital NHS Foundation Trust for a substantive post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is replacement offering 10 programmed activities. 2 Additional programmed activities will be available, but these are subject to annual discussion and agreement and do not form part of the underlying contractual agreement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The General Surgery CSU consists of 16 Consultants, 1 Associate Specialist, 9 Specialty Doctors, 4 ST trainees, 4 CT/FY2/ SHO and 12 FY1s.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a permanent post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have full GMC Registered Qualification, a Medical Degree and FRCS or equivalent. The candidate will be able to manage workload autonomously as an Emergency Surgeon and participate on the General Surgery on call Rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to participate in teaching both under and postgraduate students associated with the University of Buckingham and will also be expected to support colleagues doing these activities as part of his or her arranged job plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Milton Keynes University Hospital NHS Foundation Trust, in partnership with the University of Buckingham, is a University Teaching Hospital. This allows us to attract, train and retain the best doctors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital is the premier teaching hospital for the newly created University of Buckingham Medical School. The first students will graduate in 2019 and currently all years of medical students are being taught at the hospital. There are significant opportunities in the field of medical education both in the delivery and organisation of teaching. A teaching and research background would be highly advantageous when applying for this position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We believe the continued growth of the hospital will allow us to expand and improve our services to offer the very best care to the people of Milton Keynes, and beyond.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Located just 50 miles north of London, Milton Keynes has excellent access to the capital whilst being centrally located for Oxford and Cambridge and having ease of access to the north. Lying in attractive countryside, Milton Keynes offers first class facilities for sport, theatre, music, shopping and dining.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Doctors considering an application are encouraged to visit the hospital and to meet with potential clinical colleagues. The Chief Executive and/or Medical Director would also be happy to meet with doctors interested in this role, commitments allowing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information please contact our Consultant Emergency Surgeons:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Krystian Pawelec on 01908997514 or Mr Mihai Paduraru on 01908 996666&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please submit your CV by attaching it to your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for receipt of applications: 08th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We reserve the right to close posts early if we receive a sufficient volume of applications. Unfortunately, only shortlisted applicants will be contacted.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service Check.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and welcome applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;Milton Keynes is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that full GMC registration and license to practice is an essential for this role. If you do not currently have GMC registration, but you are in the process of applying, please use the supporting information section of the application form to provide an update about the status of your &lt;/em&gt;&lt;em&gt;GMC application. Candidates &lt;/em&gt;&lt;em&gt;without GMC registration at the time of shortlisting will not be considered. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates wishing to discuss more details of the post, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Nikolaos Makris&lt;/p&gt;\n&lt;p&gt;CSU Lead for General Surgery 01908 997240&lt;/p&gt;\n&lt;p&gt;Nikolaos.Makris@mkuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Krystian Pawelec&lt;/p&gt;\n&lt;p&gt;Clinical Lead for Emergency Surgery 01908 997514&lt;/p&gt;\n&lt;p&gt;Krystian.Pawelec@mkuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Mihai Paduraru&lt;/p&gt;\n&lt;p&gt;Emergency Surgeon and Rota Lead 01908 996666&lt;/p&gt;\n&lt;p&gt;Mihai.Paduraru@mkuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "General Surgery - Med Staff (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Consultant in Emergency Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216593", "validThrough": "2020-11-08T23:59:59+0000"}