{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 - £31,365 - £37,890"}}, "datePosted": "2020-11-04T12:31:38+0000", "description": "&lt;p&gt;Are you a band 6 nurse looking to work in an environment that develops your knowledge, leadership skills and experience?&lt;/p&gt;\n&lt;p&gt;If you have answered yes to this question, then I believe that Maple Ward @Meadowfield is the right place for you.&lt;/p&gt;\n&lt;p&gt;Meadowfield is an acute mental health hospital in Worthing, we are part of Sussex Partnership NHS Foundation Trust, recently awarded Good by the CQC, with Outstanding in the caring Domain.&lt;/p&gt;\n&lt;p&gt;We are an open unit, and our open doors are something that we are very proud of and this brings a very different feel to the unit than those that are not able to use this approach.&lt;/p&gt;\n&lt;p&gt;Maple Ward is an exciting, vibrant environment to work within, and also has our health based place of safety (136 suite) attached to it. We are looking for 4, Band 6 nurses to be based on Maple Ward and to also have responsibility for providing cover to our 136 suite, which will involve co-ordinating MHA assessments, liaising with Sussex Police, the approved mental health practitioner teams, and the local community mental health teams with regards to section 136 and Section 135 Mental Health Act assessments. The role would involve rotation between Maple Ward itself, and the 136 suite which has two members of staff allocated to provide cover at all times when this is occupied.&lt;/p&gt;\n&lt;p&gt;Shifts within the suite, and whilst working on the ward, follow a 12 hour shift pattern and we can offer a flexibility with both day and night shifts.&lt;/p&gt;\n&lt;p&gt;You would be supported to engage with the emerging leaders course, encouraged to seek additional development opportunities and training, alongside regular supervision from the leadership team, as well as providing senior nurse input on the ward and supporting our nurses and nursing assistants We are also very keen to embrace further quality improvement projects here at Meadowfield, and have some projects up and running already, but we are keen for further ideas to be explored and for nurses to lead on these. We will also support staff to complete nurse prescribing and attain Associate clinician status alongside other relevant opportunities.&lt;/p&gt;\n&lt;p&gt;We would like to create an environment where service users, nurses, nurse associates, nursing assistants and carers are all leaders and actively involved in making decisions about our services.&lt;/p&gt;\n&lt;p&gt;And we would like you to be a part of our team during these exciting times.&lt;/p&gt;\n&lt;p&gt;This post offers The Trust&#39;s Golden Hello for band 5 or 6 Nurses, or a Relocation package up to a maximum of £2000. (subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;James Peters&lt;/p&gt;\n&lt;p&gt;Matron for Maple and Rowan ward @ Meadowfield Hospital&lt;/p&gt;\n&lt;p&gt;Sussex Partnership NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Tel: 03003040672&lt;/p&gt;\n&lt;p&gt;Mobile: 07391016398&lt;/p&gt;\n&lt;p&gt;james.peters@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Meadowfield, Worthing", "postalCode": "BN13 3EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8412", "longitude": "-.411136"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255863", "validThrough": "2020-11-18T23:59:59+0000"}