{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-04T08:16:50+0000", "description": "&lt;p&gt;We are seeking a Band 6 Occupational Therapist  within one of our adult female acute mental health in-patient wards. Lavender Ward is a 16 bedded female acute admission ward.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to work in to develop valuable wider skills – managing multidisciplinary group of staff, co-ordinating and leading within the ward, clinical decision making, involved in various professional generic roles, projects and service. This could be a stepping stone to your own career development.&lt;/p&gt;\n&lt;p&gt;Each of our wards is staffed by a full time Band 6 and Band 5 occupational therapist who work closely together. Band 6 occupational therapists need to possess a thorough understanding of the priorities for occupational therapy within an acute in-patient setting and be able to articulate this clearly in practice. They must also be able to demonstrate high levels of skill in assessment and delivering therapeutic interventions. The occupational therapy service operates according to the Model of Human Occupation, and experience of this would be an advantage.&lt;/p&gt;\n&lt;p&gt;The post will also mean, you will be  a deputy ward manager. You will be expected to supervise a small amount of staff, which you will show and demonstrate your leadership and management skills, along with the wider team. During this time you will be supported by ward manager.&lt;/p&gt;\n&lt;p&gt;The service users we care for often have complex mental health needs, and at times may display challenging behaviour. Therefore, the post holder will be required to demonstrate a range of skills including effective communication, empathy, self-awareness, and critical self-reflection skills. Knowledge and experience of looking after patients with personality disorder diagnosis will be helpful.&lt;/p&gt;\n&lt;p&gt;Our occupational therapy staff are fully integrated members of the ward teams so for the  post you are expected to work shift patterns that include early , late and long day  shifts to provide an 5 day service over 7 day period and will be included into the ward shift numbers for a proportion of the week.&lt;/p&gt;\n&lt;p&gt;We can offer a wide occupational therapy support network with professional structures in place to provide supervision and CPD opportunities. This provided by the Lead OT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jennifer Johnson&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address jennifer.johnson11@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0121 301 5300&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "lavender ward, Birmingham", "postalCode": "B11 4HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.86717"}}, "title": "Band 6 Occupational Therapist - Lavender", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255075", "validThrough": "2020-11-19T23:59:59+0000"}