{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32640", "minValue": "32640", "unitText": "YEAR", "value": "Up to £32,640 per annum DOE"}}, "datePosted": "2020-10-21T01:01:51+0100", "description": "&lt;h2&gt;&lt;strong&gt;Are you looking to further your career within the prison setting?&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Or&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Are you looking for a change in your nursing career?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Are you looking for a challending and rewarding role with career development? Then look no further...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health / wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This role is available at our HMP YOI Drake Hall site, Eccleshall, which is both a Young Offenders Institute (18–21 years) and Adult female prison with a diverse range of nursing needs. Drake Hall currently holds a maximum of 340 sentenced prisoners. This brings a great opportunity to embrace change and embed culture. The role will be an experience like no other, requiring diverse and mixed nursing skills and background.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Interested in clinical development?&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We recognise training and development is essential, therefore we have a regional training centre, located near Featherstone to facilitate training needs. You will gain insight and training in Mental Health and Substance Misuse.&lt;/p&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, NMP,BBV, sexual health, Womens health, health promotion, phlebotomy, vaccinations, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt;If you are new to offender health, we will create a suitable induction package to ensure you are equipped for this exciting role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;In return for your hard work you will...&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £32,640 depending on experience.&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme, childcare vouchers plus training and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP YOI Drake Hall include access to an onsite gym and free parking.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What do we need from you so you can do the job?&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Registered Nurse you’ll be an integral part of the healthcare team by bringing your clinical skills and passion for care, you could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency calls and potentially being the first person to attend an emergency.&lt;br /&gt;&lt;br /&gt;If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;br /&gt;&lt;br /&gt;It goes without saying that you’ll have a solid understanding of health and safety, along with exemplary record keeping skills. Self-motivated and able to work autonomously, you’ll show plenty of initiative when it comes to handling a wide range of situations.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Qualifications...&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;•1st level Registered Nurse with current registration with the UK Nursing Midwifery Council (NMC).&lt;br /&gt;•Evidence of Continuous Professional Development (CPD).&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;Further job information...&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full time permanent role working 37.5 hours per week across 7 days on a rolling rota basis (usually 1:4 weekends). Our core opening hours are Monday to Friday 07:15 -18:30 and Sat to Sun 07:15 – 17:00. Part-time and Bank applications may be considered.&lt;/p&gt;\n&lt;p&gt;Salary for this role is up to £32,460 per annum (dependent on experience) with company benefits and schemes.&lt;/p&gt;\n&lt;p&gt;We welcome informal visits by appointment or if you have any questions then please contact us: Tina Dunsdon, Head of Healthcare, tina.dunsdon@practiceplusgroup.com (01785 774161) or Lisa Tabbernor, Practice Manager. Lisa.tabbernor@practiceplusgroup.com (01785 774161) to arrange.&lt;/p&gt;\n&lt;p&gt;This job advert will close as soon as a sufficient number of suitable applications have been received. Please apply for this job as soon as you can, if interested.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eccleshall", "postalCode": "ST21 6LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8789", "longitude": "-2.2408"}}, "title": "Staff Nurse - HMP YOI Drake Hall", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235487", "validThrough": "2020-11-11T23:59:59+0000"}