{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-02T16:00:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Senior Staff Nurse, Children’s Intensive Care Unit (CICU), St Mary’s Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fast forward your career by joining our Children’s Intensive Care team. Our department is full of opportunity for nurses who are looking to develop new skills, get involved in quality improvement and collaborate with leading paediatric teams.&lt;/p&gt;\n&lt;p&gt;We are a dynamic and friendly multidisciplinary team of skilled and highly motivated staff who provide high quality care to children with a variety of conditions including medical, surgical, trauma, orthopaedics, plastics and ENT. St Mary’s Hospital is a designated children’s and adult major trauma centre with a dedicated 24/7 children’s emergency department.&lt;/p&gt;\n&lt;p&gt;We serve both our local population receiving patients through our emergency department and wards and we are also a tertiary referral centre receiving patients from other NHS Trusts through a dedicated paediatric retrieval service. All successful applicants will have the opportunity to join the retrieval team as a nurse specialist.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on our close working relationship with the paediatric wards, paediatric outpatient, emergency department and children’s community nursing teams. We have a strong ethos of inter-professional team working. We are looking for candidates with a PICU qualification or equivalent, and have sound clinical skills with recent evidence of developing leadership abilities. We welcome adult intensive care nurses who wish to transition to paediatric nursing.&lt;/p&gt;\n&lt;p&gt;Our recent multi-million pound expansion and refurbishment of CICU has seen our bed capacity almost double in capacity from eight to fifteen beds. Every year around 400 critically ill children are admitted to our unit and around 30 percent come from the local Northwest London catchment area; the remainder are transferred by Children’s Acute Transport Service.&lt;/p&gt;\n&lt;p&gt;We at St Mary’s CICU have developed our Paediatric Major Trauma service and has engaged in advanced and extended practices for nursing, including, Haemofiltration, Plasmaphoresis and the advance assessment of the presenting child.&lt;/p&gt;\n&lt;p&gt;Your learning and development is of real importance to us. You will be supported by a practice development team of educators, risk/audit nurses and family liaison to ensure your continued professional development. As a senior staff nurse you will also have the opportunity to work closely or as a rotational role with our paediatric site practitioners (PSPs) who provide 24/7 extended practices and advanced assessment skills across the directorate.&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring that all staff have a positive work experience and we will enable and support you to provide the best possible care for the children and families who use our services. We also strive to use the views of staff working in our service to improve our current and future service provision.&lt;/p&gt;\n&lt;p&gt;If you feel that you are up to the challenges of this rewarding role then we welcome your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Shwetha Mahadevappa,&lt;/p&gt;\n&lt;p&gt;PICU Clinical Educator 020 331 25475 or email Shwetha.Mahadevappa@nhs.net&lt;/p&gt;\n&lt;p&gt;Jeremy Weber,&lt;/p&gt;\n&lt;p&gt;PICU Modern Matron on 020 331 26173 or email jeremy.weber@nhs.net .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 6 Senior Staff Nurse, Children’s Intensive Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252730", "validThrough": "2020-11-15T23:59:59+0000"}