{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "38,890.00 - 44,503.00"}}, "datePosted": "2020-10-27T16:33:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Nurse Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 AFC 20/21 full terms and conditions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Pension&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cheshire West &amp; Chester Integrated Sexual Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you athoughtful and&lt;em&gt;caring nurse leader who is currently a Band 7&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Contraception &amp; Sexual Health&lt;/span&gt;&lt;/strong&gt;Nurse&lt;/em&gt;based in the&lt;em&gt;Chester&lt;/em&gt;area?Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use serviceswould recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receive a salary between £38,890 - £44,503 which is agenda for change 20/21 and you will receive full NHS terms and conditions. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within our sexual healthteam, the Nurse Manager will have line management responsibility for the Band 5/6 Nurses and Health Care Assistants working within the Integrated Sexual Health Service utilising appropriate skills, service transformation tools and monitoring the Key Performance Indicators.&lt;/p&gt;\n&lt;p&gt;The Nurse Manager will provide professional leadership and support to the clinical team totalling 70% of the role. The other 30% of the role is to deliver direct care for individuals attending for contraception, screening and treatment of sexually transmitted infections in the hub and spoke clinics across Cheshire West and Chester. The post holder will work in a range of Doctor and Nurse led clinics within the service, where there is continued support from the wider team and organisation to help grow our service.&lt;/p&gt;\n&lt;p&gt;To be considered for the role we are looking for applicants who have their BASHH STIF and DFSRH or equivalent as well has being a nurse prescriber, a IUD fitter (or working towards) and experience of managing nursing teams. Additionally, you must have a driving licence; and have access to a car as you will be required to travel between our 8 sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about sexual health? Do you want to lead and inspire a team of enthusiastic patient driven nurses and healthcare assistants? We are looking for someone to take our team to the next level and to support as well as develop our team – More importantly you must be able to adapt and promote our new ways of working.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We provide free and confidential sexual health services in Cheshire West and Chester including Winsford, Northwich and Ellesmere Port. Our services include providing free information and advice on all types of contraception and STI testing and treatment. Our service is confidential, non-judgemental and for people of all ages, genders and orientations.&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Beth Wellsbury our Service Managervia email:beth.wellsbury&lt;em&gt;@virgincare.co.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We partner with the NHS to make a real difference to people in Chesterand we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fountains Medical Centre", "postalCode": "CH1 4DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1952", "longitude": "-2.89223"}}, "title": "Nurse Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245438", "validThrough": "2020-11-10T23:59:59+0000"}