{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 pro rata pa inc"}}, "datePosted": "2020-11-06T09:31:13+0000", "description": "&lt;p&gt;This exciting project is seeking a future leader within SLaM on a 6 month secondment as Project Lead for Staff Health and Wellbeing, with opportunity to develop their leadership skills and career development. The project, funded by the Maudsley Charity and NHS Charities Together, aims to improve the support available for staff health and wellbeing at SLAM .&lt;/p&gt;\n&lt;p&gt;This opportunity has arisen due to the challenges faced across SLaM staff during the COVID-19 pandemic. The work sits under Making SLaM a Great Place to Work, and will involve collaboration with Listening into Action (LiA) and current stakeholders supporting staff wellbeing.&lt;br /&gt;&lt;br /&gt; Our front line workers play pivotal roles providing care to a wide catchment across South East London. The workforce benefits from rich diversity including those staff from BAME communities who have been worse affected by the pandemic and are over represented in lower paid positions across the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Consequently, due to both Covid-19 and long standing systemic and social issues, this project will engage the most affected teams including BAME staff.&lt;br /&gt;We are looking for a self-motivated proactive individual with an ability to be creative and visionary who will engage across a wide spectrum of staff to identify and agree interventions that will support staff wellbeing.&lt;br /&gt;We would welcome applicants that have experience of working in a clinical setting as well as non-clinical settings. Experience of people working on the frontline within a clinical setting would be advantageous but not essential&lt;br /&gt;&lt;br /&gt;The deadline for applications is Wednesday 18th November. Interviews will take place on the morning of the 24th and 25th of November 2020. Please note that we are ideally looking for the successful person to be able to start in role during early December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIrene MardonJob titleJoint Associate Director of HREmail addressirene.mardon@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, Denmark Hill, London, SE5 8AZ, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Health &amp; Well-being Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259032", "validThrough": "2020-11-18T23:59:59+0000"}