{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-10-19T15:46:29+0100", "description": "&lt;p&gt;We are looking for a dynamic, professional and enthusiastic Band 5 Physiotherapist to join our friendly and supportive team. You will be part of a multi-professional Adult Learning Disability Team within the London Borough of Newham, providing services to a culturally diverse population of adults with Learning Disabilities.&lt;br /&gt;This is an opportunity to gain experience within the field of Learning Disabilities whilst also coming into contact with a wide scope of clinical presentations inclusive of neurological, musculoskeletal and respiratory conditions.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The main priorities will be to provide one to one assessment and individually tailored therapy within home and community settings. This will include 24hr Postural care, provision of specialist equipment, management of long term conditions, training and health promotion as well as being available to give advice and offer expert opinion to parents, family members, carers, care providers, local authorities and other health care professionals. You will also provide group hydrotherapy sessions, Rebound Therapy sessions and exercise classes within specialist and mainstream gym and pool facilities in the community.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As well as working closely with other multi-disciplinary team professionals, you will work in close liaison with specialist Social Workers who work within the Local Authority Learning Disability Team and will have a strong working relationship with the Newham Wheelchair and Specialist Seating Service, completing joint assessments and supporting selection of appropriate seating solutions within their specialist clinics. Other relationships include working closely with the mainstream Extended Primary Care Teams in the Community of Newham, Social Services Occupational Therapists, GP&#39;s , Care Navigators, Paediatric therapists and Acute Liaison Nurses.&lt;br /&gt;Clinical supervision will be provided by the Clinical Lead Physiotherapist and you will work in close partnership with them, carrying out the physiotherapy and postural assessments jointly.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;To be successful, you will need to be an excellent communicator, have strong interpersonal, organisational skills, you will be motivated and willing to learn and committed to evidence based practice, regular supervision and individual performance review. You will be expected to participate in and contribute to regular in service training and team meetings.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For any enquiries please contact Julie Brooke (Clinical Lead Physiotherapist):&lt;br /&gt;Telephone: 0207 059 6600 Mobile: Email: julie.brooke4@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie BrookeEmail addressJulie.Brooke4@nhs.netTelephone number0207 059 6600Additional contact information&lt;/p&gt;\n&lt;p&gt;Julie Brooke, telephone 0207 059 6600, email Julie.Brooke4@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CM Learning Disabilities Speech &amp; Language Therapy, LONDON", "postalCode": "E15 4LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5428", "longitude": ".008524"}}, "title": "Physiotherapist Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232989", "validThrough": "2020-11-06T23:59:59+0000"}