{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294"}}, "datePosted": "2020-10-30T11:00:47+0000", "description": "&lt;p&gt;The COVID-19 pandemic affects all our communities, now is the time for us to come together to truly make a difference. To increase testing for COVID-19, the Government has significantly expanded its laboratory capacity and staffing. As a result a new COVID-19 Lighthouse Testing Laboratory will be opening in Bracknell. The laboratory will be managed by Berkshire and Surrey Pathology Services, which is the first to be run by the NHS. BSPS is a large and established pathology network operating across Royal Berkshire, Royal Surrey, Frimley Health and Ashford and St Peter’s Hospitals NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Senior Scientists to help us achieve our target of running tens of thousands of tests every day.&lt;/p&gt;\n&lt;p&gt;As an experienced scientist in molecular/virology fields, the post holder is expected to use their knowledge and skills and act with a degree of autonomy in providing a COVID-19 testing service. The position is under the overall direction of the Clinical Lead for the service and the post holder is expected to work in support of the Lead Scientist in the provision of the required service. The post holder will assist in managing the junior staff in the department.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist in the provision of a COVID-19 testing service&lt;/li&gt;\n&lt;li&gt;Maintain the highest possible standards of scientific work appropriate for a comprehensive, efficient and cost effective COVID-19 testing service&lt;/li&gt;\n&lt;li&gt;Be aware of current and developments in professional standards and national policies that pertain to the delivery of COVID-19 testing services&lt;/li&gt;\n&lt;li&gt;Assist when required in scientific development, evaluation, audit and research both within the specialty and with clinicians and scientists in the wider organisation&lt;/li&gt;\n&lt;li&gt;Manage junior staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful candidates need to have a Biomedical Science / Medical Microbiology / Virology or equivalent academic qualification, relevant IBMS Specialist Diploma and evidence of continuing professional development. It is desirable to be registered with the Health and Care Professions Council (HCPC) but not essential.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a relevant laboratory at a senior level is essential, preferably molecular or virology, with a proven track record of training and supervising staff. There is a requirement for a good grasp of Health &amp; Safety issues, COSHH, ISO &amp; quality issues. It would be advantageous to have experience of laboratory computer systems.&lt;/p&gt;\n&lt;p&gt;It is essential to have the ability to communicate clearly with precise attention to detail. It is important to be able to work under own initiative and without direct supervision within responsibilities of role.&lt;/p&gt;\n&lt;p&gt;The laboratory will be operating 24 hours a day, seven days a week; therefore successful candidates need to be able to work on a shift pattern. Initially there will be three shift patters of 8 hours (6am-2pm; 2pm - 10pm; 10pm to 6am) however in the future the shifts will change to two 12 hour shifts.&lt;/p&gt;\n&lt;p&gt;In return you will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full time employment, 37.5 hours per week (part time opportunities are available, however on the defined hours)&lt;/li&gt;\n&lt;li&gt;Secure environment of a fixed term contract for 12 months&lt;/li&gt;\n&lt;li&gt;Additional benefits of working with the NHS&lt;/li&gt;\n&lt;li&gt;Be part of something special – this is the first Lighthouse Lab run by the NHS&lt;/li&gt;\n&lt;li&gt;Sense of pride that you are supporting the nation and NHS in the fight against COVID&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The host employing organisation will be Royal Berkshire NHS Foundation Trust. The laboratory will be based at Bracknell Healthspace, Brants Bridge, Bracknell.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please email lighthouse@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bracknell", "postalCode": "RG12 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4138", "longitude": "-.736136"}}, "title": "Bracknell Lighthouse Lab - Senior Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249845", "validThrough": "2020-11-29T23:59:59+0000"}