{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30426", "minValue": "16625", "unitText": "YEAR", "value": "£9.89-£18.10 PH"}}, "datePosted": "2020-11-03T12:04:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Bank Driver Band 2&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Worcestershire Health and Care NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Worcestershire&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £9.89 Saturdays Nights: £13.94 Sunday/Bank Hols: £18.10&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work within a trust where they are dedicated with ensuring that all employees have the right values to provide the best service to patients? Would you like to be part of a team at a Trust rated ‘good’ in a recent CQC report?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Worcestershire Health and Care NHS Trust is a leading provider of community nursing, therapy, and mental health services to people of all ages throughout our county.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We believe our staff are our biggest asset. We want to develop a positive, inclusive, and caring culture that engages and inspires all our staff, with a clear focus on improvement and advancing equality of opportunity.&lt;/p&gt;\n&lt;p&gt;We are recruiting across the county for band 2 drivers, this provides anopportunity to work in a busy and varied environment, alongside clinical and other non-clinical colleagues to make a positive contribution to our patients and staff experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deal politely with queries from patients, carers, and staff when delivering/collecting equipment and report back any problems that may occur to Warehouse Supervisors.&lt;/li&gt;\n&lt;li&gt;The patients&#39; we service are often frail and or vulnerable. Patience and understanding are required when carrying out deliveries and collections. Allow plenty of time for the door to be answered. Where accessing via a key code clearly identify yourself as you enter the property.&lt;/li&gt;\n&lt;li&gt;Communicate effectively and professionally at all levels with patients, staff, and visitors, and be able to respond appropriately to unpredictable situation.&lt;/li&gt;\n&lt;li&gt;Be prepared to undertake additional collections requested by patients, carers or staff that may have been missed from the collection notes.&lt;/li&gt;\n&lt;li&gt;On delivery of wheelchairs to patients, undertake minor adjustments of the footplates to suit the individual and demonstrate how to fold and unfold the chair.&lt;/li&gt;\n&lt;li&gt;Complete route data sheets and drivers&#39; feedback forms at the end of your run and hand to your supervisor.&lt;/li&gt;\n&lt;li&gt;In the advent of a breakdown or accident immediately phone supervisor. Stay with the van if safe to do so, ensuring security of patient details. Complete motor incident form on return.&lt;/li&gt;\n&lt;li&gt;Undertake all daily deliveries and collections as allocated. Organising runs (deliveries first), cross check route summary sheet with booking sheets, clarify address/access arrangements, as necessary.&lt;/li&gt;\n&lt;li&gt;Maintain a log of all journeys and other routine administration as may be required.&lt;/li&gt;\n&lt;li&gt;Refuelling must be undertaken using a named fuel card with the receipt handed into a supervisor on return to base.&lt;/li&gt;\n&lt;li&gt;Will occasionally be required to make decisions to prioritise some tasks to meet changing / conflicting needs.&lt;/li&gt;\n&lt;li&gt;When using a Trust provided vehicle ensure it is kept clean, tidy, and roadworthy and refuelled to undertake a specific journey.&lt;/li&gt;\n&lt;li&gt;Carry out scheduled bookings, scanning all equipment.&lt;/li&gt;\n&lt;li&gt;Assist decontamination staff in the cleaning of equipment.&lt;/li&gt;\n&lt;li&gt;Assist in maintaining the warehouse is a clean and safe environment.&lt;/li&gt;\n&lt;li&gt;Use appropriate tools as provided&lt;/li&gt;\n&lt;li&gt;Load equipment and secure safely in van.&lt;/li&gt;\n&lt;li&gt;Carry out scheduled bookings, scanning all equipment.&lt;/li&gt;\n&lt;li&gt;Unload van contents to decontamination.&lt;/li&gt;\n&lt;li&gt;Decontaminate inside of van.&lt;/li&gt;\n&lt;li&gt;Use ramps as and when required.&lt;/li&gt;\n&lt;li&gt;Assemble beds and rise and recline chairs as per training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note this Job role is not open to agencies so I kindly request I am not contacted by any third parties in relation to this role.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Stephanie Phillips, Trust Recruitment Coordinator on 01905 681781 or email Stephanie.phillips@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestersire", "postalCode": "WR5"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1554", "longitude": "-2.18346"}}, "title": "Bank Driver", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253875", "validThrough": "2020-11-17T23:59:59+0000"}