{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T12:45:51+0000", "description": "&lt;p&gt;Lister Critical Care Unit Seeking highly motivated innovative Nurse Team Leader.&lt;br /&gt;&lt;br /&gt;Enabled by £150m investment we have undertaken one of the biggest transformation and improvement programmes in the country. All acute services were centralised at the Lister Hospital in Stevenage, Hertfordshire, in the autumn of 2014 , placing the Trust in a position to deliver clinical services that are amongst the very best. The refurbished Lister Critical Care Unit consists of a 20 bedded facility which includes the new and expanded 8 bedded unit. The units are flexibly managed with both level 2 &amp; 3 patients and are very effectively staffed by one nursing and medical team. &lt;br /&gt;&lt;br /&gt;Excellent opportunities exist to gain a broad range of experience in caring for critically ill patients from many specialties. These include patients with multi-organ failure, trauma patients, obstetric patients pre and post-delivery and with both surgical and medical conditions, and patients requiring complex post-operative care following general, urology, plastics, orthopaedic and vascular surgery.&lt;br /&gt;&lt;br /&gt;As the regional renal centre we offer renal replacement therapy (CVVHF) in the critical care unit and the expanding cardiac catheterisation facility provides us with patients requiring complex cardiac care via the intra-aortic balloon pump,. &lt;br /&gt;&lt;br /&gt;We can offer an innovative, challenging and aspirational place in which to work with both units performing to the highest standards and offering unique challenges and opportunities led by a critical care matron and senior critical care nurses. In house training and dedicated clinical and professional development support is further provided by our Clinical Nurse Educator. &lt;br /&gt;&lt;br /&gt;Working as close knit team - highly valued by our anaesthetic, surgical and medical colleagues - we are able to direct and manage patient care with autonomy and precision. Influence, respect and progression characterize the units, with all staff encouraged to be involved in decision making and all of us benefiting from team orientated encouragement, experience and guidance. &lt;br /&gt;&lt;br /&gt;We now have a vacancy for an enthusiastic, flexible and determined Band 6 Critical Care Team Leader to join our motivated, friendly and supportive team. You will have experience working within a critical care area and will have completed a course in critical care nursing and have a proven ‘get on and do’ approach to your clinical responsibilities.&lt;br /&gt;&lt;br /&gt;We can offer you the benefit of comprehensive training and the chance to focus on your speciality whilst developing your management skills, not to mention great working relationships at all levels and an environment in which you&#39;ll really be listened to. We are committed to helping you reach your fullest potential with our commitment to advancing nursing practice reflected in significant opportunities for training and development co-ordinated by our clinical nurse educator and facilitated by our clinical nursing teams.&lt;br /&gt;&lt;br /&gt;Our hospitals are in busy cosmopolitan towns with good amenities and leisure facilities. London is only 30 minutes away by train and we are within easy reach of all four of the capital’s international airports. Benefits include excellent annual leave entitlement, the NHS pension scheme, accommodation, shopping discounts, employee friendly benefits and further career development opportunities. &lt;br /&gt;&lt;br /&gt;24 months at band 5 within Critical Care ENB 100 course or equivalent.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Eve Mavundukure or Vicki Jasinski - Senior Sisters on 01438 28 4085/5802 or eve.mavundukure@nhs.net or vjasinski@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Nurse Team Leader - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250238", "validThrough": "2020-11-13T23:59:59+0000"}