{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "(£24,907 - £30,615 per annum)"}}, "datePosted": "2020-10-23T09:00:39+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Newly Qualified? Return To Practice? Looking for a challenge?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Trust has just been rated by CQC as GOOD in every domain except CARING, which was EXCELLENT. Due to this we are now the third leading Mental Health Trust in the country. We will strive to maintain our standards and always improve where we can.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;St Raphael Ward is a 17 bedded acute admission ward based at St Anne&#39;s Centre on the Conquest Hospital Site, providing 24 hour care and treatment for predominantly male older people with functional mental health disorders.&lt;br /&gt;&lt;br /&gt;An opportunity has arisen for a band 5 mental health nurse to join our team. You will need to be enthusiastic, motivated, dynamic and forward thinking. Evidence based practice and innovative therapies are encouraged. You need to have a commitment to maintaining and improving service user focused services to the highest standards. Your ability to communicate with service users, families and the public must be of the highest standards, and you must have the ability to work as part of a multi-disciplinary team. A genuine interest in working with this client group is essential&lt;br /&gt;&lt;br /&gt;You will be supported with training and development, and there is a robust supervision and appraisal system in place to assist with this.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;St Raphael is a great place to begin your qualified nursing career. We would love to hear from any newly qualified nurses or students qualifying in the forthcoming months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Hastings is an up and coming seaside town in the beautiful county of East Sussex, property is affordable so great for first time buyers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post offers The Trust&#39;s Golden Hello for band 5 or 6 Nurses, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Terri Kelly&lt;/p&gt;\n&lt;p&gt;Interim ward Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 0300 304 0255&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to visit or for any further information about this post please contact Terri Kelly Interim Ward Manager on 0300 304 0255&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Anne&#39;s Center, St Raphael Ward, St Leonard on Sea", "postalCode": "TN37 7PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8877", "longitude": ".562275"}}, "title": "RMN/RGN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239742", "validThrough": "2020-11-08T23:59:59+0000"}