{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum"}}, "datePosted": "2020-10-27T14:58:31+0000", "description": "&lt;p&gt;East Lancashire Hospitals NHS Trust is a busy Trust covering a population of around 550,000, and comprises of two main hospital sites – one based at the Royal Blackburn Teaching Hospital which mainly deals with non-elective cases, and the other at Burnley General Teaching Hospital which deals with elective cases. There are three smaller sites at Pendle, Accrington and Rossendale.&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Locum Consultant Physician with an Interest in Respiratory Medicine. We would particularly welcome applicants with a special interest in COPD, asthma or interstitial lung disease although other subspecialty interests will be considered.&lt;/p&gt;\n&lt;p&gt;This post will be based primarily at Royal Blackburn Teaching Hospital. The post involves out-patient and in-patient duties and a regular commitment to on call for general medicine The post also provides opportunities to develop other areas of special interest.&lt;/p&gt;\n&lt;p&gt;You will join a team of 7.5 respiratory physicians. Existing colleagues have special interests in TB, pleural disease, lung cancer, cough, sleep disordered breathing, interstitial lung disease, COPD, asthma and NIV. There is a large respiratory specialist nurse team focusing on COPD and asthma patients who work across the trust and in the community. In addition, there are four lung cancer specialist nurses, 3 TB specialist nurses, 2 Respiratory Advanced Nurse Practitioners and a respiratory physiology team.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have full registration with the GMC.&lt;/p&gt;\n&lt;p&gt;The post holder would be coming to join a committed and experienced team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr S Khalid&lt;/p&gt;\n&lt;p&gt;Consultant and Clinical Director&lt;/p&gt;\n&lt;p&gt;saifudin.khalid@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;01254 733638&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospital, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Locum Consultant in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245077", "validThrough": "2020-11-17T23:59:59+0000"}