{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-10-28T13:46:04+0000", "description": "&lt;p&gt;Our Trust&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Emmeline Centre is looking to recruit a self-motivated, highly organised individual to manage the equipment service. Key aspects of the role include stock management, compiling and submitting financial returns and liaising with commercial suppliers to ensure the smooth running of day to day clinic and theatre activity.&lt;/p&gt;\n&lt;p&gt;You will provide leadership for a team of two staff and will work very closely with the lead Audiologist and Deputy Operations Manager.&lt;/p&gt;\n&lt;p&gt;Full training regarding hearing implant equipment will be provided along with a tailored CPD package.&lt;/p&gt;\n&lt;p&gt;Vacancy closes on 11 November 2020 Midnight&lt;/p&gt;\n&lt;p&gt;Benefits to you&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from the Armed Forces.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLizzie GiffordEmail addressLizzie.gifford@addenbrookes.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division D, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Equipment Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246805", "validThrough": "2020-11-11T23:59:59+0000"}