{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro"}}, "datePosted": "2020-11-05T09:15:53+0000", "description": "&lt;p&gt;We have an exciting opportunity to recruit for a second &lt;strong&gt; Senior Mental Health Practitioner &lt;/strong&gt;who is a qualified &lt;strong&gt;RMN or RNLD, OT or Social Worker. &lt;/strong&gt;This post will provide liaison cover at Great Western Hospital as well as offering some sessions in the wider OSCA (Outreach Service for Children and Adolescents) and Getting More Help teams in Swindon CAMHS.&lt;/p&gt;\n&lt;p&gt;The service works with young people up to 18 years old who experience a range difficulties associated their mental health, you would work with families and external networks such as schools and Social Care. You would be part of a supportive multidisciplinary team who offer assessment, treatment and consultation either in the clinic base or out in the community.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a skilled and enthusiastic practitioner who is passionate about working with Children and Young people and who would like to develop their skills in delivering evidence based interventions and high quality assessments and risk plans. The successful candidate will have the opportunity to work alongside a range of practitioners. Clinical supervision is provided along with opportunities for training and continued professional development and there are strong links with local Professional leads.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly to meet the needs of the service and the needs of the young people and families that we work with within a range of settings.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to participate in a flexible working pattern to provide cover across hours of 9am-8pm Monday- Friday and 10am-6pm Saturday&#39;s, Sunday&#39;s and Bank Holidays.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to contribute to an out of hours on call rota which is supported by Managers, Consultant Psychiatrists and Senior Managers. Full training and support will be given around this area of the role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carey Gurd, Clinical Team Manager, 01865 903422&lt;/p&gt;\n&lt;p&gt;Lottie Mellor, Deputy Team Manager, 01865 903422&lt;/p&gt;\n&lt;p&gt;Terry Gibbs, Deputy Team Manager OSCA, 01865 903422&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon Community CAMHS, Marlborough House, Okus Road, Swindon", "postalCode": "SN1 4JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5501", "longitude": "-1.79727"}}, "title": "Senior Mental Health Practitioner - CAMHS Liaison", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257024", "validThrough": "2020-11-19T23:59:59+0000"}