{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-26T14:32:12+0000", "description": "&lt;p&gt;We are looking for a dietitian to join our dietetic team at Wye Valley NHS Trust. The successful candidate will need well developed clinical skills enabling them to work with patients requiring nutrition support across all specialties&lt;/p&gt;\n&lt;p&gt;Dietetics is well respected by the multidisciplinary team, and the ability to work as an integral member of this team is essential.&lt;/p&gt;\n&lt;p&gt;This post will provide you with the opportunity to develop your dietetic skills within the field of nutrition support, including the opportunity to develop skills in Home Enteral Feeding, critical care and parenteral nutrition.&lt;/p&gt;\n&lt;p&gt;The Nutrition &amp; Dietetic Department, providing dietetic services across Wye Valley NHS Trust, covering specialist areas including Gastroenterology, Stroke, Elderly Care, General Medicine, General Surgery, Diabetes and Paediatrics. We are a proactive team of dietitians that strive for continual improvement in the services we provide.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting the ongoing personal and professional development of our staff and offer excellent training and development opportunities. We also offer student training placements for A, B and C placements.&lt;/p&gt;\n&lt;p&gt;The Dietetic Service is an integral part of the Trustwide Therapy Service and you will work closely with other Therapy colleagues as part of a wider Therapy Team.&lt;/p&gt;\n&lt;p&gt;For further information about this post please contact Emma Sykes, Nutrition Support Team lead / Sarah Harding Clinical Manager Dietetics on 01432 364221 or email Emma.sykes@wvt.nhs.uk / Sarah.harding@wvt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Nutrition Support Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242918", "validThrough": "2020-11-11T23:59:59+0000"}