{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19000", "minValue": "19000", "unitText": "YEAR", "value": "Up to £19,000 Depending on Experience"}}, "datePosted": "2020-10-23T11:11:03+0100", "description": "&lt;h1&gt;&lt;strong&gt;Learn something new everyday&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;br /&gt; &lt;/strong&gt;&lt;br /&gt; Prisons are one of the most rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About Us&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;HMP Warren Hill is a category C adult male prison, located near the village of Hollesley in Suffolk (Hollesley, Woodbridge) - right near the coast and within 40 minutes&#39; drive of Ipswich.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP Warren Hill we’re looking for a Healthcare Assistant to support us and the existing team in this new venture.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return for your hard work you will...&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £19,000 - dependent on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays.&lt;br /&gt; Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the job&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Healthcare Assistant, your responsibilities will vary. You will be involved in the implementation of clinical care packages, phlebotomy and assessment, treatment and the evaluation of patients’ care.&lt;/p&gt;\n&lt;p&gt;You will support and assist patients with the activities of daily living, work with the Pharmacy Team to help them fulfil their daily tasks and you will be encouraged to take the lead on wellbeing promotion clinics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Next steps&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn they will arrange an interview for you to attend at HMP Warren Hill if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;More information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. The salary for this role is up to £19,000 - dependent on experience.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;This job advert will close as soon as a sufficient number of suitable applications have been received. Please apply for this job as soon as you can, if interested.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbridge", "postalCode": "IP12 3BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0335", "longitude": "1.45177"}}, "title": "Healthcare Assistant - HMP Warren Hill", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240241", "validThrough": "2020-11-06T23:59:59+0000"}