{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "31365", "unitText": "YEAR", "value": "£31,365, £33,176, £33,779, £37,890"}}, "datePosted": "2020-10-20T15:58:11+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Band 6 Developmental Primary Mental Health Worker (CAMHS, Families, Young People and Children Services)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;x1 Band 6 (permanent/substantive) at 37.5 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;x1 Band 6 (0.6 WTE) 22.5 hrs per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at The Valentine Centre, Gorse Hill Hospital Site, Anstey Lane, Leicester, LE7 7GX&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Leicestershire Partnership NHS Trust, Families, Young People and Children’s (FYPC) Division, provides Specialist Child and Adolescent Mental Health Services (CAMHS) to Leicester, Leicestershire and Rutland. This is a good opportunity to join a well-established Primary Mental Health Service and contribute to delivering the “Future in Mind 2015” aspirations, of improved access to services. This is through building capacity in the children and young people’s work force across Leicester Leicestershire and Rutland; for early identification and intervention in partnership with children young people and their families/ carers and other key stake holders.&lt;/p&gt;\n&lt;p&gt;We are looking for innovative staff from a range of professional backgrounds such as; .Mental Health Nursing, Occupational Therapy, Social Work, Education or Clinical Psychology who have professional registration and the relevant qualifications. It is essential that the post holder has experience of working with children and young people, who present with range of mental health problems Applicants, should be interested in developing experience in the delivery of targeted Level 2 specialist Primary Mental Health Services (CAMHS).&lt;/p&gt;\n&lt;p&gt;As a member of the Primary Mental Health Team you will:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; • Undertake mental health assessments including risk assessment and interventions, working alongside primary care, multi-agency partners and alongside colleagues in Specialist CAMHS level 3 services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; • Provide advice to primary care and other FYPC professionals regarding child and adolescent mental health issues for the 0-18 year’s age group.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; • Contribute to the delivery of consultation to all those working with children and young people, about mental health issues.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; • Contribute to the existing multi-agency partnerships, ensuring effective communication within FYPC and other children and young people’s’ services and to the strategic development and delivery of integrated CAMHS care pathways for the local population, in line with the CAMHS/Leicestershire Partnership Transformation agenda.&lt;/p&gt;\n&lt;p&gt;You must have excellent communication skills, be flexible, self-motivated and have evidence of experience in multi-agency working.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For an informal discussion please contact Parminder Bains or Dorothy Sebuliba; &lt;strong&gt;Senior &lt;/strong&gt;&lt;strong&gt;Primary Mental Health Workers on Telephone Number: 0116 295 5050.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;The closing date is the 23rd November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Interviews will take place on Tuesday 1st December 2020 at Child and Adolescent Mental Health Services, The Valentine Centre Gorse Hill Hospital Site Anstey Lane Leicester LE7 7GX or virtually depending on public health guidance.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Valentine Centre", "postalCode": "LE7 7GX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6628", "longitude": "-1.17557"}}, "title": "Band 6 Developmental Primary Mental Health Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235143", "validThrough": "2020-11-23T23:59:59+0000"}