{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "£20,000 per annum pro-rata"}}, "datePosted": "2020-11-05T13:49:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Team Leader and Appointments Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Full-time permanent role&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Based in Blackburn, BB1 2FD&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;£20,000 per annum pro-rata&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Totally plc addresses the challenges of increased demand on healthcare services by delivering high-quality planned, urgent and insourcing healthcare across the UK and Ireland.&lt;/p&gt;\n&lt;p&gt;Totally plc is currently recruiting for a Team Leader and Appointments Administrator to work in their Planned Care Division based in Blackburn on a full-time permanent basis in order to support their Musculoskeletal (MSK) Therapy service.&lt;/p&gt;\n&lt;p&gt;The role will support the Service Manager to identify the different individual team members needs for direction and support including; coordinating internal waiting lists, booking appointments, amending and updating patient records, retrieving and attaching referral information and reports, updating and maintaining patient administration and electronic referral systems and general administrative duties to ensure that systems are up to date and accurate. This role requires communication with patients, MSK Therapy colleagues and the general public.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have previous experience leading an administrative team, liaising with colleagues and the general public. Previous experience working in a healthcare organisation is desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For a full job description, further information about this role and to apply please contact Corey Spencer on 07553 753270 or via email corey.spencer@totallyplc.com&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for ALL applications is Wednesday 18th November 2020 &lt;/strong&gt;(please note that this vacancy may be closed early if sufficient applications are received).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews held via Zoom: W/C 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the following shortlisting approach will be applied:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 1 - Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 2 - If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 3 - If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackburn", "postalCode": "BB1 2FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7332", "longitude": "-2.45573"}}, "title": "Team Leader and Appointments Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257964", "validThrough": "2020-11-18T23:59:59+0000"}