{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40451", "minValue": "40451", "unitText": "YEAR", "value": "£40,451"}}, "datePosted": "2020-11-02T11:22:09+0000", "description": "&lt;p&gt;We would like to reassure all applicants that we are continuing to recruit through these challenging circumstances. For any vacancies advertised we are proceeding with Video Interviews where possible and are facilitating remote homeworking for all positions where possible. Should you have any queries on the current recruitment process at the MHRA please contact careers@mhra.gov.uk.&lt;/p&gt;\n&lt;p&gt;We currently have a great opportunity for a number of &lt;strong&gt;Senior Medical Device Specialists &lt;/strong&gt;based within the &lt;strong&gt;Devices Division&lt;/strong&gt;, working full time on a permanent contract.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Medicines and Healthcare products Regulatory Agency enhance and improve the health of millions of people every day through the effective regulation of medicines and medical devices, underpinned by science and research.&lt;/p&gt;\n&lt;p&gt;The Devices division is the primary source of expertise within the MHRA and the Department of Health and Social Care for matters relating to safety, quality and performance of all medical devices. The Division is made up of four groups: Devices Regulatory Group (DRG); Devices Information &amp; Operations Group (DIOG), Devices Clinical Team (DCT) and Devices Safety &amp; Surveillance Group (DSSG). The posts sit within the Device Safety and Surveillance Group and is made up of people from technical backgrounds such laboratory technicians, radiographers, pharmacists, post-graduates and medical engineers. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The postholders will provide technical leadership for a range of medical devices in areas such as implantable devices, defibrillators, in-vitro diagnostics, wound management, single-use instruments.  You will be required to use a range of data sources, including device related adverse incidents to undertake trending activities and identify safety signals for further investigation.  You will also have the responsibility to engage with a range of stakeholders including patients and the public to make timely and robust benefit-risk decisions on medical devices with actions that are outcome focussed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead and guide Medical Device Specialists ensuring the division’s timely and proportionate response to emerging safety issues.&lt;/li&gt;\n&lt;li&gt;Effective management of trending activities and signal reports ensuring cases are kept up-to-date and quality of work is maintained.&lt;/li&gt;\n&lt;li&gt;Effective management of risk management reports (risk analysis, risk control and risk evaluation) to ensure robust and timely regulatory decisions.&lt;/li&gt;\n&lt;li&gt;Represent Agency at advisory and external meetings, high profile issues and topical issues to provide authoritative up to date advice and regulatory position. &lt;/li&gt;\n&lt;li&gt;Be proactive in contributing to developments in issues relating to medical devices, their use and regulation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Qualifications - External&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will have the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven ability to communicate (written and oral) effectively to maintain positive working relationships with stakeholders.&lt;/li&gt;\n&lt;li&gt;Display confidence when making difficult decisions, even if they prove to be unpopular. Consult with others to ensure the potential impact on patients/end users have been considered.&lt;/li&gt;\n&lt;li&gt;Proven understanding of risk management principles to reduce harm (direct or indirect). &lt;/li&gt;\n&lt;li&gt;Proven ability to manage complex projects to agreed milestones and managing conflicting priorities and the work of others.&lt;/li&gt;\n&lt;li&gt;Degree or equivalent qualification in a health care, regulatory or health data science/analytics (such as medical engineering, material science, or healthcare qualification).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to know more about this role, please click on the Job Description and Person Specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note: The job description may not open in some internet browsers. Please use Chrome or Microsoft Edge. If you have any issue viewing the job description, please contact &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;careers@mhra.gov.uk&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure all application questions are completed in full; your application may not be considered if any responses are left blank. Please note that applications are blind, and your CV will not be accessible to Hiring Managers during the reviewal of applications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 20th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Medicines and Healthcare products Regulatory Agency", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "10 South Colonnade", "postalCode": "E14 4PU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5045", "longitude": "-.022051"}}, "title": "Senior Medical Device Specialist - £40,451 p.a. + benefits", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251765", "validThrough": "2020-11-20T23:59:59+0000"}