{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-28T15:46:04+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;CONSULTANT MEDICAL ONCOLOGIST SPECIALISING IN COLORECTAL, LUNG AND ACUTE ONCOLOGY &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a new post supporting the colorectal, lung and Acute Oncology Service at Russell’s Hall Hospital (RHH), Dudley. This consultant in medical oncology post shall be the first post to be resident at Russells Hall Hospital (RHH) and the management team are planning to further expand this to support provision of the service. The successful applicant will have support of the existing oncology medical team at the Royal Wolverhampton NHS Trust, with a dedicated session at New Cross Hospital (NXH) for continued professional development (CPD), governance and teaching purposes (see job plan).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will see approximately 100 new Lung Cancer and 100 new Colorectal Cancer patients a year. Secretarial support, designated office space and appropriate IT equipment will be provided. The clinic templates include 40 minutes for new patient consultation and 20 minutes for follow up consultations. On the acute oncology ward reviews each review will be allocated about 20 minutes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The intention of this post is to provide a seamless service at RHH where the successful candidate will be expected to work with professional colleagues and local managers to provide an Oncology service to Russell’s Hall Hospital. There will be strong links with the visiting Oncologists at NXH where attendance at key weekly meetings will be required&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with professional colleagues and local managers to provide a first class service to the population of Dudley and surrounding areas.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC registration and be entered on the Specialist register for Oncology or be within 6 months of completing specialist training on the date of interview.&lt;/p&gt;\n&lt;p&gt;At the Dudley Group our patients and staff are at the heart of all that we do to offer a high quality patient experience in a caring and supportive environment that aligns with our vision of providing safe, caring and effective services because people matter.&lt;/p&gt;\n&lt;p&gt;We inspire our staff to be innovative with support and encouragement to continually develop and have the opportunity to inspire exemplary care for our patients.&lt;/p&gt;\n&lt;p&gt;We expect all of our staff to demonstrate the Trust values of Care, Respect and Responsibility.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;To arrange an informal visit or for more details please contact Dr Ankit Jain, on 01902 698336 or Lucy Ford, Directorate Manager on 01384 456111 ext 5444&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Wolverhampton NHS Trust, New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Consultant Medical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247235", "validThrough": "2020-11-11T23:59:59+0000"}