{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T15:31:22+0000", "description": "&lt;p&gt;We require an experienced and enthusiastic Locum Consultant Uro-Radiologist to join our team of 23 Consultant Radiologists. The appointee will be based at Eastbourne DGH although this may change dependent on service need.&lt;/p&gt;\n&lt;p&gt;Applicants should demonstrate a high level of clinical experience and competence in Genitourinary Radiology across all major modalities. Experience in multi-parametric prostate MRI is favourable.&lt;/p&gt;\n&lt;p&gt;East Sussex Healthcare (ESHT) offers comprehensive and state-of-the-art management of urological diseases and is a major tertiary referral centre for the management of Urological Cancers, Stone Disease and Female/Functional Urology.&lt;/p&gt;\n&lt;p&gt;The ESHT Radiology Department has a high quality stock of imaging Equipment including a 320 slice Toshiba Aquilion One, GE Revolution and Evolution CT machines, 2x MRI Siemens Avanto 1.5T, Siemens Artis Interventional Suite, Siemens Symbiat 16 SPECT-CT and an ongoing rolling equipment replacement and expansion programme.&lt;/p&gt;\n&lt;p&gt;First line on call is provided by SpR or staff grade radiologists until 10pm weekdays and 5pm weekends with on call outsourced to a reporting company overnight. Our General Radiology consultant team is responsible for checking SpR scans the following day to ensure quality assurance and education on a 1 in 8 rota. This rota also covers Malignant cord compression MRI at weekends.&lt;/p&gt;\n&lt;p&gt;The Radiology Departments are actively involved in teaching with four radiology trainees on rotation from HEKSS deanery. Audit and other continuing professional developmental activities are positively encouraged.&lt;/p&gt;\n&lt;p&gt;This post will be offered on the Terms and Conditions in line with national pay scales. Applicants must have full GMC registration with a licence to practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Justin Harris-Deputy Chief of Division (Diagnostics, Anesthetics and Surgery)Telephone number0300 131 4843&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest Hospital or Eastbourne DGH, Eastbourne/Hastings", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Locum Consultant Radiologist with a special interest in Genitourinary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250749", "validThrough": "2020-11-15T23:59:59+0000"}