{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T10:02:45+0100", "description": "&lt;p&gt;We are looking for a dynamic, forward-thinking Locum Consultant Physician to complete a team of nine (including new appointments) covering North Cumbria. The Directorate would equally welcome applications from existing and newly trained Consultants.&lt;/p&gt;\n&lt;p&gt;This post is based in the Elderly Care and Rehabilitation Department at the Cumberland Infirmary, Carlisle (CIC) with opportunities to work across site at West Cumberland Hospital, Whitehaven (WCH).&lt;/p&gt;\n&lt;p&gt;The successful candidate will be encouraged to work as part of an established multidisciplinary team inputting and helping to develop new models of care within an acute frailty pathway. This is an opportunity to join an organisation in which Clinicians are at the forefront of management and service development.&lt;/p&gt;\n&lt;p&gt;Elderly care in West and North East Cumbria has been designed to dovetail with the overall Trust vision (see earlier) and consists of three main strategic aims:&lt;/p&gt;\n&lt;p&gt;1) Provide early Comprehensive Geriatric Assessment for frail elderly people (7 days a week) as per the &#96;Silver Book’ and RCP standards by developing &#96;interface geriatrics’ and a short stay frail elderly assessment unit.&lt;/p&gt;\n&lt;p&gt;2) Ensure specialist geriatric input to surgical patients as recommended by the British Orthopaedic Association and NCEPOD reports.&lt;/p&gt;\n&lt;p&gt;3) Provide a high quality specialist service to primary care through the delivery of rapid access clinics and the provision of information and advice by a Geriatric ‘physician of the week’.&lt;/p&gt;\n&lt;p&gt;It is expected that the appointee will contribute equally to the out-of-hours-work and on-call rota. As a Consultant you will be required to participate in Consultant Appraisal and Job Plan Reviews on an annual basis and the revalidation process in line with your professional registration.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work across the two hospital sites (Cumberland Infirmary Carlisle and the West Cumberland Hospital, Whitehaven).&lt;/p&gt;\n&lt;p&gt;Relocation assistance of up to £8,000 may be available for successful applicants moving to the region.&lt;strong&gt;The post currently attracts a discretionary recruitment premium of up to 10% (based on basic salary) per annum.&lt;/strong&gt;This is payable for up to 4 years and is reviewed by the Trust on an annual basis.&lt;/p&gt;\n&lt;p&gt;Please see full job description and personal specification for details.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Locum Consultant in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235787", "validThrough": "2020-11-18T23:59:59+0000"}