{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "48414", "unitText": "YEAR", "value": "£48,414 - £60,000"}}, "datePosted": "2020-10-16T06:02:21+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an opportunity for a Surgical Care Practitioner to join our Theatres Department based at The London Clinic’s main hospital in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Surgical Care Practitioners are registered non-medical healthcare professionals who have extended the scope of their practice by completing an accredited training program. They work as members of the surgical team and perform surgical interventions and post-operative care under the supervision of a senior surgeon. The post holder will work as a member of the surgical team providing the highest level of patient care to a group of consultant surgeons across specialities.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type - This is a full time, permanent position working 37.5 hours per week (mixed shifts including earlies and lates, as well as weekends and on-call)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary - The attractive salary range for this role is £48,414- £60,000 (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package - We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Duties &amp; Responsibilities&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Actively participate in surgical procedures at the direction of the Consultant surgeon.&lt;/li&gt;\n&lt;li&gt;Have extensive knowledge of robotic surgery and how to troubleshoot the robot.&lt;/li&gt;\n&lt;li&gt;Act as Surgical First Assistant as required, across specialities as directed by the supervising surgeon&lt;/li&gt;\n&lt;li&gt;To act as a role model to all members of the team&lt;/li&gt;\n&lt;li&gt;Acquire, develop and maintain advanced knowledge and expertise within a specialist area, whilst also assisting and overseeing other surgical practitioners with their areas of responsibility.&lt;/li&gt;\n&lt;li&gt;Ensure a suitable skill mix and division of labour amongst the daily lists.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RGN Level 1 with Surgical Care Practitioner Qualification &amp; ENB Theatre Course&lt;/li&gt;\n&lt;li&gt;Senior experience in operating theatres&lt;/li&gt;\n&lt;li&gt;Evidence of current Surgical Care Practitioner experience&lt;/li&gt;\n&lt;li&gt;Proven experience of robotic surgery&lt;/li&gt;\n&lt;li&gt;Advanced Speciality Knowledge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5177", "longitude": "-.146344"}}, "title": "Surgical Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229277", "validThrough": "2020-11-20T23:59:59+0000"}