{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a."}}, "datePosted": "2020-10-27T11:01:50+0000", "description": "&lt;p&gt;Dorset HealthCare is the first mental health trust providing community services in the South to be given an Outstanding rating by the Care Quality Commission (CQC) – and one of only a small handful nationally.&lt;/p&gt;\n&lt;p&gt;We are proud to be part of the wider CAMH service in Dorset and all it has achieved in recent years, with its progress and developments being demonstrable. Currently our CAMHS community services are rated Good and our CAMHS inpatient unit is rated as Outstanding. We have been fast tracked by NHSE to deliver New Care Models providing a closer to home crisis home treatment service. We are also part of the national trailblazer to deliver Mental Health Support Teams in schools across 3 pilot sites in Dorset. In addition, NHSE have commissioned Dorset Healthcare to build a new state of the art 8 bed PICU.&lt;/p&gt;\n&lt;p&gt;Nationally CAMHS is under the spotlight; Dorset CAMHS has embraced this attention and has seized the opportunity to appraise how we offer core mental health services to the children, young people and families of Dorset and how we work together with our partner agencies in achieving this to a high standard. We have been able to identify areas for improvement and highlight areas of outstanding practice through this process. We continue to work hard on refining and developing the service to better meet the needs of our young people and their families and are looking for innovative and enthusiastic staff to join the evolution of Dorset CAMHS!&lt;/p&gt;\n&lt;p&gt;We currently provide the following CAMHS services across Dorset:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 Community teams&lt;/li&gt;\n&lt;li&gt;10 Bed adolescent inpatient unit&lt;/li&gt;\n&lt;li&gt;Dedicated CAMHS psychiatric liaison services within 3 acute hospitals -Out of Hours crisis service&lt;/li&gt;\n&lt;li&gt;Discovery college&lt;/li&gt;\n&lt;li&gt;Peer specialists working within our community and inpatient teams&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are also working closely with our local commissioners to develop new and innovative services including a CAMHS retreat to support the emotional health and wellbeing of young people across Dorset. We&#39;ve been working hard to develop a new CAMHS Online offer and website. We&#39;re now able to deliver a range of online therapies and our social media presence is going from strength to strength.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Mental Health Practitioner to join our team as a Crisis practitioner&lt;/strong&gt;. This is a permanent full time post in our community CAMHS team in Dorchester. You will be responsible for managing crisis cases, providing short term crisis interventions and providing duty cover. You will work closely with the multi-disciplinary team providing a high quality of care ensuring high standards of clinical practice when working with all young people and their families/carers and you&#39;ll be well supported my the multi disciplinary team.&lt;/p&gt;\n&lt;p&gt;In return we can also offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Recruitment and retention premium of £3000 upon commencement in role and a further £1500 after completing one year in the role&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;An excellent preceptorship programme for newly qualified nurses and the chance to further your career in a nurse led environment&lt;/li&gt;\n&lt;li&gt;You will receive a comprehensive and structured induction programme and training&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discount and salary sacrifice scheme&lt;/li&gt;\n&lt;li&gt;Not forgetting our unique selling point – our Trust beach huts located along the famous Sandbanks coastline&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Theresa Sired Job title: CAMHS Clinical Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: T.sired@nhs.net Telephone number: 01305 255705&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorchester, Dorset", "postalCode": "DT1 2LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7115", "longitude": "-2.44917"}}, "title": "CAMHS Crisis Practitioner, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244113", "validThrough": "2020-11-10T23:59:59+0000"}