{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 gross per annum"}}, "datePosted": "2020-10-21T12:13:47+0100", "description": "\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;CLINICAL/ COUNSELLING PSYCHOLOGIST Band 8A/8B depending on qualifications and experience (Full-time, part-time or job-share)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;ADULT SERVICE LINE - COMMUNITY MENTAL HEALTH TEAM&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;12 MONTHS FIXED-TERM (OR SECONDMENT OPPORTUNITY)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to appoint an HCPC accredited clinical or counselling psychologist, to a 12 month fixed term 8a or 8b post, to cover a period of maternity leave, within an adult community mental health team based in King’s Lynn, West Norfolk. This can be offered on a secondment basis, and could provide a career development opportunity.&lt;/p&gt;\n&lt;p&gt;Professionally, you will be part of a supportive and proactive wider psychology team of around 15 staff, working across two adult community bases as well as the acute setting in the West &amp; South Norfolk Care Group. A range of specialist skills and interests are represented, including working with personality difficulties, trauma and dissociation, working with psychosis, CBT, ACT, Mentalisation Based Therapy, CAT, EMDR, Compassion Focused Therapy, Schema Focused Therapy, Art Psychotherapy, Psychodynamic Psychotherapy and Behavioural Family Therapy. There are opportunities for co-production and involvement with the Recovery College.&lt;/p&gt;\n&lt;p&gt;You will provide day to day professional leadership to the psychology team of 5 staff, embedded within the community mental health team based at Chatterton House in King’s Lynn. The team offers assessment, formulation, consultation and group and individual interventions, as well as supervision and training to enhance the psychological perspective and skills of the multi-disciplinary team. The role will include operational/professional supervision of two psychological therapists and there will be opportunities to lead and contribute to service development.&lt;/p&gt;\n&lt;p&gt;You will be professionally supported by regular supervision, and links with networks of colleagues across the Trust area of Norfolk and Suffolk. We have good links with the University of East Anglia, including providing clinical psychology and psychotherapy training placements.&lt;/p&gt;\n&lt;p&gt;Appropriate CPD opportunities and specialist interests will be supported.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who can provide professional and clinical leadership, representing a psychological perspective within a multi-disciplinary setting. You will be passionate about complex mental health, with a range of clinical skills and interests, which may complement or enhance those already provided. You will be able to work well within a MDT setting, and actively embrace and support a Recovery culture through co-production opportunities.&lt;/p&gt;\n&lt;p&gt;Psychology is a well-established and valued resource in the West and South Norfolk Care Group. The work environment is pleasant and supportive with a dedicated office, free car parking, and green spaces nearby. West Norfolk is a mixed rural and urban area and offers a high quality of life in terms of housing, culture and leisure pursuits. The beautiful Norfolk coast is on the doorstep, whilst there are good road and rail links with London, Cambridge, Norwich and the midlands. Car ownership would be an advantage given the wide geographical area, but pool cars are also available for clinical use.&lt;/p&gt;\n\nFor further details / informal visits contact:\n\n\n&lt;p&gt;Helena Crockford, Consultant Clinical Psychologist, West &amp; South Adult Psychology Service Line Lead on 07884 117251 or helena.crockford@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Informal contact and visits (where possible within existing COVID restrictions) are welcomed.&lt;/p&gt;\n\n\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatterton House, Kings Lynn, West Norfolk", "postalCode": "PE30 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7481", "longitude": ".408741"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236292", "validThrough": "2020-11-08T23:59:59+0000"}