{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-10-23T11:31:10+0100", "description": "&lt;p&gt;Band 8a Service Manger Immunisation Team.&lt;/p&gt;\n&lt;p&gt;Are you enthusiastic, highly motivated, innovative and passionate about children and young people, then you are the perfect choice for Harrogate and District NHS Foundation Trust who now nationally deliver the largest number of 0-19 Healthy Child Services. This is across a wide geographical footprint including North Yorkshire, County Durham, Darlington, Middlesbrough, Stockton, Gateshead and Sunderland. This post will be to manage the Immunisation Team across the footprint.&lt;/p&gt;\n&lt;p&gt;We are looking for the right individual who has the skills and experience of working within children’s services at a senior level. They have the ability to work closely with partners and engaging with a wide range of stakeholders. The ability to excel in building relationships; develop a clear vision for and when leading staff; project management and a strong focus on delivering improvements is essential. The successful candidate should have a clear purpose on improving outcomes for the people and communities the Trust serves, wanting to address health inequalities through health promotion, prevention and early intervention.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Operational Director and Clinical Director to set the strategic direction for children’s services and in the transformation of those services. They will work closely with general managers, corporate services, other senior clinicians &amp; managers, partner agencies - alongside service users and their communities to promote the uptake of childhood immunisation programmes. The post holder will need to develop and sustain an accessible immunisation service across diverse populations within the footprint.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lesley Pringle Job title: General Manager Email address: lesley.prigle@nhs.net Telephone number: 07392 194 131&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thirsk Health Centre, Thirsk", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Service Manager Immunisation Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240324", "validThrough": "2020-11-06T23:59:59+0000"}