{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "(£) 31,365 - 37,890 Per Annum"}}, "datePosted": "2020-10-15T15:13:50+0100", "description": "&lt;p&gt;This is an exciting opportunity to work as part of the multi-disciplinary Diabetes Service with Torbay and South Devon NHS Foundation Trust based at Torbay Hospital.&lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic and compassionate registered Nurse with clinical knowledge of diabetes care and a keen interest to work in this specialised area. A strong interest in developing a proactive approach to the delivery of high standards of evidence-based care is essential. This post is for a band 6 diabetes specialist nurse, &lt;strong&gt;however a band 5 developmental role would be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join a team consisting of five Band 6, and one Band 7 Diabetes Specialist Nurses who carry nursing responsibility for both the inpatient and outpatient caseload which will include travel for community reviews. They work closely with six Consultant Endocrine/Diabetologists. You will be required to work as a skilled practitioner implementing treatment based on evidence based practice for both people with diabetes working with other professionals providing care, in a range of settings.&lt;/p&gt;\n&lt;p&gt;The service provides a number of routine and specialist clinics including, preconception, antenatal, insulin pump, and young person’s clinics. The team also has responsibility for managing routine and urgent ward referrals and providing both opportunistic and organised education to health care professionals.&lt;/p&gt;\n&lt;p&gt;The service is responsible for the delivery of both the local TTIDE and TIFA diabetes structured patient education programmes.&lt;/p&gt;\n&lt;p&gt;You will need excellent clinical, organisational, IT and communication skills.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible in your approach to work and in the hours that you may be required to work.&lt;/p&gt;\n&lt;p&gt;For further information regarding this post please contact Caroline Harding (Lead Diabetes Specialist Nurse) on 01803 655525.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Diabetes Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228742", "validThrough": "2020-11-15T23:59:59+0000"}