{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata per annum"}}, "datePosted": "2020-10-22T17:15:47+0100", "description": "&lt;p&gt;Our services include:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ashworth - High Secure Hospital:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ashworth Hospital is one of only three hospitals in the country providing services for patients who require treatment and care in conditions of high security.&lt;/li&gt;\n&lt;li&gt;Our vision is to be a centre of excellence for high secure care, providing a recovery focused environment for patients and staff.&lt;/li&gt;\n&lt;li&gt;Patients remain in the high secure service until they are safe and well enough to move to a medium secure or other unit.&lt;/li&gt;\n&lt;li&gt;We care for up to 228 patients in 14 single storey semi-detached wards. Our wards are arranged in clusters around wide open green areas and each ward has its own garden.&lt;/li&gt;\n&lt;li&gt;Each of our wards provides a specific type of specialised treatment and care and patients with similar conditions are usually grouped together based both on security and clinical needs.&lt;/li&gt;\n&lt;li&gt;Care is provided by consultant led multi-disciplinary teams using the care programme approach. This ensures each patient has his own specialist team of professional staff to tailor make a treatment and care package.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rowan View:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This exciting development is an addition to the Secure &amp; SpLD Service and represents our strong ambition for a new centre of excellence in forensic care.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist Learning Disability and Mental Health services&lt;/li&gt;\n&lt;li&gt;123 beds over eight wards: Female Learning Disability (Delamere Ward); Male Learning Disability (Astley and Birkdale Wards); Female Mental Illness (Eden); Male Mental Illness (Thornton, Rivington, Vale and Marbury Wards)&lt;/li&gt;\n&lt;li&gt;An environment that will promote the integration of physical and mental wellbeing&lt;/li&gt;\n&lt;li&gt;A social hub incorporating a café, therapy rooms, multi faith room, sports hall, gymnasium, music rooms, skills for life room, IT suite, bank and a physical health suite&lt;/li&gt;\n&lt;li&gt;Use of therapeutic technology for the benefit of patients and staff including virtual reality and avatar therapy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rathbone - Low Secure Hospital:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our Low Secure Unit on the Rathbone Hospital site in the Old Swan area of Liverpool provides mental health rehabilitation for men with severe and enduring mental health problems who are preparing to return to life in the community.&lt;/li&gt;\n&lt;li&gt;The unit has two wards, Allerton and Childwall, each with 16 en suite bedrooms.&lt;/li&gt;\n&lt;li&gt;‘Wavertree Street’ is central to the unit and provides structured leisure activities. The area has a café dining area providing a relaxed, bright atmosphere where patients can have relatives to visit.&lt;/li&gt;\n&lt;li&gt;Rathbone Low Secure Unit also has two self contained flats on site which are used within the Rehabilitation Programme and are used to further develop and consolidate the skills needed to live independently.&lt;/li&gt;\n&lt;li&gt;The staff team has consultant psychiatrists, nurses, nursing assistants, psychologists, occupational therapists, social workers and outreach practitioners working together to provides a full tailored approach to psychosocial rehabilitation for those we serve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Secure &amp; SpLD Service represents a step change in care for service users, preparing them for life afterwards. It will deliver innovative treatments to improve recovery times for people with mental health and learning disabilities.&lt;/p&gt;\n&lt;p&gt;Continuous Improvement is one of Mersey Care NHS Trust’s five values and our aim is to deliver care that makes a positive difference to the lives of our service users, their families and carers.&lt;/p&gt;\n&lt;p&gt;We are looking for Nursing assistants &lt;strong&gt;to work on our bank&lt;/strong&gt; who can demonstrate compassion and empathy to our patients, improving the quality of care services within a Secure/Forensic Environment. Our Secure Division is responsible for specialised secure mental health services, in low, medium and high secure settings for service users with a primary classification of mental illness, and personality disorders. Working across the Secure Division as part of a multi-disciplinary team, you will contribute to the delivery of high standards of care and treatment to a challenging group of service users. This is an exciting and rewarding opportunity to gain invaluable experience in forensic environments.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate enthusiasm in your attitude, commitment and behaviour towards our service users using effective communication skills and the ability to thrive in a stimulating environment, performing well under pressure. You will need &lt;strong&gt;prior Experience&lt;/strong&gt; in &lt;strong&gt;a care setting and must be able to complete personal safety training&lt;/strong&gt; . Please apply now.&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 16th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews to be held 26th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chen Shoko&lt;/p&gt;\n&lt;p&gt;Chengeto.shoko@Merseycare.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various across the Division, Liverpool", "postalCode": "L34 1PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4231", "longitude": "-2.8262"}}, "title": "Nursing Assistant (Bank) - Secure &amp; SPLD Division", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239494", "validThrough": "2020-11-15T23:59:59+0000"}