{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa/ pro for part time staff"}}, "datePosted": "2020-10-26T13:01:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Students qualifying this winter may apply (*see notes below)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering an exciting opportunity for registered pharmacy technicians to join our expanding and evolving medicines supply service team within the forward thinking Pharmacy Department at Sheffield Teaching Hospitals NHS Foundation Trust. The pharmacy department provides a service to over 2000 in-patient beds, spanning 4 hospital sites and incorporates 4 dispensaries.&lt;/p&gt;\n&lt;p&gt;We have permanent positions available both on our technician rota and in the dispensaries. The rotational posts include working in the aseptic unit in addition to the dispensaries.&lt;/p&gt;\n&lt;p&gt;We have a proud record of supporting and developing our staff with many technicians progressing within their career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties include&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dispensing medications including controlled drugs and clinical trials&lt;/li&gt;\n&lt;li&gt;Communicating medicine related information to patients&lt;/li&gt;\n&lt;li&gt;Visiting wards and departments and maintaining appropriate drug stock levels&lt;/li&gt;\n&lt;li&gt;Using the patient tracking system to record patient information and monitor the transit of prescriptions through the dispensing process&lt;/li&gt;\n&lt;li&gt;Preparing patients compliance aids&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition rotational duties will also include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assisting in the maintenance of systems, equipment and fabric of the Aseptic Dispensing Unit&lt;/li&gt;\n&lt;li&gt;Achieving and maintaining a validated aseptic technique for the preparation of aseptically prepared products in laminar airflow cabinets.&lt;/li&gt;\n&lt;li&gt;Preparing and processing aseptically prepared products including IV additives, adult and neonatal TPN, cytotoxic and clinical trial materials, in accordance with approved worksheets and SOPs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;* Applicants must have an NVQ 3 in Pharmaceutical Services, a relevant supporting qualification and be registered with the General Pharmaceutical Council. However students who qualify this winter may apply and will commence at Agenda for Change Band 3 until the registration process is complete.&lt;/p&gt;\n&lt;p&gt;Candidates must be willing to undertake an Accredited Checking Technician qualification.&lt;/p&gt;\n&lt;p&gt;Applicants must possess experience of working within a hospital or community pharmacy environment and also have excellent interpersonal, motivational, organisational, analytical and communication skills.&lt;/p&gt;\n&lt;p&gt;For further information please contact &lt;strong&gt;David Winters on telephone (0114)2713252/2266425 alternatively you can contact by e-mail. &lt;/strong&gt;&lt;strong&gt;david.winters@nhs.net&lt;/strong&gt;&lt;strong&gt;  or Maria Malcolm on telephone: (0114) 2715544 or &lt;/strong&gt;&lt;strong&gt;maria.malcolm@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield Teaching Hospitals, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242551", "validThrough": "2020-11-08T23:59:59+0000"}