{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 per annum"}}, "datePosted": "2020-11-02T10:00:57+0000", "description": "&lt;p&gt;Health Education England is committed to recruiting the best person for the job, based solely on their ability and individual merit as measured against the criteria for the role; through a process that is fair, open, consistent and free from discrimination. Health Education England supports the values and pledges of the NHS Constitution.&lt;/p&gt;\n&lt;p&gt;We are committed to being a diverse and an inclusive employer and will build a culture where all employees are valued, respected and acknowledged. We strive to ensure that no individual receives less favourable treatment on the grounds of their gender identity, sexual orientation, disability, religion or belief, colour, race, ethnicity, national origin, age, pregnancy and maternity, marital or civil partnership status, transgender status, HIV status, social background, trade union membership or non-membership and is placed at a disadvantage by requirements or conditions that cannot be shown to be justifiable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the job: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Programme Support Officer to join the HEE NEY Regional Nursing Team. As Programme Support Officer you will work with other members of the HEE NEY Nursing Team and wider teams to ensure their workstreams and programmes are planned and managed effectively and that appropriate monitoring systems and processes are in place to ensure successful delivery.&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of the NEY Nursing Programme team working across a number of priority areas and will be expected to maintain positive relationships with internal and external stakeholders.&lt;/p&gt;\n&lt;p&gt;The ideal candidate would have a strong administrative background with experience of supporting senior managers, be highly motivated with an excellent working knowledge of MS Outlook, Word, Excel, PowerPoint and knowledge of project principles, techniques and tools, such as Prince 2 Foundation, Managing Successful Project or Microsoft Project.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who enjoys working as part of a team, as the role involves providing support across a range of programmes. They will be focused on delivery and capable of adapting to changing demands and priorities.&lt;/p&gt;\n&lt;p&gt;As Programme Support Officer your duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing high quality administrative and project support including coordinating the secretariat function for the NEY Nursing programme, working groups and meetings, as and when required.&lt;/li&gt;\n&lt;li&gt;Reporting and analysis of information to support delivery of programmes.&lt;/li&gt;\n&lt;li&gt;Monitoring all project plans and actions across the team, highlighting potential risks and delays in delivery&lt;/li&gt;\n&lt;li&gt;Co-ordinate internal and external meetings for the team including calendar invites, agendas, papers and minutes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 6 with a full-time starting salary of £31,365, with pay step increases as after 2 years’ service and 5 years&#39; service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jean Hayles, Interim Regional Head of Nursing&lt;/p&gt;\n&lt;p&gt;Email: jean.hayles@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 07825 272484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willow Terrace Road, Leeds", "postalCode": "LS2 9JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8085", "longitude": "-1.5528"}}, "title": "Programme Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251508", "validThrough": "2020-11-16T23:59:59+0000"}