{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 p.a. + L.W."}}, "datePosted": "2020-10-27T11:02:40+0000", "description": "&lt;p&gt;Locum Plastic Surgery Consultant&lt;br /&gt;&lt;br /&gt;The Royal Free London NHS Foundation Trust runs three hospitals in London: &lt;br /&gt;Barnet Hospital&lt;br /&gt;Chase Farm Hospital&lt;br /&gt;Royal Free Hospital&lt;br /&gt;&lt;br /&gt;The Royal Free Hospital was founded in 1828 to provide free healthcare to those who could not afford medical treatment. The title &#39;Royal&#39; was granted by Queen Victoria in 1837 in recognition of the hospital&#39;s work with cholera victims.&lt;br /&gt;&lt;br /&gt;In April 1991 the Royal Free Hampstead NHS Trust became one of the first NHS trusts established under the provisions of the NHS and Community Care Act 1990. On 1 April 2012 the trust was authorised as a foundation trust, under the name Royal Free London NHS Foundation Trust. In 2014, Barnet Hospital and Chase Farm Hospital joined our foundation trust, bringing further medical expertise and local care to the NHS services we provide. &lt;br /&gt;&lt;br /&gt;Barnet Hospital first provided healthcare in an infirmary in the Barnet Union Workhouse in 1838. Chase Farm Hospital began as a home for pauper children in 1884. In 2004 Chase Farm made European history, by carrying out the first total hip replacement procedure with the patient leaving hospital in just 27 hours. At the time in the UK, the average length of stay following a total hip replacement was 11 days.&lt;br /&gt;&lt;br /&gt;Across our three London hospitals, our vision is clear: to deliver world class expertise and local care. We combine globally recognised clinical expertise with local and friendly hospital care to represent the NHS at its best. Our mission is to be world class in terms of healthcare treatment, clinical research and teaching excellence. We aim to deliver and develop leading local healthcare in all three of our hospitals, to improve lives and help people thrive.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;The Plastics Surgery department is based within a clinical network that has been established the Royal Free Hospital as the hub of inpatient and complex care and a number of spokes around North London, and the Home Counties.&lt;br /&gt;&lt;br /&gt;In addition to the Royal Free Hospital, the trust manages plastic surgery services in the following locations:&lt;br /&gt;Mount Vernon Hospital&lt;br /&gt;Watford General Hospital&lt;br /&gt;St Albans City Hospital&lt;br /&gt;Barnet Hospital&lt;br /&gt;Chase Farm Hospital&lt;br /&gt;&lt;br /&gt;Services are also provided at the following sites:&lt;br /&gt;Northwick Park Hospital&lt;br /&gt;Hillingdon Hospital&lt;br /&gt;Edgware Community Hospital&lt;br /&gt;Luton &amp; Dunstable Hospital &lt;br /&gt;Whittington Hospital&lt;br /&gt;University College Hospital&lt;br /&gt;Heart Hospital &lt;br /&gt;Royal National Orthopaedic Hospital&lt;br /&gt;Harefield Hospital&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Locum consultant post- Plastic Surgery&lt;/p&gt;\n&lt;p&gt;A 12 month opportunity to join our busy and dynamic department that provides care both for the local population and much larger network around North London is available due to the current postholder taking a sabbatical.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of eighteen consultants. The department has a strong reputation for provision of care for patients in breast reconstruction, skin malignancy, hand surgery, facial palsy, sarcoma reconstruction, ear reconstruction and abdominal wall reconstruction. The unit offers support to a wide variety of specialties both within the Royal Free and across our wider network.&lt;/p&gt;\n&lt;p&gt;The unit has strong academic links and has an on-going research program including research fellows and a large well-established MSc program.&lt;/p&gt;\n&lt;p&gt;This post will focus on delivering patient centred care across primarily at the Royal Free Hospital but across the network of the plastic surgery service. The workload includes general plastic surgery, hand surgery and skin cancer surgery. Elective operating will be on Royal Free London NHS trust sites.&lt;/p&gt;\n&lt;p&gt;The post includes 10 programmed activities devoted to direct clinical care and 1 programme activities for supporting activities (CPD). There is an on-call commitment with this post which equates to a 1:7 rota &lt;br /&gt;&lt;br /&gt;The post is advertised as full-time (10 Programmed Activities).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Stephen Hamilton&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Director for Breast and Plastics Surgery&lt;/p&gt;\n&lt;p&gt;Email address: stephenhamilton@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 7794 0500 ext 31198&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact name: Shadi Ghali,&lt;/p&gt;\n&lt;p&gt;Contact job title: Plastics Clinical Service Lead&lt;/p&gt;\n&lt;p&gt;Contact email address: shadi.ghali@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Locum Consultant Surgeon in Plastic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244146", "validThrough": "2020-11-15T23:59:59+0000"}