{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "514668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £514,668 per annum"}}, "datePosted": "2020-11-05T14:13:01+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;The Cancer and Palliative Care Psychology Service at The Mid Yorkshire Hospitals NHS Trust is looking to recruit a full time HCPC registered Clinical Psychologist, at band 8a. This post provides an exciting opportunity to improve the psychological care of people with cancer and life limiting conditions. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful candidate will work as part of a small team, working into the Oncology and Palliative Care speciality within the Department of Clinical Health Psychology. The post is a permanent, full time position working across The Mid Yorkshire Hospitals Trust sites. The service is based primarily from Dewsbury and District Hospital, but clinical sessions in Wakefield (Pinderfields) and Pontefract Hospitals may also be required. Currently, the service is operating with a proportion of remote working; utilising video platforms for meetings and patient consultations. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In line with Nice Guidance, the post holder will provide level 3 and 4 psychological intervention to a range of patients with complex Oncology or Specialist Palliative Care needs. It is envisaged that the post holder will work closely with medical teams, offering consultancy, education and support to professional and non-professional colleagues. They will also contribute to service planning, audit and research processes. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from enthusiastic, highly motivated and resourceful individuals with strong skills in delivering psychological therapy, and experience of working effectively in multi-disciplinary teams in a physical health setting. Experience of offering clinical supervision is also preferred.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicants must hold a Doctorate Degree in Clinical Psychology and HCPC registration certificate. Clinical supervision and professional support will be provided by senior psychology colleagues. The successful applicant will be a member of the Clinical Health Psychology Department, which is a growing service, offering good opportunities for professional support and development. We actively encourage supervision, CPD and service-related research. As a department we have good academic links to local DClinPsy courses, and regularly take trainees from across the region. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;For further information or an informal chat, please contact Dr Anita Wraith, Consultant Clinical Psychologist, Tel: 01924 319312. Early applications would be encouraged. Please note that this vacancy may close before the advertised closing date if sufficient applications are received. Interviews to take place on 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; December 2020.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewsbury", "postalCode": "WF13 4HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7014", "longitude": "-1.65104"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258047", "validThrough": "2020-11-23T23:59:59+0000"}