{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro Rata Per Annum"}}, "datePosted": "2020-10-26T16:31:16+0000", "description": "&lt;p&gt;&lt;strong&gt;22.5 Hours Per Week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fixed term position from: 16.11.2020 - 12.11.2021 or sooner if possible&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Doncaster &amp; Bassetlaw Hospitals NHS Foundation Trust for an enthusiastic and motivated Optometrist to join our team of 11 Orthoptists, 3 Optometrists and 8 Ophthalmic Photographers. We are a forwards thinking department of operating from within a modern and vibrant Eye clinic at Doncaster Royal Infirmary. This post is for a part-time, 1 year fixed term contract to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;As part of the Orthoptic team, under the management of the Head Orthoptist, the successful candidate will be responsible for assisting in the delivery of a range of core optometry and extended role services. These will include paediatric ophthalmic assessments (involving refraction, typically under cycloplegia, ophthalmoscopy and providing corrective lenses through the hospital eye service prescription system. This post is also integral to the department’s paediatric ophthalmology, new-patient shared-care pathway.&lt;/p&gt;\n&lt;p&gt;Applicants must be in possession of an optometry degree and hold current registration with the General Optical Council. Previous clinical experience would be desirable. Any offer would be dependent upon a successful DBS review and Occupational Health assessment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ian Dawson - Head of Orthoptic services, ian.dawson1@nhs.net, (01302) 644515&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster Royal Infirmary, Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Optometrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243422", "validThrough": "2020-11-16T23:59:59+0000"}