{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T12:16:07+0000", "description": "&lt;p&gt;The Medical Education Faculty Team within Aneurin Bevan University Health Board is a cohesive team of clinicians and managers who work closely together to monitor, develop and continually improve the educational experience and environment for our medical workforce, from medical student to Consultant.&lt;/p&gt;\n&lt;p&gt;ABUHB are seeking to appoint an enthusiastic and dynamic Medical Education Manager to join the Medical Education Faculty Team and to support the Head of Medical Education in maintaining and developing medical education services across the Health Board.&lt;/p&gt;\n&lt;p&gt;Working closely with the Foundation Programme Director, the successful applicant will provide administrative and managerial support for Foundation Training across the Health Board in line with the GMC standards for Medical Education and the ongoing developments in the Wales Foundation School and HEIW.&lt;/p&gt;\n&lt;p&gt;In addition, the successful applicant will provide operational management for the Multidisciplinary Education Centre at the Royal Gwent Hospital, providing support and management for the staff within the Education Centre Team and overseeing the activities of the Centre.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be of graduate caliber and be able to demonstrate excellent managerial skills with strong team management experience. Excellent interpersonal and organisational skills are essential, as is the ability to think, plan and act both operationally and strategically. In addition, applicants must have a proven ability to learn quickly in a continually changing environment and be able to communicate and influence at all levels. An understanding of the medical workforce structures within the NHS and experience in supporting and developing education programmes is also desirable.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Linda Coe&lt;br /&gt;Linda.Coe@wales.nhs.uk&lt;br /&gt;01633 238127&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital The Friars Education Centre, Newport", "postalCode": "NP20 4EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5815", "longitude": "-3.00138"}}, "title": "Medical Education Manager (Foundation)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252009", "validThrough": "2020-11-16T23:59:59+0000"}