{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum (pro rata)"}}, "datePosted": "2020-10-29T10:01:28+0000", "description": "&lt;p&gt;We are looking for clinically excellent, motivated and enthusiastic doctors. You will join a rota of 25 middle grade doctors to provide full shift cover. The contract is for 48 hours a week. This is an exciting time to join the Trust and be part of the newly built state of the art Emergency Care Department&lt;/p&gt;\n&lt;p&gt;The Accident and Emergency Department sees approximately 90,000 new patients a year. Medical Staff consists of 11 WTE Consultants, 25 Specialty doctors and 19 junior trainees. It has excellent case mix including paediatrics, major trauma, and critically ill Medical and Surgical patients, which presents an excellent educational opportunity. The department facilities include a 5 bedded resuscitation room, dedicated Children&#39;s waiting and examination areas, in addition to Minor injuries and Majors/Respiratory Majors cubicle areas. Unique initiatives such as Greet and Treat and RAPT contribute to an excellent environment for staff to provide quality healthcare.&lt;/p&gt;\n&lt;p&gt;The Emergency Medicine Consultants are committed to providing experience and training to their staff in all areas of Emergency Medicine. Formal and informal teaching is provided and educational advancement and audit will be actively encouraged and supervised in working hours, within a 48-hour rota. There is an active senior doctor teaching programme both locally and regionally. As part of the further training for Specialty doctors, we are planning to offer secondment to essential specialities that form part of the emergency medicine curriculum e.g. acute medicine, paediatrics, ITU &amp; anaesthesia. This would be tailored to the needs of the individual doctor.&lt;/p&gt;\n&lt;p&gt;Successful post holder will be expected to lead the assessment, resuscitation, management and safe transfer (where necessary) of seriously ill and injured patients. Provide supervision to junior staff and undertake regular teaching and education sessions. You would be required to play an active role in the day-to-day management and administration of the Emergency department, ensuring all targets are achieved and high quality, safe patient care is delivered.&lt;/p&gt;\n&lt;p&gt;Candidates should have evidence of completion of 12 months internship and successfully passed PLAB or, hold an acceptable postgraduate qualification recognised by the GMC, or previously held GMC registration.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr. Edward LamurenJob titleClinical DirectorEmail addressedward.lamuren@btuh.nhs.ukTelephone number01268 524 900 Ext 2866Additional contact information&lt;/p&gt;\n&lt;p&gt;Sheena Nicholson - Service Unit Manager, A&amp;E and Acute Medicine&lt;/p&gt;\n&lt;p&gt;01268 524 900 Ext 2868&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon Hospital, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Accident and Emergency Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247799", "validThrough": "2020-11-16T23:59:59+0000"}