{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Please See Description"}}, "datePosted": "2020-11-06T16:17:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Trainee Care Support Worker&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Plymouth Hospitals NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £8.72 Saturdays/Nights: £12.46 Sunday/Bank Hols: £16.13&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking to kickstart a career with the NHS? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You can, through our Care Support Worker Development (CSWD) programme.&lt;/p&gt;\n&lt;p&gt;We have a unique opportunity to learn on the job and work towards a care certificate at Plymouth Hospitals NHS Trust. By completing this programme it will help you build and develop the key skills and experience you need to become a Care Support Worker (CSW), all whilst receiving weekly pay, paid annual leave and all the other great benefits NHS Professionals offers our bank members. Once you have successfully completed the programme you will be able to work flexibly at any of our partner Trusts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What the programme involves …&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;During our programme you will learn how to help to maintain a safe care environment in the ward/department, supporting with infection control, providing care, safety and welfare for patients, visitors and other staff.&lt;/p&gt;\n&lt;p&gt;You will work as part of the healthcare team, supporting registered nurses and other healthcare practitioners to meet the daily living needs of the patient from Hygiene to personal and physical comfort.&lt;/p&gt;\n&lt;p&gt;At least 30 hours per week for 6 months (earlies, lates and nights pro rata)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Typical duties will involve:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out clinical procedures/tasks as required.&lt;/li&gt;\n&lt;li&gt;Undertake and record a range of physiological measurements e.g. temperature, pulse, respirations, blood pressure, oxygen saturation, blood glucose monitoring&lt;/li&gt;\n&lt;li&gt;Other clinical tasks will be determined by the nature of your work and local policy eg: monitoring the effects of medication; taking ECGs; caring for individuals with catheters or nasogastric tubes, insertion / removal of intravenous cannula, venipuncture&lt;/li&gt;\n&lt;li&gt;Prepare and carry out extended feeding techniques e.g. nasogastric, gastrostomy feeds.&lt;/li&gt;\n&lt;li&gt;Obtain and test samples and other specimens&lt;/li&gt;\n&lt;li&gt;Clearing and re-stocking consulting rooms&lt;/li&gt;\n&lt;li&gt;Contribute to discharge process&lt;/li&gt;\n&lt;li&gt;Care of wounds&lt;/li&gt;\n&lt;li&gt;Check pain levels and requesting pain relieving medication on patient’s behalf&lt;/li&gt;\n&lt;li&gt;Assist in preparing for clinical procedures and clearing the environment afterwards as appropriate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for… &lt;/strong&gt;Someone who maintains the values and a passion for care following the six enduring values and behaviors that underpin ‘compassion in practice’, the national vision and strategy for nursing, midwifery and care staff.&lt;/p&gt;\n&lt;p&gt;The 6Cs are defined as: Care, Compassion, Competence, Communication, Courage, Commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note thisrole is NOT suitable for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Due to the program’s strict requirement you must be available for at least 30 hours a week, during your training and placement period.&lt;/li&gt;\n&lt;li&gt;You much be over the age of 18 or turning 18 before the planned classroom training week.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What’s next? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Attendance of Assessment Day&lt;/strong&gt; – Planned for 2 dates 1 avaiable 8th December the other 15th December 2020&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Attendance of FREE classroom training&lt;/strong&gt; – Planned for 19th - 23rd January 2021&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Attend an Induction week: &lt;/strong&gt;37.5 hours supervised placements – Planned for December&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Career progression&lt;/strong&gt;– Receive a Care Certificate and enhance your prospects with the NHS.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Provide patient care &lt;/strong&gt;- Provide care, safety and welfare for patients.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Join the NHS family &lt;/strong&gt;- Become part of a healthcare team&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated training &lt;/strong&gt;- support from your ward / area and skilled mentors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Weekly pay &lt;/strong&gt;- Work this week, get paid next week.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Paid annual leave – &lt;/strong&gt;Build holiday allowance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Once you have completed the programme &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Once you have completed your development period, you take a knowledge-based assessment on the Care Certificate 15 Standards, once passed, you can work as a CSW for the Trust at any of their locations, and at any of NHS Professionals partner Trusts, through the bank.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register your interest to the CSWD programme today and on successful completion, you will be placed onto at least a 6-month full time placement.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Trainee Care Support Worker Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260584", "validThrough": "2020-11-29T23:59:59+0000"}