{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum, Pro rata"}}, "datePosted": "2020-11-04T12:46:08+0000", "description": "&lt;p&gt;We have an exciting opportunity for a suitably qualified HCPC registered Biomedical Scientist (BMS) to work in the Blood Sciences Department at the University Hospitals Leicester NHS Trust.&lt;br /&gt;&lt;br /&gt;The successful candidate will possess a degree or equivalent qualification approved by the IBMS/HCPC. Preference will be given to individuals who already hold HCPC state registration however applications for a Trainee Band 5 position may be considered.&lt;br /&gt;&lt;br /&gt;The successful candidate will be working in the Special Chemistry section of the Blood Sciences department. Special Chemistry provides a clinical and forensic toxicology service as well as providing specialist chemistry testing associated with a large teaching hospital. The department has established itself as a National Centre for Drug Adherence Testing.&lt;/p&gt;\n&lt;p&gt;The department is equipped with Siemens Immulite, Tosoh G11s, DS2, HPLC, LC/MS/MS, GC/MS, GC-FID, GC-TCD and Q-ToF. Although there will be a requirement to work at any of the Hospital sites as appropriate for the delivery of the service, any time over a 24/7 period, the primary site will be Leicester Royal Infirmary (LRI).&lt;br /&gt;&lt;br /&gt;You will be a motivated team member who is able to prioritise and work on their own initiative with minimal supervision. You must be able to demonstrate good written and verbal communication skills and be capable of working accurately and efficiently under pressure. Previous experience with Pathology computer systems is desirable.&lt;br /&gt;&lt;br /&gt;You must also be able to demonstrate participation in Continuing Professional Development.&lt;br /&gt;&lt;br /&gt;Please note that this vacancy will close as soon as sufficient number of applications are received. If you are interested in this post we advise that you apply as soon as possible&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Finlay Hollingworth&lt;/p&gt;\n&lt;p&gt;Job title:Deputy Service Manager&lt;/p&gt;\n&lt;p&gt;Email address:finlay.hollingworth@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number:0116 258 6574&lt;/p&gt;\n&lt;p&gt;Additional contact information:finlay.hollingworth@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Visits to the department are welcomed.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHL, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255908", "validThrough": "2020-11-18T23:59:59+0000"}