{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "-"}}, "datePosted": "2020-10-28T15:50:45+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Consultant Physician in Palliative Care and Clinical Lead for the Palliative Care service. You will join a supportive and warm working culture at The London Clinic where your contribution is valued, and you can help us provide the best, personalised healthcare. This post is complementary to the vision of The London Clinic in strengthening clinical leadership in all areas of patient care.&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest private hospitals, with state-of-the-art facilities located on Harley Street. We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Profile&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The London Clinic currently provides end of life care to a significant and growing number of people living in London and across the UK. We also serve a growing International patient caseload. You will provide a consultant led palliative care service that is provided to the patients free of charge (i.e. you will not be expected to invoice patients or insurers and you will instead be directly remunerated by the London Clinic).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Location:&lt;/strong&gt; This role is located at our main hospital facility in London, W1G 6BW (Close to Regents Park &amp; Baker Street tube stations).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Job Type:&lt;/strong&gt;  This is a part-time consultant post. The expected time requirement will be 4 half days (PAs) per week. We will be happy to consider suitable candidate(s) who might wish to job share.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Salary:&lt;/strong&gt; Remuneration for this role will be £60,000 per annum assuming an activity of 4 half-days (4PAs) per week (i.e. one half day per week will amount to £15,000 per annum).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Duties&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivery of consultant level medical care to palliative care inpatients using a holistic approach, as well as the provision of a twice weekly Consultant ward round with consultant input and advice to the Multi-Disciplinary team.&lt;/li&gt;\n&lt;li&gt;As a senior physician you will work in close co-operation with, and support other clinical, medical professional and managerial colleagues in providing high quality care.&lt;/li&gt;\n&lt;li&gt;Provide expert advice to users of this service, potentially referring doctors and department staff in   accordance with established protocols, professional guidelines and appropriate patient pathways.&lt;/li&gt;\n&lt;li&gt;Work with the palliative care nurses to ensure the highest standards of clinical effectiveness and   governance within the Clinic.&lt;/li&gt;\n&lt;li&gt;Ensure that senior management and the Clinic’s Medical Advisory Committee are made aware of new developments, professional guidelines or statutory legislation that may have an impact on the service.&lt;/li&gt;\n&lt;li&gt;Work closely with the Director of Nursing/Matron to support the development and implementation of the strategy and operational plans of The London Clinic with respect to palliative care.&lt;/li&gt;\n&lt;li&gt;Represent the department at the Cancer Services Forum, as well as Multi-Disciplinary meetings and other meetings as is appropriate.&lt;/li&gt;\n&lt;li&gt;Provision of support to patients&#39; families including participation in family meetings as required, as well as participation in educational activities to promote Palliative Care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full Registration with GMC and name on Specialist Register with a registerable medical qualification and MRCP/FRCP.&lt;/li&gt;\n&lt;li&gt;Experience at the Consultant level of delivering palliative and end of life care.&lt;/li&gt;\n&lt;li&gt;Experience in leading/managing a team with the ability to demonstrate leadership capability within multi-disciplinary teams.&lt;/li&gt;\n&lt;li&gt;Proven track record of publication and presentation, as well as working knowledge of regulations and thorough understanding of principles of medical audit, having undertaken and completed audit projects. &lt;/li&gt;\n&lt;li&gt;Experience of undergraduate and post-graduate teaching. &lt;/li&gt;\n&lt;li&gt;Effective communicator who is flexible and reliable, and demonstrates a professional attitude at all times.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The London Clinic has approx. 1300 employees, across 8 sites where we cover a broad range of specialisms, including complex medical and surgical procedures and a comprehensive range of cancer services. Our main hospital spans 8 floors comprising of 234 beds, 10 theatres, and an intensive care unit.&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5228", "longitude": "-.150708"}}, "title": "Consultant Physician &amp; Clinical Lead - Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247268", "validThrough": "2020-11-15T23:59:59+0000"}