{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-19T10:46:07+0100", "description": "&lt;p&gt;&lt;strong&gt;About the Trust ….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The United Lincolnshire Hospitals NHS Trust was formed in April 2000 by the merger of the three former acute hospital trusts in Lincolnshire, creating one of the largest Trusts in the country.&lt;/p&gt;\n&lt;p&gt;We provide a comprehensive range of hospital-based medical, surgical, paediatric, obstetric and gynaecological services to the 700,000 people of Lincolnshire and beyond.&lt;/p&gt;\n&lt;p&gt;Our healthcare services are delivered by approximately 7,800 highly trained staff and volunteers. Our services cost £360m each year to provide, most of which are bought by NHS Lincolnshire .&lt;/p&gt;\n&lt;p&gt;We invest around £18 million each year in improving our clinical services by replacing and upgrading medical equipment, modernising estate and facilities and improving information and technology infrastructure. Each year, we treat more than 180,000 accident and emergency patients and carry out more than 69,000 procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Department….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Anaesthetic Department at Pilgrim Hospital currently includes 17 Consultants, 12 Specialty Doctors, 3 Speciality Trainees and 6 Core Trainees. The trainee grades are on rotation from the Leicester School of Anaesthesia. There is a separate consultant rota for Intensive care.&lt;/p&gt;\n&lt;p&gt;The Department is keen to promote flexible working hours and continuing professional development with protected and funded study leave. Trainees work a 48-hour EWTD compliant working week. The Department is committed to the development of both clinical and other special interests.&lt;/p&gt;\n&lt;p&gt;The combined ITU/HDU currently has 9 beds. The ITU is a newly refurbished facility and has capacity for 12 beds. The ITU is actively involved in Mid Trent Critical Care Network service improvement and audit initiatives. The Mid Trent Critical Care Network is one of the most active in the country and supports a large number of quality, service improvement and audit initiatives. The unit has an experienced and enthusiastic senior nursing staff as well as two highly experienced critical care technicians, a clinical nurse educator and an outreach service.&lt;/p&gt;\n&lt;p&gt;The Anaesthetic Department is part of United Lincolnshire Hospitals – a Trust with three acute sites in Boston (Pilgrim), Grantham and Lincoln. Pilgrim Hospital is a well-equipped DGH with 369 beds which has gradually undergone refurbishment and expansion. The hospital has an A &amp; E department and inpatient facilities for general surgery and medicine, vascular surgery, urology, orthopaedic, ENT and maxillo-facial surgery, paediatrics, obstetrics and gynaecology. There is also an active pain management service within the department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the provision of a high quality, consultant led service. The Appointee will be expected, in conjunction with his/her colleagues, to provide a comprehensive Anaesthetic service to ULHT.&lt;/p&gt;\n&lt;p&gt;The postholder’s duties will be primarily at&lt;strong&gt; Pilgrim Hospital, Boston, Lincolnshire,&lt;/strong&gt; but it is a condition of the appointment that the postholder will be willing to work in any of the Trust’s locations or outreach district general hospital clinics.&lt;/p&gt;\n&lt;p&gt;In addition he/she will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake such other duties as may be identified to meet the needs of the service.&lt;/li&gt;\n&lt;li&gt;Take part in 1:11 Consultant weekday night and weekend oncall and to provide, on a reciprocal basis, emergency cover for colleagues during periods of absence.&lt;/li&gt;\n&lt;li&gt;Have continuing responsibility for patients in his/her care and for the proper functioning of the department.&lt;/li&gt;\n&lt;li&gt;Take part in team, department audits.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to partake in teaching activities for junior doctors in training and medical students.&lt;/p&gt;\n&lt;p&gt;The Job Plan and duties will be reviewed and updated on a regular basis in line with demands of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr R Jaganathan&lt;/p&gt;\n&lt;p&gt;Consultant Anaesthetist/Site representative for Anaesthesia&lt;/p&gt;\n&lt;p&gt;Via switchboard 01205 364801&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr N Thiagarajan&lt;/p&gt;\n&lt;p&gt;Consultant Anaesthetist and Trustwide Clinical Lead for Anaesthesia&lt;/p&gt;\n&lt;p&gt;Via switchboard 01522 512512&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameZoe WilkinsonJob titleTACC Support ManagerEmail addresszoe.wilkinson@ulh.nhs.ukTelephone number01205 445293&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231855", "validThrough": "2020-11-19T23:59:59+0000"}