{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "Approx. £39,000 P.A (full time equivalent)"}}, "datePosted": "2020-10-29T09:29:22+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Nurse / Paramedic (Forensic Custody Healthcare Professional) - Milton Keynes&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mountain Healthcare Limited is pleased to offer an exciting opportunity for passionate healthcare professionals based in the Thames Valley region.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mountain Healthcare believe in recruiting the highest quality nurses and paramedics to support their service delivery model, with the ethos that we care for each other and do the best we can! We believe we can make a real difference to those who are vulnerable within the criminal justice system and would love for you to join our team.&lt;/p&gt;\n&lt;p&gt;The role will involve conducting clinical assessments, identifying and implementing appropriate interventions, collecting forensic samples, providing advice and guidance and maintaining detailed and accurate records to ensure the health, safety and welfare of detained persons held in police custody. You will also attend cases in the community, attending hospitals, homes and other locations which may include confirmation of deaths and intimate searches.&lt;/p&gt;\n&lt;p&gt;We love a quality improvement project and recognise achievements with awards and bonuses!&lt;/p&gt;\n&lt;p&gt;For this role you must be either a Registered General Nurse or a Registered Paramedic. Preferably you will have experience in a relevant speciality such as A&amp;E, Walk in Centre, Paramedic Practitioner, Substance Misuse, Community Nursing, Police Custody, Prison or other relevant discipline. Full training will be provided along with an ongoing development and support programme.&lt;/p&gt;\n&lt;p&gt;The salary for this post would be £39,000 per annum (pro-rata, full time equivalent) based on an average of the varying shift rates of pay (enhancements for weekends, nights and bank holidays).&lt;/p&gt;\n&lt;p&gt;The post-holder will need to enjoy autonomous practice and complex decision making. Following the completion of the mandetory training progranmme you will be confident in managing medical emergencies as Novel Psychoactive Substances and acute presentations. We expect a lot from you, however, we promise to support your development with training opportunities, provide supervision and mentoring, always have senior clinical advice available remotely and we listen!&lt;/p&gt;\n&lt;p&gt;Successful applicants will ideally live within easy reach of the Milton Keynes custody suite and have access to transport for additional travel if required.&lt;/p&gt;\n&lt;p&gt;For more information about the service please read the Job Description attached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mountain Healthcare is committed to safeguarding, and promoting the welfare of the people we serve. Therefore, all successful candidates will subject to pre-employment checks, including an Enhanced DBS Check, Police Vetting and satisfactory employment reference (s)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes", "postalCode": "MK9 2DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0415", "longitude": "-.766668"}}, "title": "Nurse/Paramedic (Forensic Custody Healthcare Professional) MK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247728", "validThrough": "2020-11-12T23:59:59+0000"}