{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45214", "minValue": "38903", "unitText": "YEAR", "value": "£38,903 to £45,214 per annum"}}, "datePosted": "2020-11-05T15:59:43+0000", "description": "&lt;h1&gt;COMMUNITY CLINICAL NURSE SPECIALIST&lt;/h1&gt;\n&lt;h2&gt;SALARY RANGE £38,903 TO £45,214 PER ANNUM&lt;/h2&gt;\n&lt;h2&gt;FULL TIME 37.5 HOURS PW - PERMANENT&lt;/h2&gt;\n&lt;p&gt;The Specialist Community &amp; Crisis Support service provides 24 hour specialist advice, support and facilitation of care for those persons with complex symptom management due life limiting illness and support to carers of the individual within the home setting or at a nurse led clinic environment.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a dynamic, enthusiastic, self-motivated, experienced nurse with excellent clinical palliative care knowledge base, to join our well-established specialist community service as a Clinical Nurse Specialist. This post will provide varied senior experience in a multidisciplinary working environment delivering a 24/7 service by telephone, out-patients and in the home setting, to individuals, carers and other health care professionals in the community.&lt;/p&gt;\n&lt;p&gt;The Specialist Community &amp; Crisis Support Service works within the boundaries of Barking &amp; Dagenham, Havering, and Brentwood and provides out of hours advisory telephone support to include Redbridge. Working collaboratively with other internal and external health care professionals is an essential part of the specialist service.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate who has excellent communication, assessment and prioritisation skills, and understands the needs of those receiving palliative care /end of life care, a working knowledge of evidence based practice and the ability to develop a good knowledge base of current initiatives and developments in palliative care.&lt;/p&gt;\n&lt;p&gt;Any community experience with lone working involved would be valuable in addition to the non-medical prescribing qualification or working towards.&lt;/p&gt;\n&lt;p&gt;Relevant experience of working at a senior level, managing a clinical caseload is essential with appropriate supporting qualifications and as well as any evidence of appropriate leadership learning.&lt;/p&gt;\n&lt;p&gt;Would you like to share your specialist palliative care skills and expertise with us? In return we offer a variety of staff support options, professional development opportunities, excellent team working and a supportive working environment. Superannuation can be continued.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this opportunity further please contact Maria Stripe/Jane Elmer SCCS Team Leaders on 01708 758643 Ext 2343 or Lesley Burrows Head of Community Services on Ext 2208.&lt;/p&gt;\n&lt;p&gt;Please note that a DBS (Disclosure &amp; Barring Service) check will be undertaken as part of our pre-employment screening for the successful candidate.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Applications will be sent for shortlisting upon receipt, therefore interviews will take place on an ongoing basis and shortlisted candidates will be given at least 7 days notice by email of invitation to interviews.&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;All communication regarding your application including invitations to interviews will be sent to the email address you have stated on your application form and not via your NHS Jobs account. Therefore please ensure that you provide your email address. Please note that if you do not get a response to an application within two weeks of the closing date, then you have been unsuccessful on this occasion.&lt;/p&gt;\n&lt;p&gt;Please provide contact business email addresses for your referees one of which must be your current or most recent employer.&lt;/p&gt;\n&lt;p&gt;Saint Francis Hospice is a centre of excellence in the care of those with life limiting illnesses. Our team of specialist consultants, doctors, nurses and health care assistants provide practical and emotional support for adults of all ages and give specialist bereavement support to family members from as young as 20 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE THAT SAINT FRANCIS HOSPICE IS A CHARITY AND NOT PART OF AN NHS TRUST. THE HOSPICE IS SITUATED IN A QUIET LOCATION IN THE VILLAGE OF HAVERING-ATTE-BOWER ON THE OUTSKIRTS OF ROMFORD; THEREFORE YOU ARE ADVISED TO CONSIDER OUR LOCATION WHEN APPLYING.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Organisational Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These values underpin all that our charity aspires to do and shape our external and internal behaviour.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SUPPORTIVE&lt;/strong&gt; - I will actively listen to, engage with and show appreciation for everyone I meet.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COMPASSIONATE&lt;/strong&gt; - I will treat everyone with kindness, compassion and dignity and as an individual.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INCLUSIVE &amp; RESPECTFUL&lt;/strong&gt; - I will value and respect everyone&#39;s difference3s and individuality and appreciate others&#39; experience, skills and needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PROFESSIONAL&lt;/strong&gt; - I will always be professional and deliver a high quality service, which is responsive to need, always seeking to give my best.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ALWAYS LEARNING&lt;/strong&gt; - I will embrace change, learn and adapt to meet the changing needs of local people and the Hospice as our world adapts and changes around us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Saint Francis Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havering-atte-Bower, outskirts of Romford", "postalCode": "RM4 1QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.617", "longitude": ".196975"}}, "title": "COMMUNITY CLINICAL NURSE SPECIALIST", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258449", "validThrough": "2021-01-06T23:59:59+0000"}