{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T09:43:56+0000", "description": "&lt;p&gt;The Community Integrated Care Bureau manages all “Discharge to Assess” referrals (pathway 1, 2 &amp; 3) and facilitates discharge from the hospital for those service users with on-going complex needs . We are looking for enthusiastics health care professional to join our team of case-managers supporting timely discharges..&lt;/p&gt;\n&lt;p&gt;In response to Covid-19, in addition to providing case-management of patient into our Home First (pathway 1) and Community rehabilitation beds (pathway 2) we also support the decision making and co-ordination for Pathway 3 for patients requiring on-going social care assessment out of hospital as part of the Community Integrated Care Bureau.&lt;/p&gt;\n&lt;p&gt;Are you a registered nurse, occupational therapist, physiotherapist or other AHP.&lt;/p&gt;\n&lt;p&gt;Are you passionate about ensuring patients receive the right care and rehabilitation and in the right place following a hospital admission?&lt;/p&gt;\n&lt;p&gt;To you enjoy working in a fast-paced environment?&lt;/p&gt;\n&lt;p&gt;As a Case-Manager you will utilise your expert assessment, problem-solving, clinical reasoning and communication skills throughout the day to work remotely with service users, their families and the hospital team to develop discharge plans and identify the most appropriate pathway for discharge. You will work in partnership with health and social care colleagues to support safe and timely discharges out of the acute setting.&lt;/p&gt;\n&lt;p&gt;The Case Managers are based in the CICBs in each of the 3 geographical Localities-&lt;br /&gt;Bristol- The Withywood Centre&lt;br /&gt;North Somerset- Castlewood&lt;br /&gt;South Gloucestershire- Kingswood Civic Centre&lt;/p&gt;\n&lt;p&gt;You will need to have an in-depth understanding of rehabilitation pathways, discharge planning and mental capacity issues, alongside excellent interpersonal and negotiation skills IT skills as essential as is the ability to analyse data and use it to lead service transformation.&lt;/p&gt;\n&lt;p&gt;In return, we will give you the opportunity to develop your skills in leadership and multidisciplinary working; provide you with regular training and supervision and enable you to become involved in future service developments.&lt;/p&gt;\n&lt;p&gt;The Service operates 7 days a week between 08:00 – 18:00 and we offer flexible working patterns including 9 day fortnights and working from home.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;br /&gt;Emma Farwig – CDCC Team Manager (Bristol) 07979 770338 (Monday – Wednesday)&lt;br /&gt;Karen Green – CICB Operational Lead (NS) 07810630112&lt;br /&gt;Gayle Bryant- CICB Operational Lead- (SG) 07920703466 or at gayle.bryant@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BNSSG wide based in Bristol, South glos and North Somerset", "postalCode": "BS15 9TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4627", "longitude": "-2.50131"}}, "title": "Community Integrated Care Bureau - Case manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255214", "validThrough": "2020-11-15T23:59:59+0000"}