{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 Per Annum, Pro Rata + 5% HCAS"}}, "datePosted": "2020-10-27T10:16:06+0000", "description": "&lt;p&gt;We are seeking a suitably qualified HCPC state registered Biomedical Scientist with a minimum of 3 years post registration experience to join our busy Microbiology team based within the hospital setting at Princess Alexandra Hospital in Harlow Essex.&lt;/p&gt;\n&lt;p&gt;The department currently processes 270,000 samples per annum including a serology section, which is partly integrated with the Biochemistry department for the use of the Abbott Alinity analysers. The laboratory is also equipped with a BacTalert 3D, , Autoscan, Bruker Maldi-tof, IQ 200 automated urine microscopy analyser, Mast Urisystem, Roche COBAS 4800 for CT/NG dual PCR testing, Aus Diagnostics platform and VIDAS serology analyser. The laboratory is ISO 15189 UKAS accredited.&lt;/p&gt;\n&lt;p&gt;Good organisational and communication skills will be required along with up-to-date knowledge of microbiology. You should have enthusiasm and have the ability to work on your own or as part of a team. You are required to train more junior members of the team and play supportive role to the Senior BMS’. You will be responsible for maintaining a high standard of professional expertise and quality.&lt;/p&gt;\n&lt;p&gt;You will be encouraged to maintain professional and personal development and will be expected to participate in a single disciplinary on call service when appropriate.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registration with the Health Professions Council as a Biomedical Scientist.&lt;/li&gt;\n&lt;li&gt;Specialist Diploma in Microbiology/Virology or equivalent.(for band 6)&lt;/li&gt;\n&lt;li&gt;Continual professional development and maintenance of up to date knowledge of new technologies and methodologies is required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;3 years post registration experience in Microbiology (for band 6)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie OrrissJob titleMicrobiology Laboratory ManagerTelephone number01279 444455 x7138 or 2726&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PAH, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Band 5/6 Specialist Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243968", "validThrough": "2020-11-10T23:59:59+0000"}