{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15801", "minValue": "14860", "unitText": "YEAR", "value": "£8.84 - £9.40 per hour plus enhancements"}}, "datePosted": "2020-10-16T09:40:47+0100", "description": "&lt;p&gt;Nursing Assistant – Hospice at Home – Thorpe Hall Hospice&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge and the opportunity to make a real difference within your community? Would you like to feel valued in your role and learn from the experts?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Hospice at Home teams provide specialist hands-on care and support in people’s homes or usual place of residence when they are approaching the end of their life. The expanded service will be available day and night, giving patients and families specialist support at a very difficult time.&lt;/p&gt;\n&lt;p&gt;We are seeking compassionate and dedicated Nursing Assistants to join our expanding Hospice at Home Service providing palliative and end of life care in the Greater Peterborough community in full or part time positions.&lt;/p&gt;\n&lt;p&gt;You will be based at Thorpe Hall Hospice and we pay you for the whole shift regardless of how many visits are undertaken. Mileage is paid at 45p per mile during shift times&lt;/p&gt;\n&lt;p&gt;About the Role:&lt;/p&gt;\n&lt;p&gt;The service runs 7 days per week , 24 hours per day. We are looking for people who are flexible to work both day and night shifts.&lt;/p&gt;\n&lt;p&gt;Day shifts will be split to cover 8am – 8pm or 8am - 10pm&lt;br /&gt;Night sitting shifts – 10pm – 7am&lt;/p&gt;\n&lt;p&gt;The successful applicants will play an active role within our team, providing excellent personalised care, enabling patients to be cared for in their own homes surrounded by their families and loved ones. It&#39;s all about giving them the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;/p&gt;\n&lt;p&gt;About you:&lt;br /&gt;• Relevant experience in Palliative or End of Life Care is ideal however care experience in a similar setting is essential.&lt;br /&gt;• Access to your own transport is essential.&lt;br /&gt;• You will need to be able to demonstrate the ability to work well within a team as well as on your own, use initiative, organise your workload and have excellent communication skills.&lt;br /&gt;• You must be IT literate as this role requires remote working with a Laptop&lt;/p&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;Thorpe Hall is a Sue Ryder hospice, based in Peterborough. We’re here for people aged 18 and over who are living with conditions like cancer, heart failure and lung disease. We offer a range of support to patients and their families including inpatient care in our 20 bed hospice, a day service for those with long-term conditions and support in the community through our befriending, Hospice at Home and bereavement services.&lt;/p&gt;\n&lt;p&gt;Benefits:&lt;br /&gt;• Competitive enhanced pay for nights (30%), weekends (45%) and public holidays (60%)&lt;br /&gt;• Mileage allowance 45p pence per mile&lt;br /&gt;• Continuation of NHS pension**&lt;br /&gt;• Company pension scheme&lt;br /&gt;• Cash referral bonus scheme&lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;• Staff discounts of 15% at the Sue Ryder online shop&lt;br /&gt;• Free parking, subsidised meals &amp; drinks&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Development opportunities for all through our structured development framework&lt;/p&gt;\n&lt;p&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5729", "longitude": "-.277057"}}, "title": "Senior Nursing Assistant - Hospice at Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229462", "validThrough": "2020-11-15T23:59:59+0000"}