{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-08T11:15:15+0100", "description": "&lt;p&gt;For this post we are offering all registered nurses an attractive employment package, including a welcome payment of £2,500 (paid in two instalments during year one) and £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package** In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD.&lt;/p&gt;\n&lt;p&gt;The Vales are seeking to recruit a dynamic Staff Nurse to join their developing team in their 15 bedded female high dependency locked rehabilitation inpatient unit at Discovery House. Applicants must possess attitudes and values that reflect the excellent standards we are expecting within the Vales team.&lt;/p&gt;\n&lt;p&gt;The Vales provides assessment and intervention for women with severe and enduring mental ill-health in a locked environment to support their ongoing recovery and social integration. The whole service is focused on working towards independence and recovery to enable service users to regain health and mental wellness before moving on to live as independently as possible in an open environment or their local communities.&lt;/p&gt;\n&lt;p&gt;In return we will offer the opportunity to be part an excellent and developing team that holds the highest possible values and work ethic within a purpose built environment. You will have a planned induction and work within a robust framework of regular professional supervision and you will have opportunities for development as your experience increases.&lt;/p&gt;\n&lt;p&gt;If you want to be part of our team and take advantage of this exciting opportunity then we will be happy to hear from you. Applicants must be a Registered Nurse in Mental Health or Learning Disability and be able to work a range of flexible hours to include nights and weekends.&lt;/p&gt;\n&lt;p&gt;Although this post is currently on the Vales the successful candidate may be required to work in other areas of the Rehab and Forensic services when required.&lt;/p&gt;\n&lt;p&gt;For further information please contact Ward Manager Emma Duncan on 01522 597961 or email Emmaduncan@nhs.net&lt;/p&gt;\n&lt;p&gt;We offer 24 hour services within our Inpatient, Crisis and SPA teams, if you are successfully appointed to posts in these areas or others that might have specified, you will be required to work unsociable hours and shift patterns.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;** Eligibility criteria applies, for more information contact Recruiting Manager.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Discovery House, St George&#39;s Hospital Site, Long Leys Road, Lincoln, Lincolnshire", "postalCode": "LN1 1FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2443", "longitude": "-.558276"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217996", "validThrough": "2020-11-15T23:59:59+0000"}