{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "£53,168"}}, "datePosted": "2020-11-02T16:04:30+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;In this Clinical Safety Officer, Agenda for Change role, you will join a wide ranging pool of clinicians from different professions. You will play a key role in shaping the safe delivery of national programmes to provide clear benefits for citizens and patients, and support clinicians to provide better care. &lt;/p&gt;\n&lt;p&gt;Please note this role is 22.5 hours per week, available as a secondment or as a Fixed Term Contract for 12 months.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Clinical Safety Officer you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Provide Clinical Safety Support to the NHS Digital Clinical Safety Team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support Clinical Safety incident management and incident management in the live environment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Work collaboratively with NHS Digital Safety Engineers and with other NHS Clinical leads in NHS Digital and NHS England.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Help with the design and delivery of the NHS Digital  Clinical Safety Training both locally and nationally.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Assist in the assurance of IT systems connecting to National Systems and services and in the safety assessment process for internal programmes of work (i.e. NHS Apps library).&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Some of the key skills and experience you&#39;ll bring:  &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Registered clinician with additional Masters level qualification or equivalent post graduate experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A minimum of 5 years post registration NHS experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of clinical safety and risk assessment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Knowledge of clinical informatics initiatives and a passion for digitisation of the health and care system.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An able and experienced clinical leader with excellent communication skills and experience of leading change programmes.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of the effective clinical governance.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we offer&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;In addition to a competitive salary with planned, transparent progression you can look forward to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;li&gt;27 days annual leave entitlement increasing with service&lt;/li&gt;\n&lt;li&gt;Buy and sell annual leave scheme&lt;/li&gt;\n&lt;li&gt;Contributory Pension (with a 20.6% contribution from us toward the cost of your pension)&lt;/li&gt;\n&lt;li&gt;A range of NHS Discounts covering, for example, shops, restaurants, gym, mobile phones and insurance&lt;/li&gt;\n&lt;li&gt;Employee benefit schemes which include Season Ticket Loan and Car Lease&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We &lt;strong&gt;are &lt;/strong&gt;the national information and technology partner to the health and care system. Our task is to build and run excellent digital products and services that NHS and care staff across the country can rely on every day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Online video interviews are due to take place weeks commencing &lt;strong&gt;30th November&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt; Applicants who are shortlisted will be contacted by email and invitedtointerview.&lt;/p&gt;\n&lt;p&gt;To view further information please see the attached role profile and to apply for the role click ‘Apply for job’ below.&lt;/p&gt;\n&lt;p&gt;We are unable to accept speculative CVs, all applications must be made through NHS Digital’s career site.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you have previously interviewed for this role (or a similar one) with NHS Digital and been unsuccessful, we encourage you to obtain feedback from your initial application to support your future career as we will not accept any further applications for a period of six months.&lt;/em&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121299.jpg", "name": "NHS Digital", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121299"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS1 6AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7953", "longitude": "-1.54374"}}, "title": "Clinical Safety Officer, Agenda for Change, Band 8c", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252755", "validThrough": "2020-11-15T23:59:59+0000"}