{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "From £38,890 per annum, pro rata"}}, "datePosted": "2020-10-23T13:00:51+0100", "description": "&lt;p&gt;We have a fantastic opportunity for a pharmacist to join our Pharmacy team based in North Somerset. We welcome applications from registered qualified pharmacists who are looking to broaden their horizons within mental healthcare. You will have opportunity to work with a range of clinical teams, multiple therapy areas, prescribers, external providers and specialist pharmacy teams and leads.&lt;/p&gt;\n&lt;p&gt;Our Pharmacy Department is currently undergoing extensive and exciting developments to further improve the services it provides to our service users. We are friendly and innovative and are looking for an enthusiastic, hardworking, motivated individual. You will be fully supported and training will be provided. We are always looking at new ways to develop and grow our service and are keen to hear from likeminded individuals.&lt;/p&gt;\n&lt;p&gt;Relevant post registration experience in hospital pharmacy, the demonstration of good communication skills and sound current clinical knowledge will be essential to being effective in this role. You will have at least a post-graduate certificate in clinical pharmacy or have plans to be working towards this, or be able to demonstrate similar levels of experience.&lt;/p&gt;\n&lt;p&gt;This post will involve working as a member of the multidisciplinary teams within the specialties, to provide high quality, professional and specialist input into the delivery of clinical and operational pharmacy services.&lt;/p&gt;\n&lt;p&gt;Informal visits to come and meet our friendly and innovative team are encouraged.&lt;/p&gt;\n&lt;p&gt;This is a part time 0.5WTE post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally Squire,&lt;/p&gt;\n&lt;p&gt;Locality Lead Pharmacist for North Somerset, &lt;/p&gt;\n&lt;p&gt;sally.squire@nhs.net&lt;/p&gt;\n&lt;p&gt;07899915425&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Long Fox Unit, Weston-Super-Mare", "postalCode": "BS23 4TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3229", "longitude": "-2.97333"}}, "title": "Band 7 Clinical Pharmacist - North Somerset", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240626", "validThrough": "2020-11-08T23:59:59+0000"}