{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-29T09:46:17+0000", "description": "&lt;p&gt;Do you want to start or develop your OT career working in mental health? Would you like to know that you have made a difference to people who have a number of challenges to their health and wellbeing? Do you want the opportunity to be part of HPFT who are currently rated as &quot;outstanding&quot; overall by CQC?&lt;br /&gt;&lt;br /&gt;Our comprehensive mental health rotation schemes could offer you an excellent opportunity to develop your skills and knowledge whether you are seeking your first post or considering a change in specialism. &lt;br /&gt;&lt;br /&gt;We are seeking to recruit a dynamic and committed OT to our newer part-time rotation scheme which runs alongside our longer established full time rotation.&lt;br /&gt;&lt;br /&gt;The rotation scheme currently provides the opportunity to work in a range of settings within HPFT’s including in-patients, community teams and continuing health care. The OT service uses the Model Of Human Occupation across the Trust.&lt;br /&gt;&lt;br /&gt;Rotations are for a 12 month period to enable the development of a broad range of skills to support your career progression.&lt;br /&gt;&lt;br /&gt;High quality supervision, Preceptorship year and KSF processes are an integral part of the Rotation Scheme. CPD opportunities include a monthly Band 5 CPD Meeting with tutorials and access to OT in-service training events.&lt;br /&gt;&lt;br /&gt;For more information refer to the additional document: Band 5 OT Rotation Scheme Recruitment Information Pack.&lt;br /&gt;&lt;br /&gt;Applications should provide clear evidence of meeting the criteria in the Personal Specification. &lt;br /&gt;&lt;br /&gt;NHS hospital accommodation may also be available for staff seeking to relocate to Hertfordshire&lt;br /&gt;&lt;br /&gt;Car driver essential as a majority of the posts are community based, or access to a car (unless you have a disability as defined by the Equality Act 2010 which prevents you from driving).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGill smithJob titleHead Occupational TherapistEmail addressgillian.smith44@nhs.netTelephone number07979926126Additional contact information&lt;/p&gt;\n&lt;p&gt;Helen Dean (Band 5 OT Rotation Lead) - Helen.dean8@nhs.net&lt;/p&gt;\n&lt;p&gt;Gillian Smith (Band 5 OT Rotation Lead) - Gillian.smith44@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Hertfordshire, Across Hertfordshire", "postalCode": "AL8 6JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.804", "longitude": "-.208743"}}, "title": "Occupational Therapist - Rotation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247775", "validThrough": "2020-11-12T23:59:59+0000"}