{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;RESPIRATORY AND SLEEP SCIENCES DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;SPECIALIST RESPIRATORY PHYSIOLOGIST&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within our expanding Respiratory and Sleep Sciences Service for a Specialist Respiratory Physiologist. The Department of Respiratory and Sleep Sciences is a UKAS accredited facility offering a comprehensive respiratory and sleep diagnostic and therapeutic service. Due to an expansion of service delivery an opportunity to join our multidisciplinary team has become available.&lt;/p&gt;\n&lt;p&gt;We offer a broad range of services including all routine respiratory and sleep diagnostic investigations and therapeutic interventions. In addition we provide a wide range of more specialised services such as acute and domiciliary NIV, home oxygen assessment, full polysomnography and continuous laryngoscopy on exercise testing (CLE). We are an innovative and fast growing department always looking for ways to improve services for our patient population. We are a multidisciplinary team that includes physiologists, clinical scientists, nurses and a physiotherapist.&lt;/p&gt;\n&lt;p&gt;You must possess a BSc in Physiology/Clinical Science or an equivalent qualification. You should be registered or eligible for registration with either RCCP or AHCS. ARTP professional qualifications are desirable however training to complete these will be provided if necessary.&lt;/p&gt;\n&lt;p&gt;This post offers a full time, permanent contract of 37.5 hours per week. The department offers extended working days for our patients and it is expected that all staff work one evening per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcome to Edward Parkes, Deputy Service Manager on 024 76966738&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University site, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Specialist Healthcare Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247977", "validThrough": "2020-11-12T23:59:59+0000"}