{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competattive"}}, "datePosted": "2020-11-02T11:37:06+0000", "description": "&lt;p&gt;As a Speech and Language Therapist, you are the reason why lives change for the better. You help some of the most vulnerable people gain a brighter future. It&#39;s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be part of an innovative and supportive MDT where you will be evaluating the speech of people with neurological conditions. You will work closely with a motivated team including a Consultant and a Clinical Neuropsychologist, Consultant Neuropsychiatrist, Physiotherapists, Occupational Therapists, Therapy Technician and Engagement Coordinator to deliver a goal-focused, high quality service that enables adults to maximise the residents potential.&lt;/p&gt;\n&lt;p&gt;You will help our Residents develop and improve their speech and communication via aids and systems as well as assessing and monitoring dysphagia, working closely with the dietician and our catering team to deliver the best mealtime experience possible. You will be able to build rapport with each resident, ensuring they are engaging in the session and are progressing positively through their treatment plan.&lt;br /&gt; &lt;br /&gt; Working alongside a multidisciplinary team, you will enjoy support from other healthcare professionals and will be part of an environment where there is an emphasis on team work.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join our well-established team. You will be involved in the assessment, diagnosis and treatment of a range of adults with acquired brain injury, traumatic brain injury and degenerative neurological conditions where social-communication impairments and cognition and behaviour are also affected.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "P J Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134817"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5925", "longitude": "-.287674"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251847", "validThrough": "2020-11-16T23:59:59+0000"}