{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "As per GP national terms and conditions"}}, "datePosted": "2020-10-22T16:01:21+0100", "description": "&lt;p&gt;We are looking for outstanding GPs to join our current team within Acute Medicine at Wirral University Teaching Hospitals NHS Foundation Trust. An opportunity has arisen to join the Acute Medical Team and our two established GPs, who are an integral part of the team, working on Mondays, Tuesdays and Wednesdays. The Acute Medicine Department is a busy assessment area encompassing the Urgent Medical Assessment Centre, which receives around 40 patients from SPA and Arrowe Park Emergency Department for assessment daily. At present, the unit comprises a chaired area for up to 12 patients, and a 6-trolley higher acuity area for the less mobile and acutely unwell&lt;/p&gt;\n&lt;p&gt;The GP role involves working alongside and supporting the Acute Medical Team in the unselected take by reviewing patients admitted from SPA through to the Urgent Medical Assessment Centre. The role is supported by nurses, ANP’s, foundation and specialty doctors in training, and consultants. All in-hospital diagnostic support is available to enable timely management of patients in the acute setting and to facilitate same day discharges.&lt;/p&gt;\n&lt;p&gt;It is expected that the successful candidate will be focused on ambulatory patients, with scope available to broaden their experience with the more acutely unwell patient in a well-supported environment.&lt;/p&gt;\n&lt;p&gt;The unit prides itself on being innovative and bringing in new initiatives, such as point of care ultrasound, to aid the prompt assessment and management of patients. The trust has invested in one of the most advanced electronic patient record systems in the country to enable improved delivery of care, making WUTH an exemplar for IT across the NHS.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to improving and delivering excellent patient centred care and development of the Acute Medicine team. This provides an exciting opportunity to be part of developing the Acute medical service in the knowledge that the Trust is committed to providing the support required. We therefore wish to harness the expertise, enthusiasm and experience of those individuals who have a similar vision to deliver an excellent and sustainable service for all.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Phil Lawrenson, Clinical Service Lead in Acute Medicine.&lt;/p&gt;\n&lt;p&gt;Telephone Number: 0151 604 7740&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "GP in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239256", "validThrough": "2020-11-29T23:59:59+0000"}