{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18135", "minValue": "18135", "unitText": "YEAR", "value": "£18,135"}}, "datePosted": "2020-09-30T12:27:46+0100", "description": "&lt;p&gt;&lt;span&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then a Male Healthcare Assistant at The Spinney could be the right choice for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whether you are looking for a new career or already work in healthcare through the NHS or private care, you’ll receive training to join the team where you will be valued and supported, with career development opportunities available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It’s what delivering great healthcare should feel like. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will join the team that works well together to provide care to men with mental health conditions and/or personality disorders. Whether you have been a Support Worker or a Care Worker, you will utilise your experience to support people to lead a valued and fulfilled life.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve; being able to do something today that they couldn’t do last week because of you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Elysium Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;br /&gt;There are also career development opportunities in abundance. With a huge range of courses that will see you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work 12 hours days, three days a week, with the occasional night shift. Though with 4 days off to rest and catch up on life, it provides a great work/life balance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are actively encouraging male candidates to apply for this opportunity at our male-only mental health and personality disorder service in Atherton. This is to accommodate the needs of our service users in the most efficient manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location&lt;/strong&gt;: Everest Road, Atherton, Manchester, M46 9NT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working at The Spinney, a service which offer a range of care settings for male patients with personality disorder and/or mental illness. The purpose-built medium, low secure and rehabilitation wards, as well as a psychiatric intensive care unit (PICU) are all set within an 11 acre site with extensive woodland and landscaped areas.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working alongside a multidisciplinary team at The Spinney who have previously been recognised by the Association of Psychological Therapies (APT) for their ability to reinforce positive behaviour, prevention of challenging behaviour and successful interventions in a secure care setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Annual Salary of £18,135&lt;br /&gt;•The equivalent of 33 days annual leave – plus your birthday off!&lt;br /&gt;•Free meals and parking&lt;br /&gt;•Wellbeing support and activities&lt;br /&gt;•Career development and training&lt;br /&gt;•Pension contribution&lt;br /&gt;•2 Week Paid Induction&lt;br /&gt;•Life Assurance&lt;br /&gt;•Enhanced Maternity Package&lt;br /&gt;•Flexible working opportunities&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About your next employer&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Atherton", "postalCode": "M46 9NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5362", "longitude": "-2.49505"}}, "title": "Male Healthcare assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206411", "validThrough": "2020-11-30T23:59:59+0000"}