{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 to £42,712 pa pro rata incl HCAS Dependant"}}, "datePosted": "2020-11-06T12:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Community Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS AfC: Band 6&lt;/p&gt;\n&lt;p&gt;&quot;&lt;strong&gt;At Epsom and St Helier Hospitals, above all we value respect. We put respect at the heart of all we do, by living up to our shared behaviours of kindness, professionalism, positivity and teamwork. This enables us to provide great patient care and make ESTH a great place to work. When you sign up to work with us, you sign up to this and we welcome applicants who share our values&quot;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Paediatric Community Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Band 6&lt;br /&gt;0.6 wte&lt;/p&gt;\n&lt;p&gt;Sutton Health and Care (SHC) is an innovative community partnership between local partners in health and social care organisations, in which community services are fully integrated to support the delivery of a new health and care model for the residents of Sutton.&lt;/p&gt;\n&lt;p&gt;Hosted by Epsom and St Helier University NHS Trust the model ensures the breaking down of traditional organisational barriers to enable the provision of care that is centred around children and their families.&lt;/p&gt;\n&lt;p&gt;An Alliance Board representing all partners has been formed to support consensus decision making. All partners firmly believe that the alchemy of the partnership will drive transformational change to the benefit of service users and the local healthcare system.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on having a highly dedicated team and offer a stimulating and dynamic working environment with a wide range of staff benefits and development opportunities.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Occupational Therapist to work in the Children’s Occupational Therapy team, based at Green Wrythe Lane Clinic.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with established multi-professional teams within Sutton Health and Care and with outside services to deliver Occupational Therapy assessment, advice and treatment to meet the functional needs of children.&lt;/p&gt;\n&lt;p&gt;You will be flexible, organised and creative with good IT skills, and enjoy working collaboratively with other team members to support children and young people. You should also have excellent written and verbal communication skills.&lt;/p&gt;\n&lt;p&gt;We are committed to professional development, and offer regular in-service training and peer group / one to one supervision. You will be supported by a senior OT and there will be opportunities to develop the skills required for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our mission: ‘to put the patient first by delivering great care to every patient, every day.’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There’s never been a better time to join the Epsom and St Helier team. Our hospitals are facing a bright and busy future, and our staff have a proven track record in providing high quality, compassionate care for our patients.&lt;/p&gt;\n&lt;p&gt;Boasting incredible staff benefits and dedicated training schemes, working for us will not only take your career forward, but could help to transform the lives of our patients and visitors.&lt;/p&gt;\n&lt;p&gt;We offer all employees some fantastic staff benefits, and are the only hospitals in Surrey to offer staff the London high cost area supplement. Our hospitals also benefit from great locations, so whether you&#39;re attracted to the bright lights of the city or the countryside of Epsom Downs, both are within easy reach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FURTHER INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;**PLEASE NOTE THAT THIS POSITION MAY CLOSE EARLIER THAN THE STATED CLOSING DATE IF A SUFFICIENT NUMBER OF APPLICATIONS ARE RECEIVED. IF YOU WISH TO APPLY FOR THIS POSITION, YOU ARE ADVISED TO SUBMIT YOUR APPLICATION AS SOON AS POSSIBLE**&lt;br /&gt;&lt;br /&gt;**PLEASE NOTE THAT WE CONTACT ALL APPLICANTS VIA EMAIL AND NOT BY POST. YOU ARE ADVISED TO CHECK YOUR RECRUITMENT SYSTEM ACCOUNT ON A REGULAR BASIS. YOU CAN ACCESS THIS ACCOUNT VIA OUR WEB SITE&gt; Work for Us &gt; Current Vacancies &gt; My Job Account**&lt;/p&gt;\n&lt;p&gt;For new entrants into the NHS, your pay under the Agenda for Change or Medical &amp; Dental Pay Bands, will normally be set at the minimum of the pay band as advertised.&lt;br /&gt;&lt;br /&gt;If you apply for this position and do not hear from us within 4 weeks of the closing date, please assume that you have not been short-listed for interview on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Name: Nicola Westbrook&lt;/p&gt;\n&lt;p&gt;Job title: Children&#39;s OT Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: nicola.westbrook@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07880059048&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Green Wrthye Lane clinic, Carshalton", "postalCode": "SM5 1JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3845", "longitude": "-.17362"}}, "title": "Specialist Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259563", "validThrough": "2020-11-13T23:59:59+0000"}