{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 - £25,365"}}, "datePosted": "2020-10-28T14:31:22+0000", "description": "&lt;p&gt;The COVID-19 pandemic affects all our communities, now is the time for us to come together to truly make a difference. To increase testing for COVID-19, the Government has significantly expanded its laboratory capacity and staffing. As a result a new COVID-19 Lighthouse Testing Laboratory will be opening in Bracknell. The laboratory will be managed by Berkshire and Surrey Pathology Services, which is the first to be run by the NHS. BSPS is a large and established pathology network operating across Royal Berkshire, Royal Surrey, Frimley Health and Ashford and St Peter’s Hospitals NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Associate Practitioners to help us achieve our target of running tens of thousands of tests every day.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake sample reception, preparation, analysis and recording of results in accordance with approved procedures.&lt;/li&gt;\n&lt;li&gt;Liaise with line manager as part of a team delivering a high quality protocol based technical service under the supervision of scientific staff&lt;/li&gt;\n&lt;li&gt;Communicate with a range of colleagues and external suppliers/stakeholders&lt;/li&gt;\n&lt;li&gt;Operate sophisticated, automated laboratory equipment and perform scientific techniques under supervision&lt;/li&gt;\n&lt;li&gt;Appropriately handle body fluids and materials, including high risk specimens&lt;/li&gt;\n&lt;li&gt;Report results in accordance with departmental Standard Operating Procedures (SOPs) and as appropriate to grade&lt;/li&gt;\n&lt;li&gt;Act as supervisor for support grade staff members as agreed with the laboratory management team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful candidates need to have previous experience working in a relevant laboratory and have the experience and knowledge of duties required to support senior laboratory staff. Candidates need to hold good education up to A levels including a science subject/ NVQ 4 or IBMS Certificate of Achievement (Part 2) or Foundation degree. It would be beneficial to hold a degree in a biology based subject, although not essential.&lt;/p&gt;\n&lt;p&gt;It is essential to have the ability to communicate clearly, follow instructions, have accurate record keeping skills and be able to make decisions. Candidates will be expected to train, support and advice less experienced staff, such as trainees, students and Medical Laboratory Assistants therefore previous supervisory experience is required.&lt;/p&gt;\n&lt;p&gt;The laboratory will be operating 24 hours a day, seven days a week; therefore successful candidates need to be able to work on a shift pattern. Initially there will be three shift patters of 8 hours (6am-2pm; 2pm - 10pm; 10pm to 6am) however in the future the shifts will change to two 12 hour shifts.&lt;/p&gt;\n&lt;p&gt;In return you will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full time employment, 37.5 hours per week to start ASAP(Part time options available, however must be able to work the shift times above)&lt;/li&gt;\n&lt;li&gt;Secure environment of a fixed term contract for 12 months&lt;/li&gt;\n&lt;li&gt;Additional benefits of working with the NHS&lt;/li&gt;\n&lt;li&gt;Be part of something special – this is the first Lighthouse Lab run by the NHS&lt;/li&gt;\n&lt;li&gt;Sense of pride that you are supporting the nation and NHS in the fight against COVID&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The host employing organisation will be Royal Berkshire NHS Foundation Trust. The laboratory will be based at Bracknell Healthspace, Brants Bridge, Bracknell.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please email lighthouse@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bracknell", "postalCode": "RG12 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4131", "longitude": "-.733121"}}, "title": "Bracknell Lighthouse Lab - Associate Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246998", "validThrough": "2020-11-29T23:59:59+0000"}