{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum"}}, "datePosted": "2020-11-06T09:31:00+0000", "description": "&lt;p&gt;Based in Skipton House (London), the Provider Development directorate works with regional teams, local health systems and the provider sector to ensure that we have strong and successful providers, working collaboratively within strong and successful systems, in the best interests of local patients, populations and staff. Provider policy sits within this directorate.&lt;/p&gt;\n&lt;p&gt;We are a friendly team responsible for developing evidence-based advice and recommendations on high profile, important issues to support NHS England and NHS Improvement and the provider sector to make decisions that improve the delivery of care.&lt;/p&gt;\n&lt;p&gt;Our team looks beyond the headline questions to understand the real issues behind them, drawing on multiple sources of information on the provider sector and our knowledge of the policy and regulatory landscape. We use a range of structured tools to tackle each issue and engage widely to understand different perspectives and move thinking forward.&lt;/p&gt;\n&lt;p&gt;Our current work programme covers a broad range of high profile and interesting areas, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;delivery of NHS long term plan commitments to support small rural acute providers and facilitate provider collaboration with systems&lt;/li&gt;\n&lt;li&gt;deep dive reviews into important issues facing providers in response to Covid-19 that fall at the interface between national policy and operational delivery&lt;/li&gt;\n&lt;li&gt;policy development and advise on providing-facing issues, including the NHS oversight framework, legislation, independent provider regulation and policyThe role of the Policy Analyst is to support the delivery of the Provider Policy work programme. This includes analysis and research, project management and support and preparing documents. The role involves working closely with other team members and developing and maintaining good working relationships with colleagues across NHSE&amp;I and with external stakeholders on specific projects. The post holder is required to present complex and conflicting information in a meaningful way and, with support from more senior team members, will develop their ability to present information to influence decision-makers. The role offers opportunities to develop high level problem-solving skills combined with exposure to policy thinking and decision-making at a national level.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We aim to be an inclusive team that is flexible and supports a wide range of lived experience and obligations beyond work. We would encourage anyone that matches the person specification to make an application. However, we recognise that sometimes people have a question about working on our team that isn’t covered in the job description or person specification. &lt;/p&gt;\n&lt;p&gt;If you would like to speak to members of our team and find out more about how we work in practice, please register to attend a virtual open evening on Wednesday November 11, 5-6pm. Email NHSI.Policyteam@nhs.net to confirm your place and for any further details.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Sandra Kendal&lt;/p&gt;\n&lt;p&gt;Email address - Sandra.kendal@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Provider Policy Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259022", "validThrough": "2020-11-22T23:59:59+0000"}