{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365.00 - £37,890.00 Per Annum Plus HCAs"}}, "datePosted": "2020-10-27T18:15:17+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Islington Additional Needs and Disability Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paediatric Speech and Language Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6, full time- Permanent contract.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Special Schools Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Islington Additional Needs and Disability Service provides a multi-agency team approach to working with babies, children and young people who present with additional needs and complex disabilities. We are looking for an experienced, dynamic and highly motivated Speech and Language Therapist to join this service, who is able to work sensitively with children and young people and who is committed to family centred practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will be based within the Special Schools Team at The Bridge School across the Primary and Secondary Sites, including support students during transition to adulthood. The Bridge School is a special school catering for young people with a diagnosis of Autism and/or severe learning disabilities. It is a teaching school with three consecutive outstanding Ofsted reports. It is a pioneering organisation which supports integrated working, and is proactively working to develop the evidence base around improving outcomes for children and young people and their families. The post holder will be part of a multi-disciplinary team based within the school, where there are excellent opportunities for joint work with other professionals and outside agencies.&lt;/p&gt;\n&lt;p&gt;Islington Additional Needs and Disability Service are dedicated to personal development and clinical supervision. The service employs clinical specialists across the disciplines who support and lead staff in developing research and innovation within clinical practice. External training is fully supported and encouraged.&lt;/p&gt;\n&lt;p&gt;We are a friendly service who promotes equal opportunities and access for all. We support flexible working hours.&lt;/p&gt;\n&lt;p&gt;For further information please contact Alice Hawkins, Team Leader Bridge Schools Therapy &amp; Nursing on alice.hawkins@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlice HawkinsJob titleTeam Leader for therapy and nursing across The Bridge Trust.Email addressalice.hawkins@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Bridge School, Islington, Islington, London", "postalCode": "N7 0EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5537", "longitude": "-.129474"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245618", "validThrough": "2020-11-10T23:59:59+0000"}