{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £43,772 per annum"}}, "datePosted": "2020-10-09T10:16:48+0100", "description": "&lt;p&gt;Are you a dynamic, self-motivated, patient-centred experienced Research Nurse looking for a new and exciting challenge that would, in these rapidly changing times, allow you to contribute to, amongst other things, patient centred Urgent public health Covid research? Then why not consider joining the National Institute for Health Research (NIHR) Clinical Research Network (CRN) Greater Manchester’s Core Delivery Team.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic nurse leader to manage a team of research nurses, research practitioners and Clinical trials administrators. You will be expected to work across specialties throughout the region utilizing proven clinical research nursing experience to support the development of research across Greater Manchester.&lt;/p&gt;\n&lt;p&gt;We need a capable, confident Research nurse who enjoys a challenge and will use their research experience together with clinical leadership and teaching skills to fulfill an influential role across a range of disease areas. The role is interesting, variable and totally different from many other research team lead roles in that whilst the post is based at Manchester University NHS Foundation Trust (oxford Road campus), you could be providing support within any of the CRN GM secondary, Primary/social Care and Non NHS Partner organizations across our network, plus you will be required to support the other CRN Team leads, depending on where support is most needed. You must, therefore, be willing and able to travel between sites. This is a pivotal role within the CRN GM both on a Local and National CRN level and will need to support the Delivery team Nurse manager and work closely with the CRN GM Industry/Life Sciences Team as well as the CRN Research Delivery Managers (RDMs). You will be instrumental in building relationships with sites and organizations, facilitating engagement to ensure and provide effective research delivery of studies throughout CRN GM.&lt;/p&gt;\n&lt;p&gt;You will implement specialty objectives and will provide dedicated support to ensure that studies are delivered to time and target. You will be a point of contact for study principal investigators, sponsors and research teams at the host Trust and partner organizations and so effective communication and team working skills are essential. You will be involved in ensuring that research undertaken safeguards the well-being of participants and is undertaken within Good Clinical Practice Guidelines. In this instance, we are prioritising clinical research nursing experience. Shortlisting will be carried out according to the person specification, so please construct your personal/supporting statement accordingly when applying. Comprehensive induction, orientation and training will be provided for successful candidates. We will also ensure that you have tailored, individual personal development plans with support for further training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam ChilcottJob titleActing Delivery Team/Research Nurse managerEmail addresssamantha.chilcott@mft.nhs.ukTelephone number07977015659Additional contact information&lt;/p&gt;\n&lt;p&gt;Sam Chilcott - CRN:GM Acting Research Nurse Manager 07977015659 samantha.chilcott@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Susan Neeson CRN GM Research Delivery Manager 07833479418&lt;/p&gt;\n&lt;p&gt;susan.neeson@nihr.ac.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M13 9NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22935"}}, "title": "Team Lead - Clinical Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219686", "validThrough": "2020-11-08T23:59:59+0000"}