{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T10:02:13+0000", "description": "&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about Elgar House at North Bristol NHS Trust. Here are some of the reasons we’re unique… &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our approach to enablement is incredibly progressive, and our nurses help patients involve themselves in our tai chi, mindful mediation, pet therapy workshops, music therapy sessions, choir, and our ballroom dancing shows.&lt;/li&gt;\n&lt;li&gt;We give nurses the opportunity to directly impact a patients’ journey and gain control over their health and life, leading to a rewarding and compassionate culture across our wards.&lt;/li&gt;\n&lt;li&gt;Our opportunities offer excellent exposure to acute care, and through our rotational package we can carve out an exciting pathway toward emergency nurses and major trauma nursing.&lt;/li&gt;\n&lt;li&gt;As a nurse, your leadership team will offer training tailored to your career aspirations, internal development sessions, and monthly education workshops focused on a particular topic.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just Elgar House which is impressive; our trust itself is pioneering, progressive and proud. Let us tell you a little more about it…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and wellbeing initiat­­­ives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year with 69% of staff would recommend our organisation as a place to work (6% better than the national average)&lt;/li&gt;\n&lt;li&gt;Our nurses don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;Our staff are consulted on equity issues across the trust within equality and development groups, and are given the mentoring and support to succeed. Our trust supports the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes. Our city boasts a wide range of state-of-the-art shopping, recreation and leisure facilities, a wealth of great local family days out, and excellent transport links. If you prefer country, village or smaller town living, our trust is easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered nurse eager to channel your experience into a new and exciting role?&lt;/li&gt;\n&lt;li&gt;A newly qualified nurse ready to take the leap from theory to the clinical setting, supported by a structured preceptorship and inspirational team?&lt;/li&gt;\n&lt;li&gt;An experienced nurse with the passion and talent to progress clinically and professionally?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So, are we right for each other? Here are your next steps…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email: Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Number: 0117 414 4550&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse - Complex Medicine- Elgar (Registered and Newly Qual", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243931", "validThrough": "2020-12-08T23:59:59+0000"}