{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T13:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: Archer Unit, Louth Hospital, Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full-time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you passionate about providing high quality rehabilitation and supporting people to achieve their goals? Are you an ambitious individual who relishes the challenge of working in an innovative and forward-thinking team? We are excited to be offering the opportunity for a Band 6 Occupational Therapist to join the team on the Archer Unit, so if you are a team player with a special interest in rehabilitation, long term conditions and frailty then look no further!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lincolnshire Community Health Services provides community hospital services in four locations across the county; Gainsborough, Louth, Skegness and Spalding.&lt;/p&gt;\n&lt;p&gt;Using ‘Home First’ principles, the Community Hospitals Therapy Team strive to provide specialist assessment and rehabilitation, re-ablement, admission avoidance and palliative care services to the people of Lincolnshire. We work closely with our Integrated Community and Therapy Teams to get people back home in a timely manner, as well as with our colleagues in the acute sector to provide a swift and seamless transfer of care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Band 6 Occupational Therapist, you will be working alongside your Physiotherapy and Nursing colleagues to lead the planning and implementation of the patient’s journey, ensuring safe and timely discharges with coordinated person centred care. You will be working with a full multidisciplinary team of Physiotherapists, Occupational Therapists, Nurses and Assistants (AHP/nursing), to provide high quality rehabilitation to people with a wide and varied range of conditions. There will also be the opportunity to supervise Band 5 therapists and support their development and progression. You will have support from senior therapists, as well as both nursing and AHP clinical leads. LCHS is excited to be working on providing an innovative frailty service within a community hospital setting, and there will be opportunity to support the design and implementation of this across the county.&lt;/p&gt;\n&lt;p&gt;For this post, you will require an Occupational Therapy Degree, current HCPC registration and experience of working in a community hospital setting is desirable. The community hospital wards are working towards a ‘one team’ approach, presenting fantastic opportunities for practitioners to be an educational influence with fellow MDT members. We have a robust clinical supervision and support network, sharing knowledge and skills across the community hospitals and community therapy services. Together with the Clinical Practice Educators, LCHS is dedicated to supporting learning and development of staff, including the preceptorship programme for newly qualified practitioners and return to practice candidates, as well as giving the opportunity for career progression.&lt;/p&gt;\n&lt;p&gt;As a Trust, Lincolnshire Community Health Services are rated ‘Outstanding’ by the Care Quality Commission, and we are playing an integral part in shaping future service provision alongside our partner health and social care organisations. It is a brilliant time to be part of LCHS, moulding the exciting changes to meet the needs of such a wide and varied health community, and we invite you to make you mark with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lincolnshire is a wonderfully diverse place to live; a thriving University City at its heart, with the rolling hills of the Wolds, the wildlife of the fens, and a 30 mile stretch of beautiful sand along our East coast. Lincolnshire boasts an affordable lifestyle, being the 13th cheapest average house prices across England and Wales. With the mix of heritage and modern developments, Lincolnshire is a gran affordable lifestyle, being the 13th cheapest average house prices across England and Wales. With the mix of heritage and modern developments, Lincolnshire is a great place to see exciting and fun opportunities for all members of the family.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFran HulmeJob titleClinical Team LeaderEmail addressfran.hulme@nhs.netTelephone number01507 600 100Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clare Thompson, Occupational Clinical Lead on 07583 078253, or by email: &lt;/strong&gt;&lt;strong&gt;Clare.Thompson11 @nhs.net &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Archer Ward, Louth", "postalCode": "LN11 0EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3706", "longitude": "-.00913"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256055", "validThrough": "2020-11-16T23:59:59+0000"}