{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum (unsociable hours for"}}, "datePosted": "2020-11-04T09:00:39+0000", "description": "&lt;p&gt;To work under the day to day leadership and direction of Liaison and Diversion registered health and social care practitioners to provide a Liaison and Diversion service to individuals who come into contact with the Criminal justice setting.&lt;/p&gt;\n&lt;p&gt;The role will support the assessment of individuals needs by providing Triage assessments within police custody suites and magistrates court providing individuals with support with practical concerns or difficulties that might be affecting their mental health and wellbeing. This may include supporting an individual through the Criminal Justice process.&lt;/p&gt;\n&lt;p&gt;Developing links with community agencies will be key, in order to support robust pathways of care for individuals requiring community support and treatment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Context:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will require someone with the ability to communicate and engage with a wide range of individuals at a distressing point in their life.&lt;/p&gt;\n&lt;p&gt;It will require the ability to work under the direction and leadership of registered professionals receiving referrals, gaining consent from an individual, completing a structured triage assessment to establish whether a fuller assessment and clinical opinion is required.&lt;/p&gt;\n&lt;p&gt;For referrals where this is not required, there may be agreed service pathways that the individual can be directed to, by the post holder.&lt;/p&gt;\n&lt;p&gt;For those requiring a full assessment and care planning by a clinician, the post holder may be involved in providing short term practical intervention or linking in and referring on to other community agencies.&lt;/p&gt;\n&lt;p&gt;The post holder will require good assertion skills and self-awareness to know where the limits of their expertise lies and where to seek clinical input.&lt;/p&gt;\n&lt;p&gt;This role will also support in service development and evaluation. The post holder may represent the team at agreed meetings and training events compatible with the role.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to pass the police vetting checks to carry out this role&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNikki ChambersJob titleClinical Team LeaderEmail addressnikki.chambers@nottshc.nhs.ukTelephone number0115 9555359 / 01623 433919Additional contact information&lt;/p&gt;\n&lt;p&gt;Gaby Rocco 07770 221026&lt;/p&gt;\n&lt;p&gt;Claire Kemp 07813397124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heatherdene Mansfield, Mansfield", "postalCode": "NG19 7AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1488", "longitude": "-1.1975"}}, "title": "Triage and Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255134", "validThrough": "2020-11-18T23:59:59+0000"}