{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50819", "minValue": "44606", "unitText": "YEAR", "value": "£44,606 - £50,819 per annum pro rata"}}, "datePosted": "2020-10-30T11:46:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Scientist MPE –&lt;/strong&gt;&lt;strong&gt; RADIOISOTOPES - BAND 8A Maternity cover&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This opportunity has arisen, for an enthusiastic, motivated, registered clinical scientist to join our Radioisotope Physics team for a fixed term to cover for maternity leave. The section supports radioisotope services on two main sites (Churchill and John Radcliffe Hospitals) and Great Western Hospital. This includes oncology, nuclear medicine and PET/CT, nuclear cardiology, laboratories etc.&lt;/p&gt;\n&lt;p&gt;We currently support 5 SPECT gamma cameras (2 with CT), 2 PET / CT scanners and a new digital dedicated cardiac scanner. 3 gamma cameras are due for replacement in the next 12 months. The clinical services we support provides a wide range of radionuclide therapies and diagnostic imaging and non-imaging tests. In addition, the section is very involved in the provision of radiation protection support to all departments using radioisotopes.&lt;/p&gt;\n&lt;p&gt;The section also provides support to a large number of clinical trials, including novel PET and SPECT tracers and new therapeutic techniques and this is an excellent opportunity to join a large collaborative research group with strong links to the University of Oxford. The University has recently opened a licensed GMP PET radiopharmacy facility which will provide tracers to the hospital for clinical and research purposes. The section also has strong collaborative relationships with several industry partners.&lt;/p&gt;\n&lt;p&gt;Candidates for this post must be registered Clinical Scientists and ideally be registered as MPE/DGSA. They will be strongly encouraged to participate in research and development projects and be very involved in the radiation protection support to departments. Experience of working in a clinical nuclear medicine department is essential. Candidates with less experience will be considered for employment at a lower band.&lt;/p&gt;\n&lt;p&gt;For informal discussion about the post, please contact Aida Hallam, Head of Radioisotope Physics on 01865 235341 (aida.hallam@ouh.nhs.uk)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date- 6th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CH, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Senior Clinical Scientist MPE Radioisotope Physics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250010", "validThrough": "2020-12-06T23:59:59+0000"}