{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a. inclusive of HCAS"}}, "datePosted": "2020-11-02T15:46:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a You a Pharmacist registered with GPhC?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy- Pharmacist – Band 7 (1 year fixed term contract to cover maternity leave)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Public Health England has made mental health one of its corporate priority areas in a five year strategy with a vision is to see measurable improvements in the nation’s mental health.&lt;/p&gt;\n&lt;p&gt;Camden &amp; Islington NHS Foundation Trust provides mental health, social care and substance misuse services to adults of working age, adults with learning difficulties and older people in the London area. We deliver services to a combined population of 420,000 in our two main boroughs Camden and Islington, as well as additional services in the surrounding boroughs. Our service users come from diverse ethnic and social backgrounds encompassing the extremes of wealthy areas, such as Hampstead, and deprived areas, such as Somers Town. We also serve challenging groups including a large immigrant population speaking over 290 different languages and a transient population of young adults.&lt;/p&gt;\n&lt;p&gt;Our Pharmacy Department is currently undergoing extensive and exciting developments to further improve the services it provides to our service users. A new pharmacy dispensary and department has been completed. As a result of maternity leave, an opportunity has arisen for an enthusiastic and motivated pharmacist who would like to join the mental health team based at Highgate Mental Health Centre and St Pancras Hospital as a secondment or a fixed term. This opportunity will enable the postholder to expand their competence and confidence in managing patients with mental health conditions.&lt;/p&gt;\n&lt;p&gt;This post will involve working as a member of the multidisciplinary teams within the specialities, across inpatient and community settings, to provide high quality, professional and specialist input into the delivery of clinical and operational pharmacy services.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake the teaching and clinical supervision of band 6 pharmacists, and pre-registration pharmacists. There will also be an important role for training healthcare professionals and support staff as a member of the multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;As part of the North Central London Medicines Optimisation network, we have strong ties with our pharmacy colleagues and partner organisations across the STP. Working in partnership across the different sectors, we aim to improve the understanding and care of people with mental health conditions at all stages of the patient journey.&lt;/p&gt;\n&lt;p&gt;If you feel that your skills and abilities would be suited to this challenging opportunity, we welcome your application.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contact Audrey Coker, Lead Pharmacist, Camden &amp; Islington NHS Foundation Trust. Email: Audrey.Coker@candi.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 020 7561 4167 or 07970198598&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAudrey CokerJob titleLead PharmacistEmail addressaudrey.coker@candi.nhs.ukTelephone number020 7561 4167Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details or an informal visit contact Audrey Coker, Lead Pharmacist, 020 7561 4167 or audrey.coker@candi.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121247.jpg", "name": "Camden and Islington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121247"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highgate Mental Health Centre, Islington, London", "postalCode": "N19 5NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5672", "longitude": "-.141705"}}, "title": "Band 7 Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252708", "validThrough": "2020-11-15T23:59:59+0000"}