{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "35000", "unitText": "YEAR", "value": "Up to £35,000"}}, "datePosted": "2020-11-03T14:16:40+0000", "description": "&lt;p&gt;&lt;span&gt;Are you an experienced Clinical/Forensic Psychologist looking for a rewarding career, where you can make a difference and change lives for the better? If so, join the team at Sturt House and enjoy support from a regional network of psychologists.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be working at Sturt House, a recovery-focused, rehabilitation unit providing specialist mental health treatment for males aged 18 and over. You&#39;ll be a part of an&lt;/span&gt;environment where there is a strong emphasis on teamwork and CPD, with continuous access to a range of training opportunities to move your career forward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Reporting directly to the Lead Psychologist, you will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working and risk assessments. You will also facilitate staff reflective practice sessions and be requested to design and deliver training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As aClinical/Forensic Psychologist, you will have experience and knowledge in carrying a service user’s caseload, including assessing complex needs and designing and delivering specialist psychological treatments to support their care plans.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Participate fully with the multidisciplinary team and ensure that the service users is fully engaged in their care pathway.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To support clinical team working, including both direct interventions and the delivery of staff training programmes.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To support the clinical team and area of service in developing new initiatives and ways of working.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To work with internal and external agencies to enhance treatment pathways for service users.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To supervise Assistant Psychologists, as directed by the Lead Psychologist.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;British Psychological Society or a recognised training body qualification&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Registration with the HCPC as a Practitioner Psychologist and Charterable status with the British Psychological Society.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Experience of working with clients with complex needs.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Experience using CBT skills to address a range of clinical issues.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Annual salary of up to £35,000&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Free meals and parking&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Wellbeing support and activities&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Career development and training&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Pension contribution&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Life Assurance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Enhanced Maternity Package&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey", "postalCode": "KT20 7RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2715", "longitude": "-.253698"}}, "title": "Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254300", "validThrough": "2020-12-03T23:59:59+0000"}