{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T08:45:47+0000", "description": "&lt;p&gt;Assistant Psychologist: In the Acute Hospitals Dementia Wellbeing Team.Older People&#39;s Mental Health Service, Hywel Dda UHB.Band 5: 1.0wte: Permanent.1 post available: In Glangwili General Hospital, Carmarthen.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an Assistant Psychologists to work directly in Glangwili District General Hospital. You will work directly with acute hospital ward staff in supporting people living with dementia during their acute hospital inpatient stay. You will join a cohort of 8 Assistant Psychologists, with 2 Assistant Psychologists based in each of the 4 District General Hospitals (DGHs) across Hywel Dda UHB. While you will be based in Glangwili General Hospital, there may be times where the role requires you to travel between, or input into, different DGH sites. There will be plenty of opportunity for peer support and clinical supervision.&lt;/p&gt;\n&lt;p&gt;You will have a significant physical presence on the ground ‘delivering’ our Acute Hospitals Dementia Wellbeing Service. Specifically, you will be based in, and integrate yourself into, the acute hospital ward teams, working closely alongside acute hospital ward staff in collaboratively supporting people living with dementia during their hospital stay. You will work collaboratively with acute hospital staff teams and with clients to facilitate non-pharmacological approaches to increase general hospital staff teams’ knowledge and skills in understanding the person living with dementia and potential factors/ needs to be aware of to help optimise their wellbeing whilst in hospital. The person living with dementia may experience stress or distress that ward teams may find difficult to manage. Indeed, going into hospital can be difficult for anyone but this may be intensified for people living with dementia as the environment may not be best matched to their needs and as it may become increasingly difficult for people living with dementia to communicate their needs.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in a rather unique way in that you will be working from an integrative rather than consultative model, you will work directly rather than indirectly with ward staff and you will be based within acute general hospital rather than mental health settings/ ward teams. We are looking for someone who has good team working skills, who can work well with different professions/ staff groups and who can adapt to fast paced task oriented settings. You will be able to demonstrate professional respect and integrity while being able to advocate for psychological approaches to care within a medical service system and be able to show tenacity in advocating for client wellbeing. We are looking for someone with flexibility and ingenuity, who can not only apply such models but also adapt them to fit with the context of the acute hospital setting and unique needs of each individual.&lt;/p&gt;\n&lt;p&gt;Our Acute Hospitals Dementia Wellbeing Team has been operational for just over a year so this is an exciting time to join, with opportunity to contribute to service development, delivery and evaluation. We seek people with good understanding of research methodology and statistics to contribute to any service evaluation.&lt;/p&gt;\n&lt;p&gt;You will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with staff teams to assess the current situation for the individual on the ward and compile information to inform person-centred dementia wellbeing formulations.&lt;/li&gt;\n&lt;li&gt;Work with staff teams to collaboratively devise related care plan suggestions informed by the psychological formulation and grounded in theory and research bases, specifically the ‘Newcastle model of wellbeing in dementia’.&lt;/li&gt;\n&lt;li&gt;Communicate these formulations and associated care plan suggestions effectively with ward staff teams in a fast-paced environment.&lt;/li&gt;\n&lt;li&gt;Support staff teams to integrate and apply this person-centred understanding and related care plan suggestions into care plan/s and practice, including being assertive and determined to make this happen.&lt;/li&gt;\n&lt;li&gt;Be a role-model for delivering best practice person-centred care in dementia.&lt;/li&gt;\n&lt;li&gt;Offer training and particularly skills modelling through you being on the wards and working alongside ward staff throughout the process.&lt;/li&gt;\n&lt;li&gt;Collect service evaluation data for your respective areas.&lt;/li&gt;\n&lt;li&gt;Contribute to service improvements and research opportunities as relevant.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will link with the Older People’s Mental Health Service. You will work under the day-to-day management of a senior Clinical Psychologist and you will receive regular clinical supervision from them, either individually or in peer group format.&lt;/p&gt;\n&lt;p&gt;You will have experience of working with clients with complex needs and preferably people living with dementia. You will have knowledge and experience of devising and implementing person-centred assessments, formulations and intervention plans, using cognitive-behavioural frameworks.&lt;/p&gt;\n&lt;p&gt;You will have a good communication style which you can adapt to people with differing communication abilities. You will be able to work autonomously for significant parts of the working day, but adhere to an agreed work plan and be aware of the extent of your current competency skills and be able to show that you do not work beyond this.&lt;/p&gt;\n&lt;p&gt;The successful candidate for each post will hold a good honours degree in Psychology with BPS graduate basis for registration, and be interested in pursuing a career in a related area.&lt;/p&gt;\n&lt;p&gt;The&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258935", "validThrough": "2020-11-23T23:59:59+0000"}