{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18491", "minValue": "15129", "unitText": "YEAR", "value": "£9-11 PH"}}, "datePosted": "2020-10-30T16:10:09+0000", "description": "&lt;p&gt;At the QPHC Dr N Ahmed, we are a dynamic and innovative company looking for exceptional candidates who want to succeed and take general practice to a different height! &lt;/p&gt;\n&lt;p&gt;We recognise that our brilliant teams deliver quality patient care and if, like us, you too are passionate about patient care we will support you in your role to grow with us.&lt;/p&gt;\n&lt;p&gt;Work-life balance is important to you, we get it. We make sure all our services are delivered within a 8am – 6.30pm, Tuesday/ Wednesday 8.00 am-8.30PM -,. The post will involve you working Monday to Friday and will also require some flexibility in your availability as per practice requirements. The specific Hours for the position is .&lt;/p&gt;\n&lt;p&gt;MONDAY-2.30PM-6.30PM&lt;/p&gt;\n&lt;p&gt;TUESDAY-3.30PM-8.30PM&lt;/p&gt;\n&lt;p&gt;WEDNESDAY-3.30PM-8.30PM&lt;/p&gt;\n&lt;p&gt;THURSDAY-OFF&lt;/p&gt;\n&lt;p&gt;FRIDAY-2.30PM -6.30 PM&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an individual who has office admin and reception experience ideally in a GP setting.&lt;/strong&gt;The right candidate will definitely be someone who is great with people, approachable and has genuine care for patients. Someone who is adept in using their own initative when working alone and a great team player when working with others to get more complex tasks done. In return you will be a part of a multi-skilled reception team who assist and support each other in their day to day and individual tasks, working together to ensure we deliver safe, effective and efficient services.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Career development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We fully believe in investing in our staff to help them reach their career goals and full potential. We offer all staff the chance to further their education with free training courses in any field that will both benefit themselves and the company.&lt;/p&gt;\n&lt;p&gt;Why work for QPHC Dr N Ahmed?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;Social events including staff Christmas parties&lt;/li&gt;\n&lt;li&gt;Quality working environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you feel you have the right skills that match the job description, we would LOVE to hear from you!&lt;/p&gt;\n&lt;p&gt;QPHC Dr N Ahmed is committed to equal opportunities and welcomes a broad diversity of talent to apply.&lt;/p&gt;\n&lt;p&gt;If you have further questions and would like to find out more about this post email : Khawsar.Alom@nhs.net&lt;/p&gt;\n&lt;p&gt;Please do not send CV&#39;s directly . If you have an interest in the role, please complete and submit the application form in order to be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W10 4LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5306", "longitude": "-.207616"}}, "title": "Part Time FTC Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250878", "validThrough": "2020-11-13T23:59:59+0000"}