{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 plus HCAS"}}, "datePosted": "2020-10-28T21:00:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Basildon &amp; Brentwood Emotional Wellbeing and Mental Health Service&lt;/strong&gt; &lt;em&gt;(previously CAMHS)&lt;/em&gt; has an exciting opportunity for a qualified and experienced&lt;/p&gt;\n&lt;p&gt;Clinical Psychologist, Family Therapist or Child and Adolescent Psychotherapist&lt;/p&gt;\n&lt;p&gt;to step into an established role within a diverse and experienced team.&lt;/p&gt;\n&lt;p&gt;Working as EWMHS Clinical Lead in B&amp;B and the surrounding area, you would have comprehensive knowledge and significant experience of working with young people in a EWMHS / CAMHS service.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic individual who is passionate about helping young people and their families, interested in leading clinical developments with the team, supervising staff and supporting the manager to maintain and develop the highest standards of care and therapeutic support for the young people and their families who access our service. The clinical leads are expected to support the team and develop the delivery of care through supervision of some staff and by offering their input within MDT and leadership meetings.&lt;/p&gt;\n&lt;p&gt;This includes the development and implementation of a range of groups and 1-1 therapies, consistent with CYP IAPT and NICE guidance&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will have experience of supervising and managing others, you would also have a keen interest in developing innovative strategies to support young people and their families.&lt;/p&gt;\n&lt;p&gt;As well as holding a reduced case load, the Clinical Lead supports their clinical team to deliver therapeutic interventions and continue pathway development through supervision, teaching, and mentoring. Knowledge and experience of delivering interventions within child mental health is essential. Additional therapeutic skills and training such as CBT, SFT, Family / Systemic, DBT and other counselling approaches is desirable.&lt;/p&gt;\n&lt;p&gt;We are a medium sized, friendly and supportive team that cover the Basildon &amp; Brentwood Area in Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About NELFT EWMHS&lt;/strong&gt;&lt;br /&gt;NELFT’s EWMHS is for anybody aged between 0-18, living in the Southend, Essex and Thurrock areas and is free at the point of entry. The service is also for young people with special educational needs (SEN) up to the age of 25.&lt;span&gt; &lt;br /&gt;&lt;/span&gt;&lt;br /&gt;EWMHS delivers and supports:&lt;br /&gt;• Preventative programs in schools, children’s centres and other local places&lt;br /&gt;• Advice, training and support for other health and social services&lt;br /&gt;• A range of services including parenting and family groups, short psychological treatments and mindfulness in schools&lt;br /&gt;• More in-depth psychological treatments, which are evidence based and delivered by highly skilled practitioners in specialist teams&lt;br /&gt;• Help and support for all young people at times of crisis&lt;br /&gt;• Online and digital services &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;The aim of EWMHS is to respond earlier to children and young people’s needs in order to help prevent, reduce or delay the need for more specialist interventions. This transformation of children and young people’s mental health services has a clinical focus, integrated with local authorities to deliver a long term collaborative approach to planning and delivering services.&lt;br /&gt;&lt;br /&gt;EWMHS focuses on emotional wellbeing as well as mental health and includes access to self-help tools and services based in schools and the community. The CAMHS Tier II and Tier III service no longer exist, replaced with an integrated EWMHS. Training and support is available to other professionals and agencies. We are creating a modern service that fits with children’s lives in a way that best suits them. Key features include a Children’s Single Point of Access (CSPA) into the service, clear early signposting, and use of digital channels to access support and services.&lt;br /&gt;&lt;br /&gt;The service is driven by the principles underpinning CYP-IAPT (Children and Young People’s Improving Access to Psychological Therapies): evidence based interventions, routine measurement of outcomes, access to high quality training and supervision for professionals and true co-production with children and young people.&lt;br /&gt;&lt;br /&gt;All referrals to the service are assessed using a care pathways approach, developed in line with the National Institute for Health and Care Excellence guidance criteria (NICE) and based on a best practice model of treatment. Each care pathway is clinically led, with care pathway leads operationally managing all EWMHS practitioners working in that care pathway. With the support of the team manager, care pathway leads are responsible for assessment, treatment and systematic outcome measurement in that care pathway. EWMHS multi-disciplinary pathway workers and mental health workers may work across more than one care pathway in a locality team. &lt;br /&gt;&lt;br /&gt;Care pathway leads and practitioners ensure that a high quality, timely, accessible and evidence-based service is available to all children and young people who need it. This means establishing and maintaining excellent working relationships with wider social, health and voluntary services.&lt;br /&gt;&lt;br /&gt;Working in our EWMHS locality teams is for you if you are excited by a modern approach. We would very much like to hear from you.&lt;br /&gt;&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "EWMHS Great Oaks, Basildon", "postalCode": "SS14 1EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5719", "longitude": ".458671"}}, "title": "EWMHS Clinical Psychologist, Family Therapist or Child and Adolescent", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247581", "validThrough": "2020-11-11T23:59:59+0000"}