{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Attractive rates"}}, "datePosted": "2020-10-02T14:15:54+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS Professionals in partnership with University Hospitals Plymouth NHS Trust are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Radiotherapy Radiographers to join the bank.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Flexible and long term opportunities are available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Derriford Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Attractive pay rates&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 40,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our 62 NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are seeking Band 6 Radiotherapy Radiographers who are motivated and enthusiastic with excellent communication and team working skills to join our bank.&lt;/p&gt;\n&lt;p&gt;In order to apply for this post you must have a minimum of 6 months’ experience in a similar role held within the last 2 years, and hold a valid HCPC registration.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder should be able:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide safe and accurate specialist technical service delivering therapeutic ionising radiation, while maintaining a high duty of care to all patients undergoing Radiotherapy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To demonstrate effective patient management encompassing all patients’ needs, using specialist knowledge of treatment side effects, skin reactions and their management. Taking responsibility for referring patients for clinical assessment by a consultant or deputy, prior to commencement of treatment when symptoms become acute.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrate ability to resolve complex treatment and planning issues with problem solving skills and effective autonomous decision-making.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Compute and check specialised calculations and complex planning data relating to patients treatment delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To maintain specialist knowledge of ARIA to enable autonomous registration, review and decision making on patients Electronic Portal Images used to verify the patient position.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To maintain a specialist knowledge of ARIA requiring the individual to input, and be a final check for patient data and plan parameters to be used for Radiotherapy treatment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To communicate effectively with Oncology Consultants &amp; Registrars regarding highly complex planning or treatment information to ensure safe and accurate delivery of treatment in accordance with trust and national legislation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To demonstrate effective critical thinking to determine efficacy of treatment prescription, planned and non- planned treatments and departmental procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To maintain specialist knowledge of pre-treatment procedures to provide safe and accurate pre-treatment planning service, ensuring a high quality of care to all patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Participate in CT planning, determine on position of patient and volume to be imaged, input data into the Planning computer and Prosoma Virtual Simulation Application.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;May participate in HDR preparation and delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;High level of skill required enabling manipulation and positioning of the patient to achieve accurate set-up&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Competitive, weekly pay&lt;/p&gt;\n&lt;p&gt;- Paid annual leave&lt;/p&gt;\n&lt;p&gt;- Training and development opportunities&lt;/p&gt;\n&lt;p&gt;- Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/p&gt;\n&lt;p&gt;- Access to a wealth of Health Service Discounts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Radiotherapy Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210905", "validThrough": "2021-01-10T23:59:59+0000"}