{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a inclusive of HCA"}}, "datePosted": "2020-11-06T09:31:01+0000", "description": "&lt;p&gt;Band 6 Specialist Hand Therapist&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for a Hand Therapist (either Occupational Therapist or Physiotherapist) to work as part of a well-established and dynamic multi-disciplinary hand team. We seek an individual who is autonomous, forward thinking and enthusiastic. &lt;br /&gt;&lt;br /&gt;Our dynamic generic Hand Therapy team will support the successful candidate in developing specialist hand therapy assessment, intervention and clinical decision making skills. The team consists of 29 Hand Therapists supported by five assistants and led by a Consultant Hand Therapist. We have 3 Advanced Clinical Practitioner (ACP) Hand Therapists and an ACP apprentice, working in partnership with St George&#39;s, University of London.&lt;/p&gt;\n&lt;p&gt;Hand Therapy is part of the Therapies Directorate with a supportive and progressive management structure. Departmental objectives are founded upon the core principles of the clinical governance framework and Trust Core Values. Research activity, robust evidence based practice and national guidelines drive forward our vision and direct service delivery. &lt;br /&gt;&lt;br /&gt;This position offers an important opportunity and challenging career move for you to advance your clinical skills and expertise. You will manage a busy clinical caseload of non-surgically and surgically managed patients with traumatic and elective hand and upper limb injuries. Additionally you have the opportunity to assess and manage non-surgical conditions referred from the community. Hand Therapy is delivered face to face and via video and telephone. You should expect to participate in local and national Hand Therapists&#39; activities. There are opportunities for additional training. &lt;br /&gt;&lt;br /&gt;Does this sound like the challenge that you are looking for? If so, please apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19/11/20 at midnight&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHannah BellJob titleAdvanced Clinical Practitioner Hand TherapistEmail addressHannah.bell@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Hannah Bell (Advanced Practitioner Hand Therapist, Hand Therapy) hannah.bell@gstt.nhs.uk or Nina Phillips (Band 7 Occupational Therapist in Hand Therapist) nina.phillips@gstt.nhs.uk or Dr Fiona Sandford (Consultant Physiotherapist, Hand Therapy) fiona.sandford@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guys and St Thomas&#39; NHS Foundation Trust, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Specialist Hand Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259023", "validThrough": "2020-11-19T23:59:59+0000"}