{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-10-23T17:30:32+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Research Facility Administrator&lt;/strong&gt;&lt;strong&gt; Band 5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;– Leonard Wolfson Experimental Neurology Centre &amp; Clinical Research Facility 170 Tottenham Court Road&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NIHR UCLH Clinical Research Facility UCLH is a well-established Clinical Research Facility covering two sites. The Leonard Wolfson Experimental Neurology Centre is a dedicated neuroscience experimental medicine facility at the National Hospital for Neurology and Neurosurgery (NHNN) at Queen Square (QS); and the NIHR UCLH Clinical Research Facility is a comprehensive Cancer and Medical research facility on the Bloomsbury campus (BC) at Tottenham Court Road.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic Clinical Research Facility Administrator in this exciting venture. The post holder will play a key role in meeting and greeting patients participating in research studies, managing the reception desk and area at the QS site, and the database which coordinates visits for trial subjects, in liaison with Research Nurses, Trial Coordinators and Principal Investigators for each study, prepare medical records for trial visits and collect, record and code data regarding these visits. An additional aspect of the role will be to assist the CRF Director in diary and calendar management, booking meeting locations, and liaising with other meeting attendees as required.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the CRF Director, medical and nursing staff, senior clinical and non-clinical managers, and all other employees within the Trust. The post holder will be responsible for general administration duties of the CRF together with the CRF Office and Facilities Manager, including liasing with UCL/UCLH estates for building/equipment repairs, and assisting with organisation of stakeholder events and educational training days. The role will be mainly based at the NHNN, but from time to time the post holder will be expected to work at the CRF site based at 170 Tottenham Court Road. The post-holder will be expected to deputise for the Office and Facilities Manager as and when necessary. This will be a challenging and varied position, involving extensive coordination and communication with internal stakeholders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity. If you would like further information about the post, please contact Rajeshree Khengar at r.khengar@ucl.ac.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "CRF Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241442", "validThrough": "2020-11-06T23:59:59+0000"}