{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-01T15:15:16+0000", "description": "&lt;p&gt;London North West University Healthcare NHS Trust are recruiting 2 Consultants in Medicine for Older People primarily based at Ealing Hospital . This is an exciting opportunity to join our growing department, as we undergo an exciting period of expansion and service development. Dynamic, enthusiastic and team-oriented candidates with a passion for our specialty, who are keen to take an active role in service development, are invited to apply for this position.&lt;/p&gt;\n&lt;p&gt;Our department&#39;s aim is to deliver a comprehensive range of services across primary, intermediate and secondary care, and to improve access to specialist health care for older people, and in particular to develop and support:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;The management of older people in the acute setting and development of acute services specifically aimed at early intervention, admission avoidance and reduction in length of stay. This includes an ED frailty service, an OPSSU (older person’s short stay unit) and rapid access clinics and Same Day Emergency Care (SDEC) for older people&lt;/li&gt;\n&lt;li&gt;Specialist multidisciplinary care on our acute wards for older people with the most efficient journey through hospital wards to make sure the right care is provided at the right time.&lt;/li&gt;\n&lt;li&gt;Strong links with community partners focusing on prevention of hospital admission, palliative care in the community, optimum care in care homes and supporting older adults to remain well at home.&lt;/li&gt;\n&lt;li&gt;Support for older adults as they undergo surgical treatments and are looked after by other specialist teams.We welcome informal visits and enquires.For more information please contact Dr Kate Senger, 07764 754672, or Jamie Zanardo, General Manager, 07796 705683.&lt;/li&gt;\n&lt;li&gt;Interview date – TBC&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;We are a friendly cohesive department working within the Integrated Medicine Division. New consultants will be supported to develop their own special interest and mentoring will be provided. Consultants will be offered the opportunity to participate in medical on call duties to keep up their GIM skills. Applications are welcomed from Doctors within 6 months of their CCT, or CESR in Geriatric medicine, and existing consultants looking to relocate or a new challenge. The posts are full time, 10PA (7.5 DCC, 2.5 SPA) however applicants looking to work less than full time are also invited to apply.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information please contact Dr Kate Senger, 07764 754672, or Jamie Zanardo, General Manager, 07796 705683.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Hospital, Ealing, London", "postalCode": "UB1 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.507", "longitude": "-.346317"}}, "title": "Consultant in Geriatrics (Ealing)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251185", "validThrough": "2020-11-29T23:59:59+0000"}