{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T13:16:24+0000", "description": "&lt;p&gt;Job Advert – Band 7, Corporate Directorates BPA Team&lt;/p&gt;\n&lt;p&gt;This is a permanent, full-time (37.5 hours) post.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within the Corporate Directorate Business Partnering function of Aneurin Bevan UHB, resulting in an excellent opportunity for a fully qualified Accountant who is enthusiastic, self-motivated and technically skilled to join the team as a Decision Support Accountant.&lt;/p&gt;\n&lt;p&gt;The post holder will have the opportunity to work with a large variety of services that are the responsibility of the 12 Executive Directors, to meet their financial challenges and providing financial support.&lt;/p&gt;\n&lt;p&gt;The individual will be expected to make a contribution to the development and implementation of financial policies, which facilitate the achievement of the Health Board’s financial objectives.&lt;/p&gt;\n&lt;p&gt;The post-holder will be expected to implement an annual budget setting process and to provide financial advice to all interested parties.&lt;/p&gt;\n&lt;p&gt;Applicants should possess a sound understanding of financial and governance requirements as well as the potential to develop business partnering, including providing financial training for managers and clinicians.&lt;/p&gt;\n&lt;p&gt;You will have management and business partnering accounting experience in the NHS, or similar large organisation, in an environment dealing with complex issues. You will have good analytical and communication skills and be able to maintain excellent relationships with both finance and non-finance staff, with the ability to present financial data to a variety of individuals and groups.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Archer, Finance Business Partner Accountant, Corporate Directorates&lt;/p&gt;\n&lt;p&gt;Telephone: 01633 431609&lt;/p&gt;\n&lt;p&gt;e-mail: Karen.Archer@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Headquarters, St Cadoc&#39;s Hospital, Newport", "postalCode": "NP18 3XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6132", "longitude": "-2.96674"}}, "title": "Decision Support Accountant - Corporate Directorates", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257836", "validThrough": "2020-11-19T23:59:59+0000"}