{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa dependent on experience"}}, "datePosted": "2020-10-30T10:00:25+0000", "description": "&lt;p&gt;We are seeking dynamic, enthusiastic and motivated individuals to lead and work within the newly developed Decisions Unit (DU).&lt;/p&gt;\n&lt;p&gt;Alongside the 136 place of safety the DU will form part of the wider Crisis Hub, comprising the Out Of Hours team, Single Point of Access (SPA) and the citywide AMHP service. These services will integrate and work together to provide 24/7 access and management of effective, safe and high-quality crisis care. Working within the Crisis Hub, the focus of the DU will be to work closely with the Psychiatric Liaison service, the acute mental health inpatient wards and varying community services to support and maintain patient flow throughout the system. The DU will offer a safe and therapeutic environment to aid assessment for those whose crisis situation may resolve quickly or for those who need further review of their needs.&lt;/p&gt;\n&lt;p&gt;As the service continues to evolve the DU will also assume responsibility for the safe management and operation of the 136 Health Based Place of Safety that is currently located within the Longley Centre. &lt;/p&gt;\n&lt;p&gt;You will need to be a Registered Mental Health Nurse with experience of working within a multi-disciplinary mental health setting. The role will involve clinical leadership and the day to day coordination of clinical practice to support the effective delivery of care within the crisis hub.&lt;/p&gt;\n&lt;p&gt;You will need to possess excellent communication skills to work in collaboration with the service user, other professionals and wider services and have effective skills in assessing, planning, evaluating and managing care. You should have a positive attitude and approach to caring for the service user population, and have a sound understanding and working knowledge of crisis care. Successful candidates will also be expected to work flexibly across the crisis hub services as and when it may be deemed necessary.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please ensure you read the post’s job description and person specification and that your supporting information reflects this as your application will be judged against these criteria.&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you decide to apply for this post but do not hear from us within three weeks of the closing date, please assume that you have not been shortlisted on this occasion.&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communication for this position will be through NHS Jobs, so please ensure you access your account regularly and turn on notifications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S5 7JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4107", "longitude": "-1.46044"}}, "title": "Registered Mental Health Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249582", "validThrough": "2020-11-15T23:59:59+0000"}