{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-04T10:46:05+0000", "description": "&lt;p&gt;East Kent Hospitals University Foundation Trust is looking to recruit a Deputy Director of Strategy and Business Development to lead the development of the Trust’s clinical strategy in partnership with the clinical Care Groups.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure that the Trust develops and maintains a proactive approach to strategic development of clinical services, specifically focussing on developing partnerships with other public and private sector organisations, ideally building on an existing knowledge of the east Kent clinical strategy.&lt;/p&gt;\n&lt;p&gt;The Deputy Director of Strategy and Business Development will work closely with key Care Group staff in driving forward strategic change and development with a clear focus with a clear focus on delivery of the required business cases.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake discussions around collaboration and partnership working with external organisations, particularly commissioning organisations as well as potential delivery partners, to support the delivery of the Trust clinical strategy.&lt;/p&gt;\n&lt;p&gt;The post holder will support the organisation in making a meaningful contribution to the development of a Kent and Medway strategy.&lt;/p&gt;\n&lt;p&gt;The delivery of projects and work streams together with full line management authority and responsibility for the staff directly supporting these initiatives will be key elements of this post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Paul Burch&lt;/p&gt;\n&lt;p&gt;Email Address:paulburch@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Deputy Director of Strategy and Business Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255431", "validThrough": "2020-11-18T23:59:59+0000"}