{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum pro rata inclusive of"}}, "datePosted": "2020-10-21T10:15:57+0100", "description": "&lt;p&gt;Do you have an interest in multidisciplinary rehabilitation? We have an exciting opportunity for a Clinical Psychologist with an interest in neuropsychology to join us at the Royal Free Neurological Rehabilitation Centre (NRC) in Edgware.This presents an excellent opportunity to further develop your specialist neuropsychology skills and you will work closely with the senior Clinical Neuropsychologist at the NRC who will provide on-site support and supervision as well as a colleague as a job share post .This post is offered on a temporary basis to cover maternity leave of the existing post-holder. You will be joining an established team that is part of the Neurosciences Directorate of the Royal Free Hospital. The NRC is a district level service providing specialist inpatient (14 beds), outpatient and community services to adults with a neurological condition. This position will be based on the specialist inpatient unit with some work in the outpatient service. There is a spirit of good teamwork which values psychology input, and an enthusiastic approach to MDT working is essential. This post is part time 22.5 hour per week as a job share with a colleague working 15 hours per week . There is close collaboration with the other post holder to provide peer support and the job share is designed to have some cross over. The RFL support flexible working and there can be further discussions round how the part time hours are worked to meet the needs of the service and the applicant.You will have proven experience and interest in working in a neurological setting, and preferably some post-qualification experience in this area. You will be expected to provide specialist assessment, formulation, individual and group interventions for people with a broad range of neurological conditions, as well as input into service development projects, in-service training and teaching programmes, and close working with MDT colleagues.You will also be joining an established Clinical Psychology/Neuropsychology Department at the Royal Free Hospital, working together to enhance professional development and peer support. The Department also provides services in diagnostic neuropsychological assessment, acute in-patient neuro-rehabilitation and stroke. We also have good links with the London Clinical Psychology training courses, and we have strong teaching links with the University College London medical school.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Mishael Soremekun&lt;/p&gt;\n&lt;p&gt;Job title: Senior Clinical Neuropsychologist&lt;/p&gt;\n&lt;p&gt;Email address: m.soremekun@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0203 7582465&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Name: Nadia Jeffries&lt;/p&gt;\n&lt;p&gt;Job title: Clinical lead rehabilitation&lt;/p&gt;\n&lt;p&gt;Email Address: nadia.jeffries@nh.net&lt;/p&gt;\n&lt;p&gt;Telephone Number: 0203 7582465&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgware Community  Hospital, Edgware", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Band 7 Clinical Neuro-Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235815", "validThrough": "2020-11-20T23:59:59+0000"}