{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-16T08:16:18+0100", "description": "&lt;p&gt;&lt;strong&gt;This is a 0.6 WTE post, however applications for full time posts are welcome to apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;6 Month Fixed Term Contract – with the possibility of extension.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is seeking to appoint a Consultant General Adult Community Psychiatrist. This post provides senior psychiatric services to the Minehead Community Mental Health Team and service to patients under the West Somerset Home Treatment Team in the Minehead area. The post serves 6 GP surgeries based in Minehead, Dulverton, Williton/Watchet and Porlock/Dunster. The Minehead Community Mental Health Team is based in the Barnfield Unit at Minehead Community Hospital where the post holder will be based.&lt;/p&gt;\n&lt;p&gt;The whole registered patient’s number for individual GP surgeries allocated to the adult community psychiatry consultant posts in Minehead is 33843 distributed between 6 GP surgeries. Referral rate is approximately 1165 annually.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver direct interventions including assessment, diagnosis and treatment of mental and physical health needs through outpatient clinics at Barnfield Unit and home visits as required&lt;/li&gt;\n&lt;li&gt;Act as Responsible Clinical for patients subject to a Community Treatment Order and occasionally, by mutual agreement, for patients on extended Section 17 leave from Rydon Ward&lt;/li&gt;\n&lt;li&gt;Undertake MHA assessments as the Trust Section 12 doctor for patients in the catchment area&lt;/li&gt;\n&lt;li&gt;Attend the weekly Minehead CMHT meeting&lt;/li&gt;\n&lt;li&gt;Work closely with the community teams to provide effect multidisciplinary collaborative care&lt;/li&gt;\n&lt;li&gt;Work collaboratively with the inpatient consultant and team based at Rydon Ward to ensure smooth transition for patients admitted and discharged from the ward&lt;/li&gt;\n&lt;li&gt;Contribute to the development of community mental health services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;On Call&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder can opt to join the senior out-of-hours on-call rota subject to availability.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Entry onto the GMC Specialist Register or within 6 months of receipt of Certificate of Completion of Training (CCT) at time of interview or CESR&lt;/li&gt;\n&lt;li&gt;Mental Health Act Approved Clinician / Section 12 Approved&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;About the Trust&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions. Somerset offers you the chance to live near some of the UK’s most desirable locations; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures.&lt;/p&gt;\n&lt;p&gt;The South West of England is a highly desirable place to live. Compared to other regions, house prices in the area are quite reasonable. Rural properties in many of the pretty villages in South Somerset and North Dorset are within easy commute to the hospital. Many properties have land or large gardens attached.&lt;/p&gt;\n&lt;p&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact Details/Interview Dates:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr. Fatin Hussein, Associate Medical Director on 01749 836600 (Pauline.Hooper@somersetft.nhs.uk) or Dr Michael Campbell on 01823 368350 (Cecilia.Hickman@somersetft.nhs.uk)&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnfield Unit, Minehead Community Hospital, Minehead, Somerset, Minehead, Somerset", "postalCode": "TA24 6DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2022", "longitude": "-3.46432"}}, "title": "Consultant (General) Adult Community Psychiatrist - Fixed term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229308", "validThrough": "2020-11-12T23:59:59+0000"}