{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc hcas"}}, "datePosted": "2020-11-04T11:31:23+0000", "description": "&lt;p&gt;The Royal Marsden Hospital is the largest comprehensive cancer centre in Europe. We have an international reputation for high quality patient care, research and education, and we want you to come and be part of our team, working to be the first and the best in everything we do.&lt;/p&gt;\n&lt;p&gt;Urology is one of The Royal Marsden’s busiest clinical units, with more than 800 new patient referrals to the Sutton site alone each year. As a result, the Trust has introduced the Urology Specialist Therapeutic Radiographer role. The Royal Marsden was the first UK centre to deliver treatment on the MR Linac, and by mid-2020 we will also have two Cyberknife platforms (one on each site) as well as a range of Elekta and Varian linacs. We have a wide range of clinical trials and research opportunities for motivated staff.&lt;/p&gt;\n&lt;p&gt;This role will join our existing Radiographer team in delivering care to patients having radiotherapy for urological cancers. This role is cross-site, with duties on both the Chelsea and the Sutton campuses. Responsibilities include on-treat review of men having radiotherapy for prostate and bladder cancer in radiographer-led clinics, contouring prostate and bladder cases for radiotherapy planning and insertion of gold fiducials for image-guidance. Training can be given where needed to fulfil these roles.&lt;/p&gt;\n&lt;p&gt;There are also opportunities to pursue independent research and service development within the urology/radiotherapy department.&lt;/p&gt;\n&lt;p&gt;If you are motivated, ready for a change and looking for an exciting opportunity to work at the forefront of radiotherapy as a Urology Advanced Radiographer then please apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alexandra Gordon or Louise Delacroix, Alexandra.Gordon@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Louise.Delacroix@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Marsden Chelsea Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Advanced Urology Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255622", "validThrough": "2020-11-18T23:59:59+0000"}