{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc HCAS"}}, "datePosted": "2020-10-23T18:45:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Senior Occupational Health Adviser (SCPHN &#123;OH&#125; Practitioner) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Monday to Friday 09.00-17.00 (37.5 hours)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Primary Location: &lt;/strong&gt;&lt;strong&gt;Based at Croydon University Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Secondary Locations: &lt;/strong&gt;&lt;strong&gt;Lennard Road, West Croydon and client sites, as required. We currently have remote clients in Dartford, Bromley and Croydon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post does not allow for home working as you will need to be flexible for the services needs and manage walk-in clients Monday to Friday.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our small friendly team, based over two sites, are looking for an autonomous, self-motivated, highly organised and diligent colleague who is able to work under a degree of pressure and manage the resilience challenges of an acute NHS employer.&lt;/p&gt;\n&lt;p&gt;Our new team member will need to fulfil the full remit of the job description and person specification. All clinical staff will be required to deliver vaccinations, blood testing and health surveillance to NHS and private clients.&lt;/p&gt;\n&lt;p&gt;Functionally, senior OHAs assess clients and write their reports within an allocated 45-60 minutes’ appointment and you will have approximately five new management referrals a day. We use three IT systems (ESR, OPAS and Cerner); clear, precise effective communication skills are essential and client engagements must be client-focused at all times, as we want our staff be and feel valued in every contact with OH and the wider OH teams.&lt;/p&gt;\n&lt;p&gt;Weekly clinical governance is chaired by the Head Of Service and staff will need to pass their vaccination assessment within two attempts in the first month of starting. The role is busy but rewarding and relevant training will be supported.&lt;/p&gt;\n&lt;p&gt;Applicants will only be considered if their application demonstrates relevant knowledge of Occupational Health and the interface that the senior OHA will have with clients when delivering OH services. Exceptional client care and customer satisfaction are our goals and we are presently working towards SEQOHS accreditation.&lt;/p&gt;\n&lt;p&gt;The group of SW London NHS OH services may form part of a Sustainability Transformation Programme in 2021/2022, but this is not confirmed at this stage. CHS expects that OH will have a physical presence on site – ensuring our staff are optimally supported.&lt;/p&gt;\n&lt;p&gt;Qualifications: Demonstrable post registration experience is required along with evidence of ongoing CPD. The Successful applicant will work with multidisciplinary teams, including recruitment and medical staffing teams, Risk Management and Infection Control.&lt;/p&gt;\n&lt;p&gt;Interviews: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further information, please contact Iain Docherty, Head of Occupational Health, Wellbeing &amp; Nursing iain.docherty@nhs.net or 020 8401 3463&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Athalia Chitauro, Senior OHA on 020 8401 3463.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIain DochertyJob titleHead of Occupational Health, Wellbeing &amp; NursingEmail addressiain.docherty@nhs.netTelephone number02084013463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital / Lennard Road, Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Senior Occupational Health Adviser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241498", "validThrough": "2020-11-08T23:59:59+0000"}