{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-03T16:33:16+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;IT Manager – Stevenage&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mountain Healthcare Limited believe in recruiting the highest quality staff to support their service delivery model, with the ethos that we care for each other and do the best we can! We believe we can make a real difference within the health sector and would love for you to join our team and are pleased to offer an exciting opportunity for a passionate IT professional based in Hertfordshire.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Operational Excellence Director, the job holder will understand our business strategy and will develop and manage all aspects of our IT along with its successful adoption and usage across the Group whilst maintaining an IT roadmap of budgeted and planned projects and initiatives with full accountability for their delivery.&lt;/p&gt;\n&lt;p&gt;Your skillset and experience to date will ensure good communication between all internal and external parties, whilst working closely with the business and stakeholders to ensure that business objectives are delivered by IT. Alongside this they will ensure compliance with all relevant legal and regulatory frameworks&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is proactive and business-driven with a passion for all things IT. The ideal candidate will hold a ITIL V3 Foundation, MCSE or MCP qualification and have over 5 years work experience within the IT sector. You will be familiar with Cyber and Information Security, have experience in platforms such as Microsoft Office 365, workforce management systems (including rota and case management ideally within the health environment) along with experience of project management and team management.&lt;/p&gt;\n&lt;p&gt;Salary for this role will be dependent on experience.&lt;/p&gt;\n&lt;p&gt;Successful applicants will ideally live within easy reach of Stevenage and hold a full driving license with access to transport. The ability to travel nationwide is essential and the occasional overnight stay will be required. Candidates must show a willingness to support the business where required including showing flexibility to operational demands and working hours where required. We expect a lot from you; however, we promise to support your development with training opportunities, and we listen!&lt;/p&gt;\n&lt;p&gt;For more information about the service please read the Job Description attached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mountain Healthcare is committed to safeguarding, and promoting the welfare of the people we serve. Therefore, all successful candidates will subject to pre-employment checks, including an Enhanced DBS Check, Police Vetting and satisfactory employment reference (s)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 2AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9029", "longitude": "-.212665"}}, "title": "IT Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254807", "validThrough": "2020-11-24T23:59:59+0000"}