{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata per annum"}}, "datePosted": "2020-11-05T14:30:49+0000", "description": "&lt;p&gt;Working as part of the Clinical Systems Support Team, supporting the development of the KMC), RiO and other clinical systems through a programme that will assist in providing excellent clinical care to its patients&lt;/p&gt;\n&lt;p&gt;The purpose of this role is to administer changes to the system and implement suitable solutions to meet the information needs of the clinical services and the Trust and organisations in Kent and Medway. You will support the Clinical Systems Analyst in identifying and documenting user requirements&lt;/p&gt;\n&lt;p&gt;You will support the systems analyst to maintain standards and procedures to ensure that controls on updates and revisions to the system meet business needs. You will support the Systems Analyst to track, control and report status of all software and infrastructure changes to the Business Transformation and Configuration Analyst&lt;/p&gt;\n&lt;p&gt;The main aspects of the role are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Business Transformation and Configuration analyst to design and configure RiO system working with the Performance team, and services&lt;/li&gt;\n&lt;li&gt;Review the data feeds in KMCR including writing test scripts and running through them with the organisations/services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ideal candidate will have the following skills and experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;System configuration knowledge and experience&lt;/li&gt;\n&lt;li&gt;Clinical coding experience&lt;/li&gt;\n&lt;li&gt;Previous NHS System Testing knowledge or experience&lt;/li&gt;\n&lt;li&gt;Previous UAT experience in an NHS / healthcare environment&lt;/li&gt;\n&lt;li&gt;Proven experience of testing software systems&lt;/li&gt;\n&lt;li&gt;Ability to liaise with staff at all levels (clinical, management and administrative staff) both verbally and written&lt;/li&gt;\n&lt;li&gt;Able to relate technical information to non-technical people&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognised qualification, which we will support. So if you do not have the essential qualification for the role, this may not be an automatic barrier to you being offered an interview.&lt;/p&gt;\n&lt;p&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;Interviews to be held on the &lt;strong&gt;23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Habiba Rawoof&lt;/p&gt;\n&lt;p&gt;Job title Head of Clinical Applications&lt;/p&gt;\n&lt;p&gt;Email address habiba.rawoof@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07415798173&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sevenoaks Hospital, Sevenoaks", "postalCode": "TN13 3PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2883", "longitude": ".194757"}}, "title": "IT Assistant Systems Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258128", "validThrough": "2020-11-18T23:59:59+0000"}