{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 to £53,459 inc. HCAS  pa"}}, "datePosted": "2020-10-29T12:00:25+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Deputy Head of Patient Experience and Involvement - Band 8a&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Ashford and St Peters Hospitals NHS Foundation Trust has an exciting opportunity for a Deputy Head of Patient Experience and Involvement to support our Head of Patient Experience in leading an experienced team in our challenging, but rewarding patient experience service. The service incorporates complaints management, patient advice and liaison (PALS), volunteer services and bereavement. We are also looking for someone who is excited by the prospect of leading on our ‘Healing Arts’ programme.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide a caring and professional service to ensure that all patients, families, carers and supporters receive the best when they liaise with our team.  We seek to deliver the Trust’s Strategy in all that we do in a proactive and sensitive manner, giving service users the best possible experience; particularly when they are going through a difficult time.&lt;/p&gt;\n&lt;p&gt;We are looking for experience of managing complaints, PALS, patient feedback and surveys, so that these services can continue to run to a high standard of efficiency and effectiveness and experience of quality improvement work directly related to patient experience feedback.  You must be excellent in dealing with NHS service users, colleagues and external organisations, including regulatory bodies. &lt;/p&gt;\n&lt;p&gt;You must have previous experience of working at this level in the NHS, ideally within an acute Trust and have the right attitude to keep calm in this fast paced service.&lt;/p&gt;\n&lt;p&gt;In return we offer opportunities for flexible working, access to the NHS Pension Scheme, work perks, NHS discounts; opportunities for training and development and on-site childcare provisions.&lt;/p&gt;\n&lt;p&gt;For further information please email jacqui.rees1@nhs.net or phone 01932 726040&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Deputy Head of Patient Experience and Involvement - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248208", "validThrough": "2020-11-15T23:59:59+0000"}