{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-10-26T14:46:24+0000", "description": "&lt;p&gt;Leeds and York NHS Partnership Foundation Trust are looking for enthusiastic and experienced Health Support Workers to join our team. We are currently recruiting to our Older People’s Inpatient services at The Mount in Leeds.&lt;/p&gt;\n&lt;p&gt;The Mount has 4 wards which provide care for older people with mental health needs and people with dementia.&lt;/p&gt;\n&lt;p&gt;As a Health Support Worker, you will be expected to work with patients, carers and the Multi- Disciplinary Team to provide care to people with mental health needs and/or dementia.&lt;/p&gt;\n&lt;p&gt;The successful candidate(s) will be positive and enthusiastic in your approach, calm and confident when dealing with the needs of the service users. You will have excellent communication skills, and will show that you have the ability to form and sustain therapeutic relationships with people with mental health needs and/or dementia.&lt;/p&gt;\n&lt;p&gt;The successful candidate(s) will possess excellent communication skills and will show that you have the ability to form and sustain therapeutic relationships. You will be able to demonstrate a genuine interest in mental health and/or dementia care and be committed to involving service users in all aspects of their care. The role requires the candidate to support the care, assessment, interventions and activities for service users.&lt;/p&gt;\n&lt;p&gt;We are committed to improving service provision and actively engage all staff in developing services. The successful candidate(s) will be encouraged to develop creative ideas that support services users and the service as a whole. You will have the energy to work hard in a very active and busy inpatient care environment.&lt;/p&gt;\n&lt;p&gt;A flexible approach is required as this post involves working flexibly over a 24 hr / 7 day period.&lt;/p&gt;\n&lt;p&gt;We will offer you an induction and a continuing written appraisal and the opportunity to complete the care certificate, supported by regular supervision.&lt;/p&gt;\n&lt;p&gt;Informal visits to the ward are welcomed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Wray on 0113 8555611.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS2 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8042", "longitude": "-1.55908"}}, "title": "Health Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242946", "validThrough": "2020-11-09T23:59:59+0000"}