{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-01T09:15:57+0100", "description": "&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about Endoscopy nursing at North Bristol NHS Trust. Here are some of the reasons we’re unique….&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our unit is proud to have achieved JAG accreditation and runs a busy service from four dedicated procedure rooms, across a range of cases including Capsule Endoscopy, Enteroscopy, Bowel Screening, GI Endoscopy and GI pre-assessment clinics.&lt;/li&gt;\n&lt;li&gt;We are passionate about staff development, running dedicated training sessions once a week for all nursing staff to come together to develop their skills. For those who already have experience in Endoscopy, we would encourage a conversation with the senior team within the unit to discuss how we can best support your career aspirations.&lt;/li&gt;\n&lt;li&gt;Our unit undertakes over 11,000 endoscopies each year and our lists usually run between 8am – 6.30pm, Monday – Saturday. We do not currently run night shifts but we have 2 evening shifts until 8.30pm per week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just our Endoscopy department which is impressive; our trust itself is pioneering, progressive and proud. Let us tell you a little more about it…..&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and wellbeing initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our nurses do not shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;Our staff are consulted on equity issues across the trust within equality and development groups, and are given the mentoring and support to succeed. Our trust supports the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes. Our city boasts a wide range of state-of-the-art shopping, recreation and leisure facilities, a wealth of great local family days out, and excellent transport links. If you prefer country, village or smaller town living, our trust is easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Endoscopy nurse with the passion and talent to progress clinically and professionally?&lt;/li&gt;\n&lt;li&gt;A registered nurse eager to channel your experience into a new and exciting role through a comprehensive internal training programme of 6-9 months in elective and emergency endoscopy cases?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Unfortunately, this is role is not suitable for newly qualifying nurses. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So, are we right for each other? Here are your next steps…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email: Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Number: 0117 414 4550&lt;/p&gt;\n&lt;p&gt;or Melanie Baston 0117 4145063&lt;/p&gt;\n&lt;p&gt;melanie.baston@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse - Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207630", "validThrough": "2020-11-12T23:59:59+0000"}