{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T14:00:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Schedule and Planned Care Network &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Directorate&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;North Recovery Service &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;strong&gt;Band 6: Care Coordinator fixed term for 12 months&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 6: Community Mental Health Nurse/Care Coordinator (Male)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 5 Community Mental Health Nurse/Care Coordinator (Male)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary: Band 6 - £26,565 - £35,557 pa dependent on experience&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt; Band 5 - £22,128 - £28,746 pa dependent on experience&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;strong&gt;Location:Northlands Community Health Centre&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Hours: 37.5 &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Post Ref: 457-20-098-QN&lt;/strong&gt;&lt;br /&gt;A number of exciting opportunities have arisen in the North Recovery Team&lt;br /&gt;We are seeking a dynamic, enthusiastic and motivated individual to work as Care Coordinator within the North Recovery Service for a 12 month fixed time contract. We are looking for an experienced clinician who can effectively undertake the role of Care Co-coordinator and who can lead and support specific areas of service development. You will need a relevant qualification such as mental health nurse, social work or OT, with experience of working in a multi-disciplinary mental health setting. &lt;br /&gt;Due to staffing ratios and the demand on service, the team are looking to recruit a band 5 Male Community Mental Health Nurse, to work with a predominantly male caseload providing care co-ordination and a range of clinical and medicine management interventions. This will be within the context of the Caseload Management Team that provides a service to a range of service users with a lower level of health and social care need. We are also seeking a Band 6 Male Community Mental Health Nurse, whom will work with a predominantly male caseload providing care co-ordination and a range of clinical and medicine management interventions. &lt;br /&gt;SHSC is an equal opportunity employer which has been considered and deemed exempt under The Equality Act 2010 due to a genuine occupational requirement for male nurses to support the care of our male service users in the community. It has been identified that this group of service users will require administration of depot medication and specific risk management issues where a female nurse would not be appropriate. &lt;br /&gt;Skills in assessing, planning, evaluating and managing care within the Care Programme Approach are essential as is a working knowledge of social care management. You will need to possess excellent communication skills and be able to work independently and as part of the wider team. You should have a positive approach to meeting the needs of our service users and be able to demonstrate continued professional development.&lt;br /&gt;The successful individuals will also be expected to work as part of the duty rota which operates within the general working hours of 09:00 to 17:00 Monday to Friday. &lt;br /&gt;The Service provides ongoing care, support and treatment for individuals with complex mental health needs. We have a strong emphasis on multi-disciplinary team work in a service that consists of Community Mental Health Nurses, Social Workers, Support Workers, Occupational Therapists, Psychiatrists, Psychologists and Social Care Development Workers&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S5 8BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.42", "longitude": "-1.47981"}}, "title": "Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248611", "validThrough": "2020-11-11T23:59:59+0000"}