{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751"}}, "datePosted": "2020-11-05T10:31:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor – posts available within the Acute Care Group&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Maidstone &amp; Tunbridge Wells Liaison Psychiatry service – based at Tunbridge Wells Hospital and Maidstone Hospital.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Make a Difference! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We believe in changing lives through giving excellent care that improves people’s mental health and now is a great time to be part of the KMPT family and join our ‘Outstanding’ team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Care Group/Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be providing 9 PA clinical sessions to the West Kent Liaison Service and 1 PA Supporting Professional Activities. The West Kent Liaison Psychiatry Service serves the Tunbridge Wells Hospital at Pembury, and Maidstone Hospital, both operated by Maidstone and Tunbridge Wells NHS Trust. The service’s current working hours are 24 hours a day, 7 days a week. This post holder will work with patients referred aged 18 or over, without upper age limit.&lt;/p&gt;\n&lt;p&gt;The Liaison service provides input to the following areas:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emergency Department (ED).&lt;/strong&gt; The purpose of this element of the service is to assess anyone aged 18 or over who presents with a known or suspected mental illness. In addition there will be a clear expectation to input into ED to provide case identification, early intervention and alternative management strategies for patients including but not exclusive to with dementia and delirium, and for admission avoidance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In-patient Wards&lt;/strong&gt;. The aim of this element of the service is to provide specialist psychosocial assessments to inpatients and management advice to general hospital staff for any person aged 18 or over. In addition there will be input into the Integrated Discharge Team to facilitate rapid discharge and reduce delayed transfers of care.&lt;/p&gt;\n&lt;p&gt;As well as providing clinical input, it is anticipated the team will undertake a programme of training and education for both mental health and acute hospital staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Acute&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our acute admission wards provide inpatient care with intensive support for patients in periods of acute psychiatric illness. Patients have access to a wide range of therapy rooms and activities. We also provide crisis team and Liaison psychiatry services.&lt;/p&gt;\n&lt;p&gt;These are 10 PA posts however the Trust would welcome a discussion with individuals looking for a more flexible working pattern to support work-life balance.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the GMC including licence to practice.&lt;/p&gt;\n&lt;p&gt;The Trust has now moved to a position where MHA Section 12(2) Approval holders are expected to contribute to a middle-tier non-residential on call rota attracting an extra 1PA and 2% (of a 10 PA salary) pro-rata for part time. Specialty doctors who do not hold Section 12 (2) Approval are expected to work towards this and will be supported to do so.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to have enhanced clearance from the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why KMPT? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are not just a high-performing NHS trust, we are also a flexible employer that values and invests in our staff. We take pride in our services – which are underpinned by our values:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Respect&lt;/li&gt;\n&lt;li&gt;Openness&lt;/li&gt;\n&lt;li&gt;Accountability&lt;/li&gt;\n&lt;li&gt;Working together&lt;/li&gt;\n&lt;li&gt;Innovation&lt;/li&gt;\n&lt;li&gt;Excellence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Joining us will bring other benefits too; Kent is a great place to live and work, combining beautiful countryside and coastline with affordable housing, excellent schools and a range of attractive towns and villages.&lt;/p&gt;\n&lt;p&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;#KMPTProud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;KMPT is an Equal Opportunity Employer. All information received will be handled carefully and treated with confidentiality.&lt;/p&gt;\n&lt;p&gt;Kent and Medway NHS and Social Care Partnership Trust is a smoke free Trust. Production of false or forged documents/qualifications in order to obtain employment is a criminal offence and will be reported to the Police.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Fareedoon AhmedJob titleConsultant Liaison Psychiatrist and Clinical Lead for Liaison ServicesEmail addressfareedoonahmed@nhs.netTelephone number01322927465Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information regarding the post please contact Dr Mo Eyeoyibo, Assistant Medical Director, Community Recovery Specialist Services Care Group tel 01322 622041 or 07507880080, email m.eyeoyibo@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Fareedoon Ahmed, Consultant Liaison Psychiatrist and Clinical Lead for Liaison Services tel 01322 927465 or email fareedoonahmed@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257250", "validThrough": "2020-12-05T23:59:59+0000"}