{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 p.a. pro rata"}}, "datePosted": "2020-10-29T12:04:42+0000", "description": "&lt;p&gt;Solent NHS Trust Adult Services Portsmouth teams manage Community Services within the City of Portsmouth, playing a pivotal role in integrated Health and Social Care delivery.&lt;/p&gt;\n&lt;p&gt;We are looking for an Administration Assistant for our Out of Hours Nursing Team based at St Mary’s Health Campus, Portsmouth, with a requirement to work from other Solent NHS Trust sites in Portsmouth on occasions. Successful candidates will be expected to work shifts between 4pm to 8pm, Monday to Friday.&lt;/p&gt;\n&lt;p&gt;The Out of Hours Team are part of the Portsmouth Community Localities Nursing Service. The service delivers high quality and safe Nursing care to patients within their own homes or within their place of residence. This role is a new and evolving one. Ranging from general administration tasks to specific data collection, you will be supporting both Health and Social Care teams, using your skill with office software to help with the co-ordination and flow of patients moving between Acute , Primary care and Community services in Portsmouth.&lt;/p&gt;\n&lt;p&gt;Should you require any further information about this role, please contact Sally Pearce – Community Matron 07876 902702 or Julie Southcott – Senior Matron for Quality and service 07876 230748.&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8004", "longitude": "-1.06359"}}, "title": "Admin Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248249", "validThrough": "2020-11-15T23:59:59+0000"}