{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 p a incl HCAS"}}, "datePosted": "2020-11-05T13:31:49+0000", "description": "&lt;p&gt;The post holder will be a registered Nurse with surgical Nursing experience or Recovery experience. High dependency Nursing experience would also be an advantage but not essential. Be a good communicator and able to work as part of a team and on their own initiative. Be willing to undertake specialist training. A teaching and assessing qualification would be desirable but not essential.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;LNWH NHS Trust utilises innovation in peri-operative practice; as such we have an eight (8) bedded Post-Anaesthetic Care Unit (PACU) that runs collaboratively with our Recovery Unit. We have a tradition of excellence and our vision is simple, to provide a gold standard in peri-operative practice, and invest in you the people who deliver care. We are seeking enthusiastic and committed individuals to join our team.&lt;br /&gt;&lt;br /&gt;We currently have vacancies for peri-operative Staff Nurses at band 5 to join our peri-operative team. The Recovery Units consist of two area one 16 bedded and a 4 bedded ‘fast track’ recovery. The PACU has 8 beds. Northwick Park has 13 Theatres and is a specialist centre for colo-rectal surgery; it is also the regional centre for ENT and has a maxi centre for Oral-Maxillary Facial surgery. We are also part of the London Vascular service. We also run a ortho-trauma list and CEPOD. We have also Gynae and Urology patients.&lt;/p&gt;\n&lt;p&gt;We also cover a Post-Anaesthetic Recovery Unit (PACU) in Central Middlesex Hospital (CMH) with 4 beds where we look after post-operative patients that need close monitoring.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePedro SilvaAdditional contact information&lt;/p&gt;\n&lt;p&gt;Pedro Silva (Perioperative Matron) on 020 8869 2463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Perioperative Staff Nurse - Recovery and PACU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257901", "validThrough": "2020-11-19T23:59:59+0000"}