{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28324", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 - £16.85"}}, "datePosted": "2020-11-06T14:50:39+0000", "description": "&lt;p&gt;&lt;strong&gt;NHSP Security Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Security Officer Band 2&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Nottingham University Hospitals NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered: &lt;/strong&gt;Security Services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Queens Medical Centre (NG7 2UH)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Inclusive of accrued holiday pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Day - £9.21&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Night/Saturday - £12.98&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sunday/Bank Holiday- £16.85&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift pattern: 0700-1900 with flexibility to book your own shifts Monday – Sunday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration&lt;/strong&gt;: 1 month&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: Security Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Nottingham University hospitals NHS trust was Rated ‘Outstanding’ in ‘Well Led’ by the CQC and is home to some of the world’s leading clinicians and experts&lt;/p&gt;\n&lt;p&gt;Are you a Security Officer looking for new challenge?&lt;/p&gt;\n&lt;p&gt;We have placement opportunities available for Security Officers at Nottingham University NHS Trust specifically who will be required to undertake the following.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;As a security officer, you will be based close to the hospital entrance to monitor people going in and out. You will challenge anyone who is not a member of staff or a patients, make sure visitors have a reason to be in the hospital, ask official visitors to sign in and issue them with a pass, deal with any incidents which might threaten the security of staff and patients, where possible, diffuse potentially difficult situations, call in police or other emergency services if required, monitor CCTV, patrol the outside of the hospital including the grounds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt; include the following. List not exhaustive.&lt;/p&gt;\n&lt;p&gt;• All Security Officers must be in possession of a valid SIA Guarding License (front line) and must clearly wear this at all times when on duty.&lt;/p&gt;\n&lt;p&gt;• All Security Officers must have a high level of communication skill sufficient to be competent to receive and relay accurate information &amp; instruction over a radio (knowledge of formal radio voice procedure is not a requisite).&lt;/p&gt;\n&lt;p&gt;• All Security Officers must have a degree of physical fitness and robustness sufficient to be actively involved in the application of restraint when necessary and also to be able to spend prolonged periods of time on their feet (i.e. for site patrols, guarding duties, site-wide searches etc.).&lt;/p&gt;\n&lt;p&gt;• All Security Officers must be able to demonstrate behaviours consistent with the Trust’s Values and Behavioural Standards.&lt;/p&gt;\n&lt;p&gt;• A minimum of 2 years’ security experience in a public-facing role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note, for this post, you must have your own stab vest and work boots, we cannot consider anycandidates without it. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ideally you will also have but not essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• A valid SIA Public Space Surveillance (CCTV) License&lt;/p&gt;\n&lt;p&gt;• A clean UK driving license&lt;/p&gt;\n&lt;p&gt;• First aid responder training or similar&lt;/p&gt;\n&lt;p&gt;• NHS conflict resolution training and/or control &amp; restraint training&lt;/p&gt;\n&lt;p&gt;• Experience of working in a healthcare-type environment&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits:&lt;/p&gt;\n&lt;p&gt;- Competitive, weekly pay&lt;/p&gt;\n&lt;p&gt;- Access to the NHSP Stakeholder Pension&lt;/p&gt;\n&lt;p&gt;- Paid annual leave, statutory maternity pay and paternity pay (subject to qualifying criteria)&lt;/p&gt;\n&lt;p&gt;- Training and development opportunities&lt;/p&gt;\n&lt;p&gt;- Access to our very own pensions scheme called ‘NHSP Stakeholder pension’&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals ?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 120,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "NHSP Security Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260214", "validThrough": "2020-11-20T23:59:59+0000"}