{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43520", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £43,520 £32,896 to £43,520  per annum"}}, "datePosted": "2020-10-30T13:15:51+0000", "description": "&lt;p&gt;Betsi Cadwaladr University Health Board&lt;/p&gt;\n&lt;p&gt;Clinical Fellow ENT&lt;/p&gt;\n&lt;p&gt;40 hours&lt;/p&gt;\n&lt;p&gt;Fixed Term 12 months&lt;/p&gt;\n&lt;p&gt;The ENT Department consists of 5 consultants, 4 middle grades, 5 Clinical Fellow’s, 1 FY2 and 2 nurse practitioners. We have a full head and neck surgical service and host the regional Head and neck cancer MDT within the Glan Clwyd Cancer Centre. A new dedicated ENT Theatre features a ceiling mounted Microscope, CO2 and KTP laser systems as well a brand new HD stacker system for use in all cases especially FESS. The North Wales Cochlear Implant programme is based at Glan Clwyd involving the Audiology and ENT Depts. Specialist clinics include, neck lump clinic, balance clinic, CI clinic, voice clinic and minor ops sessions. We have regular formal education half days for the junior doctor team along with regular audit meetings with educational themes often combined with Wrexham ENT Dept. The department can be busy with on-call and ward duties but there is usually opportunity to get to clinics and theatres for supernumerary educational opportunities. The Emergency clinic / ward attender appointments are run by the junior doctor team and is a great introduction to ENT out-patient cases.&lt;/p&gt;\n&lt;p&gt;The dedicated ENT outpatient department has four consulting rooms, and 2 treatment rooms equipped with wall mounted microscopes, rigid and flexible scopes. There is a multi-skills laboratory which includes a dedicated microscope for temporal bone dissection.&lt;/p&gt;\n&lt;p&gt;Please note this post will not be formally recognised for training but we continue clinical governance half days and education half days to maintain our education programme, and promote a culture of continual improvements. Development of junior doctor’s knowledge, clinical skills and surgical experience is a high priority and is individually encouraged. Career progress is promoted and within our department recently a SHO grade doctor is now on the middle grade duties and many previous SHO have gone on to GP and other specialty training schemes. We can help develop individual’s CV for career development and reward enthusiasm.&lt;/p&gt;\n&lt;p&gt;On-call rota is a partial shift system involving runs of night shifts (non-resident from 10pm if staying within 20 minutes) for blocks of 3 or 4 nights with days off before and after.&lt;/p&gt;\n&lt;p&gt;We will look favourably towards any candidate looking to be involved with research or higher qualifications and will attempt to alter some daytime duties to accommodate such undertakings.&lt;/p&gt;\n&lt;p&gt;Betsi Cadwaladr University Health Board is the largest health organisation in Wales, providing a full range of primary, community, mental health and acute hospital services for a population of around 676,000 people across the six counties of North Wales (Anglesey, Gwynedd, Conwy, Denbighshire, Flintshire and Wrexham) as well as some parts of mid Wales, Cheshire and Shropshire.&lt;/p&gt;\n&lt;p&gt;It is responsible for the operation of three district general hospitals (Ysbyty Gwynedd in Bangor, Glan Clwyd Hospital near Rhyl, and Wrexham Maelor Hospital) as well as 22 other acute and community hospitals, and a network of over 90 health centres, clinics, community health team bases and mental health units. It also coordinates the work of 121 GP practices and NHS services provided by North Wales dentists, opticians and pharmacies.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr FlookJob titleConsultantEmail addressedward.flook@wales.nhs.ukTelephone number01745 448740 x 7271Additional contact information&lt;/p&gt;\n&lt;p&gt;Edward Flook - Edward.Flook@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glan Clwyd Hospital, Bodelwyddan", "postalCode": "LL18 5UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2718", "longitude": "-3.49635"}}, "title": "Clinical Fellow ENT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250313", "validThrough": "2020-11-15T23:59:59+0000"}