{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "up to £33,000 (p.a.) DOE"}}, "datePosted": "2020-11-04T12:34:52+0000", "description": "&lt;h1&gt;&lt;strong&gt;Help to make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for something different?&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Then look no further…&lt;/strong&gt;&lt;br /&gt; &lt;/strong&gt;&lt;br /&gt; Practice Plus Group manage are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;Situated in Exeter, HMP YOI Exeter is an adult/young offenders institution accepting males ages 18 and over; with an operational capacity of 550+. It accepts all adult and young offenders committed to prison by the courts from Cornwall, Devon, Dorset &amp; West Somerset.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP YOI Exeter, we’re looking for Primary Care Nurses to join our team.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About the role:&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Nursing in prison is never dull or predictable. On any given day the skills you use may be similar to those you need working in health promotion or A&amp;E, alternatively you may be supporting people to manage their mental health or substance misuse. It’s this variety that keeps things fresh and stimulating. Every day will bring new challenges and new experiences. But at the same time, you’ll have all the support you need to deliver the best care possible.&lt;br /&gt; &lt;br /&gt; The role will be an experience like no other, requiring a diverse and mixed nursing skills and background. One minute you could be delivering a nurse led clinic and the next you are attending an emergency response.&lt;br /&gt; &lt;br /&gt; You can expect to be involved in everything from clinical triage, suturing, wound care and fracture clinics to the evaluation and development of patient care and standards. You’ll carry out nurse-led clinics, reviewing patient histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Adult) with a real passion for developing your clinical skills in an environment that is ever changing.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You’ll receive an annual salary £33,000 FTE - depending on experience; free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt; As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;How will we support you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;• Bespoke induction&lt;br /&gt; • Competency framework&lt;br /&gt; • Preceptorship (newly qualified practitioners)&lt;br /&gt; • Regular clinical supervision&lt;br /&gt; • Supported development into specialities such as diabetes or asthma&lt;br /&gt; • Regional and national career development opportunities&lt;br /&gt; • Our bespoke Learning Management System to address your learning needs&lt;br /&gt; • Support from the wider team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Further job information:&lt;/h1&gt;\n&lt;p&gt;Salary up to £33,000 (p.a) - DOE for a full time role (37.5 hrs a week) but we also accept the part time applications where the salary will be pro-rated.&lt;/p&gt;\n&lt;p&gt;This role will also include some night shift work.&lt;/p&gt;\n&lt;p&gt;At HMP Exeter we deliver a 24/7 service although working hours do vary to provide overall support.&lt;/p&gt;\n&lt;p&gt;The working hours consist of:&lt;/p&gt;\n&lt;p&gt;Day – 07:30 - 17:30&lt;/p&gt;\n&lt;p&gt;Late – 13:15 - 21:15&lt;/p&gt;\n&lt;p&gt;Early – 07:30 - 15:30&lt;/p&gt;\n&lt;p&gt;Night – 21:00 – 07:45&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX4 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.728", "longitude": "-3.53224"}}, "title": "Primary Care Nurse - HMP YOI Exeter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255877", "validThrough": "2020-11-18T23:59:59+0000"}