{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 Per Annum Pro Rata"}}, "datePosted": "2020-11-06T15:01:40+0000", "description": "&lt;p&gt;Have you decided to take time out of training to consider your future career options?&lt;/p&gt;\n&lt;p&gt;Would you like the freedom to try a different specialty that you were not exposed to as a foundation trainee?&lt;/p&gt;\n&lt;p&gt;Are you looking develop your clinical competence?&lt;/p&gt;\n&lt;p&gt;Are you looking to go travelling, but feeling the constraints of annual leave in a full-time post?...........&lt;br /&gt;&lt;br /&gt;Then the role of Trust Doctor at Leeds and York Partnership NHS Foundation Trust (LYPFT) would be perfect for you.&lt;br /&gt;&lt;br /&gt;At LYPFT we absolutely understand that extending your knowledge and learning is important to you. The role of Trust Doctor is not a training post but is committed to supporting your development in a Teaching Hospital environment. We can give you the freedom to gain supervised experience and exposure in a variety of areas, extending your knowledge and learning prior to entering specialty training. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;LYPFT rates highly in the GMC survey for overall trainee satisfaction. We currently proudly host the President of the Royal College of Psychiatrists, Yorkshire &amp; Humber Higher Trainee of the year and the Director of Medical Education has a track record for innovation in training as an outstanding contributor to Health Education England Better Training Better Care project.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will benefit from the guidance of a Clinical Supervisor and Educational Supervisor who will support in your development and have an entitlement to study leave. We will work with you to agree a rotation that is tailored to your learning needs. In addition you will take part in out of hours cover, providing further learning opportunity where you will be supported by senior colleagues to continue enhancing your knowledge and skills. &lt;br /&gt;&lt;br /&gt;We understand that you need the freedom to explore exciting personal experiences, as a Trust Doctor we can offer you the opportunity to achieve a positive work life balance and enable you the opportunity to take an unpaid leave. Further benefits include; paid annual leave provision, paid sickness absence provision and NHS pension contributions. &lt;br /&gt;&lt;br /&gt;The successful applicant will need to be eligible for full registration with the GMC at time of starting the post, achieved MBChB or equivalent medical qualification, provide evidence of satisfactory completion of F1 &amp; F2 (or equivalent) and ALS training (or equivalent). Please see the Person Specification and Job Description attached for full details of the post.&lt;/p&gt;\n&lt;p&gt;There are three vacancies in Leeds (Becklin Centre Ward 1, Newsam Centre Ward 4, Newsam Centre Ward 5)&lt;br /&gt;&lt;br /&gt;If you are interested in becoming a Trust Doctor we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vickie Lovett, Medical Directorate Programme Manager - Vickie.lovett@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Becklin Centre Ward 1, Newsam Centre Ward 4 &amp; Ward 5, Leeds", "postalCode": "LS9 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8053", "longitude": "-1.52446"}}, "title": "Trust Doctor (Psychiatry)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260268", "validThrough": "2020-11-29T23:59:59+0000"}