{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 - £52,036"}}, "datePosted": "2020-11-06T10:16:32+0000", "description": "&lt;p&gt;Fixed Term - 3 month position starting 4.1.2021&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for a post as a Trust employed ST3+ level (equivalent) (fixed term for 3 months) at the North Midlands Neurosciences Centre within the University Hospital of North Midlands &lt;span&gt; (UHNM)&lt;/span&gt;. You will join an established team in helping to deliver a General and Subspecialty Neurology service within the North Midlands and beyond.&lt;/p&gt;\n&lt;p&gt;The University Hospitals of North Midlands is one of the largest and most modern NHS Trusts in the country and has several nationally recognised and commended neurological subspecialty services. The Neurosciences Directorate is one of three Sub-Regional Neurosciences Centres located within the West Midlands region and provides a comprehensive range of high quality of acute, elective in-patient and out-patient neurology services for the diagnosis and management of patients with acute and chronic neurological diseases.&lt;/p&gt;\n&lt;p&gt;The Neurology department is served by a dedicated Neurology ward which includes inpatient beds, Video telemetry and iv DHE provision.&lt;/p&gt;\n&lt;p&gt;The North Midlands Neurosciences Centre is supported by services from Neurosurgery, Neuroradiology, Neurophysiology, Stroke and Neuro-rehabilitation all based at the UHNM site. The Neurology department at UHNM promotes collaborative working and has a well-established nurse specialist service which supports clinical care. The University Hospital of North Midlands is affiliated to Keele University Medical school and the directorate is extensively involved in the delivery of both undergraduate and post-graduate teaching and training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Brendan Davies/Dr Carl Mann, Clinical Leads for Neurology on 01782679455 or 01782679456&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Davies/Dr MannJob titleClinical LeadsEmail addressbrendan.davies@uhnm.nhs.ukTelephone number01782679455 or 01782679456&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Midlands, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Trust Doctor (ST3+)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259173", "validThrough": "2020-11-16T23:59:59+0000"}