{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata"}}, "datePosted": "2020-11-04T15:16:51+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for a Registered Nurse Associate to join one of our District Nursing Teams based in Burnley. We are looking for a Nurse Associate to join this dynamic team who have recently achieved a SPEC Silver Award for consistently good care. District nursing provides the opportunity for nurses to work with a broad range of patients who require care in their own homes and in care home settings. It is a busy service which provides care for patients with short term care requirements, exacerbation of long term conditions, and end of life nursing needs. The team can provide you with an excellent opportunity to learn and develop holistic nursing skills with colleagues who are committed to community nursing and delivering care closer to home.&lt;/p&gt;\n&lt;p&gt;District Nursing is a great opportunity for you if you are a compassionate, enthusiastic and highly motivated nurse who is interested in working in a community setting and has an intention to develop clinical and leadership skills. You will take part in the effective delivery of treatment and care, and you must be committed to maintaining high standards, and have the drive to want to make a difference to patient care. In return for your commitment and talent we can offer a supportive work environment and the opportunity to develop your career in this interesting environment.&lt;/p&gt;\n&lt;p&gt;For recently qualified Nurse Associates the trust has a robust preceptorship programme and you will receive excellent opportunities for development. The District Nursing Service has a dedicated senior nursing team and Clinical Practice Educator who will oversee your training needs and support your development. In return for your skills, enthusiasm and commitment, you can expect a comprehensive induction programme whilst being part of a fantastic and dedicated and supportive team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGill IsherwoodJob titleClinical Team LeaderEmail addressgill.isherwood@elht.nhs.ukTelephone number01282 805935Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to know more about this post please contact the Burnley East District Nursing team on 01282 805935 to discuss the post further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley East District Nurses, Burnley", "postalCode": "BB11 2DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7914", "longitude": "-2.23893"}}, "title": "Registered Nurse Associate - District Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256406", "validThrough": "2020-11-18T23:59:59+0000"}