{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competetive"}}, "datePosted": "2020-10-21T12:25:19+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Mammographer/Radiographer in our Cambridge Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a Mammographer, with general radiography and theater experience to support and work with our multi disciplined team, ideally you will have your post graduate certificate but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Cambridge hospital is an CQC outstanding hospital. ,We have a busy outpatient department offering Physiotherapy and diagnostic imaging, including on-site MRI and CT scanners. The hospital has an excellent reputation for clinical care, expertise and efficient friendly staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full time role working 4 days weeks that cover Monday to Saturday on a rota&lt;br /&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;Whether you join us from the NHS or a private setting, you will find that we offer you an unrivalled opportunity to grow the respected career that you always wanted. You will benefit from our investment in state-of-the-art equipment and our commitment to give you more time with partners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Mammographer/Radiographer you will;&lt;br /&gt;&lt;br /&gt;- Deliver a high-quality diagnostic imaging service for a very varied caseload – within the department, on the ward and in theatre.&lt;br /&gt;&lt;br /&gt;- Working with leading practitioners and experiencing new practices, equipment and facilities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Providing a service of the highest quality, delivered with sensitivity and compassion.&lt;br /&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Radiographer you will have;&lt;br /&gt;&lt;br /&gt;- High levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail.&lt;br /&gt;&lt;br /&gt;- A caring nature – to see each patient as an individual and carry out this role with understanding and empathy.&lt;br /&gt;&lt;br /&gt;- A BSC degree in diagnostic radiography or equivalent to meet the registration requirements of the Health and Care Professions Council (HCPC)&lt;br /&gt;&lt;br /&gt;- A postgraduate qualification in an area of specialization.&lt;br /&gt;&lt;br /&gt;- Post registration experience relevant to the role.&lt;br /&gt;&lt;br /&gt;- Excellent communication and team working abilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Cambridge Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The original Nuffield Health Cambridge Hospital opened in 1921 as the Evelyn Hospital and is an established part of the local community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Cambridge Hospital was acquired by the Nuffield Health Hospitals group in 2003 and was originally named the Evelyn Hospital after the wife of the philanthropic art dealer Charles Morland Agnew.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Following the completion of our new hospital, we now have a state-of-the-art facility providing 36 bedrooms all of which have en-suite facilities. There are four operating theatres, two close monitoring beds and Oncology and Day Case suites.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;The Benefits&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;br /&gt;&lt;br /&gt;Location - Cambridge Hospital&lt;br /&gt;&lt;br /&gt;Weekly Hours - 37.5&lt;br /&gt;&lt;br /&gt;Contract Type - Permanent&lt;br /&gt;&lt;br /&gt;Salary - £30,000 plus benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB2 8AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1903", "longitude": ".124295"}}, "title": "Radiographer/Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236342", "validThrough": "2020-11-22T23:59:59+0000"}