{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a/pro rata"}}, "datePosted": "2020-10-16T14:09:03+0100", "description": "&lt;p&gt;&lt;span&gt;At Worcestershire Acute Hospital Trust we would like to offer this exciting opportunity will allow the successful candidate to join our enthusiastic and expanding team of dedicated physiologists who are committed to continuous service improvement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our most recent developments include the introduction of our new contrast, stress echo and TOE service as well as the expansion of our existing echo services, diagnostic EP and catheter ablation service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There will be opportunities to work in all areas within our comprehensive range of diagnostic investigations/procedures which include cardiac catheterisation, effective PCI and primary PCI (24hr) service, Permanent pacemaker, ILR and complex device (ICD / CRT) implantation and follow up working closely with MDT to ensure excellent standard of care to all our patients, &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a family friendly department, we are able to offer this position as full time or part time. We are in the process of amending working patterns to include four days a week. In view of the proposed 7 day service we would be happy to accommodate weekend working, if this is desirable. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications will be considered from individuals who are currently working as a Band 6 and are in the process of working towards accreditation in either Echocardiography or Cardiac rhythm management &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have 14 Consultant Cardiologists within Worcestershire Acute Hospitals NHS Trust, and the trust comprises of three hospitals: Worcestershire Royal Hospital, the Alexandra Hospital, and Kidderminster Treatment Centre. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal enquiries contact Matthew Manners, Countywide Cardiopulmonary Service Lead, on 01905 760690.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Acute Trust", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Highly Specialised Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230532", "validThrough": "2020-11-13T23:59:59+0000"}