{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-23T11:16:10+0100", "description": "&lt;p&gt;We have an exciting opportunity for someone to join the Heart Failure Team at Buckinghamshire Healthcare NHS Trust, for twelve months to cover maternity leave. &lt;br /&gt;&lt;br /&gt;The Heart Failure team is a well-established service and the post holder will be responsible for working within the wider cardiology team and provide a service for patients with a diagnosis of heart failure in primary, secondary and tertiary care settings. &lt;br /&gt;&lt;br /&gt;Whilst working in heart failure, the post holder will promote continuous development in clinical practice and delivery of patient care, encouraging innovation and appropriate change in service delivery within the specialty of heart failure in response to patient need, audit and evaluation and national guidance.&lt;br /&gt;&lt;br /&gt;The candidate will also provide information to manage and communicate to the wider team, for onward long term management of patients cardiac disease. They are expected to provide clinical leadership and supervision to the heart failure programme. Excellent interpersonal skills, dynamic approach and willingness to exceed expectation are all desirable qualities of the successful candidate.&lt;br /&gt;&lt;br /&gt;We take genuine pride in our friendly approach and adhere to the BHT Values of CARE - Collaborate, Aspire, Respect and Enable.&lt;br /&gt;&lt;br /&gt;A full induction and training will be provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Bowers&lt;/p&gt;\n&lt;p&gt;Senior Cardiac Research Nurse&lt;/p&gt;\n&lt;p&gt;07956645035&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wycombe Hospital - Cardiology, Expected to work trustwide", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Heart Failure Cardiac Nurse for Inpatients / Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240263", "validThrough": "2020-11-06T23:59:59+0000"}