{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc. Fringe HCAS"}}, "datePosted": "2020-10-23T09:20:03+0100", "description": "&lt;p&gt;&lt;span&gt;We currently have opportunities for aspiring or established Community Mental Health Practitioners in Woking Community Mental Health Recovery Service (CMHRS) based at Bridgewell House. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have one part-time and one full time vacancy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These would suit a Registered Mental Health Nurse, HCPC Registered Occupational Therapist or Qualified Social Worker registered with Social Work England with two years’ experience post qualification. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Woking CMHRS is a multi-disciplinary Recovery based community mental health service and aim to provide evidence based treatment and interventions to people with severe and enduring mental health problems with a focus on Recovery and promoting independence. We are working towards providing treatment within structured Care Pathways that ensure the best outcomes for our clients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to demonstrate a high level of commitment, motivation and knowledge working with people with severe and enduring mental health problems. This role will include assessing new people referred to our service and working with an allocated caseload of existing service users providing low level psychological interventions and liaising with other professionals to coordinate their care under the Care Programme Approach. You will also need to spend time working as a Rapid Response Worker dealing with urgent concerns for people who use our services. If you a nurse you will be responsible for administering medication in the community as part of your role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will need to demonstrate excellent communication skills and be able to work flexibly and collaboratively with a multidisciplinary team and other agencies. You will need to be able to assess risk dynamically and work to safeguard our clients. You will need to be able to drive and have access to a car. You will be supported in your role not only through formal supervision and training but also through a strong multidisciplinary approach within the team. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Surrey and Borders Partnership NHS Foundation Trust and the Community Mental Health Recovery Services have recently been rated Good by the Care Quality Commission. We would welcome enthusiastic additions to our friendly and close-knit team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgewell House, Claremont Avenue, Woking, Surrey, GU22 7SF", "postalCode": "GU22 7SF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3094", "longitude": "-.561458"}}, "title": "Mental Health Practitioner/ Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239809", "validThrough": "2020-11-18T23:59:59+0000"}