{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 PA"}}, "datePosted": "2020-11-06T13:17:18+0000", "description": "&lt;p&gt;&lt;span&gt;We are seeking to recruit a highly motivated, experienced Recruitment Administrator to join our busy recruitment team. The postholder will provide a pro-active and effective, customer focused end to end recruitment service, which is carried out in accordance with agreed processes, legislative requirements, Trust policy and in line with NHS Employment Check Standards and Agenda for Change. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will have proven organisational skills, be able to deal with conflicting priorities, build strong working relationships and be passionate about customer service. The postholder will deal with all aspects of the recruitment process including administering vacancies on NHS Jobs and Trac, response handling, arranging interviews and advising on the selection process as well as dealing with new staff appointments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will ensure that all pre-employment checks and clearances are obtained (references, OH clearance, DBS, professional registration checks, ID/right to work checks) and contracts of employment and offer letters are issued for successful applicants, ensuring they are accurate and administered within a timely fashion. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an individual who is committed, professional and self-motivated, able to work well within a team and under pressure. We are looking for a friendly professional with excellent communication skills, ability to form good partnerships, and confident in dealing with difficult situations. You will join a modern and progressive Trust committed to ensuring the health and wellbeing of staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Iwona Magda&lt;/p&gt;\n&lt;p&gt;Job title: Recruitment &amp; Retention Manager&lt;/p&gt;\n&lt;p&gt;Email address: iwona.magda@bedfordhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01234 344 122 Ext: 4753&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Recruitment Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259885", "validThrough": "2020-11-15T23:59:59+0000"}