{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19737", "minValue": "18005", "unitText": "YEAR", "value": "18,005.00 - 19,737.00"}}, "datePosted": "2020-11-03T17:18:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistant&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;North Kent Community Nursing Service (Dartford, Gravesend, Swanley and Dartford Rural)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic and motivated Healthcare Assistant? We are looking for a Health Care Assistant based in Kent. Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As a healthcare assistant you will be delivering NHS services with us and you will receive a salary of £18,005.00 - £19,737.00&lt;/li&gt;\n&lt;li&gt;Access to our group pension. &lt;/li&gt;\n&lt;li&gt;We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.&lt;em&gt; &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/li&gt;\n&lt;li&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as discounted experience days, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/li&gt;\n&lt;li&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working closely with our Community Nursing Team, as a Healthcare Assistant you will support and assist the senior team members to provide care to people in their own homes or within a clinic setting for a wide range of conditions including diabetes, wound and end of life care. Our work is crucial to the community as we aim to prevent unnecessary hospital submission. In this role, you will care for patients in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to put your NVQ level 3 or equivalent/appropriate qualification/experience to great use. With strong communication and organisation skills, and a flexible approach will ensure you deliver positive experiences to patients at every stage of their healthcare journey.&lt;/p&gt;\n&lt;p&gt; In this role, you will need to be able to travel across the patch in a timely manner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of our community nursing team we empower our staff to work autonomously and with flexibility by providing them with state of the art new tablets for them to be able to check in from home, write their notes up on the go and allow them to not be trapped in an office base, so they can really enjoy working in their chosen community background! &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact Abi Booth via email at Abi.Booth@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We partner with the NHS to make a real difference to people in Kent and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/em&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesham Community Hospital", "postalCode": "DA11 0DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4432", "longitude": ".365561"}}, "title": "200002L8", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254920", "validThrough": "2020-11-17T23:59:59+0000"}