{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738"}}, "datePosted": "2020-11-04T17:15:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated registered adult nurse to join our Imperial College Healthcare NHS Trust Hyper Acute and Acute Stroke Unit based at the Charing Cross Hospital site. The Hyper acute stroke unit (HASU) located in 9North is one of 8 HASU’s in London, providing emergency stroke treatments including intravenous thrombolysis (24/7 service) and we have recently expanded to include endovascular thrombectomy seven days a week. We are also a HASU accredited Stroke Research Centre.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; Patients treated on the HASU are subsequently transferred to their local Acute Stroke Unit (ASU) located on 9South if required, typically after a 72 hour stay on the HASU. As a Band 5 nurse you will care for patients either in the hyper or acute phase following a stroke. You will have the opportunity to develop your knowledge and specialist skills in the assessment of stroke and to support patients through their stroke pathway, post interventional treatments, as well as supporting patients in their early phase of rehabilitation and discharge.&lt;br /&gt; &lt;br /&gt; We are looking to appoint enthusiastic, highly motivated nurses with a passion for delivering high standards of care. The multi-disciplinary team work closely within stroke services and also have regular contact with other hospitals within the network, therefore excellent communication skills are essential.&lt;br /&gt; &lt;br /&gt; You will be supported by a highly motivated senior nursing team which includes a Clinical Practice Educator and Stroke Clinical Nurse Specialist and you will be supported within the role with on-going training which includes the Stroke Foundation Programme and completion of specific stroke competencies and have access to a wide range of learning opportunities , to help take your career in the right direction, this will help support you to develop the competence and confidence you need as an effective, independent healthcare professional. You’ll receive a full induction programme; benefit from ward and classroom-based training and clinical skills assessments. Newly qualified nurses will also benefit from our preceptorship programme. &lt;br /&gt; &lt;br /&gt; We also offer an internal transfer pathway which will enable you to develop your own rotation across the stroke service, this enables the opportunity for band 5 nurses to transfer to another department at the same level. By managing your own transfer you will be able to shape your career development and build a programme which suits your personal career development and aspirations. You can apply to transfer if you have been in your current position for at least six months.&lt;br /&gt; &lt;br /&gt; These posts are suitable for newly qualified, part-time, job share.&lt;br /&gt; &lt;br /&gt; You will need to be able to:&lt;br /&gt; &lt;br /&gt; • Demonstrate excellent interpersonal skills&lt;br /&gt; • Aspire to deliver excellent standards of care &lt;br /&gt; • Be able to work collaboratively with all members of the MDT&lt;br /&gt; • Demonstrate a high level of compassion for patients and their relatives&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 5 Staff Nurse Stroke - MIC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256795", "validThrough": "2020-11-18T23:59:59+0000"}