{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "61561", "minValue": "46293", "unitText": "YEAR", "value": "£46,293 - £61,561.50 pro rata/per annum"}}, "datePosted": "2020-10-23T13:50:03+0100", "description": "&lt;h1&gt;&lt;strong&gt;Vacancies for Advanced Nurse Practitioners&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;PSC Contracts, Zero Hour Contracts, or Permanent Contracts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Hexham Urgent Care Centre&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Totally plc addresses the challenges of increased demand on healthcare services by delivering high-quality planned, urgent and insourced healthcare across the UK and Ireland.&lt;/p&gt;\n&lt;p&gt;Vocare, a subsidiary of Totally plc is currently recruiting for Advanced Nurse Practitioners to work within their Urgent Care Service in Hexham. We have a variety of roles available for either PSC Contracts, Zero Hour Contracts, or Permanent Contracts.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a key role within the regional team and is a fantastic opportunity to put together your clinical knowledge and excellent assessment skills to add extra value to one of the leading Healthcare providers. Our Advanced Nurse Practitioners play a major role in our Urgent Treatment Centres by utilising advanced clinical skills to ensure treatments and care provided to patients are based on best practice and evidence based care.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Duties within the role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Refer patients for investigations when appropriate&lt;/p&gt;\n&lt;p&gt;Exercise a higher degree of personal and professional autonomy using advanced clinical practice skills to include clinical interventions.&lt;/p&gt;\n&lt;p&gt;Utilise independent/supplementary prescribing skills for benefits of patient care.&lt;/p&gt;\n&lt;p&gt;Assist in clinical audit and the monitoring of services and unscheduled care.&lt;/p&gt;\n&lt;p&gt;Identify issues which may negatively impact upon service delivery and reporting these on to the clinical support manager in a timely fashion.&lt;/p&gt;\n&lt;p&gt;Support new staff in their development and participate in supervision, teaching and mentorship to help new staff develop and achieve competency.&lt;/p&gt;\n&lt;p&gt;Keep accurate and up to date records during patient consultations within the relevant software.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates must be Registered Nurses with experience of working in a primary or urgent care environment. You will hold a qualification in physical assessment, minor illness, minor injury and paediatric minor illnesses and injury. The ideal candidate should be a highly skilled team player who has excellent communication skills and the ability to provide autonomous care for all patients in a timely manner.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;How to apply:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To apply, please click on &quot;apply for this job&quot; on the right hand side of the screen and complete the application form. Make sure to use the attached job description to support you in writing your application.&lt;em&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date for ALL applications is Thursday 5th November 2020&lt;/p&gt;\n&lt;p&gt;We encourage you to apply as soon as possible, as once sufficient applications have been received we may decide to close the advert early.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note the following shortlisting approach will be applied:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Round 1 - Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/p&gt;\n&lt;p&gt;Round 2 - If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/p&gt;\n&lt;p&gt;Round 3 - If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please assume you have been unsuccessful with your application if you have not heard back from us within 2 weeks of the closing date.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All successful applicants will be subject to a DBS Check.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the salary ranges above are based on a 37.5 hour week and detail the lowest you can earn and the highest you can earn depending on the amount of unsocial hours you actually work.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Vocare Group recognise the diversity of the communities in which we operate and demonstrate this through the service we provide when dealing with patients, their family and carers.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hexham UCC", "postalCode": "NE46 1QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9696", "longitude": "-2.0955"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240793", "validThrough": "2020-11-06T23:59:59+0000"}