{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T11:34:41+0000", "description": "&lt;h2&gt;&lt;span&gt;The role&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you a mental health nurse looking to start a career at one of the UK’s most respected mental health trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping people with eating disorders who need the highest quality mental health care?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Have you ever wanted to experience what it’s like to live and work in a thriving city nestled in the heart of some of the UK’s most beautiful countryside? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are searching for committed and enthusiastic nurses to join the Eating Disorder team at our Exeter-based Haldon Ward. You will work with people with eating disorders, helping them to recover and rebuild a future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At Devon Partnership NHS Trust we are growing, establishing ourselves us as one of the leading providers of mental health services in the country. We want you to join us, and help us to achieve our aims. In return you will enjoy working in a challenging and rewarding role, where you will receive the training and development support you need to enjoy a fulfilling career. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Working as part of a specialist team at The &lt;span&gt;Haldon&lt;/span&gt;, you will make a difference to people’s lives from the moment you start.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;£24,907 - £30,615 per annum pro rata (Band 5)&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About you &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Caring for people with eating disorders can be challenging, so you will need to be confident, committed, enthusiastic and motivated. Your role as a nurse will involve delivering high-quality, personalised services to those with complex needs, helping them on the road to recovery.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will play an essential role in a multi-disciplinary team, working under the supervision of experienced senior mental health practitioners. Successful candidates will have excellent communication skills, a commitment to working flexibly as part of a team and be willing to support 24/7 services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be encouraged to challenge and inspire, using Quality Improvement methodology to help improve the services we offer. We listen and learn from our staff, and encourage you to help shape our Nursing Strategy through our nursing forum where your thoughts, views and insights will be valued.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We welcome applications from people with an up-to-date professional mental health qualification, including: Registered Mental Nurses (&lt;span&gt;RMN&lt;/span&gt;) and Registered Nurse Learning Disabilities (&lt;span&gt;RNLD&lt;/span&gt;).&lt;/span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;The location&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The &lt;span&gt;Haldon&lt;/span&gt; Eating Disorder Unit is located at &lt;span&gt;Wonford&lt;/span&gt; House site in Exeter. Surrounded by 50 acres of park-like setting, The &lt;span&gt;Haldon&lt;/span&gt; provides support for up to 20 people at any one time, with 12 in-patient care beds.&lt;/span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About us&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our Eating Disorder Unit provides support to people who are experiencing eating disorder problems that can not be successfully treated in the community. Treatment at The &lt;span&gt;Haldon&lt;/span&gt; is part of their longer-term care plan, helping people to recover and develop the strategies to enjoy life outside of hospital.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;O&lt;span&gt;&lt;span&gt;&lt;span&gt;ur &lt;/span&gt;offer to you&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. If you are looking to relocate to the fabulous county of Devon we have a relocation package that may be suitable for you.&lt;br /&gt;&lt;/span&gt;&lt;span&gt; &lt;br /&gt; &lt;/span&gt;&lt;span&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;br /&gt;&lt;/span&gt;&lt;span&gt; &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to flexible working&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Individual personal development plans and a commitment to ongoing training - including opportunities to work in different services to build your experience and skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good maternity, paternity and adoption benefits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Childcare voucher scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Health service discounts and &lt;span&gt;online&lt;/span&gt; benefits&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Incremental pay progression&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Free confidential employee assistance programme 24/7&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Access to our &lt;span&gt;LGBTI&lt;/span&gt;+ network&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Health and well-being opportunities&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to Work Scheme and reduced public transport rates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Structured learning and development opportunities, including access to South West Leadership Academy and Plymouth University.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span&gt;Living here&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role is based at The &lt;span&gt;Haldon&lt;/span&gt;, a special unit located at the &lt;span&gt;Wonford&lt;/span&gt; House site in Exeter.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Exeter is a thriving city with fine dining restaurants, excellent schools and flourishing art scene. Alongside a dynamic city lifestyle, as the third largest county in England, it’s no wonder Devon can also offer people the space to contemplate, to relax and reinvigorate yourself. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The beauty and quality of our landscapes are unsurpassed with over 1/3 of the county designated as Areas of Outstanding Natural Beauty. There are over 450 miles of coastline along 2 stunning and distinctive coasts, the rugged wildernesses of 2 National Parks, a UNESCO Biosphere Reserve, England’s first natural World Heritage Site – the Jurassic Coast, 5,000km of public rights of way and over 250km of off-road cycle paths. Our natural outdoor playground offers you the chance for a fantastic work-life balance.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;The hours&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;37.5 hours per week, working shifts across days, nights and weekends.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Great place to work. Great place to live.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wonford House, Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251837", "validThrough": "2020-11-30T23:59:59+0000"}