{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-04T15:16:41+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic individual to fill the role of Clinical Audit Facilitator within the Clinical Audit Team at Salford Royal Hospital.&lt;/p&gt;\n&lt;p&gt;In order to meet this challenging role you will need to be confident, proactive and have an excellent working knowledge of the Clinical Audit Process, including experience of facilitating both national and local clinical audit activity.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing a high quality, timely and effective clinical audit support service across two of our clinical divisions. The successful candidate will require an excellent understanding of the role of clinical audit within the NHS and the ability to develop strong working relationships with clinical teams in order to ensure positive outcomes from the clinical audit programme.&lt;/p&gt;\n&lt;p&gt;This position requires excellent analytical, verbal, written, interpersonal and organisational skills and a good working knowledge of Microsoft Office applications. Please see Job Description and Person Specification for more details.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Shepherd&lt;/p&gt;\n&lt;p&gt;Head of Clinical Audit &amp; Compliance&lt;/p&gt;\n&lt;p&gt;claire.shepherd@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 206 1132&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Clinical Audit Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256400", "validThrough": "2020-11-18T23:59:59+0000"}