{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour Enhanced payments for night shifts"}}, "datePosted": "2020-10-23T10:32:47+0100", "description": "&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking, Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Enhancements for Night Shifts (+20p per hour night allowance), and Bank Holiday&#39;s (double pay)&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development to support Autism Accreditation and progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;About the Role: The post holder will gain satisfaction by providing skilled support which positively impacts individuals health and wellbeing, whilst enabling people to fulfil their potential. We are currently recruiting for night, full time and part time team members. We also have bank opportunities for added flexibility.&lt;/p&gt;\n&lt;p&gt;Your Daily Tasks as an Autism Support Worker will involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing person centred working relationships with individuals, utilising Autism specific approaches and evidence based methods, these interventions may utilise approaches such as the SPELL framework, TEACCH and other such frameworks.&lt;/li&gt;\n&lt;li&gt;Actively supporting the communication style and programme prescribed for any individual.&lt;/li&gt;\n&lt;li&gt;Developing, with the wider team, the structure and routine required to best support the needs of the individual.&lt;/li&gt;\n&lt;li&gt;Through training, mentoring, self-reflection and experiences, developing an empathetic approach to supporting the needs of individuals.&lt;/li&gt;\n&lt;li&gt;Supporting the development of excellent Autism practise as well as the achievement and retention of Autism Accreditation.&lt;/li&gt;\n&lt;li&gt;Supporting individuals through behaviours that may challenge, understanding the function of the behaviour to the individual, supporting the development of PBS plans and following plans effectively to limit the impact of the behaviour on the individual&#39;s lives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;If you are an experienced care worker or support worker, or if you feel you can make a real difference to the lives of others, we want to hear from you! Please complete the short application and upload your CV.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llangwyfan", "postalCode": "LL16 4LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1846", "longitude": "-3.31823"}}, "title": "AUTISM SUPPORT WORKER", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240100", "validThrough": "2020-11-22T23:59:59+0000"}