{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18961", "minValue": "18961", "unitText": "YEAR", "value": "£18,961"}}, "datePosted": "2020-10-30T10:28:17+0000", "description": "&lt;p&gt;HEALTHCARE ASSISTANT -FARMFIELD HOSPITAL&lt;/p&gt;\n&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then Farmfield Hospital could be the right choice for you.&lt;/p&gt;\n&lt;p&gt;Whether you are looking for a new career or are already work in healthcare, you&#39;ll receive training to join the team as a Healthcare Assistant. You will be valued and supported, with career development opportunities available.&lt;/p&gt;\n&lt;p&gt;It&#39;s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It&#39;s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join a team that works well together to provide care to Adults with mental health conditions supporting them to lead a valued and fulfilled life. We are encouraging you to apply if you have driver&#39;s license so you are able to drive the company car.&lt;/p&gt;\n&lt;p&gt;It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve; being able to do something today that they couldn&#39;t do last week because of you.&lt;/p&gt;\n&lt;p&gt;The Elysium Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn&#39;t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities in abundance. With a huge range of courses that will see you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Farmfield is located next to Gatwick airport, meaning good transport links for those commuting out of London.&lt;/p&gt;\n&lt;p&gt;You&#39;ll be caring for:&lt;/p&gt;\n&lt;p&gt;Men 18+ who potentially have a forensic background and enduring mental health illnesses such as personality disorder, substance misuse issues and challenging behaviours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work 12 hours days, three days a week, with the occasional night shift. Though with 4 days off to rest and catch up on life, it provides a great work/life balance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of up to £18,961.75&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave - plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charlwood", "postalCode": "RH6 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1664", "longitude": "-.201944"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249720", "validThrough": "2020-12-31T23:59:59+0000"}