{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata, per annum"}}, "datePosted": "2020-11-02T09:46:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse - full/part time hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity within our Paediatric Emergency Department. We are currently looking for band 5 Paediatric nurses, preferably 12 months experience and are looking for a new challenge then this could be of interest to you. We have an exceptionally supportive team and we provide a tailor made induction unique to your individual needs. We offer new nurses to the department up to 6 weeks supernumery which will include a two week induction programme that ensures all you clinical competencies are up to date. We will also provide you with a buddy who will be an experienced band 6 who can support and guide you during this time and beyond.&lt;/p&gt;\n&lt;p&gt;For future development we offer opportunities in plastering, suturing, Manchester triage which are all pertinent to your role, also our in house CPF team provide, PILS, TILS, Greater Manchester TILS, APLS and much more and we actively encourage our nurses to become involved in the provision of these courses. You will also have the opportunity to become a link nurse to offer ideas to improve our service which we will fully support and encourage.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGemma WatkinsJob titlePaediatric Senior SisterEmail addressgemma.watkins@stockport.nhs.ukTelephone number4194812Additional contact information&lt;/p&gt;\n&lt;p&gt;Anya Dykins - Lead Nurse&lt;/p&gt;\n&lt;p&gt;0161 419 5009&lt;/p&gt;\n&lt;p&gt;Emergency Department&lt;/p&gt;\n&lt;p&gt;Gemma Watkins (Senior Sister)&lt;/p&gt;\n&lt;p&gt;0161 419 4812&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251460", "validThrough": "2020-11-12T23:59:59+0000"}