{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-29T12:16:02+0000", "description": "&lt;p&gt;We are currently looking to recruit a confident, extremely motivated and enthusiastic Respiratory Nurse Specialist to join our forward thinking Respiratory Nursing &amp; Home Oxygen Therapy Service within Primary Care and Community.&lt;/p&gt;\n&lt;p&gt;Our aim is to be an innovative, responsive, and patient focused service, delivering high quality care. The post holder will work as part of a wider nursing and administration team to support the clinical management of patients presenting within the Home Oxygen Therapy Service and the COPD Community Service.&lt;/p&gt;\n&lt;p&gt;Working closely with Medical colleagues, the Respiratory Nurse Facilitator, the Home Oxygen Administrator and colleagues within both Primary and Secondary Care, the post holder will also support the further development of both services and the progression of new initiatives.&lt;/p&gt;\n&lt;p&gt;The post holder will also contribute to the development and implementation of policies and procedures within their sphere of responsibility and where appropriate, will actively participate in training and education programmes, patient support groups, research, clinical audit and service evaluation.&lt;/p&gt;\n&lt;p&gt;You should possess good organisational, interpersonal and communication skills together with a willingness to learn. You will work in an environment in which flexibility and team working are key components. The post holder will support the community respiratory services in all of the Cwm Taf Morgannwg University Health Board areas and will therefore be required to travel between sites.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Jones - Respiratory Nurse Facilitator&lt;/p&gt;\n&lt;p&gt;Helen.Jones11@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01443 443443 x72535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "YCR, Tonypandy", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Respiratory Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248282", "validThrough": "2020-11-12T23:59:59+0000"}