{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26000", "minValue": "26000", "unitText": "YEAR", "value": "Up to £26,000 Dependent on Experience"}}, "datePosted": "2020-11-04T12:52:53+0000", "description": "&lt;h1&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Looking for something a little different?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you thought about working within prison healthcare?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are looking for a challenging and rewarding Pharmacy Technician role and want to develop your Pharmacy skills in an environment where no two days are the same then this could be the new job for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;A bit about the job..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Pharmacy Technician at HMP Channings Wood, you will assist in the delivery of a high quality pharmacy service to the prison population.&lt;br /&gt; &lt;br /&gt; You can expect to provide medicines management services to assist in tackling identified, inequalities within the prison population contributing to diagnosis of care and treatment needs. This includes providing pharmacy related information to patients, prison officers and other healthcare professionals ensuring that the level of advice given is appropriate to overcome barriers to understanding, conveying complex and sensitive information in an easily understandable form.&lt;br /&gt; &lt;br /&gt; The Pharmacy Technician will also assist with the implementation and development of pharmacy support to all wings in the prison which includes, where appropriate, counselling of patients on the correct use of medication.&lt;br /&gt; &lt;br /&gt; It goes without saying that you will be responsible for dispensing medicines to agreed standards, calculating doses and quantities for supply where there is a specific requirement for accuracy e.g. Methadone preparation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;A little about you..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council (GPhC) alongside being an Accredited Checking Technician (ACT) to be considered for this role. You will also have relevant post-qualification experience working within a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a Pharmacy Technician or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Salary &amp; Benefits...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The salary for this role is up to £26,000 per annum - dependent on experience.&lt;/p&gt;\n&lt;p&gt;This a permanent role, full-time role working 37.5 per week.&lt;/p&gt;\n&lt;p&gt;At HMP Channings Wood A 7-day service is in operation, therefore you will be required to work across those days including weekends.&lt;br /&gt; &lt;br /&gt; Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, cycle to work scheme, on-site gym facilities and free onsite parking.&lt;br /&gt; &lt;br /&gt; We are also proud to support our employees with continued professional development opportunities and further education subject to service needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and employment is subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbott", "postalCode": "TQ12 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5105", "longitude": "-3.65184"}}, "title": "Pharmacy Technician - HMP Channings Wood", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255925", "validThrough": "2020-11-18T23:59:59+0000"}