{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank rates will apply"}}, "datePosted": "2020-11-06T09:04:13+0000", "description": "&lt;p&gt;Bank GP for Penrith, Cockermouth or Workington Community Hospital&lt;/p&gt;\n&lt;p&gt;Are you a GP looking for something a bit different? Come and work in beautiful Cumbria, on the edge of the Lake District yet well connected with easy access to the M6 and main line rail services.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Bank GP’s to work in either Penrith, Workington or Cockermouth Community Hospitals providing medical support to our Community Hospital wards with a focus on frail elderly, rehabilitation and end of life care. Penrith would also include working in the Urgent Treatment Centre (including a minor injury and illness unit). The components of the job give a varied and refreshing change to day to day general practice.&lt;/p&gt;\n&lt;p&gt;Like everywhere the NHS is under pressure and our CCG is currently consulting on ‘Health Care for the Future’ in West North and East Cumbria. We are committed to providing services as close to patient’s homes as possible and the successful applicant would have the opportunity to develop their skills to support this. Job shares would be consider and there is the possibility to create joint post with a local practice, or to develop a special interest.&lt;/p&gt;\n&lt;p&gt;Are you looking to relocate, semi retire or thinking about some job variation? We are seeking any GP’s that would be available to work across our busy in-patient units and/ Or the Urgent Treatment Centre on an as required basis allowing the successful candidates to choose when they work and fit it in around other interests. The successful candidate/s will be part of a friendly team providing support to clinical staff and other team members.&lt;/p&gt;\n&lt;p&gt;You will be supported by other GP’s and GP Clinical Lead and be expected to :-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have excellent communication skills&lt;/li&gt;\n&lt;li&gt;Have appropriate skill levels to care for and assess patients.&lt;/li&gt;\n&lt;li&gt;Be able to prioritise work and able to work to clear deadlines&lt;/li&gt;\n&lt;li&gt;Be flexible to meet the needs of the service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Hours of work are between 8.00am and 18.30pm, Monday to Friday as and when required.&lt;/p&gt;\n&lt;p&gt;If you require any further information please contact Craig Melrose on 07764 535 209, or Tanya Sentance 07717 618 764&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction.&lt;/p&gt;\n&lt;p&gt;As part of the one of the largest employers in the UK CPFT future employees will have also access to the following benefits.&lt;/p&gt;\n&lt;p&gt;Flexible working Scheme *&lt;/p&gt;\n&lt;p&gt;Excellent opportunities for development&lt;/p&gt;\n&lt;p&gt;Competitive NHS Pension scheme&lt;/p&gt;\n&lt;p&gt;Childcare Vouchers&lt;/p&gt;\n&lt;p&gt;Access to NHS discounts with retailers and leisure companies&lt;/p&gt;\n&lt;p&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/p&gt;\n&lt;p&gt;* These schemes are subject to individual job roles.&lt;/p&gt;\n&lt;p&gt;Closing date: 3rd December 2020&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Penrith or Workington, Cumbria", "postalCode": "CA11 8HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.657", "longitude": "-2.74328"}}, "title": "Bank Ward GPs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258961", "validThrough": "2020-12-03T23:59:59+0000"}