{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "£39,000 per annum"}}, "datePosted": "2020-10-09T16:47:29+0100", "description": "&lt;p&gt;Barnsley has established one “super” Primary Care Network of over 250,000 patients which includes all of GP practices across Barnsley. This is supported by six Neighbourhood Networks building on our successful and existing model of neighbourhood working; this enables us to maintain and focus on the specific needs of each local area whilst allowing integration at a borough wide level.&lt;/p&gt;\n&lt;p&gt;Barnsley Primary Care Network is looking to recruit Clinical Pharmacists to develop medicines optimisation services across the network working alongside experienced primary care clinical pharmacists and to become a part of the primary care skill mix.&lt;/p&gt;\n&lt;p&gt;This post offers candidates the opportunity to develop their skills in primary care so they can potentially become involved in patient facing activities such as chronic disease management, medication reviews, supporting the management of medicines at transfer of care an and improving systems for safer prescribing. You will be working alongside experienced primary care clinical pharmacists and will become part of the future primary care skill mix.&lt;/p&gt;\n&lt;p&gt;Candidates will have excellent written and verbal communication skills, experience of influencing others and conducting clinical medication reviews.&lt;/p&gt;\n&lt;p&gt;A full induction programme will be offered as well as ongoing training and supervision both within the PCN and working alongside Clinical Pharmacists in the Medicines Management Team at Barnsley CCG. We will support candidates to develop their role, including for example becoming an independent prescriber or gaining a postgraduate qualification in clinical pharmacy.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for pharmacists to truly become part of primary care in Barnsley and demonstrate the benefits they can have on care and patient outcomes.&lt;/p&gt;\n&lt;p&gt;-        Competitive salary (£39,000 per annum FTE)&lt;/p&gt;\n&lt;p&gt;-        NHS pension&lt;/p&gt;\n&lt;p&gt;-        Generous holiday allowance (6 weeks plus bank holidays)&lt;/p&gt;\n&lt;p&gt;-        Monthly internal training event&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note this is a full time role  &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5434", "longitude": "-1.45718"}}, "title": "Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221180", "validThrough": "2020-11-30T23:59:59+0000"}