{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-11-05T16:31:10+0000", "description": "&lt;p&gt;Are you a naturally caring person who loves to make a difference to others no matter how small that difference might be? &lt;br /&gt;&lt;br /&gt;Do you like getting things done? And are you known for being hard-working and reliable?&lt;/p&gt;\n&lt;p&gt;We want our patients to receive the best possible care from people for whom nothing is too much trouble. If you recognize yourself in the description above and it excites you to think you could be one of our team caring for our patients on a daily basis, we would love to hear from you.&lt;br /&gt;&lt;br /&gt;Are you a compassionate, enthusiastic and confident individual, who is able to provide (following training) the highest standard of patient care, under supervision. You will need to be able to priorities, work under pressure and have excellent communication skills, both written and verbal. Are you reliable, hardworking and trustworthy.&lt;/p&gt;\n&lt;p&gt;If the above describes you, we welcome you to apply for a full time position 37.5 hours per week on Plum Tree Ward. Plum Tree Ward is a 29 bedded ward which specializes in Gastroenterology and Endocrinology. The wide range of conditions in Gastroenterology we treat includes Crohn&#39;s disease, pancreatic cancer, irritable bowel syndrome (IBS), Alcohol detox, gallstones and stomach tumor. In Endocrinology the conditions include DKA, HHS, Addison’s crisis and adrenal insufficiency. Being part of two specialties will enable you to develop your skills and knowledge in both of these exciting areas.&lt;/p&gt;\n&lt;p&gt;We will offer you a structured Induction program during which you will learn more about the Trust and your role. You will be required to complete the National Care Certificate in the first 3 months of employment.&lt;/p&gt;\n&lt;p&gt;You will undertake a literacy and numeracy test on the day of the interview&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Crystal Tite, Ward Sister on  01480 418192 or email  crystal.tite@nhs.net &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hinchingbrooke, Huntingdon", "postalCode": "PE29 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3334", "longitude": "-.202658"}}, "title": "Healthcare Assistant - Plum Tree Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258574", "validThrough": "2020-11-19T23:59:59+0000"}