{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T11:36:04+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Group is one of the UK’s leading providers of independent specialist recovery and rehabilitation care across the UK. With hospitals around the country, many years of experience and highly experienced teams, we help patients and commissioners find the right care pathways, without the need for multiple reassessments.&lt;/p&gt;\n&lt;p&gt;Kneesworth House Hospital has built a strong reputation over 30 years for providing high quality care in recovery and rehabilitation conditions, offering a range of therapeutic and leisure opportunities, and making full use of its extensive grounds. The hospital has 150 beds across multiple wards with male medium secure, male low secure and male and female recovery and rehabilitation wards..&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen for a full-time consultant general adult psychiatrist, based at Kneesworth Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has a well-established system of clinical governance and a quality improvement programme. The successful candidate will be expected to lead the clinical governance programme on their ward and to participate in clinical governance at a hospital level. There are opportunities for audit and research at Kneesworth and within Priory Group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Information technology is widely used within Priory Group to improve the quality of care and the productivity of professionals. An upgrade of the electronic patient record system has recently been rolled out across the Group and further improvements are planned. Videoconferencing is successfully used at Kneesworth and across the Group to maintain social distancing during the current pandemic. Training on the use of IT systems will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are 6.6 experienced full-time consultants at the hospital, supported by 2 Speciality Doctors and supported by full-time resident medical officers who provides out-of-hours cover. Each ward has a full multidisciplinary team (MDT), with a psychologist, occupational therapist with hospital wide social work cover. The successful candidate will lead an MDT and take on the care of up to 17 inpatients on one ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is a consultant second on-call medical rota is 1 in 6.6, non-resident. While the resident medical officer is able to deal with most situations requiring medical input, occasional attendance at the hospital may be required when on-call.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to participate in continuous professional development (CPD), either by joining a peer group at the hospital or elsewhere. Study leave is available, with expenses paid subject to approval by the medical directorate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interested candidates are strongly encouraged to contact Dr Marguerite Horgan, Medical Director, for an informal discussion. A visit to the hospital may also be possible, subject to Government COVID-19 guidelines. We may also be able to use videoconferencing software for a virtual tour.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will meet the following criteria: -&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;p&gt;Fully registered and licensed medical practitioner&lt;/p&gt;\n&lt;p&gt;Member of the Royal College of Psychiatrists&lt;/p&gt;\n&lt;p&gt;Approved Clinician&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Desirable&lt;/p&gt;\n&lt;p&gt;Experience in Recovery and Rehabilitation care&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire", "postalCode": "SG8 5JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0781", "longitude": "-.03059"}}, "title": "General Adult Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246374", "validThrough": "2020-11-11T23:59:59+0000"}