{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-02T09:46:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse – Gastroenterology Unit/Ward &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Calderdale and Huddersfield NHS Foundation Trust, Huddersfield Royal Infirmary, Huddersfield.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the high acuity/dependency and diverse client group we require individuals who enjoy working at a fast pace and can deal with challenging and acute situations. You will be dynamic and highly motivated individual with ability to work in a busy and demanding environment.&lt;/p&gt;\n&lt;p&gt;Ward 17 is a 24 bedded unit specialising in the care of patients with all gastro related conditions ie. IBD, Alcoholic Liver Disease, all liver related illness/cancers, digestive/dietary conditions.&lt;/p&gt;\n&lt;p&gt;Previous experience within gastroenterology would be of benefit; however full in service training is available and ongoing. We encourage and support our staff to further their careers by offering development sister roles.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join a forward thinking and energetic team, promoting a positive culture to deliver quality care to our patients. We can offer you the development and support to ensure you excel in your chosen field. There will be opportunity to develop professionally and be involved and contribute to new initiatives and service improvements and you will have the support from a well-established nurse team.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills, be motivated and have the flexibility and adaptability to meet the needs of a fast paced, emergency service.&lt;/p&gt;\n&lt;p&gt;Are you looking for a challenge? Do you have the passion and commitment to make a difference?&lt;/p&gt;\n&lt;p&gt;If you have answered yes then we would like hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Donna Cole, Ward Manager - Gastroenterology on 01484 355827&lt;/p&gt;\n&lt;p&gt;For medical vacancies please contact Amanda McGrath Amanda.McGrath@cht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield/Halifax", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Staff Nurse - Medical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251477", "validThrough": "2020-11-29T23:59:59+0000"}