{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 per annum"}}, "datePosted": "2020-10-30T09:45:44+0000", "description": "&lt;p&gt;A unique opportunity has arisen to join the National School of Healthcare Science as Training Support Case Manager. The role provides an opportunity to work with experts across healthcare science education and training to ensure optimal professional support, advice and guidance is available to trainees and their training departments.&lt;/p&gt;\n&lt;p&gt;Within Health Education England, the National School of Healthcare Science works with education providers and NHS organisations across the UK to oversee the implementation of training developed for scientists working in healthcare at all levels. The School is committed to ensuring that trainees receive high quality training and that their professional, health and well being needs are met to optimise successful outcomes for the training. The School is expanding the engagement and support services it offers to trainees and their trainers and this role is fundamental to meeting that aim.&lt;/p&gt;\n&lt;p&gt;You will work with the Head of Programme Support, the Training Programme Directors for postgraduate and postdoctoral training and accreditation colleagues as well as a team of dedicated administrative staff to provide a dynamic, responsive and comprehensive support service to trainees and training departments.&lt;/p&gt;\n&lt;p&gt;This will be a busy role, working with many trainees and departments simultaneously on matters that may be complex and sensitive so the ability to work with compassion, empathy and integrity are key. You will manage the day to day operations and have the opportunity to influence and shape the strategic development of the services. You will be highly organised, able to multitask, problem solve and prioritise your own workload with minimal supervision. You will be conscientious and see tasks through to conclusion including leading, delegating and overseeing the workload of others. You will be an excellent communicator with strong interpersonal skills.&lt;/p&gt;\n&lt;p&gt;You will be educated to post graduate degree level or have an equivalent level of knowledge in a similar area, with previous case, complaints or appeals management experience an advantage. Skills to influence, negotiate and manage challenging conversations with tact and diplomacy are vital. The right candidate will demonstrate drive and enthusiasm for the service they will deliver. Above all you should be committed to improving the training and education experience of learners.&lt;/p&gt;\n&lt;p&gt;The School is usually based in Birmingham but is currently working remotely due to the COVID 19 restrictions. Should these lift in the future there may be a requirement to travel nationally and stay overnight. A flexible approach is needed.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 6 with a full-time starting salary of £31,365, with pay step increases as after 2 years’ service and 5 years&#39; service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out!&lt;/em&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Louise Ayers, Head of Programme Support&lt;/p&gt;\n&lt;p&gt;Email: louise.ayers@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01216952507&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Chad&#39;s Court, Birmingham", "postalCode": "B16 9RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4723", "longitude": "-1.93413"}}, "title": "Training Support Case Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249530", "validThrough": "2020-11-15T23:59:59+0000"}