{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-26T18:07:01+0000", "description": "&lt;p&gt;&lt;span&gt;At Mid Yorkshire Theatres we take pride in providing the highest standard of 24 hour care to both our acute and elective theatres. We pride ourselves on being the regional Burns Centre. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to retirement of the existing post holder we are able to offer a full time Band 6 Team Leader role on our Pinderfields site to support our Burns and Plastic theatre. The successful candidate will be an RN or RODP and will have significant post registration experience, ideally within a burns or plastics theatre setting. You will have an excellent up to date knowledge of relevant surgical procedures. You will be comfortable joining and leading an established team and working alongside our specialty based clinical specialists and surgeons. The candidate will be able to manage and implement change where necessary, as well as being involved in education and progression of themselves and their team. You should be approachable and friendly and experienced enough to manage and defuse conflict and lead a cohesive and efficient team. This is an exciting opportunity in our department which has a dedicated and enthusiastic workforce. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Team Leader, you will maintain our focus on innovation and excellence. You will lead your team in a manner that enables each individual to continue to thrive and contribute to continuously improving our patient experience. It is essential that your leadership style embodies our core values and enables effective team working within your own team and in partnership with other teams across our services. You will need to hold a mentorship qualification and be able to demonstrate your own continuous professional development in respect of your leadership style.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We strive to support every member of our team, recognising individual needs and circumstance. We have an extensive range of initiatives and benefits to support you in work and in your personal life including local and national discounts and offers and our discounted, on-site childcare provision for 0-14 years, which has been rated as excellent by Ofsted. Your wellbeing is important to us and our dedicated health and wellbeing team provide a comprehensive range of pastoral and recreational activities to enhance your mental and physical health and wellbeing.&lt;/p&gt;\n&lt;p&gt;To enable you to settle successfully into our team at Mid Yorks we offer a robust preceptorship programme during your first 6 months.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this post and would like to have an informal discussion to address any questions you have before submitting your application we would love to hear from you. You can contact Sister Maggie Cunningham on 01924 541873 or ext 51873 or our Practice Educator Jackie Elder on 01924 542291 ext 52291&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 24.11.2020 so please save this date in your diary. The Interviews may be conducted via Microsoft teams or in person. Please ensure that you are familiar with and have access to this software before you are shortlisted. If you need any support to do this, our Recruitment Team will be more than happy to help you. The recruitment team details are included in the NHS jobs information.&lt;/p&gt;\n&lt;p&gt;Thank you for your interest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Theatre Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243598", "validThrough": "2020-11-23T23:59:59+0000"}