{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-02T15:45:59+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital (KCH) NHS Foundation Trust situated in South East London that provides comprehensive health care and emergency services for a diverse community. KCH is part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), a pioneering collaboration between King&#39;s College London, and Guy&#39;s and St Thomas&#39;, King&#39;s College Hospital and South London and Maudsley NHS Foundation Trusts. We are a tertiary centre for multiple specialties, trauma, cardiac, liver.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s Inpatient Theatres Department consists of 18 operating theatres which include specialties: orthopaedics, gynaecology, neurosurgery, general, laparoscopic surgery, ophthalmic, dental, urology, paediatrics and endoscopy, neurosurgery, hepatobiliary, liver, cardiac and trauma theatres. We also provide general anaesthetic service to radiology, endoscopy, MRI and cath lab.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have exciting opportunities for highly motivated persons to work with our theatre team. We are seeking a qualified professionals with excellent and efficient anaesthetic skills. You must be able to work independently but in liaison with your theatre team, anaesthetist and floor coordinators. You will have the ability to facilitate the delivery of high standards of patient care in the operating theatres. You must be an excellent communicator and have flexible, pro-active approach as well the ability to manage a demanding workload.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your role will also require safe patient care within outlying areas of the hospital. You will participate and role model in the cleaning and re stocking and preparation of the operating theatres and equipment care. You are required to be a team person, be empathetic and be able to remain calm and steady under pressure. This role also requires a reassuring manner and the understanding of the rights, privacy &amp; dignity and safeguarding of all patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will provide initial support to you with a comprehensive supernumerary induction to get you settled and established to the King’s way. Newly qualified practitioners will also be supported through the Trust’s preceptorship programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have an ODP qualification or be an RN1 with a proven record within these specialties. A mentorship course is desirable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We support flexible working to provide a service to the Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post mostly includes Monday to Sunday shifts, late shifts and rotational night shifts.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBanu NatarajanJob titleAnaesthetic Coordinator - Band 7Email addressbanu.natarajan@nhs.netTelephone number0203 299 5458Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Jason Nwese (Band 7 Anaesthetic Coordinator) tel. 02032995458&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;jnwese@nhs.net&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Anaesthetic Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252691", "validThrough": "2020-11-16T23:59:59+0000"}