{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a."}}, "datePosted": "2020-10-23T10:05:18+0100", "description": "&lt;p&gt;Solent NHS Trust are delighted to share that they have been successful in their bid to implement a further 2 Mental Health Support Teams in schools (MHST’s) within Southampton. This is in addition to the 2 MHSTs already in their mobilisation year within the city.&lt;/p&gt;\n&lt;p&gt;We are pleased to be recruiting to a Team Co-ordinator post within this exciting new and developing service. The development of these services are in collaboration with NHS England and the Department for Education, following on from the 2017 Green Paper Transforming children and young people’s mental health provision. This is a roll out of the work to improve access to mental health care for young people set out in the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;Following this chapter of recruitment Southampton will have almost city-wide MHST coverage for its schools and colleges, where the teams will work within education settings to provide early intervention for mild to moderate mental health issues and provide help to staff in schools and colleges. Teams will also act as a link with local children and young people’s mental health services.&lt;/p&gt;\n&lt;p&gt;As of the new year the intended clinical team structure will be that of 8 EMHP Trainees, 8 qualified EMHPs, 5 EMHP Supervisors, 2 CBT Therapists and 3 Specialist Practitioners. The team also comprises of the Team Manager, 2 Clinical leads and Team Co-ordinator (this post), offering strong leadership and governance structures within the team.&lt;/p&gt;\n&lt;p&gt;The post holder would offer specialist knowledge and practice skills in delivering evidence-based intervention for children and young people in education setting with mild to moderate mental health problems and offer consultations and training to local schools and colleges. This post is structured to have clearly defined clinical time and operational leadership time.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who have a relevant qualification to this role and specialist knowledge and skills within children’s mental health alongside leadership experience. The post holder will work alongside the Team Manager and Clinical Leads as part of a dynamic mental health team in a creative environment where evidence-based interventions, new ideas, ways of working and supporting children and young people are actively encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Team Co-ordinator: Mental Health Support Team (MHST)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239967", "validThrough": "2020-11-06T23:59:59+0000"}