{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28728", "minValue": "28728", "unitText": "YEAR", "value": "£17.09"}}, "datePosted": "2020-10-29T10:31:37+0000", "description": "&lt;p&gt;DHU Health Care is an ever-growing, innovative organisation, providing high level clinical care for a variety of communities within an expanding geographical area. DHU Health Care – Urgent Care delivers and develops first class services specialising in Integrated Primary and Community Urgent Care services.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to be a part of a highly regarded organisation who value every member of the team and invest heavily in staff development and progression. With the potential to move within the company throughout the various clinical environments as well as receive funded further education such as the non-medical prescribing course, DHU can help you build a portfolio career and arm you for the demands of modern healthcare.&lt;/p&gt;\n&lt;p&gt;Benefits of DHU:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Learning &amp; development opportunities plus educational funding and support (MSc level e.g Non-medical Prescribing, Advanced Clinical Practitioner)&lt;/li&gt;\n&lt;li&gt;Opportunity to work within various clinical settings from Urgent Care Centres, General practice to home visiting services&lt;/li&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;NHS continuous service honoured for annual leave &amp; sickness&lt;/li&gt;\n&lt;li&gt;Generous Holiday entitlement&lt;/li&gt;\n&lt;li&gt;Indemnity cover included&lt;/li&gt;\n&lt;li&gt;Access to Westfield Health&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Due to a contract win, we are looking for a part-time Practice Nurse to work across our three surgeries in Leicester.&lt;/p&gt;\n&lt;p&gt;If you are experienced, motivated and enthusiastic Practice Nurse we would love to talk to you about joining our friendly and professional team.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who will share our commitment to providing excellent health care to our patients. You will already be a Practice Nurse who has a range of clinical skills, as well as the experience and ability to competently deal with patients who present to the surgery, and refer as needed. You will also have extensive experience working in General Practice and chronic disease management.&lt;/p&gt;\n&lt;p&gt;For more information, please contact careers@dhuhealthcare.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130356.PNG", "name": "DHU Health Care CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130356"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heron GP practices and Bowling Green Street Surgery, Leicester", "postalCode": "LE5 3GH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6412", "longitude": "-1.10879"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247915", "validThrough": "2020-11-30T23:59:59+0000"}