{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a pro rata"}}, "datePosted": "2020-11-05T14:30:37+0000", "description": "&lt;p&gt;HMP Woodhill&lt;/p&gt;\n&lt;p&gt;Prison/Offender Health Pharmacy – We believe in ‘Caring not Judging’&lt;/p&gt;\n&lt;p&gt;Are you an exceptional Pharmacist looking for a rewarding new challenge? Would you like the opportunity to use your skills in an environment like no other to make a real difference every day? Interested, then working in HMP Woodhill is just the place for you.&lt;/p&gt;\n&lt;p&gt;In our quest to deliver patient-focused quality care we are developing our pharmacy services and are looking for highly motivated, innovative and enthusiastic Advanced Specialist Pharmacist to join and lead our forward thinking, friendly and expanding team of assistants, technicians and pharmacists. HMP Woodhill currently operates an electronic prescribing system within the healthcare department.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Head of Healthcare and the CNWL Lead Pharmacist for Offender Care to drive forward medicine optimisation agenda for patients in secure settings.&lt;/p&gt;\n&lt;p&gt;What do we offer?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RECRUITMENT &amp; RETENTION ALLOWANCE - You will receive a monthly payment of approximately £136 on top of your AfC salary&lt;/li&gt;\n&lt;li&gt;REMOVAL EXPENSES SUPPORT - If you will have to move your place of residence more than 30 miles to take up a post at HMP Woodhill we will be able help with your expenses, this potentially includes things like removal costs and down payments for tenancy agreements&lt;/li&gt;\n&lt;li&gt;ENHANCED BANK PAYMENTS - The hourly rate of bank pay in HMP Woodhill is closer to what you agency rates and it is probably one of the highest rates in the NHS&lt;/li&gt;\n&lt;li&gt;FLEXIBLE WORKING&lt;/li&gt;\n&lt;li&gt;EXCELLENT TRAINING OPPORTUNITIES AND CAREER DEVELOPMENT&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About the Job&lt;/p&gt;\n&lt;p&gt;HMP Woodhill is a Category A prison accommodating approximately 720 adult male prisoners who are either sentenced or on remand. CNWL provide primary care, addictions and mental health services and are an integral part of the wider prison team contributing to the rehabilitative culture within the establishment.&lt;/p&gt;\n&lt;p&gt;Work within the Pharmacy is varied and includes dispensing medicines and budget management, medicine governance, health promotion, medicine review clinics, effective care planning and liaising with the multidisciplinary team. It’s this variety that keeps things interesting and stimulating. Every day will bring new challenges and new experiences but you’ll have all the support you need to deliver the best care possible from both the healthcare team and the prison team.&lt;/p&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;You will be a Registered Pharmacist with a real passion for delivering high quality medicine management service. You will be self-motivated, flexible and work well within a team but be able to work autonomously.&lt;/p&gt;\n&lt;p&gt;You do not need to have prison experience as we will provide you with a full induction and training, but you will need to have pharmacy management experience.&lt;/p&gt;\n&lt;p&gt;Not sure? We are always happy to discuss further.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Enya Chahal – Head of Healthcare HMP Woodhill – Enya.chahal1@nhs.net – 01908 722111&lt;/p&gt;\n&lt;p&gt;Marta Pitarch – Lead Pharmacist Offender Care – marta.pitarch@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEnya ChahalJob titleHead of HealthcareEmail addressenya.chahal1@nhs.netTelephone number01908 722111Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marta Pitarch – Lead Pharmacist Offender Care – marta.pitarch@nhs.net&lt;/p&gt;\n&lt;p&gt;Enya Chahal – Head of Healthcare HMP Woodhill - Enya.chahal1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "MK4 4DA, Milton Keynes", "postalCode": "MK4 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0147", "longitude": "-.807332"}}, "title": "Advanced Specialist Pharmacist - HMP Woodhill", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258120", "validThrough": "2020-11-15T23:59:59+0000"}