{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "Subject to AFC £38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T13:00:29+0000", "description": "&lt;p&gt;Communications Content Manager Band 7 Subject to AFC Innovation Agency Communications Content Manager The Innovation Agency is looking for a first-class writer and communications professional to tell the story of healthcare innovations in the North West Coast and nationally. It is an opportunity to join a small, creative team at the centre of an agile organisation working with partners in businesses, the NHS, other public sector, charities and social enterprises. We want to hear from individuals who share our passion for helping others to find new, better ways of working which benefit patients, health and care services and the population. We pride ourselves on a caring, collaborative culture and the Content Manager will work with all our teams and external partners to produce high-quality content for media, our website, video and podcast channels and publications. The role also offers opportunities to work with colleagues across the national AHSN Network, providing content for national publications, media and websites. All staff are working from home for the foreseeable future. The office base will be either Liverpool Science Park or Sci-Tech Daresbury. For an informal chat, please contact Communications Manager Greg Stringer at: greg.stringer@innovationagencynwc.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120728.jpg", "name": "Liverpool Heart and Chest Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120728"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L14 3PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.41", "longitude": "-2.90067"}}, "title": "Communications Content Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244629", "validThrough": "2020-11-10T23:59:59+0000"}