{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43500", "minValue": "43500", "unitText": "YEAR", "value": "Up to £43,500 per annum (DOE)"}}, "datePosted": "2020-11-03T11:54:50+0000", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Physiotherapy Manager in our Shrewsbury Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role of the Physiotherapy Manager is to ensure a genuinely exceptional client experience throughout the hospital based wellbeing services and to manage the services within the framework of robust clinical governance, professional standards and the Healthcare Standards Act 2000.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Context&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Within our hospital based integrated wellbeing centres the Physiotherapy Manager will ensure that the daily operations of the services are managed seamlessly and that the focus of clinical teams is on the delivery of unhurried, high quality clinical care, with a genuine desire to provide ongoing support and case management to helpfully resolve health issues and actively promote the principles of health and wellbeing. The role holder will develop effective relationships with the Nuffield Health hospitals management team and medical colleagues.&lt;br /&gt;&lt;br /&gt;We believe in our people and to help you develop your skills and progress your career in Nuffield Health you will be supported by your regional clinical lead, have protected CPD time, access to a local in-service training program and training events organised by the Nuffield Health Academy including both clinical and leadership courses.&lt;br /&gt;&lt;br /&gt;As Nuffield Health continues to grow you can choose to develop your career across our organisation. We support and encourage post-graduate education and have formed a partnership with Manchester Metropolitan University which will offer fantastic learning and research opportunities in the future.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Education &amp; Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Degree in physiotherapy or equivalent.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Minimum 5 years post graduate experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Operational management experience within a healthcare setting.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Financial management experience within a healthcare setting&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in in-patient, orthopaedic and /or musculo-skeletal physiotherapy within a multidisciplinary team is required.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Knowledge, Understanding and Commitment to developing excellent working relationships by working proactively and collaboratively with other health care professionals – Consultants, GP’s, physiologists, physiotherapists, therapists and wellbeing service teams&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - Up to £43,500 per annum (dependant on experience)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Closing date - 01/12/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location - Shrewsbury Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekly Hours - 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 9DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6923", "longitude": "-2.77145"}}, "title": "Physiotherapy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253835", "validThrough": "2020-12-01T23:59:59+0000"}