{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-04T15:16:18+0000", "description": "&lt;p&gt;Are you committed to high class patient care with the personal integrity to work within a high performing team? Recently rated ‘Good’ by the CQC the Royal Berkshire Hospital wants to welcome you to our friendly and dynamic team.&lt;/p&gt;\n&lt;p&gt;Successful applicants for this Plain Film/General Band 6 Senior Radiographer post will have a minimum of 18 months’ post qualification experience and will be required to rotate through all areas of the department with the exception of Ultrasound, MRI and Angiography. The department is working towards a plain film/CT rotation. A practical and professional attitude to work is essential, with good communication skills and the ability to work both independently and as part of a team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: Applicants for this post must have prior NHS or equivalent experience. We regret that we are unable to offer Skype or telephone interviews.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a progressive teaching department for radiographers we have established links to universities and actively encourage CPD and role extension, with support available to pursue academic courses and develop your career within a supportive and friendly environment. Our department offers excellent training and development opportunities with funding available for a variety of courses. We currently have staff training in Ultrasound, plain film reporting and PG Cert/Diploma in CT and Health Management as well as attendance on a variety of study days.&lt;/p&gt;\n&lt;p&gt;The department boasts 9 general rooms with 2 in a busy and exciting A/E unit and 2 in a dedicated orthopedic department; all rooms have full DR capability. We are currently in the process of installing an additional compact hybrid system within the newly opened Royal Berkshire ED – Minor Injury Unit expansion.&lt;/p&gt;\n&lt;p&gt;In addition to our facilities at the Reading site we also have a satellite DR room at Townlands Hospital Henley alongside the Royal Berkshire Bracknell Health Space and West Berkshire Community Hospital all of which support busy Minor Injury units and orthopedic clinics.&lt;/p&gt;\n&lt;p&gt;Our Radiology department is very busy, carrying out a wide range of general and specialist examinations, including, Plain film, CT, MRI &amp; interventional. We have a Quality Assurance program in place and will shortly be moving towards full ISAS accreditation.&lt;/p&gt;\n&lt;p&gt;Applicants must be adaptable and be prepared to work evenings, nights and weekends as part of a seven-day service delivery and also to work at satellite units. Excellent interpersonal and communication skills are essential, as is the ability to work both autonomously and in a team environment.&lt;/p&gt;\n&lt;p&gt;Situated in Reading a vibrant town in the Berkshire country side 30m minutes from Henley, Ascot and Windsor successful applicants can enjoy all the county has to offer. In addition to this Reading Train Station can get you to London Paddington within 30 minutes on the regular express trains operated daily.&lt;/p&gt;\n&lt;p&gt;So, if you are looking for a friendly working environment, in which you will be challenged, educated and encouraged to be part of the team providing modern imaging services then contact us to find out more.&lt;/p&gt;\n&lt;p&gt;Must be working and living in the UK&lt;/p&gt;\n&lt;p&gt;The department is pleased to offer Radiographers taking a position with us the following recruitment incentives*:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relocation payment of first two month’s rent (up to a maximum of £1000, for applicants outside Berkshire only)&lt;/li&gt;\n&lt;li&gt;Two years HCPC registration paid (for new registrants only)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Contact Matthew Graham on 01183 227922&lt;/p&gt;\n&lt;p&gt;email: Matthew.Graham@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Diagnostic - Radiology - Main X-Ray, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Senior Radiographer – Plain Film", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256385", "validThrough": "2020-11-18T23:59:59+0000"}