{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-21T08:16:05+0100", "description": "&lt;p&gt;&lt;strong&gt;NEWLY REGISTERED NURSE - (Adult, Child, Mental Health, Learning Disability fields of practice)&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;In the University Hospitals of Leicester NHS Trust we provide high quality care delivered by a team who are motivated and passionate in what they do. We are looking for newly registered nurses with the same passion, drive and commitment to providing caring at its best to join our organisation and we welcome applications from finalist pre-registration Nursing students who are due to complete their course between April/May 2021&lt;/p&gt;\n&lt;p&gt;University Hospitals of Leicester NHS Trust takes pride in valuing its staff and ensuring they are supported and developed to their full potential which we consider is the key to our success. We are committed to supporting you to be the best you can be right from the start of your professional career. We have an excellent reputation for providing robust Preceptorship for newly registered nurses comprising of a suite of study days, supernumerary time, a preceptorship development portfolio and support from a Preceptor, your Clinical Team and the Education and Practice Learning Team who are all there to guide you in your transition from student to registered nurse. We are particularly innovative in our approach to supporting Mental Health or Learning Disability Newly Registered Nurses who want to work in a physical health environment utilising their skills as a fully integrating member of the clinical team and also provide a suite of rotation opportunities both within the University Hospitals of Leicester NHS Trust and with our Community Provider – Leicester Partnership Trust.&lt;/p&gt;\n&lt;p&gt;We are an Acute Hospital Trust and have a wide variety of clinical specialist areas within the Trust, whichever one you join you’ll become part of a talented, motivated team, committed to providing the best care and treatment to patients. In caring for our patients you will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Perform comprehensive assessment of patient nursing needs&lt;/li&gt;\n&lt;li&gt;Plan, implement and evaluate care delivery according to changing health care needs&lt;/li&gt;\n&lt;li&gt;Take responsibility for the care needs of individual and groups of patients&lt;/li&gt;\n&lt;li&gt;Recognise, prioritise and respond appropriately to urgent and emergency situations&lt;/li&gt;\n&lt;li&gt;Collect, collate and fully accurately report patient information and maintaining accurate complete nursing records.&lt;/li&gt;\n&lt;li&gt;Involve patients and carers/relatives in the planning and delivery of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please note, this advert is for pre-registration students only&lt;/strong&gt; a&lt;strong&gt;nd applications from staff that already have a valid NMC pin registration will not be accepted through this route&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you already hold a valid NMC pin, you will need to apply for other nursing vacancies in the University Hospitals of Leicester NHS Trust that are advertised via NHS jobs. &lt;br /&gt;&lt;br /&gt;Please ensure that email addresses are given on your application form as this will speed up the pre-employment checks stage for Recruitment Services should you be issued with a conditional offer following interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Preceptorship@uhl-tr.nhs.uk for more information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE5 4QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6306", "longitude": "-1.08552"}}, "title": "Newly Qualified Nurses (Adult, Child, MH and LD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235533", "validThrough": "2020-11-16T23:59:59+0000"}