{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-28T15:01:50+0000", "description": "&lt;p&gt;Working at MFT will mean working in one of the most progressive and innovative IT departments in the NHS. MFT is delivering real time information and cutting edge technology to its patients and staff as we strive forwards with improving patient health outcomes and becoming a paper lite organisation. MFT is implementing an enterprise Electronic Patient Record and looking to use data warehousing and business intelligence to support the decision making of clinical and operational staff.&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity to support our strategy to implement automated, self-service style reporting to the organisation. We are looking for candidates who are proactive, methodical and self- motivated with the tenacity to resolve problems and to make decisions. Excellent organisational and planning skills are essential.&lt;/p&gt;\n&lt;p&gt;To achieve in this exciting role you will need; a real eye for detail, an analytical mindset, excellent communication skills, a willingness and ability to liaise with our stakeholders to interpret requirements and transform them into technical specifications along with an enthusiasm to get the job done to the highest standards. You will have advanced technical knowledge in a range of areas of IM&amp;T, and evidence of using various information analysis techniques such as SQL, Access, Pivot Tables, Forecasting and any associated tools within a large organisation.&lt;/p&gt;\n&lt;p&gt;Experience of working with NHS data is highly desirable but exceptional candidates without previous NHS experience will be considered. The post-holder will be expected to contribute to the development of a performance-focused culture where safety, effectiveness and patient experience are consistently delivered through the provision of high-quality information, analytical interpretation, benchmarking and intelligent modelling.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDavid WellsJob titlePrincipal AnalystEmail addressdavid.wells@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;David Wells, Principal Analyst - Email: david.wells@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Senior Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247109", "validThrough": "2020-11-08T23:59:59+0000"}