{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-10-27T14:30:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Fellow in Simulation &amp; Anaesthesia&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;East Surrey &amp; Crawley Hospitals&lt;/li&gt;\n&lt;li&gt;Full time – 40 hours per week&lt;/li&gt;\n&lt;li&gt;Fixed term – 12 months&lt;/li&gt;\n&lt;li&gt;£32,478 - £51,069 per annum plus 1A Banding Supplement (50%)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Clinical Fellow post to start in February 2021 for 12 months. It is intended for Anaesthetists with a strong interest in medical simulation with final FRCA or equivalent. Candidates with primary FRCA will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Fellow would be expected to have 4 days a week dedicated to, staff training, medical education and simulation projects. They will have one day a week clinical service commitment to the Anaesthetics department and an additional 1 in 8 on-call commitment with internal cover either to theatres, ICU or obstetrics (a EWTD compliant shift system).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Medical Simulation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Newman Simulation Suite at East Surrey Hospital is fast developing and has strong support from Health Education KSS. We are based in the Post Graduate Education Centre and have a dedicated simulation laboratory providing immersive simulation using Hi-Fidelity manikins (Adult, paediatric and Obstetric) with full audio visual back up. We also have an airway skills lab in theatres. Our current faculty is still expanding and we currently provide training to Foundation Year 1 and 2 Doctors on behalf of HEKSS as part of their annual requirement to undertake simulation-based learning. We also run HEKSS courses for Obstetric, Higher Anaesthetics, ED, Paediatrics and Medicine trainees within the region. This means that we run at least 2 courses at least every week. In terms of in-house training, the Fellow for Simulation will assist in the development and running of courses for Emergency Medicine, Paediatrics, ICU and retrieval (including a transfer course), Anaesthesia, Midwifery and Obstetrics, ODPs and theatre teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working collaboratively with the Faculty, the Trust Simulation Lead, the Clinical Lead for Anaesthesia Simulation (Dr. Matt Mackenzie) and the Director of Postgraduate Medical Education the post holder will assist in developing a clear strategy for the growth of Skills and Simulation training within the Trust with particular emphasis on design, development and implementation of courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Clinical fellow will participate to a significant extent in the delivery of our Foundation Doctor programme teaching in the simulator. There will be an expectation that the post-holder will be able to attend relevant meetings on various aspects of medical education and patient safety initiatives and will be encouraged to submit research in the field of medical simulation to national meetings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Afolake Bewaji / Dr Christie Locke – College Tutors (afolake.bewaji@nhs.net) or (christie.locke@nhs.net) - telephone 01737 768 511 ext. 6046.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill, Surrey", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Clinical Fellow in Simulation &amp; Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244953", "validThrough": "2020-11-17T23:59:59+0000"}