{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-02T15:16:18+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated individual to join our friendly and experienced Occupational Therapy team within our “outstanding” Trust.&lt;/p&gt;\n&lt;p&gt;Could you be the enthusiastic, committed individual we are looking for to join our Occupational Therapy team? Helping to support our qualified staff in delivering activities of daily living and therapeutic interventions to in-patients at the Central England Rehabilitation Unit based at Leamington Hospital.&lt;/p&gt;\n&lt;p&gt;You will be required to assist in the provision of rehabilitation for patients with an acquired brain injury, under the guidance and supervision of the Occupational Therapists. You will work as part of a wider Multi-Disciplinary team and provide both one-to-one and group interventions. You will also assist with the evaluation of the effectiveness of Occupational Therapy input, using validated outcome measures, and assist with data management and input.&lt;/p&gt;\n&lt;p&gt;As part of your role you will be expected to liaise and work with patients, carers, other healthcare professionals and external agencies regularly, therefore you will need excellent communication and team working skills.&lt;/p&gt;\n&lt;p&gt;Do you have the ability to multi-task in a busy environment and also be able to work using their own initiative? You would also need to be able to manage your workload flexibly to meet the demands of the service.&lt;/p&gt;\n&lt;p&gt;Experience of working in a healthcare setting is preferred but not essential.&lt;/p&gt;\n&lt;p&gt;The service offers structured Personal Development Review (PDR) and Clinical Supervision systems, and actively promotes Continued Professional Development through in-service and other training.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa KnuttonJob titlePrincipal Occupational TherapistEmail addressLisa.Knutton@swft.nhs.ukTelephone number01926 495321 X 7544&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Occupational Therapy G70174, Leamington Spa", "postalCode": "CV34 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2693", "longitude": "-1.54106"}}, "title": "Occupational Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252579", "validThrough": "2020-11-10T23:59:59+0000"}