{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-06T15:46:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Advert &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Specialist Education Mental Health Team Leader to work in the Mental Health Support Team (Reflexions)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Band 7 37.5hrs working across Dudley and Sandwell – 2 posts.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Black Country NHS Foundation Trust working in partnership with the Dudley &amp; Sandwell Educational Psychology services&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity as part of a joint venture between CAMHS and Educational Psychology for an experienced mental health practitioner who holds a qualification in CYP IAPT CBT to be part of the new Children&#39;s and Young People&#39;s Mental Health Support Teams in Dudley and Walsall.&lt;/p&gt;\n&lt;p&gt;This team will have the opportunity to further develop work within the field of young people’s mental health and wellbeing with a focus on development of whole school approaches to mental health and wellbeing and the development of the think family approaches within the schools environment.&lt;/p&gt;\n&lt;p&gt;The mental health support teams will be jointly provided by the Dudley &amp; Sandwell Reflexions teams and Dudley &amp; Sandwell Educational Psychology Teams and will provide CBT, guided self-help, parenting and whole school approaches.&lt;/p&gt;\n&lt;p&gt;The post holder will be knowledgable and experienced in mental health problems and psychiatric disorders and will be expected to carry out in-depth mental health assessments including risk assessments where required. The postholder will also need to be the link worker between the team and the CAMHS services to ensure that children and young people receive the most appropriate care and interventions and well as being experienced in multi-agency working. Support, advice and consultation to families/carers and other professionals involved in the life of the child/young person will also need to be provided.&lt;/p&gt;\n&lt;p&gt;The post holder will work in partnership with the Clinical Lead and will further develop the partnership working that is currently taking place between Education, Local Authority, CCG and the Child &amp; Adolescent Mental Health Service (CAMHS).&lt;/p&gt;\n&lt;p&gt;The Mental Health Support Team is expected to be fully mobilised by January 2022.&lt;/p&gt;\n&lt;p&gt;Applicants should be experienced in CAMHS at a senior level with the required leadership and clinical skills to support the Mental Health Support Teams project. Experience of recent working with schools and delivering mental health promotional collaborative work in such an arena is vital in order to be able to fulfill the role.&lt;/p&gt;\n&lt;p&gt;Applicants must have excellent communication skills and be able to network with other agencies such as Public Health, Clinical Commissioning Groups and Local Authorities amongst others as and when required. Applicants must also have experience of managing staff and be qualified in Cognitive Behavioural Therapy.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced children’s and adults barred list Disclosure and Barring Service (DBS) Check.&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Andrew Westley, Clinical Lead for Dudley Reflexions on a.westley@nhs.net&lt;/p&gt;\n&lt;p&gt;Louise Twardowski, Clinical Lead for Sandwell Reflexions on louise.twardowski@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing Date for applications is 13th November 2020 however if a large number of applications are received it may be closed down earlier.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew Westley / Louise Twardowski&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lodge Road, Sandwell / The Mere, Dudley, Sandwell / Dudley", "postalCode": "B70 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5193", "longitude": "-2.0188"}}, "title": "Specialist Educational Mental Health Team Leader for Reflexions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260448", "validThrough": "2020-11-16T23:59:59+0000"}