{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-29T11:51:28+0000", "description": "&lt;h2&gt;&lt;span&gt;The Role: Senior Community Mental Health Practitioner &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;The Team:&lt;/strong&gt; We are looking for a Senior Community Mental Health Practitioner to join the East Devon Older Adults Community Mental Health Team, based at Haydon’s Court in Honiton. This role is challenging, and you will play an essential part in the home assessment &amp; treatment of our clients with complex functional and organic mental health needs. You will work alongside our clients &amp; carers, to offer them quality support and education. Our Team is made up of various disciplines such as Mental Health Nurses, Occupational Therapists &amp; Social Workers.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our Teams work includes: &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;The assessment and treatment of depression and anxiety&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The assessment, diagnosis and treatment of dementia&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Coping strategies to help with memory problems&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The assessment &amp; treatment of behavioural &amp; psychological symptoms of dementia&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Advice about specialist mental health medicines&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The assessment and treatment of Psychosis&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to Psychological talking therapies&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support, information and education for family &amp; carers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Liaison with, and signposting to other health and social care providers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;On-going support &amp; monitoring for people with severe and enduring needs&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span&gt;About you: &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;You will hold a professional qualification, Registered Mental Health Nurse, Occupational Therapist or Social Worker. You will have relevant post qualifying experience working in older adult’s mental health in a community setting. You will be passionate about making a difference to people’s lives. You will be responsible for managing and directing the care of some of the most vulnerable people we are responsible for, many of whom will have complex and ongoing needs. You will use your skills and experience to deliver person centred care, which inspires hope &amp; recovery. You will be able to demonstrate specific examples of how your involvement has improved patients care &amp; experience, and how you have influenced others to deliver high-quality care. You will be a clear and confident communicator, capable of interacting and working effectively with people who use our services, their families/carers, staff &amp; stakeholders from all backgrounds.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will play a key role in a multidisciplinary team, working with various agencies on a daily basis. You will be confident working independently, with the knowledge to devise individual recovery plans for the people you see. You will be able to assess risk and respond accordingly, and work a rota as a duty worker for the Team. As a Senior Clinician you will be able to mentor &amp; supervise students &amp; other staff members. We will help the right person progress within this role, and we will provide a range of training opportunities that can help you develop the skills you need to thrive.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;The location&lt;/strong&gt;: This position is based at Haydon’s Court in Honiton, however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Hours:&lt;/strong&gt; full time / currently Monday to Friday 9-5PM&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;&lt;span&gt;About us:&lt;/span&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an organisation that is passionate about mental health and learning disability. One that cares about the people it supports, and one that also cares about its staff. You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together to benefit the people who use our services. We recognise that our staff want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes &amp; opportunities to access external training where appropriate. You will receive regular supervision, and have the opportunity for team level peer support. In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To discuss this role please call Shaun Mc Ginn (CMHT Manager) on 07794 050171.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Honiton", "postalCode": "EX14 2DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7949", "longitude": "-3.18659"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248197", "validThrough": "2020-11-23T23:59:59+0000"}