{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-04T14:08:36+0000", "description": "&lt;p&gt;East Cheshire NHS Trust is looking to recruit newly qualified and experienced registered staff nurses to our hospital bank.&lt;/p&gt;\n&lt;p&gt;Our bank service aims to supply appropriately skilled staff to cover temporary shortages across the organisation,&lt;strong&gt;especially during the Covid-19 pandemic.&lt;/strong&gt; Joining the bank provides an excellent opportunity for those who wish to gain insight and experience into diverse areas and specialties while providing you with the flexibility to choose your own working hours with the option of Weekly pay. It can also provide the opportunity to gain experience with the trust as a precursor to permanent employment.&lt;/p&gt;\n&lt;p&gt;The role of a bank Staff Nurse is to support in the assessment, planning, delivery and evaluation of high quality nursing care, working as part of a multidisciplinary team of nurses, doctors, health care assistants and other health professionals. We are seeking compassionate nurses, capable of working in a busy and challenging environment, to deliver evidence based and patient focused care.&lt;/p&gt;\n&lt;p&gt;To be successful in your application you will need to demonstrate your knowledge and your dedication to high standards of patient care. You must be a team player with excellent communication skills and have the ability to work using your own initiative as well as part of the wider team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is BANK&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week are ZERO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift patterns: shifts will be either early (7:00-15:00), late (13:00-20:00), long day (7:00-20:00) or night shifts (19:30-7:30)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 19th November 2020&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For details about the role and ward/informal visits contact:&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jill Marshall, Senior Nurse Workforce and Deployment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;jill.marshall7@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01625 661278&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For queries regarding the application and or interview process, please contact the Recruitment Team either via email, ecn-tr.recruitment@nhs.net or telephone, 01625 656510&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We would like to inform you that if your application is successful, your interview will be held via SKYPE.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Due to the terms of a Bank contract, we are unable to meet the criteria for Tier 2 sponsorship for visa purposes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Bank Registered Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256149", "validThrough": "2020-11-19T23:59:59+0000"}