{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc.HCAS"}}, "datePosted": "2020-10-27T22:00:19+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Communications Lead&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 months Fixed-term due to funding &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for a creative, confident Senior Communications Lead to join us at Imperial College Health Partners (ICHP).&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working.&lt;/p&gt;\n&lt;p&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;Our strategic priorities are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/p&gt;\n&lt;p&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a creative and confident Senior Communications Lead to work at Imperial College Health Partners. This is an exciting opportunity to develop and deliver complex communications programmes, both client facing and corporate, with the chance to make a real difference to healthcare services.&lt;/p&gt;\n&lt;p&gt;Our team recognises and values good communications and we’re looking for someone who is passionate about values-driven communications with people at its heart. We need someone with high levels of confidence, aptitude and diplomacy as well as exceptional professional skills and expertise. The role spans both strategic development and operational delivery and you will excel in both.&lt;/p&gt;\n&lt;p&gt;You’ll support the Associate Director of Communications and Engagement to develop and implement a comprehensive strategic approach to communications with members, strategic partners and key stakeholders at both a corporate and project level.&lt;/p&gt;\n&lt;p&gt;You will also plan and deliver high quality communications activity to support the delivery of ICHP’s organisational priorities, also at both a corporate and project level.&lt;/p&gt;\n&lt;p&gt;You’ll form part of the senior leadership of our close knit communications and engagement team and you will manage members of staff, inspiring them to be the best they can be.&lt;/p&gt;\n&lt;p&gt;You’ll oversee the day-to-day planning and delivery of a high quality internal and external communications programme for ICHP, will include all or some of the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development of online and digital platforms including the ICHP website and social media channels - optimising these to promote ICHP, support its wider marketing strategy and promote open communications and networking where possible;&lt;/li&gt;\n&lt;li&gt;Leading a programme of effective internal communications and staff engagement;&lt;/li&gt;\n&lt;li&gt;Development of a range of high quality corporate literature including internal and external newsletters, briefings and ICHP&#39;s annual impact report;&lt;/li&gt;\n&lt;li&gt;Effective engagement with media, ministerial and government stakeholders where required.&lt;/li&gt;\n&lt;li&gt;Strategic communications advice and counsel to the wider ICHP team and our members when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held in the week commencing 16 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie Hudson, Associate Director of Communications and Engagement&lt;/p&gt;\n&lt;p&gt;natalie.hudson@imperialcollegehealthpartners.com&lt;/p&gt;\n&lt;p&gt;Telephone number: 07814439932&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Health Partners, London", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Senior Communications Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245665", "validThrough": "2020-11-10T23:59:59+0000"}