{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668"}}, "datePosted": "2020-10-22T12:31:05+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant in Obstetrics and Gynaecology (with a special interest in Urogynaecology)&lt;/span&gt; 10 PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals of Derby and Burton NHS Foundation Trust is a newly merged Trust bringing together two dynamic, high performing organisations, on an exciting journey towards excellence. The Trust is based across five hospital sites, serving the populations of Derbyshire, Staffordshire and surrounds.&lt;/p&gt;\n&lt;p&gt;Due to the retirement of the current post holder, applications are invited for a Consultant position in Obstetrics and Gynaecology with a special interest in urogynaecology. This post will be based at Queen’s Hospital, Burton but as a newly merged organisation, we expect flexibility to be able to work cross site in the future should the need arise.&lt;/p&gt;\n&lt;p&gt;Our Gynaecology service is a large service across 5 hospital sites including three sub specialties, Urogynaecology, Gynae Oncology and Fertility as well as a general gynaecology service. The Burton site offers a comprehensive service which covers general obstetrics and gynaecology including sub-specialised services. Queen’s Hospital is a Cancer Unit and is part of the Derby/Burton Cancer Network. We have an accredited Urogynae service supported by specialist nurses and provide an outpatient hysteroscopy/ambulatory service along with early pregnancy services which are nurse led. We also provide a one stop Postmenopausal Bleeding Clinic as well as a dedicated Urgent Cancer Referral (UCR) Clinic and colposcopy service. A full range of inpatient gynaecological surgery is provided at the main hospital with day-case operating taking place in the Treatment Centre as well as at the Sir Robert Peel Community Hospital in Tamworth.&lt;/p&gt;\n&lt;p&gt;Our Obstetrics department currently delivers around 9500 women every year across our two main sites at Derby and Burton. We support a birth centre at Lichfield and a co-located birth centre at our Derby site. The maternity services are integrated, providing care in the hospital and community, including consultant antenatal clinics in Tamworth and Lichfield. The Burton unit has around 3200 deliveries per year with a further 300 at the Midwifery led Unit at Samuel Johnson Community Hospital (SJH) in Lichfield, 15 miles from Burton.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to staff health, well-being and development, with all staff being able to take advantage of a great range of benefits.&lt;/p&gt;\n&lt;p&gt;The duties of the post will involve general, urogynae and antental clinics. The successful applicant will be expected to cover emergency gynaecology as well as the labour ward and obstetric services during the “service week” and 1:10 out-of-hours non-resident on-call.&lt;/p&gt;\n&lt;p&gt;This appointment is for a full time 10 PA Consultant Obstetrician and Gynaecologist. The applicant should have the appropriate training and experience to fulfil the requirements of this post be registered with the GMC and hold a licence to practice, or be eligible for inclusion on the register within six months of the interview date.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in joining us, then please contact:&lt;/p&gt;\n&lt;p&gt;Secretary to Dr N Pope, Associate Clinical Director Burton: 01283 511511 x 4381&lt;/p&gt;\n&lt;p&gt;Secretary to Mr J Dasgupta, Clinical Director Gynaecology: 01332 785694&lt;/p&gt;\n&lt;p&gt;Secretary to Mrs K Dent Clinical Director, Obstetrics: 01332 785204&lt;/p&gt;\n&lt;p&gt;Informal visits to the department and to meet the staff are encouraged.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens, Burton, Burton", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Consultant in Obstetrics and Gynaecology (S/I in Urogynaecology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238453", "validThrough": "2020-11-19T23:59:59+0000"}