{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inclusive HCA"}}, "datePosted": "2020-10-14T16:45:53+0100", "description": "&lt;p&gt;Newham Adolescent Mental Health Team is looking for an enthusiastic, experienced and motivated Mental Health Nurse who enjoys working in a multidisciplinary team. The post has arisen following the previous substantive part time post holder leaving to take up further training, funding has been agreed to increase the number of sessions to full time on an 18 month fixed term basis.&lt;/p&gt;\n&lt;p&gt;This post may appeal to a Nurse not currently working in CAMHS but with an interest to develop their expertise in that field and who enjoys engaging young people in longer term pieces of work.&lt;/p&gt;\n&lt;p&gt;The well-functioning team consists of Child and Adolescent Psychiatry, Clinical Psychology, Mental Health Nursing, Child and Adolescent Psychotherapy, Systemic Family Therapy and administrative staff who are committed to developing innovative and effective ways of working with young people with significant mental health difficulties including psychotic disorders and repeated, life threatening self-harm, their families and their professional networks.&lt;/p&gt;\n&lt;p&gt;The post holder will provide high quality evidence based mental health assessment and treatment within the AMHT model of care coordination. This will include professional and practice development and ensuring high quality client-centered care. You will call upon a broad range of skill and experience to work both individually and jointly with young people and their families. We will provide an interesting and supportive work environment, with good training and supervision provided through the Adolescent Mental Health Team within Newham CAMHS.&lt;/p&gt;\n&lt;p&gt;Newham CAMHS is a busy comprehensive Community CAMHS serving a multi-ethnic and culturally diverse community. We welcome applicants who are skilled at working with the richness and complexity of this multicultural context.&lt;/p&gt;\n&lt;p&gt;The Child and Adolescent Mental health Service is part of the Specialist Services Directorate in the East London NHS Foundation Trust, rated an Outstanding Trust by the Care Quality Commission. There are good links with Education, Childrens Social Care and voluntary sector organisations locally.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E13 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5236", "longitude": ".024862"}}, "title": "Mental Health Nurse AMHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227148", "validThrough": "2020-11-07T23:59:59+0000"}