{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T12:31:49+0000", "description": "&lt;p&gt;The establishment and maintenance of excellent records management practices and systems is fundamental to support NHS England and NHS Improvement&#39;s staff across the country, working to ensure the NHS delivers the highest quality of care. This secondment/fixed term positions within our dynamic Corporate Records Management Team is essential to that work. The post is based at Quarry House, Leeds, and may involve infrequent travel across England. The Senior Lead for Corporate Records and Information Management leads in the development, improvement, implementation and monitoring of all aspects of Records Management. This role will assist with not only the Legacy Records project but the wider programme of work also, which will result in fully managed processes, in place, predominately around managing the financial aspects of our records management projects and programmes. However this role is not limited to only finance related tasks but also advising on all aspects of records management queries which will help enhance the knowledge you already have.&lt;/p&gt;\n&lt;p&gt;Experience of working in a similar environment is essential; working to the highest professional standards is a pre-requisite, as is the flexibility to embrace and support change as programmes develops. This post will suit someone who has experience working within a Records Management/information Management/Information governance team who has proven experience of financial systems and dealing with suppliers. Experience of the Records Management: NHS Code of Practice, including knowledge of the Data Protection Act 2018, and GDPR will be expected.&lt;/p&gt;\n&lt;p&gt;The role will be based in Leeds, Quarry House although at the moment, home based working is in place due to Covid19 restrictions.&lt;/p&gt;\n&lt;p&gt;When applying, please ensure that you have read the job description and person specification carefully. Please use the ‘Supporting information’ space to demonstrate your ability to undertake this role, drawing on your knowledge, skills, and experience.&lt;/p&gt;\n&lt;p&gt;This position will terminate on 31.12.2021 due to programme funding.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jan Gavin, Senior Lead - Corporate Records and Information Management; Jan.gavin@nhs.net or 07900 715 267&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Corporate Records Management Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244512", "validThrough": "2020-11-10T23:59:59+0000"}