{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-10-29T12:16:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are seeking a Band 7 qualified in specialty neonatal nurses to join our dynamic and motivated team. You will maintain clinical, leadership and management skills in a highly supportive senior team structure working across the ITU, HDU and SCBU clinical areas. You will regularly manage the day to day activity of the service, demonstrate effective and safe decision making ability and participate in all aspects of staff management.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Neonatal Intensive Care Unit is a specialist regional intensive care unit providing specialist neonatal medical and surgical intensive care within the East of England Neonatal Operational Delivery. It is the regional centre for specialist neonatal neurosurgery, ophthalmology and ENT surgery.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The NICU provides a full range of neonatal services for the catchment population of Cambridge and takes tertiary referrals for ill neonates from the 17 Units within the East of England and surrounding districts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will offer you a full and comprehensive orientation package and professional support tailored to individual needs with ongoing support from the Neonatal Clinical Education Team in order for you to achieve your full potential. You’ll receive training and development in this friendly and dynamic organization which seeks to innovate and strives for excellence in delivering first-class patient care.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Closing date: 22 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 14 December 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Mary King&lt;br /&gt;Job title: Matron&lt;br /&gt;Email address: mary.king@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 01223 256588&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Senior Sister/Charge Nurse - NICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248285", "validThrough": "2020-11-22T23:59:59+0000"}