{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro rata for part time"}}, "datePosted": "2020-11-05T12:15:23+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;South Worcestershire Out of Hours Nursing Service – Warndon, Worcester&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;COMMUNITY NURSE&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;BAND 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Part time (Various Hours available) Working shifts 18:30 and 23:30&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to join the busy but friendly Out of Hours Enhanced Care Team.  Based in Worcester, we cover South Worcestershire patients during the course of the evening, working very closely with other professionals to deliver expert nursing care to a wide range to patients in the community setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should be highly motivated and be able to deliver high quality evidence based nursing care within the community setting to support those who wish to stay at home and avoid hospital admission.  You will have good communication skills, be able to work autonomously but also work in an integrated way. Close working with our integrated Enhanced care/Hospital at Home service, Care home practitioners and social service colleagues is essential to ensure seamless care to our patient group.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should be a good team player yet autonomous in your care delivery as this post requires an ability to be flexible and ‘think on your feet’.  Applicants should be fully qualified and hold current registration with the NMC.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity for a nurse who wants to be at the forefront of integration and care closer to home. You would need to meet the travel requirements of the post including transporting equipment in your car.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the post the applicant must be able to travel independently and have access to a suitable vehicle for business purposes. Whilst the base is identified, staff can be asked to work anywhere within the Business Unit or Service if necessary.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information or to arrange an informal visit please contact Emma Cook, Clinical Lead South Worcestershire Out of Hours Nursing Service on &lt;/span&gt;07710760787/ emma.cook18@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Herefordshire and Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR5 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1917", "longitude": "-2.17905"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257593", "validThrough": "2020-11-22T23:59:59+0000"}