{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-06T15:16:36+0000", "description": "&lt;p&gt;We are looking for dynamic and enthusiastic band 6 RNMH to join us in our brand new CAMHS ‘Sowenna’ inpatient facility in Bodmin, comprising a 12 bed unit for 13 -18 year olds, including a High Dependency Unit.&lt;/p&gt;\n&lt;p&gt;We are striving for our unit to be innovative, creative and family focused. We are inspired by some of the best practice and emerging evidence base from around the country and are not afraid to trial some new and original thinking for the benefit of our young people. We are looking for imaginative and playful individuals that are motivated by the opportunities and challenges of developing what we hope will be a gold standard unit.&lt;/p&gt;\n&lt;p&gt;It is very important to us that we create a unit that is therapeutic at its very core and takes into account child development, systemic thinking and trauma. It is our aim that we take a whole staff team approach to understanding, engaging and supporting young people. Our pledge is that every interaction will be therapeutic; we would therefore like to attract curious, accepting and empathetic team members who share in this ethos.&lt;/p&gt;\n&lt;p&gt;In order to achieve such ambitious goals we recognise the importance of supporting all our staff in building and feeling a part of a healthy, well-functioning team and service. We appreciate we are striving for cutting edge assessment and treatment within a highly emotive and distressing environment. We are therefore looking for individuals that are good under pressure; place high worth in team based working and with an unrelenting passion and dedication for working with young people and their families.&lt;/p&gt;\n&lt;p&gt;It is our intention to embed reflective practice, continual learning and clinical supervision into the essence of the service. We hope to offer a bespoke and rolling training package to all staff and would like to invest in our team member’s sense of mastery. We assure to be mindful of fostering career progression opportunities moving forward. We are especially interested in utilising new employee’s specialist expertise and interests.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining Cornwall CAMHS as there has been large scale investment in the local services. Cornwall is leading the way on a ground-breaking Clinical Associate Psychology (CAP) service, the first of its kind anywhere in England and Wales. There has also been major investment in developing care pathways for CAMHS, extra investment in Psychologist posts and the roll-out of the I-thrive model.&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful and fulfilling place to live, with opportunities to make the most of the stunning coastline or moors. Summers are vibrant and full of entertainment and winters allow you to have whole beaches to yourself. Bodmin is well located and easily accessible from the A30 and A38.&lt;/p&gt;\n&lt;p&gt;If you are looking to work somewhere that is unconditionally respectful to young people and their families, that value their staff as individuals and continuously strives to be the best unit it can be then we could be the team for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFrances Riley / Ross MorsheadJob titleClinical Lead Specialist / Ward ManagerTelephone number01208 834234&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sowenna, Bodmin Hospital Site, Bodmin", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "CAMHS Inpatient Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260328", "validThrough": "2020-11-29T23:59:59+0000"}