{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa plus HCAS"}}, "datePosted": "2020-10-28T10:16:36+0000", "description": "&lt;p&gt;North East London Foundation Trust is seeking an enthusiastic and highly motivated Nursing Associate to join the district nurses in Havering South Locality Team. We operate 7 days a week 08:00-21:00. Staff are expected to work shifts between these hours.&lt;/p&gt;\n&lt;p&gt;the following is required for the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nursing Associate Foundation Degree and NMC registration&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Evidence of the ability to undertake clinical skills as outlined in the NMC Nursing Associate Skills Annex.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience in a health care setting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to support their team, department and organisation to achieve the Trust’s Values in their day to day work. These are the 5P’s:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Putting people first&lt;/li&gt;\n&lt;li&gt;Prioritising quality&lt;/li&gt;\n&lt;li&gt;Being progressive, innovative and continually improve&lt;/li&gt;\n&lt;li&gt;Being professional and honest&lt;/li&gt;\n&lt;li&gt;Promoting what is possible – independence, opportunity and choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The role of the Nursing Associate is to work within their scope of practice, without direct supervision in partnership with a Registered Nurse. The Nursing Associate will provide and deliver a high standard of nursing care, contributing to the ongoing assessment, to patients delegated to them.&lt;/li&gt;\n&lt;li&gt;The Nursing Associate will safely undertake the procedures outlined in the NMC Nursing Associate Skills Annex to meet the patient’s nursing needs to include; undertaking routine procedures including measuring and interpreting blood glucose levels, recording and interpreting vital signs, continence care, bladder and bowel care, pressure area care, wound care, nutrition, hydration, foot care, skin integrity, mood identification and the administration of medication etc.&lt;/li&gt;\n&lt;li&gt;The Nursing Associate will be expected to carry out planned and unplanned care to patients in their own homes&lt;/li&gt;\n&lt;li&gt;The successful applicant must be flexible, a good team worker, used to working under pressure, have excellent interpersonal and IT skills and be able to communicate effectively with patients, carers and other members of the Multi-Disciplinary Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;NA- NMC registration essential&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Probationary Period&lt;/span&gt;&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assessment/Interview info&lt;/span&gt;&lt;br /&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Starting with NELFT&lt;/span&gt;&lt;br /&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;High Cost Area Supplement - London&lt;/span&gt;&lt;br /&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (minimum payment of £3,784 and a maximum payment of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRose HeardJob titleHavering South Locality LeadEmail addressrose.heard@nelft.nhs.ukTelephone number07989183422Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hornchurch, Hornchurch", "postalCode": "RM1 3BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5817", "longitude": ".187636"}}, "title": "Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246019", "validThrough": "2020-11-11T23:59:59+0000"}