{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105042", "minValue": "77913", "unitText": "YEAR", "value": "£77,913 to £105,042 pa"}}, "datePosted": "2020-11-05T12:00:55+0000", "description": "&lt;p&gt;Locum Consultant Acute Medicine&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant Acute Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 year fixed term contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;ALL CORRESPONDENCE INCLUDING INVITATION TO INTERVIEW AND CONFIRMATION OF ATTENDANCE WILL BE COMPLETED VIA EMAIL. PLEASE ENSURE BUSINESS E-MAIL ADDRESSES ARE PROVIDED FOR ALL REFEREES.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a unique opportunity to join our vibrant and innovative Acute Medicine Division.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and innovative professional to join our dedicated team in the Acute Unit.&lt;/p&gt;\n&lt;p&gt;BHRUT is one of the largest acute trusts in the UK, providing specialist trauma, oncology, neurosciences, hyper acute, stroke and critical care services. We are passionate about developing excellent and sustainable services, including developing our capacity to act as the main tertiary referral centre for North East London and Essex. We have excellent academic centres with a vibrant educational programme.&lt;/p&gt;\n&lt;p&gt;We have two Medical Receiving Units and an Ambulatory Care Centre across our Queen’s Hospital and King George’s sites, delivering prompt and comprehensive acute medical care. Our department has a reputation for innovation. We have developed an eHandover system which has won national awards for patient safety and subsequently has been rolled out across the country.&lt;/p&gt;\n&lt;p&gt;The Trust is dedicated to growing our own and developing our consultants through education and specialists interest. We are open to discussions regarding your specialty interests with potential to work in areas such as respiratory, gastro, endocrine and any alternative interests you may have. In addition to in-patient work, you will be expected to lead on other acute medicine commitments such as hot clinics and ambulatory clinics.&lt;/p&gt;\n&lt;p&gt;We have a multidisciplinary team to support you in your role, including a dedicated leadership team and governance team, with a doctor establishment of 5 registrars, 3 CT’s 13 SHO and 5 FY1’s.&lt;/p&gt;\n&lt;p&gt;We also have training doctors from London Deanery providing opportunities for you to get involved with training and developing our future medical workforce.&lt;/p&gt;\n&lt;p&gt;The Trust is in an excellent location, close to Central London and well situated in the South East. As well as all the advantages of being close to London, the Trust has on-site nursery facilities at Queen’s and King George Hospital sites.&lt;/p&gt;\n&lt;p&gt;You must have CCT in General Medicine or within 6 months of obtaining CCT, with good experience in acute medicine.&lt;/p&gt;\n&lt;p&gt;All applicants must have full GMC registration.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details/informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Gideon Mlawa, Lead Consultant for Acute Assessment Unit at gideon.mlawa@nhs.net or 01708 435 000 Ext 6981&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Acute Assessment Med. Staff, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Locum Consultant Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257546", "validThrough": "2020-11-15T23:59:59+0000"}