{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 7 – 8a Negotiable depending on experience"}}, "datePosted": "2020-10-26T09:20:05+0000", "description": "&lt;p&gt;We are looking for enthusiastic, innovative and forward thinking Pharmacists to work in a variety of settings across Cornwall. We are working together to trial recruiting Pharmacists in a coordinated way as a system, to offer a range of roles either in one setting, or in a portfolio role across settings. This is an exciting opportunity to be part of a new way of working; providing opportunities for development and a broad range of experience across different sectors should you choose it. This is a rolling advert, applications will be reviewed as they are submitted, and shortlisting and interview arranged as appropriate.&lt;/p&gt;\n&lt;p&gt;Partners included in the recruitment are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Primary Care Network and GP practices&lt;/li&gt;\n&lt;li&gt;Royal Cornwall Hospitals Trust&lt;/li&gt;\n&lt;li&gt;Cornwall Foundation Trust&lt;/li&gt;\n&lt;li&gt;Kernow Clinical Commissioning Group&lt;/li&gt;\n&lt;li&gt;Community Pharmacies&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;With a variety of beautiful locations across the County and a range of exciting and challenging opportunities in a variety of settings we can help you find the perfect job.&lt;/p&gt;\n&lt;p&gt;Please note: For PCN roles the successful candidates must have two years post-registration experience and will be enrolled onto an 18 month GP training pathway. However, if you do not have this level of post qualification experience, there may be opportunities in different settings for you to gain this experience in Cornwall and the job offer would be remunerated appropriately. Please make this clear in your application form and we will consider your application accordingly.&lt;/p&gt;\n&lt;p&gt;Please review the attached Job Information Pack and job descriptions to help you identify the setting and location you prefer. &lt;strong&gt;Please clearly state in your application form which role(s) and location you are interested in applying for and whether you are interested in a portfolio role or a role in only one setting.&lt;/strong&gt; Please note vacancies may not be available in all of our settings, but please still apply and we will keep you informed of the current situation and notify you if any jobs become available in the future.&lt;/p&gt;\n&lt;p&gt;Please note if you are applying for a portfolio role, the interview will be a panel interview with representatives from the different parts of the system. Where possible we will match the interview Panel to the candidate’s preference. The Panel will consist of a maximum of 4 representatives from across the system, but may also include observers from other employing organisations. Presently all our portfolio interviews are conducted via Microsoft Teams. It is anticipated that interviews will take place approximately 10 days after application is submitted. If you are applying for a single role, we will pass your details on to the appropriate recruiting manager who will process your application in accordance with their recruitment procedures.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal discussion with one of the partners, please email Kernowhealthcic.workforce@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "GP Surgeries and Medical Centres", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129214"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Locations", "postalCode": "TR1 3LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2659", "longitude": "-5.09797"}}, "title": "Clinical Pharmacist / Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241830", "validThrough": "2021-01-05T23:59:59+0000"}