{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558"}}, "datePosted": "2020-11-05T16:46:15+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly experienced and proactive Senior Compliance Project Manager join the Estates team at St George&#39;s Hospital, to assist the Assistant Director of Estates in all aspects for the Trust Capital Infrastructure Programme.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a motivated and positive individual with a genuine passion for project management to work autonomously in a supportive and collaborative environment as well as being a key member of the Estates &amp; Facilities Directorate at St George&#39;s University Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to lead and coordinate a programme of internal and charity projects aimed with an estimated investment of approximately £100k to £10m; depending on the needs and requirements of the team and the Trust. This will inevitably be a very busy role and the post holder will require a flexible approach to work and be able to use their own initiative and work effectively with other team members. The ideal candidate will be a proactive, self-motivated individual with a strong work ethic, strong organisational skills and the ability to think strategically. They will have excellent communication skills and demonstrate flair, enthusiasm, innovation and leadership when faced with challenges and will provide strategic, tactical and operational management skills in the planning and execution of the projects that they are responsible for. Experience of complex project management, and working collaboratively with a wide range of stakeholders across multiple sites and organisations is essential. Experience of business development and involvement in bid writing will be desirable.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be fully supported within the role and there will be opportunities for professional and career development subsequent to the fixed term contract period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNickon ForrestJob titleEstates Business ManagerAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nickon Forrest; Business Manager at Nickon.Forrest@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Energy Centre, St Georges Hospital, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Senior Compliance Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258633", "validThrough": "2020-11-12T23:59:59+0000"}