{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa, based on full time hours"}}, "datePosted": "2020-11-04T12:00:26+0000", "description": "&lt;p&gt;We are looking for a highly motivated Clinical or Forensic Psychologist to work within a well-established psychological therapies team at Ravenswood House near Fareham. Ravenswood is a medium secure unit providing assessment, care and treatment for adult men with serious mental illness or personality disorder who need to receive their care in a medium secure environment. Most of our patients have either committed a criminal offence, or have challenging behaviour. We admit patients from high secure hospitals, local psychiatric hospitals, prisons and the courts. We work to a recovery-based ethos, putting the individual service user at the centre of all we do.  &lt;/p&gt;\n&lt;p&gt;Ravenswood is part of the Specialised Services directorate within Southern Health NHS Foundation Trust. The successful candidate will join a large psychology department, covering both inpatient and community care, for adolescent and adult forensic services. There will be opportunities for working with other clinical and forensic psychologists as well as psychological therapists, creative therapists and clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity to provide high quality psychological input to people with complex needs to help understand, prevent and ameliorate psychological distress, and related risk, to ensure successful transition to the community for the service users within the unit.  The successful candidate will have the opportunity to use and develop skills in both clinical and forensic areas. The post holder will contribute towards a psychologically informed environment through assessment, formulation, and interventions. In addition to; providing reflective practice, practical training and teaching for wards and other disciplines; providing clinical and management supervision of assistant psychologist(s) and less experienced practitioner psychologists as well as providing clinical supervision for other members of the multi-disciplinary team, as required.   &lt;/p&gt;\n&lt;p&gt;We have a track record of innovation and service development which we strive to maintain and improve upon, developing both evidence-based interventions as well as providing practice-based evidence to support new ways of working.&lt;/p&gt;\n&lt;p&gt;Applicants with sufficient experience and knowledge for a Band 8a post are encouraged to apply, and we will also consider newly qualified applicants who have relevant experience and the potential to match the person specification for a development role as a Band 7. In the latter case, we would look to develop the applicant into the full 8a role, subject to achieving sufficient post-qualification experience, and the competencies required of an 8a role. &lt;/p&gt;\n&lt;p&gt;The post is advertised as part-time and depending on an applicant’s circumstances, between 22.5 and 30 hours will be considered.&lt;/p&gt;\n&lt;p&gt;For further details, please contact Amanda Bowley, Acting Principal Forensic Psychologist&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 02382 310861&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;E-mail: amanda.bowley@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications:  20th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fareham", "postalCode": "PO17 5NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8819", "longitude": "-1.20361"}}, "title": "Highly Specialised Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255704", "validThrough": "2020-11-20T23:59:59+0000"}