{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-10-20T14:52:42+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;Staff Nurses&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;strong&gt;RMN/RN/RNLD/RNC&lt;/strong&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Full Time Rotational&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Families, Young People and Children’s Services&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Eating Disorders Service&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Bennion Centre, Glenfield Hospital, Groby Road, Leicester, Leicestershire, LE3 9DZ&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Eating Disorders Service is a well-established secondary service with an excellent international reputation. There is a large outpatient service and an inpatient unit which offers an intensive care programme for weight restoration, including a Day Programme, for patients across the East Midlands region with low weight Anorexia Nervosa. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking to recruit Band 5 nurses, qualified as either RMN, RN, RNLD or RNC for our inpatient unit based at Langley Ward in the Bennion Centre on the Glenfield General Hospital Site. Patients referred for inpatient treatment are at a very low weight and have a high degree of physical and psychiatric co-morbidity. Experience of working with patients with eating disorders is desirable but not essential, as full training will be provided. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would be required to contribute to the smooth operational running of the ward and to deliver all aspects of the intensive care programme for patients with anorexia nervosa, at various stages of their recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This would include supervision of meals, assisting patients with meal planning, and providing emotional support with management of weight and eating difficulties. The post holder would be required to effectively manage physical and psychiatric risk associated with this patient group. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would also be required to participate in the provision of group activities in the Day Programme, alongside our Occupational Therapy team, that is based in the unit. We facilitate a number of psychological groups such as CBT, Interpersonal Effectiveness Training, Motivational Enhancement Therapy, Body Wise, to name but a few. We also offer practical interventions such as meal cookery, breakfast group, sandwich making and baking group. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity for an enthusiastic, motivated and reliable person, with good interpersonal and team working skills. We are looking for individuals who are willing to develop a range of skills in a challenging yet rewarding role, including an ability to hold a boundary, to enable the patient to resist their eating disorder behaviours and work towards recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We always strive to provide exceptional care to our patients, so are looking for staff who work towards high professional standards and who always act in line with our Trust values of care, compassion, integrity and trust. The post holder would be required to work within our multi-disciplinary team, including consultant psychiatrists and therapists.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You would be provided with in service training and supervision.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would be required to work shifts on internal rotation which are early shift 07:30 until 15:30 Late shift 13:30 until 21:30 and the night shift 21:15 until 07:45. We may able to be flexible with the shift pattern on request.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;For further information please contact: Maureen Williams, Ward Manager on 0116 2951474.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 9DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6554", "longitude": "-1.18283"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234871", "validThrough": "2020-11-06T23:59:59+0000"}