{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45838", "minValue": "40057", "unitText": "YEAR", "value": "£40,057 - £45,838 additional supplement for on cal"}}, "datePosted": "2020-10-30T10:46:20+0000", "description": "&lt;p&gt;&lt;span&gt;The role of the Estates Manager - Operational Services is to work as the lead for the Operational Estates Team and be responsible for the day to day management of all aspects of planned and reactive maintenance including, but not limited to, Building, Mechanical and Electrical Engineering. The role will also involve liaising with Service users and Contractors to ensure that all works are planned and delivered within quality, time and cost parameters.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The postholder will be expected to provide comprehensive, proactive and professional support to the Head of Estate Services, by effectively managing operational aspects of Estates Services to ensure all compliance matters are delivered, the service is delivered within the agreed budget, the operational estates risk management is undertaken and all workforce matters are undertaken.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will provide detailed professional and technical advice to the estates team, customers, external bodies, contractors as well as external consultants on issues that are highly complex and non-routine for building, engineering plant and equipment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The postholder will also be required to take on the duties of Authorised Person for multiple HTM specialities and undertake full management for the development and implementation of any minor works projects, where appropriate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate should be motivated and confident, have experience in financial, budgetary and resource management, be able to demonstrate significant experience of leadership and management and be able to work under pressure to meet deadlines. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information please contact Phil Sturdy philip.sturdy@nhs.net &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Estates Manager – Operational", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249777", "validThrough": "2020-11-11T23:59:59+0000"}