{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907- £30,615 per annum"}}, "datePosted": "2020-10-30T09:15:58+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;PLEASE NOTE Shortlisted candidates will be expected to attend in person for interview at Blackpool Victoria Hospital&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Band 5 Radiographer – General Imaging&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to announce that due to expansion of Services we are increasing the size of our team, thus we currently have vacancies for enthusiastic and motivated radiographers to work in our general imaging team.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work within a fantastic team here at Blackpool Teaching Hospitals.&lt;/p&gt;\n&lt;p&gt;In the general imaging team, you will work across different sites and on a rotation through different aspects of general imaging such as theatre and mobiles, accident and emergency, inpatients and outpatients so you will be exposed to a wide range of experience. New staff are assigned a buddy/mentor to allow orientation into the department and a full induction programme is in place. The role is challenging but rewarding and your professional skills can make a real difference to our patients. &lt;br /&gt;&lt;br /&gt;The Radiology Directorate has achieved ISAS accreditation and is focused on providing a high quality service with a culture of continuous quality improvement and continuous professional development. We provide a 24hours/7days working week in order to maximise service delivery, so a flexible approach is essential together with enthusiasm and self-motivation.&lt;br /&gt;&lt;br /&gt;Blackpool Teaching Hospitals NHS Foundation Trust is a large tertiary referral centre for cardiac patients and has 10 General Imaging rooms, a Dexa scanner, a Dental room, Mobile and Theatres, 9 Ultrasound rooms, 3 CT Scanners, 2 MRI scanners, 2 Gamma Cameras, a Mammography suite and an Interventional suite with an excellent reputation for staff development opportunities.&lt;/p&gt;\n&lt;p&gt;Hours of duty &lt;br /&gt;• 37.5hrs Agenda for Change terms and conditions.&lt;br /&gt;• The candidate must be registered with the HCPC.&lt;br /&gt;• Working hours will be flexible and may form part of a 24/7 shift system.&lt;/p&gt;\n&lt;p&gt;We are happy to arrange informal visits to the department to allow you to meet the team, view the facilities and discuss the job role in more detail.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE Shortlisted candidates will be expected to attend in person for interview at Blackpool Victoria Hospital&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria BradeAdditional contact information&lt;/p&gt;\n&lt;p&gt;Victoria Brade, General X-Ray Manager on 01253 955295&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249445", "validThrough": "2020-11-13T23:59:59+0000"}