{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23000", "minValue": "19000", "unitText": "YEAR", "value": "£19,000 - £23,000 pro rata"}}, "datePosted": "2020-10-09T16:17:55+0100", "description": "&lt;p&gt;Circle Integrated Care are a leading healthcare provider in the UK, delivering specialist care in the community, closer to patient’s homes.  In our Wolverhampton community dermatology service, we manage a large array of adult skin conditions (all non-cancer patients), enabling patients to get rapid access to expert diagnosis, advice and treatment, without having to go to their local hospital.  Our multidisciplinary team work together with the patient to offer treatments including excisions and biopsies, cryotherapy, patch testing, light therapy, PDT in addition to specialist prescribing and monitoring of patients on Biologics and DMARDS.&lt;/p&gt;\n&lt;p&gt;We are looking for a Healthcare Assistant to join our forward thinking and motivated clinical team that deliver high quality, innovative pathways, that put the patient at the centre of their care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Role &amp; Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be part of a forward thinking, innovative team, delivering high quality, best practice dermatology treatment to NHS patients in Wolverhampton. The service is focused on continuous improvement and providing quality driven care to patients.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, enthusiastic, motivated Healthcare assistant, who can provide a first point of contact for patients within the community, playing a key role in ensuring that the service runs smoothly and efficiently from a nursing perspective, and prioritising the workload appropriately. The post holder requires a flexible approach to work and be able to prioritise patient care whilst carrying our tasks in support of being supervised by a Registered Nurse and will contribute to the excellence of care.&lt;/p&gt;\n&lt;p&gt;You will need to be well organised, have excellent verbal and IT communication skills, flexible to meet the needs of the service and provide support to other members of the team as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Part time 24 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Spec&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To verbally report to senior nursing staff regarding the patients in the clinics as necessary.&lt;/li&gt;\n&lt;li&gt;To ensure that patients are helped to retain their dignity and individuality.&lt;/li&gt;\n&lt;li&gt;To provide support and assistance to professionals when they are performing specific therapies, clinical treatments and investigative programmes for patients&lt;/li&gt;\n&lt;li&gt;To communicate positively and tactfully with patients, their relatives, carers and visitors.&lt;/li&gt;\n&lt;li&gt;To assist and support patients as they move from one care setting to another, e.g. department to diagnostic testing.&lt;/li&gt;\n&lt;li&gt;With appropriate training undertake blood pressure recording and simple dressings&lt;/li&gt;\n&lt;li&gt;To assist with patients’ basic care needs including maintaining personal hygiene, accessing and using toilet facilities if required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Person Specification:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Evidence of good standard of general education&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of excellent patient/customer service&lt;/li&gt;\n&lt;li&gt;Effective communication skills in English –both written and verbal&lt;/li&gt;\n&lt;li&gt;Ability to use own initiative when appropriate&lt;/li&gt;\n&lt;li&gt;Caring, committed and adaptable&lt;/li&gt;\n&lt;li&gt;Confidence to deal with patients and members of the public&lt;/li&gt;\n&lt;li&gt;Willingness to learn new skills through practical experience&lt;/li&gt;\n&lt;li&gt;IT skills and awareness&lt;/li&gt;\n&lt;li&gt;Moving and Handling of Patients will be required in this role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days’ annual leave pro rata with additional days for long-term service&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme: save money on a new bike and benefit from interest-free instalments&lt;/li&gt;\n&lt;li&gt;Private pension scheme helping your to live well in retirement&lt;/li&gt;\n&lt;li&gt;Employee assistance programme: get confidential support 24/7&lt;/li&gt;\n&lt;li&gt;Private medical insurance to help you get any treatment you need quickly&lt;/li&gt;\n&lt;li&gt;Non-contributory life assurance and income protection insurance&lt;/li&gt;\n&lt;li&gt;Perkbox for employee discounts at a range of retailers, restaurants and other services&lt;/li&gt;\n&lt;li&gt;Season ticket loan: get the benefit of an annual ticket and pay the cost over 12 months&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV13 3SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5909", "longitude": "-2.08518"}}, "title": "HCA Community Clinics Dermatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221079", "validThrough": "2020-11-06T23:59:59+0000"}