{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-06T14:30:56+0100", "description": "&lt;p&gt;&lt;strong&gt;We are currently looking for a part time (30 hours per week) proactive Staff Nurse, who will join our team on Trafford Ward. If you are looking for a dynamic role where you are able to showcase your high level of patient care, as well as your strong team work ethic, this is a fantastic opportunity to demonstrate added value in a challenging environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is eligible for a £1500 New Hire Bonus. Please see attached New Hire Bonus Terms &amp; Conditions for further information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to the Trafford Ward Manager, you will assist the team to deliver personal care to our patients who have a variety of rehabilitation needs for Cambridgeshire and Peterborough NHS Foundation Trust (CPFT). Working with a team of passionate and dedicated Health Care professionals, you will be responsible for delivering a high level of care to the patients in our community wards. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Ensure the delivery of high quality, patient focused care and treatment which promotes the “Essence of Care” and “Standards for Better Health” principles.&lt;/p&gt;\n&lt;p&gt;-Ensure Expected Date of Discharge (EDD) is set through negotiation between patient, carer, team and internal/external agencies to achieve a safe and effective discharge which closely meets the patient’s needs.&lt;/p&gt;\n&lt;p&gt;- Communicate effectively with patients and their families /carers&lt;/p&gt;\n&lt;p&gt;- Ensure delivery of effective patient centered care programmes, through appropriate leadership&lt;/p&gt;\n&lt;p&gt;- Ensure monitoring of quality and compliance with standards is demonstrable within the service on an ongoing basis.&lt;/p&gt;\n&lt;p&gt;- To maintain a safe and healthy environment for patients/ clients, visitors and staff.&lt;/p&gt;\n&lt;p&gt;- To comply with the Professional Codes of Conduct and to be aware of changes in these. To maintain up to date knowledge of all relevant legislation and local policies and procedures implementing this.&lt;/p&gt;\n&lt;p&gt;-To ensure that all duties are carried out to the highest standard and in accordance with current quality initiatives within the work area.&lt;/p&gt;\n&lt;p&gt;-To comply with all relevant Trust policies, procedures and guidelines, including those relating to Equal Opportunities, Health and Safety and Confidentiality of Information and to be aware of any changes in these.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Cambridgeshire and Peterborough NHF Foundation Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) we are dedicated to providing high quality care with compassion. We deliver many of the NHS services that are provided outside of hospital and in the community such as physical, mental health and specialist services. Together with global, national and local partners we conduct high-quality and ground-breaking research into mental and physical health and support innovation to improve patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We strive to improve the health and wellbeing of the people we care for, our staff and members, to support and empower them to lead a fulfilling life. We employ highly talented, experienced and motivated people from diverse backgrounds. We are committed to developing strong and positive relationships with the communities we live and work in. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you bring?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Demonstrable communication skills across all levels, utilizing a confident and articulate approach&lt;/p&gt;\n&lt;p&gt;- Self-awareness and sense of accountability&lt;/p&gt;\n&lt;p&gt;- Ability to work under pressure within a challenging environment&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s on offer?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Attractive Salary&lt;/p&gt;\n&lt;p&gt;- Opportunities for Career Progression within the Trust&lt;/p&gt;\n&lt;p&gt;- An inclusive and safety focused culture&lt;/p&gt;\n&lt;p&gt;We are committed to building a diverse environment. You will receive consideration for employment without regard to race, religion, gender, gender identity of expression, sexual orientation, national origin, disability or age.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sandra Dade - 01945 468777&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Cambridgeshire Hospital, Wisbech", "postalCode": "PE13 3AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.665", "longitude": ".164213"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215042", "validThrough": "2020-11-12T23:59:59+0000"}