{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-04T10:15:14+0000", "description": "&lt;p&gt;We are looking for a number of forward thinking senior information specialists to join our expanding BI team here at NECS. This exciting role will be supporting a range of diverse and proactive projects as part of an ambitious work programme including; the provision of Population Health Management analytical support, pandemic analysis, forecasting and modelling, health needs assessment analytics working with health and justice, as well as working closely with the key clinical work streams supporting the Integrated care systems across the North East and Cumbria and nationally.&lt;br /&gt; &lt;br /&gt; Building on our already extensive skills and experience in the current BI service, we welcome applications from inside and outside the NHS including those with public health knowledge, skills and experience, as well as those interested in furthering their data science skills and expertise in a health and care setting.&lt;br /&gt; &lt;br /&gt; If you are proactive, have excellent technical and analytical capability, and are looking for your next challenge then we look forward to hearing from you.&lt;br /&gt; &lt;br /&gt; The role would be working flexibly in a remote setting initially, and we welcome applications from those who would be interested in secondment opportunities as well as those wanting a permanent or a fixed term role. The role would be based with our friendly, dynamic and knowledgeable BI projects team within the wider NECS BI service.&lt;br /&gt; &lt;br /&gt; If you have any queries around the role then please get in touch with:&lt;br /&gt; &lt;br /&gt; Kim Teasdale&lt;br /&gt; &lt;br /&gt; Deputy Head of Information Services&lt;br /&gt; &lt;br /&gt; kimteasdale@nhs.net&lt;br /&gt; &lt;br /&gt; 07342 084125&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DURHAM", "postalCode": "DH1 3YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.764", "longitude": "-1.57002"}}, "title": "Principle Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255325", "validThrough": "2020-11-11T23:59:59+0000"}