{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T13:16:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Early Intervention in Psychosis Service Nurse Lead Practitioner Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a compassionate, empathic and experienced nurse to work within a dynamic MDT supporting people experiencing first episode psychosis and, their carers and families in North West Sussex and Mid Sussex. The base for this post is Horsham however the team regularly works flexibly and remotely using a range of digital solutions for meetings and consultations.&lt;/p&gt;\n&lt;p&gt;You will support a caseload of clients by way of effective care co-ordination and offering recovery focussed psychosocial interventions across a variety of settings. Previous experience of supporting clients with psychosis and complex mental health and social care problems is required. You need to have a real commitment to and understanding of the principles of early intervention and this client group.&lt;/p&gt;\n&lt;p&gt;You will be supported by the team leader, existing senior nursing staff and the wider MDT via clinical supervision, managerial supervision, professional supervision, daily MDT zoning meetings and risk discussions, reflective practice discussions and case formulation meetings.&lt;/p&gt;\n&lt;p&gt;We offer a real commitment to support your continuing professional development through a variety of internal and external training opportunities and university accredited courses. &lt;span&gt;This is an exciting time to join our expanding service. If you have the enthusiasm, passion and commitment to support our service users, their families and the service we would love to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lee Raynor-Bright&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;lee.raynor-bright@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;07392195392&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Park House, Horsham", "postalCode": "RH12 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0643", "longitude": "-.324102"}}, "title": "Lead Practitioner Early Intervention in Psychosis - Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252204", "validThrough": "2020-11-16T23:59:59+0000"}