{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-04T16:01:10+0000", "description": "&lt;p&gt;Do you want to learn? Do you want to feel part of a team?&lt;/p&gt;\n&lt;p&gt;Then the newly created ward 5 is the ward for you!&lt;/p&gt;\n&lt;p&gt;Amazing opportunities have arisen for newly-qualified and experienced staff nurses wanting to develop their skills and knowledge in Diabetes and Endocrinology Medicine.&lt;/p&gt;\n&lt;p&gt;We have an established nursing team who strive to provide an excellent standard of care to all patients, that team now needs to grow. Applications from dynamic individuals with strong interpersonal skills that will look forward to the challenges of nursing. We love making a difference and working together as a close family to gain the rewards of making a patients journey enjoyable and successful.&lt;/p&gt;\n&lt;p&gt;As an individual, you will need to be able to maintain a focus on patients at all times, and provide a motivated attitude. Lancashire Teaching Hospitals Trust is one of the largest trusts within the North West of England. We are a Trust that delivers award winning teaching and development pathways, we lead international clinical trials and research studies in order to give excellent care with compassion. This will enable you to have an unparalleled opportunity to learn, grow and flourish in supportive and innovative environment, whilst also working with some of the UKs leading health experts.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a great opportunity to broaden your skills and knowledge and gain experience within a specialised treatment. I&lt;/span&gt;f you have a passion for Diabetes and Endocrinology Medicine, then this is the job for you.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Want to chat about the role? We&#39;d love to hear from you! Call Emma our fabulous Ward Manager on &lt;span&gt; 01772 522661&lt;/span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Interview Date : TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma BeachamJob titleWard ManagerEmail addressemma.beacham@lthtr.nhs.ukTelephone number01772522661&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information contact Ward Manger Emma Beacham 01772 522661 or Matron Chris Winster 01772523052&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Staff Nurse - Diabetes and Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256544", "validThrough": "2020-11-18T23:59:59+0000"}