{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T15:31:11+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced, motivated administrator to join the Joint EPR (Electronic Patient Record) Team, working across both Bradford and Calderdale and Huddersfield Foundation Hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will involve working closely with EPR Team colleagues, supporting and providing a comprehensive administrative service. The post holder will be responsible for managing diaries, arranging meetings, minute taking and other administrative tasks as outlined in the job description and person spec. The role will also be responsible for managing and maintaining the EPR Standard Operating Procedures (SOPs), ensuring the process for the SOPs is robust, updating documents and uploading documents on to web pages.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced administrator who must have excellent typing skills, be able to take minutes, be experienced in arranging appointments, managing diaries and be able to organise and prioritise their own workload in order to meet deadlines. A good knowledge of Microsoft Office is essential. The successful candidate is required to be able to demonstrate the Trust values, the responsibilities of the job description and person specification. Please note there will be a short assessment at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview dates and timings will be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatherine NuttallJob titleEPR Benefits and Change ManagerEmail addresskatherine.nuttall@bthft.nhs.ukTelephone number07949084081&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford and Calderdale", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Joint EPR Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258337", "validThrough": "2020-11-24T23:59:59+0000"}