{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16625", "minValue": "16625", "unitText": "YEAR", "value": "£9.89 per hour"}}, "datePosted": "2020-10-19T16:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Part-Time, Permanent contracts available: 144 hours per month&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Night Shift Positions (10pm - 6am) in Mid Essex area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date:TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Marie Curie provides free specialist support and care for patients with cancer and other life limiting conditions, and their families. We aim to give patients the best possible quality of life, meeting their medical, spiritual and social needs, while also providing their families with the emotional support they need.&lt;/p&gt;\n&lt;p&gt;To join our dedicated, caring team, you&#39;ll need an S/NVQ Level 2/3 qualification or an equivalent certificate/diploma, or be willing to work towards it, and relevant experience - ideally within a care setting. Emotional strength and the ability to work on your own are crucial, though we will of course provide excellent on-going training and support. We expect you to have a talent for forging strong empathetic relationships with all kinds of people, whilst providing palliative care. Due to the nature of the role a flexible approach including the ability to work nights is essential, as is access and use of a car is essential and access to a computer and the internet.&lt;/p&gt;\n&lt;p&gt;Please click the link to view the Job Description and apply online today!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;For more information or an informal chat contact our CNMLaila Loveday on 07515133313&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Every day of your life matters - from the first to the last. When you work for Marie Curie, you understand that better than ever. We&#39;re a passionate, committed and diverse team of more than 4,400 staff and 12,000 volunteers, here for people living with any terminal illness, and their families. We offer expert care, guidance and support, to help them get the most from the time they have left.&lt;/p&gt;\n&lt;p&gt;Marie Curie is committed to its values, which underpin our work. We take stringent steps to ensure that the people who join our organisation through employment or volunteering, are suitable for their roles and are committed to safeguarding all our people from harm. This includes our staff, volunteers and all those who use or come into contact with our services. We are dedicated to creating not just a safe place to work but also a supportive and rewarding one.&lt;/p&gt;\n&lt;p&gt;Marie Curie is We are committed to a world where everyone can thrive and fulfil their potential. We are devoted to the social justice imperatives and organisational benefits of full diversity, inclusion and equity in the workplace, and are a Stonewall champion. We actively encourage and welcome applications from candidates of diverse cultures, perspectives and lived experiences.&lt;/p&gt;\n&lt;p&gt;This role will be subject to receiving a satisfactory Enhanced criminal record check.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this vacancy early. Agencies need not apply&lt;/em&gt;&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Marie Curie", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129502"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mid Essex", "postalCode": "SS11"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6215", "longitude": ".552152"}}, "title": "Healthcare Assistant - Planned Service - Mid-Essex", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233114", "validThrough": "2020-11-16T23:59:59+0000"}