{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-26T11:46:41+0000", "description": "&lt;p&gt;SRFT has recently become the provider of Upper GI Surgical services across Greater Manchester. The Service has been divided into 3 sectors and this post will lead a Sector Team from the Surgical Centre.&lt;/p&gt;\n&lt;p&gt;The Upper GI Cancer Highly Specialist Nurse is a core member of the Oesophago-gastric multi-disciplinary team. They will lead and manage a caseload of patients to provide specialist information, advice and support to patients, carers and staff. The role involves co-ordination of patient’s pathways education and holistic assessment of patients with Upper GI cancer and complex benign disease.&lt;/p&gt;\n&lt;p&gt;The role will include service development and improvement, research/audit and patient/user feedback.&lt;/p&gt;\n&lt;p&gt;We welcome applications from highly motivated and experienced cancer nurses who ideally have worked as a Clinical Nurse Specialist before. In depth knowledge related to Upper GI cancer is essential.&lt;/p&gt;\n&lt;p&gt;Knowledge and experience of the Cancer Recovery Package is desirable.&lt;/p&gt;\n&lt;p&gt;Interested applicants must be a Registered Nurse and hold relevant experience in Upper GI Surgery and Palliative Care. A cancer qualification would be advantageous. Must have either completed or be willing to undertake Non- Medical Prescribing and other relevant modules such as clinical assessment skills.&lt;/p&gt;\n&lt;p&gt;Accredited communication skills course and a recognised teaching qualification is an advantage.&lt;/p&gt;\n&lt;p&gt;Candidates must be able to demonstrate excellent communication and interpersonal skills and provide evidence of working autonomously as well as part of a team.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a stimulating work environment with a commitment to multidisciplinary working and continuing professional development.&lt;/p&gt;\n&lt;p&gt;We are innovative and forward thinking; we can offer support and development, a committed pro-active nursing management team and opportunities to specialise in a city wide service.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups, individuals with disabilities and women are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Michelle Eden-Yates Job title Lead Nurse UGI Email address michelle.eden@srft.nhs.uk Telephone number 0161 206 5062 Additional contact information&lt;/p&gt;\n&lt;p&gt;Michelle Eden-Yates&lt;/p&gt;\n&lt;p&gt;michelle.eden@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 206 5062&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Highly Specialist Nurse - Upper GI Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242274", "validThrough": "2020-11-09T23:59:59+0000"}