{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-10-08T11:45:24+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a part-time Mental Health Practitioner to be a part of a supportive and innovative child and adolescent mental health service (CAMHS) in Southampton.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;We are looking for a Nurse&lt;/strong&gt;&lt;strong&gt;, Social Worker&lt;/strong&gt;&lt;strong&gt; or Allied Health Professional with post qualifying experience working in mental health. &lt;/strong&gt;This is a great opportunity to join our team in Solent NHS Trust Children &amp; Families Service line to support in the delivery of high-quality children’s mental health services. We are looking for exceptional individuals with the right attitude, skills and knowledge who share our passion to deliver the best quality care experience for children and their families.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will have duties related to the clinical delivery of care to children, young people and their families accessing the CAMHS team and calls for a professional with experience of working with children, young people and their families experiencing mental health and trauma difficulties. Part of the job plan will include participating in generic CAMHS work, including participating in the duty rota and undertaking initial assessments for the service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The CAMHS team is a strong and supportive team and has excellent structures to offer regular supervision. &lt;/span&gt;You will be working alongside an established team at an important time in our development. It really is an exciting time to be joining us as we push forward with implementing new ways of working in order to best meet the needs of the population we work with. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you wish to have an informal conversation regarding the post please contact Satty Basra on 02381 030061.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Appointment to the post will be through application, and competency based interview process to be held on a date to be confirmed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt; If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt; Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218104", "validThrough": "2020-11-08T23:59:59+0000"}