{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T11:45:22+0000", "description": "&lt;p&gt;&lt;span&gt;Spectrum is looking for a motivated, enthusiastic nurse to join the clinical team in Wakefield Integrated Sexual Health Service. You will work closely with the Head of Service and Clinical Lead to ensure that there is high quality, evidence-based provision of integrated sexual health services across the clinical team. Wakefield Integrated Sexual Health Service is a team with aspirations for providing an excellent care model. If you are committed to patient care and enjoy working as part of a professional and dedicated team, we would like to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should possess formal qualifications and experience in the delivery of both contraception (including LARCs) &amp; sexually transmitted infection management. Ideally you will have completed your non-medical prescribing course (or willing to work towards). The post will also include the management of more complex patients referred in through the Outreach Provision. In return Spectrum has excellent terms and conditions, taking continuous NHS service into account for things such as annual leave, and we are part of the NHS Pension Scheme. All staff members are provided with a work laptop and you will also have the use of free, safe and secure staff car park. The clinic is located within Trinity walk shopping centre and is surrounded by high street shops, coffee shops, sandwich shops and restaurants. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 1QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6836", "longitude": "-1.49449"}}, "title": "Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251869", "validThrough": "2020-11-15T23:59:59+0000"}