{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46000", "minValue": "46000", "unitText": "YEAR", "value": "Up to £46,000 Depending on Experience"}}, "datePosted": "2020-10-02T11:05:54+0100", "description": "&lt;p&gt;The Priory Hospital Middleton St George is located in Darlington, County Durham and provides individualised treatment and care for people with mental health needs of adult working age and who present with complex and challenging behaviours, in a safe and supportive environment. Our comprehensive integrated services offer complete care pathways allowing service users to transfer effortlessly between the most appropriate care, meeting individual needs enabling recovery and re-engagement within the community and maximising life opportunities.&lt;/p&gt;\n&lt;p&gt;Our multi-disciplinary teams provide care for up to 101 male and female service users, working collaboratively with their commissioners, across our 7 wards and our nearby community house. We deliver Complex care recovery and rehabilitation services which include a specialist female Personality Disorder service, we also have a 22 bedded mixed gender acute ward and a female only acute ward which have a very high throughput of patients referred form all over Britain. We have recently opened two new PICU units (one male and one female). Our focus is on the delivery of excellent care, empowering service users to progress towards the least restrictive setting and towards independence. Our vision is to place our Service Users at the heart of our service provision, working closely with them and their carers to support their recovery and rehabilitation.&lt;/p&gt;\n&lt;p&gt;Of most recent note we have been assessed as &quot;outstanding&quot; by the CQC in November 2018 and we aim to continue to improve on our levels of performance and care delivery throughout 2020 and the coming years.&lt;/p&gt;\n&lt;p&gt;A new and exciting opportunity has arisen for a substantially motivated, experienced and skilled Nurse with leadership skills to work with us at Middleton St George.&lt;/p&gt;\n&lt;p&gt;Reporting to our Director of Clinical Services the Out of Hours Site Coordinator will work alongside the Unit Managers and coordinate the safe and appropriate management of the site throughout the night time delivery of care.&lt;/p&gt;\n&lt;p&gt;In this role you will be responsible for overseeing the hospital at night, providing leadership and support to the ward based nursing teams, and clinical supervision as and when required. You will ensure that a high standard of patient care is provided and that the site complies with all quality standards and statutory requirements throughout the night shift.&lt;/p&gt;\n&lt;p&gt;Our hospital encompasses 7 wards, 4 of which are 24 hour admission wards. The successful candidate therefore must be competent in the management of referrals and be able to prioritise admissions.&lt;/p&gt;\n&lt;p&gt;Essential criteria:&lt;/p&gt;\n&lt;p&gt;. RMN / RNLD&lt;/p&gt;\n&lt;p&gt;. Post registration experience ideally of working in more than one of the clinical areas provided at the hospital&lt;/p&gt;\n&lt;p&gt;. Experience of working as a Deputy Manager / senior nurse or equivalent role&lt;/p&gt;\n&lt;p&gt;. Good working knowledge of the Mental Health Act&lt;/p&gt;\n&lt;p&gt;. Ability to undertake physical requirements of PMVA&lt;/p&gt;\n&lt;p&gt;. Ability to be responsive and flexible&lt;/p&gt;\n&lt;p&gt;. We are looking for someone that can lead the hospital at night and ensure the principals of safe delivery are adhered to at all times.&lt;/p&gt;\n&lt;p&gt;Desirable Criteria&lt;/p&gt;\n&lt;p&gt;. Experience working in PICU / HDU / LS&lt;/p&gt;\n&lt;p&gt;. Experience of working in Acute services&lt;/p&gt;\n&lt;p&gt;. Experience on working in Complex Care Rehabilitation and Recovery&lt;/p&gt;\n&lt;p&gt;As a Manager in this environment you will provide Clinical Management and Leadership of the full nursing team on the site, this includes being a highly visible role model and mentor to the nursing team. You will have responsibility for overseeing and maintaining the highest standards of nursing care during your duties. The role will act as a senior clinical member of the team, providing advice and support from a nursing perspective and oversee and hold responsibility for the site environment and its resources while on duty.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have proven leadership skills along with a strong drive to develop and support the dedicated nursing team within the therapeutic milieu. This is an exciting and unique opportunity to work within a talented multidisciplinary team and will be responsible for ensuring that the nursing team possesses the skills, knowledge and motivation to offer and deliver the highest quality of care to service users with complex mental health and their families during the night time hours of delivery.&lt;/p&gt;\n&lt;p&gt;The successful candidate must possess excellent clinical, team and communication skills together with vision and enthusiasm to work to the hospital&#39;s service model. The successful candidate should be RMN qualified and have a minimum of 3 years’ experience within a related role. You need to be able to demonstrate the quality and management of nursing care, patient care and the clinical environment with added responsibility to ensure that the site is safely staffed throughout the night time delivery. The successful applicant will be a forward-thinking senior nurse, who will lead staff by example.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide Clinical Leadership whilst ensuring the CQC regulations, outcomes and judgement framework are adhered to at all times.&lt;/p&gt;\n&lt;p&gt;In return the successful candidate will have the opportunity to join a prestigious and dynamic Healthcare organisation at an exciting time of growth. Your contribution will be recognised and rewarded with job satisfaction, a productive working culture and opportunities for structured professional and personal development.&lt;/p&gt;\n&lt;p&gt;What we’d like to give you:&lt;/p&gt;\n&lt;p&gt;• A competitive salary&lt;/p&gt;\n&lt;p&gt;• Disclosure check cost coverage&lt;/p&gt;\n&lt;p&gt;• Comprehensive induction and commitment to ongoing training&lt;/p&gt;\n&lt;p&gt;• 25 days annual leave plus bank holidays (increasing with service)&lt;/p&gt;\n&lt;p&gt;• Birthday Holiday - Your Birthday as an extra day’s annual leave&lt;/p&gt;\n&lt;p&gt;• Free on-site parking&lt;/p&gt;\n&lt;p&gt;• Access to our on-site gymnasium&lt;/p&gt;\n&lt;p&gt;• Online benefits and cashback rewards&lt;/p&gt;\n&lt;p&gt;• Cycle to work scheme&lt;/p&gt;\n&lt;p&gt;• SMART Pension option&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DARLINGTON", "postalCode": "DL2 1TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5172", "longitude": "-1.43348"}}, "title": "Out of Hours Site Coordinator (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210209", "validThrough": "2020-11-27T23:59:59+0000"}