{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-05T17:00:51+0000", "description": "&lt;p&gt;*** Applications through our retained search partner, CY Executive Resourcing ***&lt;/p&gt;\n&lt;p&gt;University Hospitals of Leicester NHS Trust is one of the largest NHS Trusts in the country and this is an opportunity to play a leading role in their large scale change programme and be part of the success story.&lt;/p&gt;\n&lt;p&gt;This newly created role further underpins the Trust’s commitment to strengthen its Senior Management Team (SMT) and to develop a world class Finance and Procurement function. As part of the SMT, you will work closely with the Chief Financial Officer and Director of Operational Finance in building a high performing team and culture.&lt;/p&gt;\n&lt;p&gt;Your portfolio will include Financial Management, Financial Planning &amp; Analysis and Costing and Service Line Reporting.&lt;/p&gt;\n&lt;p&gt;Key focuses will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The development and delivery of a robust and commercially focused business partnering model&lt;/li&gt;\n&lt;li&gt;Leading the Financial Operational Planning process&lt;/li&gt;\n&lt;li&gt;Supporting the Trust’s Quality and Efficiency Improvement Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be working closely with the Executive Team across many key areas and so will need to evidence your track record of communicating with, advising and influencing non-finance Executives.&lt;/p&gt;\n&lt;p&gt;You will be managing a diverse team and, as an experienced senior leader, you must demonstrate your ability to lead from the front, growing a team and culture that aligns to the Trust’s strategic aims and ambitions.&lt;/p&gt;\n&lt;p&gt;To be considered for this role, you must be a qualified accountant and have a track record for delivery within a large and highly complex organisation.&lt;/p&gt;\n&lt;p&gt;Applications are transferred to CY Executive Resourcing and TRAC, by completing an application you authorise the transfer of your data. Emails regarding applications will be sent via TRAC.&lt;/p&gt;\n&lt;p&gt;For a confidential conversation and to discuss the role further, please contact Vural Aglamaz (CY Executive Resourcing) on Mobile 07772 553493 or E-mail: Vural.Aglamaz@cyresourcing.com.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Deputy Director of Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258662", "validThrough": "2020-11-17T23:59:59+0000"}