{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-01T19:56:51+0000", "description": "&lt;h1&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you be interested in an opportunity to develop your career in a CAMHS Senior Management role?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Have you got experience, skills and expertise in the Children’s mental health service?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you interested in working with others in CAMHS and CFHD through an exciting time of change and growth?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an internal candidate to undertake a secondment opportunity to a full time Band 8a CAMHS Senior Manager role until the end of March 2021, Senior Manager CAMHS Acute, Crisis and OOH (Base to be negotiated).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working with the Senior Management team, you will be supported to bring your skills, experience and enthusiasm to this role. You will supervise and manage others, ensuring the service responds in a timely way to meet the needs of children/young people with complex social, emotional and mental health.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to undertake a secondment as we have opportunities for service development and growth, but it is also a challenging time managing a range of service pressures, winter and COVID responses. You’ll need a sense of humour, the ability to work with others and a dedication to lead compassionately focusing on the needs of the child. On the wish list is experience in operational management, leadership of multi-disciplinary teams, management of risk/complaints /incidents, HR policy knowledge, strategic understanding of the CAMHS context and more! However as a secondment opportunity we will also be looking for willingness to learn, awareness of your own strengths/development needs, ability to communicate with others in a range of formats and a compassionate dedication to look after staff and service users, recognising the balance between operational and clinical pressures.&lt;/p&gt;\n&lt;p&gt;So if you want a challenge and a development opportunity and want to join a leadership team who are hard working and keen to make a difference, please put your hat in the ring and your toe in the secondment water.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to learn more about the post please contact Sonja Upton, CAMHS Interim Head of Service, at sonja.upton@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interview date is 25th November.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Children and Young People say…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We would like the people who work for Child and Family Health Devon to be understanding, patient and respectful. They should be trustworthy and make us feel safe and comfortable. It is important that they use their skills and experience to listen carefully in a non-patronising and non-judgemental way. When staff are positive and friendly, they help to create an environment that is informal and without pressure”.&lt;/em&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be an experienced and qualified CAMHS lead with a core registrable qualification and experience of leading teams who are working with complex mental health need in a community CAMHS setting. The ability to communicate with staff, service users, outside agencies and commissioners is important as is the ability to understand and present information in a range of formats and contexts.&lt;/p&gt;\n&lt;p&gt;Managing staff will be a key component of the role with the ability to support others, oversee caseloads, and ensure the service responds in a timely way to urgent and routine, planned and unplanned need. You will undertake relevant audit, analyse and produce data / reports and use rostering and electronic staff records systems&lt;/p&gt;\n&lt;p&gt;You will be responsible for ensuring the service provides strengths-focused, evidence-based and tailored interventions to meet the needs of the child/young person and their family/carer.&lt;/p&gt;\n&lt;p&gt;We’re looking for an individual who are passionate about leading teams, innovating and developing good practice to meet the needs of children and families. You must be able to contribute to the CAMHS Out of Hours rota so that we can, together, provide support to children in crisis when they need it.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;In this role, you will be working for the CAMHS Service, which is part of Children and Family Health Devon. This Alliance has designed a system-wide service model to deliver integrated, coordinated support wrapped around the child, young person and family. It builds on our strong relationships across education, health, social care and voluntary sector services in Devon, and, most importantly, it has been developed and refined in partnership with children, young people and their families/carers.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This position offers the opportunity for career development. There will be specific CPD and training events developed to support you that are tailored to your individual needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Commitment to career development&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wide range of leadership development opportunities&lt;/li&gt;\n&lt;li&gt;Up to &lt;strong&gt;41 days of paid leave &lt;/strong&gt;per year, depending on length of NHS service, includes bank holidays&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;NHS pension scheme &lt;/strong&gt;with employer contributions of up to 14.5% of pensionable pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS pay &lt;/strong&gt;progression&lt;/li&gt;\n&lt;li&gt;Good &lt;strong&gt;maternity, paternity and adoption leave &lt;/strong&gt;over and above the statutory minimum requirements&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sick pay &lt;/strong&gt;up to a maximum of six months full pay and six months half pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Childcare vouchers&lt;/strong&gt;– annual savings of up to £1,19&lt;/li&gt;\n&lt;li&gt;Commitment to &lt;strong&gt;flexible working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;24/7 free &lt;strong&gt;confidential advice &lt;/strong&gt;and &lt;strong&gt;support service&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Freedom to speak up&lt;strong&gt;‘Guardian Service’&lt;/strong&gt;, enabling you to safely discuss any concerns impacting on patient care&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship schemes&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exclusive &lt;strong&gt;health service discounts &lt;/strong&gt;for NHS staff&lt;/li&gt;\n&lt;li&gt;Stagecoach –&lt;strong&gt;bus transport discounts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice &lt;strong&gt;cycle scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Access to free &lt;strong&gt;recovery and wellbeing courses&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Devon provides a unique, varied and beautiful environment. The coastal areas of North, South Devon and Torbay provide excellent opportunities for water sports. The National Parks, Dartmoor and Exmoor, are havens for country lovers. Exeter is a thriving University city offering culture and city life. There are excellent rail, road and air connections, with a regional airport in Exeter.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "CAMHS Senior Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251205", "validThrough": "2020-11-16T23:59:59+0000"}