{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa pro rata"}}, "datePosted": "2020-10-30T08:16:37+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a highly motivated, enthusiastic and clinically skilled senior nurse with a strong background in urology and continence services to join our urology specialist nursing team. The post holder will work cross-site at Maidstone and Tunbridge Wells Hospitals as the urology nurse practitioner and continence lead for the Trust. You will be in charge of writing policies and standard operating procedures, auditing and organising clinical trials for continence products, and be a source of information and advice for all staff. You will run urology continence clinics at both hospital sites, and run the nurse-led urodynamic service at Maidstone Hospital, so experience of this is essential. Flexible cystoscopy experience is desirable but training will be given if needed, with an aim to setting up a nurse-led intravesical Botox service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should possess excellent clinical assessment and communication skills, be visible and accessible with quality and standards as your priority. You will need to be flexible and resilient in order to cope with the demands of the role. You will be fully responsible for managing your own case load, and will be the line manager for the urology specialist nursing team. You should have a minimum of 2 years’ experience in a Sister/ Charge Nurse post or above, and evidence of working in a urology or continence setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Wednesday 18th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnnie MurphyJob titleMatron for Surgical SpecialitiesEmail addressannie.murphy2@nhs.netTelephone number07564 836414&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone hospital, Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Urology Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249350", "validThrough": "2020-11-13T23:59:59+0000"}