{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum plus HCA"}}, "datePosted": "2020-10-20T11:16:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Anatomical Pathology Technologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lewisham and Greenwich NHS Trust was formed on 1st October 2013, following the merger of Lewisham Healthcare NHS Trust and Queen Elizabeth Hospital Woolwich. We are a committed multi-professional team who provide much-valued hospital and community services as one organisation.&lt;/p&gt;\n&lt;p&gt;A full time vacancy has arisen for an energetic, compassionate and enthusiastic Anatomical Pathology Technician (APT) to join our busy but friendly bereavement and mortuary teams within the Cellular Pathology Department at Queen Elizabeth Hospital (QEH) Woolwich. However there is an expectation for staff to participate in cross site working if or when necessary. We provide an active consultant led perinatal pathology service to QEH and University Hospitals Lewisham (UHL). In return we can offer an excellent work environment in an HTA licenced, newly refurbished and modernised mortuary with newly installed fridges and freezers.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, experienced and methodical APT with RSPH Certificate and Diploma in Anatomical Pathology Technology. Applications will also be considered from candidates who are currently working towards the Level 4 Diploma. The post holder will assist in all aspects of the department including post mortem provision. Dignified patient admission and release is to be undertaken along with accurate completion of the mortuary registers and property books in line with the Trusts commitment to dignified end of life care. The successful candidate will communicate and liaise with clinical and non-clinical Trust staff, Chaplaincy, HM Coroners, Police, Funeral Directors and Consultant Histopathologists to ensure delivery of a professional and efficient mortuary service.&lt;/p&gt;\n&lt;p&gt;The department is ISO 15189 accredited with full support to maintain CPD. The pay band is based on AfC band 5 dependent of experience and qualifications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Elena Pollina, Lead Consultant on perinatal pathology T: 020 8836 5711 or Mrs Dalian Beaver, Cellular Pathology Manager on 020 8836 5683.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Hospital Woolwich, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "Anatomical Pathology Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234076", "validThrough": "2020-12-06T23:59:59+0000"}