{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 Progressive post band 6 to 7"}}, "datePosted": "2020-11-03T12:01:16+0000", "description": "&lt;p&gt;This post supports the Lead Antimicrobial Pharmacist in providing a clinical service to the HIV and Antimicrobial Stewardship team. It will be 0.5wte HIV and 0.5wte antimicrobial stewardship. &lt;strong&gt;This post is being offered as a band 6 to 7 progressive post with training to support the candidate to develop as a specialist pharmacist.&lt;/strong&gt;The post holder supports the HIV speciality and provides support to the antimicrobial stewardship team, acting as the department lead on HIV. The pharmacist works alongside other members of the multidisciplinary HIV and wider Antimicrobial Stewardship team, including consultants, junior doctors and a range of specialist nurses in areas such as infection prevention and control, HIV, and Medical Microbiology.&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall hospital pharmacy department is a forward thinking and friendly team with full deployment of electronic prescribing and administration in the inpatient and outpatient setting and fully automated dispensing. We provide an innovative clinical pharmacy service, combining technology and clinical pharmacy expertise. We are a recognised national leader for innovation in fields such as antimicrobial stewardship and the adoption of Scan4Safety standards. Royal Cornwall Hospital is working with other healthcare providers in Cornwall to develop research capacity in the non-medical workforce which aims to improve care for Cornwall’s patients. RCHT is one of the main clinical teaching sites for the University of Exeter Medical School, having students from year 2-5. The post holder will provide weekly interactive HIV teaching sessions for year 3 medical students and to lecture across all years on Antimicrobials.&lt;/p&gt;\n&lt;p&gt;Cornwall is a wonderful place to live, offering an excellent quality of life and a truly stunning environment to live in. We have a vision of an integrated Cornwall pharmacy service and will expect our clinical pharmacists to work across organisational boundaries to achieve the best outcomes for our patients.&lt;/p&gt;\n&lt;p&gt;This is a fulltime post of 37.5 hours per week, however flexible working and job-share will be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen McClay, Head of Clinical Pharmacy Services, Royal Cornwall Hospital on 01872 255997 or email helen.mcclay1@nhs.net or Neil Powell, Consultant Antimicrobial Pharmacist on 01872 252590 or email neil.powell2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "SPECIALIST HIV &amp; ANTIMICROBIAL SPECIALIST PHARMACIST", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253867", "validThrough": "2020-11-15T23:59:59+0000"}