{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum (YC72)"}}, "datePosted": "2020-10-12T15:02:36+0100", "description": "&lt;p&gt;The two posts are replacement, whole time, Consultant Medical Microbiologists employed by St Helens &amp; Knowsley Teaching Hospitals NHS Trust (STHK). The two successful candidates will join a team of four WTE Consultants working across the two Trusts, St Helens &amp; Knowsley Teaching Hospitals NHS Trust and Southport and Ormskirk Hospital NHS Trust. The two posts shall be based at Southport and Ormskirk Hospital NHS Trust.&lt;/p&gt;\n&lt;p&gt;The Pathology Directorate is within the Clinical Support Services Care Group and provides the services to STHK and Southport &amp; Ormskirk Hospitals Trust (SOHT) as well as direct access.&lt;/p&gt;\n&lt;p&gt;The Microbiology laboratory is located on a single site at Whiston Hospital.&lt;/p&gt;\n&lt;p&gt;The Trust has excellent management, robust systems and innovative processes all of which have underpinned a period of sustained and improved performance.&lt;/p&gt;\n&lt;p&gt;All applicants must possess FRCPath or equivalent, have training and broad experience in Microbiology including Virology and Infection Control.&lt;/p&gt;\n&lt;p&gt;Applicants must be eligible for full registration with the GMC at the time of appointment.&lt;/p&gt;\n&lt;p&gt;Applicants must have entry on the GMC Specialist Register via one of the following:&lt;/p&gt;\n&lt;p&gt;1) Certificate of Completion of Training (CCT)&lt;br /&gt;&lt;em&gt;(the proposed CCT date must be within 6 months if the interview)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;2) Certificate of Eligibility for Specialist Registration (CESR)&lt;br /&gt;&lt;em&gt;(CESR Candidates must have written GMC confirmation upon successful application)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – Inspection August 2018 and March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Friday 18th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Madhur Vardhan, Consultant Microbiologist, Clinical Lead Microbiology,&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;telephone 0151 430 1836, email: madhur.vardhan@sthk.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston Hospital, Prescot", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Consultant Medical Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222904", "validThrough": "2020-11-12T23:59:59+0000"}