{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62685", "minValue": "62685", "unitText": "YEAR", "value": "£62,685 pa"}}, "datePosted": "2020-11-03T10:15:23+0000", "description": "&lt;p&gt;&lt;span&gt;Synchronicity Care Limited (&lt;strong&gt;SCL&lt;/strong&gt;) is a wholly owned subsidiary of County Durham and Darlington NHS Foundation Trust (&lt;strong&gt;CDDFT&lt;/strong&gt;). SCL was established to provide estates, facilities management and procurement services to CDDFT.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;SCL is looking to appoint a Capital Projects Programme Manager on a full time basis 37.5 hrs. Per week on a fixed term basis of initially 12 months duration. To take lead responsibility for the Major Capital Development Programme as directed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates will have previous experience of acting as a senior manager, Capital Projects/Programme manager, or as a senior member of a Capital works team looking to develop their career in a challenging environment. You will provide leadership on all Capital Project matters enabling SCL to optimize performance and strategic growth, whilst delivering a robust and compliant projects function.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working closely with the SCL senior management, as well as liaising with the shareholder (CDDFT); and with other relevant bodies, such as external experts, advisors, designers, architects and contractors. You will be required to take control of all capital project aspects of the company strategy as well as ensuring all statutory obligations are met and maintained to high standard of corporate governance. You will work closely with the Projects managers/teams and related partner organisations for capital work.&lt;br /&gt; &lt;br /&gt; In addition to your technical skills you will be well versed in building strong internal relationships with key departments and stakeholders in the business.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Responsibilities:&lt;/span&gt;&lt;/span&gt;&lt;br /&gt;&lt;span&gt; Provide expert advice to the senior team on Capital Project issues;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Provide robust projects leadership and strategic management for Capital work;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ensuring the achievement of Capital Projects with the key strategic objectives and within agreed KPI’s;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Contribute to the development of the 5 year and annual planning cycles including backlog schemes;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Manage the development and delivery of the capital programme, including monthly progress, monitoring and financial reporting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;The successful applicant will have/be:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Masters/Degree level qualification or equivalent experience and recognised professional qualification &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent communication skills&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ability to handle high levels of pressure and critical decision making&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Delivery on time, within budget&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Highly motivated with a passion for excellence and innovation&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Confidence in presenting and progressing timely updates from the capital programme to senior management.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "CDD Services (Synchronicity Care Ltd)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Estates Capital Projects Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253387", "validThrough": "2020-11-10T23:59:59+0000"}