{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 £38,890 - £44,503 per annum, pro"}}, "datePosted": "2020-10-27T14:46:41+0000", "description": "&lt;p&gt;Band 6/7 depending on experience&lt;/p&gt;\n&lt;p&gt;Royal Manchester Children&#39;s Hospital is part of a leading Trust for teaching, research and specialist services in the North West of England. This is an excellent opportunity for an experienced physiotherapist with an interest in chronic pain. This post combines an operational team lead role as well as providing specialist physiotherapy management to patients with chronic pain referred by the paediatric rheumatology service.&lt;/p&gt;\n&lt;p&gt;As an HCPC registered health professional, you’ll have extensive clinical experience with children and young people working in a children’s hospital and/or community setting or experience of working with adults within the chronic pain specialty. As the clinical lead you will be responsible for the day to day management, co-ordination and provision of the physiotherapy inpatient and outpatient services for children and young people with chronic pain. You will have strong communication skills and be able to manage complaints positively and proactively.&lt;/p&gt;\n&lt;p&gt;The physiotherapists work very closely with the chronic pain occupational therapists and the wider multidisciplinary rheumatology team, giving a holistic approach to care.&lt;/p&gt;\n&lt;p&gt;You’ll be a flexible and resourceful individual assisting with cross cover across the wider children’s rheumatology service. You will have line management responsibility, and provide support and training to junior staff, students and be able to deal with challenging situations.&lt;/p&gt;\n&lt;p&gt;You will have a proven track record leading service developments and quality initiatives. You will take a lead role in educating parents and other health professions and participate in national specialist interest groups.&lt;/p&gt;\n&lt;p&gt;With excellent organisational and problem solving skills you’ll thrive in a busy environment prioritising a busy workload and coping well under pressure.&lt;/p&gt;\n&lt;p&gt;The department has a well-equipped department that includes a hydrotherapy pool. Participation in the physiotherapy respiratory/orthopaedic out of hour’s service is part of the role.&lt;/p&gt;\n&lt;p&gt;There is comprehensive in-house appraisal system and multiple learning opportunities as the department is actively involved in audit and research. You will be supported by experienced managers offering clinical and professional advice, support and feedback supporting your professional and personal development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChris CammissJob titleClinical Lead - RehabilitationEmail addressChristine.Cammiss@mft.nhs.ukTelephone number01617012640&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Therapy &amp; Dietetics Royal Manchester Children&#39;s Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Highly Specialist Physiotherapist - Chronic Pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245036", "validThrough": "2020-11-10T23:59:59+0000"}