{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T11:02:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a challenging and rewarding Occupational Therapy role? Have you ever thought about working within a prison environment? If so, then we might have just the job for you.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;HMP Parc is a Category B men’s prison holding both sentenced and remanded prisoners. With an operational capacity of around 2000 and a dedicated wing for older and disabled prisoners, HMP Parc is one of the largest and most modern prisons in the UK. The prison is located at Junction 36 of the M4, 5 minutes from the centre of Bridgend and 20 minutes from both Cardiff and Swansea.&lt;br /&gt;&lt;br /&gt;The role will be an experience like no other, requiring a diverse and mixed Occupational Therapy background. The role involves assessing, planning and delivering the social care needs to some complex patients with a wide range of both physical and mental health needs.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be a key member of a Social Care team which also includes Social Workers and care staff and, as the Occupational Therapist, you can expect to be involved in all aspects of the care planning approach for clients within your case load. Multi-professional working, effective communication and team working skills are essential as well as excellent record keeping skills.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Neil Abraham&lt;/p&gt;\n&lt;p&gt;Occupational Therapy Manager&lt;/p&gt;\n&lt;p&gt;Neil.Abraham@bridgend.gov.uk&lt;/p&gt;\n&lt;p&gt;07971-639-363&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Parc, Bridgend", "postalCode": "CF35 6AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.531", "longitude": "-3.56316"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240206", "validThrough": "2020-11-08T23:59:59+0000"}