{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-20T11:02:01+0100", "description": "&lt;p&gt;Are you passionate about nursing and delivering caring at its best in a place that will enable you to grow, learn and develop? Then we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We’re looking for experienced and recently qualified Registered Nurses, and those working towards their NMC PIN to take up a variety of opportunities across Specialty Medicine, Emergency Department, Renal, Respiratory, Cardiac and Vascular, ITU &amp; Theatres, Musculoskeletal and Specialist Surgery, Renal, Surgery and Cancer, Haematology and Oncology and Children’s services. Please highlight in your supporting information which specialty/specialties you are interested in.&lt;/p&gt;\n&lt;p&gt;Over and above, great NHS terms and conditions, salary sacrifice schemes, pension and generous annual leave allowance, we offer bespoke training and development opportunities to help shape your career path . If you’re newly qualified you will have a supernumerary period and supported preceptorship programme.&lt;/p&gt;\n&lt;p&gt;We’re a Trust that’s going places recently rated as Good by the CQC. With our clear vision to provide caring at its best, our strong values, ambitious quality improvement plans and to create a positive practice environment with a multimillion pound hospital transformation on the horizon, there’s never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;Leicester loves nurses and we’re sure you’ll love Leicester.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you’d like to know more about what we can offer you, please contact Assistant Chief Nurse Debbie McBride via debbie.mcbride@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across all Sites, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233983", "validThrough": "2020-11-16T23:59:59+0000"}