{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-28T11:30:29+0000", "description": "&lt;p&gt;&lt;span&gt;NECS works across the UK to support health and social care customers in meeting strategic and operational challenges, to improve outcomes and increase efficiency. We deliver a diverse range of services to organisations working within health and social care across the North of England and beyond. &lt;/span&gt; &lt;/p&gt;\n&lt;p&gt;NECS combines specialist skills and expertise with scale and resilience to achieve required results. We combine core NHS values with a sharp focus on customer care and a relentless pursuit of continuous improvement. We very much see ourselves as a key partner in the future success of the healthcare system and we take our share of the responsibility for shaping effective delivery.  &lt;/p&gt;\n&lt;p&gt;Our digital, data and technology specialists work with internal teams in NECS and external customers to drive forward the technology agenda within health and care and is key to NECS’ strategic plan. This focus means that we are currently looking to grow our digital services team.  We are looking for individuals who can bring new ideas, foster and drive forward a collaborative culture and who can lead and embed agile working practices. You will join an expanding team and will be empowered to manage projects and support other senior managers to manage the shaping of our service. Achieving our vision and the momentum we have started requires an individual who is committed, passionate and can bring creative ideas and nurture them to fruition and delivery.   &lt;/p&gt;\n&lt;p&gt;Reporting to the Lead Delivery Manager – Data and Digital you will support the delivery of an ambitious work programme, achievement of all internal KPIs and external SLAs ensuring all our clients are delighted by the services we provide.  &lt;/p&gt;\n&lt;p&gt;Your key responsibilities will be:  &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing projects to deliver data and digital solutions   &lt;/li&gt;\n&lt;li&gt;Manage deadlines and push the team to ensure timeliness &lt;/li&gt;\n&lt;li&gt;Exceed customer expectations securing repeat business and new opportunities   &lt;/li&gt;\n&lt;li&gt;Work transparently to provide regularly project updates and encouragement to team members &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role provides an exciting opportunity to join an NHS services using agile methods, exploiting cutting edge technology and driving change via a multidisciplinary delivery team. Your resources to call on will include data analysts, SQL developers, technical architects, software developers and project managers all working in harmony to achieve our goals.  &lt;/p&gt;\n&lt;p&gt;As a highly motivated project manager you will possess unrivalled communication and planning skills, have a passion for all things digital, a drive and determination to succeed and most importantly inspire your team to be awesome.   &lt;/p&gt;\n&lt;p&gt;The role is full time with a base either in our offices in Sheffield or Durham. There may also be some regional/national travel required to fulfil this role.  &lt;/p&gt;\n&lt;p&gt;If you would like to discuss this role in more detail, please contact Vicky Campbell-Molloy,  victoria.campbell-molloy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SHEFFIELD", "postalCode": "S9 4EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3834", "longitude": "-1.41113"}}, "title": "Senior Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246332", "validThrough": "2020-11-12T23:59:59+0000"}