{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 per annum, including London Wei"}}, "datePosted": "2020-10-19T16:31:19+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are delighted to offer an opportunity for a highly motivated, ambitious individual to join our Respiratory Medicine service based at King’s College Hospital London (Denmark Hill site). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The postholder will be a member of the Respiratory Department as well as the overall General Medicine Service. This is a substantive Consultant position based at the Denmark Hill campus. The successful candidate will work within a multidisciplinary team to provide high quality care and will be expected to constantly seek to improve and refine the service in line with the ambition to continue to deliver an international standard service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The appointee will participate in both the General Medical and Respiratory on-call rota and will be responsible for the continuing care of patients admitted as emergencies. Sub-specialty clinical and academic interests in sleep and ventilation or airways disease are encouraged. As a consultant in a major teaching hospital, the successful applicant will also be expected to contribute to undergraduate and postgraduate education. The development of relevant research interests will be encouraged, and opportunities will be enhanced by the Academic Health Sciences Centre.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Amit Patel&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3299 4630&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Consultant Respiratory Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233158", "validThrough": "2020-11-22T23:59:59+0000"}