{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T12:01:47+0000", "description": "&lt;p&gt;This is an exciting opportunity for an enthusiastic, well-motivated and skilled Occupational Therapist or Physiotherapist to join us in the Hospital Therapy Service at Blackpool Teaching Hospitals NHS Foundation Trust. The post will involve working as part of an Integrated Assessment Team covering the Acute Medical Unit, Accident and Emergency, Short Stay Unit and Frailty pathway. The team provides a 7-day service, working by a 3 week rolling rota, including working extended hours.&lt;/p&gt;\n&lt;p&gt;As a Band 6 Clinician within the Integrated Assessment Team you will be required to take part in delivering a quality service in balance with working closely with other members of the Multidisciplinary Team including AHP&#39;s, Consultants and the Hospital Discharge Team. You will need to have an enthusiastic approach, be forward thinking and have a problem-solving approach to patient assessment management. The ability to work within a fast paced and pressured environment is essential, along with having excellent communication and interpersonal skills, and demonstration of the ability to support other team members.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the provision of Occupational Therapy/Physiotherapy assessment, intervention and rapid discharge planning of patients with urgent needs and multiple, sometimes complex diagnoses. Physiotherapy candidates are required to have respiratory competencies for this role. You will also need to work inter-dependently with other members of the multi disciplinary team in order to provide a patient-centred service, working to identify patient needs to facilitate a safe and timely discharge from hospital.&lt;/p&gt;\n&lt;p&gt;Various training and development opportunities are available to ensure that you are equipped with the competence and confidence to work within this clinical area, including CPD, supervision and an individualized job plan.&lt;/p&gt;\n&lt;p&gt;The team runs a 7-day service, so you need to be able to work weekends and bank holidays on a rota basis. You will also be required to complete community visits, therefore applicants will need to have access to a car and hold a full UK Driving License.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne WildJob titleClinical LeadEmail addressjoanne.wild1@nhs.netTelephone number01253 955172&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Band 6 Occupational Therapist or Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255732", "validThrough": "2020-11-18T23:59:59+0000"}