{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum Pro rata"}}, "datePosted": "2020-11-02T09:31:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Advisor &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Medical Ad Hoc&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We seek an experienced clinician who is passionate about technology enabled service redesign in healthcare to join the digital innovation team at NHSX as a Clinical Advisor on a fixed term basis. This team focuses on working with partners across the NHS and social care and digital health innovators to help accelerate the digital transformation of health and care.&lt;/p&gt;\n&lt;p&gt;NHSX exists to make sure that patients and staff have the digital technology they need and this is a key role in our crucial mission.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An in-depth understanding of clinical systems, the experience of clinicians and service users, especially in relation to the use of digital technology&lt;/li&gt;\n&lt;li&gt;Experience of managing patient safety and clinical risk with an understanding of how digital technology systems may influence this&lt;/li&gt;\n&lt;li&gt;Insights into the benefits and challenges of leading transformation using digital technology&lt;/li&gt;\n&lt;li&gt;Experience of working collaboratively with a diverse group of stakeholders to develop best practice to meet the needs of the organisation and all its stakeholders&lt;/li&gt;\n&lt;li&gt;Experience of working with providers and clinical experts in an effective manner to deliver strategies, work programmes and processes to meet needs of the local population.&lt;/li&gt;\n&lt;li&gt;Experience in developing relevant policy and standards&lt;/li&gt;\n&lt;li&gt;Superb level of written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Strong interest in improving health and our digital mission&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will provide clinical subject matter expertise within the digital innovation team, which is a great new team focused on the interface between health, social care and digital innovation and speeding up the scaling of the strongest solutions with the biggest benefits to citizens and staff in NHS and social care. Your knowledge and expertise around clinical systems and pathways will be leveraged to support a range of high priority programmes currently being delivered by the team.&lt;/p&gt;\n&lt;p&gt;All roles are currently home based due to the impact of COVID-19. This role is nominally based at our London HQ which is located in Elephant and Castle and may require a small amount of travel both to our Leeds HQ and across the country as we work very collaboratively with partners, so the post-holder will need to be happy to work in a mobile capacity as well as from home. Please note that the reason for the fixed term of your contract is due to the second wave of Covid-19 there is a need for us to accelerate the scale of programmes and as such we are looking to bring in people who can support this ASAP&lt;/p&gt;\n&lt;p&gt;You will report to our Director of Innovation Delivery, Lisa Hollins. Working closely, where appropriate, with many other teams across NHSX and with our partners at NHS&amp;I and NHS Digital. Shortlisted candidates will be invited to attend a virtual panel interview. The closing date for applications is Monday 8th November 2020 at midnight. Interviews will be held in November.&lt;/p&gt;\n&lt;p&gt;We are happy to accept applications from candidates looking for full time and part time posts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Yinka Makinde&lt;/p&gt;\n&lt;p&gt;Job title: Head of Innovation&lt;/p&gt;\n&lt;p&gt;Email address: Yinka.makinde@nhsx.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Clinical Advisor - NHSX", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251410", "validThrough": "2020-11-08T23:59:59+0000"}