{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "On call"}}, "datePosted": "2020-10-29T17:01:02+0000", "description": "&lt;p&gt;University Hospitals Coventry &amp; Warwickshire are seeking to appoint an enthusiastic Consultant Gastroenterologist to join our dynamic department as part of service expansion. This post presents an exciting opportunity to join a dynamic and growing department practicing from a state of the art University hospital.&lt;/p&gt;\n&lt;p&gt;The successful appointee will join the existing 14 substantive Gastroenterology Consultants in delivery of high quality inpatient and outpatient provision of Gastroenterology and Hepatology services to this large Trust, incorporating The University Hospital Coventry, and St Cross Hospital Rugby. The successful candidate will be expected to develop a sub-specialty interest (such as IBD, Hepatology, Nutrition/IF, or Endoscopy) and to share their expertise in supporting and developing a forward thinking service.&lt;/p&gt;\n&lt;p&gt;The post-holder will participate in the Gastroenterology Consultant on call (including out of hours GI bleed on call) 1 week in 12, and support delivery of weekend endoscopy lists as necessary. There is no general medical on call commitment.&lt;/p&gt;\n&lt;p&gt;An interest in undergraduate &amp; post-graduate teaching is essential. Strong links with the Warwick Medical School (WMS) provides an environment conducive for active research which will be expected of the post-holder. Applicants should hold full GMC registration and also hold a CCST in Gastroenterology or be eligible for entry on the Specialist Register within six months of the AAC date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that UHCW NHS Trust does not sponsor applications for GMC registration and therefore successful candidates will be required to obtain this through alternative routes if they are not already registered with a licence to practice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For information about the different routes to apply please contact the General Medical Council directly or visit their website.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants are strongly encouraged to contact Dr Nicola Burch, Clinical Lead on extension 024 76967041 email: nicola.burch@uhcw.nhs.uk for an informal discussion.&lt;/p&gt;\n&lt;p&gt;To arrange visits please contact Bethany Taylor via bethany.taylor@uhcw.nhs.uk or telephone 02476 967041&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All correspondence will be sent by email; please check your account regularly including your Junk/SPAM folders&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are invited to attend interview you will be asked to set up an account with the Trac recruitment system in order to confirm your interview time&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Job Description &amp; Person Specification pending Royal College approval.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nicola Burch&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Lead for Gastroenterology&lt;/p&gt;\n&lt;p&gt;Email address: nicola.burch@uhcw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 02476 967041&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249173", "validThrough": "2020-11-19T23:59:59+0000"}