{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS"}}, "datePosted": "2020-10-23T10:46:00+0100", "description": "&lt;p&gt;We are looking to recruit a Band 8a Clinical or Counselling Psychologist on a permanent basis based in a new service in Ealing. This post is part of our new ‘trailblazing’ service, the Mental Health Integrated Network Team (MINT), in line with the NHSE long term plan.&lt;/p&gt;\n&lt;p&gt;The NHSE long term plan aims to develop new and integrated models of primary and secondary community mental health care supporting adults with a range of mental health presentations. These services will aim to break down the current barriers in accessing services, align services with the individual’s primary care network and deliver integrated, personalised, place-based and well-coordinated care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post creates a great opportunity for a qualified band 8a Clinical or Counselling Psychologists to be based in Ealing within one of the three MINT Teams. The teams hold psychological formulation and psychological interventions as central to their pathways and the post holders will be expected to contribute to the development and delivery of treatment protocols within these teams.&lt;/p&gt;\n&lt;p&gt;You would also become part of a larger psychology team working across Inpatient services, Crisis Teams, Early Intervention, Recovery, Rehabilitation, Primary Care Mental Health, Eating Disorders and many others. The service has an active CPD programme for psychologists and psychology is involved in planning regarding transformation, service development and delivery.&lt;/p&gt;\n&lt;p&gt;The trust is committed to developing excellent services and you will be part of a team excited by, and striving for, optimal recovery outcomes for each individual who uses our services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This new development entails re-modelling services with a renewed focus on working with people with a range of mental health problems and ensuring that their care is accessible and sits at the core of their communities.&lt;/p&gt;\n&lt;p&gt;Services will be modernised to shift to whole person, whole population health approaches. This means that we will be looking at all the community resources available including health, social care, VCSE organisations and local communities and considering resources to support wellbeing outside of mental health services alone.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;These new posts form part of a number of newly created posts across our community services. As psychological therapies are core to the NHS long term plan, this is reflected in the staffing cohort outlined in our successful bid.&lt;/p&gt;\n&lt;p&gt;The new teams therefore will aim to ensure timely access to psychological interventions aimed to enable people to utilise community facilities as best as possible and remain within their primary care network.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please contact Dr Donal Leddy (07712 539 430) to discuss the post further. &lt;br /&gt;Please only apply if you are qualified and HCPC registered.&lt;/p&gt;\n&lt;p&gt;Please be aware that our Job Descriptions for all psychology roles are standardised and may not answer your queries so please give us a ring or arrange to come and meet us and find out more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Donal LeddyTelephone number07712 539 430Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Psychology Ealing, Southall", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240136", "validThrough": "2020-11-20T23:59:59+0000"}