{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-02T03:45:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Registered Mental Health Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Salary: Band 5 (£24,907 - £30,615) pa dependent on experience&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Location: Older Adult Services &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Hours: 37.5 hours per week (however flexible working opportunities available)&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Post Ref: 457-20-104-QN&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Interviews are scheduled for 23rd November 2020&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A career in nursing is one of the most rewarding paths you can choose. Yes, it can be a tough job… the thing that drives our nurses though, is the knowledge that they are making a real difference to people’s lives every day. Working with older adults who have mental health and cognitive impairments takes patience and skill, this can make all the difference to the lives of the older adults who use our services and the families who want the very best for their loved one.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you someone who treats others with kindness, compassion and empathy, someone who shows others respect and works as part of a team to provide the very best care to our patients, their carers and family. Do you have the patience and skills to work with people in the later stages for their life?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are excited to offer Band 5 nursing roles across our older adult wards Dovedale and G1 and also our older adultcare home services Birch Avenue and Woodland View.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whether newly registered or with years of experience you will be supported by our fantastic senior nurse leaders and the wider multi-disciplinary team to deliver high quality and safe care to our patients. We want you to be part of continuous improvement in our delivery of person-centered care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to be flexible and adaptable, working alongside our family of inpatient services. The roles will require out of hours working across 7 days a week, which will attract enhancement payments. We are happy to talk to you about flexible working and condensed hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s an exciting time to be joining team SHSC as we begin our journey develop care of older adults as a specialist clinical area. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In joining team SHSC, your hard work and dedication will be recognised, valued and rewarded. We are committed to investing in the professional development of all our nurses. Successful offer of employment will include a development package including access to paid further education, professional and leadership development programmes and career pathway planning. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll also have access to a range of benefits, including our fast-track Physiotherapy service, access to financial support from Neyber and their Financial Wellbeing Hub, salary sacrifice schemes for purchasing a new car and home electronics as well as the opportunity to purchase additional annual leave. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your health and wellbeing is extremely important to us. We have an in-house counselling service who are dedicated to supporting our staff with both work and non-work-related concerns. We all need to ensure we have a good work-life balance. If you are looking for flexible working options including part time, long days, specific days of work – we aim to accommodate all requests, wherever possible. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re proud to care for our patients, and if that’s a passion you share and you want to work alongside older people and their families, we’d love to hear from you! &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S11 9BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3615", "longitude": "-1.49796"}}, "title": "Registered Mental Health Nurse - Older Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251224", "validThrough": "2020-11-15T23:59:59+0000"}