{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 per annum"}}, "datePosted": "2020-11-04T15:01:06+0000", "description": "&lt;p&gt;&lt;strong&gt;UNIVERSITY HOSPITALS OF LEICESTER NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant Paediatric Anaesthetist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a whole-time Locum Consultant Paediatric Anaesthetist. &lt;br /&gt;&lt;br /&gt;The University Hospitals of Leicester NHS Trust (UHL) consists of three acute teaching hospitals serving the population of Leicestershire and the wider region. It is fully committed to Continuing Medical Education for Consultants.&lt;/p&gt;\n&lt;p&gt;This is a new post in the Clinical Management Group of Intensive care, Theatres, Anaesthesia, Pain Management and Sleep (ITAPS) at the Leicester Royal Infirmary site, with a view to the development of the Paediatric Anaesthetic Service.&lt;/p&gt;\n&lt;p&gt;UHL is currently undergoing an exciting process of reconfiguration with associated site-investment, the Government has recently announced that Leicester’s Hospitals will be getting £450m of capital investment over the next 5 years to complete our investment and reconfiguration plans. The £450m programme includes two ‘super’ intensive care units part of which involves consolidating all paediatric services into a new dedicated Children&#39;s Hospital at the Leicester Royal Infirmary.&lt;/p&gt;\n&lt;p&gt;The Paediatric Anaesthetic group is currently made up of 10 consultants. We are developing the service to provide extra paediatric emergency sessions as well as to provide prospective consultant paediatric anaesthetic cover to specialist lists, pre-operative assessment and acute pain. All the consultants within the group have a flexible component to their job plans to facilitate this.&lt;/p&gt;\n&lt;p&gt;The Anaesthetic department provides Paediatric anaesthetic cover for the following specialties: Paediatric General Surgery, Urology, Thoracic surgery, Orthopaedics &amp; Trauma, ENT, Maxillofacial &amp; Dental, Plastics, Ophthalmology, Oncology, diagnostic and interventional Radiology &amp; Endoscopy, Pre-assessment and Pain. Anaesthesia for neonatal surgery is undertaken on a regular basis.&lt;/p&gt;\n&lt;p&gt;It is expected that the post holder will have received training and experience (fellowship or part-fellowship) in all areas of paediatric anaesthesia and neonatal surgery, and will take part in the paediatric anaesthetic on call rota.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As this post is regulated by the Protection of Children Act 1999, The Criminal Justice Courts Act 2000 and / or the Care Standards Act 2000 an enhanced police criminal records disclosure will be requested by the Trust in the event of a successful application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Elsa DekkerJob titleConsultant in Paediatric AnaesthesiaEmail addressElsa.dekker@uhl-tr.nhs.ukTelephone number0116 258 6174Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Neil Flint - Head of Service, LRI Tel: 0116 258 6174, Email: Neil.flint@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LRI, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Locum Consultant in Paediatric Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256338", "validThrough": "2020-12-05T23:59:59+0000"}