{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5-equivalent"}}, "datePosted": "2020-10-16T13:27:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Outpatient  | Nurse |Chatham | Band 5-equivalent | Full time- 37.5 hours per week  |Access to training and development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Spire Alexandra Hospital has an exciting full-time opportunity for a Nurse in our outpatient department. The successful applicant will &lt;/strong&gt;&lt;strong&gt;provide high quality evidence-based nursing care in a clinic setting to facilitate smooth and efficient outpatient clinics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Spire Alexandra hospital is located in Kent approximately eight miles from Maidstone and five miles from Chatham. We offer everything from health screening and checks, to acute and minor surgery through to professional recovery and rehabilitation. Our facilities boast two laminar flow theatres and 32 beds across two ward areas, an endoscopy suite, imaging department, physiotherapy and outpatient consulting rooms. Our outpatient department is open six days a week, including evenings, offering flexible appointments for patients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Run nurse led dressing and phlebotomy clinics and assist in pre-operative investigations&lt;/li&gt;\n&lt;li&gt;Carry out any other duties delegated by the OPD Manager / team leader for the proper and efficient care of the patient&#39;s and the smooth running of the department&lt;/li&gt;\n&lt;li&gt;Chaperone and assist Consultants during examination of the patient&#39;s and minor surgical procedures and assists in arranging investigations requested by Consultants&lt;/li&gt;\n&lt;li&gt;Complete Outpatient documentation to a high standard&lt;/li&gt;\n&lt;li&gt;Carry out individualised nursing care and procedures to the highest standards complying with hospital policies and procedures at all times&lt;/li&gt;\n&lt;li&gt;Maintain and provide patients with relevant and accessible written information regarding their procedures / treatments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current NMC registration&lt;/li&gt;\n&lt;li&gt;Experience of working in outpatient or a surgical environment&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;ECG and Phlebotomy trained&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Competence across a range of nursing skills&lt;/li&gt;\n&lt;li&gt;Experience of working in teams with minimum supervision&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sherine Lowers @ sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatham", "postalCode": "ME5 9PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3279", "longitude": ".526556"}}, "title": "STAFF NURSE – Outpatient", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230396", "validThrough": "2020-11-16T23:59:59+0000"}