{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35335", "minValue": "33633", "unitText": "YEAR", "value": "£33,633 - £35,335 (£16.80-£17.65)p/h)"}}, "datePosted": "2020-11-02T11:37:49+0000", "description": "&lt;p&gt;As an award winning, independent provider, PJ Care only look to recruit individuals who share in our mission to deliver the highest standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;PJ Care is one of the Sunday Times Top 100 Companies To Work For in 2019, and is a leading provider of specialist neurological care and neuro rehabilitation for people with progressive or acquired neurological conditions. We specialise in the multidisciplinary care of adults and work with residents, families, charities and the NHS to provide the highest quality care. Our residents are at the heart of everything we do and we strive to nurture dignity, independence and holistic wellbeing through the specialist care models, therapies and activities we provide.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a number of Registered Nurses (RGN, RMN and RNLD) and Senior Nurses to join our established team in Peterborough.To apply for this role with us you should be:&lt;/p&gt;\n&lt;p&gt;• A Registered Nurse&lt;/p&gt;\n&lt;p&gt;• Committed to the highest standards of care and excellence&lt;/p&gt;\n&lt;p&gt;• Looking to enhance or develop your skills to lead an award winning team&lt;/p&gt;\n&lt;p&gt;• To be considered for a Senior position you would need to have 2 years experience within a relevant resident group?&lt;/p&gt;\n&lt;p&gt;By joining this award winning team you will:&lt;/p&gt;\n&lt;p&gt;• Make a difference in this growing organisation&lt;/p&gt;\n&lt;p&gt;• Be continually supported in your chosen path of progression&lt;/p&gt;\n&lt;p&gt;• Be a part of an innovative culture&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a business who believe in growth and development and are committed to investing in our people. As well as a competitive salary, we also offer our employees a range of excellent benefits, including a pension scheme, subsidised meals, free parking, childcare vouchers, and free uniforms.&lt;/p&gt;\n&lt;p&gt;We do offer part time hours however you would need to be able to work 12 hour shifts.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "P J Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134817"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5925", "longitude": "-.287674"}}, "title": "Registered Nurse (RGN, RMN, RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251848", "validThrough": "2020-11-16T23:59:59+0000"}