{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata / per annum"}}, "datePosted": "2020-11-05T10:31:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the NEL CHC &amp; Placements team in Kent as an Administrator. We are looking to appoint an enthusiastic and efficient administrator to provide and co-ordinate a comprehensive and effective range of administrative support to the clinical and management team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have excellent organisational skills, be a strong communicator, able to act on their own initiative, adapt to new situations, and enjoy working in and contributing to the work of a fast-paced, high performing operational team. It is essential applicants have significant recent administrative experience including knowledge of databases, preparing agendas and taking minutes and using Microsoft Office Systems.&lt;/p&gt;\n&lt;p&gt;You will need to have a strong background in administration and while we don’t expect that you will have had previous experience of NHS Continuing Healthcare and Funded Nursing Care, if you have this it will be an advantage. You will need to be able to demonstrate excellent interpersonal, negotiation, verbal and written communication skills as well as proficient IT skills. A flexible approach to work, with an ability to prioritise and manage workloads along with an ability to work as part of a team and also under your own initiative is required.&lt;/p&gt;\n&lt;p&gt;For further details on this role, please refer to the attached job description. Please ensure that you pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo ClarkJob titleTeam LeadEmail addressjoanne.clark1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent House, Ashford", "postalCode": "TN23 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1477", "longitude": ".875876"}}, "title": "Administrator Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257235", "validThrough": "2020-11-19T23:59:59+0000"}