{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-10-23T08:16:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a challenge, leading a new service to promote and embed Medicines Optimisation specifically to patients who receive support with care in their own homes?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about patient care, keen to gain a broader skill base and develop your expertise across both the NHS and Social Care sectors?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Recent months have highlighted the need for closer collaboration between Health and Social Care. Hywel Dda University Health Board are pleased to announce a fantastic opportunity for a pharmacy technician to work in a newly established team, answering directly to the Lead Pharmacist for Care Homes and Domiciliary Care. As this is a new team being established it is anticipated you will manage other members of the workforce in the future as this model develops.&lt;/p&gt;\n&lt;p&gt;The vision is to work closely with our Social Care colleagues, providing support on medication related issues, and facilitation of the implementation of the “National Guiding Principles for Medicines Support in the Domiciliary Care Sector”. You will offer targeted support in areas such as patient safety and medicines optimisation. You will have the ability to advise and influence professionals across both health and social care sectors as well as other key stakeholders. As part of the wider primary care team you will be supported by a friendly, welcoming team with a vast amount of expertise to help mentor you on your career path.&lt;/p&gt;\n&lt;p&gt;The post requires a highly motivated technician with excellent communication, interpersonal and time management skills. You will help to establish a new high quality service, participate in training of health and social care staff and contribute to the planning and delivery of the medicines optimisation strategy. As services move closer to home, increased communication and collaboration between the sectors will be key to ensuring seamless care for our patients. The post will enable you to broaden your knowledge, expertise and transferable skills. You will build on previous experience, developing greater autonomy and responsibility, whilst gaining an understanding of the whole patient journey.&lt;/p&gt;\n&lt;p&gt;Pharmacy professionals are highly valued across the Health Board and there has been development of new roles across the sectors, ensuring exciting opportunities for a future career in a lovely part of the country. Hywel Dda University Health Board covers the three Local Authority areas of Carmarthenshire, Pembrokeshire and Ceredigion, in West Wales. The area offers a stunning combination of beaches and mountains, offering activities for the thrill seekers, as well as those more inclined to quieter pursuits. It includes Pembrokeshire National Park (the only coastal National Park in the UK) with its picturesque towns and villages, and Ceredigion bay (home to porpoises and dolphins). Visit these two websites for more information on working, training and living in Wales.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic pharmacy technician, who wants to make a real difference to individual patients, while having a great work-life balance then this post would be ideal for you.&lt;/p&gt;\n&lt;p&gt;Interviews for this vacancy will be held on 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah IsaacJob titleSenior Lead for Primary Care and Community Pharmacy ServicesEmail addresssarah.isaac@wales.nhs.ukTelephone number07970603792Additional contact information&lt;/p&gt;\n&lt;p&gt;Mair Davies&lt;/p&gt;\n&lt;p&gt;mair.davies5@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;07813780735&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Health Board wide", "postalCode": "SA31 3BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8568", "longitude": "-4.33801"}}, "title": "Chief Pharmacy Technician for Domiciliary Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239654", "validThrough": "2020-11-08T23:59:59+0000"}