{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T12:45:56+0000", "description": "&lt;p&gt;Cedar Parc Ward is a 13 bedded Dementia Assessment Unit based in Ysbyty Tri Chwm, Ebbw Vale. The ward accommodates Older people for Mental Health assessment and treatment. |Cedar Parc specialises in the assessment of confusion, diagnosis and care of dementia. Our goal is always to treat each person as an individual and support independence, maintain contact with loved ones and promote enjoyment in activities and the best quality of life possible. Our goal is always to treat each person as an individual and support independence, maintain contact with loved ones and promote enjoyment in activities and the best quality of life possible. The ward is homely and informal whilst remaining a safe clinical ward where dignity is maximised at all times. Signage promotes orientation, independence and freedom as far as possible. These activities assist to structure the patient’s time but also enable the staff to assess the patient’s needs and functioning. The Consultant and other health professionals will decide when the patient is ready to leave hospital. The family/carer will be involved in planning discharge to meet the person’s needs. The ward supports John&#39;s Campaign and has open visiting hours.&lt;/p&gt;\n&lt;p&gt;Flexible working will be considered for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 15 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Whent&lt;/p&gt;\n&lt;p&gt;Senior Nurse&lt;/p&gt;\n&lt;p&gt;amanda.whent@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01495 353212&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty&#39;r Tri Chwm, Ebbw Vale", "postalCode": "NP23 6GT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7893", "longitude": "-3.21752"}}, "title": "Registered Nurse -  Cedar Ward, Ysbyty Tri Chwm, Ebbw Vale", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250242", "validThrough": "2020-11-12T23:59:59+0000"}