{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267 + 5% HCA"}}, "datePosted": "2020-11-04T11:06:38+0000", "description": "&lt;p&gt;Due to retirement and District Nurse Sponsorship in September, there is an opportunity for two newly qualified or experienced District Nurses to join the Community Nursing Team in Spelthorne.&lt;/p&gt;\n&lt;p&gt;The posts are offered as part time hours or full time hours which can be discussed at interview. The District Nurses cover a 9am to 5pm service over 7 days a week. The community nurses are currently on a rota to cover weekend work, one weekend every 3 to 4 weeks.&lt;/p&gt;\n&lt;p&gt;The Community Team visit patients at home, in residential homes and hold wound clinics at the Health Centre.&lt;/p&gt;\n&lt;p&gt;There are excellent opportunities for training and the team has experienced band 6 senior nurses and two Team Leaders, Band 7 who are experienced Practice Teachers who will ensure that you have the necessary mentorship for your personal development. Training opportunities exist for IV administration, end of life, advanced communication courses and wound care to name only a few popular courses that are undertaken. Spelthorne Locality covers the patients within the Staines, Sunbury, Shepperton, Ashford and Stanwell GP Practices.&lt;/p&gt;\n&lt;p&gt;Any further information or if you would like an informal visit to the bases, please call Liz Mitchell the Hub Manager on 07974 750331.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Staines Health Centre", "postalCode": "TW18 1XD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.429", "longitude": "-.501099"}}, "title": "Band 6 District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255537", "validThrough": "2020-11-18T23:59:59+0000"}