{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc HCAS"}}, "datePosted": "2020-11-06T14:46:15+0000", "description": "&lt;p&gt;Electronic Rostering is well established at Epsom &amp; St Helier NHS Trust. HealthRoster was introduced to the Trust in 2008. Today we have over 480 rosters, and are rostering over 5000 nursing, therapy, ancillary and 800 medical staff. We use Allocate’s Healthroster, Bankstaff, Employee / Medics Online/ME App, SafeCare, Activity Manager (AM) Roster Perform and Medics On Duty.&lt;br /&gt;&lt;br /&gt;This is an exciting time to join a talented and well respected team. We are looking for someone to work proactively and deliver a high level of customer service, where the successful candidate will drive efficiency through rostering best practice.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this is a competency based role Band 4/5. Please see attached Competency Framework for further information which is included in the job description.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for someone with a working knowledge and experience of version 10 of Allocate’s HealthRoster. The post holder should have excellent communication skills and have a good awareness of customer service along with being a strong team player.&lt;/p&gt;\n&lt;p&gt;You should be able to work proactively and work confidently. The e-Rostering team is a reliable and a vital source of workforce information and you would need to have an understanding of the information available in HealthRoster and how the system needs to be maintained in order to preserve the integrity.&lt;/p&gt;\n&lt;p&gt;This is a full time post but we will consider applications from part time/job share applicants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our mission: ‘to put the patient first by delivering great care to every patient, every day.’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There’s never been a better time to join the Epsom and St Helier team. Our hospitals are facing a bright and busy future, and our staff have a proven track record in providing high quality, compassionate care for our patients.&lt;/p&gt;\n&lt;p&gt;Boasting incredible staff benefits and dedicated training schemes, working for us will not only take your career forward, but could help to transform the lives of our patients and visitors.&lt;/p&gt;\n&lt;p&gt;We offer all employees some fantastic staff benefits, and are the only hospitals in Surrey to offer staff the London high cost area supplement. Our hospitals also benefit from great locations, so whether you&#39;re attracted to the bright lights of the city or the countryside of Epsom Downs, both are within easy reach.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;As a Disability Confident Employer we are working to create a workplace that enables all staff to reach their full potential. We therefore, encourage applications from under-represented groups such as BME people, LGBT+ people and people with disabilities.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horizon Building, Epsom", "postalCode": "KT17 4RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3342", "longitude": "-.26154"}}, "title": "eRostering Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260186", "validThrough": "2020-11-12T23:59:59+0000"}