{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-30T13:15:54+0000", "description": "&lt;p&gt;We are pleased to be able to offer an exciting opportunity for 2 full time band 6 Crisis Practitioners to work across North Cumbria. The successful candidate would cover North Cumbria and be based at either our Carleton Clinic (East) or West Cumberland Hospital (West) site.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with children, young people and their families up to 18 years old, with the principal objective of providing crisis assessments to the identified client group. The successful candidate will have responsibility for the effective management of a caseload of children and young people referred into the service, support families to potentiate resources and strategies to meet their needs. They will also create effective working relationships with partner agencies.&lt;/p&gt;\n&lt;p&gt;The applicant should hold a professionally registered qualification and have experience of working with children, young people and families. It is also essential that they will have experience of working within a mental health/ learning disability area, have a qualification in Child and Adolescent Mental Health or demonstrate a willingness to undertake further training in this area.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to travel and have their own transport this requires the successful candidate to have a full driving license and access to a car. There will be an expectation of driving around North Cumbria to meet demand of the role and service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sharon Graham&lt;/p&gt;\n&lt;p&gt;Job title: CAIS Team Lead&lt;/p&gt;\n&lt;p&gt;Email address: Sharon.Graham@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01228 603950&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carleton Clinic or West Cumberland Hospital, North Cumbria", "postalCode": "CA1 3SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8749", "longitude": "-2.88374"}}, "title": "Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250315", "validThrough": "2020-11-15T23:59:59+0000"}