{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T15:16:09+0000", "description": "&lt;p&gt;Would you like to join a growing team and be part of transforming services for those who have a diagnosis of personality disorder and complex emotional needs?&lt;/p&gt;\n&lt;p&gt;As a result of the extra investment that is coming into Mental Health services as part of the NHS Long Term Plan, we are excited to be able to expand and transform what we offer to this service user group and their families. We are in the process of recruiting a senior MDT that will shape and drive these changes. This investment will allow us to strengthen our teams across Nottinghamshire and Bassetlaw and forms the first part of a larger expansion across all elements of our developing stepped care integrated model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be required to provide an efficient, comprehensive and confidential secretarial/administrative/reception service to support the Senior Multi-Disciplinary Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience of facilitating meetings, investigations and disciplinaries is required, including preparing agendas and related paperwork and producing accurate minutes. You will be required to order stock and book training, accommodation and travel on behalf of the team and will be responsible for managing diary schedules. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential you have excellent organisational skills, a proactive approach and the ability to prioritise tasks in order to meet deadlines, working on your own initiative to meet the needs of the team. It is essential that you have a minimum of RSA/OCR III typing / word processing or an equivalent qualification/experience. You should have the ability to deal with telephone calls and callers needs and be proficient in the use of Microsoft Office packages.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of the Multi-Disciplinary Team and will play an integral part in getting the team up and running. This is a new post and a new service so you will assist the team to put in place effective and proficient administrative processes. You will be supported by the Adult Mental Health Administration Team and will report to the PA/Admin Team Leader.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal conversation, please contact Kelly Harbey, PA/Admin Team Leader AMH.&lt;/p&gt;\n&lt;p&gt;E-mail: kelly.harbey@nottshc.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 0115 9691300 ext. 12043&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Clinical Team Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258289", "validThrough": "2020-11-22T23:59:59+0000"}