{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 £31,365 - 37,890  pa pro rata"}}, "datePosted": "2020-11-02T09:52:31+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Bank Occupational Therapist - Herefordshire&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for a change of area or simply need more flexibility to manage your work/life balance? Then working on the bank may be just the answer.&lt;/p&gt;\n&lt;p&gt;Wye Valley NHS Trust are seeking Registered Children&#39;s Occupational Therapist to join the Trust’s Temporary Staffing Bank. If you are looking for flexible work that can fit around your other commitments, and are dedicated to providing the very best care for patients then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Wye Valley NHS Trust is the provider of healthcare services at Hereford County Hospital, which is based in the city of Hereford, along with a number of community services for Herefordshire and its borders. We also provide healthcare services in Kington and Ledbury in addition to our community hospitals in the market towns of Ross-on-Wye, Leominster and Bromyard.&lt;/p&gt;\n&lt;p&gt;Our workforce provides a range of specialist and generalists functions and serves a population of 180,000. The key principles of Wye Valley NHS Trust are to improve the health and well-being of the people we serve in Herefordshire and the surrounding areas. We work hard to deliver across traditional boundaries to provide integrated care in order to deliver a standard of care we would want for ourselves, our families and friends.&lt;br /&gt; &lt;br /&gt; Our Bank team supplies staff to cover temporary shortages across the organisation. Roles will involve working in a busy, challenging and rewarding environment. It is essential that you can be flexible in your work availability with potential opportunities to work across the Trust in a variety of departments across a variety of settings including the acute clinical environment, community services, community hospitals, and weekend working. The ideal candidates will be reliable andable to work as a member of a team to provide high level patient centered care.3 example job descriptions have been attached but please make contact to discuss any area of work.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service we offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First opportunity for work placements before agency staff&lt;/li&gt;\n&lt;li&gt;Monthly payroll&lt;/li&gt;\n&lt;li&gt;Access to the NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;Opportunities to work across various areas of the trust&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Flexible hours&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Pay and banding will be linked to your experience, knowledge and skills and will be discussed with the successful applicants.&lt;/p&gt;\n&lt;p&gt;The post is subject to Occupational Health Screening and Criminal Records Bureau Disclosure checking. Applicants should have HCPC registration. Students who are due to qualify and are awaiting HPC Registration are welcome to apply for the bank.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please ensure when completing your application form that your references cover the last 3 years of employment and that they are provided by appropriate referees for example line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further information contact: Emma Hill. Clinical Manager - Occupational Therapy 01432 372995 / 07976861616 or Email: emma.hill2@wvt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No Agencies.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;**Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, at a cost of £44.00 of which is payable by the successful candidate**&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UK Registration&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must have current UK professional registration.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herefordshire", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Bank Children&#39;s Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251491", "validThrough": "2020-11-16T23:59:59+0000"}