{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-11-04T08:16:05+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for registered health or social care professionals to work in a team in a fast paced criminal justice environment. You will need to be an NMC, HCPC or SWE registered practitioner with some relevant health or social care service experience, and have significant demonstrable post registration experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Liaison and Diversion is a process whereby people of all ages with a wide range of vulnerabilities are identified and assessed as early as possible as they pass through the Youth and Criminal Justice Systems. You will be required to work autonomously across the offender pathway in a range of community and custody environments and support the Police, Courts and Probation and the wider health and social care systems.&lt;/p&gt;\n&lt;p&gt;We are looking to employ one part time worker into our team to operate at Kings Lynn Police investigation centre. The role will involve working 8am to 6pm on a rota system covering 7 days a week including bank holidays..&lt;/p&gt;\n&lt;p&gt;Your primary role will be to complete holistic client triage assessments as well as gaining an understanding of criminal justice systems. You will possess excellent interpersonal skills that will enable you to challenge, motivate, influence and inspire your colleagues at all levels.&lt;/p&gt;\n&lt;p&gt;The criminal justice locations include; Police Investigation Centres (PIC’s), courts and other supporting criminal justice/health environments in line with service need. The service covers both Norfolk and Suffolk and may require some cross county working. It is essential that you are able to travel independently.&lt;/p&gt;\n&lt;p&gt;We are open to applications for part time employment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;“We have a great team, fabulous people and tremendous partnership working, we are making a difference to truly vulnerable people.” - &lt;/em&gt;&lt;/strong&gt;current team member&lt;/p&gt;\nFor further details / informal visits contact:\nNameNick OliverJob titleClinical Team LeaderEmail addressnick.oliver@nsft.nhs.ukTelephone number01603 786756Additional contact information\n\n&lt;p&gt;LDAdminTeam@nsft.nhs.uk or call 01603 786756&lt;/p&gt;\n\n\n&lt;p&gt;To find out more about the role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Police Investigation Centre, 2 Willows Business Park, Saddle Bow, Kings Lynn, PE34 3RD, Kings Lynn", "postalCode": "PE34 3RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7273", "longitude": ".380135"}}, "title": "Liaison and Diversion Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255044", "validThrough": "2020-11-18T23:59:59+0000"}