{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-21T10:32:20+0100", "description": "&lt;p&gt;Rushcliffe LMHT, Broxtowe &amp; Hucknall LMHT and Gedling LMHT have exciting opportunities for experienced Band 6 Mental Health Nurses or Mental Health Practitioners to join the team. You will need to be able to demonstrate high quality assessment and treatment for adult service users who experience a wide range of mental health difficulties and need support from secondary mental health services.&lt;/p&gt;\n&lt;p&gt;You will be an enthusiastic team player, working within a multi-disciplinary health team to deliver objectives developed via group and personal supervision. You will also work collaboratively with statutory and voluntary agency partners; work within the duty system and provide triage and assess patients who are new to services as well as those who are more well known.&lt;/p&gt;\n&lt;p&gt;You will receive support in developing specific therapeutic skill sets to enable you to provide a high quality service to our patients and their families.&lt;/p&gt;\n&lt;p&gt;The post is a Band 6 (Agenda for Change) Community Mental Health Nurse/Practitioner, providing care packages to a diverse client group experiencing a range of mental health needs, living in the area. You will be able to visit people in their own homes and communities as well as at the team base on an individual basis or in a clinic setting.&lt;/p&gt;\n&lt;p&gt;You must be a qualified Mental Health Nurse, Social Worker or Occupational Therapist with a current NMC/HCPC registration. Significant experience within community mental health services is desirable, ideally with this client group and you should demonstrate excellent clinical skills. Excellent communication and an ability to communicate professionally across agencies is also a key skill.&lt;/p&gt;\n&lt;p&gt;You must hold a full UK driving license and be able to use a car for work purposes however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephen Hall - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: stephen.hall@nottshc.nhs.uk / Telephone number: 0115 9455990&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Jayne Steed (Team Lead) at Broxtowe &amp; Hucknall LMHT on Tel 0115 8541271&lt;/p&gt;\n&lt;p&gt;Tanya Hobbs (Team Lead) at Gedling LMHT on Tel 0115 9524098&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment.&lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email. Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG2 7PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9309", "longitude": "-1.13234"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235890", "validThrough": "2020-11-15T23:59:59+0000"}