{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28500", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 - £28,500 pro rata"}}, "datePosted": "2020-10-08T11:36:18+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as an Staff Nurse / Ward RGN in our Brentwood Hospital and play your part in building a healthier nation. &lt;br /&gt;&lt;br /&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference. Our unique approach to connected healthcare means the difference can be truly transformative. Our network spans hospitals, Fitness and Wellbeing Clubs, and specialist services including physiotherapy - which means we can support lasting changes by taking great care of people in every way. And as Britain’s largest not for profit healthcare provider, we’d love to take good care of you too. Investing every penny in our services and people, we’ll bring out the specialist in you.&lt;br /&gt;&lt;br /&gt;At Nuffield Health, you’ll discover nursing as it should be - with more time to care, and get to know the people who are your patients as you help them through difficult times. Whether you’re currently in the NHS or a private setting, we’re sure you’ll find your career with us motivating and rewarding. Because we genuinely believe in putting our patients first. We’ll trust you to use your own judgment and skills, and respect and value you as a professional. Across a varied caseload, you’ll need to draw on all your skills to ensure each individual patient receives the high quality of care they deserve.&lt;br /&gt;&lt;br /&gt;You’ll be part of a close-knit team headed by our matron, who provides the foundation and lead for our patient centered care. And, with our consultant-led service, you’ll be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities. These are maintained to a high standard – we take great pride in our low infection rates and high CQC scores at Nuffield Health.&lt;br /&gt;&lt;br /&gt;As a nurse registered with the appropriate governing body, you’ll have the qualifications and experience relevant to your registration, including NMC. You’ll also have post-registration experience. Like us, you believe in putting people first. So you’ll appreciate having the time to care – to fully understand each patient’s needs and provide individual attention that can mean so much when they’re at their most vulnerable. In short, you’ll be able to deliver the type of care that comes naturally to a talented nurse. You’ll be an excellent communicator and team worker – flexible and motivated. As part of the hospital team, you’ll interact with practitioners from other departments because you understand the importance of continuity in patient care.&lt;/p&gt;\n \n\n\n&lt;p&gt;The Role &lt;/p&gt;\n\n\n&lt;p&gt;Whether you are currently in the NHS or a private setting, we’re sure you will find your career with us motivating and rewarding.  &lt;/p&gt;\n\n\n&lt;p&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference. As a Staff Nurse you will; &lt;/p&gt;\n\n\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be part of a close-knit team headed by our matron. &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;With our consultant-led service, you will be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You’ll interact with practitioners from other departments because you understand the importance of continuity in patient care. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n&lt;p&gt;The Person &lt;/p&gt;\n\n\n&lt;p&gt;To succeed as a Staff Nurse in our Ward you will; &lt;/p&gt;\n\n\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Have a registration with the appropriate governing body and have the qualifications and experience relevant to your registration, including NMC. &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have post-registration experience. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be an excellent communicator and team worker – plus be flexible and motivated. &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have the ability to fully understand each patient’s needs and provide individual attention. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n&lt;p&gt;The Benefits &lt;/p&gt;\n\n\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits. &lt;/p&gt;\n\n\n&lt;p&gt;Be your best and join us in building a healthier nation. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n&lt;p&gt;Salary - Up to £27,000 per annum&lt;br /&gt;Location -  Brentwood&lt;br /&gt;Hours -  Full time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt; &lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brentwood", "postalCode": "CM15"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6522", "longitude": ".31096"}}, "title": "Staff Nurse - Ward (RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218087", "validThrough": "2020-11-06T23:59:59+0000"}