{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T11:31:08+0000", "description": "&lt;p&gt;We have a vacancy for a Theatre Nurse or Operating Department Practitioners within the Level 5 Theatres at the Royal Sussex County Hospital who have a passion for providing high quality care.&lt;/p&gt;\n&lt;p&gt;The Department is situated in Brighton consists of 9 Theatres spread across two main operating suites.&lt;/p&gt;\n&lt;p&gt;We care for patients before, during and after some of the most demanding and complex operations in ENT/maxilla-facial, colorectal, vascular, gynaecology and obstetric, orthopaedic and upper gastro-intestinal. As a regional centre of excellence for vascular surgery, and as the Major Trauma Centre for the South East Coast, we aim to deliver exceptional care to some of the most acutely unwell patients in the region.&lt;/p&gt;\n&lt;p&gt;We also staff major trauma, emergency surgery and obstetric theatres around the clock, so if you are the type of person who thrives on dealing with the unexpected, we have just the job for you.&lt;/p&gt;\n&lt;p&gt;To support you, we have a dedicated team of Practice Educators who facilitate induction, training and access to further professional development. In partnership with our regional universities, we offer courses in perioperative practice, anaesthetic nursing, post-anaesthetic practice and Surgical 1st Assistant training. You will have a six month induction programme which involves a rotational experience in each speciality, before consolidation in a designated team. Roughly twice per year, we offer staff the opportunity to broaden their skills through movement into different specialties.&lt;/p&gt;\n&lt;p&gt;We are looking for the best staff. We are doing everything we can to meet our challenges and make the most of the opportunities on offer. If you want to do the same, we welcome you to come and join us.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTom OsborneJob titleActing Theatre ManagerEmail addressosborne.tom@nhs.netTelephone number01273 696955 ext 7444Additional contact information&lt;/p&gt;\n&lt;p&gt;Chris Webb at The Royal Sussex County Hospital on 01273 696955 Ext 4176&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242218", "validThrough": "2020-11-08T23:59:59+0000"}