{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Hourly"}}, "datePosted": "2020-11-02T12:31:41+0000", "description": "&lt;p&gt;Are you an RGN with at least six months Band 5 experience?&lt;/p&gt;\n&lt;p&gt;Are you seeking a flexible working pattern to suit your work/life balance? &lt;br /&gt;&lt;br /&gt;We are seeking to recruit caring, compassionate nurses with excellent communication and clinical skills who will strive to achieve the Royal Free London NHS Foundation Trust (RFL) world class care values. &lt;br /&gt;&lt;br /&gt;As one of the leading trusts in clinical excellence, we provide you with robust personal development opportunities and offer you an enhanced rate for your services in line with the Agenda for Change framework. &lt;br /&gt;&lt;br /&gt;In return you will need to be a reliable, self-motivating individual who is able to integrate quickly and work as part of a team. Recent experience as a band 5 nurse (at least six months) in an acute environment is essential. Successful completion of a nationally approved preceptorship course is desirable.&lt;br /&gt;&lt;br /&gt;The trust operates its own extremely active staff bank and provides excellent clinical and educational opportunities for registered nurses to gain a wide range of experience throughout all departments. If you have been qualified for six months or more with continuous practice in an acute area and are seeking a positive work life balance, the RFL temporary staffing bank welcomes your application. &lt;br /&gt;&lt;br /&gt;This is an ideal opportunity for highly motivated, enthusiastic, forward thinking nurses who do not wish to commit to a permanent contract, yet would like to gain or maintain clinical/professional skills. &lt;br /&gt;&lt;br /&gt;Please ensure that you read the person specification in detail, as any applicant that does not meet the essential criteria, will not be shortlisted.&lt;br /&gt;&lt;br /&gt;Barnet Chase Farm NHS Trust is now part of Royal Free London NHS Foundation Trust, therefore it is one organisation. If you are successful in your application for this post, you will have the opportunity to join the bank at any of these locations without having to apply separately.&lt;br /&gt;&lt;br /&gt;If you are already working at the Trust as a permanent member of staff, you do not need to fill in this application, please contact the Temporary Staffing Department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Marc Saint&lt;/p&gt;\n&lt;p&gt;Job title: Temporary Staffing&lt;/p&gt;\n&lt;p&gt;Email address: rf.tsrecruitment@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0207 794 0500 ext 23400&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital Hampstead, Barnet Hospital and Chase Farm Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Bank General Nurse Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252070", "validThrough": "2020-11-08T23:59:59+0000"}