{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000 - £48,000"}}, "datePosted": "2020-10-14T16:28:07+0100", "description": "&lt;p&gt;If you are an experienced clinical psychologist who is looking for a rewarding career, where you can make a difference and changes lives for the better, then join the team at Elysium Private Health and enjoy support from a regional network of psychologists.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working alongside the team at Elysium Private Health in Brighton by providing psychological services for children and young people aged between 4-18 with mental health needs. Y&lt;/span&gt;ou will be a part of an environment where there is a strong emphasis on teamwork and CPD, where you will have continuous access to a range of training opportunities to move your career forward.&lt;/p&gt;\n&lt;p&gt;Joining the outpatientservice,you will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working, risk assessments, facilitate staff reflective practice sessions and will be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;As an CAMHS Clinical Psychologist, you will have experience and knowledge in carrying a service users caseload, including assessing service users with complex needs, and designing and delivering specialist psychological treatment within mental health care services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting the provision of psychology services in a specified area, in collaboration with multidisciplinary teams, and under the direction and supervision of a senior psychologist.&lt;/li&gt;\n&lt;li&gt;Participating fully with the multidisciplinary team and ensuring that the service user is fully engaged in their care pathway.&lt;/li&gt;\n&lt;li&gt;Supporting clinical team working, including both direct interventions and the delivery of staff training programmes.&lt;/li&gt;\n&lt;li&gt;Supporting the clinical team and area of service in developing new initiatives and ways of working.&lt;/li&gt;\n&lt;li&gt;Working with internal and external agencies in order to enhance treatment pathways for service users.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Doctorate in Clinical Psychology (or be about to qualify)&lt;/li&gt;\n&lt;li&gt;Experience of working as part of a multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;HCPC, UKCP or preliminary accreditation.&lt;/li&gt;\n&lt;li&gt;CAMHS experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of up to£38,000 - £48,000&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN3"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8392", "longitude": "-.176918"}}, "title": "CAMHS Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227084", "validThrough": "2020-11-14T23:59:59+0000"}