{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-04T11:39:57+0000", "description": "&lt;h1&gt;&lt;strong&gt;Anaesthetic/Recovery Theatre Practitioners&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are passionate about surgery and have a desire to work in a supportive, compassionate and dedicated team, then this is the job for you!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our purpose built elective service is based at Halton Hospital in Runcorn and we are seeking motivated individuals who share our mission to be “outstanding for our patients, our communities and each other”. We welcome applications from ODP’s and anaesthetic RGN’s for an Anaesthetic/Recovery Role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have clean air theatres over 2 sites and perform a wide range of surgery including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist sports injury,&lt;/li&gt;\n&lt;li&gt;Complex hip, knee and shoulder procedures,&lt;/li&gt;\n&lt;li&gt;Foot &amp; ankle,&lt;/li&gt;\n&lt;li&gt;Minor trauma&lt;/li&gt;\n&lt;li&gt;Joint revision surgery.&lt;/li&gt;\n&lt;li&gt;Breast&lt;/li&gt;\n&lt;li&gt;Urology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our team enjoys an ideal work-life balance, as we currently work Monday to Friday and do not presently support an elective site on-call or weekend rota. We are just a short drive, via excellent motorway links, to vibrant northwest cities and beautiful countryside to enjoy your free time!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your dedication and enthusiasm, we offer a fully supported preceptorship and core competency programme, championed by our perioperative practice education team. Training includes catheterisation, cannulation, I.V. drug administration, clinical skills and human factors. Continuing Professional Development is available via both in-house and university based training initiatives such as Advanced Life Support, Theatre/Recovery qualification and the Warrington Airway Management (WAM) course with regular CPD reviews to support progress.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also have opportunities to work across site at Halton Hospital and at Warrington Hospital, where in addition to our Surgical Specialties, we support obstetrics, children’s surgery and patients who may require more clinical support services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Why not contact Jennifer Gallop or Diane Nicholls on 01928 756793 for more information? We highly recommend a visit so you can see for yourself what a great place we are to work!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Warrington Hospital&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are eight theatres on the Warrington acute site which provides services for the following specialties: Gynaecology, Obstetrics, General Surgery including laparoscopic surgery, Urology, Breast Surgery, ENT, Dental, Colorectal including laparoscopic surgery, Ophthalmic, Trauma &amp; Orthopaedic, and Paediatrics.&lt;/p&gt;\n&lt;p&gt;We also provide a 24 hour Trauma, Obstetric and Emergency service. As part of this service staff whom are based on this site are required to support emergencies and provide an out of hours service including rotation onto nights and an on call Rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Halton Hospital&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Halton is our elective general surgery hospital which has a busy 4 theatre department plus 1 clinical treatment room providing patient services for a broad range of surgical specialties including General, Gynaecology, Urology, ENT, Breast, Dental, Ophthalmics and Chronic Pain. It is situated adjacent to our Elective Orthopaedic Hospital the Cheshire and Merseyside Treatment Centre (CMTC).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Runcorn", "postalCode": "WA7 2DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3233", "longitude": "-2.69459"}}, "title": "Anaesthetic/Recovery Theatre Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255644", "validThrough": "2020-11-18T23:59:59+0000"}