{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "38694", "unitText": "YEAR", "value": "£38694-£49036"}}, "datePosted": "2020-10-22T11:39:07+0100", "description": "&lt;p&gt;The University of Leeds, in partnership with Health Education Yorkshire and the Humber and the Leeds Teaching Hospitals NHS Trust, has developed an exciting pathway of academic clinical training opportunities.&lt;/p&gt;\n&lt;p&gt;Applications are now invited for an Academic Clinical Fellowship in Dental Core Training at DCT1/2/3 level in Leeds from August 2021.&lt;/p&gt;\n&lt;p&gt;The following posts are available:&lt;/p&gt;\n&lt;p&gt;Two posts in Dental Core Training &lt;strong&gt;or&lt;/strong&gt; Primary Dental Care &lt;strong&gt;or&lt;/strong&gt; Orthodontics.&lt;/p&gt;\n&lt;p&gt;Please note that this is a multi-specialty vacancy. An appointment may not be made in this specialty.&lt;/p&gt;\n&lt;p&gt;Please read through all the relevant information available on the HEEYH Dental Core Training ACF Webpage and associated links before beginning your application (link available through Oriel).&lt;/p&gt;\n&lt;p&gt;Applications open at 10am on 27th October 2020 and the closing date is 4pm on 24th November 2020. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application forms as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, Oriel. Oriel can be accessed from the link provided. Registration is currently available for you to complete ahead of the application form opening.&lt;/p&gt;\n&lt;p&gt;All interviews will be held online. Date to be confirmed.&lt;/p&gt;\n&lt;p&gt;Academic Clinical Fellowships (ACFs) are 3 year fixed-term national training posts. They attract an NTN(A) and trainees undertake 75% clinical and 25% academic training over the term of the post. They are employed by the NHS Trust and have an honorary contract with the University at whose Medical School their academic research is supported.&lt;/p&gt;\n&lt;p&gt;ACF trainees undergo training in the generic skills required for a clinical academic: scientific methods, statistics, research governance, critical appraisal of research publication, grant writing etc. This training is via a Postgraduate Certificate in Health Research provided by the University of Leeds and for which funding is provided by NIHR.They also are eligible for a £1,000 bursary per year to support research training activity (e.g to attend academic conferences).&lt;/p&gt;\n&lt;p&gt;ACF trainees would also normally complete and submit an external funding application for a research fellowship to enable them to complete a higher degree (PhD or research MD).&lt;/p&gt;\n&lt;p&gt;All Academic Clinical Fellowships are run-through posts, regardless of specialty. A trainee entering ACF at ST1 in a specialty with a Core Training period would therefore be guaranteed continued training to CCT in the eventual specialty, as long as they progress satisfactorily through their training.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Job Description or the COPDEND website which can be accessed from Oriel.&lt;/p&gt;\n&lt;p&gt;For more information about the recruitment process and for information on how to apply please see the attached Job Description and the HEEYH Dental Core Training ACF Webpage (link available through Oriel).&lt;/p&gt;\n&lt;p&gt;With effect from 6 October 2019, all medical practictioners are on the Shortage Occupation List. This means that with the exception of applicants to Public Health, all specialty recruitment applicants will be exempt from the RLMT and there will be no restriction on their employment.&lt;/p&gt;\n&lt;p&gt;Please note: All applicants who do not already hold a National Training Number (NTN) or Deanery Reference Number (DRN) in the specialty to which they are applying for will be required to undertake the national clinical recruitment process and attend an assessment/interview for that specialty as appropriate.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education Yorkshire and the Humber", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128516"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Academic Clinical Fellow (ACF) in Dental Core Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238204", "validThrough": "2020-11-24T23:59:59+0000"}