{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-13T11:44:01+0100", "description": "&lt;p&gt;&lt;span&gt;Stour Surgery, based in the picturesque town of Christchurch, Dorset, is seeking an enthusiastic Community Outreach Nurse to join our team. If you are personable, flexible, thorough, and committed to working as part of a multi-disciplinary team and have a sense of humour, you’d fit in well. Previous experience working with frail and vulnerable patients and within a GP practice would be preferable however full training will be provided for the right candidate. We are looking for the right person to join our team! &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will be a part of our successful Stour Community Outreach &amp; Frailty Team, providing proactive management and clinical support for our vulnerable and frail patients with complex needs, reducing the amount of unplanned admission to secondary care. You will be identifying the needs of patients &amp; referring on, working with local social services and voluntary agencies as required. Ideally you will have completed the History Taking &amp; Physical Examination for Advancing Practice for acute home visiting, triaged &amp; requested by our GPs, however full training will be provided for the right applicant.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is part time over 4 days per week, 20 hours per week, days and times will be discussed at interview. Flexibility to cover for holidays and sickness is essential. Your remuneration will be competitive to reflect your experience and qualifications; benefits include NHS Pension and five weeks annual leave. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Christchurch", "postalCode": "BH231PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7361", "longitude": "-1.78239"}}, "title": "Community Outreach Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224082", "validThrough": "2020-11-13T23:59:59+0000"}