{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-06T15:46:19+0000", "description": "&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and wellbeing. To ensure we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit an enthusiastic and motivated Admin Assistant to join our Admin Team. The successful candidate will be working on reception, answering the calls from patients, dealing with post and other admin tasks. You will need to demonstrate excellent customer care skills, have knowledge of Admin and IT systems and be willing to undertake any necessary training.&lt;/p&gt;\n&lt;p&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a ew challenge, enjoy variety in your work and wish to be part of a team striving to make a difference by supporting the teams that provide support to people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note that our team will be relocating to Town Hall in 2021.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Anna Palutek - Admin Lead&lt;/p&gt;\n&lt;p&gt;anna.palutek@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01733 747484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester Centre, Peterborough", "postalCode": "PE2 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5546", "longitude": "-.270029"}}, "title": "Assistant Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260436", "validThrough": "2020-11-22T23:59:59+0000"}