{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-28T15:01:58+0000", "description": "&lt;p&gt;CBT&lt;/p&gt;\n&lt;p&gt;37.5 hours, core service is 9am-5pm Monday to Friday, with some flexibility to work earlier morning and evening clinics each week&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for dynamic and self-motivated individuals to work for Mindsmatter Improving Access to Psychological Therapy (IAPT) Service&lt;/p&gt;\n&lt;p&gt;The Mindsmatter service has dedicated teams of Psychological Wellbeing Practitioners (PWPs), Cognitive Behavioural Therapists and Counsellors who offer a range of support to help people make positive changes to reduce stress and anxiety and improve their wellbeing.&lt;/p&gt;\n&lt;p&gt;An opportunity exists for several suitably qualified Cognitive Behavioural Therapists, who are passionate about providing meaningful and effective therapeutic experiences to address common mental health problems, to join the Mindsmatter teams in Fylde and Wyre. Fylde and Wyre is a beautiful part of the UK and has lots to offer in terms of activities, stunning scenery and community.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants who have not completed their training as a CBT therapist will not be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mindsmatter CBT Therapists offer accessible screening, assessment and treatment for mild to moderate mental health problems, giving service users a greater degree of choice and flexibility by providing an extensive menu of therapies including psycho-education courses, 1:1 therapy, and group and computerised CBT programs.&lt;/p&gt;\n&lt;p&gt;You will have a proven track record of delivering high quality service outcomes against robust performance measures and have excellent interpersonal qualities; time management skills; an ability to work autonomously; and an enthusiasm for working in an ever-developing IAPT environment.&lt;/p&gt;\n&lt;p&gt;Mindsmatter is an innovative and forward thinking service. We provide rapid accessible mental health screening, assessment and treatment whilst enabling people accessing the service to have a collaborative role in the choice of intervention they receive.&lt;/p&gt;\n&lt;p&gt;The services are underpinned by a philosophy of mental health promotion, health recovery, choice, empowerment and personal responsibility.&lt;/p&gt;\n&lt;p&gt;In return, we offer continued professional development, high quality clinical supervision, supportive line management and training opportunities both internal and external.&lt;/p&gt;\n&lt;p&gt;The post is subject to enhanced DBS clearance&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Steph Mokler on stephanie.mokler@lscft.nhs.uk or Patricia Manning, email Patricia.Manning@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fylde &amp; Wyre (W), Fyde &amp; Wyre", "postalCode": "FY7 6AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9236", "longitude": "-3.00778"}}, "title": "Cognitive Behavioural Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247115", "validThrough": "2020-11-11T23:59:59+0000"}