{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa pro rata"}}, "datePosted": "2020-10-14T14:31:08+0100", "description": "&lt;p&gt;University Hospital Southampton NHS Foundation Trust is looking to appoint an experienced General Paediatric Consultant to this 5PA substantive post as Lead Consultant for Bursledon House. Bursledon House is an integral part of Southampton Children’s Hospital, and a unique service in the Wessex region, providing both secondary and tertiary level care for children with particular needs, often not addressed at other hospitals. The post holder will require a good basis in General Paediatrics, particularly the management of children with chronic disorders, and be able to work within a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bursledon House is a specialist inpatient facility within Southampton Children’s Hospital, which provides secondary and tertiary intensive multi-disciplinary assessment and/or management of physical, psychological, educational and social needs for children and young people 0-16 years. Its overall aim is to support children and young people whose needs are of such a nature, severity or longevity that they cannot be met with usual community or outpatient management. Due to the unique implementation of a joint medical and psychological inpatient approach, the Bursledon House team can sometimes offer treatment for a child or young person and their family if other treatment has not been successful&lt;/p&gt;\n&lt;p&gt;Bursledon House is a 12-bedded joint paediatric and child/adolescent psychiatric unit which is open Monday to Fridays. The experienced multi-disciplinary team includes a Consultant Child &amp; Adolescent Psychiatrist, an Associate Specialist in Paediatrics and Paediatric Gastroenterology, Therapy and Nursing teams and a school. Bursledon House receives referrals from both secondary and tertiary services across Southampton, Hampshire, Isle of Wight, Dorset, and Wiltshire and further afield.&lt;/p&gt;\n&lt;p&gt;UHS has a full General Paediatric team which the post holder will be a member of. This will provide educational and professional support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This role will provide clinical leadership for the service and the multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;The post holder will be required to work with the Associate Specialist to ensure the day-time paediatric cover of Bursledon House. There is no on-call commitment in this post.&lt;/li&gt;\n&lt;li&gt;The post-holder will review paediatric referrals to Bursledon House, assess patients and lead on the admissions. The post-holder will support other patients referred to Bursledon House.&lt;/li&gt;\n&lt;li&gt;The patients who are referred to Bursledon House usually have complex medical problems with psychological and social components to their symptoms.&lt;/li&gt;\n&lt;li&gt;There is a possibility of adding additional General PAs to the post depending on availability, appropriateness and the needs of the General Paediatric service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post would be suitable for an experienced general paediatric consultant, preferably with prior consultant service. The post-holder would need to display knowledge of the psycho-social aspects of paediatrics and an ability to work with functional diseases. We are looking for someone with strong clinical leadership skills, and the ability and enthusiasm to develop the service. The right candidate will also provide a strategic overview of the service, with particular focus on how it integrates with other services in the Children’s Hospital and regional services.&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;Job Reference: MT0362 - This vacancy closes on or before: 15th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application&lt;/p&gt;\n&lt;p&gt;For further de&lt;span&gt;tails / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Mark Alderton&lt;/p&gt;\n&lt;p&gt;General Paediatrician&lt;/p&gt;\n&lt;p&gt;Mark.alderton@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Bursledon House, Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Consultant paediatric lead – bursledon house", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226679", "validThrough": "2020-11-15T23:59:59+0000"}