{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933.00-£39,681.00 incl. Fringe HCAS"}}, "datePosted": "2020-10-15T13:44:14+0100", "description": "&lt;p&gt;How would you like to join an award winning team?&lt;/p&gt;\n&lt;p&gt;North East Hants CMHRS is an Award Winning Team in the Surrey and Borders Care Awards. We are also nationally accredited through &lt;strong&gt;ACOMHS with the Royal College of Psychiatrists. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the team is expanding, a full time vacancy have arisen at Aldershot Centre for Health for Community Psychiatric Nurses to work within a busy Community Mental Health Recovery service. The post holder will work within a multi-disciplinary team alongside , Occupational Therapists, Psychologists and Psychiatrists and community support workers. We also offer Art therapy. The post holder will have the opportunity to be a care coordinator holding their own caseload under the Care Program Approach. The successful candidate will be expected to take part in assessments, including risk assessments. There is also the opportunity to co-facilitate therapeutic groups. We have care pathways and work with structured clinical management for a recovery focus.&lt;/p&gt;\n&lt;p&gt;All staff receive regular supervision and group reflective practice happens monthly. We are looking for a good team player who has experience of community work. You will have excellent communication skills and want to make a difference. The role enables your ability to manage your own time effectively to meet the needs of your caseload and team.&lt;/p&gt;\n&lt;p&gt;We have good links to third sector community links in the community including the Safe Haven and local GPs.&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aldershot, Surrey", "postalCode": "GU11 1AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2543", "longitude": "-.765632"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228423", "validThrough": "2020-11-17T23:59:59+0000"}