{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22200", "minValue": "20200", "unitText": "YEAR", "value": "£20,200 - £22,200 per annum (pro-rata_"}}, "datePosted": "2020-10-28T14:00:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Trust Recruitment Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Norwich&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £20,200 - £22,200 per annum (pro-rata)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 25.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Wednesday 25th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: Due to the nature of the position the successfully appointed applicant will be required to have a valid UK driving licence and own vehicle.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This busy and exciting role involves the recruitment of flexible workers across various clinical staff groups in order to support the Trust in their flexible staffing needs. The successful candidate will have to demonstrate their ability to build effective working relationships with internal and external stakeholders across a wide range of professional and managerial groups.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Determine that applicants meet requirements by studying job descriptions and applications against demand.&lt;/li&gt;\n&lt;li&gt;Contribute to all aspects of delivering successful interview and assessment centres.&lt;/li&gt;\n&lt;li&gt;Where required attend key recruitment events including university and career fairs promoting NHSP, particularly flexible employment options.&lt;/li&gt;\n&lt;li&gt;Undertake and develop attraction, validation and registration activities in order to maintain and continually develop a pipeline of applicants.&lt;/li&gt;\n&lt;li&gt;Organise and attend interview and assessment centres as required by pipeline and Trust demand.&lt;/li&gt;\n&lt;li&gt;Be passionate about customer satisfaction and lead by example focusing on operational and commercial excellence whilst being able to recognise and drive forward a service development opportunity&lt;/li&gt;\n&lt;li&gt;Ensure the management of maintaining detailed records and databases to continuously evaluate and improve the ongoing recruitment&lt;/li&gt;\n&lt;li&gt;Ensure all policies and procedures are adhered to according to company guidelines&lt;/li&gt;\n&lt;li&gt;Ensure a high level of service is delivered to FWs and partner Trusts - working at the frontline developing credibility in service provision through key working relationships.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Main Tasks and Operational Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Based at one of our client Trusts, deliver and support all aspects of flexible worker (&#39;FW’) registration and validation activity based on Trust demand.&lt;/li&gt;\n&lt;li&gt;Perform the role of subject matter expert in all matters relating to FW registration and validation activities, including cross-functional linkages, processes and systems.&lt;/li&gt;\n&lt;li&gt;Identify most efficient recruitment stream and ensure activities are focussed to maximise their potential.&lt;/li&gt;\n&lt;li&gt;Deliver activities to attract, register and validate FWs to meet Trust demand and improve Trust relationships, including engaging with, screening and interviewing applicants and successfully processing their applications in a timely and fully compliant manner.&lt;/li&gt;\n&lt;li&gt;Deliver regional recruitment activities including: ensuring that Trust FW registration requirements are met in line with Trust strategic needs; communicate these to all relevant stakeholders.&lt;/li&gt;\n&lt;li&gt;Gain full knowledge of all services offered and identifies opportunities to introduce additional services to Trusts.&lt;/li&gt;\n&lt;li&gt;Ensure all systems and processes are used in line with business&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent interpersonal communication skills including good written and oral English.&lt;/li&gt;\n&lt;li&gt;Ability to build effective working relationships with internal and external stakeholders across a wide range of professional and managerial groups.&lt;/li&gt;\n&lt;li&gt;Ability to negotiate with all stakeholders with tact and discretion.&lt;/li&gt;\n&lt;li&gt;Strong influencing/assertiveness skills&lt;/li&gt;\n&lt;li&gt;Proven ability to lead by example.&lt;/li&gt;\n&lt;li&gt;Ability to appraise, motivate and develop team members to improve performance.&lt;/li&gt;\n&lt;li&gt;Strong time management and resource planning skills and ability to work to priorities and deadlines.&lt;/li&gt;\n&lt;li&gt;Able to pass pre-employment checks&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly with occasional travel&lt;/li&gt;\n&lt;li&gt;Ability to undertake desk work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;strong&gt; &lt;/strong&gt;\n\n\n\n\n&lt;p&gt;&lt;strong&gt;What perks are we offering in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary with the opportunity for progression for exceptional performers&lt;/li&gt;\n&lt;li&gt;27 days’ annual leave per year plus 8 public holidays&lt;/li&gt;\n&lt;li&gt;Access to a stakeholder pension scheme&lt;/li&gt;\n&lt;li&gt;Health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Access to a discount scheme and an employee recognition scheme.&lt;/li&gt;\n&lt;li&gt;Agile working&lt;/li&gt;\n&lt;li&gt;Ability to buy and sell annual leave&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Corporate Staff", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120988"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Trust Recruitment Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246870", "validThrough": "2020-11-11T23:59:59+0000"}