{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa pr"}}, "datePosted": "2020-10-27T10:01:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Nurse Practitioner to Cover Maternity Leave&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Colorectal Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual for the role of an Advanced Nurse Practitioner for the Colorectal Department to cover maternity leave. This is a fantastic opportunity for an Advanced Nurse Practitioner with Non-Medical Prescribing qualification and significant clinical experience. The candidate must demonstrate commitment to excelling in colorectal practice, be highly experienced and be able to establish this important role successfully in its foundations to meet the needs of this ever demanding service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will support the day to day Colorectal Triage Nurse Led Service to ensure patients receive a high quality service which encompasses a holistic approach to their care and wellbeing within the timeframe of their specific pathway. Colorectal fast track patients will be the priority but the service is developing to include appropriate non-urgent referrals. The post-holder will be supported to acquire outpatient clinic skills and run independent colorectal fast-track and telephone triage clinics. The role involves attending and being actively involved in the weekly Colorectal MDT meetings, presenting patients to the meeting, following up on any plan, liaising with peers, patient and GPs.&lt;/p&gt;\n&lt;p&gt;The post-holder will also be required to support the nurses and junior doctors on the general surgery ward. This would involve attending elective patient ward rounds and supporting the enhanced recovery programme.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates with excellent interpersonal and organisational capabilities, who are motivated innovative and above all patient focused.&lt;/p&gt;\n&lt;p&gt;Part Time applications also considered.&lt;/p&gt;\n&lt;p&gt;If this sounds like the perfect opportunity for you then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 10/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: week commencing 23/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you wish to discuss the role further or for an informal visit please do not hesitate to contact:&lt;/p&gt;\n&lt;p&gt;Jan Jones ANP, Surgery, 0300 019 8640. Email: janice.jones@poole.nhs.uk or Deborah Straw Matron for Surgery &amp; Gynaecology on bleep 0950 or on 0300 019 8652. Email: Deborah.Straw@poole.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Advanced Nurse Practitioner specialising in Colorectal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243897", "validThrough": "2020-11-10T23:59:59+0000"}