{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 per annum, inc HCA"}}, "datePosted": "2020-11-06T09:16:05+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has now opened to integrate the Maternity Support Worker role into our maternity service, enhancing the care women, babies and their families receive alongside the midwives and obstetric team at Kings College Hospital NHS Foundation Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The course will be a 2 year fixed term contract with a commitment to completion of the course in this time frame. The course will offer work experience in all areas of the maternity service and will require you to rotate throughout the following departments within the unit; Antenatal Clinic, Maternal Assessment Unit, Nightingale Birth Centre, William Gilliatt Antenatal and Postnatal ward and the Community setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The academic aspect of the course will be facilitated by an external training provider and you will be given time to attend study days. You will be supported by an assessor from the training provider throughout the duration of the course.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will gain further knowledge and practical skills during your placements and will be supported and assessed by two practical skill assessors on site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role involves you supporting midwifery teams to provide care to mothers and babies throughout their maternity journey facilitating a positive experience. This requires you to be able to work days, nights and bank holidays inclusive of the holiday season.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a level 3 course and it is essential you hold Maths and English functional skills at Level 1, have completed your Care Certificate and that your mandatory training is up to date.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Jacqueline Sahiri - Matron for Inpatients - jsahiri@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Paige O&#39;Connor - Senior Midwife - paigeo&#39;connor@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Maternity Support Worker Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258990", "validThrough": "2020-11-20T23:59:59+0000"}