{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-10-30T11:25:39+0000", "description": "&lt;p&gt;The Facilities Logistics Department currently has vacancies for relief Facilities Technician (Post Room), 37.5 hrs a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must be prepared to undertake shift patterns which vary with start times but predominantly 8am to 4pm, Monday to Friday and involves working at St James Hospital, Leeds. The role involves providing cover for Facilities Technician staff across the Trust and therefore includes a wide range of functions for which training will be provided. &lt;br /&gt; &lt;br /&gt; Under the direction of the Logistics Supervisor to ensure that all post/goods received by the customers are scanned or have the necessary paperwork and signature of receipt, providing trace-ability and satisfying audit requirements. To assist in ensuring that the post room environment is a safe and tidy and that all security procedures are adhered to.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To work as part of a team responsible for the provision of a quality postal service for both internal and external mail which involves the use of some computers systems.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide “front end” contact with customers and to be the link between receipt and the distribution of post.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Applicants must be able to work under direct supervision but also make frequent use of their own initiative and discretion. &lt;br /&gt; &lt;br /&gt; Applicants should note that most of the duties of a relief Facilities Technician is of a physical nature and will involve a great deal of lifting and carrying of heavy items, pushing heavy trolleys, using manual handling equipment wherever necessary..&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For general enquiries in relation to these posts please contact Simon Gallagher, Logistic Coordinator (Logistics &amp; Transport) on 0113 2063893 or email: simon.gallagher@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please do not send your CV in your emails.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122057.jpg", "name": "Estates and Facilities", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122057"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Facilities Technician/ Post Room Operative", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249928", "validThrough": "2020-11-13T23:59:59+0000"}