{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681"}}, "datePosted": "2020-10-30T10:17:17+0000", "description": "&lt;p&gt;The COVID-19 pandemic affects all our communities, now is the time for us to come together to truly make a difference. To increase testing for COVID-19, the Government has significantly expanded its laboratory capacity and staffing. As a result a new COVID-19 Lighthouse Testing Laboratory will be opening in Bracknell. The laboratory will be managed by Berkshire and Surrey Pathology Services, which is the first to be run by the NHS. BSPS is a large and established pathology network operating across Royal Berkshire, Royal Surrey, Frimley Health and Ashford and St Peter’s Hospitals NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Specialist Practitioners to help us achieve our target of running tens of thousands of tests every day.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Be an experienced scientist with well-developed specialist knowledge &amp; skills in molecular/virology fields&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;Required to work unsupervised (including on shift or on-call systems where appropriate and necessary)&lt;/li&gt;\n&lt;li&gt;Receiving, analysing and reporting specimens for COVID-19 testing&lt;/li&gt;\n&lt;li&gt;Perform a complex range of tests using dedicated scientific equipment on all samples received&lt;/li&gt;\n&lt;li&gt;Required to interpret and report results in accordance with agreed service protocols&lt;/li&gt;\n&lt;li&gt;Required to ensure their appropriate continual professional development&lt;/li&gt;\n&lt;li&gt;Train and supervise less experienced staff as directed by their line manager.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful candidates need to have a Biomedical/Medicine Science or equivalent academic qualification and IBMS Specialist portfolio, equivalent post graduate diploma or equivalent in depth experience in molecular/virology fields. It is desirable to be registered with the Health and Care Professions Council (HCPC) but not essential.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a relevant laboratory is essential, preferably molecular or virology. It is essential to have the ability to communicate clearly, follow instructions, have accurate record keeping skills and be able to make decisions. Candidates will be expected to train, support and advice less experienced staff, such as trainees, students and Medical Laboratory Assistants therefore previous supervisory experience is required.&lt;/p&gt;\n&lt;p&gt;The laboratory will be operating 24 hours a day, seven days a week; therefore successful candidates need to be able to work on a shift pattern. Initially there will be three shift patters of 8 hours (6am-2pm; 2pm - 10pm; 10pm to 6am) however in the future the shifts will change to two 12 hour shifts.&lt;/p&gt;\n&lt;p&gt;In return you will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full time employment, 37.5 hours per week (part time opportunities are available, however on the defined hours)&lt;/li&gt;\n&lt;li&gt;Secure environment of a fixed term contract for 12 months&lt;/li&gt;\n&lt;li&gt;Additional benefits of working with the NHS&lt;/li&gt;\n&lt;li&gt;Be part of something special – this is the first Lighthouse Lab run by the NHS&lt;/li&gt;\n&lt;li&gt;Sense of pride that you are supporting the nation and NHS in the fight against COVID&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The host employing organisation will be Royal Berkshire NHS Foundation Trust. The laboratory will be based at Bracknell Healthspace, Brants Bridge, Bracknell.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please email lighthouse@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bracknell", "postalCode": "RG12 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4138", "longitude": "-.736136"}}, "title": "Bracknell Lighthouse Lab - Specialist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249699", "validThrough": "2020-11-29T23:59:59+0000"}