{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-10-26T10:16:23+0000", "description": "&lt;p&gt;We are seeking an enthusiastic, dynamic, and innovative individual to manage the Community Enablement &amp; Recovery Team (CERTs), Care Home Liaison (CHL) and Discharge team.&lt;/p&gt;\n&lt;p&gt;You will have a relevant Mental Health professional qualification with experience of community, clinical and operational management and a strategic view of meeting the challenges facing older people community mental health services.&lt;br /&gt;&lt;br /&gt;You will be responsible for all issues relating to clinical practice and day to day management of the team. You will be highly motivated, able to work autonomously with a proven track record of taking projects forward to completion. You will be able to demonstrate excellent managerial and leadership skills.&lt;br /&gt;&lt;br /&gt;Building on the Birmingham Older People Programme of the Birmingham &amp; Solihull Sustainability and Transformation Plan (STP), you will have a sound knowledge base of the principles of early intervention and recovery, this will be underpinned with an understanding of implementing and embedding a quality service whilst working with partners in the wider health economy.&lt;br /&gt;&lt;br /&gt;You will be required to possess excellent communication and relationship building qualities, and must be able to demonstrate up-to-date knowledge of the latest legislation and government initiatives and participate in the on-going development of the service providing effective care through the management and development of staff. You will be committed to high standards of practice and the ability to drive up standards to ensure high quality service user experience and outcomes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNorah FosterJob titleClinical Nurse ManagerEmail addressnorah.foster@nhs.netTelephone number0121 301 5843 /07985 882 505&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Juniper Centre, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 8a Dementia &amp; Frailty Early Intervention Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241970", "validThrough": "2020-11-08T23:59:59+0000"}