{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26896", "minValue": "25215", "unitText": "YEAR", "value": "£15-16ph depending on experience and skills"}}, "datePosted": "2020-11-03T11:04:22+0000", "description": "&lt;p&gt;We are looking to welcome an experienced, qualified General Practice Nurse into our practice to assess, plan, develop, implement and evaluate treatment programmes for our patients. &lt;strong&gt;The role is part time, ideally Mondays, Tuesdays and Wednesdays (full days) to cover clinics and sessions.&lt;/strong&gt; The main responsibilities of the role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertaking health assessments, administering medication and treatments and performing diagnostic tests;&lt;/li&gt;\n&lt;li&gt;Providing and evaluating a range of health interventions to ensure that patients’ health and social care needs are met;&lt;/li&gt;\n&lt;li&gt;Healthand well-beingpromotion plus individual person centered plans for patients with/at risk of a long term condition;&lt;/li&gt;\n&lt;li&gt;Managing and treating long-term conditions in line with national and local policies and practice needs;&lt;/li&gt;\n&lt;li&gt;Reviewing medication for therapeutic effectiveness, in accordance with evidence based practice and national/practice protocols, and work with patients to support adherence to prescribed treatments.&lt;/li&gt;\n&lt;li&gt;Prioritising health problems, intervening appropriately, to assist the patient in complex, urgent or emergency situations, including initiation of effective emergency care;&lt;/li&gt;\n&lt;li&gt;Supporting and managing health needs of women presenting for family planning and cervical cytology consultations;&lt;/li&gt;\n&lt;li&gt;Implementing and participating in vaccination and immunisation programmes for both adults and children including patients travelling abroad;&lt;/li&gt;\n&lt;li&gt;Meeting the needs of patients presenting for opportunistic wound care;&lt;/li&gt;\n&lt;li&gt;Hypertension review and management;&lt;/li&gt;\n&lt;li&gt;Running Asthma, COPD, Diabetes clinics and reviews;&lt;/li&gt;\n&lt;li&gt;New patient and health checks.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are an experienced Practice Nurse looking for an exciting new change in career then we would love to hear from you. You will have the following skills and qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing degree and at least 2 years post qualification experience in a General Practice setting;&lt;/li&gt;\n&lt;li&gt;Current NMC registration with an active PIN;&lt;/li&gt;\n&lt;li&gt;Fundamentals of Practice Nursing course (General Practice Nurse Foundation Programme) or equivalent experience or qualifications;&lt;/li&gt;\n&lt;li&gt;Competence to undertake Asthma, COPD and Diabetic clinics / reviews and hold relevant certificates;&lt;/li&gt;\n&lt;li&gt;Evidence of clinical skills and experience in treatment room consultation, phlebotomy, ECG recording, screening, management of long-term conditions, cervical cytology sampling, vaccinations and immunisations, assisting with minor surgery, dressing and wound care and recording spirometry;&lt;/li&gt;\n&lt;li&gt;Compassionate,empatheticapproach anddemonstrablekindness in all aspects of your work as well as valuing the dignity of our patients, relatives, carers and colleagues.&lt;/li&gt;\n&lt;li&gt;Knowledge and application of supporting long-term conditions.&lt;/li&gt;\n&lt;li&gt;Insight and understanding of current issues in nursing and NHS.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS16 5SB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.564", "longitude": ".442589"}}, "title": "General Practice Nurse (part-time)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253617", "validThrough": "2020-11-17T23:59:59+0000"}