{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T11:16:17+0100", "description": "&lt;p&gt;Are you looking for an exciting opportunity within a passionate and supportive team?&lt;/p&gt;\n&lt;p&gt;If you are then Pavilion Ward is the place to be!&lt;/p&gt;\n&lt;p&gt;Pavilion Ward is a 10 bedded, male, Psychiatric Intensive Care Unit (PICU). We primarily work with individuals who are aged 18-65 and we are located within Millview hospital in Hove.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced or newly qualified mental health nurses who want to develop within a robust team and have a commitment to maintaining and improving the service.&lt;/p&gt;\n&lt;p&gt;As a staff member on Pavilion Ward you will be working alongside an established and experienced multi-disciplinary team (MDT). This consists of nurses, healthcare assistants, nursing associates, doctors, the occupational therapy team, a psychologist, the pharmacy team, an art therapist and out PAT (pets as therapy) dog Mutley.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Our vision on Pavilion Ward is &quot;together we will create a supportive, encouraging and inclusive community where our wellbeing can flourish and we can become our happiest, strongest and wisest selves&quot;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate on Pavilion Ward about providing the highest standards of care and ensuring to implement least restrictive practice. We were part of an 18 month quality improvement project which allowed us to monitor and implement change around restrictive practices. This project has now finished but is something that we are continuing to implement on the ward.&lt;/p&gt;\n&lt;p&gt;As a result of completing this project and us significantly reducing our restrictive practice, Pavilion Ward won 3 awards at the trusts positive practice awards last year. These were: inspire to change, an award for Mutley and a final award for money that was raised by the team. We hosted a charity event in a church and some of the team also completed a charity run.&lt;/p&gt;\n&lt;p&gt;In addition to this we are also AIMS accredited, which is a set of additional standards whereby outstanding care is being achieved.&lt;/p&gt;\n&lt;p&gt;On the ward we are working towards fully implementing safe wards. This is a set of interventions which aim to reduce agitation and violence and aggression. We have implemented our getting to know me board and also positive words.&lt;/p&gt;\n&lt;p&gt;As a staff member on Pavilion Ward you would be provided with a range of different opportunities. We work collaboratively with prisons, supporting to transfer individuals to Pavilion Ward, who may need more intensive healthcare support and we also work closely with the police accepting individuals into our place of safety.&lt;/p&gt;\n&lt;p&gt;There is also a yearly opportunity to attend NAPICU (National Association of Psychiatric Intensive Care Units). This is a national conference which allows for individuals to network with other acute services and also complete a lot of learning, possibly even shamelessly stealing ideas from other services. Last year Pavilion Ward had the opportunity to present at NAPICU and have also presented at a variety of other conferences such as the South of England Quality Improvement collaborative which was hosted in Bristol.&lt;/p&gt;\n&lt;p&gt;If you are a qualified or newly qualified nurse, with drive and passion and a desire for self-development, then you are a perfect person to join our team. We have an outstanding preceptorship programme for newly qualified staff and also ensure all staff are provided with a robust supervision plan and also a thorough induction. There are many opportunities for further development within the team and we welcome new ideas, no matter what your role or band is. You will always be listened to.&lt;/p&gt;\n&lt;p&gt;To apply for this role, please ensure you have the required qualification/PIN or working towards it and actively on a nursing degree.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;You can find us on twitter at @pavilion_ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information and to arrange to meet one of our ward managers or matrons, please contact;&lt;/p&gt;\n&lt;p&gt;Alex Rhind, Matron&lt;/p&gt;\n&lt;p&gt;07471034152&lt;/p&gt;\n&lt;p&gt;Alex.Rhind@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mill View Hospital Nevill Avenue Hove, Brighton &amp; Hove", "postalCode": "BN3 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.842", "longitude": "-.189739"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240268", "validThrough": "2020-11-06T23:59:59+0000"}