{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22000", "minValue": "22000", "unitText": "YEAR", "value": "22,000"}}, "datePosted": "2020-11-05T20:38:48+0000", "description": "&lt;p&gt;&lt;span&gt;Beacon Medical Services Group is a leading provider of specialist healthcare and diagnostic services to both NHS patients and the Private Healthcare sector. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are commissioned by the NHS and are registered and fully compliant with the Care Quality Commission, to provide community healthcare services across Greater Manchester, Greater Preston and East Midlands.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our ethos is ‘care with passion’ in delivering a wide range of Consultant-led, high-quality services  at clinics closer to patients&#39; homes using the latest state-of-the-art equipment, providing the highest level of patient satisfaction. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with a genuine passion for &lt;strong&gt;using data to drive change in the way health services are provided to serve our Community.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With experience in Healthcare Informatics, you will have a high level of analytical and problem-solving skills as well as a strong understanding of healthcare information and performance standards. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In this role, you will have responsibility for managing analytical projects within the Organisation, being proactive and adaptable in finding analytical solutions to problems, analysing and triangulating data in innovative ways, and presenting the findings clearly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;With knowledge and experience of the community healthcare environment and tender bidding processes, applicants must be able to demonstrate an ability to analyse a variety of market information including Organisational data, market trends and tender specifications to develop marketing strategies to support the Organisation through successful tendering.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M22 4DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4063", "longitude": "-2.26229"}}, "title": "Business Informatician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258807", "validThrough": "2020-12-05T23:59:59+0000"}