{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 £79,860 - £107,668 pa"}}, "datePosted": "2020-10-20T16:17:02+0100", "description": "&lt;p&gt;Respiratory Service - Business Expansion&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2 x Lung Cancer Consultant post.&lt;/li&gt;\n&lt;li&gt;5 x Consultants in Respiratory Medicine&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an exciting time to join our team in Respiratory Medicine at Blackpool Teaching Hospitals NHS Foundation Trust and applications are invited for a Lung Cancer Consultant and 6 additional Consultant posts in Respiratory Medicine to work with our existing team of 9 whole time equivalent Consultants.&lt;/p&gt;\n&lt;p&gt;Due to the recent outcome of our successful business case to expand our Respiratory services we will now be developing a new NIV and Medical High Care Unit (MHCU) and support for our dedicated acute Respiratory Assessment Centre (RAC) and an Ambulatory Care service including Hot Clinics. The department is fast growing and there are plans in place to recruit additional nursing and support staff as part of the expansion.&lt;/p&gt;\n&lt;p&gt;There is scope for any of our successful candidates to develop their own area of sub-specialisation. Current interests within the department include Lung Cancer, Sleep, NIV, Pulmonary Hypertension, Pleural Disease, TB, Interstitial Lung Disease Bronchiectasis, Asthma and Cystic Fibrosis. However as we are developing the NIV and MHCU we are looking for candidates that have the skills to assist with the development of the service.&lt;/p&gt;\n&lt;p&gt;Our team operate an on ward off ward rota across 3 wards (Wards 5,7 and 10) which allows the Consultant pairings to cross cover and therefore protect our new, FT and MDT clinics which has proved to be very successful.&lt;/p&gt;\n&lt;p&gt;Our respiratory department is also nationally recognised in contributing to national Research trials, which is supported by a very active research department.&lt;/p&gt;\n&lt;p&gt;AAC Date - TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Thomas BongersTelephone number01253 956706Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interested applicants should contact Dr Thomas Bongers, Dr Tarek Saba or Dr Anju Mirakhur on 01253 956706 or 01253 955144, or Dr Peter Hayes, Deputy Divisional Director on 01253 955519&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BVH, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Respiratory Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235224", "validThrough": "2020-11-10T23:59:59+0000"}