{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18093", "minValue": "18093", "unitText": "YEAR", "value": "£18,093 per annum pro rata"}}, "datePosted": "2020-10-28T09:37:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Finance Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary up to £18,093 per annum, pro-rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours per week to be worked flexibly in accordance with the needs of the service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Finance Assistant to join the Finance Team here at Mountbatten Hampshire.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent customer service skills with a professional and pleasant manner. A flexible approach to working routines, the ability to do a variety of tasks at one time and to work within a team and also alone is essential.&lt;/p&gt;\n&lt;p&gt;This is a very busy role, working with complex systems and with a large and varied workload. We are therefore looking for someone enthusiastic and excited to take on a new challenge.&lt;/p&gt;\n&lt;p&gt;You will be required to attend and maintain regular training courses and to follow the policies and procedures set down by Mountbatten Hampshire.&lt;/p&gt;\n&lt;p&gt;Countess Mountbatten Hospice rated ‘Good’ by the CQC.&lt;/p&gt;\n&lt;p&gt;This role provides daily efficient administrative support to our busy Finance Team. You will be responsible for processing of expenses and company credit card invoices on to the Sage software system, maintaining petty cash tin and reconciliation of receipts, weekly logging of cash and cheques in the running spreadsheet ready for banking, filing of invoices and taking calls from suppliers.&lt;/p&gt;\n&lt;p&gt;We are therefore looking for someone enthusiastic with good spreadsheet and numeracy skills. Ability to work effectively as part of a team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be flexible in their approach. The ability to prepare and maintain spreadsheets in excel is ideal. They will have strong admin skills and will assist in the smooth running of the office wherever possible.&lt;/p&gt;\n&lt;p&gt;A flexible approach to working routines, the ability to do a variety of tasks at one time and to work within a team and also alone during staff absence is essential.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Charity environment is desirable, but training will be provided to enhance the post holder’s skill set.&lt;/p&gt;\n&lt;p&gt;Mountbatten Hampshire rated ‘Good’ by the CQC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a wide range of benefits to our employees including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Onsite Parking&lt;/li&gt;\n&lt;li&gt;Development and Training opportunities&lt;/li&gt;\n&lt;li&gt;Generous Annual Leave, Occupational Sickness and Maternity Benefit Schemes, subject to qualifying conditions&lt;/li&gt;\n&lt;li&gt;Recognition of previous Agenda for Change NHS Continuous Service for incremental progression, annual leave, maternity and sickness benefits&lt;/li&gt;\n&lt;li&gt;Pensions Schemes, including continuation of contributions to your NHS Pension scheme, subject to eligibility&lt;/li&gt;\n&lt;li&gt;Local Benefit Scheme including discounts with all ferry operators&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The post is subject to an Enhanced DBS check the cost of which is covered by the Hospice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date – 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion and visit about this opportunity, please contact Jean Joshua, Financial Controller on 02382 548887&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135075.png", "name": "Countess Mountbatten Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Finance Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245841", "validThrough": "2020-11-08T23:59:59+0000"}