{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa + HCAS"}}, "datePosted": "2020-10-13T20:15:26+0100", "description": "&lt;p&gt;Chelsea and Westminster Trust have developed a unique capital nurse rotation programme in partnership with health education England( HEE) This is an exciting opportunity for you to gain significant experience and knowledge. It will provide you with a great foundation to kick start your career in nursing.&lt;/p&gt;\n&lt;p&gt;The 2 years rotation will lay a solid foundation on which to build a successful career in nursing consolidating nurse training including preceptorship and leadership.&lt;/p&gt;\n&lt;p&gt;What makes it different from all the other rotational programmes ?&lt;/p&gt;\n&lt;p&gt;What makes this opportunity so unique and exciting is the Foundation Programme will base its model of supervision on medical education. In each rotation you are guaranteed to undertake specific learning opportunities with not only clinical supervision but education supervision ensuring you have a planned career development plan in the area of your interest. An education supervisor will oversee the rotation programme and be involved in liaising between candidates and rotational placements .&lt;/p&gt;\n&lt;p&gt;What opportunities will I receive ?&lt;/p&gt;\n&lt;p&gt;In the first rotation each capital nurse will undertake a comprehensive preceptorship programme which is run by our preceptorship lead. This involves 8 class room based skills days which consolidates learning within the first 12 months. There will be protected time to update progression and address any learning needs that are required.&lt;/p&gt;\n&lt;p&gt;In the second rotation each capital nurse will undertake course in caring for the deteriorating patient. This course will be paid for by the hospital.&lt;/p&gt;\n&lt;p&gt;On completion of the rotational programme staff will have the opportunity to move internally to vacancies within the Trust in areas of their interest .&lt;/p&gt;\n&lt;p&gt;Benefits for you&lt;/p&gt;\n&lt;p&gt;Clear, structured career development progression at the end of the 2 years programme.&lt;/p&gt;\n&lt;p&gt;Nurses are confident and competent to undertake preparation towards band 6 &lt;br /&gt;roles. Following this programme many nurses have gone on to take on a band 6 position and specialist roles.&lt;/p&gt;\n&lt;p&gt;Nurses obtain leadership management and mentorship skills incorporating work based learning.&lt;/p&gt;\n&lt;p&gt;Nurses gain transferable nursing skills through action learning.&lt;/p&gt;\n&lt;p&gt;Nurses undertake action learning and gain reflective practice skills and self-development.&lt;/p&gt;\n&lt;p&gt;Opportunity for nurses to experience a range of specialist areas in a variety of roles .&lt;/p&gt;\n&lt;p&gt;Nurses obtain both clinical and educational supervision .&lt;/p&gt;\n&lt;p&gt;The Rotation Programme offers;&lt;/p&gt;\n&lt;p&gt;2 Years Medical Rotation&lt;/p&gt;\n&lt;p&gt;The medical rotation would consist of 3 placements on any of the following :&lt;/p&gt;\n&lt;p&gt;An Acute Admissions ward to provide experience managing the acutely unwell patients admitted directly from accident and emergency where they are stabilized prior to transfer.&lt;/p&gt;\n&lt;p&gt;An acute respiratory ward, managing complex patients with acute respiratory conditions.&lt;/p&gt;\n&lt;p&gt;A gastroenterology ward, managing, both the acute and chronic life changing conditions.&lt;/p&gt;\n&lt;p&gt;A care of the elderly ward, which could also include a placement on our newly refurbished dedicated dementia specialist unit.&lt;/p&gt;\n&lt;p&gt;Option to have your final placement in A/E or in the newly expanded ITU&lt;br /&gt;2 Years Surgical Rotation&lt;/p&gt;\n&lt;p&gt;The surgical rotation would include a placement in orthopaedics, caring for both elective joint replacement and trauma patients.&lt;/p&gt;\n&lt;p&gt;A second placement would involve working in the ambulatory setting of day surgery which incorporates eight different specialties of surgery or the Surgical Assessment Unit where patients requiring a surgical opinion are assessed in hot clinics. There is also an opportunity to work in the burns department.&lt;/p&gt;\n&lt;p&gt;The third placement would be discussed with you as there is an option to work to be placed in ITU/burns&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Who is eligible to apply ?&lt;/p&gt;\n&lt;p&gt;Any qualified nurse with less than 1 years’ experience&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Aibhin Burke Aibhin.burke@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Annette Lloyd: Annette.lloyd@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital &amp; Chelsea and Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Staff Nurse - Capital Nurse Programme", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225295", "validThrough": "2020-11-10T23:59:59+0000"}