{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "20000", "unitText": "YEAR", "value": "£20- 25,000 FT"}}, "datePosted": "2020-10-26T22:57:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Looking for a qualified Pharmacy Dispenser interested in joining a friendly, local GP surgery.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Knights Hill Surgery, West Norwood, London SE27 0DF&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;: 20 – 25 hours during weekdays (mornings preferred)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;: £20 - 25,000 for 37.5 hours (depending on experience), pro-rata for part time. Overtime paid if required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working with our in house Primary Care Pharmacist and GPs to support the delivery of the highest quality primary care service to our patients. More specifically, our Pharmacy Dispensers are responsible for helping to manage the prescriptions and medication requirements of our growing patient population.&lt;/p&gt;\n&lt;p&gt;Duties include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Checking and processing prescription requests&lt;/li&gt;\n&lt;li&gt;Working with in-house Pharmacists &amp; GPs to deal with medication related queries.&lt;/li&gt;\n&lt;li&gt;Following Practice procedures to identify patients due for reviews and book them with appropriate clinicians.&lt;/li&gt;\n&lt;li&gt;Working with the Nursing team to managing supply &amp; stock levels of emergency drugs and other clinical supplies in the practice&lt;/li&gt;\n&lt;li&gt;Liaising with local community pharmacies to address prescription related issues.&lt;/li&gt;\n&lt;li&gt;Helping the Clinical team with Audits, Medicines Optimisation, and ad-hoc health promotion campaigns&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The right candidate will demonstrate a strong eye for detail and excellent organisational skills, as well as being friendly, approachable and willing to be part of a close working team.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Minimum requirements: Dispensing Assistant qualification and at least 1-year experience in community pharmacy or hospital setup.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a small group of close-knit surgeries in South East London on a mission to give our patients the best healthcare in London. We use a multidisciplinary approach – bringing together GPs, Nurses, HCAs, Pharmacists, Paramedics and Mental Health Nurses to deliver an efficient and effective service with strong outcomes for patients.&lt;/p&gt;\n&lt;p&gt;With high levels of patient satisfaction and low waiting times, we’ve been able to grow to almost 50,000 patients and we continue to grow at a rapid pace.&lt;/p&gt;\n&lt;p&gt;We serve our patients across 7 CQC ‘Good’ rated sites in Lambeth, Southwark and Lewisham, with each site having its own dedicated multidisciplinary team. You’ll join one of these site-based teams but you’ll be part of the larger Penrose Health family as well!&lt;/p&gt;\n&lt;p&gt;As part of Team Penrose, you will be covered by our Vitality Private Health Insurance, you’ll have the choice of a NOW or NHS pension and you’ll benefit from a comprehensive sick pay scheme after your first year with us.&lt;/p&gt;\n&lt;p&gt;On top of the employment benefits, this year we have seen a month dedicated to appreciating our team members, offered art on line classes, enjoyed ice cream from a visiting ice cream van, enjoyed surprise gifts, thank you self-care bags, fresh fruit deliveries, hosted a group-wide bake-off and this month we&#39;ll be having some Halloween fun! These are just some (but not all) of the things we do to make this a great place to work! Underneath all of this, you will also find a core strength and camaraderie that exists in each of our surgery teams and across the group – we really are a family.&lt;/p&gt;\n&lt;p&gt;All our team are enthusiastic, friendly and we want to make a real difference to our patients – come and be a part of the team!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Penrose Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130018"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Norwood", "postalCode": "SE27 0DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4316", "longitude": "-.105019"}}, "title": "Pharmacy Dispenser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243652", "validThrough": "2020-11-09T23:59:59+0000"}