{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "30615", "unitText": "YEAR", "value": "Up to £30,615pa DoE"}}, "datePosted": "2020-09-25T21:55:19+0100", "description": "&lt;p&gt;Cygnet Hospital Harrow provides a recovery focused service treating a wide range of mental health problems. We also offer specialist diagnostic, assessment and inpatient services for individuals with mental health needs and who also have a dual diagnosis of autism spectrum disorder. The service aims to help people stabilise with appropriate support and return to the community or the least restrictive environment as quickly as possible.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role involves working with individuals to maximise their potential and to enable them to enjoy the best possible quality of life via the delivery of an evidence-based SLT service that promotes effective functional communication, social skills development, collaborative working and an appropriate total communication environment. You will be working directly with patients to assess their communication needs and provide input into their therapeutic programmes that formulate part of their wider care pathway from admission to discharge. As part of a full multi-disciplinary team on-site consisting of healthcare assistants, nursing, psychiatry, occupational therapy, psychology and social work, you will work with all staff across the hospitals to support the implementation of the therapeutic approach demonstrating a range of skills, knowledge and abilities relating to autism spectrum disorders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a Speech and Language Therapist with:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Robust clinical and professional skills&lt;/li&gt;\n&lt;li&gt;Placement experience / interest in the field of Learning Disabilities including Autism Spectrum Disorders and / or Mental Health Conditions.&lt;/li&gt;\n&lt;li&gt;Knowledge of Positive Behaviour Support with an emphasis on person-centred planning.&lt;/li&gt;\n&lt;li&gt;Knowledge of key national drivers for the client group&lt;/li&gt;\n&lt;li&gt;Evidence of being a strong team player with a genuine desire to help others&lt;/li&gt;\n&lt;li&gt;Good organisational skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly in a fast paced and dynamic environment.&lt;/li&gt;\n&lt;li&gt;Enthusiasm, motivation and passion&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Full induction training is given and you will receive onsite clinical supervision and mentoring through an onsite Highly Specialist SLT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An immediate peer network of 50 SLTs nationwide.&lt;/li&gt;\n&lt;li&gt;Excellent Clinical Supervision, CPD and developmental opportunities for clinical and non-clinical duties&lt;/li&gt;\n&lt;li&gt;Full support from an onsite multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Routine service meetings with Cygnet Speech and Language Therapists.&lt;/li&gt;\n&lt;li&gt;CPD and Developmental opportunities.&lt;/li&gt;\n&lt;li&gt;Meal provision on duty&lt;/li&gt;\n&lt;li&gt;A comprehensive employee assistance programme and discount centre&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you ready for a new and rewarding opportunity? Please apply now.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London Rd, Harrow on the Hill, Harrow", "postalCode": "HA1 3JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5671", "longitude": "-.337962"}}, "title": "Band 5 Speech and Language Therapist (suitable for emerging Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201524", "validThrough": "2020-11-27T23:59:59+0000"}