{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc HCA"}}, "datePosted": "2020-11-04T13:01:16+0000", "description": "&lt;p&gt;An opportunity has arisen within the Specialist Rehabilitation Services for an Information Analyst to work as an integral part of the Clinical Performance and Management team.&lt;/p&gt;\n&lt;p&gt;The Regional Specialist Rehabilitation Services (RSRS) manufacture and provide specialist equipment and provide rehabilitation programmes in the management of people of all ages with Long term Physical Disabilities.&lt;/p&gt;\n&lt;p&gt;There are 4 main services; Amputee Rehabilitation (Prosthetics), Orthotics, Wheelchairs &amp; Special seating and Assistive Communication Services.&lt;/p&gt;\n&lt;p&gt;This role involves the production of reports using a variety of tools and techniques to allow operational managers and clinical leads to monitor and maximise performance across a range of specialist services providing rehabilitation to people with long term disabilities.&lt;/p&gt;\n&lt;p&gt;This role supports the Clinical Performance and Management team to accurately report performance and activity to the Trust and external organisations responsible for the governance of community based healthcare.&lt;/p&gt;\n&lt;p&gt;The ability to present complex data in a visually accessible fashion is vital to clinicians and corporate management so that they can better understand the delivery and effectiveness of care to their patients. This role is essential in providing data to the clinical and operational service managers and to convey the understanding and interpretation of that data so that performance can be improved and innovative service development can be informed.&lt;/p&gt;\n&lt;p&gt;The successful post holder will need to prepare monthly billing feeds for activity and equipment. They must be numerate, analytical, and happy to work to tight deadlines whilst responding to a complex and varied workload.&lt;/p&gt;\n&lt;p&gt;For Further Details please contact&lt;/p&gt;\n&lt;p&gt;Yetunde Falade -Business and Administration Service Manager - Regional Specialist Rehabilitation Service&lt;/p&gt;\n&lt;p&gt;yetunde.falade@gstt.nhs.uk 02030497375&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameYetunde FaladeJob titleBusiness and Admin Service ManagerEmail addressyetunde.falade@gstt.nhs.ukTelephone number02030497375&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regional Specialist Rehabilitation Service, London", "postalCode": "SE19 1SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4221", "longitude": "-.078372"}}, "title": "Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255956", "validThrough": "2020-11-20T23:59:59+0000"}