{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc. HCA"}}, "datePosted": "2020-10-19T11:47:35+0100", "description": "&lt;p&gt;We are looking for Band 6 Physiotherapists to join us in our expanding and award winning services, which provides healthcare at home and prevents admission into our hospitals. You will be supported by our Senior Physiotherapy Leads and Clinical Managers, and have access to professional support within Guy’s &amp; St Thomas’ Foundation Trust (GSTT). This is an excellent opportunity for clinically supported development within a Trust that is clinician-led, and strives to provide the highest possible level of clinical expertise throughout its healthcare services.&lt;br /&gt;&lt;br /&gt;Our Awards:&lt;br /&gt;• Lambeth CCG Award Winner for ‘Putting Patients First’ – ERR 2016&lt;br /&gt;• Lambeth CCG Award Shortlist for ‘Putting Patients First’ – SDT 2016&lt;br /&gt;• Trust Award for ‘Community Team of the Year’- ERR 2015&lt;br /&gt;• Trust Award for ‘The Patient Award’- ERR 2015&lt;br /&gt;• Trust Award for ‘Fit For the Future’- SDT 2015&lt;br /&gt;• Trust Award for ‘Community Services - ERR 2012&lt;br /&gt;&lt;br /&gt;Our services:&lt;/p&gt;\n&lt;p&gt;Intermediate Care Lambeth provides healthcare at home to adults aged 18 years and older who live in the boroughs of Lambeth or Southwark, South London. The people that we support have a range of diagnoses and clinical presentations, including falls, orthopaedic, respiratory, frailty and neurological conditions.&lt;/p&gt;\n&lt;p&gt;We:&lt;br /&gt;1. Prevent unnecessary hospital admissions&lt;br /&gt;2. Facilitate the safe discharge of people from healthcare in hospital to healthcare at home&lt;br /&gt;3. Provide intensive, short term multi- disciplinary rehabilitation and care support to promote functional independence.&lt;br /&gt;&lt;br /&gt;Healthcare in the home is rapidly increasing and enables people to be treated at home where they are more comfortable. This helps us to provide a more holistic, well-rounded and bespoke healthcare service to the people we support. &lt;br /&gt;&lt;br /&gt;Our professional offer to you:&lt;br /&gt;&lt;br /&gt;As a Band 6 PT you will have an opportunity to:&lt;br /&gt;• Develop your discipline specific skills, e.g. assess for suitable equipment, minor home adaptations, cognitive assessment&lt;br /&gt;• Develop your skills in complex case management of clients beyond the scope of your traditional Physiotherapy practice&lt;br /&gt;• Develop your skills in holistic assessment, problem solving and joint working with other health and social care colleagues, GPs, hospital teams and voluntary sector agencies &lt;br /&gt;• Develop supervisory, leadership and service development skills&lt;br /&gt;• Access appropriate GSTT leadership development training courses to support career development &lt;br /&gt;• Support you to be involved in Physiotherapy clinical meetings&lt;br /&gt;• Develop your skills in service development&lt;br /&gt;• Provide you with a mentor&lt;br /&gt;&lt;br /&gt;At GSTT, we are committed to providing you with:&lt;br /&gt;&lt;br /&gt;• Professional expert advice, including access to our Professional Leads in our Community and Hospital settings&lt;br /&gt;• An annual appraisal and personal development plan (PDR)&lt;br /&gt;• Structured in-service development programs and regular supervision &lt;br /&gt;• Support to undertake research, audit and service evaluation &lt;br /&gt;• Training links to London Southbank and King’s College Universities&lt;br /&gt;• Support to develop your skills in preparation and presentation (for teaching)&lt;br /&gt;&lt;br /&gt;Closing Date: 8th November 2020 at Midnight&lt;/p&gt;\n&lt;p&gt;Interviews: Week commencing 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTony HarlandJob titleSenior Specialist PhysiotherapistEmail addressAnthony.Harland@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GSTT / Intermediate Care Lambeth, London", "postalCode": "SW9 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4701", "longitude": "-.112855"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232122", "validThrough": "2020-11-08T23:59:59+0000"}