{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum, inc HCA"}}, "datePosted": "2020-11-05T14:46:16+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Clinical Measurements Department provides a wide range of non-invasive and invasive Cardiology and Respiratory diagnostic procedures. We are a progressive, flexible and friendly workplace and are fully committed to staff development. In addition to in-house training, we encourage attendance and participation at National and International conferences.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department performs a wide range of diagnostic investigations, including ECG, Exercise Testing (Physiologist-led), Ambulatory Monitoring, Echocardiography (TTE, DSE, and TOE), Cardiac Catheterisation and Pacemaker implantation and follow up.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition, the Department also supports the Rapid Access Medical Clinic and the GP Open-Access Echocardiography service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated individual with a keen ambition to expand their technical and managerial skills. You ideally must have at least 2 years experience working at a senior level. The post will be predominantly echocardiography based; therefore you will be fully proficient in performing and reporting adult echocardiography studies as well as performing a broad range of other non-invasive Cardiology investigations. Experience of performing invasive procedures would also be beneficial.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have BSc Clinical Physiology (or equivalent) and British Society of Echocardiography Accreditation. You will possess ASCT parts 1 &amp; 2 Professional qualifications. ALS or ILS would be advantageous.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will also be actively involved in staff training/development and assisting with service delivery initiatives.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlan EleyJob titleManager of Clinical MeasurementsEmail addressalan.eley@nhs.netTelephone number01689863107&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Band 7 Highly Specialised Chief Echocardiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258162", "validThrough": "2020-11-30T23:59:59+0000"}