{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-28T10:16:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 Senior Assistant Psychologist/ Autism Assessment Practitioner in our Community Paediatric Service. The vacancy is ideal for candidates who have an interest in working with young people with a diagnosis of an Autism Spectrum Disorder/ Condition and their families. The post will involve working closely with external organisations, as well as members of the Multidisciplinary Team which includes Consultant Community Paediatricians, Clinical Psychologists, Speech and Language Therapists, Occupational Therapists and Nurses.&lt;/p&gt;\n&lt;p&gt;Under supervision from the Clinical Psychologist, the successful applicant will work as part of our Autistic Spectrum Disorder Pathway to provide training, support and advice to families who are in the process of seeking an assessment. This pathway is part of The Dorset Development and Behaviour Pathway which is a locally driven initiative designed to inform and support families who access our service.&lt;/p&gt;\n&lt;p&gt;The post holder will promote and coordinate the patient journey through the service, utilising an evidence based approach. They will act as a single point of contact for families to keep them informed about during the process of assessment and to give practical tips whilst waiting or making referrals to appropriate services.&lt;/p&gt;\n&lt;p&gt;We are looking for an motivated and flexible individual with an undergraduate/postgraduate degree in Psychology or a person with a background in nursing or Occupational Therapy. Strong communication and organisational skills are required.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 11/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date week commencing: 23/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Krystina TurnerJob titleClinical PsychologistEmail addressKrystina.Turner@poole.nhs.ukTelephone number0300 019 2104&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals Dorset, Poole", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Senior Assistant Psychologist/Autism Assessment Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246009", "validThrough": "2020-11-11T23:59:59+0000"}