{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T11:31:20+0100", "description": "&lt;p&gt;The CAMHS Eating Disorders Team is a multi-award winning, recovery focused, multidisciplinary community team working with under 18&#39;s with Anorexia, Bulimia and Binge Eating Disorder.&lt;/p&gt;\n&lt;p&gt;As a University Partnership Trust we offer excellent development opportunities supported with regular supervision.&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership NHS Trust (HPFT) is committed to providing excellent health and social care with the vision to be the leading provider of mental health and specialist eating disorders services in the country.&lt;/p&gt;\n&lt;p&gt;The Trust has an outstanding track record of service delivery and quality. It provides services to over one million residents and is currently rated as “outstanding” by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;Key goals for the Trust include being the provider of choice; delivering high quality integrated health services in collaboration with local people, to improve overall health and well-being. To deliver this the Trust is committed to employing the best workforce, recruiting individuals with the ability to provide care at the cutting edge of innovative practice. We have excellent development and training programmes which rank us in the top 20% of Trusts in the UK and a strongly embedded learning culture to support and facilitate staff to develop their potential and progress in their careers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information about the post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and committed CAMHS Community Eating Disorders Team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work as an influential and integral member of a diverse multi-disciplinary team offering specialist assessment and treatment for young people and their families suffering with an eating disorder.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate clinical knowledge and interest in the area of eating disorders, and will have experience of working with this client group.&lt;/p&gt;\n&lt;p&gt;You will receive regular supervision and support and will be actively encouraged to participate in continuing professional development and be involved in service development.&lt;/p&gt;\n&lt;p&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary subject to a minimum payment of £1,034 and a maximum payment of £1,791 per annum (pro rata where applicable).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Penny Smith&lt;/p&gt;\n&lt;p&gt;penny.smith19@nhs.net&lt;/p&gt;\n&lt;p&gt;01923 633396&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingsley Green, Radlett", "postalCode": "WD7 9HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7047", "longitude": "-.305165"}}, "title": "CAMHS Community Eating Disorders Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240331", "validThrough": "2020-11-06T23:59:59+0000"}