{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T12:45:54+0000", "description": "&lt;p&gt;This is chance to come and work in Brighton, a vibrant city by the sea previously voted the best city in the UK.&lt;/p&gt;\n&lt;p&gt;Brighton and Sussex University Hospitals (BSUH) Trust is the regional teaching hospital working across two sites: the Royal Sussex County Hospital in Brighton and Princess Royal Hospital, Haywards Heath.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of a fully integrated multi-disciplinary team at the Royal Sussex County Hospital working A&amp;E, short stay wards and the Acute Admissions Unit.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the team as we are developing a service model for an integrated community and acute therapy team. This is currently being trialled and will continue throughout the Winter with the plan of this being the new way of working going forward.&lt;/p&gt;\n&lt;p&gt;Our Team comprises of nurses, occupational therapists, physiotherapists, therapy assistants and social care professionals from the acute and community Trust and Brighton and Hove County Council. This enables close multidisciplinary working to achieve combined goals, effective discharge planning and improved patient flow from the acute floor. Therapists work within an integrated model and are upskilled to carry out comprehensive, generic assessments with the aim to deliver highest standards of patient care, as well as promoting service and professional development to further enhance both clinical and non-clinical skills.&lt;/p&gt;\n&lt;p&gt;The post would include being part of the rostered seven day working and extended hours service covering 8am-8pm to support discharges using various services available.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Marlize Phillips&lt;/p&gt;\n&lt;p&gt;Job title Head of Occupational Therapy&lt;/p&gt;\n&lt;p&gt;Email address marlize.phillips2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07584862759&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Senior Occupational Therapist - Integrated Discharge Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250240", "validThrough": "2020-11-15T23:59:59+0000"}