{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum / pro rata"}}, "datePosted": "2020-10-23T09:45:45+0100", "description": "&lt;p&gt;The Oxfordshire CAMHS Eating Disorder Service is transforming its care delivery to be able to further prioritise the support parents and carers receive. We recently launched a parents and carers workshop and have always encouraged participation from parents and carers when evaluating the service. For example, we have had parents previously within the service attending away days.&lt;/p&gt;\n&lt;p&gt;This new Carers Lead role will further develop how we are able to support parents and carers, especially pre-treatment. You will have the ability to work autonomously with parents and carers as well jointly with the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Recovery from an eating disorder has a big impact on the whole family and this role is crucial to supporting parents and carers within this journey. You will also contribute to the treatment of patients recovering from eating disorders at key stages of their recovery and engagement with the Eating Disorder service.&lt;/p&gt;\n&lt;p&gt;The overall role is to provide advice and support to carers and offer specialist Carers Assessments, focusing on positive outcomes. There is a need to work closely with in-patient wards to information share and jointly support carers to continue in their caring role. The role also involves networking with other agencies.&lt;/p&gt;\n&lt;p&gt;You will receive a comprehensive induction into the role and be offered supervision to support you on-going in the role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnnie FarrellyEmail addressAnne.Farrelly@oxfordhealth.nhs.ukTelephone number07789 935447 / 01865 904708&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Raglan House, Oxford", "postalCode": "OX4 3LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7332", "longitude": "-1.21271"}}, "title": "Community Support Worker: Carers Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239883", "validThrough": "2020-11-08T23:59:59+0000"}