{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-08T11:46:22+0100", "description": "&lt;p&gt;We are looking to recruit a substantive Consultant Psychiatrist in General Adult Psychiatry to join our well established Community Mental Health Team in the Blackpool area of Lancashire. This full time, 10 PA role would be based at The Gateway (Blackpool Football Stadium). The role will involve working with the one sector of the Blackpool Community Mental Health Team and managing a small number of inpatient beds at our nearby inpatient facility.&lt;/p&gt;\n&lt;p&gt;This post is one of nine CMHT general adult consultant psychiatrist posts within the Blackpool, Fylde and Wyre locality. This locality operates on a sector based model of care and Community based consultants retain responsibility for their sector’s inpatient beds at The Harbour.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity and we are looking for a consultant interested in inspiring, leading, and developing our service. You will work with a multidisciplinary team including other doctors, nurses, OTs, Social Worker and Consultant Psychologist.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2.5 SPAs as standard for a full time post&lt;/li&gt;\n&lt;li&gt;Excellent General Adult peer support group&lt;/li&gt;\n&lt;li&gt;Opportunities to be a clinical supervisor&lt;/li&gt;\n&lt;li&gt;We have a large number of medical leadership roles&lt;/li&gt;\n&lt;li&gt;Fantastic newly built studio accommodation available&lt;/li&gt;\n&lt;li&gt;Relocation package available.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to contribute to the on call rota out of hours and at weekend. This work will be remunerated appropriately. There is no requirement to be resident On Call.&lt;/p&gt;\n&lt;p&gt;The Job Description provides additional information about the post.&lt;/p&gt;\n&lt;p&gt;Lancashire &amp; South Cumbria NHS Foundation Trust has over 120 Consultant Psychiatrists and is recognised as one of the best NHS employers in the country. We are proud to have amongst our Consultant workforce, recent winners of; the RCPsych CESR Evaluator of the Year, RCPsych Researcher of the Year, &amp; RCPsych North West Division Trainer of the Year.&lt;/p&gt;\n&lt;p&gt;Applicants should hold full GMC registration and be included on the Specialist register of the GMC or they should be eligible for entry to the Specialist Register within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt;It is a requirement that applicants are Section 12 Approved at the time of commencing employment and have or are eligible to have Approved Clinician Status. Remuneration will be as set out in the terms of the New Consultant Contract according to previous experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deputy Medical Director Dr Mark Worthington on 01253 955284 or 01772 695371 or e-mail medicalrecruitment@lscft.nhs.uk. Informal visits are encouraged.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Gateway, Blackpool Football Stadium, Blackpool", "postalCode": "FY1 6JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8054", "longitude": "-3.04898"}}, "title": "Consultant Psychiatrist - General Adult Psychiatry, Blackpool", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218116", "validThrough": "2020-11-08T23:59:59+0000"}