{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17265", "minValue": "17265", "unitText": "YEAR", "value": "£17,265.85 per annum"}}, "datePosted": "2020-11-03T11:00:39+0000", "description": "&lt;p&gt;Ready for the recognition and rewards you deserve?&lt;br /&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort.  So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Grafton Manor provides highly specialised neuro-behavioural rehabilitation for men and women aged 18 years and older, with an acquired brain injury, including traumatic brain injury and strokes. The rehabilitation programme at Grafton Manor is particularly aimed at helping people who have experienced cognitive, behavioural and emotional changes as a consequence of brain injury to ensure they can access all areas of rehabilitation.&lt;/p&gt;\n&lt;p&gt;The site, set in a quiet village in peaceful countryside, includes an attractive, historic and purpose-fitted cottage called The Chantry, a flat and a studio flat. We also have two community houses situated in Kingsley just outside of Northampton. The split consists of:&lt;/p&gt;\n&lt;p&gt;Grafton Manor - 13 beds&lt;br /&gt;The Chantry - 5 beds&lt;br /&gt;Cottage, Flat and Studio flat - 3 beds&lt;br /&gt;Community Houses in Kingsley - 6 beds&lt;/p&gt;\n&lt;p&gt;This established care pathway of 27 beds enables people with acquired brain injury to maximise their independence at any stage of their post-acute recovery journey.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;As part of our nursing team you will assist and support the assessment, treatment and rehabilitation of patients in the unit and on community trips. Working as part of a multidisciplinary team under the direct supervision of a qualified nurse you will be required to undertake a range of duties involving direct patient contact and interaction.&lt;/p&gt;\n&lt;p&gt;As a Rehabilitation Assistant you will be working within a team which includes a range of professionals. You will make an effective contribution to providing high quality care within a brain injury rehabilitation setting.&lt;/p&gt;\n&lt;p&gt;The patient group consists of individuals with an acquired brain injury and the role will include working with residents in the community on a one to one basis.&lt;/p&gt;\n&lt;p&gt;In this role there is an expectation to facilitate personal care, management of challenging behaviour and socialisation in the community.&lt;/p&gt;\n&lt;p&gt;You will work within an identified career development pathway and be expected to complete appropriate competency development portfolios.&lt;/p&gt;\n&lt;p&gt;To be successful as Rehabilitation Assistant (Days), you&#39;ll need: Skills and Knowledge:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibility&lt;/li&gt;\n&lt;li&gt;Basic Literacy skills&lt;/li&gt;\n&lt;li&gt;Common sense approach to problem solving&lt;/li&gt;\n&lt;li&gt;Basic numeracy skills&lt;/li&gt;\n&lt;li&gt;Motivation and initiative&lt;/li&gt;\n&lt;li&gt;Some appreciation of Brain Injury problems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we would like to give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave plus bank holidays (at commencement of employment)&lt;/li&gt;\n&lt;li&gt;A Group Personal Pension Plan (GPPP)&lt;/li&gt;\n&lt;li&gt;Free meals while on duty&lt;/li&gt;\n&lt;li&gt;Care first – Employee Assistance Services&lt;/li&gt;\n&lt;li&gt;Continuous learning and development&lt;/li&gt;\n&lt;li&gt;Career development&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Voluntary Benefit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A driving license is essential as we are based in a remote area, and there are no buses to the hospital if you are on an early shift.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grafton Regis, Northampton", "postalCode": "NN12 7SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1133", "longitude": "-.895642"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253587", "validThrough": "2021-01-10T23:59:59+0000"}