{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "24400", "unitText": "YEAR", "value": "£24,400.00-£28,000 Plus £3,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:54:54+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS). Priory Group will cover the cost of a DBS check for all successful applicants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Set back within 15 acres of landscaped gardens, the tranquil environment of the Priory Hospital Southampton offers therapeutic and recovery focused residential treatment as well as day care and outpatient services. The hospital also provides a specialist inpatient service for children and adolescents.&lt;/p&gt;\n&lt;p&gt;We have ahighly experienced team of mental health professionals and support staff, which include consultant psychiatrists, psychologists, nurses and therapists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for newly qualified RMNs who are flexible, enthusiastic, self motivated and interested in working within a modern, forward thinking, effective specialist service. We would like you to have a pro-active and therapeutic approach to care management. We can help spring board your career with a promise of opportunities, excellent support and training all within a supportive and Friendly environment .&lt;/p&gt;\n&lt;p&gt;You can choose from a ward based preceptorship or a rotational based preceptorship working a set amount of months on each ward to gain maximum experience. This is your preceptorship, let us make it a great one!&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to apply for a disclosure at the enhanced level from the Disclosure and Barring Services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Priory Group is an equal opportunities employer ..&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marchwood, Southampton", "postalCode": "SO40 4WU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8846", "longitude": "-1.45034"}}, "title": "Preceptor Nurse with £3,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225819", "validThrough": "2020-11-13T23:59:59+0000"}