{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21021", "minValue": "21021", "unitText": "YEAR", "value": "£21,021 per annum"}}, "datePosted": "2020-10-30T11:03:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Youth Engagement Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; ‘After school has finished, at weekends and during school holidays we want young people to be engaged and have fun in groups and activities.’&lt;/p&gt;\n&lt;p&gt;An opportunity has become available to work very closely with the Multidisciplinary team, including Therapy, Nursing, Medical, Education and other non-clinical departments to optimise patient engagement and involvement across our services.&lt;/p&gt;\n&lt;p&gt;The focus of the role will be to provide appropriate meaningful therapeutic, educational, sport/fitness, recreational and leisure activity within a structured timetable with planned activities prepared in advance to optimize engagement. You will organize a combination of group and individual sessions and work with the clinical team and school to ensure a balance and range of activities.&lt;/p&gt;\n&lt;p&gt;Where you have certification to deliver more specialist intervention (such as physical therapy / gym) you will work with the MDT to ensure that individualized plans are prepared, risk assessed and agreed, and that all equipment safe for use. You should be passionate about engaging with young people and excited about the changes that this role can deliver across our hospital. You will be expected to be creative, innovative and engaging&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key areas of delivery&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To plan and deliver a 7 day programme of activities 52 weeks of the year, ensuring activity continues to run through to the evenings and on weekends.&lt;/li&gt;\n&lt;li&gt;To ensure sufficient resources are in place to support engagement activities, to cost up activities and supplies, and monitor the budget in line with therapy/school staff.&lt;/li&gt;\n&lt;li&gt;To risk assess all activities and liaise with the MDT in advance of sessions being delivered.&lt;/li&gt;\n&lt;li&gt;To ensure all activities are safely conducted and introduce a system of checks as relevant to the risk status of the patients.&lt;/li&gt;\n&lt;li&gt;Working with the Hospital’s school to increase attendance and engagement.&lt;/li&gt;\n&lt;li&gt;121’s and key work with individual young people who require intensive support in terms of engagement.&lt;/li&gt;\n&lt;li&gt;Optimising and engaging with patients and staff to improve engagement.&lt;/li&gt;\n&lt;li&gt;Patient / Service User Involvement and attending community meetings.&lt;/li&gt;\n&lt;li&gt;Arranging internal activity events as well as linking with external providers.&lt;/li&gt;\n&lt;li&gt;Assisting the care staff with engaging with young people during periods of observations.&lt;/li&gt;\n&lt;li&gt;An understanding of the principles and implementation of Equal Opportunities.&lt;/li&gt;\n&lt;li&gt;Undertake routine regular monitoring and recording of all youth engagement events and activities and produce written evaluation reports&lt;/li&gt;\n&lt;li&gt;To work with the ward manager and nurse in charge to ensure the availability of support staff and ward space is available for planned activities.&lt;/li&gt;\n&lt;li&gt;To be available to support the ward if required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Charismatic, friendly but disciplined in approach with engagement activities&lt;/li&gt;\n&lt;li&gt;Empathic and responsible individual with proven ability to lead, motivate and manage young people on projects&lt;/li&gt;\n&lt;li&gt;Good organisation and time management skills; able to prioritise workloads effectively, meet deadlines and monitor outcomes&lt;/li&gt;\n&lt;li&gt;Full driving licence desirable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;This is a full time role working 37.5 hours per week.  The hours of work will generally be 12pm to 8pm and will include 1 day every other weekend. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please take a look at our progressive and rewarding benefits package&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 week’s paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A thorough Induction Programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave allowance&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest. &lt;/p&gt;\n&lt;p&gt;Huntercombe Group are one the leading specialist healthcare providers, with hospital and centres throughout England and Scotland, delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adolescent mental health services (CAMHS) including eating disorders and social care for children with special needs.&lt;/p&gt;\n&lt;p&gt;Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents.&lt;/p&gt;\n&lt;p&gt;We’re proud to have recruited some of the most experienced doctors, nurses and therapists in their fields and alongside our supportive stable Management structure we hope that it’s you that can help make a difference to our excellent teams and workforce.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taplow, nr Maidenhead &amp; Slough", "postalCode": "SL6 0PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.659092"}}, "title": "Youth Engagement Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249866", "validThrough": "2020-11-13T23:59:59+0000"}