{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T09:30:43+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber NHS Foundation Trust has been providing integrated prevention, community healthcare and support service for adults in Scarborough and Ryedale since the 1st May 2018. We have an opportunity for an organised, motivated and proactive individual to join our therapy team within the Ryedale Hub, based at Malton Hospital but providing community based Physiotherapy across the Ryedale area. You will be part of a supportive multi disciplinary team, seeing a range of patients in a beautiful area of Yorkshire. You will also have opportunities to work alongside, and have support from specialist teams including but not exhaustive of MSK, Speech and Language and Stroke.&lt;/p&gt;\n&lt;p&gt;An enthusiastic and self-motivated practitioner is desired to become an integral member of our 7 day multi-disciplinary team. The post holder will provide physiotherapy assessment and treatment of a variety of conditions providing goal and centred and evidence based therapy to patients within their own homes in the community.&lt;/p&gt;\n&lt;p&gt;To succeed in this role you will need to be passionate about community healthcare provision and rehabilitation&lt;strong&gt;, &lt;/strong&gt;able to tackle key priorities with enthusiasm and have the tenacity to deliver high quality care in an ever changing environment.&lt;/p&gt;\n&lt;p&gt;For informal enquires or to arrange a visit, please contact Jon Tilley, Team Leader: Tel 07966737597. &lt;strong&gt;&lt;em&gt;Please do not ring this number for application packages.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For those wishing to apply for the post on secondment they must obtain their managers permission to do so before applying.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSara EmeryJob titleBand 6 PhysiotherapistEmail addresssara.emery1@nhs.netTelephone number07973 693009&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Malton Hospital, Malton", "postalCode": "YO17 7NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1372", "longitude": "-.806561"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241848", "validThrough": "2020-11-08T23:59:59+0000"}