{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22440", "minValue": "22440", "unitText": "YEAR", "value": "Up to £22,440 per annum DOE"}}, "datePosted": "2020-11-01T12:37:15+0000", "description": "&lt;h1&gt;Learn something new everyday&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; Are you collaborative, caring and compassionate?&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;HMP YOI Brinsford is young offender’s remand custodial setting with an always improving healthcare department and an onsite inpatient unit consisting of 11 rooms. Ensuring our patients have 24 hour healthcare access.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; We can offer training and development in our friendly and supportive teams as well as a range of other employee benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;In return for your hard work you will…&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; Receive an annual salary of up to £22, 440 depending on experience.&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt; Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP YOI Brinsford include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Healthcare Assistant at HMP YOI Brinsford your responsibilities will vary. You will be involved in the implementation of clinical care packages, phlebotomy and assessment, treatment and the evaluation of patients’ care. You will support and assist patients with the activities of daily living, work with the Pharmacy Team to help them fulfill their daily tasks and you will be encouraged to take the lead on wellbeing promotion clinics.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;What do we need from you so you can do the job?&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Healthcare Support Worker, your responsibilities will vary. You will be involved in the implementation of clinical care packages such as ECG, urine analysis and blood pressure checks. You could also be involved with phlebotomy (if trained to do so) and assessment, treatment and the evaluation of patients’ care. You will support and assist patients with the activities of daily living, work with the Pharmacy Team to help them fulfil their daily tasks and you will be encouraged to take the lead on wellbeing promotion clinics.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;Next steps&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;br /&gt; &lt;br /&gt; Amelia will submit your CV to the hiring manager and then will arrange an interview for you to attend at HMP YOI Brinsford if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;More information&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; This is a full-time role working 37.5 hours per week, including evenings, weekends and Bank holidays.&lt;br /&gt; &lt;br /&gt; For more information, an informal discussion or to arrange an informal visit please contact us on the details provided.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV10 7PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6486", "longitude": "-2.1086"}}, "title": "Healthcare Assistant - HMP YOI Brinsford", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251177", "validThrough": "2020-11-09T23:59:59+0000"}