{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112 per annum"}}, "datePosted": "2020-10-05T11:47:40+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Believe and Achieve - Prosper in Portsmouth! &lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Are you recently qualified and eager to build your career in nursing? Come and start your journey with us at Portsmouth Hospitals UniversityTrust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We can offer you a challenge, the opportunity to work in a fast paced, rewarding environment, to see and learn things you may never have experienced before with plenty of opportunities for career progression.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We live and breathe the phrase “working together” and we know that this can only be achieved through investing in our staff, so in return for your passion, dedication and hard work we promise you: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Our unique and comprehensive preceptorship programme for all NQN’s, fully supported, with the encouragement you need to succeed in your chosen field –study days include delivering safe care, practical simulation and caring for ourselves and others. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Opportunities to join a 12 or 18 month, 3 placement rotational programme with guaranteed substantive post on successful completion&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Full support and encouragement from our home-grown mentors to enable you to become the nurse you dream of - using the NMC recognised Coaching style approach to learning&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Fully supported leadership Development pathways&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Help to establish your career pathway for the future&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Opportunities to explore research projects&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Future nursing opportunities, including specialist roles&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for the team players, the great communicators and those that understand the difference between good care and the truly exceptional. We know that making a patients day a little better, makes OUR day.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are learners, we love innovation and improvement, and we are ready to help you develop your skills, build your confidence and complete your competencies. We will treat you as the professional that you have studied hard to be. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;#PROUDTOBEAPORTSMOUTHNURSE&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Why come to Portsmouth?&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ideally situated on the south coast of England, Portsmouth is the UK’s only island city and certainly has something for everyone. With sunny beaches, thriving nightlife, festivals, live music venues , museums and galleries, two cathedrals, a diverse literary heritage and much more&lt;/span&gt; &lt;span&gt;it is the ideal place to explore, socialise and indulge in our vibrant and dynamic seaside life. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Come and join us today!&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing Date - 2nd February 2020&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Note about shortlisting/interviews:&lt;/strong&gt; Due to the global COVID-19 pandemic, and the associated restrictions in place, we are currently unable to schedule interviews as we normally would. Please be assured that we will be in touch as soon as alternative arrangements have been made Thank you for your patience and understanding at this time.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Clsoing Date: 05/02/2021&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust (formerly known as Portsmouth Hospitals NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Newly Qualified Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212512", "validThrough": "2021-02-28T23:59:59+0000"}