{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £30,615 pa"}}, "datePosted": "2020-10-27T15:16:21+0000", "description": "&lt;p&gt;We are looking for enthusiastic, self-motivated pharmacy technicians with the potential and desire to develop through an exciting and varied career path in hospital pharmacy. Our pharmacy medicines optimisation teams provide near patient services such as medicines reconciliation, drug history taking and discharge facilitation. We are passionate about developing the role of the technician in all areas of pharmacy and seek to grow our fantastic team of experienced technicians. We are a dynamic department and have invested in new technologies such as electronic prescribing, robotics and PharmOutcomes transfer of information and care into the community and as such have been awarded Scan4Safety funding.&lt;/p&gt;\n&lt;p&gt;We would welcome applicants from hospital and community pharmacy, banding will be dependent on qualifications and prior experience (Band 4 until qualified) .The successful candidate will join us as a Medicines Optimisation Technician and will be accredited in (or committed to accredit in) Medicines Optimisation including drug history taking and Accuracy checking. You must be prepared to complete accreditations within the agreed time period.&lt;/p&gt;\n&lt;p&gt;Come and join us Cornwall is an amazing place to live, offering an excellent quality of life and a truly stunning environment to live in.&lt;/p&gt;\n&lt;p&gt;We actively support the development and training of all our staff, to achieve and succeed.&lt;/p&gt;\n&lt;p&gt;This is a full time post, however part time hours may be considered for the right candidate. You may be expected to work one late night a week until 7pm&lt;/p&gt;\n&lt;p&gt;There is also weekend working of one weekend day every 5 weeks with a day off in lieu.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen McClay Lead Pharmacist for Clinical services. 01872 255997 or Kim Olds, Chief Technician Supply Services 01872 252588&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Medicine Optimisation Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245147", "validThrough": "2020-11-09T23:59:59+0000"}