{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44496", "minValue": "28308", "unitText": "YEAR", "value": "£16.84-£26.47"}}, "datePosted": "2020-10-29T10:19:51+0000", "description": "&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade: &lt;/strong&gt;Community Psychiatric Nurse Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Kent and Medway NHS Social Care Partnership Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Thanet Mental Health Unit Elmstone Ramsgate Road Margate CT9 4BF&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for a nurse to join our team in Thanet working with older persons in the community for a period around 3-6 months. You will be welcomed into the team, be supported to understand and be able to do the role,  be treated as a member of the team and have the opportunity to attend any team training, have supervision, attend reflective practice and complex case discussion, team meetings.  The team is friendly and welcoming, morale is good and is supported by an approachable, flexible, and supportive leadership team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The role involves care co-ordination, initial assessments, duty work however we could accommodate say someone who only wanted to do assessments, so it is up for discussion dependent upon the skill set of the Nurse.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The team is lovely, friendly, engaged, morale is good the team leaders and consultants are excellent, we have an MDT approach of Doctors, nurses, OT’s psychology, support workers and soon peer support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Thanet Community Mental Health Team, CT9 4BF&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;One in four people in the UK will experience mental health issues at some point in their lives. KMPT are passionate about support and recovery for both those affected and their loved ones.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide effective assessment and case management to people with complex non-psychotic disorders, using evidence based/client centred principles to assess, plan, implement and evaluate interventions&lt;/li&gt;\n&lt;li&gt;To act as care co-ordinator under the CPA process if indicated&lt;/li&gt;\n&lt;li&gt;To provide leadership for students and/or junior staff, through supervision and appraisal&lt;/li&gt;\n&lt;li&gt;To participate in the planning, development and evaluation of the service&lt;/li&gt;\n&lt;li&gt;To supervise students on practice placements&lt;/li&gt;\n&lt;li&gt;To carry out MDT activities e.g. duty responsibilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum of 6 months MH RN UK community experience within the last 2 years&lt;/li&gt;\n&lt;li&gt;NMC registration&lt;/li&gt;\n&lt;li&gt;Excellent communications skills&lt;/li&gt;\n&lt;li&gt;Ability to maintain a high standard of record keeping&lt;/li&gt;\n&lt;li&gt;Be able to work as an independent practitioner&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In order to apply for this post you must have &lt;strong&gt;at least 6 months experience&lt;/strong&gt; in the community as a Mental Health Registered Nurse (or equivalent position) &lt;strong&gt;within the last 2 years&lt;/strong&gt;. Along with the skills to carry out basic clinical observations. Unfortunately, we cannot consider applications without the required experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts, long term placements and substantive opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Linda Govans, Trust Recruitment Coordinator on linda.govans@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thanet", "postalCode": "CT9 4BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3765", "longitude": "1.38665"}}, "title": "Bank Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247881", "validThrough": "2020-11-12T23:59:59+0000"}