{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T10:15:21+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Specialist Biomedical Scientist - Band 6 - Microbiology - 37.5 Hours per week - Permanent&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Microbiology services at West Suffolk Hospital are currently provided by Public Health England; however, this arrangement is due to end on 31st October 2020 when managerial responsibility will return to WSFT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The WSFT Pathology Department is seeking to recruit to Specialist Biomedical Scientist roles in Microbiology.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for suitably qualified and experienced Biomedical Scientists to join our team. The successful candidates will have a proven track record in Microbiology and an interest in all aspects of quality. There will be a requirement to participate in Mon – Fri core hours plus some evening and weekend working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We aim to be a locally responsive service that is integrated within the Trust and works as one Pathology Department. This role will be important to delivering a high quality, timely and cost effective services, whilst upholding the Trusts vision and values including the principles of Patient First.&lt;/p&gt;\n&lt;p&gt;If you have the necessary skills, experience and qualities to help us to put patients first; and would like an informal discussion or to arrange a visit, please contact Marcus Milner, Microbiology Manager on 01284 713069 or email marcus.milner@wsh.nhs.uk&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site. The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital. Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply. Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Specialist Biomedical Scientist - band 6 - Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247856", "validThrough": "2020-11-29T23:59:59+0000"}