{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-05T15:16:26+0000", "description": "&lt;p&gt;Ward Sister&lt;/p&gt;\n&lt;p&gt;Have you thought you might want to be a Ward Sister/Charge Nurse? To be a clinical leader guiding and supporting a team to deliver outstanding care? If so then this is the perfect opportunity to do this and be fully supported during the process.&lt;/p&gt;\n&lt;p&gt;There is an opportunity for a Ward Sister/Charge Nurse to Join the Diabetes and Endocrinology Leadership team, D3. This is a friendly, supportive, innovative acute medical and nursing team, whom are committed to providing and maintaining high standards of patient care.&lt;/p&gt;\n&lt;p&gt;We are looking to work with someone who is highly motivated, committed and a passionate individual to lead this excellent team. You must have excellent communication skills and be able to work effectively in a multi-disciplinary team, whilst being able to lead and maintain outstanding standards of care. The Ward Sister/Charge Nurse is someone whom is equally accountable for the day to day running of the ward and staff, acting as a positive role model at all times.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a structured orientation programme with the support of the department Ward Manager. You will be supported to develop yourself with regular one to one meetings and appraisals. You will receive a supernumerary period to enable you to gain the skills and competencies required.&lt;/p&gt;\n&lt;p&gt;Post are offered on a full time basis. The post requires flexible working patterns to meet the needs of the service to include bank holidays and weekends as required&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClare GriceJob titleWard Manager D3Email addressclare.grice@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn hospital, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Sister/Charge Nurse D3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258300", "validThrough": "2020-11-12T23:59:59+0000"}