{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T15:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;District Nursing Pathway Lead - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a dynamic nurse to lead our District Nursing service developments here in Stockport and to manage four (of our eight) Neighbourhood District Nursing teams. The p The operational management of the District Nursing Out of Hours service and the Clinical Assessment and Triage Team will also form a part of this portfolio.&lt;/p&gt;\n&lt;p&gt;You will work closely with our other District Nursing Pathway Lead providing strong leadership and direction to District Nursing team leaders.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to have a will have a thirst for service improvement, a sturdy background of clinical and managerial leadership and experience within the community setting.&lt;/p&gt;\n&lt;p&gt;You will need to have experience of delivering change and be capable of challenging and motivating others within a complex and busy environment. As an enthusiastic, persuasive and innovative clinical manager you will have a key role in shaping and leading service developments. You will need to engage and empower staff in the provision and management of their services and use clinical expertise to assess, develop and enhance the quality of the service. You will be someone who can provide clear nursing professional leadership inspiring registered and non-registered staff to provide outstanding care.&lt;/p&gt;\n&lt;p&gt;Your role will include working closely with GPs and adult social care managers across organisational boundaries and with a wide range of multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;If you feel that you have these attributes then we would like to hear from you!&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;• If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary &lt;br /&gt;&lt;br /&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa LaintonJob titleHead of Borough Wide ServicesEmail addresslisajane.lainton@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "District Nursing Pathway Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254507", "validThrough": "2020-11-15T23:59:59+0000"}