{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T09:46:38+0000", "description": "&lt;p&gt;The NHS Business Services Authority has a growing digital agenda and an opportunity has arisen for a Delivery Manager to join the Digital Directorate to support its successful delivery.&lt;/p&gt;\n&lt;p&gt;You will work as part of a large, dynamic and vibrant department coordinating and managing multidisciplinary Delivery Team(s) to deliver products and services which meet the needs of our users. You will partner with the Service Manager and work under the direction of the Lead Digital Delivery Manager.&lt;/p&gt;\n&lt;p&gt;By joining our team you&#39;ll be working alongside some of the most passionate people to make digital services happen. We work in a supportive and positive environment, where continual learning is a real focus.&lt;/p&gt;\n&lt;p&gt;We believe in our services and the impact they have on improving the health of the nation. We’re designing digital services that meet user needs and are quicker, simpler and more efficient for the millions of people that use them every day. Our approach will bring you close to real users who depend on our services and you’ll get the opportunity to shape their future. The work we do really does matter.&lt;/p&gt;\n&lt;p&gt;What we&#39;re looking for…&lt;/p&gt;\n&lt;p&gt;As an Agile Delivery Manager you will be accountable for the effective, cross-functional delivery of products using agile/lean techniques.&lt;/p&gt;\n&lt;p&gt;You’ll be expected to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;manage multidisciplinary Delivery team(s) to achieve planned outcomes which deliver real value to our users&lt;/li&gt;\n&lt;li&gt;empower the team to self-organise effectively to optimise their chances of success&lt;/li&gt;\n&lt;li&gt;integrate efficiently with other (agile or non-agile) delivery teams&lt;/li&gt;\n&lt;li&gt;be accountable for governance within the team&lt;/li&gt;\n&lt;li&gt;set a good, sustainable delivery pace&lt;/li&gt;\n&lt;li&gt;resolve conflict and encourage collaboration&lt;/li&gt;\n&lt;li&gt;apply good agile delivery practice to plan, track progress and manage blockers and resources&lt;/li&gt;\n&lt;li&gt;lead on financial management, scope management and stakeholder management&lt;/li&gt;\n&lt;li&gt;help to dynamically organise delivery activities at a detailed level.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Amanda Parry - amanda.parry7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Delivery Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245881", "validThrough": "2020-11-11T23:59:59+0000"}