{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000 - £60,000 plus Fringe London Weighting"}}, "datePosted": "2020-11-05T14:09:33+0000", "description": "&lt;p&gt;Advanced Practitioner Physiotherapist – Team Lead&lt;/p&gt;\n&lt;p&gt;Full Time or Part Time&lt;/p&gt;\n&lt;p&gt;Permanent &lt;/p&gt;\n&lt;p&gt;Salary - £38,000 - £60,000&lt;/p&gt;\n&lt;p&gt;Herts Valley&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Role:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are excited to be adding to our talented multi-disciplined team by recruiting an &lt;strong&gt;APP Team Lead&lt;/strong&gt; to our services in Herts Valleys.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role of APP Team Lead combines clinical and professional leadership. You will support the Clinical Lead and Operational Service Manager in providing direction and focus to the clinical team to facilitate the achievement of the objectives and targets across the services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide clinical leadership to ensure the safe and effective delivery of clinical interventions in line with Connects’ professional standards and governance requirements and will personally deliver a quality clinical service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Leading a team of APP’s, you will motivate and inspire the team to constantly excel in delivering the best patient centred care, utilising the advanced decision-making and clinical reasoning skills to perform clinical interventions that may fall outside the normal scope of physiotherapy practice.&lt;/p&gt;\n&lt;p&gt;Passion, personality and pride is needed by the role holder to drive forward the standards and approach to MSK and Pain service provision in Herts Valleys, enhancing the delivery of care provided by our talented multi-discipline team, ensuring evidence-based practice is delivered and high standards of care are delivered every time, all of the time. &lt;/p&gt;\n&lt;p&gt;What we are looking for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in delivering MSK services with tangible results&lt;/li&gt;\n&lt;li&gt;Experienced APP with demonstrable motivational leadership of their teams&lt;/li&gt;\n&lt;li&gt;Have strong commercial focus and commitment to delivering on KPIs and financial performance targets.&lt;/li&gt;\n&lt;li&gt;Clinically educated to Masters level or evidence of post-graduate education at Level 7 in the field of musculoskeletal care and be able to provide a highly specialised source of expertise to the team and have a strong track record of service delivery, leadership and teaching in this arena&lt;/li&gt;\n&lt;li&gt;Outstanding values that underpin clinical expertise and people management&lt;/li&gt;\n&lt;li&gt;Proven track record of influencing patients, people, commissioners and pathways&lt;/li&gt;\n&lt;li&gt;Strong desire and drive to deliver innovation and lead on change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Connect Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire", "postalCode": "HP2 4TU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7495", "longitude": "-.470639"}}, "title": "Advanced Physiotherapy Practitioner - Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258042", "validThrough": "2020-11-19T23:59:59+0000"}