{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-11-04T10:01:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 4 Assistant Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oncology &amp; Haematology Triage Assessment Area&lt;/p&gt;\n&lt;p&gt;Cancer Centre, Oxford&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for opportunities to progress your career? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you keen to learn more and develop your clinical skills? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy working in an acute care setting?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If the answer is yes then read on!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an Assistant Practitioner to join our Triage Team. Our service is available 7 days a week for oncology and haematology patients to contact Triage for telephone advice. The team provides expert advice to patients to ensure early recognition of potential emergencies, treatment complications and the provision of a follow-up structure. Triage provides a clinical area for nursing and medical staff to assess and monitor patients prior to a decision to send the patient home or admit to a ward as appropriate.&lt;/p&gt;\n&lt;p&gt;To work alongside the team we are looking for an experienced Assistant Practitioner with excellent interpersonal and communication skills who is keen to learn and take on new clinical skills. Part of the role will be developing telephone assessment skills so clarity of message and picking up on verbal cues will be crucial. We are looking for an enthusiastic, committed and professional approach to the delivery of care, ensuring the best patient experience. Candidates should be excellent team players with the ability to use their own initiative and judgement to resolve issues. They should also have a tactful, sensitive manner, work well under pressure, with a flexible approach and a willingness to suggest ideas for improvements. Previous Assistant Practitioner experience in an acute setting and successful completion of the Foundation Healthcare Degree (or equivalent degree level study) is essential, along with an ability to demonstrate compassion and a commitment to learning new skills.&lt;/p&gt;\n&lt;p&gt;Successful candidates can look forward to working in a professional environment with a team that is passionate about delivering outstanding care to patients and their families. There are many opportunities for personal and professional development for candidates who shine and want to progress their career within the NHS.&lt;/p&gt;\n&lt;p&gt;Closing Date: 17th August 2020&lt;/p&gt;\n&lt;p&gt;We would highly recommend that you contact us to see what we can offer you. For further details please contact either:&lt;/p&gt;\n&lt;p&gt;Joanne Thomas, Triage Ward Manager on Tel 01865 572274 or email: joanne.thomas3@ouh.nhs,uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Triage Advanced Nurse Practitioner: Monica.Jefferson@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date -16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BX72JC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo ThomasAdditional contact information&lt;/p&gt;\n&lt;p&gt;Joanne Thomas, Triage Ward Manager on Tel 01865 572274 or email: joanne.thomas3@ouh.nhs,uk&lt;/p&gt;\n&lt;p&gt;Monica Jefferson, Triage ANP: monica.jefferson@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Churchill Hospital, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Triage Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255293", "validThrough": "2020-11-16T23:59:59+0000"}