{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 £18,005 - £19,337 per annum, pro"}}, "datePosted": "2020-10-15T10:46:29+0100", "description": "&lt;p&gt;Some people were just born to care for others and we need you to work at Lancashire Teaching Hospitals, helping us provide the best care possible to our patients. We want people who are caring, supportive, great at communicating and really thrive looking after the needs of others. Your caring nature and enthusiastic approach will be perfect in this role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As you would expect, we do work on a shift basis – our patients need our care and attention 24 hours a day 7 days a week so everyone gets involved working different shifts to ensure our patients receive the best care. Typically, you would usually work a four shift system; early, late, twilight and nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return, we offer you such an opportunity to join one of our many friendly and dedicated teams where you will learn, grow and flourish, supported all the way, nurtured and developed by our award winning Education Team.&lt;/p&gt;\n&lt;p&gt;It doesn’t matter if you have never worked in a hospital before as you will begin by spending the first few weeks on our bespoke training programme that will help you develop all the initial skills that will you need to do the role. So when you step out onto the ward/area you will work on, you can be confident in your abilities – proudly holding your Care Certificate. The Clinical Skills Training is 3 weeks long and the course is full time so you will need to ensure you can attend this, as you cannot start on the Wards without completion of the course.&lt;/p&gt;\n&lt;p&gt;If you have always aspired to work for the NHS caring for our patients and working alongside highly motivated teams, then you are going to love this role. We will invest such a lot in you and your development by promoting and supporting you, ensuring you stay up to date with all clinical competencies and from day one you will be supported to achieve Level 2 or 3 in healthcare, meeting the government standards for care within the NHS.&lt;/p&gt;\n&lt;p&gt;We also proactively support you if you want to go on to become a registered nurse with opportunities to apply for nurse training at one of our partner education providers, University of Central Lancashire or University of Bolton - subject to meeting university entry requirements.&lt;/p&gt;\n&lt;p&gt;Sometimes the role will be tough, you will see and be involved in some difficult things involving our patients, be rushed off your feet and deliver some very direct personal care. We don’t want to shy away from that and we do know that this part of the role isn’t for everyone. That is why we run such a robust interview and assessment process to make sure that you understand the role, as much as we need to assess you to check you have all those fabulous skills, attributes, resilience and the caring nature we need.&lt;/p&gt;\n&lt;p&gt;We cannot wait to welcome you to one of our interview and assessment days to show us what you are made of!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We do not have an interview date as we will be interviewing successfully shortlisted candidates continuously.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Full Time positions available at both Chorley and Royal Preston Hospitals**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE ONLY APPLY IF YOU HAVE YOUR PHYSICAL CERITIFCATES THAT CONFIRM YOU HAVE ALREADY PASSED YOUR MATHS AND ENGLISH AS WE CANNOT PROGRESS YOUR APPLICATION WITHOUT THIS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**We know you will understand how important your record keeping and calculations are in the role, as well as the qualifications we support you to achieve, so we do have to have a minimum entry requirement of GCSE grade C or above OR Functional Skills Level 2.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;If you are shortlisted for interview, you must provide original certificates for both Maths &amp; English, as detailed within the person specification. Please also provide any Health &amp; Social Care qualifications you may have.**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Amongst the many other benefits you can enjoy are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;27 days paid holidays per year (rising to 33 days), pro rata for part time staff in addition to 8 bank holiday&lt;/p&gt;\n&lt;p&gt;Enhanced rates of pay for weekend and bank holidays working&lt;/p&gt;\n&lt;p&gt;The opportunity to join the NHS Pension scheme&lt;/p&gt;\n&lt;p&gt;Uniform provided&lt;/p&gt;\n&lt;p&gt;Child care vouchers and preferential rates for an on-site nursery&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmily TalbotJob titleRecrutiment OfficerTelephone number01257 245429Additional contact information&lt;/p&gt;\n&lt;p&gt;Emily Talbot - Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Emily.talbot@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227786", "validThrough": "2020-12-14T23:59:59+0000"}