{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T11:50:55+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Physiotherapist to be part of our teams in Woodland Hospital.&lt;/p&gt;\n&lt;p&gt;We are looking for a person who wants to work within motivated and enthusiastic multidisciplinary teams and can be a role model, fostering a culture of development and leadership within staff and providing strong clinical leadership and direction within the physiotherapy department.&lt;/p&gt;\n&lt;p&gt;You will need to be innovative and have excellent communication and organizational skills. You will require an ability to work flexibly, exploring ideas, and adapting practices to deliver more efficient prudent services in line with local and national drivers.&lt;/p&gt;\n&lt;p&gt;As a result of our success we are continuing to invest in specialist leading-edge technology, whilst offering great career opportunities to all physiotherapists within our teams. We are a dynamic team passionate about patient care and empowering patient back to independence. We encourage our physiotherapists to improve their skills to very high standards to provide optimum patient care.&lt;br /&gt;This role will be fundamental to meeting our visions by bringing very best standards of evidence based Physiotherapy services to our clients. The role is focused on outpatient work but will include some inpatient work. Ideally you will have experience having worked in a wide range of outpatient settings. We are looking for a committed person with excellent communication skills and a solid clinical background.&lt;br /&gt;We receive referrals from our consultants, Insurance companies GPs, self-referral and sports injuries.&lt;/p&gt;\n&lt;p&gt;You will be expected to be flexible and the post will include some evening and weekend work.&lt;br /&gt;The successful candidate will also work closely with physio manager helping with the governance and marketing of the department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Post qualification experience with significant experience in, orthopaedic and general surgery and an excellent CPD record.&lt;/li&gt;\n&lt;li&gt;BSc Physiotherapy&lt;/li&gt;\n&lt;li&gt;Ability to work both independently and within a team structure&lt;/li&gt;\n&lt;li&gt;Assess, diagnose and provide high quality individualised treatment programmes for patients, being sensitive to patients needs for dignity and privacy&lt;/li&gt;\n&lt;li&gt;MCSP or equivalent&lt;/li&gt;\n&lt;li&gt;HCPC membership&lt;/li&gt;\n&lt;li&gt;Working experience in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary Plus Enhancements (if eligible)&lt;/li&gt;\n&lt;li&gt;33 days annual leave inc bank holidays which increase with service (pro rata)&lt;/li&gt;\n&lt;li&gt;Private Healthcare&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Child Care Vouchers&lt;/li&gt;\n&lt;li&gt;Excellent Training and Development Opportunities&lt;/li&gt;\n&lt;li&gt;Subsidised Staff Restaurant*&lt;/li&gt;\n&lt;li&gt;Free Off Site Parking*&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Woodland Hospital is part of the Ramsay healthcare group and is located in Kettering, Northamptonshire&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering", "postalCode": "NN16 8XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4119", "longitude": "-.768808"}}, "title": "Inpatient Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246438", "validThrough": "2020-11-15T23:59:59+0000"}