{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 plus London allowance"}}, "datePosted": "2020-10-22T08:16:49+0100", "description": "&lt;p&gt;Opportunity has arisen following an expansion in consultant numbers and movement of a colleague for a Consultant on Monet ward. Monet ward is a 20 bedded male acute ward shared with a Consultant colleague and supported by Trainees. NELFT operates a nationally recognised model of minimising bed usage through close collaboration between the Home treatment Team and acute wards.&lt;br /&gt;&lt;br /&gt;The post is based in Sunflowers Court, an 11 ward facility at Goodmayes hospital and is part of the Acute and Rehabilitation directorate. This post will attract 10 Programmed Activities per week – 7.5 Pas for direct clinical care and up to 2.5 PAs for supporting professional activity. There may be the opportunity to contribute to the senior on-call rota which is remunerated at 3%.&lt;br /&gt;&lt;br /&gt;The post offers excellent CPD and study leave arrangements as well as good research and service development opportunities.&lt;br /&gt;&lt;br /&gt;Staff in NELFT work within a supportive environment that strives to strike an excellent work/life balance and job satisfaction, which creates an atmosphere to provide high quality care. In addition, staff also enjoy other benefits including a car lease scheme, flexible working arrangements, childcare voucher scheme, the NHS Pension Scheme and ongoing opportunities for career development.&lt;br /&gt;&lt;br /&gt;NELFT has excellent relationships with all stakeholders, robust governance structures and excellent systems of data collection and performance monitoring. As a Foundation Trust, NELFT retains any surplus generated for investment in services.&lt;br /&gt;&lt;br /&gt;We are looking for enthusiastic and flexible candidates who demonstrate leadership abilities and are committed to working in a multidisciplinary setting.&lt;br /&gt;&lt;br /&gt;Applicants should be on the Specialist Register or be within six months of obtaining their CCT. The candidate should be suitably qualified, including eligibility for Section 12 approval and Approved Clinician status.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Emmanuel Okoro, Associate Medical Director&lt;br /&gt;Email: Emmanuel.okoro@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sunflowers Court, Goodmayes Hospital, Ilford", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Consultant Adult Psychiatrist,Monet Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237578", "validThrough": "2020-11-18T23:59:59+0000"}