{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T08:30:43+0000", "description": "&lt;p&gt;THIS POST IS FIXED TERM UNTIL 30TH SEPTEMBER 2021 DUE TO MEET THE NEEDS OF THE SERVICE&lt;/p&gt;\n&lt;p&gt;The Aneurin Bevan University Health Board Older Adult Psychology Service is looking for an enthusiastic clinical psychologist to join our existing team. Our current service consists of qualified practitioner psychologists, music therapy practitioners and assistant psychologists. Our service is in the process of expanding to increase access to psychological therapies for older adults.&lt;/p&gt;\n&lt;p&gt;The post holders will undertake clinical work within challenging behaviour service, community mental health team and memory assessment service. This will involve specialist psychological assessment, formulation and intervention. In addition, the post holder will support the development of colleagues through supervision and consultation. Research and service development opportunities are available and we would seek to support post holders to consolidate and extend specialist skills and interests. The post is 1 wte and fixed term until 30th September 2021. The post based 6 sessions with the Behavioural Support Team (based in the Ty Siriol Unit, County Hospital, Pontypool) and 4 sessions in the borough of Newport, located at the Wentwood Suite, St Cadoc’s Hospital, Caerleon.&lt;/p&gt;\n&lt;p&gt;The older adult psychology service provides a range of evidenced based psychological therapies within the geographical area of Gwent, South Wales. The Aneurin Bevan University Health Board serves the population of Gwent, South Wales and is located between Cardiff and Bristol. Many of our facilities are located close to the M4 corridor, yet areas of outstanding beauty and tranquillity are within easy reach. There are five boroughs, each with its own CMHT provision and comprising of secondary mental health services, memory assessment and liaison/inpatient support practitioners. Each CMHT and inpatient unit is line-managed by an experienced senior nurse and the multi-disciplinary team includes psychology, psychiatry, CPN’s, occupational therapists, social workers and administrative support staff.&lt;/p&gt;\n&lt;p&gt;We enjoy close links with major universities and provide clinical training support to the South Wales and Bath Clinical Training Courses. As such, there are opportunities for career development in terms of research, training placements and teaching. Support and supervision will be provided by senior psychologists and opportunities for peer support are available through the older adult psychology specialty and wider psychology network.&lt;/p&gt;\n&lt;p&gt;We will only accept applications from individuals who are currently registered with the Health and Care Professions Council (HCPC) as a Practitioner Psychologist and who are able to demonstrate that they have the relevant post-graduate qualifications, experience and supervised practice for the post advertised.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Jimmy JonesJob titleProfessional Lead Older Adult PsychologyEmail addressjimmy.jones@wales.nhs.ukTelephone number01495 765 713&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ty Siriol Unit, Pontypool", "postalCode": "NP4 5YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6917", "longitude": "-3.02628"}}, "title": "Practitioner Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243713", "validThrough": "2020-11-17T23:59:59+0000"}