{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "In line with TPD sessional payments"}}, "datePosted": "2020-10-26T13:16:39+0000", "description": "&lt;p&gt;ACADEMIC TRAINING PROGRAMME DIRECTOR&lt;/p&gt;\n&lt;p&gt;Medicine – London&lt;/p&gt;\n&lt;p&gt;1 PA&lt;/p&gt;\n&lt;p&gt;The role of Academic Training Programme Director is to work with and support the Head of School in leading the delivery of a wide range of functions, aligned to the Health Education England mandate.&lt;/p&gt;\n&lt;p&gt;The Programme Director is responsible for coordinating the academic component of the Medicine training programme in HEE across London.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the LaSE team including PGME Business manager and the HET team, Head of School, Academic Postgraduate Dean, Chair of Academic Specialist Training Committee and other Departments including Quality. You will be working closely with our current Pathology academic TPD who covers ID/GIM and Neurology within the school of medicine.&lt;/p&gt;\n&lt;p&gt;The Training Programme Director is professionally and managerially accountable to the Head of School. The Training Programme Director will focus upon improvement of learner supervision, assessment and experience, engagement of faculty and ensuring effective educational outcomes, both now and in the future. The role is evolving and will also focus on whole workforce transformation and developing multi-professional links.&lt;/p&gt;\n&lt;p&gt;The Programme Director will ensure that both national standards, determined by the Royal College and also guidelines and standards established within London are met.&lt;/p&gt;\n&lt;p&gt;The Programme Director will be expected to implement national and HEE policies in Medicine Training.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the LaSE team including; PGMDE Business Manager and the Healthcare Education Team, Head of School, Postgraduate Dean, Associate Deans and other key departments including Quality.&lt;/p&gt;\n&lt;p&gt;The Healthcare Education Team in the HEE London and South East is responsible for planning the delivery and ensuring the quality of postgraduate medical and dental education and training across London and the South East. HEE is committed to the development of a medical and dental workforce that will support high quality patient care in London, Kent, Surrey and Sussex.&lt;/p&gt;\n&lt;p&gt;Our work is set within the Five Year forward view for the NHS and is defined by the HEE Mandate from Government. It is part of the consensus on how the NHS needs to change, with a key focus on prevention and a commitment to reducing health inequalities and promoting equality and diversity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: The post is offered on a secondment basis and all candidates are reminded that if they are successful, they are responsible for securing written agreement from their Trust/Practice for release from clinical work for the specified number of PAs/sessions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Andrew Deaner&lt;/p&gt;\n&lt;p&gt;Job title: Head of School of Medicine&lt;/p&gt;\n&lt;p&gt;Email address: Andrew.Deaner@hee.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stewart House, London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Academic Training Programme Director for Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242618", "validThrough": "2020-11-12T23:59:59+0000"}