{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pro rata,pa"}}, "datePosted": "2020-11-04T12:15:32+0000", "description": "&lt;p&gt;&lt;strong&gt;30 Hours per week (Term time only)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a School Staff Nurse to support our Specialist Community Public Health Nurses and School Nurse Support Worker, promoting health and wellbeing to all school aged children in the Borough of Dudley in the West Midlands.&lt;/p&gt;\n&lt;p&gt;Working for Shropshire Community Healthcare Trust our innovative and dynamic school nurse team supports health and wellbeing programmes for all children and young people aged 5-19 in schools and the wider community.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to develop public health knowledge and skills in this specialist area of community nursing. We are looking for team members who are enthusiastic, flexible, caring and committed to the needs of Children and Young People with excellent communication skills.&lt;/p&gt;\n&lt;p&gt; The School Nursing Service is currently undergoing an exciting transformation as we develop innovative approaches to delivery of the service within Dudley.&lt;/p&gt;\n&lt;p&gt;We will also be transferring from Shropshire Community Health Care Trust to Dudley Integrated Health Care Trust on 1st April 2021.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for a caseload of primary schools and work with School nurse support worker to deliver the NCMP programme, and support Band 6 SCPHN in senior schools. This will also involve working closely with partner agencies to meet the needs of this population.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to travel to other areas in the locality to support other local teams if required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dudley", "postalCode": "DY5 1RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4817", "longitude": "-2.11787"}}, "title": "School Staff Nurse (Dudley)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255774", "validThrough": "2020-11-18T23:59:59+0000"}