{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33222", "minValue": "33222", "unitText": "YEAR", "value": "Up to £33,222 FTE pro rata"}}, "datePosted": "2020-11-04T10:51:15+0000", "description": "&lt;p&gt;&lt;strong&gt;College Nurse –RGN, RLDN/RN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Denbighshire, LL18 5UH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Part-time including one weekend per month (Up to 32 hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £26,577 per annum (£33,222 FTE)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Example rota: Flexible working options for Midweek shifts&lt;/p&gt;\n&lt;p&gt;Week 1 – Monday – Thursday&lt;/p&gt;\n&lt;p&gt;Week 2 – Saturday – Tuesday&lt;/p&gt;\n&lt;p&gt;Week 3 – Monday – Thursday&lt;/p&gt;\n&lt;p&gt;Week 4 –Monday to Thursday&lt;/p&gt;\n&lt;p&gt;Cambian Group, the UK’s largest provider of specialist services in education, mental health rehabilitation and learning disabilities, is looking for a dedicated, caring individual to join the company as a College Nurse.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cambian Pengwern College&lt;/strong&gt;is a specialist further education college in North Wales, offering day, and up to 52-week residential placements for young people aged 16 to 25 with a learning disability and complex needs&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a registered nurse to work alongside a multi-disciplinary team to provide nursing care to our students. We would like to hear from suitable qualified and experience nurse. The fundamental role of the college Nurse is to monitor and improve the health and wellbeing of children and young people in our care. You will be responsible for providing high standards of nursing care at all times, including writing, reviewing and implementing student care plans/protocols, ensuring medication management systems are followed, liaising with medical professionals, training staff on medical procedures and other nursing duties.&lt;/p&gt;\n&lt;p&gt;A key part of this role is liaison with student’s parents. You will also be responsible for working collaboratively with other agencies and professionals; this includes preparing reports, making appointments and organising clinics with local or specialist health providers.&lt;/p&gt;\n&lt;p&gt;Full induction training is given. You will also learn from some of the most dedicated and inspirational people in our profession and just like our young people you will be learning all the time through our on going mentoring and support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates for this position should be RGN/RLDN/RNC qualified with a current NMC PIN number.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You should possess enthusiasm, demonstrate clear decision-making and organisational skills and work well as part of a team. In return, we will offer you clinical supervision, regular appraisal, training and development and we will ensure Continuing Professional Development.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have to meet the person specification in order to be offered this post and will be subject to an enhanced CRB check.&lt;/p&gt;\n&lt;p&gt;Cambian is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ruddlan, Denbighshire", "postalCode": "LL18 5UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2787", "longitude": "-3.48366"}}, "title": "College Nurse – Pengwern College", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255472", "validThrough": "2020-11-18T23:59:59+0000"}