{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5 depending on experience"}}, "datePosted": "2020-10-30T10:48:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Pre-Assessment Nurse | Band 5 depending on experience | Elland | Part-time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Elland Hospital has an exciting opportunity for an experienced Pre-assessment Nurse to join our fantastic Pre-Assessment Clinic. Working within a small and skilled team, you will use your skills to pre-assess our elective surgical patients. This is a unique role, which offers great training and support for the right individual to enhance their skill set and experiences.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The opening hours for our Pre-assessment Clinic are 7.00am - 7.30pm, Monday – Friday so we can offer a flexible working pattern depending on your requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Elland Hospital has been providing high levels of medical treatment and personal care since 1985. Our hospital has a full multi-disciplinary medical team on-site who practice some of the most advanced treatments on the latest generation imaging and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, general surgery, gynaecology, and cosmetic procedures&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Successful Nurse will work as an autonomous practitioner with the skills to assess, plan, implement and evaluate care whilst risk assessing the patients suitability for surgery. You will effectively communicate with other members of the multidisciplinary team and develop plans of care that are appropriate to the patient that takes into consideration the physical, psychological and social aspects of care delivery. You will be responsible for ensuring continuous update and completion of all nursing documentation to ensure care is evidence based and quality maintained&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a registered nurse with NMC registration and significant nursing experience with a background in Medical or Surgical nursing; ideally with some pre-assessment experience, however this is not essential. You will have a range of nursing skills supported by clinical knowledge and continued development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little on grace.little@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halifax", "postalCode": "HX5 9EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6888", "longitude": "-1.82866"}}, "title": "Pre-Assessment Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249812", "validThrough": "2020-11-30T23:59:59+0000"}