{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26000", "minValue": "23000", "unitText": "YEAR", "value": "£23,000 - £26,000"}}, "datePosted": "2020-10-30T07:57:58+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Temporary Staffing Booking Coordinator to join a supportive and warm working culture at The London Clinic, where your contribution is valued, and you can help us provide the best, personalised healthcare, delivering our three core values of; Caring, Inspiring and Pioneering.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest private hospitals, with approx. 1300 employees across state-of-the-art facilities located on Harley Street. We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Profile&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting into the Resourcing Business Partner the Temporary Staffing Booking Coordinator is the first point of contact for bank workers and agencies, and is responsible for all bank and agency bookings, providing the wards and departments with additional appropriately trained staff to support their required staffing levels.&lt;/p&gt;\n&lt;p&gt;The temporary staffing service includes the provision of Bank and Temp workers across all staff groups such as; Nursing, Medical, Allied Health Professionals, Non-Clinical Support functions as well as Admin and Clerical staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Location:&lt;/strong&gt; This role is located at our head office in Central London, NW1 (Close to Regents Park tube station). The team are currently working flexibly from home with the ability to attend the office if needed during the current pandemic.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type:&lt;/strong&gt; This is a full-time, permanent position working 37.5 hours per week; Monday to Friday.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Salary:&lt;/strong&gt; The attractive salary range for this role is £23,000 - £26,000 (inclusive of London Weighting), and will be dependent upon skills and experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package:&lt;/strong&gt; We offer a comprehensive package which includes a contribution pension scheme, Private Medical Healthcare, 33 day’s annual leave (inclusive of bank holidays), season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Duties&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Action all temporary staffing requests within agreed SLAs, filling shifts through the internal/external bank pools, or with authorisation, liaising with agencies, offering shifts to the Clinic’s preferred suppliers in accordance with the agency frameworks and agreements.&lt;/li&gt;\n&lt;li&gt;Ensure all bookings/shifts are accurately logged and allocated on the temporary staffing systems as well as keeping managers and departments updated with developments of the booking status of shifts.&lt;/li&gt;\n&lt;li&gt;Ensure all bank pools/databases are regularly monitored and updated so that bank workers are utilised effectively across the Clinic.&lt;/li&gt;\n&lt;li&gt;Act as the first point of contact for all temporary staff, dealing with enquires, recording details of any complaints, and ensuring an excellent and friendly booking experience for all internal/external service users.&lt;/li&gt;\n&lt;li&gt;Advise Resourcing Business Partner of any service related problems including issues with fill rates or with any bank/agency workers, as well as actively participate in bank recruitment campaigns where required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience working in temporary staffing, recruitment or bookings team.&lt;/li&gt;\n&lt;li&gt;Experience working within the hospital/healthcare/clinical environment would be desirable but not essential.&lt;/li&gt;\n&lt;li&gt;Demonstrable administration experience within a fast-paced environment.&lt;/li&gt;\n&lt;li&gt;Sound IT skills and highly proficient in the full range of Microsoft Office. Experience using an electronic rostering or temporary staff management IT system would be advantageous.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills with good interpersonal skills in order to build relationships, gaining the trust and corporation of managers, staff, colleagues, bank workers and external agencies.&lt;/li&gt;\n&lt;li&gt;Highly motivated and proactive individual with the ability to organise and prioritise own workload as well as work well under pressure.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 4LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5242", "longitude": "-.148504"}}, "title": "Temporary Staffing Booking Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249326", "validThrough": "2020-11-13T23:59:59+0000"}