{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc HCA"}}, "datePosted": "2020-10-16T08:16:14+0100", "description": "&lt;p&gt;Would you like to join a supportive, friendly and innovative psychology team who are celebrating 23 years of providing a service at GSTT? We have a vacancy for a 13 month fixed term (maternity cover) Band 8a HCPC registered Practitioner Psychologist who has a doctoral degree or equivalent in clinical, counselling or health psychology.&lt;/p&gt;\n&lt;p&gt;You will bring your unique ideas as well as your experience of working in a general hospital setting with people with long term physical conditions using evidence-based psychological therapies.&lt;/p&gt;\n&lt;p&gt;You will be excited about supporting our mission, helping us to continue to be a visible, accessible, high quality service that takes a patient-centred, evidence-based, and needs-led approach to providing psychological support to patients with blood disorders and their families.&lt;/p&gt;\n&lt;p&gt;You will embrace the service’s philosophy of being fully integrated into the multidisciplinary haematology teams. This provides numerous opportunities for collaborative working, staff support and consultation which is valued by colleagues. You will be working alongside a Consultant Clinical/Health Psychologist, a Highly Specialist Clinical Psychologist, two Clinical Psychologists, and a Senior Assistant Psychologist. The service is a popular placement destination for Doctoral clinical psychology trainees, MSc health psychology trainees, and psychology undergraduates and you will help to continue to support placements.&lt;/p&gt;\n&lt;p&gt;You will be leading the psychology service within the Haemophilia and Thrombosis service (based at St Thomas’ Hospital) as well as working with the rest of the psychology team in the Haematology Department at Guys’ Hospital. You will have opportunities to supervise and manage junior staff, and contribute to the variety of work undertaken by the team such as group therapy, teaching and audit. You will welcome the opportunities to enhance your own practice via professional development and contact with other psychologists across the Trust.&lt;/p&gt;\n&lt;p&gt;Our service is recognised for being accessible to patients and staff and strives to be as representative of the local population as much as possible. We would particularly welcome applicants who can add to the diversity of the existing team and who value working with diverse communities.&lt;/p&gt;\n&lt;p&gt;Enquiries are encouraged.&lt;/p&gt;\n&lt;p&gt;Contact: Dr Heather Rawle, Consultant Clinical and Health Psychologist (service lead) on 0207188 2718 or heather.rawle@gstt.nhs.uk or Dr Haris Yennadiou (Highly Specialist Clinical Psychologist) on 02071882718 or haris.yennadiou@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHaris YennadiouJob titleHighly Specialist Clinical PsychologistEmail addressharis.yennadiou@gstt.nhs.ukTelephone number02071882718&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s and St Thomas&#39; Hospitals, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Highly Specialist Practitioner Psychologist Adult Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229305", "validThrough": "2020-11-15T23:59:59+0000"}