{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-03T16:00:18+0000", "description": "&lt;p&gt;&lt;strong&gt;CRITICAL CARE DIRECTORATE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;ROYAL&lt;/strong&gt;&lt;strong&gt; DEVON &amp; EXETER HOSPITAL&lt;/strong&gt;&lt;strong&gt; (WONFORD)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;REF: CLOSING DATE&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated individual to join the Intensive Care Team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will deliver individual care to critically ill patients requiring advanced support. The applicant will also be required to liaise with the multi-professional team and other services/departments within the Trust to promote good working relationships.&lt;/p&gt;\n&lt;p&gt;The applicant will need to have a broad and sound clinical knowledge and ideally experienced in caring for acutely ill patients. They should either be a registered nurse or an ODP, newly qualified applications will be considered if a PIN number is available within three months of the interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Training Opportunities in Intensive Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We utilize nationally recognized competency packages of learning (CC3N) which are transferable to all Critical Care Units .Additionally all staff have the opportunity to work with specialized Practice Education Team and attend New Starters Study days.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Following completion of the appropriate CC3N Competencies there is an opportunity to interview for a 40 credit level 6 University accredited ITU module as part of the Plymouth University partnership module.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Following attainment of a 40 credit Critical care course, there are additional opportunities to be interviewed for the level 6 Paediatric Course.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Senior ITU trained nurses will receive additional training to care for paediatrics that are&lt;/p&gt;\n&lt;p&gt;admitted to adult critical care as we have a number of paediatric patients that require&lt;/p&gt;\n&lt;p&gt;stabilization prior to transfer to a paediatric critical care unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Professional Development&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supportive and Pastoral environment&lt;/li&gt;\n&lt;li&gt;Dedicated Practice Development Team working to support staff at all levels&lt;/li&gt;\n&lt;li&gt;Individual Group specific study days annually&lt;/li&gt;\n&lt;li&gt;Opportunity to attend National and International Conferences&lt;/li&gt;\n&lt;li&gt;Advanced Critical Care Practitioner roles and training&lt;/li&gt;\n&lt;li&gt;Use of Simulated learning in daily practice&lt;/li&gt;\n&lt;li&gt;Leadership and management development as part of ongoing professional development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Hours: 37.5 hours / week&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information and to arrange an informal visit, please contact Matron Emma Brown or Senior Matron Julie Purday on 01392 402425.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post has been identified as involving access to vulnerable adults and/or children and in line with Trust policy successful applicants will be required to undertake an Enhanced Disclosure Check.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that you will be notified via email regarding the result of your application. If you are successful in obtaining an interview you will be given a minimum of 2 weeks notice, prior to your interview date. &lt;strong&gt;If you have not received any correspondence from us within 1 week of the closing date please contact the recruitment team on 01392 403758/403936. It is not Trust policy to contact successful candidates in any other form than by email.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are appointed to a position within the Trust you will be required to provide original documents to verify your identity prior to your start date. This must be a valid passport or full birth certificate (specifying the names of the holder’s parents) together with proof of your national insurance number. Your contract of employment with the Trust may be invalidated in the event that you are unable to provide this documentation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to equal opportunity for all and encourage flexible working arrangements including job sharing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to recruiting and supporting a diverse workforce and so we welcome applications from all sections of the community, regardless of age, disability, gender, race, religion or sexual orientation, maternity/pregnancy, marriage/civil partnership or transgender status.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Registered Nurse, ICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254688", "validThrough": "2020-11-17T23:59:59+0000"}