{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Very Competitive"}}, "datePosted": "2020-10-19T16:17:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Low or Medium Secure Adult Male Learning Disability Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location - Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Package: Very Competitive&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You can achieve more at St Andrew’s Healthcare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A top 20 UK charity, St Andrew’s is a unique provider of specialist care in mental health and learning disability. We aspire to deliver truly world class, holistic services within our outstanding, modern facilities. Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services. We are currently transforming the Charity to deliver ‘Value Based Healthcare’ which will ensure our patients consistently get the best possible outcomes and local teams gain more control and responsibility.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are focused on building our reputation for high quality care and treatment for patients with histories of offending and other risk behaviours. The formation of our services has increased the autonomy of services and enabled us to transform the care and treatment we deliver to patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Forensic Learning Disability Service has an exciting opportunity to develop and strengthen your experience working with patients in low / medium secure care settings. These are challenging environments, with excellent multidisciplinary teams, and a forward-thinking and holistic approach is taken to patient care and treatment in the Service. The post-holders will be able to undertake non-clinical activities of interest e.g. research, teaching, governance and management - in an innovative way, and we actively encourage you to be a leader nationally in mental health and influence the direction of services in order for them to be the best for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A vacancy has arisen in our Male Low / Medium Secure Learning Disability area of the service. You will lead a multi-disciplinary team and oversee the management of patients with complex mental disorders and neurodevelopmental needs. You will be able to promote innovation and improvement of services and there will also be a strong research and teaching element to the role. With scope to develop your specialist interests and grow your remit and responsibilities, we will actively encourage you to be a leader nationally in mental health and influence the future direction of services. The post holder will be supported and encouraged to complete training in DBT, which is offered within the Learning Disability Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are extremely proud to empower the careers of our medical professionals, and our Executive Medical Director and the majority of our Clinical Directors have grown and developed into their current roles within the Charity&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We also support a number of our Consultant Psychiatrists through an Executive MBA programme at some of the most prestigious business schools in the country. There are also opportunities to attend our regular internal CPD events and for you to develop a medico-legal out-patient practice as part of the St Andrews Consultancy Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will lead a full MDT and help shape services further through strategic decision-making and improvement projects whilst having support from a team of Junior Doctors and MDT specialists. You will also be able to undertake research projects as part of St Andrew&#39;s commitment to innovation and world-class care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have MRCPsych or equivalent, a CCT (or eligibility) in Learning Disability, Forensic Psychiatry or General Adult Psychiatry with a special interest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If this sounds like you then we’d love you to apply here. For an informal discussion about the role please contact James Farrelly on 01604 616624 or email jcfarrelly@standrew.co.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Consultant Psychiatrist - Intellectual Disability Adult Male", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233119", "validThrough": "2020-11-15T23:59:59+0000"}