{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa pro rata"}}, "datePosted": "2020-11-02T08:16:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you dynamic forward thinking and want to make a difference. Then this could be the job for you.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to work within our Community Midwifery team in Weston and surrounding areas. The post will include supporting a community midwifery team by providing administration support and organisational skills, balanced against providing enhanced clinical care either in Nailsea Health Centre and Yatton Children&#39;s Centre or in the families home both before and after they have delivered. You must have access to a car and be able to drive.&lt;/p&gt;\n&lt;p&gt;A flexible approach to working hours is a must to meet the demands of the service and team. You will be expected to work occasional weekends and we can consider set days but they are negotiable. You will be part of a new team that will be providing Continuity of Carer to the women of Rural Weston Super Mare. You will, at times need to help in other areas and may, at a future date be asked to transfer to another base if the service need requires it. This could be in the Weston Super Mare area or in Bristol.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Requirements&lt;/em&gt;&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;Candidates must have relevant recent experience working with families and new born babies either in their own home or in a care setting. Exposure to first response referrals, the Family Nurse partnership and the ability to sign post people to self- help groups and facilitate individual care pathways is key to this varied role.&lt;br /&gt;&lt;br /&gt;You must have a NVQ Level 3 (or equivalent) in Health and Social Care or equivalent .We will not consider applications from people who do not have these qualifications. &lt;br /&gt;&lt;br /&gt;The ability to work alone and be a team player is essential. You must have a driving licence and have access to a car.&lt;br /&gt;&lt;br /&gt;This advert will close when we have sufficient applications so please apply early.&lt;/p&gt;\n&lt;p&gt;BASED IN THE COMMUNITY MIDWIFERY SERVICE. WESTON SUPER MARE&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Morgan Community Midwfery Matron Rebecca.morgan@uhbw.nhs.uk 0117 3425283&lt;/p&gt;\n&lt;p&gt;Rebecca Morgan Community Midwifery Matron&lt;/p&gt;\n&lt;p&gt;0117 342 5283, Rebecca.morgan@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Please don&#39;t leave messages on the answerphone. Please call back to speak to me in person&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yatton Children&#39;s Centre, Yatton", "postalCode": "BS49 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3861", "longitude": "-2.81825"}}, "title": "Community Maternity Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251297", "validThrough": "2020-11-15T23:59:59+0000"}