{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-06T09:31:04+0000", "description": "&lt;p&gt;We are currently seeking a driven Implementation Manager to lead on e-Rostering and job planning strategy and compliance within the Medical e-Rostering team at Hampshire Hospitals NHS Foundation Trust. This is an innovative, ambitious new project offering the opportunity to make a real difference across the organisation.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with strong organisational skills who will lead the implementation and successful delivery of multiple work streams by rolling out the full Allocate HealthMedics suite of products across all of our doctors.&lt;/p&gt;\n&lt;p&gt;It is key to the organisational development of medical staffing to have transparent processes for the co-ordination of our medical teams so that we can deliver the best for our patients. Therefore, you will be committed to identifying, maintaining and pro-actively communicating with key stakeholders at all times, whilst ensuring the implementation is in line with best practice standards and risks are managed and mitigated. We are seeking an outstanding individual to ensure the benefits of e-Rostering are realised, joining our driven and motivated team.&lt;/p&gt;\n&lt;p&gt;You will possess excellent communication and customer service skills, the ability to lead a team and a positive mind set toward continuous improvement. You will also have exceptional attention to detail and a drive to make positive changes based on a “can do” attitude.&lt;/p&gt;\n&lt;p&gt;If appointed to the post you will be part of the project team implementing e-Rostering for the medical workforce across the organisation, with specific focus on the delivery of a sustainable E-rostering system for the medical workforce.&lt;/p&gt;\n&lt;p&gt;Are you able demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in leading and managing change&lt;/li&gt;\n&lt;li&gt;Experience in project governance and reporting to a wide range of audiences;&lt;/li&gt;\n&lt;li&gt;Experience of successfully working with stakeholders and securing their engagement&lt;/li&gt;\n&lt;li&gt;A passion for IT systems delivery and good working knowledge of Microsoft Office Packages&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Valentine Chiguvare - Associate Director of Resourcing and Temporary Staffing&lt;/p&gt;\n&lt;p&gt;07884394300 / valentine.chiguvare@hhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hospital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "E-Rostering Specialist (Medical Staffing)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259025", "validThrough": "2020-11-22T23:59:59+0000"}