{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-13T15:31:23+0100", "description": "&lt;p&gt;The Nursing team at 10 West - Cardiology ward and Coronary Care Unit (CCU) are seeking Band 5 Staff Nurses to join our fantastic nursing team. &lt;br /&gt;&lt;br /&gt;10 West provides the ideal opportunity for exceptional nurses who are looking for a career as a cardiology nurse. We are seeking nurses who are compassionate, bright and motivated to deliver the best care to our very acute and complex group of patients. &lt;br /&gt;&lt;br /&gt;You will enjoy working in a busy environment and be a true team player. Excellent communication and interpersonal skills are essential. We provide in-house and post graduate training and have cardiology specific competencies to help our staff demonstrate their professional progression. The 10 West team are hardworking and passionate about their roles and value the importance of teamwork. The band 5 team are supported by two tiers of band 6’s – senior staff nurses and junior sisters who will provide direct mentorship, a cardiology matron, clinical nurse specialists and very enthusiastic cardiology consultants. &lt;br /&gt;&lt;br /&gt;As a young and dynamic team, we are particularly involved in patient safety and service improvement, so we are looking for people who possess a natural desire to drive improvement initiatives and sustain excellent standards of our cardiac services. &lt;br /&gt;&lt;br /&gt;We care for a wide variety of acutely ill patients from, Acute Coronary Syndromes, Heart Failure and Cardiac arrhythmias including being a national tertiary centre for Pulmonary Hypertension and Cardiac Amyloidosis. Our CCU supports a very busy Heart Attack Service (Primary PCI centre). &lt;br /&gt;&lt;br /&gt;Our nurses from band 2 to band 6 all rotate between CCU and the cardiology ward, and work very closely with the cardiac cath lab.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tara O’ Sullivan - Ward Manager&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;02077940500 Ext: 36416&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;tarao&#39;sullivan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 Staff Nurse - Cardiology and Coronary Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224882", "validThrough": "2020-11-08T23:59:59+0000"}