{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-02T17:45:29+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton, Salford, Ashton, Leigh and Wigan. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare. The Trust offer a range of flexible working patterns to enable our staff to balance their work and personal life.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Bolton NHS Foundation Trust would like to recruit a Specialist Public Health Nurse -School Nurse to work within in an integrated 0-19/25 neighbourhood team. Full and part time considered.&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;This vacancy is only available for applicants who already hold a current nursing or midwifery qualification with NMC registration and are on part 3 of the register a Specialist Community Public Health Nurse-School Nurse.&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt; Or are due to qualify as a School Nurse in September/October 2020.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;Bolton is a forward thinking trust and offers an evidence based 0-19/25 Public Health Nursing Service which is focused on improving outcomes for children, young people and their families. Are you passionate about working with young people and families? Do you want to be a member of an integrated team that provides care based on the needs of the child, young person and family?&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt; &lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We are looking for a dedicated and enthusiastic professional who can engage young people and has the communication skills required to be an effective and valued team member. You will work collaboratively with schools, community services, voluntary sector and partner agencies to improve health outcomes for young people and families in Bolton.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt; &lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Our service hours are 08:30-17:30, Monday-Friday, we offer flexible working patterns so that you can balance your work and home life.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt; &lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;It is an exciting time to work in Public Health Nursing in Bolton, we work across nine, 0-19 integrated teams to provide care at the right time, in the right place, by the right person. We have recently launched our electronic patient record in March which has provided more flexibility to service delivery.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt; &lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will be supported with an individual induction programme and will have access to group supervision within your team in addition to safeguarding supervision. Your team leader is based within your team to offer daily support and supervision as required.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Bases across Bolton, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Specialist Public Health Nurse - School Nurse - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253038", "validThrough": "2020-11-16T23:59:59+0000"}