{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-13T12:02:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist - Albion Place, Maidstone&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£82,096 - £110,683 per annum, plus 0.5PA for on-call and 3% (of a 10 PA salary) Category A availability supplement. This is pro rata for part time staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that you will be required to submit an application form for each post you are interested in applying for.&lt;/p&gt;\n&lt;p&gt;Welcome to Kent and Medway NHS and Social Care Partnership Trust (KMPT) and the new career choice you have (or did not realise you have) been looking for.&lt;/p&gt;\n&lt;p&gt;COVID-19 has brought with it many challenges but it has also shown us other ways of effective working that look set to be adopted moving forward.&lt;/p&gt;\n&lt;p&gt;This includes &lt;strong&gt;home working&lt;/strong&gt; and the smart use of technology for both appointments with service users and staying connected to colleagues. Talk to us about how that could make a difference in your life.&lt;/p&gt;\n&lt;p&gt;As well as a new hire bonus (£15,000*) and financial support for relocation (up to £8,000*), &lt;strong&gt;we want to understand what flexibility means to you&lt;/strong&gt;. Is it a nine-day fortnight or condensed hours? Do you have caring responsibilities? Is there a certain day you cannot work for personal reasons? Talk to us.&lt;/p&gt;\n&lt;p&gt;We are stronger in our diversity with 52 nations represented and &lt;strong&gt;we want the real you to turn up at work&lt;/strong&gt;; it is an environment where you are encouraged to be yourself.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I can feel a real shift in feeling safer to speak up @kmptnhs We are getting better at listening without judgement. We are getting better at resisting the urge to jump to action. The networks (BAME, Faith, (dis)Ability and LGBTQ+) are reducing the effects of isolation and broadening views #stilllistening” &lt;/em&gt;- Celina on Twitter&lt;/p&gt;\n&lt;p&gt;We are all responsible for the evolving culture and the movement is tangible.&lt;/p&gt;\n&lt;p&gt;*Subject to conditions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information specific to the post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Kent&#39;s county town lies at the heart of the Garden of England. Here orchards and hop gardens surround villages and must-see heritage sights. Indulge in retail therapy at Fremlin Walk shopping centre or take in a show at the Hazlitt Arts Centre. The trust’s headquarters are also based in the town.&lt;/p&gt;\n&lt;p&gt;We are looking for an energetic consultant to join and develop a newly formed medical team based within the West Kent academic hub where most CPD takes place. You will have access to good links for unique aspects of care to develop specialist interests in areas such as forensic, inpatient and addiction services.&lt;/p&gt;\n&lt;p&gt;We are keen to support teaching, research and special interest sessions.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have MRCP or equivalent and be on, or within six months of inclusion on, the Specialist Register and be fully registered with the GMC, as well as Approved Clinician and S12 approval under the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;/p&gt;\n&lt;p&gt;Please note that due to the current circumstances and travel restrictions in place, all interviews will be conducted via video link using Life Size on 30 November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re #KMPTProud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please call Catharine Blackman on 01622 724133 or email catharine.blackman@nhs.net to make an appointment to speak to Executive medical director Dr Afifa Qazi or Deputy medical director, Rosarii Harte and click on the attached links to find out more.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Abdulazeez Towobola&lt;/p&gt;\n&lt;p&gt;Consultant Psychiatrist and Interim Assistant Medical Director for CMHT&#39;s&lt;/p&gt;\n&lt;p&gt;a.towobola@nhs.net&lt;/p&gt;\n&lt;p&gt;01233658100&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Albion Place, Maidstone", "postalCode": "ME14 5TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2745", "longitude": ".52983"}}, "title": "Consultant Psychiatrist - Maidstone CMHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224181", "validThrough": "2020-11-08T23:59:59+0000"}