{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39957", "minValue": "39957", "unitText": "YEAR", "value": "£23.77"}}, "datePosted": "2020-10-09T17:17:28+0100", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Radiographer Band 7&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; The Pennine Acute Hospital Trust, Fairfield General Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Trust Wide&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £23.77 Saturdays/Nights: £30.91 Sunday/Bank Hols: £38.04&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35652&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Transforming Lives, Building Independence.…join the bank to change your life for the better.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Good’ in a recent CQC report, working in a location with all the benefits of coast and country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a Radiographer available at The Pennine Acute Hospital Trust.&lt;/p&gt;\n&lt;p&gt;The Senior Cross Sectional Imaging Radiographer works as part of the Cross Sectional Imaging team, providing an efficient and high quality cross sectional imaging service 24/7, whilst dealing with patients in a caring professional manner. The Senior Radiographer is responsible for the day to day running of the CT/MR department, delivering an effective and responsive service.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work unsupervised, performing all CT, MR scans following imaging parameters set down in scanning protocols.&lt;/li&gt;\n&lt;li&gt;Liaise with referral source where clarification is required regarding the selection of the most clinically appropriate imaging examination and prioritise cases by urgent clinical need.&lt;/li&gt;\n&lt;li&gt;Act as a professional resource regarding CT, MR procedures for other directorate staff and clinical colleagues.&lt;/li&gt;\n&lt;li&gt;Act as a point of advice for patient enquiries regarding their referral.&lt;/li&gt;\n&lt;li&gt;Be fully aware of the potential hazards of working in an area of strong magnetic field and to be familiar with the Safety Guidelines for Magnetic Resonance Diagnostic Imaging Equipment in Clinical Use; Medicines and Healthcare products Regulatory Agency (MHRA) May 2016&lt;/li&gt;\n&lt;li&gt;Act in a responsible way in matters of radiation protection for staff and patients by fully observing the Ionising Radiation (Medical Exposures) Regulations 2017 (IRMER 2017) and local protocols.&lt;/li&gt;\n&lt;li&gt;Act as a patient advocate in MR safety and radiation protection issues.&lt;/li&gt;\n&lt;li&gt;To assess specific communication needs of individual patients&lt;/li&gt;\n&lt;li&gt;Ensure that all persons entering the MRI scan department have completed an MRI safety checklist and have removed all personal belongings, which may either be hazardous in the area of strong magnetic field or might be damaged by it.&lt;/li&gt;\n&lt;li&gt;Be fully aware of the potential bio-effects of MRI and to ensure that the equipment is operated within safe limits at all times.&lt;/li&gt;\n&lt;li&gt;Be familiar with safety procedures (quench, fire, cardiac arrest) specific to the MRI environment.&lt;/li&gt;\n&lt;li&gt;Match the clinical indications presented by the referrer to a departmental protocol where appropriate.&lt;/li&gt;\n&lt;li&gt;Modify protocols and technique where appropriate to optimise diagnostic information in view of clinical indications, image findings or patient condition.&lt;/li&gt;\n&lt;li&gt;Adapt or manipulate scan parameters to acquire the optimum diagnostic study for each patient presentation.&lt;/li&gt;\n&lt;li&gt;Possess a good theoretical and practical knowledge of CT/ MRI to enable protocols to be modified in an appropriate manner as required.&lt;/li&gt;\n&lt;li&gt;Assess requests for MRI such that the appropriate surface coil is used to optimise image quality of the body part under examination.&lt;/li&gt;\n&lt;li&gt;Be physically able to move moderately heavy items of equipment (e.g. surface coils) throughout the working day.&lt;/li&gt;\n&lt;li&gt;Physically position the patient for the full range of CT/ MR examinations, to ensure that image quality, patient comfort and patient safety are maintained at all times, whilst taking into account patient limitations and adapting standard techniques where necessary.&lt;/li&gt;\n&lt;li&gt;Assess specific communication needs of individual patients. To anticipate where communication difficulties might make completion of the MRI safety checklist impossible and implement alternative methods to ensure that patient safety is maintained.&lt;/li&gt;\n&lt;li&gt;Possess the skills and knowledge to analyse information from various sources both human and material, e.g. literature publications and dedicated internet websites, when assessing the safety of patients for MRI.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Phoebe Toms, Recruitment Consultant on 0333 014 4370 or Phoebe.Toms&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221287", "validThrough": "2021-04-09T23:59:59+0100"}