{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a."}}, "datePosted": "2020-11-03T16:00:46+0000", "description": "&lt;p&gt;HMP Woodhill, Milton Keynes – Central &amp; North West London NHS Foundation Trust are seeking to recruit a Healthcare Assistant with a keen interest in developing a career in substance misuse and Addictions.&lt;/p&gt;\n&lt;p&gt;Are you an exceptional individual looking for a rewarding new challenge? Would you like the opportunity to use your skills in an environment like no other to make a real difference every day? Interested? Then working in HMP Woodhill is just the place for you!&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and experienced healthcare assistants to join our multi-disciplinary team delivering high quality care to the prison population in this challenging environment.&lt;/p&gt;\n&lt;p&gt;The post holder would be expected to participate in the administration of medication, respond to emergencies and assist in the delivery of Addictions services that are equitable to that in the community.&lt;/p&gt;\n&lt;p&gt;CNWL NHS Foundation Trust provides an integrated addictions, primary care and mental healthcare service at HMP Woodhill. If you thrive on new challenges, being in an environment where no two days are the same and feel passionate about addictions then you may be the very person that we are looking for to join our developing team. You will be self-motivated, flexible and work well within a team but be able to work autonomously. You do not need to have prison experience as we will provide you with a full induction and training.&lt;/p&gt;\n&lt;p&gt;HMP Woodhill is an all-male Category B prison located in Milton Keynes holding up to 600 prisoners aged 18 and over. This is an opportunity to use all of your clinical and interpersonal skills, to develop new ones and to work with a unique population group. We work with men that are on remand and don’t know what their future holds, men that are on trial, men that are sentenced sometimes for life, for some it is the first time in prison, for others it may be their several times around. Every person we work with is someone’s son or could be someone’s father, husband/partner or brother.&lt;/p&gt;\n&lt;p&gt;CNWL prides itself in our core VALUES which were identified by our patients and staff. These are based around the experience of care that we want to provide and encompass being &lt;em&gt;compassionate, respectful, empowering&lt;/em&gt; and to be delivered in &lt;em&gt;partnership&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;What do we offer?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;EXCELLENT TRAINING OPPORTUNITIES AND CAREER DEVELOPMENT&lt;/li&gt;\n&lt;li&gt;GOLDEN HELLO - A ‘Golden Hello’ payment of up to £2,500&lt;/li&gt;\n&lt;li&gt;RECRUITMENT &amp; RETENTION ALLOWANCE - You will receive a monthly payment of approximately £68 on top of your AfC salary&lt;/li&gt;\n&lt;li&gt;REMOVAL EXPENSES SUPPORT - If you will have to move your place of residence more than 30 miles to take up a post at HMP Woodhill we will be able help with your expenses, this potentially includes things like removal costs and down payments for tenancy agreement&lt;/li&gt;\n&lt;li&gt;ENHANCED BANK PAYMENTS - The hourly rate of bank pay in HMP Woodhill is closer to what you agency rates and it is probably one of the highest rates in the NHS&lt;/li&gt;\n&lt;li&gt;CTC clearance (Counter Terrorist Checks) is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMaxine LeeJob titleSector ManagerEmail addressmaxine.lee2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Woodhill, Milton Keynes", "postalCode": "MK4 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0147", "longitude": "-.807332"}}, "title": "HMP Woodhill Addictions Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254705", "validThrough": "2020-11-22T23:59:59+0000"}