{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-02T10:00:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant Rheumatology&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;We are seeking an enthusiastic and motivated colleague to join our department as a full time Locum Consultant in Rheumatology working at both our hospitals, Eastbourne General Hospital &amp; Conquest Hospital. The appointee will work with Consultant colleagues to provide comprehensive inpatient and outpatient services. This post is based at the Eastbourne District General Hospital, a short journey from Conquest Hospital, St Leonards-on Sea&lt;br /&gt;&lt;br /&gt;East Sussex Healthcare NHS trust delivers an exceptional service to our patients using a comprehensive and multi-disciplinary approach within these two acute hospitals and community environments, including Rye and Bexhill hospitals. We offer general rheumatology services as well as specialist services for people with osteoporosis, connective tissue diseases and vasculitis, ankylosing spondylitis and paediatric and adolescent clinics. The department is supported by a full orthopaedic service, including spinal surgery; and full radiology facilities. &lt;br /&gt;&lt;br /&gt;The post holder would be expected to support the management of Early Arthritis clinics, Biologics Clinics and reviewing in-patient referrals. The department is research active and the successful candidate would be expected to participate in research and audit.&lt;/p&gt;\n&lt;p&gt;Experience in musculoskeletal ultrasound would be an advantage as we have existing service in the outpatient clinics. The post holder will be expected to provide leadership and development to the existing Rheumatology service and will also be expected to engage in Education and Training.&lt;br /&gt;&lt;br /&gt;An interest in General Medicine would be an advantage as there will be opportunities to take part in the on –call rota in the future with additional PA to accommodate this. &lt;br /&gt;&lt;br /&gt;As such the post holder should be trained in all aspects of clinical rheumatology. Further details regarding the specifics of the role can be found within the job description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Panthakalam, 0300 131 4500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne District General Hospital, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Locum Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251509", "validThrough": "2020-11-16T23:59:59+0000"}