{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-06T11:01:03+0000", "description": "&lt;p&gt;Are you looking for a post that has tons of variety? Do you want to gain both specialist clinical knowledge and management experience?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Your passion for pharmacy and patient care will be what makes you stand out from the rest. We know how much you will love ensuring that workloads are managed and interacting with staff to get the best out of them.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Of course, you won’t be alone, we have a great team of dispensary staff who will support you all the way and cannot wait to welcome you. We have a great team ethos, all supporting each other and working together across all areas to achieve the best outcomes we can&lt;br /&gt;Our teams are proud to work together to provide all the medication required for both inpatient use and on discharge 365 days a year from our dispensaries and satellites base at both at Preston and Chorley Hospital. There is plenty of opportunity for you to develop your skills and introduce new ways of working.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We won’t shy away from saying that at times it will be a challenging role, but we know you will expect this and of course, this will be offset by how rewarding it is too. The role is one that is rotational across two dispensaries and two chemotherapy units so you will not have time to be bored. You will be expected to manage the day to day running of which ever area you have been allocated to and take responsibility for the supervision of our dispensary family which includes an array of different levels of staff including pharmacy technicians, dispensers, and students and work with them to ensure all the activities get done on time to contribute to the smooth running of our dispensaries.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;It goes without saying that you will be required to adhere to departmental standards and pharmacy regulations but your previous pharmacy technician experience, knowledge and skills coupled with a Btec /NQV level 3 in pharmacy and relevant dispensary checking qualification, along with your GPhC registration will mean this is not a problem for you.&lt;br /&gt;We want to help you to continue to develop your skills too, so there will be opportunities for you to attend relevant courses to enhance your skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our service is one where your passion, drive and motivation will genuinely make a real difference, but don’t just believe this , please call and have a chat with Donna our Dispensary team leader on 01257024 5253 or Sharon Dispensary tem leader on 01772 52 4425 and check out our twitter feed @ pharmacy@LTHTR&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hours of Duty will be 37.5 hours Monday - Friday with a weekend and bank holiday commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Thursday 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Donna Bartlett, Dispensary Team Leader - donna.bartlett@lthtr.nhs.uk or 01257 245253&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "lancashire teaching hospitals, preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Medicines Management Pharmacy Technician - Dispensary and Chemotherap", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259336", "validThrough": "2020-11-15T23:59:59+0000"}