{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-22T11:59:37+0100", "description": "&lt;h1&gt;Locum Consultant in General Medicine&lt;/h1&gt;\n&lt;h2&gt;Great Western Hospital – Swindon&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term contact - 6-12 months in the first instance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for candidates interested in being part of an innovative new general medical team that forms a key component of the Trust strategy to expand the number and availability of experienced Physicians in our Department.The team will consist of 3 senior Physicians in General Medicine including Consultants and Associate Specialists.The Consultant roles cannot be offered permanently at this stage due to the required recruitment process, however, it is anticipated that these roles would become substantive and would be advertised within 6 months of the appointed candidates starting.The Associate Specialist roles will be substantive on from the date the appointed candidates commence.The Trust has already been successful in appointing 1 Associate Specialist to the team.&lt;/p&gt;\n&lt;p&gt;This Consultant role is therefore advertised as a fixed term role initially for a period of 6-12 months with the potential to be considered for the substantive role advertised in due course.&lt;/p&gt;\n&lt;p&gt;The new General Medicine team will cover between them half of a set ward (Neptune) and Medical outlying patients as required.The cover of the different areas will be split between the appointed Physicians on a rotational basis.&lt;/p&gt;\n&lt;p&gt;The new team will be developing this service and as such they would have input in planning how the Junior Doctors are allocated, it might be possible for example to alter the makeup of the current team swapping in Registrar or F1 roles.In addition, we would encourage development of education programmes for the junior staff within the department.&lt;/p&gt;\n&lt;p&gt;Within the standard job plan there will be 1 Flexible PA which can be used to undertake a variety of work of the candidates choosing (subject to approval on appointment).Examples of what this time could be used for include Quality Improvement projects, Educational Roles, Clinics in a sub-specialty, Developmental work or time work towards CESR application.&lt;/p&gt;\n&lt;p&gt;Applications from people working less than full time are welcome. There is opportunity to negotiate a flexible working pattern to ensure a longer term and sustainable career in the Specialty.&lt;/p&gt;\n&lt;p&gt;The Great Western Hospital also encourages development of Medical Staff, it might therefore be possible to undertake sponsored development opportunities such as Diplomas or other qualifications.&lt;/p&gt;\n&lt;p&gt;Great Western Hospital is proud to support many varied NIHR Portfolio and Commercially funded Research Studies. We have an active Research &amp; Innovation Department in place to support you with both the Multi-Specialty Clinical Delivery and Research Management &amp; Governance elements.&lt;/p&gt;\n&lt;p&gt;The Great Western Hospital is a modern building set in beautiful surroundings on the outskirts of Swindon. Swindon has brilliant travel links and is less than 1 hour way from London and Bristol.&lt;/p&gt;\n&lt;p&gt;Eligible candidates can claim up to £8,000 in relocation expenses.&lt;/p&gt;\n&lt;p&gt;To discuss the post/arrange a visit, please contact Dr Stephen Haig, Associate Medical Director - Unscheduled Care Division: s.haig@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date for applications: 20th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Locum Consultant in General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238275", "validThrough": "2020-11-20T23:59:59+0000"}