{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 Per annum"}}, "datePosted": "2020-11-04T16:16:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Cornwall Partnership NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Associate Director and Head of Psychology Professions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8d : Full-time, permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the retirement of the current postholder after eleven years with the Trust, we are now looking for a new Associate Director and Head of Psychology Professions to lead our growing group and range of psychological professionals into the next exciting phase of development.&lt;/p&gt;\n&lt;p&gt;Cornwall Partnership NHS Foundation Trust is the main provider of mental health, learning disability and community physical health services to the population of Cornwall and the Isles of Scilly.&lt;/p&gt;\n&lt;p&gt;We have a range of dynamic, high quality psychologists and psychological therapists working in our CAMHS, Adult Learning Disability, Adult Mental Health and Complex Care and Dementia Services and one of the tasks of the new postholder will be to continue fostering and enabling the development of psychologically, trauma-informed care in those areas. In addition and in response to the growing evidence-base, the Trust is keen to explore options for extending psychological provision to our physical health services to improve patient outcomes and will be looking for this postholder to lead that process. There is also planning underway for the integration of services currently provided by CFT and our local Acute Trust, Royal Cornwall Hospitals Trust, with a provisional target of 2022, so there will be no shortage of challenges for the right person to engage with and to shape.&lt;/p&gt;\n&lt;p&gt;What about opportunities? The current Trust and broader NHS context has numerous areas of opportunity for Psychology, but as a few examples:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In April 2020 CFT took over the contract for the local IAPT service from a local private provider, so we now have the whole of the commissioned mental health care pathway within the scope of the Trust and the working context in which to provide more continuous and patient-centred pathways of psychological care for our service users.&lt;/li&gt;\n&lt;li&gt;Despite most of the last decade being a period of Austerity, we have seen positive investment in psychology and psychological therapy provision within CFT and as result of our high quality staff being fully integrated with multidisciplinary teams and highly visible, psychologically-informed work has high currency at all levels of the organisation.&lt;/li&gt;\n&lt;li&gt;Since October 2018 and in collaboration with University of Exeter, CFT has led on the development of a new type of Psychology professional , Clinical Associate Psychologists. In November 2020 we will have over 40 graduate CAPS working in our Adult mental health and CAMHS teams. A further 27 will be commencing the new CAP degree apprenticeship to work with our existing community mental health teams to enhance our mental health crisis services for some of our most vulnerable service users.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;These are just a few examples of why this job offer such a fertile and exciting starting-point for an applicant with the right skills, aptitudes, experiences and values who is ready for the next stage of their career. If that sounds like you, we are waiting for your call and application and if you are successful, can promise you a stimulating and rewarding time with inspiring and supportive colleagues in a wonderful part of the country.&lt;/p&gt;\n&lt;p&gt;The provisional date for interviews will be Friday 6th November and we hope to conduct them in person in Bodmin. However, if the national guidance changes in the interim to preclude this or if there are legitimate reasons for specific candidates to request interview via MS Teams, we will facilitate proceeding on that basis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChris GendallJob titleChief Operating OfficerEmail addresschris.gendall2@nhs.netTelephone number01208 834618 ( via Beth Darbourne, PA to Chris Gendall)Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like further details or to speak informally with the current postholder, Dr Mike Hodgkinson, he can be contacted via his P.A. , Mrs Di Doyle, on 01208 834307 or via email at michael.hodgkinson@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": ", Trust Headquarters, Carew House, Beacon Technology Park, Dunmere Road, Bodmin, PL31 2QN, Bodmin", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "Associate Director and Head of Psychology Professions - Band 8d", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256608", "validThrough": "2020-11-18T23:59:59+0000"}