{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21651", "minValue": "21651", "unitText": "YEAR", "value": "£12.88"}}, "datePosted": "2020-11-06T13:40:40+0000", "description": "&lt;p&gt;*Temp to Perm opportunity*&lt;/p&gt;\n&lt;p&gt;Band 4 Plumber required as soon as possible to cover vacant permanent post. Based at Bethlem Royal Hospital in Beckenham (BR3 3BX) working hours are Mon-Fri 8-4.30 with 1 hour for lunch. Please only apply if you are able to interview/start immediately and meet the criteria as per the job description and have the qualififcation required.&lt;/p&gt;\n&lt;p&gt;1)To undertake planned preventative maintenance, reactive maintenance and emergency works as demanded by a Hospital of this type. Use all skills, experience and knowledge ensuring safe working methods to carry out maintenance tasks in the most cost effective way for the Trust&lt;/p&gt;\n&lt;p&gt;2) To understand the workings of buildings, engineering services and systems in NHS/Trust premises. Ensuring that they are maintained to a high standard and that all plant and equipment are utilised in a safe and efficient manner&lt;/p&gt;\n&lt;p&gt;3) To carry out work in a timely manner as requested using the current works requisition system and ensuring that any associated information is recorded.&lt;/p&gt;\n&lt;p&gt;4) To work as part of a departmental team and where necessary support colleagues of all levels and disciplines as required.&lt;/p&gt;\n&lt;p&gt;5) To provide a maintenance service to all Trust buildings, off site properties and be able to work unsupervised.&lt;/p&gt;\n&lt;p&gt;6) To maintain continuity of service there will be times when extra hours, altered work patterns, duties or location are required.&lt;/p&gt;\n&lt;p&gt;7) To keep up to date with current legislation and attend training courses as directed by Estate Management&lt;/p&gt;\n&lt;p&gt;8) To be able to work safely in accordance with the Health &amp; Safety at Work Act, current guidance and to follow any other safety policies as issued by the Trust&lt;/p&gt;\n&lt;p&gt;9) To be compassionate and mindful to our clients and be mindful of the need for safe use, security, storage of plant, equipment and tools&lt;/p&gt;\n&lt;p&gt;10) To drive between trust properties in a safe and timely manner adhering to trust policies&lt;/p&gt;\n&lt;p&gt;Person Specification Verified at interview (I), by application form (A) or by a test (T)&lt;/p&gt;\n&lt;p&gt;Essential -NVQ3- or equivalent in relevant trade(A.I)&lt;/p&gt;\n&lt;p&gt;-knowledge of domestic and commercial heating, boilers and associated components (A/I)&lt;/p&gt;\n&lt;p&gt;-Competent in the installation of copper, plastic and iron pipework (A/I) -Knowledge of compliance demands in healthcare (A.I.T) -Full clean driving licence (A.I) -knowledge of all associated trades (A,I) -Good communication skills (A,I) -To have basic computer skills (A) -Health &amp; Safety qualification in one of the following: (A,I) -Abrasive wheel certificate&lt;/p&gt;\n&lt;p&gt;Important information - by applying for this position you undertand the following:&lt;/p&gt;\n&lt;p&gt;In order to join NHS Professionals, you will be required to complete an online application form, submit a DBS and Occupational Health questionnaire and complete both online and practical/external mandatory training as required (in your own time, unpaid and travel expenses are not reimbursed). Please only apply if you can commit to this process.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beckenham", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "Plumber - Bethlem Royal Hospital £12.88ph", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259952", "validThrough": "2020-11-20T23:59:59+0000"}