{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-20T16:46:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Consultant Cellular Pathologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Pathology&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Milton Keynes&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£82,096 to £110,683 per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Programmed Activities: &lt;/strong&gt;10&lt;/p&gt;\n&lt;p&gt;Applications are invited to apply for a Consultant position in Cellular Pathology at Milton Keynes University Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This is a replacement post, offering 10 programmed activities.&lt;/p&gt;\n&lt;p&gt;This post completes a team of seven consultant histopathologists. The post is full time and applicants who, for personal reasons, are unable to work full time are also eligible to apply. If such a person is appointed, modification of the job content will be discussed on a personal basis with the Trust, in consultation with consultant colleagues.&lt;/p&gt;\n&lt;p&gt;The post holder will be contracted to provide histopathology and non- gynaecological cytology services at Milton Keynes Hospital Foundation Trust, alongside colleagues in Cellular Pathology. There will be opportunities for teaching, and this will include Cellular pathology Speciality Trainees from the Oxford rotation and Buckingham University Medical Students. Previous teaching experience and academic interest will be advantageous when applying.&lt;/p&gt;\n&lt;p&gt;Coroner’s autopsies at Milton Keynes are arranged by an external provider. There may be an opportunity to join the Coroner’s autopsy rota, subject to discussion but this is not an essential requirement.&lt;/p&gt;\n&lt;p&gt;The post holder will also maintain one or two sub-specialist lead interests.&lt;/p&gt;\n&lt;p&gt;Ideally, this would include gynaecology, head &amp; neck / endocrine and / or upper gastrointestinal tract, in order to complement existing interests of the other consultants. The post holder will be responsible for clinical liaison and participation in multidisciplinary meetings in one or two lead areas.&lt;/p&gt;\n&lt;p&gt;The Cellular Pathology Laboratory is fully accredited to ISO15189 standards and the Mortuary has an HTA Licence.&lt;/p&gt;\n&lt;p&gt;Each consultant is provided with an individual office, personal computer and consultant grade double-headed microscope with facility for microphotography. The secretarial / administrative staff are shared by all the Consultants. The laboratory is fully equipped with two cut up areas (including adjustable AFOS table) and in-house comprehensive immunohistochemistry service. A digital pathology service improvement project is also underway (with scanner on-site) in collaboration with Oxford University Hospital Pathology department.&lt;/p&gt;\n&lt;p&gt;There is a departmental multi-headed microscope, which is used for Cellular Pathology Internal Quality Assurance and teaching / educational meetings.&lt;/p&gt;\n&lt;p&gt;The successful applicant may be expected to participate in teaching both undergraduate and postgraduate students (in association with the University of Buckingham) and to support colleagues undertaking these activities as part of his or her agreed job plan.&lt;/p&gt;\n&lt;p&gt;Located just 50 miles north of London, Milton Keynes has excellent access to the capital whilst being centrally located for Oxford and Cambridge and having ease of access to the north. Lying in attractive countryside, Milton Keynes offers first class facilities for sport, theatre, music, shopping and dining.&lt;/p&gt;\n&lt;p&gt;Doctors considering an application are encouraged to visit the hospital and to meet with potential clinical colleagues.&lt;/p&gt;\n&lt;p&gt;Please submit your CV by attaching it to your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for receipt of applications: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 8th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service Check.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and welcome applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;Milton Keynes is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Angus MolyneuxJob titleDivisional Director for Diagnostics and Clinical LeadTelephone number01908 995807 / Secretary 01908 995803Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Angus Molyneux (Divisional Director for Diagnostics and Clinical Lead ) - 01908 995807 &lt;br /&gt;Secretary - 01908 995803&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Ann Abraham (Consultant Histopathologist) - 01908 995806&lt;/p&gt;\n&lt;p&gt;Secretary - 01908 995803&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pathology - Med Staff (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Consultant Cellular Pathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235334", "validThrough": "2020-11-18T23:59:59+0000"}