{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-03T11:31:42+0000", "description": "&lt;p&gt;Do you want to work in a small, friendly, supportive team based in close proximity to the gateway to the Yorkshire Dales with very good transport links to Leeds, York and beyond?&lt;/p&gt;\n&lt;p&gt;If you’re friendly and enthusiastic with a passion for teamwork, our busy laboratory could be just the place for you to enjoy working. An exciting opportunity has become available for a Medical Laboratory Assistant (MLA) to join our high quality, UKAS accredited laboratory at Harrogate District Hospital Laboratory.&lt;/p&gt;\n&lt;p&gt;The pathology team at Harrogate is a highly regarded service having an excellent reputation with service users. The focus of the department is on delivery of a high quality service with patients at the centre of everything we do. Our vision is to achieve excellence every time.&lt;/p&gt;\n&lt;p&gt;The team at Harrogate is small and friendly requiring a high degree of team work and co-operation from its members so candidates should be prepared to be part of the close knit environment fostered in the department.&lt;/p&gt;\n&lt;p&gt;The hours our 09:00 – 17:30 Monday – Friday, however, the successful candidate will be required to support our weekend working team when fully trained and competency assessed.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual with a positive can-do attitude, who demonstrates this through commitment to the role, passion for patient care and who enjoys working as part of a team. Working in our team of dedicated employees you’ll help us provide diagnostic results in a professional manner reflecting our core values and beliefs.&lt;/p&gt;\n&lt;p&gt;Particular qualities we are looking for include:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A passion for delivering excellent results and an eye for detail&lt;/li&gt;\n&lt;li&gt;Energy and determination&lt;/li&gt;\n&lt;li&gt;Flexibility&lt;/li&gt;\n&lt;li&gt;Positive, can do attitude&lt;/li&gt;\n&lt;li&gt;Great team player&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Some of the benefits of working with us are support through your personal development, guidance through learning new skills and knowledge plus generous holiday entitlements and national NHS staff discount.&lt;/p&gt;\n&lt;p&gt;Harrogate District Hospital Laboratory is part of the Integrated Pathology Solutions Microbiology team. Integrated Pathology Solutions LLP is an innovative joint-venture pathology service between Harrogate &amp; District NHS Foundation Trust, Airedale NHS Foundation Trust and Bradford Teaching Hospitals NHS Foundation Trust. This partnership delivers a high quality pathology service through collaboration between three Trusts for the benefit of patient and service users but the successful candidate will be employed directly by the NHS as a Harrogate &amp; District NHS Foundation Trust employee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have any further queries please contact Helen Kirrane on 01423 555645 or at helen.kirrane@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**This job advert will close as soon as a sufficient amount of applications have been received. Please apply for this job as soon as you can, if you are interested.**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate &amp; District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Medical Laboratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253746", "validThrough": "2020-11-20T23:59:59+0000"}