{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-30T12:01:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist or Cognitive Behavioural Therapist Band 7 1.0 wte&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Coventry - Age Independent Community Mental Health Services to Adults in&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Coventry Recovery Team based at Swanswell Point, Stoney Stanton Road.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a vacancy in the Community Recovery Team for a dynamic Clinical Psychologist / Cognitive Behavioural Therapist to join our large forward thinking team.&lt;/p&gt;\n&lt;p&gt;The Recovery team work with service users with psychotic illnesses across Coventry and are based at Swanswell Point in the heart of the city.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work alongside a wide range of professionals including Community Psychiatric Nurses, Medical Staff, Support Workers, Occupational Therapists, Social Workers, Cognitive Behavioural Approaches practitioners, administrative staff and our Senior Psychologist to deliver recovery focussed interventions in the community. You will receive regular support and supervision from the Management and Leadership team.&lt;/p&gt;\n&lt;p&gt;We utilise the FACT and Recovery models to deliver multi-disciplinary responsive care to our service users. A working knowledge / understanding of these models are preferable. The team also has a number of staffs who are trained in CBA, and have a dedicated CBA caseload, which is supported and supervised by existing Psychology staff.&lt;/p&gt;\n&lt;p&gt;You are required to hold a relevant current registration. As this is a specialist team there is an expectation that you will have previous clinical experience of working with people experiencing psychosis and/or research experience in psychosis or a related field. It is essential that the candidate has a commitment to and interest in providing evidence based psychological interventions for psychosis, as well as having good risk management skills.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals who can work confidently on their own as well as supporting the team. Good communication and problem solving skills are essential, as well as knowledge of mental illness and the challenges this brings in daily life. You also need to be a driver with access to a car that can be used for business purposes. We also are looking for people who can demonstrate the Trust’s vision and values in practice, and are motivated to be involved in innovation and service development, and being a supportive member of the team.&lt;/p&gt;\n&lt;p&gt;The role has the expectation of supervising and / or supporting junior staff and providing leadership for the team, your leadership skills will also be assessed in interview.&lt;/p&gt;\n&lt;p&gt;Visits to the team or questions are encouraged to appreciate this exciting but challenging role&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Suzanne Madle-Williams / Debbie Leedham / Neil Emsden – Managers of the Recovery Team or Dr Karen Jarrold – Clinical Psychologist on 02476 961242&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanswell Point, Coventry", "postalCode": "CV1 4FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.414", "longitude": "-1.50785"}}, "title": "Clinical Psychologist / Cognitive Behavioural Therapist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250086", "validThrough": "2020-11-18T23:59:59+0000"}