{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on qualifications"}}, "datePosted": "2020-10-20T14:42:35+0100", "description": "&lt;p&gt;Hours: Part Time or Full time hours available, but must be able to work Tuesdays, Wednesdays and Fridays &lt;/p&gt;\n&lt;p&gt;Salary: Dependent on qualifications and experience &lt;/p&gt;\n&lt;p&gt;Kennet and Avon Medical Partnership is a 17,500 patient practice serving the towns of Marlborough and Pewsey in North East Wiltshire, and their surrounding rural environs. The practice is situated within the heart of the North Wessex Downs Area of Outstanding Natural Beauty; has a range of excellent local schools and is close to the M4 and mainline railway services to London and the rest of the country.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, capable and highly motivated Practice Nurse to join our friendly nursing team. We are looking for a staff member who can undertake both treatment room duties and be a part of our telephone triage team.&lt;/p&gt;\n&lt;p&gt;Treatment room experience is essential and successful candidates will have experience and knowledge in the management of respiratory conditions. Training is available for the right candidate to ensure we have a nurse who can provide excellent care to the practice population.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join a valued team who will support and encourage you to develop your skills.&lt;/p&gt;\n&lt;p&gt;Closing date for applications:Monday 9 November 2020 10:00am&lt;/p&gt;\n&lt;p&gt;If you are shortlisted we will contact you to arrange a convenient time for interview.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kennet and Avon Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135427"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marlborough &amp; Pewsey", "postalCode": "SN8 4BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.418", "longitude": "-1.72916"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234839", "validThrough": "2020-11-09T23:59:59+0000"}