{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-26T15:47:10+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for a permanent Band 5 Chaplain to work within the Chaplaincy Team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In Mental Health and learning disability services, service users can experience a wide range of challenges; emotional, physical, mental, social and spiritual. Health and care professionals need to use a holistic approach to meet all their needs. Frequently the most neglected area is spiritual care, as over the years in society and in mental health services, spiritual care has been undervalued. This is a position that is changing in society with a growing number of people identifying themselves as spiritual or having a faith they believe in and practice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a member of the chaplaincy team, you will pro-actively deliver spiritual and pastoral care to patients, relatives, staff and learners across the services of Leeds and York Mental Health and Learning Disability Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a committed and passionate individual who has proven pastoral experience in mental health and learning disability settings or a willingness to receive additional training in mental health.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will be required to join the on-call rota in addition to their contractual hours. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We aspire to having a chaplaincy team that actively has a visible presence on our inpatient wards and across our services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You must be an ordained minister of religion from any of the main Church affiliated to the Churches together in England, with at least two years post-ordination experience. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post involves visiting of wards and working closely with clinical teams. As part of your role you will be responsible for Presiding at Christian worship or communion service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to know more about the service we provide or about the post please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rev Dr Michael Mkpadi, Lead Chaplain.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressMichael.mkpadi@nhs.netTelephone number07884197261&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Mount, Leeds", "postalCode": "LS2 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8042", "longitude": "-1.55908"}}, "title": "Chaplain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243234", "validThrough": "2020-11-09T23:59:59+0000"}