{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-20T08:15:51+0100", "description": "&lt;p&gt;Manchester University NHS Foundation Trust with partners Bruntwood and Manchester City Council (MCC) are looking for an exceptional candidate who can lead on the development, growth and long term sustainability of the Oxford Road Corridor Enterprise Zone.&lt;/p&gt;\n&lt;p&gt;The Enterprise Zone Manager is a pivotal role in the success of the Enterprise Zone. Ideally suited for a candidate with a strong track record of multi-sectoral partnership working, the postholder will responsible for realising the substantial benefits of co-locating commercial organisations within and next to the UKs largest clinical/ academic campus.&lt;/p&gt;\n&lt;p&gt;Whilst this post sits within the Innovation Team within MFT Research &amp; Innovation, reporting to the Head of Innovation, the successful candidate will work closely with Bruntwood, MCC, industry partners, and wider stakeholders.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have an in-depth understanding of the commercial and NHS sectors, and how to bring both together for mutual benefit and economic growth, have the ability to form fruitful relationships from a range of sectors, whilst being detail orientated enough to manage complex reporting requirements. A track record in supporting successful grant funding bids and/ or business case development is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Katherine BoylanJob titleHead of InnovationEmail addresskatherine.boylan@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester University NHS Foundation Trust, Manchester", "postalCode": "M13 9NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22935"}}, "title": "Enterprise Zone Growth Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233450", "validThrough": "2020-11-10T23:59:59+0000"}