{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 + 5% HCA pro rata per annum"}}, "datePosted": "2020-11-03T14:33:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;SW Quadrant Band 6 Speech and Language therapist - 22.5 hours per week.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated Speech and Language Therapist, with a specialist interest in working with Preschool children (under 5 years of age) and their families, to join our supportive and creative team.&lt;/p&gt;\n&lt;p&gt;You will work as a member of our well established and friendly Early Years Team. This is a challenging, varied and rewarding role. Day to day you will be conducting assessments, writing reports and running therapy sessions (groups or individual) for a varied population of 0-5 year olds including children with Language disorders and delays, Social Communication Disorders, Speech difficulties, stammering, Down Syndrome, general delay and much more. You may work from a variety of settings (e.g. Health centres, Children’s Centres, nurseries and patient’s homes).&lt;/p&gt;\n&lt;p&gt;You will be based at either Farnham Centre for Health or Buryfields Clinic in Guildford in Surrey&lt;/p&gt;\n&lt;p&gt;As part of your role, you may also be involved in:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Conducting Multi-disciplinary assessments&lt;/li&gt;\n&lt;li&gt;Delivering training to parents, Health Visitors or nursery/school staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Supporting and line-managing less experienced members of the team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Organising and co-ordinating a small team within your local area&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Conducting multi-disciplinary assessments&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We firmly believe that the best services for the children we serve come out of effectively training and supporting our Therapists. As such you will be supported by the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular supervision with your designated experienced Speech and Language Therapist&lt;/li&gt;\n&lt;li&gt;A rolling programme of in-house training running across Surrey to update your knowledge and skills throughout the year (including ‘ASD diagnosis’, ‘Stammering’, ‘Using Parent Child Interaction’, ‘Writing EHCPs’, ‘Attention Autism’ (to name but a few).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Access to a well-developed Learning and Development department offering leadership and personal development opportunities to support your personal development plan.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Working as part of a fantastic team, who share challenges and celebrate successes together&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a team, we all need to be able to travel between sites across Surrey, therefore being a car driver and owner is essential.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Children and Family Health Surrey is made up of three partnering organisations; CSH Surrey, First Community Health and Care, and Surrey and Borders Partnership NHS Foundation Trust. Together, we provide one Surrey-wide community health service for children and young people from 0 to 19 years of age (up to 25 years for young adults with additional needs) and their families and carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To find out more about the role please contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Karen Moran Clinical Team Lead SW Quadrant &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mobile: 07831407665&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Tel: 01483 783315 &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Email: karenmoran@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "GU2 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2317", "longitude": "-.576827"}}, "title": "Band 6 - Paediatric Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254358", "validThrough": "2020-11-20T23:59:59+0000"}