{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45669", "minValue": "41808", "unitText": "YEAR", "value": "£41,808 - £45,669 per annum"}}, "datePosted": "2020-11-04T08:59:53+0000", "description": "&lt;p&gt;About The Role&lt;/p&gt;\n&lt;p&gt;FRENCHAY BRAIN INJURY REHABILITATION CENTRE&lt;br /&gt;&lt;br /&gt; Frenchay Brain Injury Rehabilitation Centre in Bristol is the Level 1 service for patients with complex neurological rehabilitation needs for the South West of England. We have 52 rehabilitation beds and offer both Level 1 (intensive) and Level 2 (slower stream) specialist inpatient rehabilitation for patients with brain injury and other neurological conditions. The service is run by The Huntercombe Group in partnership with North Bristol &lt;strong&gt;NHS&lt;/strong&gt; Trust. &lt;br /&gt;&lt;br /&gt; Employer: The Huntercombe Group&lt;br /&gt;&lt;br /&gt; The Frenchay Brain Injury Rehabilitation Centre provides an intensive in-patient rehabilitation service to patients with complex needs following traumatic and acquired brain injury. We expanded in 2017 from 29 Level 1 beds to include a further 23 Level 2 neuro-rehabilitation beds for the South West region.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; This is a very exciting time to come and join our Psychology Team as we further expand our therapy service. We are looking for an enthusiastic and innovative Clinical Psychologist to take up this important new role within our neuropsychological rehabilitation team. You will be joining an established team of a Consultant Neuropsychologist, three Clinical Psychologists and two Assistant Psychologists, and will work closely within a friendly and dynamic interdisciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Clinical duties include neuropsychological assessment, cognitive rehabilitation, and approaches for managing challenging behaviour. You will play a key role in the provision of a high quality, evidence-based service. The role will include neuropsychological assessment, planning, implementing and monitoring interdisciplinary rehabilitation plans, working with groups and families. As well as a direct clinical caseload of patients, you will provide advice, training and consultancy to the inter-disciplinary team. Clinical audit, clinical governance and research will also be a component of the post. You will require a specialist knowledge base with experience in neuropsychological approaches and/or rehabilitation, and be able to work autonomously.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; You will join a well-established Department of Neuropsychology at Frenchay BIRU, benefitting from the support of neuropsychology colleagues, and the wider neuroscience community including the Institute of Clinical Neuroscience, which has close links with the University of Bristol.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The post offers a friendly and supportive working environment, and a commitment to ongoing training and professional development. Support will be given to the post-holder to pursue the Division of Neuropsychology Qualification in Clinical Neuropsychology (QICN).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We welcome applications from newly qualified Clinical Psychologists.&lt;br /&gt; For informal enquiries or to arrange an informal visit, please contact Dr. Mar Matarin, Consultant Neuropsychologist.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Genrous annual leave allowance &lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4962", "longitude": "-2.5256"}}, "title": "Clinical Psychologist in Neuropsychological Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255124", "validThrough": "2020-12-06T23:59:59+0000"}