{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa pro rata"}}, "datePosted": "2020-10-28T14:46:06+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking to appoint two Senior Data Analysts to work short-term and part-time 1 at 0.6 FTE and 1 at 0.4 FTE to lead work to translate GIRFT coding algorithms into a standard format. The algorithms will allow the automatic flow of data from HES data into structured tables to support reporting of metric values in Model Hospital. These analysts may also provide analysis to support the writing of GIRFT National Reports. The post-holders will report to the GIRFT Chief Information Officer.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Getting It Right First Time (GIRFT) programme aims to improve clinical quality and efficiency within the NHS by reducing unwarranted variation. The programme offers an opportunity to deliver a real difference to hundreds of thousands of patients and to the NHS in general. GIRFT supports NHS Trusts to implement change that results in patients spending less time in hospital and clinicians providing care safely. GIRFT also works with national organisations to change policy and processes where these changes support improvement in NHS clinical services.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post-holders will be part of a virtual team who deliver analytical support to a significant clinical improvement programme. Highly developed technical skills, and the ability to work independently and to contribute significantly to a virtual team are key requirements for the positions. The selected people will have strong analytical skills and will understand NHS data and data flows, including how these relate to and have been used in the GIRFT programme.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that this job can be closed earlier once we have received suffificent applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interviews to be held on 11th or 12th November 2020.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further detailsplease contact:&lt;/p&gt;\n&lt;p&gt;Jamie Day Chief Information Officer jamieday@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Home Based", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "GIRFT Senior Data Analyst x 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247043", "validThrough": "2020-11-11T23:59:59+0000"}