{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive, Very Senior Manager Salary"}}, "datePosted": "2020-10-27T10:02:11+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role requires an inspirational, inclusive values-driven leader, who is either a director of nursing or aspires to become one, with a strong track record of leading and driving quality improvement and innovation in a mental health and learning disability organisation, demonstrably improving its services and inspiring the clinical workforce.&lt;/p&gt;\n&lt;p&gt;The post holder will have the ability to build and develop a high-performing clinical professional and quality governance leadership team and to build an engaged and committed workforce from Board to floor. The Trust is currently rated as good by the Care Quality Commission (CQC). The new Director of nursing has an excellent opportunity to lead the Trust to provide care that is recognised as outstanding.&lt;/p&gt;\n&lt;p&gt;The Executive Director of Nursing and Quality has Board level responsibility for the overall Quality Strategy of the organisation. They will work closely with the Medical Director in delivering Clinical Leadership and Governance to inform Clinical Service delivery.&lt;/p&gt;\n&lt;p&gt;As a Board member, the Director of Nursing and Quality will inspire confidence through their knowledge and expertise and ensure that the Board keeps Quality at the core of decision making.&lt;/p&gt;\n&lt;p&gt;This is a role for an existing Director of Nursing, or experienced Deputy Director, with an in depth understanding of mental health and learning disabilities – including the Recovery Model - to build on existing quality improvements to ensure the best possible services as being delivered to patients.&lt;/p&gt;\n&lt;p&gt;The role is being offered on a two-year fixed term contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When submitting your online application, then please ensure that your supporting statement includes the expressions of interest letter and a values based statement.&lt;/p&gt;\n&lt;p&gt;The interview and stakeholder panel will take place the week commencing 23rd November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Allan, Executive Assistant to the Trust Secretariat&lt;/p&gt;\n&lt;p&gt;Email address Amanda.Allan@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Director of Nursing and Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243930", "validThrough": "2020-11-15T23:59:59+0000"}