{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a. inc HCA  (+£7k p.a. RRP) *T"}}, "datePosted": "2020-10-27T17:30:49+0000", "description": "&lt;p&gt;Guy&#39;s and St Thomas&#39; NHS Foundation Trust is looking for a talented Project Manager - Mechanical and Electrical for our Capital Development Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Guy&#39;s and St Thomas’ NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join a dynamic and forward-looking organisation in the heart of the capital where you can develop your career and broaden your horizons. 79% of staff who took part in the latest national NHS Staff Survey would recommend Guy’s and St Thomas’ as a place to work. As a member of the Essentia Team, the Directorate delivering the estates and facilities functions you will have access to an unrivalled education programme through the Essentia Academy. The capital programme is extensive and varied and the capital delivery team are very welcoming team.&lt;/p&gt;\n&lt;p&gt;You’ll be part of a professional team that’s in tune with the values of the NHS and understands the distinctive challenges and responsibilities that come from working within a highly complex and challenging projects environment.&lt;/p&gt;\n&lt;p&gt;You will be responsible for delivering mechanical and electrical projects within a portfolio, of which recent projects delivered ranged from central chiller plant, air-handling units, generators through to replacement HV/LV switchgear.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for delivery of mechanical and electrical infrastructure projects; showing high levels of technical capability, sound commercial knowledge and a good understanding of the key drivers of cost and value; capturing and sharing knowledge and driving innovation in design and construction. They will be presented with a great opportunity for career progression whilst at the same time being exposed to a variety of projects. Further education qualification opportunities, training courses and regular CPD events will be available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Activities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead day to day delivery of engineering and construction projects&lt;/li&gt;\n&lt;li&gt;Being responsible for and managing the complete project lifecycle from feasibility to hand over&lt;/li&gt;\n&lt;li&gt;Producing funding Business Cases and Project Execution Plans&lt;/li&gt;\n&lt;li&gt;Manage design teams in the development of design solutions&lt;/li&gt;\n&lt;li&gt;Manage construction delivery within a fully functional hospital environment&lt;/li&gt;\n&lt;li&gt;Stakeholder mapping and engagement&lt;/li&gt;\n&lt;li&gt;Administration of NEC building contracts, proactively managing and confirming the compliance of contractors/consultants to the contract terms and conditions&lt;/li&gt;\n&lt;li&gt;Initiation and development of project documentation, programmes, budget etc.&lt;/li&gt;\n&lt;li&gt;Design and produce reports to suit relevant stages of the projects&lt;/li&gt;\n&lt;li&gt;Deliver projects within the framework of risk, sustainability and environmental considerations agreed at the outline business case stage, while maintaining focus on time, cost and quality&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Significant experience of project management, ideally within a construction environment&lt;/li&gt;\n&lt;li&gt;High quality technical writing, client-facing and communication skills&lt;/li&gt;\n&lt;li&gt;Experience of producing reports on a monthly basis relating to project deliverables&lt;/li&gt;\n&lt;li&gt;Experience of programme creation, analysis, interpretation and reporting&lt;/li&gt;\n&lt;li&gt;Knowledgeable or accredited in NEC3&lt;/li&gt;\n&lt;li&gt;Well-organised, proactive able to identify areas of need and to manage outputs , assertive, well-disciplined and commercially astute&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In your application form please address the following questions &lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you implemented electrical or mechanical infrastructure projects?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In 150 words or less, please state your experience of managing construction projects.&lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a dynamic challenging job in an exciting, fast moving, flexible working environment. We have a strong commitment to your personal and professional development.&lt;/p&gt;\n&lt;p&gt;In addition, we offer excellent benefits, including:&lt;/p&gt;\n&lt;p&gt;The NHS Pension Scheme - one of the most generous and comprehensive in the UK. When you start working for the NHS you automatically become a member and you will get an excellent package of pension benefits.&lt;br /&gt;&lt;br /&gt;Interest free Season Ticket Loan &lt;br /&gt;Long Term Service Awards &lt;br /&gt;Subsidised on-site nurseries and childcare vouchers&lt;br /&gt;A comprehensive staff health and well-being programme, &#39;5 ways to a healthier YOU&#39;&lt;br /&gt;Ride to work scheme&lt;br /&gt;Employee assistance programme&lt;br /&gt;Free stop smoking service&lt;/p&gt;\n&lt;p&gt;Our Trust values: &lt;em&gt;Put patients first, Take pride in what we do, Respect others, Strive to be the best, Act with&lt;/em&gt; &lt;em&gt;Integrity&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to join the team, please apply online&lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy is 8 November 2020.&lt;/p&gt;\n&lt;p&gt;Interviews will be held week commencing Monday 16 November 2020 via Microsoft teams&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alan PonderAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this appointment please contact Alan Ponder, Programme Manag via email on Alan.Ponder@gstt.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "200 Great Dover Street, SE1 4YB, London", "postalCode": "SE1 4YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5006", "longitude": "-.092475"}}, "title": "Project Manager - Mechanical and Electrical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245586", "validThrough": "2020-11-08T23:59:59+0000"}