{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T10:01:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking to appoint Perioperative Care Practitioners (Theatres) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We believe in developing our Theatres’ staff to their full potential and we offer a number of theatres-tailored post-qualification opportunities, including the Anaesthetic Practitioner programme (endorsed by Cambridge University Heath Partners), the Surgical First Assistant Programme, Practice Supervision, the ILS/PILS, ILM Level 2 Award in Leadership and Team Skills, among other pathways that can lead to post-graduate qualifications. And if you are recently qualified, we run a very successful multi-professional Perceptorship Programme, designed to set your Theatres’ career in motion.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our operating theatres are split into three units, covering trauma and orthopaedics, emergencies, transplant, vascular and general surgery, max fax, plastics, ENT and paediatrics. In addition to this, there are two other complexes with: day surgery, gynaecology and urology (including robotic surgery), neurosurgery, maternity surgery and ophthalmology.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are proud of forming a team of dynamic people that are invested in innovation, excellence and in improvement of outcomes for patients but also of their experience of going through Theatres. If you share our vision of continuous growth, with a focus on patient safety and quality care, we would love to hear from you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need a valid NMC/HCPC registration (or be in the process of obtaining it). Full Time working hours: 37.5 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post attracts an annual enhancement of £2000 (pro rata) on the attainment of an annual competency package. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 25th October 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePractice Education TeamTelephone number01223 257199&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division A, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Perioperative Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241949", "validThrough": "2020-11-09T23:59:59+0000"}