{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10000", "minValue": "10000", "unitText": "YEAR", "value": "£10,000"}}, "datePosted": "2020-10-30T14:46:42+0000", "description": "&lt;p&gt;Are you currently looking for an exciting opportunity to work for one of the largest NHS Trusts in the country? Have you recently left education and exploring options to join the wonderful world of work? Do you hold English and Maths grade A-C (4-9) or Functional Skills at Level 2? Do you have an Information Technology level 3 qualification? If the answers are yes, this position may be for you.&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity exists within our Healthcare Careers and Development Education department working alongside and supporting the work experience and community engagement team. Your role will be to develop and manage web design and virtual learning packages, to assist with the delivery of virtual work experience and pre-employment programmes for our students. You will work alongside the Work Experience and Education Support Manager to engage with the local community and promote NHS Careers via innovative digital technologies. You will undertake a work-based training qualification at a level 4. The programme aims to develop a competent digital professional, who can demonstrate practice independently within an organisation in a variety of roles.&lt;/p&gt;\n&lt;p&gt;You will be required to work across all UHB hospital sites. The working pattern will be Monday – Friday, 08:30 – 16:30, integrated study day within this timeframe.&lt;br /&gt;Apprenticeship programmes are a key part of our wider workforce strategy supporting us to build a skilled and aspiring workforce of the future, nurturing our talent through high quality on the job training and development. Through our apprenticeship programme, we will give you the opportunity to develop a career within the NHS.&lt;/p&gt;\n&lt;p&gt;As an apprentice, you will work alongside experienced colleagues to gain job-specific skills and study a nationally recognised professional qualification. The main benefit of an Apprenticeship@UHB is that you can earn whilst you learn. You will also have the opportunity to undertake a short trial period, to ensure this role is the right fit for you and us. Details of the trial period will be discussed further with the successful candidate.&lt;br /&gt;Working for the Trust offers exceptional benefits including 20 days paid annual leave plus bank holidays, discounts on 100s of brands including restaurants, holidays and discounted travel schemes. There are also a number of on-site restaurants and a gym, plus many more incentives.&lt;/p&gt;\n&lt;p&gt;Please read the job description and person specification and if you think this role is for you, please apply and tell us why.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Stephanie Parkes, Work Experience &amp; Education Support Manager on:&lt;/p&gt;\n&lt;p&gt;0121 424 3147 or stephanie.parkes2@uhb.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Digital Apprenticeship", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250641", "validThrough": "2020-11-13T23:59:59+0000"}