{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum plus HCA where applica"}}, "datePosted": "2020-10-26T13:46:34+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that NEL staff At-Risk candidates will be given priority***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated individual to join the Clinical Services Team at NEL. The post holder will be part of the Medicines Management Optimisation Team and will be responsible for processing funding requests for both National Tariff excluded Drugs and clinical procedures, on behalf of our CCG customers.&lt;/p&gt;\n&lt;p&gt;This role will involve reviewing funding requests, predominantly from secondary care organisations via the National database Blueteq. The post holder will be responsible for maintaining the integrity of the database through routine processes; producing reports from the database as required by the team and other relevant tasks.&lt;/p&gt;\n&lt;p&gt;The post holder will have excellent communication, IT and interpersonal skills and will be provided with the opportunity to develop their skills and knowledge in the role.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who thrives on undertaking a variety of tasks and challenges with an interest in learning a specialist area of healthcare provision and who would welcome the opportunity to provide this flexible support to the team.&lt;/p&gt;\n&lt;p&gt;For further details on this role, please refer to the job description attached. Please ensure that you pay careful attention to the essentials and desirables of the persons specification when completing your supporting statement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte WatersJob titleCompliance Assurance and Engagement LeadEmail addresscharlotte.waters@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent House, Ashford", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Compliance Assurance Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242735", "validThrough": "2020-11-09T23:59:59+0000"}