{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-23T16:34:35+0100", "description": "&lt;p&gt;If you are looking for an exciting new challenge, Healthcare Support and Infrastructure Services (HSIS) is the place for you. HSIS is a wholly owned subsidiary of Lancashire &amp; South Cumbria NHS Foundation Trust (LSCFT) which is a Specialist Mental Health and Community NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit two Assistant Project Managers on a permanent basis to join our Capital Projects team.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The post holder will support the delivery of the capital programme by delivering or supporting the delivery of individual projects and works packages under supervision. &lt;/em&gt;&lt;em&gt;This will include design, tendering, liaising with consultants and contractors, agreeing standards and ensuring they are met, and acceptance of work packages. The post holder will receive the required support and supervision from our experienced team.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This role is a fantastic opportunity to join an organisation that is passionate about the services it provides.&lt;/p&gt;\n&lt;p&gt;This post may be subject to a standard DBS Disclosure and the successful applicant will be required to pay for their DBS Check.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post please contact Ash Chudasama or Chris Rowe on 01772 773580.&lt;/p&gt;\n&lt;p&gt;This post may close early due to high numbers of applications so you are advised to apply promptly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bamber Bridge, Preston", "postalCode": "PR5 6UP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7282", "longitude": "-2.66605"}}, "title": "Assistant Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241333", "validThrough": "2020-11-06T23:59:59+0000"}