{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43250", "minValue": "32450", "unitText": "YEAR", "value": "£32,450 - £43,250 (Pro-Rata)"}}, "datePosted": "2020-11-02T12:40:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part Time - 18.5 Hours Per Week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people with substance misuse issues across the country. As a community based Non-Medical Prescriber or Pharmacist Prescriber in our Rochdale&amp; Oldham services, you&#39;ll make a real difference to their lives of those experiencing difficulties from drugs and alcohol usage. Passionate about people, you&#39;ll enjoy the opportunity and support to enhance your own life and career too, as you gain the experience and training you need to progress in your nursing or Pharmacy career.&lt;/p&gt;\n&lt;p&gt;Our integrated community drug and alcohol service offers support to individuals across Rochdale &amp; Oldham. You will work within a busy prescribing service under the supervision of our Clinical Services Manager, alongside our Clinical Team and specialist Recovery Workers and Peer Mentors to improve the wellbeing of a wide range of individuals.&lt;/p&gt;\n&lt;p&gt;Running health and social care services as a social enterprise, we invest every penny back into our care - and our people. So, if you&#39;re ambitious and ready for a fresh challenge, progress your career with a sector leader.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Non-Medical Prescriber Nurse (NMP) or Pharmacist Prescriber, you will be involved with opiate substitute treatment, alcohol and opiate detoxifications and relapse prevention medications. As part of the wider Wellbeing Team you will also provide support to the nursing team providing Blood Borne Virus screening and vaccinations and will work closely with mental health, physical health and social care services. You&#39;ll also help to create a collaborative approach that links Turning Point ever closer to outside professionals and agencies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an Independent Non-Medical Prescriber Nurse (NMP) or Pharmacist Prescriber that will join an established team, you will need to be an excellent communicator, you&#39;ll have the ability to develop support packages that are creative, flexible and tailored to the needs of each individual. And of course, we&#39;re looking for a Non-Medical Prescriber Nurse or Pharmacist Prescriber who loves talking to people with different needs, is genuinely interested in helping them, and possesses a deep level of empathy, understanding and patience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration / GHpC Renewal fee paid for&lt;/li&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from Investors in People&lt;/li&gt;\n&lt;li&gt;31 days’ paid holiday a year, increasing with each year of service up to 33 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rochdale &amp; Oldham", "postalCode": "OL16 1QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6152", "longitude": "-2.15635"}}, "title": "Part Time Non-Medical Prescriber Nurse or Pharmacist Prescriber - ROAR", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252087", "validThrough": "2020-11-30T23:59:59+0000"}