{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19550", "minValue": "19550", "unitText": "YEAR", "value": "£19,550 pa"}}, "datePosted": "2020-10-27T09:15:19+0000", "description": "&lt;p&gt;&lt;span&gt;CDD Services is a wholly owned subsidiary of County Durham and Darlington NHS Foundation Trust (CDDFT) set up to deliver a range of non-clinical Estates, Facilities and Procurement services across the Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;CDDFT are one of the largest integrated care providers in England serving a population of around 650,000 people. Acute hospital services are provided at Darlington Memorial Hospital and University Hospital of North Durham and Bishop Auckland Hospital is a centre for planned care. Community services are provided from six community hospitals alongside eighty other community based locations. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;CDD Services’ Inventory Management team is responsible for the ordering, stock control, receipt and distribution of more than £25m of medical supplies into 3 major CDDFT hospitals and 58 further healthcare locations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to join CDD Services’ Inventory Management team working in the receipt and distribution department at the University Hospital of North Durham. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be a well-motivated, outgoing, conscientious person to join our Material Management team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be part of the inventory management team within CDD Services and proactively provide materials management support to wards and departments at all stakeholder trusts and also support the receipt and distribution service for all CDD Services stakeholders. This includes receipt, storage and engagement with other Trust employees to ensure goods reach the intended destination as quickly as possible. The post requires exceptional communication skills, with the ability to communicate at all levels within the customer base.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "CDD Services (Synchronicity Care Ltd)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham", "postalCode": "DH1 5TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7889", "longitude": "-1.59294"}}, "title": "Assistant Materials Management Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243790", "validThrough": "2020-11-10T23:59:59+0000"}