{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T09:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;EPR Application Support Co-Ordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – All MFT Sites&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have a pivotal role in supporting the largest Transformation Programme that Manchester University NHS Foundation Trust has ever undertaken!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Patients are at the centre of everything we do. We&#39;re embarking on an unprecedented clinical transformation programme that will really change the way we work. We&#39;ve partnered with a world-class medical software company, Epic, to introduce Hive, a brand-new Electronic Patient Record (EPR) solution that will bring all our patient information into one easily accessible place and make our services more effective than ever before.&lt;/p&gt;\n&lt;p&gt;It will provide real-time information about any patient’s condition, treatment plan, diagnostic results, scheduled clinics and much more – providing timely and relevant advice to help clinical teams make the right decisions at the right time.&lt;/p&gt;\n&lt;p&gt;Our vision is to create a digitally enabled organisation that supports the delivery of efficient and effective patient care, achieved through easy-to-use systems that provide staff and patients with access to the right information, in the right place, at the right time.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you looking to take the next step in your career and be part of the largest initiative of its kind? &lt;/em&gt;&lt;/strong&gt;A career in the NHS will provide you with a whole host of possibilities. You will receive world class training, allowing you to learn and develop throughout your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will need and who does this suit?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Programme is popular, competitive and intellectually demanding - your strong academic background and confident analytical skills will put you in an excellent position.&lt;/p&gt;\n&lt;p&gt;We’re looking for enthusiasm, spark and real determination too; people who will drive their own development and take every opportunity that comes their way to learn.&lt;/p&gt;\n&lt;p&gt;You enjoy working in a fast-paced environment where everything evolves very quickly. You inspire and motivate others – by keeping up the momentum through promoting agile working and ensuring we constantly deliver.&lt;/p&gt;\n&lt;p&gt;You will need a good eye for detail, a creative mind for analysing trends, and the courage to adopt new analytical methods. Ability to see the wood for the trees, synthesise new information and make sensible assumptions to enable a path forward will also help you deliver within your role.&lt;/p&gt;\n&lt;p&gt;Team spirit &amp; great communication is the key to success in this job and if you love working with people and you thrive in a caring, creative and collaborative culture, then you’ll fit right in!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;No matter what you studied at university, the fact you successfully completed your degree to a high standard shows you’ve got potential we’re absolutely looking for.&lt;/p&gt;\n&lt;p&gt;The programme kicks off with a dedicated induction programme to help get you up to speed and a clear understanding of where your role fits into our business.&lt;/p&gt;\n&lt;p&gt;This will give you the opportunity to start building relationships and personal support networks early. You will also be given a personalised training plan, carved out time, one to one support and training materials to get you through your Epic accreditation which is recognised globally.&lt;/p&gt;\n&lt;p&gt;In short, the Induction will ensure you’re ready to hit the desk running, confident enough to make real contributions from day one. You’ll be welcomed as a valuable team member and will enjoy direct contact not just with your peers, but with senior members of staff throughout the organisation too.&lt;/p&gt;\n&lt;p&gt;Being a member of the EPR Application Team, you will support the design and set up of EPR modules and adapt them to our working practices and standards. Your work will be a vital link between the new technology and our services and will ensure our transition to Hive is a success.&lt;/p&gt;\n&lt;p&gt;You will work closely with our staff to analyse our current processes, then agree on clinical and operational standards and future workflows to be built in to Epic, the software that supports Hive. To make sure our systems meet operational and auditing requirements, you’ll also collaborate with our Business Intelligence team.&lt;/p&gt;\n&lt;p&gt;As a central member of the project, you will work with clinicians and other staff related to your module. There will also be opportunities for you to network with other EPR module teams across testing, security, user support and medical device integration. You will get the opportunity to take responsibility, while building on your personal and professional skills.&lt;/p&gt;\n&lt;p&gt;Before, during and after Go Live you’ll be an ambassador of the new system, providing training and supporting staff across the Trust to ensure a successful launch.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join us at the forefront of change and you&#39;ll enjoy plenty of opportunities, together with all the benefits you can expect as an NHS employee.&lt;/p&gt;\n&lt;p&gt;Alongside a competitive salary, you can expect a comprehensive benefits package including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous holiday entitlement (increasing with service)&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Employee Health and Wellbeing Service&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP) – free 24hr confidential helpline&lt;/li&gt;\n&lt;li&gt;Financial wellbeing support&lt;/li&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;Childcare support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You can also get discounts on and contribute to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Healthcare cash plans&lt;/li&gt;\n&lt;li&gt;Cycle scheme&lt;/li&gt;\n&lt;li&gt;Interest free travel loans&lt;/li&gt;\n&lt;li&gt;Discounts on several gym memberships&lt;/li&gt;\n&lt;li&gt;Plus, much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are committed to your development and as you will have transferable skills but not the relevant experience, we are offering this as a development role. Please note, progression is at the recruitment managers discretion.&lt;/p&gt;\n&lt;p&gt;Personal development is important&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Working agilely across all MFT sites, Wythenshawe", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "EPR Applications Support Co-Ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253315", "validThrough": "2020-11-15T23:59:59+0000"}