{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 + 5% HCA"}}, "datePosted": "2020-10-19T12:41:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Title: &lt;/strong&gt;System Frailty Lead&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;Band 8D £77,705 - £89,545 including Fringe London Weighting (pro rata if part time)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full time / Flexible / Part-time&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;________________________________________________________________________________&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North West Surrey Integrated Care Partnership (ICP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NW Surrey ICP brings together a range of organisations across healthcare, local government and the voluntary and community sector and provides a framework to support integrated care at a local level. In NW Surrey we work together to plan and deliver services. This means we are able to tackle some of the wider determinants of health such as housing, health behaviours and environment, which we know have a significant impact on health outcomes.&lt;/p&gt;\n&lt;p&gt;Across its partners, our ICP employs thousands of local people and is responsible for the management of an NHS budget of c. £550m and a full portfolio of local government services. Our partners include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ashford and St Peter’s NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;CSH Surrey&lt;/li&gt;\n&lt;li&gt;Elmbridge Borough Council&lt;/li&gt;\n&lt;li&gt;NHS England and NHS Improvement&lt;/li&gt;\n&lt;li&gt;NICs GP Federation&lt;/li&gt;\n&lt;li&gt;Surrey Heartlands CCG&lt;/li&gt;\n&lt;li&gt;Runnymede Borough Council&lt;/li&gt;\n&lt;li&gt;South East Coast Ambulance Service&lt;/li&gt;\n&lt;li&gt;Spelthorne Borough Council&lt;/li&gt;\n&lt;li&gt;Surrey and Borders NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Surrey County Council&lt;/li&gt;\n&lt;li&gt;Woking Borough Council&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The NW Surrey ICP is led by a Partnership Board which comprises of Chief Executives and Directors of the constituent organisations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;System Frailty Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for someone to lead our Frailty Service with an ambition to facilitate people in North West Surrey only telling their story once. Working together with partners across the system, the post holder will support the wider on-going transformation of services in line with Surrey Heartlands  ICP strategic direction and the 5 year forward plan, driving a culture of safety, clinical effectiveness and continued improvement for patient experience with excellent outcomes. &lt;/p&gt;\n&lt;p&gt;Working in a matrixed environment, the System Frailty Lead will oversee the work of the Frailty Services, based at three community locations in Woking, Runnymede, Elmbridge &amp; Spelthorne, and will lead the strategic development of Frailty in North West Surrey to promote integrated and co-ordinated care to support better outcomes for people, to promote independence, and to transform the way that patients experience this offer.&lt;/p&gt;\n&lt;p&gt;We are looking for a leader who is able to build trusted and effective relationships across a range of stakeholders and has the ability to engage people and inspire them to work towards shared goals. The successful candidate will have extensive knowledge of NHS and social care policy and systems through experience of working across organisations and they will have proven experience of successfully applying change management and improvement methodologies within complex environments.&lt;/p&gt;\n&lt;p&gt;You will be joining a team of talented and caring individuals, driven to improve health outcomes for the population of Surrey. We will support you to maximise your learning in this post through a tailored personal development plan. We offer flexible working practices and welcome applications from individuals wanting to work full or part time hours.&lt;/p&gt;\n&lt;p&gt;We are committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expect all staff and volunteers to share this commitment. We want to be a partnership of inclusive and diverse employers, reflecting the community we serve and we welcome applications from all under-represented groups. We are currently under-represented in leadership positions by staff from BAME backgrounds and we are committed to addressing this; we therefore particularly welcome applications from people from BAME backgrounds to this post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:&lt;/strong&gt; 12th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview dates:&lt;/strong&gt; 27th November and 2nd December 2020&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contact Lucy Purdy, Workforce Lead for North West Surrey Integrated Care Partnership on Lucy.Purdy@nhs.net 07917 307633.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dukes Court", "postalCode": "GU21 5BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3208", "longitude": "-.554127"}}, "title": "Band 8D System Frailty Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232295", "validThrough": "2020-11-12T23:59:59+0000"}