{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-03T09:00:46+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to join a new and motivated team on D55 based at Queens Medical Centre. This position is offered as a permanent post, however, following the closure of the ward after winter, you will be redeployed to another area. Your options around this will be discussed with you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We require enthusiastic individuals with a positive attitude and with excellent interpersonal skills to be part of our newly established team. You will be joining a diverse and motivated team that is dedicated to staff development and the delivery of high-quality patient care. The nursing staff works closely with other members of the multi-disciplinary team and are actively involved not only in delivering the treatment plan but also in the discharge processes needed to guarantee best patient experience and outcome. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a male and female Healthcare of the Elderly ward, caring after patients with complex medical and social needs. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for individuals that are enthusiastic, confident; self-motivated and possess good communication skills, enjoy a challenge and can work as part of a team. You will receive a comprehensive induction programme lead by one of our Band 6 nurses. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a management team that is both innovative and proactive in ensuring that high quality care is delivered to our patients. We are keen to encourage developments in line with Trust policy and working in new ways. We recognise responsibility to ensure that staff are developed and stimulated within their environment in order to achieve vision and deliver care that reflects the values and behaviours of the Trust. We offer excellent opportunities for career progression, training and development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your development will be tailored to your needs and career aspirations, in a supportive and welcoming environment where the team are passionate about nursing, patient care and patient experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Health care of elderly person is a large directorate encompassing 9 wards which all work together, alongside a dedicated Matron, to provide the highest standard of care to this client group. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew RileyJob titleMatronEmail addressandrew.riley@nuh.nhs.ukTelephone number87897&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC  Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253203", "validThrough": "2020-11-17T23:59:59+0000"}