{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 AfC 2020"}}, "datePosted": "2020-10-26T15:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Continuity Midwives Band 5/6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you aspire to deliver the Best Possible Maternity Care every time?&lt;/strong&gt; That’s the approach to Maternity Services at Northampton General Hospital. We are seeking enthusiastic Midwives to join our continuity teams. If you would like to work in a flexible model, where you can manage your own workload this is the job for you. Work with a caseload of just thirty six women per year, have protected days off and make a difference to the outcomes of women in your care. This is a fabulous opportunity to work across our Maternity Service to deliver high quality care to the women of Northamptonshire.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why come to Team NGH?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Maternity services include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A modern alongside three-bed Birth Centre with birthing pools and 8 postnatal beds&lt;/li&gt;\n&lt;li&gt;8 bed consultant-led Labour Ward with a birthing pool.&lt;/li&gt;\n&lt;li&gt;A dedicated Obstetric theatre with recovery&lt;/li&gt;\n&lt;li&gt;18 bed Maternity higher Observation Ward&lt;/li&gt;\n&lt;li&gt;A Bereavement Suite with garden&lt;/li&gt;\n&lt;li&gt;A Maternity Day Unit and Outpatient Clinic and Midwifery Led Sonography services&lt;/li&gt;\n&lt;li&gt;17 bedded ward for inpatient antenatal and postnatal mothers and babies&lt;/li&gt;\n&lt;li&gt;A dedicated and award winning dedicated Home Birth Team&lt;/li&gt;\n&lt;li&gt;Six bedded Transitional Care Ward to facilitate care of babies requiring Transitional care.&lt;/li&gt;\n&lt;li&gt;Continuity of carer Teams in line with Better Births 5 year Plan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;With a current delivery rate of 4700 births and ambitious plans across the Local Maternity System for transforming maternity services to be aligned with the Better Births recommendations, this is an exciting time and a great opportunity for you to come and join our forward thinking, innovative and award winning maternity team at Northampton. Just a flavor of some of the reasons you may want to come to and join Team NGH;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are forward thinking and innovative in our redesign of services for women: being nominated for a PENNA Award in 2018 for our Meet the Matron Clinic.&lt;/li&gt;\n&lt;li&gt;We have a successful Midwifery Safeguarding team winning the Nursing Times Award 2016 for Enhancing Patient dignity and a PENNA in 2016 for Improving Experiences of People with Disability. Shortlisted for Enhancing patient care Nursing Times Awards and the RCM Awards 2017 for Excellence in Maternity Care. Finalists in two categories for the 2017 PENNA for Personalisation of care and Continuity of carer.&lt;/li&gt;\n&lt;li&gt;We are passionate AND innovative in our approach in designing support and wellbeing for staff; winning the Iolanthe Midwifery Award in 2018 and having a senior full time lead for A-EQUIP.&lt;/li&gt;\n&lt;li&gt;Proactive in developing the workforce for the future, this year saw the first ever Florence Nightingale Midwifery Scholar.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We deliver some of the most highly rated maternity care experience in the UK: the CQC Maternity Experience survey showed that Northampton was performing better than most UK hospitals and in five survey questions was rated the best in the UK.&lt;/li&gt;\n&lt;li&gt;We have Full BFI accreditation. We are currently working towards a Gold Standard.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Anne Richley, Job title: Matron for Community and Outpatients Service, Email address: anne.richley@ngh.nhs.uk, Telephone number 01604 544291, Additional contact information.&lt;/p&gt;\n&lt;p&gt;For more information please contact or to arrange and Informal visit:&lt;/p&gt;\n&lt;p&gt;Hannah Billingham – PA to Senior Midwifery team – hannah.billingham@ngh.nhs.uk or 01604 545432&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital NHS Trust, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Midwife Band 5/6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243014", "validThrough": "2020-11-09T23:59:59+0000"}