{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 Per annum"}}, "datePosted": "2020-11-02T16:31:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Bedfordshire CAMHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty Doctor – Child and Adolescent Psychiatry &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Two Posts &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Each Post has 10 sessions, although we may consider less sessions for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;the right applicant.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bedfordshire CAMHS are looking for two enthusiastic, experienced and motivated Specialty Doctors in Child and Adolescent Psychiatry. These posts are divided across North Bedford Emotional &amp; Behavioural teams, Adolescent Mental Health Team, and our LAC and community clusters with a requirement to work in some of the more specialised teams as required. Please see the two attached JD’s, which will give an indication of the current intended role split across the service. The teams consist of Child and Adolescent psychiatry, Clinical Psychology, Mental Health Nursing, Art Therapy, Systemic Family Therapy, Support Workers and administrative staff who are committed to developing innovative and effective ways of working. These roles are busy, interesting, they are varied jobs regularly joint working with other members of the teams to assess and treat young people and their families with a range of mental health neurodevelopmental and intellectual difficulties. The post holders will provide high quality evidence based mental health assessments and treatments within the AMHT and EBT.&lt;/p&gt;\n&lt;p&gt;These posts will include professional and practice development to ensure high quality client-centred care. Bedfordshire CAMHS is a large multi-disciplinary CAMH service (approx. 63 wte clinical staff) with several specialist teams. There will be a requirement to participate in the duty psychiatric rota (within office hours). This post may be of particular interest to applicants wishing to pursue specialist training in child and adolescent psychiatry in the future. This is a substantive post for those who have the right experience within the NHS. We would also be interested in applicants from anywhere in the world who may which to relocate to the UK. Applicants who may not have CAMHS or NHS experience may be offered a fixed term contract for the first 12 months with a view to extending this.&lt;/p&gt;\n&lt;p&gt;In line with service developments there may be requirements to make adjustments to your job plan to include clinical work from other teams within CAMHS, providing a mixed caseload, this will be done through consultation with the lead consultant, ACD and general manager Ross Truscott. We currently have several exciting projects for more intensive support, and others focused on early intervention which you may be expected to be involved in.&lt;/p&gt;\n&lt;p&gt;East London Foundation Trust is an exciting place to work with lots of opportunity to progress. ELFT has a great deal of corporate support for quality improvement (QI) initiatives and service development. The service has a current outstanding status from the CQC and a recent peer review from the Royal College of Psychiatrists has given great feedback about the level of care that we deliver. Come and work with us in a fast paced exciting and friendly environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details or an informal conversation, please contact Dr Cathy Lavelle, Consultant Child and Adolescent Psychiatrist and Clinical Director on 01234 310670.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS BED Emotional and Behavioural Team, BEDFORD", "postalCode": "MK40 3JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1388", "longitude": "-.462907"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252870", "validThrough": "2020-11-16T23:59:59+0000"}