{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39691", "minValue": "32331", "unitText": "YEAR", "value": "£32,331 - £39,691 (dependant on experience)"}}, "datePosted": "2020-11-04T16:30:33+0000", "description": "&lt;p&gt;Public Health England is a world leading public health institution and we are looking for looking for a motivated, experienced and knowledgeable content designer (editor). We are looking for someone keen to influence change and support subject matter experts with content ownership, understanding user needs and writing for the web.&lt;/p&gt;\n&lt;p&gt;If you are a self-starter with first-rate written and verbal communications skills then we would love to hear from you. We are looking for an enthusiastic public sector professional with content publishing experience to join our publishing team, with a focus on working with subject matter experts to maintain existing content using evidence including page statistics and user feedback, you will work closely with the other members of the content team to plan, prioritise and develop content.&lt;/p&gt;\n&lt;p&gt;Job Profile:&lt;/p&gt;\n&lt;p&gt;Working with other content editors, you will produce first-rate results, working efficiently and following best practice, to ensure the digital products we develop meet the quality and standards expected by our stakeholders.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our busy publishing team, based at Waterloo or at home, developing and maintaining mutually beneficial working relationships both internally within PHE and externally with stakeholders and the media. Your remit will include some of PHE’s busiest areas including the current COVID-19 incident, and will also assist with the out of hours on call rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mark Dartford Job title Publications Gateway Manager Email address mark.dartford@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PHE Colindale, London", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Content Designer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256653", "validThrough": "2020-11-18T23:59:59+0000"}