{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 per annum inc"}}, "datePosted": "2020-10-28T12:16:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of Communications and Engagement, Whipps Cross Redevelopment Programme &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, strategic and talented individual to become the Head of Communications and Engagement, for the hugely exciting Whipps Cross Redevelopment Programme. You will lead a system-wide communications and engagement strategy for this high-profile project.&lt;/p&gt;\n&lt;p&gt;Barts Health NHS Trust is working with local partners to develop plans for a new hospital as part of a wider redevelopment of the Whipps Cross site. It offers a historic opportunity to redevelop an ageing and sprawling estate with a brand new hospital, much needed new homes as well as the potential for other health and care services and community facilities.&lt;/p&gt;\n&lt;p&gt;The postholder will work collaboratively with the redevelopment programme team, staff across Barts Health NHS Trust, local health and social care partners and a range of stakeholders including patients and the public. The aim will be to take a joined-up approach that generates and harnesses support across the health and care system for the redevelopment and associated business case. This will include engaging pro-actively with a wide range of local stakeholders on an ongoing basis; planning and delivering public events to raise awareness and understanding of the programme as well as a wider programme of community engagement with residents, patients, carers and others.&lt;/p&gt;\n&lt;p&gt;The postholder will work with wider Barts Health NHS Trust Communication colleagues in the discharge of their responsibilities, ensuring that redevelopment communications are an integral part of Trust and relevant partner organisational communications.&lt;/p&gt;\n&lt;p&gt;Band: 8B&lt;/p&gt;\n&lt;p&gt;Interviews: 20th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simon Dawes, Redevelopment Manager&lt;/p&gt;\n&lt;p&gt;Email address: dawes.simon@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross Hospital, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Head of Communications &amp; Engagement - Whipps Cross Redevelopment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246527", "validThrough": "2020-11-11T23:59:59+0000"}