{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-26T16:00:23+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s so different about this role? Looking for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in working in a new lower limb service driving a new pathway forward?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a motivated, enthusiastic registered nurse to help implement a new lower limb pathway for patients who have signs and symptoms of lower limb disease across North East Essex. The aim of this service is to prevent the condition from getting worse and improve quality of life. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will involve working in community leg ulcer clinics/ leg clubs, patients own homes and primary and secondary care. Triage skills are essential to the role alongside excellent communication and leadership skills, to be able to support and manage the patients who are referred into the service.  &lt;/p&gt;\n&lt;p&gt;Do you want to join a team leading the way in the management of lower limb disease and delivering best practice and promoting self-care/ supportive self-care from the outset?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will require a mminimum of 2 years post registration in nursing, hold a broad range of clinical skills and experience in working with other agencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A positive ‘can do’ attitude is essential along with the ability to demonstrate leadership, interpersonal and communication skills. Also you will be required to demonstrate efficient ways of working to manage lower limb disease.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post requires flexibility to be able to cover 7 days a week.  Shift working will be required to cover a 24 hour service (as and when required). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A full UK driving licence and access to a vehicle is essential in order to travel to clinics.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have the knowledge, experience and passion to improve the management of lower limb disease we would like to hear from you. This role could be right for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in this role and would like to know more please Louise Bolton on 07983544451 (louise.pingram@acecic.nhs.uk)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions,    cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;ACE is commissioned to provide a number of services including Community based health services (Care Closer to Home). We have been advised by North East Essex Clinical Commissioning Group that this contract will be provided by another organisation after 30th June 2021. This is not as a reflection of ACE but due to the Commissioner wanting to make changes to the way the service is delivered. At the present time we don’t know who the new provider will be but the CCG is working to determine this by the end of 2020. This change does not affect our ability to recruit and should you be employed at the end of June 2021 you will transfer to the new provider on the same terms and conditions.&lt;/p&gt;\n&lt;p&gt;Working for ACE puts you right at the heart of all North Essex has to offer. If you are looking to re-locate to the area then we may be able to help with your moving costs. Further information can be found in the Relocation policy. &lt;/p&gt;\n&lt;p&gt;Within Tendring you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK!  Within a stone’s throw of Tendring is Colchester – Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after locations. In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester or Tendring", "postalCode": "CO4 9YQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9237", "longitude": ".921483"}}, "title": "Tissue Viability Senior Nurse, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243263", "validThrough": "2020-11-08T23:59:59+0000"}