{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-20T20:40:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Come and work with us on the edge of Exmoor and close to North Devon’s outstanding beaches.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced, enthusiastic and passionate occupational therapist looking for an opportunity to work with a team of community based occupational therapists, physiotherapists, assistant practitioners and therapy support workers within a multidisciplinary health and social care team?&lt;/p&gt;\n&lt;p&gt;We have the exciting opportunity to appoint a B6 Specialist Occupational Therapist to join our enthusiastic community based therapy team in South Molton. The post is full time and we will consider job share and part time applicants. We will consider applicants for an integrated health and social care post (minimum 30 hours) as well as for a dedicated health post.&lt;/p&gt;\n&lt;p&gt;Northern Devon NHS Trust is almost unique in England as it delivers a range of acute, community and social care services. The community therapy team work with people with a wide range of disabilities and acute or long term conditions striving to deliver excellent patient centred care. Our work is consistently varied and stimulating covering admission prevention and supporting discharge, rehabilitation and habilitation in a range of community settings through medical, social and public health approaches.&lt;/p&gt;\n&lt;p&gt;If you would like to work in a post with a remit to ensure delivery of high quality patient centred care measured by clinical effectiveness, patient safety and patient experience we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For more information please contact Nancy Rollinson Therapy Team Lead on 01769 575959 or 07552254679.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**As this post is in a shortage occupation code it qualifies for the Trust’s Recommend a Friend Scheme, please find further information on the attached link**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Molton", "postalCode": "EX36 4DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0171", "longitude": "-3.83926"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235477", "validThrough": "2020-11-09T23:59:59+0000"}