{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/pro rata"}}, "datePosted": "2020-10-30T15:45:52+0000", "description": "&lt;p&gt;Are you a student nurse finalist who will qualify in 2020/21?&lt;/p&gt;\n&lt;p&gt;Would you like to start your nursing career in a supportive environment?&lt;/p&gt;\n&lt;p&gt;We would like to help you find the perfect first registered nurse role. Apply online to meet our teams and find out more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Founded in 1897, Kettering General Hospital (KGH) covers a large part of the Northamptonshire area. With outpatient clinics in Corby, Wellingborough and Rushden as well as Kettering General itself, the trust has 600 beds and 17 theatres, and employs more than 3,800 people. In joining an organisation that provides many specialist services and always gives excellent care- you will have an opportunity to learn, grow and flourish in a supportive and innovative environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a newly qualified nurse at KGH we can offer you development and have different and diverse areas that you could work in to launch your career and gain your first experience in nursing. We will help you develop your skills, knowledge and professional confidence. We offer a 12 month Preceptorship programme to support your transition from student to competent practitioner. You will attend 5 well-structured study days, each with a different theme and delivered via workshops and action learning sets&lt;/p&gt;\n&lt;p&gt;From day one you would be placed within one of our dynamic and supportive teams and allocated a preceptor who will have relevant experience in your chosen clinical area. They will guide and support your development in practice and review this at regular intervals and you will also receive additional support via the trust practice development team.&lt;/p&gt;\n&lt;p&gt;We would ensure you had the opportunity to put your skills into practice and be fully supported through your 12 month preceptorship programme. We pride ourselves in providing a supportive environment for our newly qualified staff nurses and you will soon feel part of a team and organisation that cares about you and your future nursing career.&lt;/p&gt;\n&lt;p&gt;KGH offers a comprehensive Trust induction programme during your first week and an excellent staff nurse development programme ran by our trust learning and development team. We can provide on-going learning and development opportunities including both leadership courses and clinical skills. KGH also operates an internal transfer process scheme allowing you to move around the organisation to develop your nursing career and gain further skills and experience.&lt;/p&gt;\n&lt;p&gt;We also provide the opportunity to work as a Band 4 Pre-Registration Nurse until your NMC PIN is received.&lt;/p&gt;\n&lt;p&gt;Please state in your supporting statement 3 areas/wards you would like your application to be considered for.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal discussion regarding the KGH Preceptorship Programme please contact Carly Walden on 01536 493307&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Newly Qualified Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250806", "validThrough": "2020-11-13T23:59:59+0000"}