{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35128", "minValue": "35128", "unitText": "YEAR", "value": "35,128"}}, "datePosted": "2020-11-03T11:29:23+0000", "description": "&lt;p&gt;Due to continued expansion of our company, an exciting opportunity has arisen for Senior Musculoskeletal Physiotherapists in the Suffolk area who is keen develop their career in musculoskeletal physiotherapy and First Contact Physiotherapy in the West of the county . We are looking for permanent, part time/full time staff.&lt;/p&gt;\n&lt;p&gt;The role will involve 2.5 days of FCP work within our G.P surgeries at Band 7 pay and 2.5 days working as part of our core musculoskletal service at Band 6 pay.&lt;/p&gt;\n&lt;p&gt;Why Should you apply?&lt;/p&gt;\n&lt;p&gt;• Varied caseload with patients from both primary care and secondary care&lt;/p&gt;\n&lt;p&gt;• Develop clinical reasoning skills with our triage team for both online self-referral and single point of access patients.&lt;br /&gt; &lt;br /&gt;• Opportunities to assist with student education, from lecturing to supervising student on clinical placement.&lt;/p&gt;\n&lt;p&gt;• Structured and advanced in-service training program.&lt;/p&gt;\n&lt;p&gt;• Regular formal/Informal supervision to monitor and help you achieve your goals and aspirations within Physiotherapy.&lt;/p&gt;\n&lt;p&gt;• We run a ‘Clinical Monthly’ (monthly education and research review), journal club and daily problem solving sessions with clinical lead physiotherapists and spinal ESP’s to name just a few.&lt;/p&gt;\n&lt;p&gt;• Opportunities for further education with regional Universities including UEA, Essex and Hertfordshire.&lt;/p&gt;\n&lt;p&gt;• Regular and often prestigious courses run by world leading professionals are commissioned by AHP Suffolk for our staff to attend.&lt;/p&gt;\n&lt;p&gt;FCP Physiotherapist Responsibilities:&lt;/p&gt;\n&lt;p&gt;1. Takes professional responsibility as a first-contact physiotherapist, with high-level decision-making and clinical-reasoning skills to assess, diagnose and triage of patients.&lt;/p&gt;\n&lt;p&gt;2. Assessing patients with potentially complex needs in 20mins appointments (including patients with long-term conditions, co-morbidities and multi-factorial needs.)&lt;/p&gt;\n&lt;p&gt;3. Accountable for decisions and actions via HCPC registration, supported by a professional culture of peer networking/review and engagement in evidence-based practice.&lt;/p&gt;\n&lt;p&gt;4. Streamlines pathway of care by providing a responsive service so that patients receive timely access to care.&lt;/p&gt;\n&lt;p&gt;5. Ensures care is proactive, preventive in focus and population based, with an emphasis on early intervention.&lt;/p&gt;\n&lt;p&gt;6. Provides care which is tailored to the individual needs. This would include, appraising the impact of individuals&#39; clinical status on their general health, well-being, employment status (including in relation to function, physical activity, mobility and independence.&lt;/p&gt;\n&lt;p&gt;7. Supports patients to set their own goals and be confident in their approach to self-management.&lt;/p&gt;\n&lt;p&gt;8. Communicates effectively and appropriately with patients and carers complex and sensitive information regarding diagnosis, pathology and prognosis.&lt;/p&gt;\n&lt;p&gt;9. Provides learning opportunities for the whole multi professional team within primary care (including non-clinical practice staff, for example reception staff and care navigators.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;10. Works with MDT to develop more effective and streamlined clinical pathways and services.&lt;/p&gt;\n&lt;p&gt;11. Exercises professional judgement, making, justifying and taking responsibility for decisions in unpredictable situations, including in the context of incomplete/contradictory information.&lt;/p&gt;\n&lt;p&gt;12. Manages interactions in complex situations, including with individuals with particular psychosocial and mental health needs and with colleagues across the primary care team, sectors and settings.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Msk Physiotherapist Responsibilities:&lt;/p&gt;\n&lt;p&gt;To assess and treat patients with a wide range of conditions, who may have complex and/or chronic presentation, to determine clinical diagnosis and plan, develop, implement and evaluate physiotherapy programmes and management plans.&lt;br /&gt;.&lt;br /&gt;• To provide Physiotherapy Assessment and treatment in Clinics, Health Centres, GP surgeries and community hospitals as part of our core physiotherapy team.&lt;/p&gt;\n&lt;p&gt;• To work and maintain records as an autonomous practitioner&lt;/p&gt;\n&lt;p&gt;• To provide specialist Therapeutic input into planning, development and evaluation of clinical services, with responsibility for defined projects.&lt;/p&gt;\n&lt;p&gt;• To provide clinical and supervisory leadership to junior staff and students within the team, including case load allocation, appraisal and managerial supervision&lt;/p&gt;\n&lt;p&gt;• To coach and develop all members of the team using recognised management and training tools and techniques, including the AHP Learning Knowledge and Skills Framework and Personal Development Reviews, to achieve corporate and team objectives&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Allied Health Professionals (AHP) Suffolk CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126114"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Suffolk", "postalCode": "IP32 7EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2379", "longitude": ".749937"}}, "title": "FCP Physiotherapist (B7) / MSK Physiotherapist (B6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253711", "validThrough": "2020-11-17T23:59:59+0000"}