{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30695", "minValue": "30695", "unitText": "YEAR", "value": "£18.26 ph + £350 Bonus"}}, "datePosted": "2020-10-30T11:06:47+0000", "description": "&lt;p&gt;Are you a Registered Staff Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be?&lt;/p&gt;\n&lt;p&gt;As an experienced Nursefrom the NHS or private care, you&#39;ll join the team as a Bank Staff Nurse where you&#39;llreceiveyour perfect work/lifebalance, 12.07% hourly pay upliftandwill receive a £350 welcome bonus once you have completed ten shifts over two months.&lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a qualified RMN or RNLDnurse you will ensure our male and female patients with mental health conditions receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Things that you will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;A high level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;A positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;A commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you flexible working - you will work 12.5 hour days, on a 0 hour contract. &lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;:Thornford Park, Crookham Hill,Thatcham, Berkshire,RG19 8ET&lt;/p&gt;\n&lt;p&gt;You will be working at Thornford Park, a 130 bedded independent hospital which supports service users that require medium and low secure Forensic Mental Health Services. In addition to these services there is also a PICU Mental Health Service.&lt;/p&gt;\n&lt;p&gt;The service provides a seamless internal care pathway supporting and empowering people in their recovery and rehabilitation.&lt;/p&gt;\n&lt;p&gt;Working alongside the multidisciplinary team, you will provide personalised assessment and treatment programmes for males with mental illness/complex care needs as well as those with personality disorder, and females and males in a PICU service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hourly rate of up to£18.26 (including the 12.07% holiday allowance uplift)&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Mandatory training&lt;/li&gt;\n&lt;li&gt;Wellbeing support and Activities&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Pension&lt;/li&gt;\n&lt;li&gt;Transfer to perm in the future (optional)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;* In order to qualify for the welcome bonus you must work a minimum of 5 shifts per month, for your first 2 months at Thornford Park(a minimum of 10 shifts in total over the 2 month period).&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thatcham", "postalCode": "RG19 8ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.381", "longitude": "-1.24972"}}, "title": "Bank staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249875", "validThrough": "2020-12-31T23:59:59+0000"}