{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T14:00:54+0000", "description": "&lt;p&gt;An exciting new opportunity has arisen for an experienced Manager to lead our new HPFT CAMHS Front Door Service. You will be the lead for triaging CAMHS referrals and where appropriate you will also offer a range of short term mental health interventions to support young people and families to access a timely and appropriate service. It is essential you hold a relevant clinical qualification and have previous experience of working in a specialist CAMHS team. In addition you will ideally also have experience of working in a referral, triage or brief intervention setting with the ability to process high volumes of referrals.&lt;/p&gt;\n&lt;p&gt;We are looking for a talented and experienced CAMHS professional to lead and establish this new team. It is a great opportunity to join a well established and highly respected CAMHS Service. You will be joining an &quot;Outstanding&quot; CQC rated service and organisation which offers excellent training and development opportunities and welcomes innovation and forward thinking.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the delivery of a high quality and responsive CAMHS service and for implementing and reviewing systems, policies, standards and procedures within frameworks agreed by the Trust, partner agencies and Commissioners.&lt;br /&gt;&lt;br /&gt;The role will provide a genuine opportunity for you to further develop your existing management skills and make a difference to the service we provide. We are looking for someone who has a real passion for working with children and young people and who wants to make a difference. We are looking to appoint a driven, enthusiastic and forward thinking manager who can lead by example and truly engage both colleagues and service users. &lt;br /&gt;&lt;br /&gt;You’ll have substantial management experience within the NHS, and significant experience of working with clinicians and leading multi-disciplinary teams to achieve service improvement. It will be a challenging role but rewarding and we believe it will provide a talented and ambitious manager with real scope to develop and influence practice.&lt;br /&gt;&lt;br /&gt;If you think you meet our needs we would welcome an application from you.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMel WoodcockJob titleSenior Service Line LeadEmail addressm.woodcock@nhs.netTelephone number01923 633402Additional contact information&lt;/p&gt;\n&lt;p&gt;Melanie Woodcock, Senior Service Line Lead Telephone: 01923 633 402 or 07557 865268 or Nikki Richards, Service Line Lead on 01923 633 402 or 07901 118431&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "99 Waverley Road, St Albans", "postalCode": "AL3 5TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7621", "longitude": "-.345255"}}, "title": "CAMHS Community Manager - (Front Door &amp; Brief Intervention)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250461", "validThrough": "2020-11-15T23:59:59+0000"}