{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T09:23:39+0000", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for a suitably qualified, HCPC registered candidate to join the Royal Devon and Exeter NHS Foundation Trust Team as a biomedical scientist, working in Haematology/Blood Transfusion/Immunology. Applications from candidates currently working towards the HCPC registration portfolio may be considered for those expected to complete the portfolio within 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be part of a friendly and enthusiastic team and will be involved in assisting the senior biomedical scientists in all aspects of service provision, being fully supported by the blood sciences management team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department is UKAS accreditation and has MHRA compliance for blood transfusion. In addition there is excellent equipment, comprising of XN9100 automated haematology system (Sysmex) including slide-maker-stainer and digital morphology components; 2 Werfen TOP 550 coagulometers; Phadia 250 allergy analyser; IL Quantalyser; FACS Calibur flow cytometer, Sebia capillary zone electrophoresis; while the Blood Transfusion Unit has two Immucor NEO analysers and electronic blood tracking (Haemonetics). The laboratory LIMs are interfaced with an electronic patient record system (EPIC).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Supplementary to the high volume work analysed on these analysers, the department undertakes a large range of manual and semi-automated specialised tests; including ELISA assays, fluorescent microscopy, protein analysis and haemostasis investigations. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate must be prepared to participate in the departments’ EWTD compliant working pattern which provides 24 hour cover 365 days of the year.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be expected to participate in the 24/7 shift system under AfC terms and conditions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257040", "validThrough": "2020-11-19T23:59:59+0000"}