{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42492", "minValue": "35020", "unitText": "YEAR", "value": "£35,020 - £42,492"}}, "datePosted": "2020-10-16T06:08:40+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for an E Grade Theatre Practitioner (Scrub Nurse) to join our Theatres team, based at The London Clinic main hospital site in London (W1G 6BW).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest hospitals, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres,including a Hybrid theatre and two minimally invasive and day surgery theatres. Specialist areas include, General surgery; ENT; Gynaecology; Hepatobiliary; Neuro-spinal; Ophthalmic; Orthopaedic; Plastic and reconstructive; Robotic; Urology; Vascular &amp; Weight loss surgery (bariatric surgery).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As a Theatre Practitioner you will support in the management &amp; organisation of care provision within the operating department, responsible for the delivery of the highest standards of care &amp; services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type: This is a full-time permanent position working 37.5 hours per week. We operate a mixed shift pattern - Earlies / Lates including Weekends &amp; On-call rota.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Salary:The attractive salary for this role is £35,020 - £42,492 &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;strong&gt;(inclusive of London Weighting), and will be dependent upon skills and experience.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package:We offer a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Duties &amp; Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake all activities in a professional and proficient manner, including mandatory surgical checks prior to the start of the procedure, during and pre wound closure.&lt;/li&gt;\n&lt;li&gt;Carry out scrub duties according to policies and procedures,contributing to quality improvement, and promotingbest evidence based practice.&lt;/li&gt;\n&lt;li&gt;Assemble, check, prepare, and coordinate the use of surgical equipment, drugs and consumables for a wide range of operative procedures.&lt;/li&gt;\n&lt;li&gt;Act in the circulating role, and assist in the safe transfer and positioning of the patient.&lt;/li&gt;\n&lt;li&gt;Promote a patient focused approach to care in collaboration with all relevant healthcare professionals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp;Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Practitioner with NMC or HCPC registration.&lt;/li&gt;\n&lt;li&gt;Proven experience in an operating theatre environment with relevant experience in scrub procedures.&lt;/li&gt;\n&lt;li&gt;General scrub &amp; circulating skills, with experience of applying clinical reasoning skills across a varied patient case mix.&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills with the ability to work in sensitive and challenging situations.&lt;/li&gt;\n&lt;li&gt;Highly motivated individual who has a friendly disposition, and the ability to work as part of a team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;The London Clinic is one of the UK’s largest independently owned non-profit hospital, where we pride ourselves on our values, and putting the patient at the heart of everything we do.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Scrub Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229280", "validThrough": "2020-11-30T23:59:59+0000"}