{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17885", "minValue": "17885", "unitText": "YEAR", "value": "10.64"}}, "datePosted": "2020-10-19T15:11:39+0100", "description": "&lt;p&gt;We are seeking to recruit experienced Bank Healthcare Assistants to join a Covid-19 Swabbing team located at Queen Alexandra Hospital in Portsmouth. The Covid Testing department is a newly established team within the Trust delivering testing for staff and patients across the healthcare system.&lt;/p&gt;\n&lt;p&gt;The Health Care Assistant will function as part of the Covid testing team taking samples for testing from both staff and patients. The post holder will primarily be taking swab samples for Covid testing at the drive-through, working under the direction of a RGN team leader.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced Healthcare Assistants with recent NHS experience.&lt;/p&gt;\n&lt;p&gt;Our Bank HCAs are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A flexible working pattern to suit you&lt;/li&gt;\n&lt;li&gt;Competitive pay rates and weekly pay&lt;/li&gt;\n&lt;li&gt;Priority of shifts over agency workers&lt;/li&gt;\n&lt;li&gt;An online self-booking system and dedicated bookings team, accommodating your convenience and availability&lt;/li&gt;\n&lt;li&gt;Electronic Timesheet submission&lt;/li&gt;\n&lt;li&gt;Onsite office and designated Business Partners to offer daily support&lt;/li&gt;\n&lt;li&gt;A professional Nurse Recruitment Team that will ensure you are registered and compliant to work shifts as soon as possible&lt;/li&gt;\n&lt;li&gt;A dedicated compliance team that will ensure you remain compliant to work, sending out regular expiry updates&lt;/li&gt;\n&lt;li&gt;Free annual Statutory Mandatory Training updates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The days to be worked are Monday to Sunday, there will be no night shifts but long days may be required.&lt;/p&gt;\n&lt;p&gt;Your primary responsibilities will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meet and greet patients and staff that require testing, ensuring you have checked their personal details against the information provided and adhered to all trust data protection policies and procedures&lt;/li&gt;\n&lt;li&gt;Using the safety equipment and PPE provided ensure all tests are carried out effectively&lt;/li&gt;\n&lt;li&gt;Make sure test are appropriately sealed and labelled sending them in accordance to Trust guidance in a timely manner&lt;/li&gt;\n&lt;li&gt;Follow all infection control protocols ensuring the safety of yourself, colleagues and patients at all times&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for candidates who would be willing to support the testing hubs on a rota basis and who are confident to carry out the swab testing process.&lt;/p&gt;\n&lt;p&gt;Please apply directly to this advertisement by submitting your current CV, for further information on the roles please contact the Portsmouth Hospital Staff Bank Team on 0333 577 3316.&lt;/p&gt;\n&lt;p&gt;Please note due the large amount of applicants, we cannot directly contact you if your application is unsuccessful.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Bank HCA - Covid-9 Swabbing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232846", "validThrough": "2021-01-30T23:59:59+0000"}