{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum pro"}}, "datePosted": "2020-10-28T11:47:11+0000", "description": "&lt;p&gt;These days, more and more people are looking to take more control over their working lives. &lt;br /&gt;&lt;br /&gt;So if you&#39;re a qualified Nurse with acute nursing skills and a minimum of six months experience in an acute hospital or equivalent environment and you’re looking for more say in how you work, the Staff Bank at University Hospitals of Leicester NHS Trust really is the answer. &lt;br /&gt;&lt;br /&gt;As a Bank Staff Nurse here at University Hospitals of Leicester, it’s you who’s in control over when and where you work. Whatever your circumstances dictate – days, nights or weekends - you can work around them.&lt;/p&gt;\n&lt;p&gt;We’ve got three great sites for you to choose from – Leicester Royal Infirmary, Glenfield Hospital and Leicester General Hospital – whichever suits you best. Lots of flexibility, lots of choice with clinical specialties including Intensive care, renal, cardiology, emergency nursing, end of life care, general medicine and surgery.&lt;/p&gt;\n&lt;p&gt;We also have varied opportunities available, working within Outpatients, Theatres, Day Surgery Wards and Endoscopy.&lt;/p&gt;\n&lt;p&gt;We have the following departments:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Six Outpatients Departments with wide range of specialty including. Ophthalmology, Orthopaedics, Paediatrics, Respiratory, Cardiology, Gastroenterology, Rheumatology, Urology and ENT. (Sites: Loughborough, Hinckley, Melton Mowbray, Coalville, and Market Harborough.)&lt;/li&gt;\n&lt;li&gt;Four expanding Endoscopy Units which are JAG accredited, we can offer you the opportunity to develop your skills to participate in all areas of Endoscopy. (Sites: Loughborough, Hinckley, Melton Mowbray, and Market Harborough.)&lt;/li&gt;\n&lt;li&gt;Three Day Surgery Units, specialty including: General Surgery, Ophthalmology, Urology, Podiatry, and Oculoplastic. (sites: Loughborough, Hinckley and Melton Mowbray)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have access to education teams who will be able to advise you on your learning needs, support your development and we also offer a range of benefits such as pension, weekly pay, annual leave payment depending on how much you work, electronic rostering and timesheets.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Staff Bank Recruitment team on 01162 587700 (option 1) for more information about the posts&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHL, Leicester", "postalCode": "LE5 4QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6306", "longitude": "-1.08552"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246426", "validThrough": "2020-11-24T23:59:59+0000"}