{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc hcas"}}, "datePosted": "2020-10-13T17:00:53+0100", "description": "&lt;p&gt;The National Institute for Health Research (NIHR) is a large, multi-faceted and nationally distributed organisation funded through the Department of Health and Social Care. NIHR is the research arm of the NHS. Together, NIHR people, facilities and systems represent the most integrated clinical research system in the world, driving research from bench to bedside for the benefit of patients and the economy. The Royal Marsden Hospital together with its academic partner The Institute of Cancer Research form the only specialist cancer NIHR Biomedical Research Centre (BRC).&lt;/p&gt;\n&lt;p&gt;The BRC on behalf of NIHR is looking to appoint a Translational Research Oncology Collaboration Operations Manager to play a significant role in the set up and delivery of the Oncology Translational Research Collaboration (O-TRC) aiming to bring together internationally recognised investigators across ten NIHR BRCs to carry out collaborative cancer research at a scale not achievable at individual centres. The post will work closely with the Collaboration’s Chair, based at the Royal Marsden and the NIHR Office for Clinical Research Infrastructure (NOCRI) based in Twickenham.&lt;/p&gt;\n&lt;p&gt;The post-holder will be a senior Programme Manager who will ensure effective liaison between the UK-wide stakeholders. They will play a significant role in the set up and delivery of the NIHR O-TRC and will provide the operational and project management of the TRC activities, manage collaborations and relationships between the participating members and external partners and stakeholders, including industry. The post-holder will support the Chair of the O-TRC having responsibility for the day-to-day operational management of the collaboration, being the first point of contact for related activities and lead the development, setup and implementation of identified projects and workstreams. The post-holder will work closely with NOCRI, the Academic and Operational Leads, the workstreams’ steering groups members and reporting to the Collaboration’s Chair.&lt;/p&gt;\n&lt;p&gt;The post will be based at the NOCRI Twickenham office to interface with the NOCRI team who will support the Collaboration Operations Manager in an advisory capacity and at The Royal Marsden site in Sutton, the coordinating centre of the NIHR O-TRC, who will employ the successful candidate. Working with NOCRI, the post-holder will be part of a wider team of Collaboration Managers working across various NIHR TRCs. The Collaboration Operations Manager will work across multiple sites, requiring frequent travel and remote working using both face-to-face and virtual meetings, at relevant centres in the UK.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a biomedical science degree or equivalent expertise gained through previous employment in the life sciences sector and be a self-motivated individual with ability to demonstrate exceptional communication and relationship building skills. They will have significant experience of operational management across complex organisations and be able to build working relationships across a wide geographical spread.&lt;/p&gt;\n&lt;p&gt;This position is full-time, funded until 31st March 2022 in the first instance with the possibility of extension.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professor Stan Kaye, Professor of Medical Oncology, Stan.Kaye@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Marsden Sutton Hospital, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Oncology Translational Research Collaboration Operations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225127", "validThrough": "2020-11-08T23:59:59+0000"}