{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 / £26,970 / £27,416 / £30,615"}}, "datePosted": "2020-10-08T09:47:16+0100", "description": "&lt;p&gt;Not all Hero’s wear capes. Now more than ever, being a #NHSHero is something to be proud about. An exciting opportunity has arisen for permanent Band 5 RMNs to join The Urgent Care and Access Pathway. The posts are open to qualified Mental Health Nurses, Occupational Therapists and Social workers that have experience and knowledge of caring for people with an acute mental illness.&lt;/p&gt;\n&lt;p&gt;The role will involve dealing with and supporting highly distressed individuals. All referrals will be coming through via A&amp;E department to the Mental Health Triage Team (MHTT) and through The Central Access Point (CAP) where they will be triaged. Following triage these may move through the access pathway which will also involve the Mental Health Urgent Care Hub (MHUCH) and the Crisis Resolution and Home treatment Team (CRHT) depending on the outcome of the triage assessment.&lt;/p&gt;\n&lt;p&gt;The Key skills required for this role will be the ability to demonstrate excellent on-going assessment, risk assessment and problem solving skills. The successful candidates will demonstrate the ability to work independently, also demonstrate flexibility in the way they work and able to take on different roles within the pathway&lt;/p&gt;\n&lt;p&gt;This service will operate 365 days a year over a 24 hour rotation providing cover day and night. Part of the role staff will be expected to work shift patterns which include regular nights.&lt;/p&gt;\n&lt;p&gt;For further information please contact Romeo Chipangura (romeo.chipangura@leicspart.nhs.uk) phone 0116 225 6847,Hlanga Ngwenya (Sihlanganisiwe.ngwenya@leicspart.nhs.uk ) phone 07766 98522,Catherine Bowker Catherine.bowker@leicspart.nhs.uk phone: 0116 225 6854&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester, Leicestershire", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 5 Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217728", "validThrough": "2020-11-08T23:59:59+0000"}