{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21415", "minValue": "21415", "unitText": "YEAR", "value": "£12.74"}}, "datePosted": "2020-10-21T11:46:48+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that is friendly and supportive? If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;NHS Professionals manages the&lt;strong&gt;temporary&lt;/strong&gt;work placement (bank) at Wirral University Teaching Hospital NHS Foundation Trust and we are looking for a Buyer to support the Finance and Procurement department.&lt;/p&gt;\n&lt;p&gt;Wirral University Teaching Hospital NHS Foundation Trust is the thriving heart of the local community. Comprising Wirral’s only Emergency Department, it is one of the biggest and busiest acute NHS trusts in the North West. Providing a comprehensive range of high-quality acute care services, serving a population of about 400,000 people across Wirral, Ellesmere Port, Neston, North Wales and the wider North West footprint. Based in 4 locations Arrowe Park Hospital, Clatterbridge Hospital, and Wirral Women and Children&#39;s Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;J&lt;/strong&gt;&lt;strong&gt;ob Title and Grade&lt;/strong&gt;: Buyer (Band 5)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Willow House, Clatterbridge Hospital, CH63 4JY&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt;Finance and Procurement.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay rate&lt;/strong&gt;: £12.74 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration:&lt;/strong&gt;19/10/2020 to 31/03/2021&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of Work&lt;/strong&gt;: Full Time, 37.5hours/week, Monday-Friday, 08.30am -16.30pm&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide dedicated support to the Trust Procurement Team in the identification of initiatives and the delivery of Divisional Procurement Workplans /CIP Plans.&lt;/li&gt;\n&lt;li&gt;Undertake and deliver an agreed portfolio of purchasing projects in achievement of contract coverage and the annual savings target.&lt;/li&gt;\n&lt;li&gt;Responsibility for self- management of performance for projects against their agreed deliverables.&lt;/li&gt;\n&lt;li&gt;Lead and manage tendering exercises (EU, local tenders, RFQ’s and mini competitions) for a range of goods and services.&lt;/li&gt;\n&lt;li&gt;Re-Negotiation of contracts.&lt;/li&gt;\n&lt;li&gt;Lead negotiations with strategic suppliers in terms of contract performance management, price negotiation and business continuity.&lt;/li&gt;\n&lt;li&gt;To build long term strategic relationships with internal stakeholders and suppliers&lt;/li&gt;\n&lt;li&gt;To carry out supplier performance reviews/appraisals in line with contract monitoring/management&lt;/li&gt;\n&lt;li&gt;To write procurement reports for stakeholders at various levels (including Committee and Board reports).&lt;/li&gt;\n&lt;li&gt;To provide procurement support to the Divisional Procurement Managers on high value and complex procurement projects.&lt;/li&gt;\n&lt;li&gt;To deputise for the Senior Procurement Manager.&lt;/li&gt;\n&lt;li&gt;To liaise with Trust Managers, finance, clinical, nursing, technical and administration staff to advise them on the most appropriate supply routes, and on EU, national and local procurement framework and procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience/skills &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Must be a CIPS Qualified Buyer at level 5 or 6(not studying)&lt;/li&gt;\n&lt;li&gt;Experience of managing procurement in a public sector setting&lt;/li&gt;\n&lt;li&gt;Experience of managing procurement and tendering activity from end to end.&lt;/li&gt;\n&lt;li&gt;Full understanding and working knowledge of EU Public Procurement Directive and other legislative and policy governing NHS procurement and the practical application of these to procurement exercises.&lt;/li&gt;\n&lt;li&gt;Experience of running OJEU compliant procurement exercises is desirable&lt;/li&gt;\n&lt;li&gt;Experience of managing tenders for capital equipment (not necessarily medical equipment and devices although that is desirable)&lt;/li&gt;\n&lt;li&gt;Experience of managing equipment maintenance programme for a large fleet and obtaining quotes for maintenance contracts.&lt;/li&gt;\n&lt;li&gt;Able to analyse and interpret procurement data from multiple sources and produce reports that assist procurement decision makers&lt;/li&gt;\n&lt;li&gt;Must be able to work flexibly- picking up ad hoc projects as well as managing a portfolio of schemes as defined in the annual workplan&lt;/li&gt;\n&lt;li&gt;Knowledge of NHS Supply Chain category towers and how they operate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They are looking for someone who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong influencing and negotiating skills, a good builder of productive relationships to gain support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent communications and interpersonal skills; articulate and robust in presenting ideas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work this week, get paid next - Get paid the following Friday when you release your timesheets by 23:59 on Sunday.&lt;/li&gt;\n&lt;li&gt;Get paid to take holiday! - Holiday is accrued during every shift you work.&lt;/li&gt;\n&lt;li&gt;Statutory maternity/paternity (subject to qualifying criteria)&lt;/li&gt;\n&lt;li&gt;Access to our very own pension scheme called &#39;NHSP Stakeholder pension&#39; for eligible members&lt;/li&gt;\n&lt;li&gt;Free training and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;...and we are part of the NHS family!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Buyer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236198", "validThrough": "2020-11-21T23:59:59+0000"}