{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T10:31:46+0000", "description": "&lt;p&gt;The Medical Education Department is looking to recruit a Full Time Band 4 Foundation Programme Co-ordinator based in Glangwili General Hospital, to provide management and administrative support for the Foundation Doctors, working closely with the Foundation Programme Director.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone enthusiastic, dynamic and highly motivated who can respond to and plan for change and development. Medical Education is continuously developing and evolving therefore the successful applicant will need to be flexible in their approach and enjoy new challenges.&lt;/p&gt;\n&lt;p&gt;The Post holder will also provide day to day administrative support in the running of the Medical Education Centre and report to the Medical Education Manager&lt;/p&gt;\n&lt;p&gt;You will have an out-going personality, excellent organisational and communication skills with the ability to work autonomously as well as in a team environment.&lt;/p&gt;\n&lt;p&gt;For informal discussion please contact Catrin Jarman, Acting Medical Education Manager on 01267 229756 or catrin.jarman@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mae&#39;r Adran Addysg Feddygol yn bwriadu recriwtio Cydgysylltydd Rhaglen Sylfaen Band 4 llawn-amser, wedi&#39;i leoli yn Ysbyty Cyffredinol Glangwili, i ddarparu cymorth rheoli a gweinyddol ar gyfer y Meddygon Sylfaen, ac i weithio&#39;n agos gyda Chyfarwyddwr y Rhaglen Sylfaen.&lt;/p&gt;\n&lt;p&gt;Mae hwn yn gyfle cyffrous ar gyfer rhywun brwdfrydig, dynamig a llawn cymhelliant, a all ymateb i newid a datblygiad a chynllunio ar gyfer hynny. Mae Addysg Feddygol yn datblygu ac yn esblygu&#39;n barhaus, felly bydd angen i&#39;r ymgeisydd llwyddiannus fod yn hyblyg o ran ei ymagwedd, a mwynhau heriau newydd.&lt;/p&gt;\n&lt;p&gt;Bydd deiliad y swydd hefyd yn darparu cymorth gweinyddol o ddydd i ddydd o ran rhedeg y Ganolfan Addysg Feddygol, ac yn adrodd i&#39;r Rheolwr Addysg Feddygol.&lt;/p&gt;\n&lt;p&gt;Bydd gennych bersonoliaeth allblyg, sgiliau trefnu a chyfathrebu rhagorol, ynghyd â&#39;r gallu i weithio&#39;n annibynnol yn ogystal ag mewn amgylchedd tîm.&lt;/p&gt;\n&lt;p&gt;I gael trafodaeth anffurfiol, cysylltwch â Catrin Jarman, y Rheolwr Addysg Feddygol Dros Dro ar 01267 229756 neu catrin.jarman@wales.nhs&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatrin JarmanJob titleActing Medical Education ManagerEmail addressCatrin.Jarman@wales.nhs.ukTelephone number01267 229756&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Foundation Programme Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257249", "validThrough": "2020-11-15T23:59:59+0000"}