{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-19T10:36:01+0100", "description": "&lt;p&gt;&lt;strong&gt;Cardiac Physiologist | Band 7 | Sutton | Full Time | Fully Funded Training&lt;/strong&gt; &lt;strong&gt;Programs &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire St Anthony Hospital is ooking for an experienced Cardiac Physiologist to join our Cardiology Department in Sutton and work alongside the best consultants in the region.&lt;/p&gt;\n&lt;p&gt;The hospital provides cardiac surgeries for both inpatient and outpatient procedures. In the role you will be working very closely with your team of cardiac physiologists, cardiac consultants and this will be predominantly in the outpatient department. You will contribute to the implementation of cardiac services and apply patient technology for measurement, monitoring and treatment. You will promote excellent care and always strive for quality improvement. You will provide and receive complex, sensitive or contentious information and this will develop your own knowledge and skills and those of your team. You will also acknowledge the risk of Healthcare Associated Infections (HCAI) and understand own responsibility as agreed with line manager in the prevention and control of HCAI.&lt;/p&gt;\n&lt;p&gt;Founded in 1904, Spire St Anthony&#39;s Hospital delivers care through skilled and dedicated staff working together. With a completed £27m development investment, we provide very high quality healthcare to patients around Sutton, Epsom, Surrey and South London. We have six operating theatres coving a wide range of specialities and procedure including Ortho, Gynae and Cardio. There is an ITU department providing care and accommodating more complex patients. We have a number of developmental training courses and progression opportunities available for our ambitious employees.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualified Cardiac Physiologist&lt;/li&gt;\n&lt;li&gt;Minimum of 3 years’ experience&lt;/li&gt;\n&lt;li&gt;Must have BSE Accreditation or equivalent&lt;/li&gt;\n&lt;li&gt;Minimum of 1 year Echo experience&lt;/li&gt;\n&lt;li&gt;Ability to lead &amp; assist exercise stress testing&lt;/li&gt;\n&lt;li&gt;Participation in on-call rota will be essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Elena Tsoneva on 07921 065 874 or elena.tsoneva@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheam", "postalCode": "SM3 9DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3795", "longitude": "-.220251"}}, "title": "Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231836", "validThrough": "2020-11-19T23:59:59+0000"}