{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,146 PA inc HCAS"}}, "datePosted": "2020-11-02T12:31:12+0000", "description": "&lt;p&gt;Are you a nurse looking for a supportive team and the opportunity to develop new skills? This is an exciting time to join the community nursing service in West Herts. We are developing new community pathways which will support the delivery of more care in people’s homes, and to enable us to do this we have a range of new learning and development opportunities available through the CLCH Academy.&lt;/p&gt;\n&lt;p&gt;But don’t just take our word for it, listen to what our staff have to say about their jobs.&lt;/p&gt;\n&lt;p&gt;Mande has worked in the community for 10 years. She is currently working as acting deputy locality manager for the Dacorum team. She says:&lt;/p&gt;\n&lt;p&gt;“&lt;em&gt;I have found working in the community to be an extremely rewarding job. Since joining the team, I have been able to progress from a band 5, through to a band 6 caseload manager and now a band 7 lead within the Dacorum locality.&lt;/em&gt;&lt;em&gt; No two days are the same in this job and there is plenty of opportunity to learn new skills. As an employer, CLCH really values its staff and takes the time to grow them. This is reflected in the values of our academy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Working in patients’ homes is very rewarding. It is a privilege to be invited into patients’ homes and lives to help see them through some of their most challenging times. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This is a welcoming, friendly place to work and we are a hard working team who nurture and support each other. I would encourage anyone to apply to work with us.&lt;/em&gt;”&lt;/p&gt;\n&lt;p&gt;We are looking for a nurse with a genuine interest in continuing to develop skills in this field. We have a good track record of supporting newly qualified nurses, return to practice nurses, and nurses transitioning into the community from other settings including acute care. You must be able to work flexibly according to service needs and have excellent organisational, time management and communication skills.&lt;/p&gt;\n&lt;p&gt;We are based at Hemel One, just off the M1 at Junction 7. Do get in touch if you would like to arrange an informal visit and meet the team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herts Planned Care Nursing  - Dacorum, Hertfordshire", "postalCode": "HP2 7YU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7648", "longitude": "-.430964"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252051", "validThrough": "2020-11-16T23:59:59+0000"}