{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664"}}, "datePosted": "2020-11-03T12:36:57+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking to recruit a Deputy Head of Medicines Optimisation (Strategic) to provide leadership to our medicines optimisation (MO) team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Joining us at an exciting time in the team’s development, you will play a key role in developing the MO service.As a member of the senior management team, you will use your comprehensive knowledge and experience to support the development and delivery of the Manchester MO strategy.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To succeed in the role, you will be required to work with key stakeholders in developing effective relationships, to support demonstratable improvements to medicines optimisation and clinical pharmacy delivery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Political astuteness, leadership, determination, and proven people management skills will be key to deliver improvement within a complex system.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an effective communicator you will be able to quickly build effective working relationships with a variety of internal and external stakeholders. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be joining an innovative, outcomes focused, fast paced team where opportunities exist to grow and develop your knowledge and skills. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you want to join us on our journey and are passionate about making a difference to the people of Manchester, we would like to hear from you. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion about the post, please contact Kenny Li, on 07867860787 or email Kenny.li@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you require the application in an alternative format please contact Hrtransactions.manchester@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;MHCC is committed to creating and sustaining a fully inclusive workforce culture. We support flexible working and will consider applications on a part-time or job share basis. We welcome applicants from all backgrounds and communities, and we particularly welcome applicants who are currently under represented in our workforce. This includes but is not limited to Black, Asian and Minority Ethnic (BAME) candidates and disabled candidates.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128384.jpg", "name": "NHS Manchester CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128384"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parkway Business Centre, Princess Road, Manchester", "postalCode": "M14 7LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4471", "longitude": "-2.2453"}}, "title": "Deputy Head of Medicines Optimisation - Strategic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254002", "validThrough": "2020-11-17T23:59:59+0000"}