{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata plus HCAS"}}, "datePosted": "2020-11-05T20:00:18+0000", "description": "&lt;p&gt;We are looking for experienced NHS administrator to work in the North Locality 0-19 team.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Health Visiting and School Nursing team and will preferably have experience of working in the NHS and for a variety of services and be able to articulate their administrative and personal skills that will support them in these roles.&lt;/p&gt;\n&lt;p&gt;The base for the post holder will be at Five Elms Health Centre, .&lt;/p&gt;\n&lt;p&gt;There are posts available up to 35 hours a week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement – Essex&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 5% of the basic salary&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon LabiJob titleTeam leaderEmail addresssharon.labi@nelft.nhs.ukTelephone number07507376828&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "five elms health centre, Dagenham", "postalCode": "RM9 5TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5534", "longitude": ".142321"}}, "title": "0-19 Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258792", "validThrough": "2020-11-19T23:59:59+0000"}