{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T09:45:50+0000", "description": "&lt;p&gt;&lt;strong&gt;An exc&lt;/strong&gt;&lt;strong&gt;iting opportunity to join the NHSBSA Digital team as a Solutions Designer. You will join a team &lt;/strong&gt;&lt;strong&gt;of Solutions Designers to make customer focused technical designs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Customer focused designs and developments are now a part of the day to day digital culture, practice and mission with organisations. This also has to be driven by the people whom make up the Digital team which requires a customer focused mindset to reflect this in the roles. To drive this change we introduced the role of the Solutions Designer. This has changed from looking at the underlying technology to support an application/service, to understanding what technology is required to support the end user. With micro service architectures, api integrations between services and the evolution of cloud platforms these have become the enabler that drives the applications to support the users experience.&lt;/p&gt;\n&lt;p&gt;This change into an end user centred mindset extends the scope of a Technical Architect to become a Solutions Designer and with the introduction and evolution of cloud services this reinforces this approach with applications being able to deployed on cloud based platforms that are continuously developed, tested, scalable and deployable with zero downtime or latency which provides better experiences for the end customer and confidence with the service being provided.&lt;/p&gt;\n&lt;p&gt;The Solution Designers in the NHSBSA Digital team have embraced this driver to be customer centric and following key role principles have designed award winning services that surpass the requirements of the end user:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To provide better service to connected consumers&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The main role of the Solution Designer is to improve the service the NHS provides to connected consumers. They exist to increase awareness of this group’s needs and ensure that the whole Digital directorate is seeking ways to better serve them.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To work inter-professionally&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The digital team will form a digital direction in collaboration with other departments. The solutions designer will support and drive this collaboration and work in close teams to support delivery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To set standards for the use of digital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS needs to manage digital holistically and not so much on an ad hoc basis. It needs a framework within which to operate. The Solutions Designer is required to help set these standards and draw up accompanying policies. This will ensure consistency and high quality.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To educate colleagues about the use of digital tools&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Although the formation of a Digital Team involves some centralisation, this is not a long term solution. Eventually, the entire organisation should be using digital tools as part of their everyday work. To achieve this end the Solutions Designer should have a mandate to educate colleagues about their use of digital tools.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To be open and transparent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Because collaboration is the key to success it is important that the Solutions Designer operates in an inclusive manner. This means being open and transparent in their work. They need to be promoting their work through workshops, presentations, internal blogs and newsletters.&lt;/p&gt;\n&lt;p&gt;This encourages collaboration and feedback within the Digital Team and throughout the organisation. It will also help educate colleagues about digital. This will help achieve the mandate to ensure digital becomes ubiquitous across the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To work in an agile, iterative and data driven manner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The digital landscape is constantly changing and connected consumers’ expectations are continually evolving. In such an environment the danger is that and a Solutions Designer must be aware of this forever changing landscape and adapt changes in digital to meet the needs of the end user.&lt;/p&gt;\n&lt;p&gt;For further detailscontact:&lt;/p&gt;\n&lt;p&gt;Chris Suter - chris.suter@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle or Middlebrook", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Solutions Designer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243876", "validThrough": "2020-11-10T23:59:59+0000"}