{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13535", "minValue": "13535", "unitText": "YEAR", "value": "£13,535.90"}}, "datePosted": "2020-10-23T12:15:24+0100", "description": "&lt;p&gt;Devon Referral Support Service (DRSS) are delighted to be offering an exciting opportunity to join their Windsor House office as a Business Administration Apprentice.&lt;/p&gt;\n&lt;p&gt;A Business Administration qualification opens a world of opportunity and roles to an individual undertaking it.&lt;/p&gt;\n&lt;p&gt;As part of NHS Devon Clinical Commissioning Group (Devon CCG), DRSS helps patients make informed choices regarding the next step in their healthcare journey. We are the first point of contact for patients to book their outpatient appointments at a range of locations across Devon.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is keen to learn and engage with all sectors of the business, to support the day to day function of the NHS telephone contact and referral management centre.&lt;/p&gt;\n&lt;p&gt;Most of the role will be telephone-based therefore we require a highly motivated, customer-orientated individual with excellent communication skills and a good telephone manner.&lt;/p&gt;\n&lt;p&gt;As many tasks will involve keyboard entry, accurate keyboard skills, a calm, focussed attitude and the ability to record data and information accurately, are required.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake the Advanced Apprenticeship in Business Administration supported by PGL Training Ltd. Therefore, there is a possibility that the successful candidate may be required to travel to the offices of the training provider in Exeter on occasion.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have evidence of GCSE&#39;s in Maths and English in the A*-C/Levels 9-4 range (or equivalent), however, an initial assessment with PGL interview will be undertaken to establish current level.&lt;/p&gt;\n&lt;p&gt;Applications for this apprenticeship are being processed by DRSS via NHS Jobs. Shortlisted candidates will be required to attend for an initial interview and assessment with PGL then a further CCG interview with DRSS at their office in Plymouth or over Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The PGL interviews will be held on &lt;/strong&gt;&lt;strong&gt;Tuesday&lt;/strong&gt;&lt;strong&gt; 1&lt;/strong&gt;&lt;strong&gt;7th November.&lt;/strong&gt;&lt;strong&gt; On completion of these PGL interviews, successful candidates w&lt;/strong&gt;&lt;strong&gt;ill &lt;/strong&gt;&lt;strong&gt;be emailed to attend a formal interview with DRSS on Wednesday 25th November. (Dates subject to change)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128674.jpg", "name": "NHS Devon Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128674"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 5UF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4162", "longitude": "-4.12727"}}, "title": "Apprentice Patient Choice Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240459", "validThrough": "2020-11-09T23:59:59+0000"}