{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 pa"}}, "datePosted": "2020-11-05T15:30:15+0000", "description": "&lt;p&gt;&lt;span&gt;Senior Trauma Fellow (HST/ST6+)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This 12 month post will commence: January 2021&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for the right candidate to commence the Senior Trauma Fellowship at the Leeds General Infirmary working under Professor Peter Giannoudis. Applications are welcome from all suitably qualified trainees.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will join the Trauma team at LGI under the direct supervision of Professor Giannoudis as well as our established cohort of Consultant Orthopaedic Trauma Surgeons. Our 10 Major Trauma and 14 Trauma consultants have a wealth of national and international experience.This post will help to prepare the successful candidate for their consultant post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will receive advanced clinical and surgical training in all aspects of orthopaedic trauma surgery. Leeds Major Trauma Centre is based at Leeds General Infirmary; is one of the largest MTCs in volume of cases it treats per year (over 2,000 TARN eligible cases over the last year), and top performing centres in most key performance indicators.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will provide support to the Trauma team and ensure resilience and appropriate response to complex orthopaedic trauma. You will therefore contribute to the service in its pursuit to provide the best levels of care for patients and become the best Trauma centre in the country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition, they will be expected to take part in research studies as appropriate and help with the departmental audit and database. Undergraduate and postgraduate teaching will also be required. The trauma fellow will also take and organise tertiary referrals and take a role in the delivery of the Trauma injury clinic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For Further information about this post please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Professor Peter Giannoudis on 0113 39 22750&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ben Grange; Service Manager Trauma and Related Services.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122914.jpg", "name": "Trauma and Related Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Leeds General Infirmary", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Senior Trauma Fellow (Trust Doctor)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258330", "validThrough": "2020-11-20T23:59:59+0000"}