{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888- £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-13T14:01:12+0100", "description": "&lt;p&gt;Are you a qualified ODP or Anaesthetic Nurse and would like to work in a dynamic and exhilarating environment?&lt;br /&gt;&lt;br /&gt;The Royal Free London NHS Foundation Trust is in the position to offer you a fantastic development opportunity!&lt;br /&gt;&lt;br /&gt;The Operating Theatres at The Royal Free Hampstead site is a really exciting and interesting place to work currently. It has hugely developing services like organ transplantation both liver and kidney, vascular and plastic Hub for tertiary sites and other specialties. It is also an organization that is committed to delivering excellence in patient care and values its staff and patients. In order to maintain these standards we are looking to appoint passionate, enthusiastic and motivated Band 5 practitioners/anaesthetic nurses.&lt;br /&gt;&lt;br /&gt;With the enlargement of our Trust we currently have band 5 vacancies within our anaesthetic teams. With a great senior experienced team on board we are able to offer a supportive learning and development opportunity for all staff. We welcome not only newly qualified staff but those who are looking to expand their knowledge and skills. Our facilities combined with the latest in technology and on-site support services; enable our consultants to undertake a wide range of procedures from routine investigations to complex surgery.&lt;br /&gt;&lt;br /&gt;Royal Free Hospital site: 21 operating theatres performing emergency and elective procedures for both adults and children. Surgical specialities include Hepatobiliary, Vascular, Plastics, Orthopaedics, Breast, ENT, Renal / Urology, Ophthalmic, Gynaecology, Obstetrics and Colorectal. The site is also the Vascular Hub for North Central London, a Regional Hand Trauma Centre and a Transplant Centre for Liver and Renal Transplantation.&lt;br /&gt;&lt;br /&gt;This is a big opportunity in a vibrant Trust, who is committed to staff education and development with Practice Educators available to teach on site and support is provided through mentors and a highly experienced team. &lt;br /&gt;&lt;br /&gt;Opportunities also exist to work on our other sites where we perform a range of elective surgery (Chase Farm Hospital), emergency surgery (Barnet Hospital) and day surgery (Edgware Hospital). &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;We support flexible working&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Myhrra Gazo - Team Leader - myhrra.gazo@nhs.net - 31947/46&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 ODP/Anaesthetic Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224594", "validThrough": "2020-11-08T23:59:59+0000"}