{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus HCAS"}}, "datePosted": "2020-11-03T17:16:01+0000", "description": "&lt;p&gt;Come and join the Lewisham and Greenwich NHS Trust newly integrated&lt;/p&gt;\n&lt;p&gt;Lewisham Children and Young People’s Community Nursing Service (LewCYPCNS)&lt;/p&gt;\n&lt;p&gt;The Lewisham &amp; Greenwich NHS Trust Children’s and Young People Community Services was given a rating of “outstanding” in the most recent CQC report.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated experienced Paediatric nurse to work within our friendly, forward thinking Community Children’s Nursing Service.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and enthusiastic practitioner to help support the team through a very exciting period of development and expansion. You will be a motivated and innovative nurse with extensive experience of working with children, ideally in the community setting. You will be able to demonstrate excellent team-working, assessment, communication and leadership skills.&lt;/p&gt;\n&lt;p&gt;The Service is currently developing a new model of care which has recently integrated Children’s Community nursing teams to include the Complex Needs Nursing Team, Hospital@Home (rapid response) and Community Asthma Team. This new model will incorporate developing nurse led clinics and close working with Primary care. The Service covers the borough of Lewisham.&lt;/p&gt;\n&lt;p&gt;The work is varied and offers a wide range of experiences in the delivery of care to children with acute, chronic and long-term nursing needs in their own homes and in other community settings. You will need to be flexible, have excellent communication skills, be able to work independently but also as part of a very supportive team delivering care to a diverse caseload. In return, we will offer a full induction programme and on-going support, training and development to further advance your skills and career.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElizabeth IbbsJob titleTeam Leader- CCNTEmail addresse.ibbs@nhs.netTelephone number020 3049 3780Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Wade, Paediatric Community Matron 07733 311085 for any further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kaleidoscope Children&#39;s Centre, London", "postalCode": "SE6 4JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.45", "longitude": "-.017486"}}, "title": "Children&#39;s Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254908", "validThrough": "2020-11-17T23:59:59+0000"}