{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24907to £30615 +5% HCAS"}}, "datePosted": "2020-10-30T10:31:19+0000", "description": "&lt;p&gt;We are looking to recruit a Family Intervention Therapist to work in our At Risk Mental Status (ARMS) team. Full details of the role and requirements are contained in the attached job description and person specification.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual that strives to innovate and want to make a real difference through the work they do. The job purpose is to assist in the assessment, planning, implementing and evaluating of family-focused evidence-based individual and group interventions (BFT and Carer-education specific to Early Intervention in Psychosis, as set out in EIP Standards, NICE 2016), to work in partnership with service users, carers, EIP team, wider health &amp; social care services, community assets and statutory and voluntary sector services, to promote family/ carer understanding and support for service user recovery and to assist them in regaining and maintaining their place in the community. In doing so, to provide co-produced carer education using a range of clinical, evidence-based self-management and health promotion interventions. Full details of the role and requirements are contained in the attached job description and person specification.&lt;/p&gt;\n&lt;p&gt;Whilst it would be great if we could recruit someone who has all of the required experience we recognise this is unlikely. We are therefore ready to provide appropriate support and train the individuals so they can be effective in the role.&lt;/p&gt;\n&lt;p&gt;The appointee will need to be able to communicate effectively with colleagues, service users and members of the public, respect individual rights to confidentiality, and complete tasks within given deadlines.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact us and ask to speak to the service lead.&lt;/p&gt;\n&lt;p&gt;Please note that should we have a high volume of applications the Trust may close the vacancy early.&lt;/p&gt;\n&lt;p&gt;The Trust has a positive attitude to employees and job applicants with mental health issues.&lt;/p&gt;\n&lt;p&gt;We are an innovative and forward thinking organisation with an expanding portfolio of services. This means we can offer our staff genuine opportunities to develop their careers, gaining experience working across a number of specialisms. We are renowned for investing in and supporting our employees and have a strong ethos of continuous professional development.&lt;/p&gt;\n&lt;p&gt;Opportunities to progress locally are good as we also have the Inclusion IAPT Primary Care Mental Health service and Visions Drug and Alcohol Services, IPS Employment Support, Early Intervention Psychosis services and work closely with Thurrock Mind.&lt;/p&gt;\n&lt;p&gt;By way of background, in 2002 Inclusion was created as part of the award winning South Staffordshire &amp; Shropshire Healthcare NHS Foundation Trust, now known as Midlands Partnership Foundation NHS Trust. It was developed to provide evidence based innovative services to beneficiaries across England with the flexibility to provide local solutions to local communities but with the governance and commitment to quality of the NHS.&lt;/p&gt;\n&lt;p&gt;Successful in its endeavours, Inclusion has grown to provide drug and alcohol and sexual health, mental health services in the community, and prisons. Employing over 750 staff, including Psychiatrists, Counsellors, Doctors, Nurses, Social Workers, Allied Health Professionals,Therapists, Drug &amp; Alcohol Recovery Workers, Peer Mentors and Volunteers. We provide services to in excess of 19,000 services users per annum across the South East, Midlands, East of England and North of England.&lt;/p&gt;\n&lt;p&gt;The range of services we provide allows us to work with our service users in prisons, extending this into community settings, tackling both substance misuse and mental health concerns. We believe that people can change, a resounding theme of our services that underpins our success is being flexible to changing need, not compromising on quality and understanding our responsibility in achieving the best possible outcomes for service users, families and communities.&lt;/p&gt;\n&lt;p&gt;Inclusion has extensive experience of working alongside and providing services to Clinical Commissioning Groups, Local Authority Public Health Teams, Police &amp; Crime Commissioners, NOMS, NHS England and a broad range of public and voluntary sector institutions. Partnerships are important to us, we work with a range of providers to ensure there are comprehensive packages in place for our service users.&lt;/p&gt;\n&lt;p&gt;We are renowned for investing in and supporting our staff and have a strong ethos of continuous professional development. This means we can offer staff genuine opportunities to develop their careers, gaining experience working across a number of specialisms.&lt;/p&gt;\n&lt;p&gt;All in all, an excellent place to work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132074.png", "name": "Inclusion", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thurrock", "postalCode": "RM17 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4774", "longitude": ".323345"}}, "title": "ARMS Family Intervention Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249751", "validThrough": "2020-11-17T23:59:59+0000"}