{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "70000", "minValue": "60000", "unitText": "YEAR", "value": "£60-£70k"}}, "datePosted": "2020-10-08T12:02:10+0100", "description": "&lt;p&gt;We have an exciting opportunity for an enthusiastic and committed Director of Clinical Services and AHPS. As an executive member of Circle Reading Board you will hold responsibility for Nursing and AHP clinical standards and governance across Circle Reading Hospital.&lt;/p&gt;\n&lt;p&gt;                                                                                           &lt;/p&gt;\n&lt;p&gt;You will provide progressive leadership for all clinical staff working at Circle Reading to ensure the delivery of high-quality patient centred care and services that meets the needs of all patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be accountable for professional nursing and AHP clinical standards throughout Circle Reading, ensuring that clinical staff have the skills, knowledge and competence to uphold the quality of nursing and AHP services and the continual development of professional practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Reporting to the Hospital Director and working with key stakeholders, you will identify and implement service development opportunities and lead on the patient and public engagement agenda.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work closely with our Nursing and AHPs to maintain and further develop our Clinical Governance and Risk Management processes and lead the quality and assurance agenda within Circle Reading.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be an experienced nurse who can demonstrate significant post registration development both professionally and managerially either within the NHS or other healthcare provider setting. Excellent interpersonal, leadership and communication skills are essential. Passionate about patient care, you will be committed to continuous learning and development and act as role model for all clinical staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Nurse (Level 1)/HCPC Registration&lt;/li&gt;\n&lt;li&gt;Relevant Masters qualification or equivalent experience&lt;/li&gt;\n&lt;li&gt;Evidence of significant post registration development professionally and managerially&lt;/li&gt;\n&lt;li&gt;Management/leadership qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional benefits of joining Circle Health:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days’ annual leave with additional days for long-term service&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme: save money on a new bike and benefit from interest-free instalments&lt;/li&gt;\n&lt;li&gt;Private pension scheme helping your to live well in retirement&lt;/li&gt;\n&lt;li&gt;Health and wellbeing programme&lt;/li&gt;\n&lt;li&gt;Employee assistance programme: get confidential support 24/7&lt;/li&gt;\n&lt;li&gt;Private medical insurance to help you get any treatment you need quickly&lt;/li&gt;\n&lt;li&gt;Non-contributory life assurance and income protection insurance&lt;/li&gt;\n&lt;li&gt;Free Parking onsite&lt;/li&gt;\n&lt;li&gt;Free Uniform&lt;/li&gt;\n&lt;li&gt;Season ticket loan: get the benefit of an annual ticket and pay the cost over 12 months&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG2 0NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4369", "longitude": "-.971772"}}, "title": "Director of Clinical Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218191", "validThrough": "2020-12-04T23:59:59+0000"}