{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-26T18:35:26+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Band 6 CT/MRI Radiographer to join our Radiology department team based at The London Clinic’s main hospital in London, W1G 6BW (close to Baker Street &amp; Regents Park tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The London Clinic was established in 1932 and we have 8 premises located in the heart of London’s medical community. We are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;The London Clinic has a state-of-the-art imaging department providing diagnostic services which range from General radiology through to complex Interventional procedures. We have a dedicated Breast imaging suite, as well as our modern Nuclear Medicine department. This is in addition to our busy CT, MRI and Ultrasound disciplines, which are sited across the main building and satellite areas of The London Clinic campus.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Description&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Band 6 Radiographer you will assist in the provision of a CT and MRI service of the highest standard.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type: This is a full-time, permanent role (37.5 hours per week).&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Shifts:&lt;/strong&gt;&lt;strong&gt;Services runs from 7:30am to 8pm (Mon to Fri) - 7.5 hour daily shifts plus on-call and weekends. Flexibility is required.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Salary: The competitive salary range for this role is £35,880 - £47,875 depending on skills and experience.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package: We offer a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and much more. We also offer excellent career development; with clear career pathways and access to further education.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Duties &amp; Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Scan patients, working closely with the band 7 radiographers and ensuring a high standard of patient care.&lt;/li&gt;\n&lt;li&gt;Utilise department protocols and set standards to continually undertake CT and MRI procedures of the highest quality.&lt;/li&gt;\n&lt;li&gt;Maintain full safety standards in MRI and ensure that any person entering the MRI /CT scanner is appropriately safety checked in accordance with departmental policy.&lt;/li&gt;\n&lt;li&gt;Support clinical research and participate in Audit when required.&lt;/li&gt;\n&lt;li&gt;Execute duties courteously and professionally at all times and seek to ensure that the highest level of customer service is provided by the Radiology department.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC registered, with a DCR or BSc in Radiography.&lt;/li&gt;\n&lt;li&gt;MRI and CT scanning experience covering a wide range of clinical examinations and applications, e.g. Neuro, MSK, Urology, Hepatobiliary, GI and Gynae .&lt;/li&gt;\n&lt;li&gt;Familiar with a computerised patient information systems and PACS.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills with the ability to work within a team and independently.&lt;/li&gt;\n&lt;li&gt;Highly self-motivated individual who is articulate, flexible and calm within a cross-sectional imaging setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "CT/MRI Radiographer (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243616", "validThrough": "2020-11-09T23:59:59+0000"}