{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per Annum Plus HCAs"}}, "datePosted": "2020-10-21T17:45:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Highly Specialist SLT in Deafness 0.8 WTE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Deaf Team, Special Schools Service in Haringey is looking for a highly skilled and innovative speech and language therapist with extensive experience in working with Deaf children and young people from 3 to 17 years old.&lt;/p&gt;\n&lt;p&gt;You will work with pupils at Blanche Nevile School for the Deaf which is in partnership with a primary and secondary mainstream school (Highgate and Fortismere). You will be one of 4 SLT’s delivering high quality and innovative therapy and teaching approaches to pupils with a primary communication need due to deafness, as well as those who have significant communication needs additional to their deafness. You will require a minimum of 5 years experience as an SLT and have a minimum of Level 2 BSL, and preferably Level 3 BSL.&lt;/p&gt;\n&lt;p&gt;In addition to organising and managing your own caseload, you will take the lead for some areas of service delivery, support junior therapists, and continue to build and maintain strong relationships with Blanche Nevile School. You will receive regular supervision from the Clinical Lead therapist in Deafness and will have opportunities to work closely with colleagues both senior and junior within the team.&lt;/p&gt;\n&lt;p&gt;For further information please contact Karin Schamroth, Clinical Lead for Deafness &amp; Therapies Lead Blanche Nevile School on 07989 852 980 or email: Karin.schamroth@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKarin SchamrothJob titleClinical Lead Specialist SLT in DeafnessEmail addresskarin.schamroth@nhs.netTelephone number07989 852 980&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hornsey Central Health Centre, London", "postalCode": "N8 8JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5841", "longitude": "-.131275"}}, "title": "Highly specialist SLT in Deafness", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237469", "validThrough": "2020-11-10T23:59:59+0000"}