{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T14:46:38+0000", "description": "&lt;p&gt;We are looking for a senior nurse leader to work in our renowned facility during an exciting period of growth. The successful candidate will be joining an experience Medical Team who is committed to developing the Workforce.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity for the right person to develop their existing leadership skills with the full support of the Senior Sister, the Matron and the wider management structure gaining the necessary experience to achieve success at this level and beyond in the future.&lt;/p&gt;\n&lt;p&gt;As the Sister / Charge Nurse you will be responsible for supporting the manager and the team to deliver exceptional standards of safe, effective care; monitoring and maintaining care to ensure that it consistently meets CQC standards. You will need excellent organizational and communication skills, together with an intuitive, balanced and collective approach to leadership.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a dynamic, enthusiastic and hard working nurse with good communication skills to be part of our team in medicine. Ward 6A is a 30 bedded ward with different medical specialities. We look after acute medical admissions and renal patients making us a very good ground for learning. We offer education and training opportunities. Successful candidates will have an opportunity to liaise and work with multi disciplinary team and enhance their knowledge and experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested to apply please get in touch with&lt;/p&gt;\n&lt;p&gt;Rommel De Peralta (Ward manager) 07767484647&lt;/p&gt;\n&lt;p&gt;Joel Delfin (Deputy Head of Nursing ) 07825420756&lt;/p&gt;\n&lt;p&gt;for any informal visits on ward area.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Nurse Team Leader Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260202", "validThrough": "2020-11-20T23:59:59+0000"}