{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T09:30:50+0000", "description": "&lt;p&gt;An exciting opportunity has become available for an experienced Band 6 Occupational Therapist, working in a acute psychiatric admissions ward in Llanelli, Additionally you may be required to provide Occupational Therapy support to other in-patient acute wards, when necessary.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be able to demonstrate an aptitude and ability to work with clients with complex mental health needs, across a variety of service areas. Have the skills to assess, plan and implement treatment within an in-patient unit and facilitate safe and timely discharge to community services/ placements. Have a professional background of client centred and innovative work and effectively contribute clinically to multi- disciplinary team discussions.&lt;/p&gt;\n&lt;p&gt;You will lead on using a range of self-reflective assessment tools i.e. wellness recovery action plan with an educative approach. Additionally you will implement recovery through activity groups and work collaboratively with the third sector to develop services to improve the health and wellbeing of this patient group.&lt;/p&gt;\n&lt;p&gt;You will require effective communication, organisation and clinical decision making skills with enthusiasm and passion for this specialist field. You will provide clinical support and guidance to OT technical staff and OT students. This will include being an assessor for the OT Tech(s) undertaking units of the OT support worker diploma and formal staff supervision.&lt;/p&gt;\n&lt;p&gt;You will be supported through planned supervision, ongoing personal developmentplans with regular reviews and continued professional development opportunities.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;nterviews will be held on 16.11.2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria HarriesJob titleClinical Lead Occupational TherapistEmail addressvictoria.harries@wales.nhs.ukTelephone number01554 772768Additional contact information&lt;/p&gt;\n&lt;p&gt;Further enquiries, please contact Clinical Lead OT Victoria Harries 01554 772768 or Bryngofal ward manager Daniel Jones on 01554 745750&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bryngofal Ward, Prince Phillip Hospital, Llanelli", "postalCode": "SA14 8QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6916", "longitude": "-4.136"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255198", "validThrough": "2020-11-22T23:59:59+0000"}