{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum / pro rata"}}, "datePosted": "2020-10-23T13:30:44+0100", "description": "&lt;p&gt;You can expect a warm welcome at Milton Keynes University Hospital, our staff are friendly and welcoming. We listen to each other and work together to embed our Trusts values and behaviours.  At MKUH we appreciate our staff and reward them with an outstanding benefits package including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Free tea and coffee&lt;/li&gt;\n&lt;li&gt;Great flexible working opportunities&lt;/li&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Lease car scheme&lt;/li&gt;\n&lt;li&gt;Generous annual leave and pension scheme&lt;/li&gt;\n&lt;li&gt;On site nursery (chargeable)&lt;/li&gt;\n&lt;li&gt;Extensive staff health and well-being programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Milton Keynes University Hospital NHS Foundation Trust, in partnership with the University of Buckingham, is a University Teaching Hospital; we conduct research and teaching on site to improve the care of our patients. The hospital is undergoing significant investment, and we are proud to be rated good by the CQC. Visit our website to catch up on our latest news.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic Band 5 Staff Nurse to join our friendly and dedicated multi-disciplinary neonatal team with the possibility of a rotation to our new Transitional Care ward.&lt;/p&gt;\n&lt;p&gt;Our Neonatal Unit currently has 17 cots, consisting of I ITU, 4 HDU and 12 Special Care, and we are part of the Thames Valley Neonatal Network. We are hoping to greatly improve our neonatal unit within the next year, with a refurbishment in our current footprint, increasing the total number of ITU/HDU cots to 9 and in collaboration with our maternity unit developing a a designated Transitional Care ward.&lt;/p&gt;\n&lt;p&gt;Our philosophy is to consistently deliver the highest quality family centered care for our babies and their families. We pride ourselves on our collaborative practice, with a skilled multidisciplinary team working closely together to consistently deliver evidenced based best practice, focusing on delivering BAPM guidance, Baby Friendly Initiatives and working closely with the Network to ensure our practice is current and focused on delivering the highest standards of care.&lt;/p&gt;\n&lt;p&gt;With excellent communication and organisational skills, you will have a role to play in supporting the delivery of the Trust governance agenda. A positive attitude to work, with the ability to motivate others is essential, whilst we also want you to be able to continue your own professional development and you may on occasion have the opportunity to work within the pediatric department. 37.5 hours per week (Full Time and Part Time hours are available)&lt;/p&gt;\n&lt;p&gt;We are also interested in our staff’s development: with a unit based practice educator, we are able to offer a bespoke induction package to any successful candidate; if newly qualified you will be able to access the Trust yearlong preceptorship programme.&lt;/p&gt;\n&lt;p&gt;Once this is complete we expect all staff to undertake relevant specialist modules such as the Mentorship Programme and the Special Care or Intensive care modules within 18 months to 2 years of employment.&lt;/p&gt;\n&lt;p&gt;We encourage all staff to continually update- providing access to the internal study days and many outside study opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marian Forster on marian.forster@mkuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01908 996581&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neonatal Unit (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240712", "validThrough": "2020-11-06T23:59:59+0000"}