{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pro rata for part time"}}, "datePosted": "2020-10-26T03:31:15+0000", "description": "&lt;p&gt;An opportunity has arisen for an experienced registered nurse with a special interest in long term neurological conditions to join the Community Neurology Service. &lt;/p&gt;\n&lt;p&gt;You will join a team of specialist nurses in Epilepsy, Huntington’s, Multiple Sclerosis, Mental health  and Parkinson’s Disease;  providing an excellent opportunity to develop your specialist nurse case management and clinical skills within a supportive environment. &lt;/p&gt;\n&lt;p&gt;The team also comprises of therapists and support staff and the service is co-located with the Community Stroke Service and the Adult Speech and Language Service providing other opportunities for support and development as well as sharing of expertise.   &lt;/p&gt;\n&lt;p&gt;The post will involve working as an autonomous practitioner in people’s own homes and other community settings. &lt;/p&gt;\n&lt;p&gt;You will be carrying out clinical assessments and treatment to support individuals with long term neurological conditions and their carers. &lt;/p&gt;\n&lt;p&gt;Experience of working in the community and end of life care is desirable but not essential. &lt;/p&gt;\n&lt;p&gt;As well as establishing your role within a diverse community based multidisciplinary team, an integral part of the role will be to continue to develop close working links with secondary care and with social care.    &lt;/p&gt;\n&lt;p&gt;You will be actively involved in the continued development the service and need to demonstrate leadership and initiative as well as the ability to develop &amp; sustain good working relationships with multi-professional colleagues &amp; peers. &lt;/p&gt;\n&lt;p&gt;You will have a full, current driving licence and have access to a car. Please see attached Job description and Person Specification, and make sure you can evidence meeting all the essential criteria for the post in your application.&lt;/p&gt;\n&lt;p&gt;For further information please contact Julia Webster, Team Manager on 0115 8834830&lt;/p&gt;\n&lt;p&gt;Successful candidates will be required to apply for a DBS check. Nottingham CityCare Partnership is a completely smoke free organisation.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124392.jpg", "name": "Nottingham CityCare Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124392"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG2 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9437", "longitude": "-1.14741"}}, "title": "Specialist Nurse Neurology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241624", "validThrough": "2020-11-09T23:59:59+0000"}