{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-22T11:30:36+0100", "description": "&lt;p&gt;E-Rostering Support Officer - Workforce &lt;/p&gt;\n&lt;p&gt; We are looking for a committed and passionate individual to join us on our journey to support Locala colleagues in the use of the E-rostering system, providing advice, guidance and solutions to enhance the use of the software and provide support to all e-Rostering implementation projects. &lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic and committed individual with expertise in the health roster system to support the ongoing development of e-roster solutions within Locala.  You will be required to learn system specific skills and have an excellent understanding of roster processes enabling you to offer day to day support and training to all system users.  &lt;/p&gt;\n&lt;p&gt;We are looking for a motivated individual with excellent IT and communication skills to provide administrative and learning support to employees and support the management and accurate maintenance of the e-rostering system. &lt;/p&gt;\n&lt;p&gt;Working closely with Workforce and Performance this role will act as the main point of contact for e-rostering. &lt;/p&gt;\n&lt;p&gt;The post holder will provide an efficient and effective high quality rostering data administration service, ensuring all users of the e-rostering system are adequately trained and able to fully utilise the system ensuring data is kept up to date and that changes are completed in a timely manner.&lt;/p&gt;\n&lt;p&gt;You will also support on-going improvements in the e-rostering Implementation Projects for medical and non-medical workforce. This includes data gathering, system set up, conducting training sessions/workshops, project support, helpdesk advice, and ensuring high quality data input. &lt;/p&gt;\n&lt;p&gt;In return for becoming part of our team we offer a full induction and training package to support your needs, we will develop and motivate you to enable you to have the right skills to do your job, we offer great working conditions along with supporting you to achieve a good work life balance. &lt;/p&gt;\n&lt;p&gt;For more information about the role please contact Stacey Lowley 07763559222. Or email Stacey.Lowley@locala.org.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Batley", "postalCode": "WF17 5PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7109", "longitude": "-1.62678"}}, "title": "Administrator - E-Rostering Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238139", "validThrough": "2020-11-08T23:59:59+0000"}