{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T11:01:16+0000", "description": "&lt;p&gt;The Endoscopy Service at Calderdale and Huddersfield NHS Foundation Trust has full time Vacancy at Calderdale Royal Hospital. The applicant must be an Endoscopy trained nurse with minimum of 3 years’ experience. They must be competent in all areas to be able to lead and train new members of staff.&lt;/p&gt;\n&lt;p&gt;The Trust has two purpose built State of the Art, JAG Accredited Endoscopy Units, one based at Huddersfield Royal Infirmary and one at the Calderdale Royal Hospital. The units deliver the Bowel Screening and Bowel Scope service alongside the diagnostic and therapeutic endoscopy service to out-patients and in-patients. Both units are training units, training both medical staff and nurse endoscopists. The Endoscopy Service has a Training Lead to ensure, that all nursing staff receive support and training in all aspects of endoscopy from patient pre-assessment, assessment on day, consent, recovery, assisting with diagnostic and therapeutic procedures. This is supported by a training package specifically designed for Endoscopy staff.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to cross site work. They will have an obligation to participate in an out of hours on call service for emergencies. When on call, nurses are expected to attend within one hour of call out. Due to the nature of the work flexibility around working hours is necessary. The Endoscopy service provides a 6 days service working from Monday to Saturday.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameWendy CullingworthJob titleSenior SisterEmail addresswendy.cullingworth@cht.nhs.ukTelephone number01484 355870&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield and Calderdale", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253604", "validThrough": "2020-11-17T23:59:59+0000"}