{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82096 - £110683 Per Annum"}}, "datePosted": "2020-10-21T10:32:02+0100", "description": "&lt;p&gt;We welcome applications for a Consultant Radiologist with experience in General and Breast Radiology.&lt;/p&gt;\n&lt;p&gt;The post is based at York Hospital and covers work across all the associated sites.&lt;/p&gt;\n&lt;p&gt;The Magnolia centre based at York, houses the purpose built breast imaging unit which is fully equipped with modern Hologic tomosynthesis mammography units and the latest Phillips ultrasound machines. We work closely with our surgical and oncological colleagues have weekly breast MDM’s and function well as a friendly and progressive team. We undertake vacuum excision biopsies, breast MRI, use radiofrequency seeds for localisations and are active in trials including the SMALL trial.&lt;/p&gt;\n&lt;p&gt;You would join an existing team of four consultant radiologists with a specialty interest in breast and four consultant breast radiographers alongside a well-staffed team of advanced practitioners, radiographers, assistant practitioners, unit assistants and admin staff. We have close working links with our neighbouring symptomatic breast units in Harrogate and Northallerton.&lt;/p&gt;\n&lt;p&gt;An additional subspecialty interest would be supported and encouraged though is not essential.&lt;/p&gt;\n&lt;p&gt;The role includes a commitment to general responsibilities in the department. Acute CT and MRI reporting is team- based within a dedicated acute reporting hub, facilitating sharing of expertise and interesting cases. All radiologists have a short weekly session as the duty radiologist. On call is currently outsourced from 9pm and plans have been approved to reduce the on call commitment further.&lt;/p&gt;\n&lt;p&gt;York Hospital has 2 MRI scanners and 3 CT scanners. Scarborough Hospital has 1 MRI scanner upgraded 2 years ago and 1 CT scanner with funding approved for a second. There are 5 ultrasound machines at both sites&lt;/p&gt;\n&lt;p&gt;The Trust has recently had a £40million development approved for ED at Scarborough Hospital.&lt;/p&gt;\n&lt;p&gt;The radiology department is committed to teaching. We support radiology trainees from both Leeds and Hull rotations and the department is consistently rated highly by trainees. We have strong links with Hull York Medical School, providing opportunities in teaching and training.&lt;/p&gt;\n&lt;p&gt;We are a cohesive and friendly department. We work well as a team and with referring clinicians. There is a strong culture of sharing expertise and seeking advice. The management team is supportive and forward thinking. The department is currently embarking on a wide ranging programme of development and modernisation.&lt;/p&gt;\n&lt;p&gt;York is internationally renowned for its beauty and heritage. . Excellent rail and road links ensure easy access to major cities (only 2 hours to London) and to the wonderful North Yorkshire countryside. An extensive cycle network allows a pleasant, alternative commute to work. York has been recently voted as one of the best places to live in the UK. It is a lovely place to raise a family and has a plethora of excellent schools. The two universities in the city are highly renowned.&lt;/p&gt;\n&lt;p&gt;On joining the Trust you will gain access to a wide range of staff benefits. We offer a competitive relocation package of up to £8,000 and a study leave budget of £3,000 across three years will be allocated. Candidates must have a medical degree and be on the GMC Specialist Register or be within twelve months of obtaining their CCT (or equivalent) at the time of interview.&lt;/p&gt;\n&lt;p&gt;If you are an overseas candidate please contact our recruitment team to discuss opportunities for fixed term contracts if you are interested in working with us to gain your specialist registration.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRadiology Medical SecretariesJob titleRadiology Medical SecretariesEmail addressRadiologyMedicalSecretaries@York.NHS.ukTelephone number01904 726675Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in joining our team or want to find out more, please contact us to arrange an informal visit or telephone conversation. We are looking forward to hearing from you. Please contact us by emailing &lt;/strong&gt;RadiologyMedicalSecretaries@York.NHS.uk&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York Hospital, York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Consultant General &amp; Breast Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235879", "validThrough": "2020-11-09T23:59:59+0000"}