{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa, pro rata"}}, "datePosted": "2020-10-22T09:00:39+0100", "description": "&lt;p&gt;The Bradford and Airedale Child and Adolescent Mental Health Service is looking for a Senior Clinical Psychologist (Band 8a) to act as the Clinical Lead for their CAMHS Intellectual Disability Team, which provides assessment and therapy for children aged 5- 19 who attend special schools in Craven and Airedale. You will have experience and expertise in working psychologically with this client group, in particularly using Positive Behaviour Support (PBS), Trauma Informed Care, and systemic thinking.&lt;/p&gt;\n&lt;p&gt;You will be proficient at administering various psychometric assessments, including cognitive assessment and functional assessment, as well as psychological measures of behaviour/mood/mental health that are relevant to children with Intellectual Disability and their families/carers. The CAMHS ID team is a small team, at present comprising of psychology and psychiatry, as such the development of indirect work with schools, other professionals and families is imperative. In particularly, there is an expectation that you will work closely with the generic special schools in the locality. Service development, evaluation and research experience are also an expectation of this post.&lt;/p&gt;\n&lt;p&gt;You will also be expected to provide supervision to psychologists and other disciplines within the team; as well as consultation and training to members of the wider CAMHS team, as well as those outside of the service, such as schools, the local authority teams/services, voluntary agencies, and colleges.&lt;/p&gt;\n&lt;p&gt;Within Bradford District Care Foundation NHS Trust, we place importance in training and supervision. There is a psychological therapy training budget and regular supervision available to staff. We have links with the Leeds University Doctorate in Clinical Psychology course, and provides regular placements to trainees from the course.&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November&lt;/p&gt;\n&lt;p&gt;Short Listing Date: 9th November&lt;/p&gt;\n&lt;p&gt;Interview Date: 16th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachael Vann - Neurodevelopmental Team Manager&lt;/p&gt;\n&lt;p&gt;rachael.vann@bdct.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120637.jpg", "name": "Bradford District Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120637"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillbrook, Keighley", "postalCode": "BD20 6LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8729", "longitude": "-1.91411"}}, "title": "Senior Clinical Psychologist, Neurodevelopmental Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237639", "validThrough": "2020-11-08T23:59:59+0000"}