{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc. (pro rata)"}}, "datePosted": "2020-11-03T15:00:52+0000", "description": "&lt;p&gt;Are you an Infection Prevention and Control (IPC) clinical nurse specialist looking for a different challenge in a new setting? The RNOH IPC team is looking for an enthusiastic nurse with a year’s experience in IPC within the acute setting to join us as our Trust becomes a COVID Protected elective specialist surgical hospital site.&lt;/p&gt;\n&lt;p&gt;The prospective team member will be motivated, creative and autonomous. This is an opportunity to work as part of a multidisciplinary team delivering the annual plan. The Trust is providing elective orthopeadic and rehabilitation services for London and surrounding areas. It is also an international centre for excellence in orthopeadic surgery. The existing team consists of lead IPC nurse, IPC nurse specialist and surgical site infection surveillance (SSIS) nurse and coordinator. We work alongside microbiology and the antimicrobial pharmacist to deliver expert advice and education to staff and patients.&lt;/p&gt;\n&lt;p&gt;Key to this post is a robust understanding of infection prevention and control measures to inform clinical practice, support behaviour change and to maintain standards. The post holder will be proficient in interpreting laboratory results, developing care plans, audit and presentation, outbreak management and review of practice. The post holder will be visible within the organisation and able to work collaboratively with other disciplines outside of the IPC team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hannah Bysouth Hannah.bysouth@nhs.net and Menard-Ryan Ong menard-ryan.ong@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Infection Prevention &amp; Control Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254455", "validThrough": "2020-11-25T23:59:59+0000"}