{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16913", "minValue": "15789", "unitText": "YEAR", "value": "£15,789 - £16,913 pro rata"}}, "datePosted": "2020-11-06T12:16:27+0000", "description": "&lt;p&gt;Dorset is renowned for its quality of living, picturesque countryside and its famous Jurassic Coastline. You could improve your quality of life by combining these benefits with working for a transformational organisation.&lt;/p&gt;\n&lt;p&gt;Dorset Healthcare University Foundation Trust aim is to be an innovative and responsive provider, delivering high quality integrated care to make a positive difference to the health, well-being and independence of the people in Dorset.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic and motivated person to join our Team here at St Leonard’s Hospital. Past experience working with older people, in the community or within a multi professional team would be desirable.&lt;/p&gt;\n&lt;p&gt;The Post Holder will work mainly on the ward but must have the ability to travel by car as they may be required to monitor patients in their own homes and other community settings.&lt;/p&gt;\n&lt;p&gt;Responsibilities will require you to work mainly on your own under the close supervision of the Physiotherapists. You will be required to achieve a certain competency level which we will give you support and training to help you reach. Opportunities for further training may be available through the Trusts Training Department.&lt;/p&gt;\n&lt;p&gt;The Post Holder must have basic IT skills and will be required to support with other administrative responsibilities within the team.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue van den Akker, Team Lead, Email address: sue.vandenakker@nhs.net, Telephone number: 01202584209&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Verna Goodey – Team Lead on 01202584209&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Leonards Hospital, Hants", "postalCode": "BH24 2RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8179", "longitude": "-1.85603"}}, "title": "Therapy Assistant, Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259627", "validThrough": "2020-11-22T23:59:59+0000"}