{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T10:28:09+0000", "description": "&lt;p&gt;An interesting and rewarding opportunity has arisen for an Advanced Data Analyst to join NHS Nottingham and Nottinghamshire CCG.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have highly developed analytical and organisational skills and be able to work to tight deadlines.&lt;/p&gt;\n&lt;p&gt;Provide analytical support and insight to the Nottingham and Nottinghamshire Local Resilience Forum (LRF) Data and Information Cell and monitor COVID-19 infections and activity across the LRF system.&lt;/p&gt;\n&lt;p&gt;Provide analytical support and insight to the Population Health Management agenda in Nottingham and Nottinghamshire&lt;/p&gt;\n&lt;p&gt;Strong interpersonal skills are vital together with an ability to produce timely, accurate analytical reports. The successful applicant will have a high level of computer literacy including SQL and advanced Microsoft Excel skills&lt;/p&gt;\n&lt;p&gt;Note that the successful applicant will be based at home during the pandemic, until it is appropriate to work from an office environment.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contactRobert Taylor, Deputy Director of Performance and Information via Roberttaylor@nhs.net or Sergio Pappalettera viasergio.pappalettera@nhs.net&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "NHS Nottingham and Nottinghamshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128368"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham, NG2 7QP", "postalCode": "NG2 7QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9365", "longitude": "-1.13572"}}, "title": "Advanced Data Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246044", "validThrough": "2020-11-11T23:59:59+0000"}