{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,214 - £30,112"}}, "datePosted": "2020-10-30T09:15:52+0000", "description": "&lt;p&gt;An opportunity has arisen to join the community nursing team, predominantly rostered to work within the night service team. We are seeking a keen and enthusiastic registered nurse to provide high quality care to patients. The post holder should possess good communication skills both written and verbal, have evidence of ongoing professional development and be able to work independently.&lt;/p&gt;\n&lt;p&gt;As a forward thinking team, and supporting new models of care, the successful applicants will be integrated into the Neighbourhood day time workforce through internal rotation.&lt;/p&gt;\n&lt;p&gt;We offer a flexible work life balance approach and have a number of hours are available. Each shift is 9.5 hours&lt;br /&gt;&lt;br /&gt;If you would like to work in an area where your opinions and clinical judgements are valued, then this could be the job for you.&lt;br /&gt;&lt;br /&gt;We can offer you support and training to consolidate your nursing skills and enable you to continue to develop.&lt;br /&gt;A car driver with use of a vehicle is also essential.&lt;/p&gt;\n&lt;p&gt;When applying for this position, it is essential that you read the job description and person specification. Please use the supporting information space to demonstrate your ability to undertake this role, drawing on your skills, knowledge and experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namekay daltonAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information or to discuss the opportunity further please contact Kay Dalton Team leader on&lt;/p&gt;\n&lt;p&gt;01253 951604&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY4 1TJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7862", "longitude": "-3.05589"}}, "title": "Community Staff Nurse - Night Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249440", "validThrough": "2020-11-13T23:59:59+0000"}