{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per Annum"}}, "datePosted": "2020-10-26T15:46:21+0000", "description": "&lt;p&gt;Leeds and York Partnership is a high performing NHS Foundation Trust providing specialist mental health and learning disability services across Leeds and York as well as providing Regional and National specialised services.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated and dedicated individual to join our growing Contracting Team. The Trust is expanding, taking on innovative new services and forging new partnerships across the country as well as the local area. Contractual relationships underpin this activity, offering a varied and challenging role and the opportunity to contribute to making a real difference to service users.&lt;/p&gt;\n&lt;p&gt;Key responsibilities will be developing and maintaining appropriate contract governance, negotiating and drafting contracts and variations, and undertaking contract management and reporting. Significant contracting experience is required, ideally gained in the NHS. An understanding of the NHS Standard Contract is essential. The post holder will also take on the role of Overseas Visitors Manager for the Trust.&lt;/p&gt;\n&lt;p&gt;Well-developed communication skills to liaise at all levels with internal and external stakeholders are needed, along with the ability to build strong, positive relationships. Attention to detail and excellent organisational skills are essential to ensure that all contract and administrative processes are undertaken efficiently and effectively. Adaptability and flexibility will be needed to balance competing demands. Alignment to the Trust values, Simplicity, Integrity, Caring, should be demonstrated.&lt;/p&gt;\n&lt;p&gt;The post is part home based and part based at Trust sites.&lt;/p&gt;\n&lt;p&gt;If you think you have the drive, experience and flexibility to meet the demands of this role we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma PolhillEmail addressemma.polhill@nhs.netTelephone number07966421447&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust HQ, Leeds", "postalCode": "LS15 8ZB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7968", "longitude": "-1.4265"}}, "title": "Clinical Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243201", "validThrough": "2020-11-09T23:59:59+0000"}