{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23000", "minValue": "21500", "unitText": "YEAR", "value": "£21,500 - £23,000 per annum"}}, "datePosted": "2020-10-22T12:14:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Service Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a full time Service Lead to join our friendly and dynamic team. An exciting and varied role where you have the opportunity to influence healthcare provision at GP Care.&lt;/p&gt;\n&lt;p&gt;You will contribute to the delivery, performance and development of a cluster of services and you will provide support for the development of new services. Reporting to the Services Manager, you will develop a close working relationship with the Patient Support Manager and the Performance Lead to support the delivery of high-quality services to patients&lt;/p&gt;\n&lt;p&gt;You will monitor key performance indicators for each service, contribute to clinical governance and ensure excellent patient experience and promotion of patient safety.&lt;/p&gt;\n&lt;p&gt;This role is likely to be home-based for a temporary period but with some travel to our Head office in Aztec West and our clinics across Bristol, North Somerset, South Gloucestershire, Gloucestershire and Swindon will be required. This role may become more office based in the future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will preferably have previous experience working in an NHS or healthcare environment and you will possess excellent communication and interpersonal skills, working closely with a wide range of internal and external stakeholders.&lt;/p&gt;\n&lt;p&gt;Travel to our community clinic locations will be required, therefore a current driving licence and access to a car is an essential requirement. Travel time is paid, as is mileage.&lt;/p&gt;\n&lt;p&gt;Benefits includes 25 days holiday plus bank holidays, together with a 4% non-contributory pension.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be contacted to attend an interview and if sucessful will then be asked to attend one of our clinics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a CQC accredited healthcare provider of community based healthcare services including diagnostics, outpatient and ancillary services to NHS and private patients, currently within Bristol, North Somerset, South Gloucestershire, Gloucestershire and Swindon but looking to branch out further to new CCG areas across England. In addition we offer a variety of support services to our shareholder base of 100 practices which comprise over 650 GPs who look after approximately 1,000,000 patients. Our services are clinically led, developed to meet patient needs and provide cost and efficiency savings to the NHS.&lt;/p&gt;\n&lt;p&gt;GP Care&#39;s key patient values are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Services are always designed around the patient&lt;/strong&gt;- services that are well managed, efficient, convenient and accessible for patients are generally cost effective for commissioners;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We treat patients with kindness, dignity and respect&lt;/strong&gt;- as if we were talking to a friend or relative about an important matter;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We always talk to patients&lt;/strong&gt;- we don&#39;t make appointments without direct verbal contact and patients are provided with a telephone contact number for each service, all of which are answered personally and promptly. We don&#39;t like automated voice systems and we don&#39;t use them;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Keeping referring GPs informed&lt;/strong&gt;- all of our services provide GPs with discharge reports within 24 hours of an appointment as we believe this is critical to ensuring they are fully informed should a patient refer to them for continuing advice or support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;GP Care is committed to a policy of equality in all our employment practices and it is essential that all staff are willing to make a positive contribution to the promotion and implementation of this. Recruitment is done in line with safe recruitment practices.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service check (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "GP Care Uk Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130255"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS32 4TU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5419", "longitude": "-2.56961"}}, "title": "Service Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238365", "validThrough": "2020-11-08T23:59:59+0000"}