{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-11-06T09:15:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Lead Nurse, Faculty of Nurse Education. Medical Division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available to progress and professionally lead and manage the Faculty of medicine division Nurse Education within Bristol Royal Infirmary Hospital at University Hospitals Bristol and Weston NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post is integral to the senior nursing leadership team within the medical division and you will work collaboratively with other educational teams across the Trust and wider Regional and National specialist educators, to ensure we have high calibre professional staff with the right skills to deliver optimal care to our patients and are responsive to changing healthcare services. We are looking for a senior nurse with a sound and in-depth knowledge of educational theory and a proven ability to apply this to facilitate effective nurse education and evidence and competency-based training for nursing and healthcare staff working in acute hospital and outpatient environments.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the strategic development and operational delivery of programmes of post qualification nurse education and those working in supportive roles. You will work autonomously whilst interacting with multiple professionals across the Hospital, Region and Nationally, recognised professional bodies as well as Academic and Higher Education Institutions. Expertise and specialist knowledge at organisational or strategic level for additional areas including recruitment, retention and workforce planning are required.&lt;/p&gt;\n&lt;p&gt;You must be a Registered Nurse with a recognised teaching qualification and proven ability to work at Master’s level. Extensive experience of teaching in practice, developing new educational programmes and roles, change management and strategic organisational development are essential. Additionally, you will be responsible for effectively manage the medical division Nurse education budget and promoting income generation.&lt;/p&gt;\n&lt;p&gt;This post offers a significant opportunity to a senior nurse who has vision and drive to lead and inspire the clinical nursing workforce through transformation change, ensuring it is fit for the future. As a senior nurse you will work with the medical division Head of Nursing, Nurse Consultant for Emergency Nursing, Associate Director of Education as well as safety and quality leads. You will be expected to have significant NHS experience and a passion for ensuring high quality care is delivered by a highly skilled and trained workforce.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Johanna Lloyd-Rees, Deputy Head of Nursing, Medical Division&lt;/p&gt;\n&lt;p&gt;Telephone number: 0117 342 0929&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Lead Nurse, Faculty of Nurse Education", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258981", "validThrough": "2020-11-18T23:59:59+0000"}