{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T10:31:41+0000", "description": "&lt;p&gt;The Acute Care Group serves the community of Kent with a population of approximately 1.6 million people, specialising in the assessment and treatment of adults of working age who are acutely mentally ill. We provide inpatient facilities in state of the art environments, working alongside extensive home treatment teams and liaison psychiatry services. We offer a progressive service where your skills and knowledge will be enhanced to further your development and expertise.&lt;br /&gt;&lt;br /&gt;Our acute admission wards at Littlebrook Hospital, Dartford provides care to adults of working age and we’re looking for enthusiastic, motivated and flexible RMN/RNLD nurses to join our established team .&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are looking for dedicated Staff Nurses to join us and be part of our forward thinking, progressive service, that invests in staff through continuous development and career progression.&lt;/p&gt;\n&lt;p&gt;You might be a newly qualified RMN/RNLD nurse, or an experienced nurse looking for a new challenge, and you would love to join a forward thinking service that is embracing the therapeutic day.&lt;/p&gt;\n&lt;p&gt;You will fit well within our team if you are enthusiastic, motivated and flexible, and are dedicated to providing high quality, person-centred care and support to patients experiencing acute mental health difficulties in an in-patient environment, as you may be required to work in other wards as necessary.&lt;/p&gt;\n&lt;p&gt;This post attracts a High Cost of Living supplement.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cheryl Lee, Matron, on 01322 622081&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Littlebrook Hospital, Dartford", "postalCode": "DA2 6PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4464", "longitude": ".241649"}}, "title": "Staff Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246081", "validThrough": "2020-11-11T23:59:59+0000"}