{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum"}}, "datePosted": "2020-10-29T16:00:51+0000", "description": "\n \n\n&lt;p&gt;We are looking for an enthusiastic and innovative nurse to join our band 6 community children&#39;s nursing team on a fixed term contract til September 2021.&lt;/p&gt;\n&lt;p&gt;Our band 6 nursing team is supported by band 7 nursing leads within CCN, continuing care, palliative care and Roald Dahl epilepsy nurse who provide strong leadership and expertise. The team is also supported by a practice development facilitator for staff development and clinical governance and a community children&#39;s matron.&lt;/p&gt;\n&lt;p&gt;Our team has also recently expanded with the newly developed children&#39;s community asthma nursing team (band 6 &amp;7) and the Roald Dahl community transition nurse. The team is also integrated within the wider multi-professional team with play and psychology (Diana Palliative care team) and community paediatric dietitians.&lt;/p&gt;\n&lt;p&gt;Previous community experience is not essential but you are required to have skills in clinical assessment, individual needs assessment and care planning, alongside the ability to work as part of a multidisciplinary, multi agency team. Good communication skills are a must alongside a flexible and forward thinking attitude. Please refer to the personal specification for more detail and refer to this within your application.&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative staff member who is interested in quality improvement and new ways of working. We support agile working with the use of laptops, smart phones and parking permits for car owners.&lt;/p&gt;\n&lt;p&gt;Newham is culturally the most diverse of all London boroughs, with people from a rich variety of ethnic, religious, and linguistic backgrounds. We have the third fastest growing population in England with 40% of the community being 0-24 years old and children and young peoples health services are at the centre of local developments.&lt;/p&gt;\n&lt;p&gt;We believe to provide compassionate care to children and families we need to foster a culture of compassionate working relationships and leadership within the service. We are committed to staff support, supervision and training. You will be supported to undertake further training to enable career progression within the service and have access to peer support and psychology consultation from the psychology team within the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca DANIELSEmail addressrebeccadaniels@nhs.netTelephone number0203 7387063&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Children&#39;s nursing team Appleby health Centre, LONDON", "postalCode": "E16 1LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.511", "longitude": ".016262"}}, "title": "Junior Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248978", "validThrough": "2020-11-15T23:59:59+0000"}