{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-30T09:00:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant Cardiologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Unplanned and Integrated Care&lt;/p&gt;\n&lt;p&gt;10 PA&lt;/p&gt;\n&lt;p&gt;Salary: £79,860 - £107,688 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interviews- Week Commencing 23rd November 2020&lt;/p&gt;\n&lt;p&gt;Here at Medway, we pride ourselves on working together as one to ensure that our shared vision of Better, Best, Brilliant is achieved.&lt;/p&gt;\n&lt;p&gt;With strong leadership the day to day experience for our teams is a great one, staff are valued, excellent quality care is provided and the passion for continuous improvement is high.&lt;/p&gt;\n&lt;p&gt;Our Trust is a great choice for people who want to develop their career in an ambitious and dynamic environment; our employees are able to choose the coverage and supplemental benefits that best fit their needs and those of their families. Our excellent benefits package includes onsite childcare facilities, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;Flexible working opportunities within the Trust are on the rise, giving employees flexibility on where, when and the hours they work. Timewise Power 50 awards celebrate the achievements of senior business leaders who work part-time, at Medway NHS Foundation Trust we are proud that one of our very own consultant anaesthetists was recognised as Power Part-Timers 2019.&lt;/p&gt;\n&lt;p&gt;As an employee at Medway NHS Foundation Trust you will be encouraged and empowered to be yourself at your very best through our ‘You Are The Difference’ programme. Our departments across the Trust will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are recruiting a &lt;strong&gt;Locum Consultant Neurologist &lt;/strong&gt;Cardiologist who shares our ambition and vision to deliver the &lt;em&gt;Best of Care by the Best People&lt;/em&gt; and has the drive to take us forward, by ensuring the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;As part of our ongoing commitment to professional development we are offering a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting and HR, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;The Trust has also engaged with the renowned Henley Business School to be able to offer MBA, MA,BA, Executive Education, Undergraduate and Postgraduate programmes.&lt;/p&gt;\n&lt;p&gt;All of our learning programmes will support and encourage all members to be able to apply their learning immediately back into their working life. Our hope is that the education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;Our culture and values are what drives Medway NHS Foundation Trust and is the heartbeat of who we are as an organisation. It is important that you understand and to refer to our values when you are completing your application and always reflect our values throughout your employment with the Trust.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether. We are inspiring and ambitious, respectful and supportive, open and we speak up, we are inclusive and responsible.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr. Debjit Chatterjee, Lead Consultant for the Department of Cardiology at Debjit.chatterjee@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr. Sandip Banerjee, Clinical Co-Director for Specialist Medicine at sandip.banerjee@nhs.net&lt;/p&gt;\n&lt;p&gt;Rachel Rowson, Service Manager, Rachel.rowson2@nhs.net, 01634 830000 ext 5841&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Locum Consultant in Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249389", "validThrough": "2020-11-12T23:59:59+0000"}