{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45900", "minValue": "45900", "unitText": "YEAR", "value": "Up to £45900 depending on experience"}}, "datePosted": "2020-10-19T08:09:34+0100", "description": "&lt;h2&gt;Are you an inspiring team leader?&lt;/h2&gt;\n&lt;p&gt;If you’re looking for a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is the place! To succeed in this role you will need to use your top-notch clinical skills, a passion for care and leadership skills.&lt;/p&gt;\n&lt;h2&gt;About Practice Plus Group&lt;/h2&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;h2&gt;A bit about the role…&lt;/h2&gt;\n&lt;p&gt;As a Registered Nurse (RGN/RN/RMN) you’ll be an integral part of the healthcare team. You will work, as part of a multi-disciplinary team to support patients in HMP Portland in their recovery from Drugs and Alcohol. You will also be expected to run regular clinics to initiate prescribing of and/or make amendments to prescriptions for opiate and/or alcohol substitute treatments and other related medications.&lt;/p&gt;\n&lt;h2&gt;What we can offer you…&lt;/h2&gt;\n&lt;p&gt;At Practice Plus Group, we are proud to support our employees with continued professional development opportunities and further education (subject to service needs). Staff are encouraged to develop skills and learning to contribute to the individual care needs of our specific client groups. Other benefits include cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;h2&gt;What We Need From You...&lt;/h2&gt;\n&lt;p&gt;You will hold an NMC Qualification and Prescribing medical/ non-medical with a real passion for developing your clinical skills. You’ll have a flexible approach, working within a team that encourage new ideas and opinions on how to improve the service.&lt;/p&gt;\n&lt;p&gt;You must have an understanding and commitment to recovery and a person centred approach. You will also understand and promote harm reduction techniques and be able to use your sound BBV knowledge to contribute to Practice Plus Group’s ambition to eradicate Hep C from Prisons.&lt;/p&gt;\n&lt;p&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;h2&gt;More information…&lt;/h2&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. The salary for this role is up to £45,900 - dependent on experience.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN5 8UX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5259", "longitude": "-1.14584"}}, "title": "Substance Misuse Clinical Lead - HMP YOI Doncaster", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231468", "validThrough": "2020-11-16T23:59:59+0000"}