{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T11:01:47+0100", "description": "&lt;p&gt;Do you want to work for an organisation that CAREs? We aim to be a catalyst for better health by improving services and patient outcomes. If this inspires you and sounds like an organisation you want to be part of, then we may have a role for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Project Support Officer you&#39;d be part of the Portfolio Delivery Team (including Programme Managers, Project Managers, Business Analysts, Project Support Officers and Portfolio Assurance Team). You’ll work with the Programme Managers and Project Managers to support delivery of the portfolio of projects for the service areas. If you enjoy working with others and like variety in your work, then we think you&#39;d enjoy working here.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for someone with great organisational, time management and attention to detail skills, a great attitude and a drive to support delivery of our change programme.&lt;/p&gt;\n&lt;p&gt;So, if you&#39;re interested in a career within a portfolio and project delivery function, enjoy working across different teams and are looking for the potential for further development, then we&#39;d love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join an organisation that puts professionalism first&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHSBSA is dedicated to helping our people be their best. We work in a supportive and positive environment, where continuous learning and development is a real focus.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A great work place&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are based at Stella House just on the outskirts of Newcastle with good transport links to the city centre.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If this sounds like the type of challenge which excites you, then we want to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note this vacancy may close early if sufficient applications are received before the close date.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Gemma Day - gemma.day3@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Project Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240191", "validThrough": "2020-11-08T23:59:59+0000"}