{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rata (plus on call"}}, "datePosted": "2020-11-06T12:31:25+0000", "description": "&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust can offer you great career prospects and a fantastic lifestyle. Situated in one of the most attractive parts of the country with dramatic countryside and bustling towns, the Trust is about to embark on a major capital investment programme (up to £312m), to upgrade its estate and create state of the art medical facilities and has a culture of supportive friendly teams, providing excellent professional NHS job development opportunities.&lt;/p&gt;\n&lt;p&gt;The Trust has a vision for the future that puts the patient at the heart of everything we do and is guided by the principles and values about which we care deeply. In line with this vision, the Estates Directorate are seeking a highly committed professional to join our team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for an engineering and building maintenance section of the Trust, which includes first-line day-to-day management responsibility for providing an efficient, effective and patient focused maintenance and repair service, within the allocated budgets, using Directly Employed Labour (DEL) and Contractors, who together are involved in the upkeep of the buildings, engineering systems, roadways, footpaths and grounds at the designated site(s).&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a positive can do attitude and be able to demonstrate flexibility and initiative when dealing with a wide range of engineering/building services, providing team leadership and co-ordination to achieve a high standard of productivity and workmanship in the most cost effective manner.&lt;/p&gt;\n&lt;p&gt;An Estates Assistant Manager maintains, operates and reviews Planned Preventive Maintenance (PPM) programmes and through the implementation of suitable operational work plans ensures that buildings, plant and equipment are maintained to the appropriate NHS and statutory standards in order to deliver a high quality care environment for the Trust’s patients.&lt;/p&gt;\n&lt;p&gt;You will ensure compliance with the Health &amp; Safety at Work Act, and associated Statutory Regulations that are applicable to the to the position, with suitable training and support. In addition you will act as an Authorised/Responsible Person for a number of specialised building and engineering services e.g. medical gases, specialised ventilation, electrical safety, water safety and/or decontamination equipment.&lt;/p&gt;\n&lt;p&gt;Applicants should possess professional knowledge acquired through a degree or equivalent plus specialist knowledge acquired through post-graduate courses, and experience to masters equivalent level in a building services/engineering related discipline. This will be supplemented by having worked previously in the NHS or similar organisation, and preferably with evidence of management development and formal Health and Safety training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Royal Hospital, Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Assistant Estates Operations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259668", "validThrough": "2020-11-20T23:59:59+0000"}