{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 p.a. pro rata"}}, "datePosted": "2020-10-27T11:46:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;An exciting opportunity for a 12 month secondment has arisen for an experienced nurse with an interest in providing advanced nursing support within the Head &amp; Neck Cancer specialist nursing team in the inpatient and outpatient settings, with a particular focus on the oncology aspect of the patient pathway.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will be involved in and carry out holistic nursing assessments for patients under the Head and Neck multi-disciplinary team (ENT, Plastics, MaxFax and Oncology). You will work actively with the multidisciplinary team and outside agencies to deliver the patient’s clinical and psychological support during their treatment, with a particular focus on supporting patients undergoing chemotherapy, radiotherapy and immunotherapy. &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;You will have a good understanding of:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;ENT anatomy&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Current cancer treatments used in Head and Neck oncology including radiotherapy, chemotherapy and immunotherapy and the symptoms and side effects that may be experienced on treatment&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The effects of Head and Neck cancers and their treatments on breathing, swallowing, communication, vision and body image.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support requirements for patients with an altered airway e.g. laryngectomy&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Knowledge of Survivorship, Recovery package &amp; the specialist needs of Teenage and Young Adult patients&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Complex end of life care&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your key skills will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Excellent communication skills, to work well within a MDT team and to appropriately support your patient group and their family throughout the patient pathway from diagnosis, treatment and follow up and discharge/ end of life care dependent on treatment outcome.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enthusiasm and organisation; to manage a cross-speciality workload which will require you and your team to prioritise calls from patients and carers, inpatient workload and consultant and nurse led Outpatient clinics.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in more details of this post and think you may have the skills to be part of this team then please contact us to find out more. We welcome and encourage informal discussion and/or visits prior to application.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;Closing date: 8 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 17 November 2020&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jill Barker&lt;br /&gt;Job title: Head and Neck Oncology CNS&lt;br /&gt;Email address: jill.barker@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 01223 217425&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division D, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Head and Neck Cancer Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244302", "validThrough": "2020-11-08T23:59:59+0000"}