{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-10-26T17:02:21+0000", "description": "&lt;p&gt;Due to a retirement, we are recruiting for a new member of our nursing team at Ainsdale Medical Centre.&lt;/p&gt;\n&lt;p&gt;We are a 12,000 patient practice with a significant elderly population. We were rated ‘Good’ by the CQC at our last inspection in 2018.&lt;/p&gt;\n&lt;p&gt;We are a long-standing training practice for GPs and nurses and we strive for a culture of continuous learning and development.&lt;/p&gt;\n&lt;p&gt;COVID-19 is making us re-think everything about how we provide care for our patients and keep our staff safe while they are at work. It is a dynamic environment and a challenging time to work in general practice. We want someone to help us shape how the practice develops in the future.&lt;/p&gt;\n&lt;p&gt;We believe that we offer the chance to work in a large forward-thinking general practice with a friendly and supportive team, open culture and good opportunities for personal development in the future.&lt;/p&gt;\n&lt;p&gt;In the recent IPSOS MORI National GP Patient Survey , 98% of patients who responded rated their general experience at Ainsdale Medical Centre to be Good or Very Good ( national average 82%).&lt;/p&gt;\n&lt;p&gt;There is some flexibility around working hours between 20-37 hours per week. Salary is in line with experience and will be competitive.&lt;/p&gt;\n&lt;p&gt;Experience of working in primary care is desirable but not essential as we are able to offer support and training. The right candidate should be enthusiastic and motivated, patient focussed, friendly with a flexible approach and willing to work autonomously. You must be NMC registered.&lt;/p&gt;\n&lt;p&gt; For an informal discussion please contact Steph O’Connor, Lead Nurse – steph.o’connor@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southport", "postalCode": "PR8 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6024", "longitude": "-3.03874"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243538", "validThrough": "2020-11-13T23:59:59+0000"}