{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-06T13:46:26+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Please note this vacancy may be closed early if we have a sufficient number of applications.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Band 4&lt;/p&gt;\n&lt;p&gt;Base: The vacancy is for Manchester, Newcastle, Nottingham, Bristol and will be offered to the most suitable candidate irrespective of location.&lt;/p&gt;\n&lt;p&gt;We currently have an exciting opportunity within the Health Research Authority for an enthusiastic and organised individual.&lt;/p&gt;\n&lt;p&gt;The role will support the Approvals Officer in the processing of research applications, issuing standard communications and providing procedural advice to applicants. The post-holder will support the tracking of studies to deliver a coordinated service to applicants. They will support the administration of Research Ethics Committee meetings and record discussions and decisions by sub-committees.&lt;/p&gt;\n&lt;p&gt;The post-holder will be part of a wider team which will ensure that appropriate reviews have been completed and recorded in line with agreed processes in order to inform decisions of sites on the viability of the study locally.&lt;/p&gt;\n&lt;p&gt;Applicants should be educated to high level secondary education or have passed or be working towards NVQ3 in a relevant field, or equivalent, plus relevant practical experience.&lt;/p&gt;\n&lt;p&gt;S/he must have an understanding of the HRA role and remit, knowledge of a range of administrative practices and procedures plus evidence of practical experience at a similar level. S/he will have a well-developed knowledge and expertise of operating systems within the NHS or similar field and excellent organisational skills with the ability to prioritise against a background of change and uncertainty. Experience of taking minutes, of working with people at all levels in an organisation and of working to tight deadlines is essential.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Name: Tom Lucas&lt;/p&gt;\n&lt;p&gt;Job title: Approvals Operations Manager&lt;/p&gt;\n&lt;p&gt;Email address: tom.lucas@hra.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 7104 8116&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Research Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Old Chapel, Royal Standard Court, Nottingham", "postalCode": "NG1 6FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9516", "longitude": "-1.15601"}}, "title": "Approvals Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259983", "validThrough": "2020-11-22T23:59:59+0000"}