{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806"}}, "datePosted": "2020-11-04T12:16:32+0000", "description": "&lt;p&gt;&lt;span&gt;We provide healthcare services to people living in Bridgend, Merthyr Tydfil and Rhondda Cynon Taf county borough areas, serving a population of around 450,000. We are ideally situated between Wales’s capital city, of Cardiff and Swansea to the west, and less than an hour drive to the stunning scenery in the Brecon Beacons.&lt;br /&gt;&lt;br /&gt;Our vision is to care for our communities and patients by preventing ill-health, promoting better health, providing excellent services and reducing the need for inpatient care wherever possible through the provision of strengthened home, primary and community care.&lt;br /&gt;&lt;br /&gt;We value the diversity of our staff and welcome applications from people from protected groups under the Equality Act 2010, this specifically includes age, sex, sexual orientation, gender identity/reassignment, race/nationality, religion/belief, disability, pregnancy and maternity and marriage and civil partnership.&lt;br /&gt;&lt;br /&gt;Please check your email account regularly. Successful applicants will receive all recruitment related correspondence via the email account registered on the application form.&lt;br /&gt;&lt;br /&gt;All applicants are invited to apply in Welsh or English, and no preference will be given to applications submitted in either language.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and motivated Consultant to join our dedicated team of Care of the Elderly Consultants at the Princess of Wales Hospital This exciting opportunity has become available due to a Consultant needing to relocate to New Zealand. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will also play a key role in the Parkinson Disease Service and will be an influencer in its future development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be required to work closely with the consultant body and support the junior team in a variety of clinical settings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be able to develop their knowledge and skills in a busy department with a high turnover of patients and will be expected to take part in all teaching programmes. The post-holder will participate in the General Medicine on-call rota commensurate with experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Where we receive a high volume of applications for a post, we may bring the closing date forward. You are therefore advised to submit your complete application as early as possible to avoid disappointment. All correspondence regarding short-listing, invite to interview and references will be done via e-mail. Please ensure that you regularly check your e-mails and that you provide an e-mail address for each referee. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Ashok David&lt;/p&gt;\n&lt;p&gt;Clinical Director , Care of the Elderly &amp; Stroke services&lt;/p&gt;\n&lt;p&gt;Ashok.David@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;07974643927&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Lesley Hopkins, Service Manager , COTE , Princess of Wales Hospita.l Bridgend, Tel 01656-753972&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess of Wales Hospital, Bridgend", "postalCode": "CF31 1RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5177", "longitude": "-3.57165"}}, "title": "Consultant in Care of the Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255797", "validThrough": "2020-11-25T23:59:59+0000"}