{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 Per Annum Inc"}}, "datePosted": "2020-11-02T12:02:28+0000", "description": "&lt;p&gt;This is an exciting opportunity for Band 5 registered nurses to work on our male and female acute wards on the Bethlem Royal Hospital site which provide in-patient care for patients from the borough of Croydon.&lt;/p&gt;\n&lt;p&gt;We are recruiting for the following teams:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Croydon In-patient services&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Gresham 1 - 20 bedded female acute ward&lt;/li&gt;\n&lt;li&gt;Fitzmary 1 - 14 bedded female acute ward (currently the Trusts female only COVID-19 testing ward)&lt;/li&gt;\n&lt;li&gt;Tyson West 1 - 17 bedded male acute ward&lt;/li&gt;\n&lt;li&gt;Gresham 2 - 22 bedded male acute ward&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt; Croydon - Bethlem Royal Hospital, Beckenham London&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Patient Age Group:&lt;/strong&gt; 18 - 65&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Work Here?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Acute in patient services are being continually developed and improved and this is a chance to join a service at an exciting and changing time. Furthermore, there is a high level of opportunity to develop as a band 5 nurse within our teams. We offer specialist training and on-going support as a member of our nursing teams.&lt;/p&gt;\n&lt;p&gt;Special consideration and support is provided to newly qualified nurses to ensure; continuous development in an environment which builds on personal and professional development to help individuals become experienced and confident practitioners.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Croydon In-patient services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Work Here?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Excellent career progression, development and support for the right candidate. There will be opportunities to learn and develop many skills, including working with and supporting clients with severe mental illness and wide varying complex needs, risk assessment and risk management.&lt;/p&gt;\n&lt;p&gt;There is a high level of opportunity to develop as a band 5 nurse. We offer additional training that is specialised to our service giving you risk assessment and risk management skills which are invaluable in the mental health profession.&lt;/p&gt;\n&lt;p&gt;All applicants will need to demonstrate an interest in meeting the needs of mental health patients through the planning and implementation of recovery focused care. Applicants must demonstrate appropriate knowledge, skills and commitment to undertake the role.&lt;/p&gt;\n&lt;p&gt;If successful at shortlisting stage you will be conatcted regarding the next stage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application Requirements:&lt;/strong&gt; Registered Mental Health and Learning Disabilities Nurses. We take Newly Qualified RMNs and RNLDs or those qualifying within the next 6 months .&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to work autonomously to provide care for presenting service users from initial contact and assessment, formulating and delivering care plans, and evaluation of care. You will assess the risks and needs of service users to plan and evaluate care using a collaborative approach with service users and their carers.&lt;/p&gt;\n&lt;p&gt;You will work alongside other members of the multi-disciplinary team to ensure effective care delivery, including the use of evidenced based interventions, risk assessment and management and safe discharge processes. Equally important, you will ensure the physical health care needs of service users are appropriately addressed and monitored.&lt;/p&gt;\n&lt;p&gt;As a Band 5 practitioner, you will also undertake the role of shift co-ordinator on a rotating basis with other members of the team. This requires the organisation of tasks within the shift across the whole team and acting as the first point of contact for calls from professionals, service users and carers.&lt;/p&gt;\n&lt;p&gt;As well as a robust support package, you’ll benefit from regular individual and group supervision and an appraisal, and access to a Preceptorship and Mentorship to help you develop. Our 9 month Preceptorship programme is for newly qualified nurses and nurses that have not completed this type of programme and helps a nurse to fully embed their skills. Once the programme is completed you will receive an increment and increase and you will also receive your annual increment.&lt;/p&gt;\n&lt;p&gt;We are committed to helping to develop the people that come to work with us. We know that the Trust can only be as good as the people who work here and we’ll invest in you to maximise that potential! That’s why we really welcome and value people so highly.&lt;/p&gt;\n&lt;p&gt;In short, if you’ve got what it takes we’d be delighted for you to come and work with us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South London Partnership &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London Mental Health and Community Partnership (SLP) is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Values &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Bethlem Royal Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Patient Age Group: &lt;/strong&gt;18 - 65&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application Requirements: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Registered Mental Health Nurses. We also take Newly Qualified RMNs qualifying in 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates awaiting their Pin should allow 3 months before applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Beckenham", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "RMN or RNLD for Acute &amp; PICU Inpatient Services- Croydon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251973", "validThrough": "2020-11-22T23:59:59+0000"}