{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37876", "minValue": "33653", "unitText": "YEAR", "value": "£33,653 - £37,876 per annum"}}, "datePosted": "2020-10-23T12:34:20+0100", "description": "&lt;p&gt;We have an exciting opportunity available within the Mid HantsAdults’ Health &amp; Care Reablement Service. We are seeking highly skilled, enthusiastic and self-motivated Occupational Therapist to join our service in the Mid Hants of Hampshire.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;br /&gt;As a qualified Occupational Therapist, you will be responsible for leading holistic assessments of Reablement needs and planning Reablement interventions to support across a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There may also be opportunities to work across Hampshire as part of a county wide Reablement Service comprising Occupational Therapy, Sensory Services and CQC Registered Community Response Staff.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are currently working to develop strong links with our colleagues in Health, Integrated Intermediate care hubs and hospitals, to support discharge pathways and avoiding unnecessary hospital admissions. You will be instrumental in the success of this service development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be able to demonstrate effective assessment and treatment planning skills, goal setting and, work in a fast pace community service.&lt;/li&gt;\n&lt;li&gt;You must be able to demonstrate strengths-based approach to provide advice and information for clients to problem solve their own needs and make informed decisions on their Reablement journey.&lt;/li&gt;\n&lt;li&gt;You will have excellent communication, inter-personal and team player skills.&lt;/li&gt;\n&lt;li&gt;There is a responsibility to supervise junior Reablement staff within the team. Previous experience in a Reablement or Rehabilitation setting would be advantageous but not essential.&lt;/li&gt;\n&lt;li&gt;Due to the nature of the service there is an expectation to work across 7 days.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Reablement Service:&lt;/strong&gt;&lt;br /&gt;Occupational Therapy principals underpin our service and we are continually seeking opportunities to enhance delivery. We are passionate about ensuring personal development for all staff and have a structured workforce development plan whereby we actively encourage and support continuing professional development, including formal qualification routes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you:&lt;/strong&gt;&lt;br /&gt;Hampshire County Council recognises the outstanding contribution our staff make, so we offer a generous benefits packageincluding:- &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum 25 days annual leave entitlement &lt;/li&gt;\n&lt;li&gt;Access to Local Government Pension Scheme &lt;/li&gt;\n&lt;li&gt;Interest free travel loans and discounts. &lt;/li&gt;\n&lt;li&gt;Family friendly policies&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hampshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129457"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO22 5PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0583", "longitude": "-1.34266"}}, "title": "Occupational Therapist - Reablement - Winchester - HCC46710", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240553", "validThrough": "2020-11-15T23:59:59+0000"}