{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata per annum"}}, "datePosted": "2020-11-06T10:31:15+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a part-time (job share post) Medical Secretary to join the Older People Mental Health Services at Princess Road Clinic. The post holder will be expected to provide full secretarial service to both the Consultant Psychiatrist and his team, complete detailed reports and letters via a digital dictation system to a high standard, co-ordinating appointments, taking minutes of meetings and utilising Trust systems and databases, to ensure a high quality care and treatment is maintained.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who has excellent planning and organisational skills, a proven track record in secretarial work, who has the ability to work under pressure and be able to use their initiative&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a Diploma/NVQ Level 4 in Business Administration OR: Diploma/NVQ Level 3 in Business Administration plus willingness to work towards the Diploma Level 4 within an agreed timescale.&lt;/p&gt;\n&lt;p&gt;This is a job share post 30.00 hours per week and you will be expected to work closely with your counterpart and be able to communicate effectively between each other, to ensure a successful secretarial support service.&lt;/p&gt;\n&lt;p&gt;Candidates must be capable of independent travel as there may be times that the post holder may be asked to work at different sites across the locality&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Annette Maltby on 01723 384632 or email annette.maltby@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Road Clinic, Malton", "postalCode": "YO17 7JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1371", "longitude": "-.796797"}}, "title": "Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259233", "validThrough": "2020-11-13T23:59:59+0000"}