{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Equivalent Band 5"}}, "datePosted": "2020-11-03T11:07:48+0000", "description": "&lt;p&gt;Surgical Nurse | Wards | Equivalent Band 5 | Leeds | Flexible Hours &amp; Career Progression&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** Possible joining bonus of up to £2000 available for this role**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Leeds Hospital has an exciting opportunity for a motivated newly qualified nurse to join our surgical team. Our nurses are offered support and development in a challenging but rewarding environment with an opportunity to attend external and internal courses. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Leeds Hospital, located in Roundhay, Leeds, has been treating patients for almost 30 years. We are the region’s largest private hospital in terms of the range of services we offer and the number of consultants we work with. The hospital offers a range of services and facilities including four operating theatres, a sterile services department, a dedicated endoscopy suite, and a diagnostic and imaging department with an MRI and CT scanner. There are outpatient and physiotherapy departments providing services six days per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within a highly supportive team you will be responsible for assessing patient’s health and well-being across a complex and changing caseload on one of our busy surgical wards, assisting in the delivery of care to meet the patient’s needs. You provide post-operative care such as wound dressing, IVs and drains. You will have the opportunity to develop your own knowledge and skills and that of others whilst promoting best practice in health and safety and security.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;You will have excellent communication, organisation and provide the best quality of patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little on grace.little@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS8 1NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8321", "longitude": "-1.51416"}}, "title": "Newly Qualified Ward Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253625", "validThrough": "2020-12-03T23:59:59+0000"}