{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T12:31:25+0000", "description": "&lt;p&gt;An rare opportunity has arisen for an enthusiastic and motivated dietitian, with experience in paediatrics, to join our friendly, dynamic paediatric dietetic team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with the children&#39;s and young peoples (CYP) diabetes team, to help deliver the Best Practice Tariff, alongside 2 other dietitians already working within this team. The team also comprises paediatricians, children’s diabetes nurses and psychologist.&lt;/p&gt;\n&lt;p&gt;The post holder will provide dietetic care to patients referred via the antenatal diabetes team in the form via group education and a dedicated outpatient clinic.&lt;/p&gt;\n&lt;p&gt;The post holder will also work alongside other band 6 paediatric dietitians and the lead dietitian for paediatrics, as part of the countywide Nutrition and Dietetics team. The successful candidate be responsible for managing a caseload of paediatric patients fed via home enteral feeding and general paediatric outpatient clinics in a variety of community based settings.&lt;/p&gt;\n&lt;p&gt;We are committed to staff training and CPD, participate regularly in student training and have a robust appraisal and supervisory framework. Mobile working has been been implemented within the Nutrition and Dietetic Service, further aiding our ability to work across a wide variety of settings including home, schools and acute hospital clinics.&lt;/p&gt;\n&lt;p&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary (minimum payment of £1,034 and a maximum payment of £1,791) (pro rata where applicable).&lt;/p&gt;\n&lt;p&gt;A full valid driving licence and access to a car to use regularly for business purpose is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Heidi Scott&lt;/p&gt;\n&lt;p&gt;Job title: Lead Paediatric Dietitian&lt;/p&gt;\n&lt;p&gt;Email address: heidi.scott@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07760 990736&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Howlands Clinic, New QEII Hospital, Welwyn Garden City, Welwyn Garden City", "postalCode": "AL7 4HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.783", "longitude": "-.185828"}}, "title": "Specialist Paediatric Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255854", "validThrough": "2020-11-18T23:59:59+0000"}