{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "38693", "unitText": "YEAR", "value": "£38,693 - £49,036 £38,693 - £49,036"}}, "datePosted": "2020-10-28T16:01:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Trust Clinical Fellow Equivalent in Developmental Neuropsychiatry&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a Clinical Fellow in Developmental Neuropsychiatry (ST4+ equivalent) has become available at the CQC rated ‘good’ trust, Hertfordshire Partnership NHS University Foundation Trust. It offers SpRs or ST4-6s in any psychiatric specialty&lt;em&gt;,&lt;/em&gt; a 12-month ‘out of programme experience’ (OOPE) post. It may also be suitable for someone seeking a locum appointment service (LAS) post at ST4+ level.&lt;/p&gt;\n&lt;p&gt;The Clinical Fellow will gain experience working with patients who have mental health problems and developmental neuropsychiatric conditions, in particular intellectual disability, autistic spectrum disorders, attention deficit hyperactivity disorders, epilepsy and brain injury. Clinical work encompasses the whole range of service provision- from community to in-patient and forensic in-patient settings.&lt;/p&gt;\n&lt;p&gt;Although this is not a training post, the post holder will work alongside and share on-call duties with our Foundation Doctors and Psychiatry Core Trainees. Access to supervision and training opportunities are excellent and the post holder will be supported in maintaining their training portfolio.&lt;/p&gt;\n&lt;p&gt;The fellow will work in a service which has a pedigree of research and service evaluations. Several clinicians within the service hold research grants and there is a strong record of peer reviewed publications that have contributed to improvements in patient care and the shaping of national policy. The fellow’s clinical supervisor will be Dr Regi Alexander, Consultant Psychiatrist, co-editor of The Oxford Textbook of Psychiatry of Intellectual Disability and winner of the Royal College of Psychiatrists President’s medal 2018.&lt;/p&gt;\n&lt;p&gt;The post will be based at Little Plumstead Hospital in the outskirts of Norwich. Norwich is a refined, cosmopolitan city with a rich cultural life and offers a combination of relaxed living, affordable housing and good schools. Its reputation as one of the best places to bring up a child in the UK is thoroughly well deserved.&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership NHS University Foundation Trust welcomes applications from individuals who are welcoming, kind, professional, respectful and professional. The right candidate will need to be able to communicate well, prioritise their workload and work effectively within a multidisciplinary team. They should be fully registered with the GMC, have a license to practice and past experience in Psychiatry. Fixed term appointment for 12 months- part time or job sharing applicants will also be considered.&lt;/p&gt;\n&lt;p&gt;**Please note should sufficient applications be received HPFT reserve the right to close this vacancy at any time, we always encourage all interested applicants to apply at their earliest convenience to avoid disappointment**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Professor Regi Alexander, Consultant Psychiatrist (01603711173)&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Kiran Kasu, Medical Lead (Tel: 01603711182)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Little Plumstead Hospital, Norfolk, Norfolk", "postalCode": "NR13 5FA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6446", "longitude": "1.40748"}}, "title": "Trust Clinical Fellow Equivalent in Developmental Neuropsychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247300", "validThrough": "2020-11-11T23:59:59+0000"}