{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 PA"}}, "datePosted": "2020-10-27T12:01:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Organisational Development Practitioners&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;One Team in One Trust with One Goal with our vision:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;To employ the best people and develop and value them, so that the teams they work in provide outstanding care to the local population.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Developing our organisational culture is important because it is at the heart of a safe, high quality hospital. Only if our staff are supported, comfortable in their role, treated as equals by their peers, will they feel safe to do the right things: speak up and be open when things go wrong, live and breathe our organisational values and strive for excellence”. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Carter CEO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bedfordshire Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The newly merged Foundation Trust is seeking two exceptional individuals in exceptional times to implement and progress the Culture &amp; Organisation Development Strategy for the new organisation. Aligned to the NHS People Promise and We are the NHS: People Plan 2020/21, our strategy will support attainment of our vision through a programme of focussed activities and interventions designed to support, equip and inspire our leaders and their teams to provide the best possible services to our patients ensuring an organisation that is clinically led and managerially enabled.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to make an immediate and positive difference and be at the heart of driving forward our vision and aspirations. As an experienced OD practitioner, you will have the opportunity to make a difference to leaders, managers and their teams, developing and implementing their ideas and helping to positively influence our culture. To succeed in this role, the post holder should have experience of designing, delivering and evaluating a range of leadership development and organisational development interventions adapting their style to reflect needs, including, transitional change processes, holding crucial coaching conversations, 360 degree feedback and an ethos of continuous growth and learning for all of our colleagues, preferably in an NHS setting.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be able to quickly build strong working relationships with colleagues across the organisation, and be viewed as credible and knowledgeable in their field whilst having the confidence to support and advise colleagues and managers. They will need to be a self-starters, who enjoys working within an ambitious team and work flexibly to deliver a high quality service.&lt;/p&gt;\n&lt;p&gt;If you are someone who has a heart for supporting organisational development activity as we shape our services and help colleagues develop, then this will provide you with a fantastic opportunity. You will be joining a fledgling OD team working through a faculty of Fellows and Associates designed to have a profound effect on the culture of the organisation.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to supporting flexible and agile working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Paul King&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Assistant Director of Culture &amp; OD&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;paul.king@bedfordhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone number&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;01234 355122 extension 3677 or 07970946555&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedfordshire Hospitals NHS Foundation Trust, Bedford/Luton", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Organisational Development Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244378", "validThrough": "2020-11-08T23:59:59+0000"}