{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa. Inc. of HCAS [15%] Pro-rata"}}, "datePosted": "2020-10-29T16:46:14+0000", "description": "&lt;p&gt;Palliative Care Clinical Nurse Specialist and Lead for Advance Care Planning&lt;br /&gt;Hospital Palliative Care Team&lt;br /&gt;&lt;br /&gt;Band 7&lt;/p&gt;\n&lt;p&gt;30 hours per week &lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for an enthusiastic, highly experienced and motivated nurse to join the specialist palliative care team at Kingston hospital. The hospital was rated Outstanding by CQC 2018.The team works in an advisory role supporting patients with advanced disease requiring specialist palliative care, and their family.&lt;/p&gt;\n&lt;p&gt;The post holder will promote and support the delivery of excellent palliative and end of life care in Kingston hospital by providing specialist advice on symptom control, information and psychosocial support as well as supporting various service development initiatives. The post holder will also lead on trust wide service developments around advance care planning, working with clinical teams to support recognition of potential for dying and opportunities for advance care planning. Education and role modelling for the multidisciplinary teams is core in enabling them to support a positive experience for patients and their loved ones.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You will be a registered general nurse with appropriate qualifications, interest in education and experience in service development and of being involved with caring for patients with advanced incurable disease. This includes excellent interpersonal skills, an up to date knowledge base, and the ability to work autonomously. Good managerial skills are essential as well as an interest in innovation. In return we offer you the opportunity to work within a supportive team, which promotes and supports ongoing development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Interview Date: To be confirmed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Denise Gorman (Senior CNS) on 020 8934 6748 or Thora Thorhallsdottir (Consutant Nurse) on 020 8934 6215.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Palliative Care, Kingston Hospital NHS Foundation Trust, Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Palliative Care CNS and Lead for Advance Care Planning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249150", "validThrough": "2020-11-12T23:59:59+0000"}