{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T11:31:34+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Individual Care Packages Service for People with a Learning Disability&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are opening a brand new Individual Care Packages Service; this unit will enhance current specialist provision already delivered from the Brooklands site. There will be two individual apartments with communal facilities. The Individual Care Packages Service will offer short to medium term treatment and rehabilitation to people with a learning disability who cannot be accommodated in multi occupied units/wards because of their specific needs. Typically the patients will be detained under the Mental Health Act, have mental health problems, a history of substance misuse, challenging behaviour and may have a past history of committing criminal offences. The service will support the patient returning to their local community.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a number of staff nurses to join us in delivering high quality, compassionate care; we will need a strong team that can support this model of care This service will be highly specialist so we are looking for enthusiastic individuals who will be prepared to develop themselves and support the manager in developing the team to enable the delivery of expert care to this patient group.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The candidates should possess a degree in Learning Disability or Mental Health nursing.The post holder will &lt;/span&gt;&lt;span&gt;be appointed to work within an inpatient environment at Brooklands Hospital and will be accountable to the unit &lt;/span&gt;&lt;span&gt;manager. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will work as part of a multi-disciplinary team in implementing planned packages of care from &lt;/span&gt;&lt;span&gt;admission through to discharge within a therapeutic environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be expected to participate in, and facilitate the various group activities that occur on the &lt;/span&gt;&lt;span&gt;ward as part of the inpatient treatment programme and will act as named nurse to allocated patients. Staff nurses are also required to act as nurse in charge of a shift.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst full induction and training will be given, due to the specialist nature of the service it is crucial that staff have a particular interest in this group.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder is required to possess and constantly update skills which enable them to provide services to &lt;/span&gt;&lt;span&gt;this specialist group of patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be required to provide emergency cover to other units in the event of temporary staff &lt;/span&gt;&lt;span&gt;deficits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nii Kotey - Ward Manager - nii.kotey@covwarkpt.nhs.uk - 0121 329 4909&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brooklands Hospital, Birmingham", "postalCode": "B37 7HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4682", "longitude": "-1.73753"}}, "title": "Staff Nurse (Individual Care Packages Service) - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257473", "validThrough": "2020-11-22T23:59:59+0000"}