{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-04T10:01:30+0000", "description": "&lt;p&gt;We are a pioneering Trust, on an exciting journey of healthcare transformation, with award-winning research and innovation, and a strong team ethos. We’re looking for positive clinical leaders who want to help us deliver first-class patient care to a fascinating and complex population and be part of something special.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As you would expect from a large teaching Trust, we prize training doctors, nurses and other health professionals and we already work closely with local universities and King’s College, University of London. We now have the exciting new opportunity of working with Kent and Medway’s new Medical School, jointly provided by the University of Kent and Canterbury Christchurch University, which opens in September 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust has five hospitals providing a wide range of high quality services and opportunities for innovation. The William Harvey Hospital in Ashford has the full range of district general hospital services, as well as regional specialities, including the country’s best performing trauma unit. The Queen Elizabeth, The Queen Mother Hospital in Margate, also provides district general hospital services, while Kent &amp; Canterbury Hospital in Canterbury is a specialist services hub which provides adult medical care, inpatient renal, urology and vascular services and robotic surgery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our new hospital in Dover, the Buckland, and Royal Victoria Hospital, Folkestone, provide a variety of outpatient, diagnostic and minor injury services, alongside a range of services throughout the local area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a clear clinically-led strategy to transform secondary care in east Kent to deliver outstanding standards across all specialties which build services around the characteristics of our patients and a commitment to refreshing our estate and facilities. We support clinicians who see opportunities to make tertiary care available locally for our population, and we have a strong research ethic as a high recruiter to research studies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Gastroenterology service is seeking candidates who are keen to help develop specialist GI services such as upper gi, barrett’s, pH monitoring / manometry, EUS, complex polypectomy whilst seeking to expand the ERCP service in East Kent. Colleagues with other specialist interests complimenting those already available are encouraged to apply. There are a number of posts being advertised in the service to support the implementation of seven day gastroenterology and endoscopic service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sebastian Barton&lt;/p&gt;\n&lt;p&gt;sebastian.barton@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255291", "validThrough": "2020-12-01T23:59:59+0000"}