{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23810", "minValue": "22478", "unitText": "YEAR", "value": "£22,478 - £23,810 per annum, inc HCA"}}, "datePosted": "2020-11-03T17:30:47+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen within the Dental Outpatients Team for a Dental Clerk/Receptionist. The post holder will be responsible for the administrative organisation and smooth running of clinics including the pulling and preparation of notes, the accurate recording/inputting of data related to the clinic and patient demographic details.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a friendly, approachable and highly motivated individual to conduct the business of the reception area in a calm and professional manner; communicating effectively with patients, nursing, dental, medical and other staff to promote the best environment for the efficient running of the clinic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a busy and demanding role and we require a proactive and confident person to fill the post. Good communication skills are essential as you will be working closely with administrative and clinical staff to support the Dental Outpatient Team to manage its critical access targets relating to 18 weeks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Previous applicants need not apply.&lt;br /&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Michaela Weekes&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 299 5088&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Dental Clerk/Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254936", "validThrough": "2020-11-06T23:59:59+0000"}