{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-04T12:45:48+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;An opportunity has arisen for permanent Band 5 registered nurse to work on our busy Lowton Ward at Royal Albert Edward Infirmary working 37.5 hours per week.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join a forward thinking energetic team promoting a positive culture to deliver quality care to our patients. If you are an experienced nurse with an interest in Acute Medicine who is dedicated to providing excellent nursing care to patients and feel that you can add value to our dedicated team, we can offer you the development and support you need to ensure you continue to excel.&lt;/p&gt;\n&lt;p&gt;We will be looking for enthusiasm, drive and passion where the delivery of outstanding levels of care can be nurtured. You will have excellent communication skills and the flexibility and adaptability to meet the needs of this busy area. You will be motivated and committed to delivering high quality care to your patients in a busy and challenging unit.&lt;/p&gt;\n&lt;p&gt;If you wish to be considered for the position available please click apply now to complete an application form. Throughout the application form, and particularly in the supporting information, please ensure you clearly demonstrate how you meet each of the criteria on the person specification.&lt;/p&gt;\n&lt;p&gt;Newly qualified nurses will be welcome to the trust with the first years NMC paid as Band 4 Assistant Practitioners pending registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will require you to work across all areas in the Trust which includes those that are designated as positive, asymptomatic and negative COVID wards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates are required to present original certificates for qualifications at interview stage. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this vacancy may close before the advertised closing date if a sufficient number of suitable applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**&lt;strong&gt;&lt;em&gt;For overseas candidates wishing to apply for the job role and require immigration sponsorship, you can self-assess the likelihood of obtaining a CoS for the post on the &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;GOV.UK website.&lt;/em&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lynne Norburn&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address Lynne.Norburn@wwl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01942 778515&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Albert Edward Infirmary, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Staff Nurse - Lowton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255896", "validThrough": "2020-11-18T23:59:59+0000"}