{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8a"}}, "datePosted": "2020-11-04T09:58:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Infection Prevention Control Nurse | Spire London East | Band 8a| | Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire London East hospital have an opportunity for a Infection Prevention and Control Lead to join their team of staff in the Nursing department. This is a Full time role for 37.5 hours a week. The role holder will be required to cover a flexible shift pattern.&lt;/p&gt;\n&lt;p&gt;Spire London East Hospital (formerly Spire Roding) is located in Redbridge, on the borders of East London and Essex. We offer comprehensive private hospital services, ranging from outpatient clinics and physiotherapy to surgery and diagnostic tests in a relaxed, clean and comfortable environment. The hospital has 24 inpatient beds and 16 day case rooms called &#39;pods&#39;. Facilities include 4 operating theatres, an endoscopy suite, 2 extended recovery units, pharmacy, x-ray, outpatient and diagnostic facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure Infection Prevention and Control (IPC) is addressed in all areas of the hospital, and reflected throughout all activity related to healthcare provision.&lt;/li&gt;\n&lt;li&gt;Taking accountability for infection prevention for all business.&lt;/li&gt;\n&lt;li&gt;Ensuring IPC compliance for CQC, national audit programmes and ensuring PHE are met.&lt;/li&gt;\n&lt;li&gt;Be able to deliver on Covid-19 pandemic framework&lt;/li&gt;\n&lt;li&gt;Provide support to patients and staff working alongside director of clinical services &lt;/li&gt;\n&lt;li&gt;Ensuring any IPC investigations are investigated appropriately and in a timely manner&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC/HCPC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Able to apply specialist knowledge to risk assessment and support appropriate controls&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Jodie Walsh on 07935 755240 or email  Jodie.walsh@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East London", "postalCode": "IG4 5PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5872", "longitude": ".04309"}}, "title": "Infection Prevention Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255268", "validThrough": "2020-12-04T23:59:59+0000"}