{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T10:31:41+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our Discharge to Assess team in North Manchester which is part of our Manchester Community Response Service offer.&lt;/p&gt;\n&lt;p&gt;we are looking to recruit an innovative, enthusiastic Band 6 Physiotherapist to be part of a lively and dynamic multi-professional, multi-agency integrated team comprising of health and social care staff.&lt;/p&gt;\n&lt;p&gt;Working as an integral part of this MDT you will facilitate timely discharge from an acute hospital or community beds and provide specialist physiotherapy assessment, treatment and pathways of care. Being part of the Discharge to Assess process you will liaise with colleagues across all sectors to arrange appropriate support in the community and will managing a caseload of patients ensuring a high standard of physiotherapy provision.&lt;/p&gt;\n&lt;p&gt;The service operates 7 days a week 08:00 - 20:00&lt;/p&gt;\n&lt;p&gt;You must have experience of working in the NHS and it would be desirable that you have experience of working in a rehabilitation or community setting. You are able to demonstrate an appropriate level of clinical skills in physiotherapy, you are experienced in person-centred assessments, as well as developing, implementing and evaluating programmes of care. You must have a recognised Physiotherapy qualification and be eligible for HCPC Registration.&lt;/p&gt;\n&lt;p&gt;In return we will provide a comprehensive induction programme and you will be appraised on a yearly basis with a view to developing knowledge and skills where appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatie SharpAdditional contact information&lt;/p&gt;\n&lt;p&gt;Gabrielle Green&lt;/p&gt;\n&lt;p&gt;Lead, Discharge to Assess Team Manchester Community Response Service&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 0161 922 3324&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "nmgh/north manchester community, Manchester", "postalCode": "M85RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Community Physiotherapist - Discharge to Assess", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251576", "validThrough": "2020-11-16T23:59:59+0000"}