{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-11-05T15:01:41+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SWLSTG MH Trust is a lead provider within the South West London Trailblazer programme and currently runs six Mental Health Support Teams (MHST) across Merton, Sutton and Wandsworth. Each MHST works within a cluster of schools and offers a schools based mental health service, as well as supporting the implementation of a Whole School Approach (WSA) to mental health across the cluster. There are strong links between all the teams and a good peer support network across the Trust MHSTs.&lt;/p&gt;\n&lt;p&gt;The FE College MHST comprises of a team lead and supervisor who is an experienced Clinical Psychologist, the advertised post, 2 Primary Mental Health Workers and 4 Education Wellbeing Practitioners (EWPs), making a total of eight team members. The FE College cluster comprises of six Further Education Colleges across the six boroughs of South West London. The MHST will work collaboratively with colleges to implement a Whole College Approach to mental health, including staff consultation and training. Post holders will also provide individual, group and workshop interventions for young people within the colleges and there will be opportunities for working with parents / carers when appropriate.&lt;/p&gt;\n&lt;p&gt;The FE Colleges MHST has an additional specialist focus on transition points for young people. These include transition from school into the college system and also transition into adulthood (moving into higher education or employment, leaving home, moving into adult mental health services etc).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As this position is based within colleges, all annual leave will need to be taken during college holidays. Job shares and flexible working hours will be considered as appropriate as long as successful job share applicants can cover the hours of a full time post between them.&lt;/p&gt;\n&lt;p&gt;The postholder will offer direct clinical interventions to young people and parent / carers in both individual, group and workshop formats. This will include working directly with young people who are struggling with their mental health in a variety of ways. The postholder will collaboratively work with colleges and the MHST Lead to implement a whole college approach to mental health, including staff consultation and training. The postholder will also need to take on a mentoring role for the band 5 EWPs, especially when the MHST Lead is not available.&lt;/p&gt;\n&lt;p&gt;Regular supervision will be provided by the MHST lead. We have a strong network across the 6 MHSTs within the Trust and across the wider SW London partnership to enable sharing resources, learning and providing support. Cross team training and peer support opportunities are encouraged and we are proud of creating a warm, inclusive working environment.&lt;/p&gt;\n&lt;p&gt;Some travel between colleges and base is essential but this can be managed by public transport or cycling. A car may be helpful but is not necessary for the post.&lt;/p&gt;\n&lt;p&gt;This post will require:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualification as a registered Clinical Psychologist OR Counselling Psychologist OR Educational Psychologist OR Family Therapist or Adolescent Psychotherapist&lt;/li&gt;\n&lt;li&gt;Good experience of working with children, young people &amp; parents in a clinical setting / school / college&lt;/li&gt;\n&lt;li&gt;Experience of working with diverse communities and cultures&lt;/li&gt;\n&lt;li&gt;Strong assessment skills, especially in relation to risk&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;li&gt;The ability to work cohesively and collaboratively both within a small team and within the wider college cluster&lt;/li&gt;\n&lt;li&gt;Understanding and being able to work within the ethos and values of the cluster colleges&lt;/li&gt;\n&lt;li&gt;The ability to use feedback, reflect and adapt accordingly&lt;/li&gt;\n&lt;li&gt;Strong organisational skills&lt;/li&gt;\n&lt;li&gt;Commitment to using data and relevant measures to assess clinical outcomes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The FE College MHST is based at South Thames College, Wandsworth High Street, for supervision and admin purposes but the postholder will work across the college cluster. While the colleges are based across South West London, we do not expect postholders to routinely travel to all 6 colleges and travel times will be kept as low as possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Annika Clark, Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address Annika.clark@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, Tooting", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Clinical Psychologist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258237", "validThrough": "2020-11-12T23:59:59+0000"}