{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-11-02T09:31:29+0000", "description": "&lt;p&gt;Are you a former nurse with the desire and drive to return to practice?&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen within Calderdale &amp; Huddersfield NHS Foundation Trust for previously registered Adult nurses wishing to return to delivering compassionate and caring nursing practice.&lt;br /&gt;&lt;br /&gt;We are currently recruiting to positions in a variety of clinical areas where you will be supported to complete a Return to Practice programme delivered at Bradford University. You will be released to attend all University teaching. Our experienced Mentors will support you in practice to achieve your learning outcomes within the course.&lt;br /&gt;&lt;br /&gt;The practice placement requirement of your Return to Practice course will be based on your employing ward. Any additional placement experience required for you to complete the Return to Practice programme being will be supported by other clinical areas within the Trust.&lt;br /&gt;&lt;br /&gt;Throughout your Return to Practice training you will be employed in a substantive Band 3 post which will progress to a Band 5 position on successful completion of the course and re-registration to the NMC.&lt;br /&gt;&lt;br /&gt;Full time and part time posts are available (the minimum hours recommended for part time are 22.5 hours per week to enable university attendance and effective practice experience).&lt;br /&gt;&lt;br /&gt;Please make clear in your supporting information when your registration with the NMC expired.&lt;br /&gt;&lt;br /&gt;Please indicate on your application form your preferred areas of work.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Practice Learning Facilitators: Victoria Sillitoe or Yvonne Hardcastle on 01484 342942&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Return to Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251427", "validThrough": "2020-11-29T23:59:59+0000"}