{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 plus £149 HCAS pa"}}, "datePosted": "2020-10-30T17:06:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Ashford and St Peters&lt;/strong&gt; &lt;strong&gt;NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Consultant Medical Virologist &lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity exists for a Consultant Medical Virologist to join the virology team at Berkshire and Surrey Pathology Services (BSPS). Applications from candidates with Virology training or dual Virology/Infectious Diseases training are welcome. BSPS is a joint venture between Frimley Health NHS Foundation Trust, the Royal Surrey County Hospital NHS Foundation Trust, Ashford &amp; St Peter’s NHS Foundation Trust and the Royal Berkshire NHS Foundation Trust. The post holder will be employed by Ashford and St Peters NHS Foundation Trust and be based in the laboratory at St Peter’s Hospital, Chertsey. The Virology laboratory has full UKAS accreditation for a wide array of molecular biology and serology tests. Microbiology laboratories are based at Frimley Park Hospital and Wexham Park Hospital within the group and both have full UKAS accreditation. Close links with the University of Surrey also bring excellent research opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ashford and St Peters NHS Foundation Trust has been on a long journey of development and improvement to its current position as the largest provider of acute hospital services to Surrey residents. The Trust serves a population of more than 410,000 people living in the boroughs of Runnymede, Spelthorne, Woking and parts of Elmbridge, Hounslow, Surrey Heath and beyond. The majority of planned care, like day case and orthopaedic surgery and rehabilitation services, is provided at Ashford Hospital, with more complex medical and surgical care and emergency services at St Peter’s Hospital. The St Peter’s hospital is in an excellent location and has good road connections to London and ready access to Chertsey railway station. As well as all the advantages of being close to the City, Surrey has beautiful countryside as well as excellent schools, transport links, amenities and residential areas. The Trust has on-site nursery facilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Frimley Health NHS Foundation Trust provides NHS hospital services for around 900,000 people across Berkshire, Hampshire, Surrey and south Buckinghamshire. The Trust hosts a Ministry of Defence Hospital Unit, with military staff fully integrated with NHS colleagues across the hospital departments. The Trust provides a wide range of general clinical services as well as trauma and orthopaedics, cardiology, haematology, renal medicine and cystic fibrosis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Royal Surrey County Hospital NHS Foundation Trust provide health care services from Royal Surrey County Hospital in Guildford and adult community healthcare services from Haslemere Hospital and Milford Hospital. Royal Surrey County Hospital provides emergency and general hospital services to a population of more than 330,000 across South West Surrey. It is also home to St Luke’s, a specialist tertiary Cancer Centre, which offers state of the art diagnostic and treatment services to a population of up to 2 million across Surrey, West Sussex, Hampshire and to patients from across the UK and abroad. Milford and Haslemere community hospitals provide health care services to adults across Guildford and Waverley.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Royal Berkshire NHS Foundation Trust is one of the largest general hospital Foundation Trusts in the country. The Trust provide acute medical and surgical services to Reading, Wokingham and West Berkshire and is the region&#39;s specialist centre for cancer, eye and renal (kidney) care serving over one million people across Berkshire and South Oxford. In addition to the main site, the Royal Berkshire Hospital in Reading, the Trust also provide services at West Berkshire Community Hospital, the Prince Charles Eye Unit in Windsor and our renal unit based between Slough and Windsor. Additionally, it provides services at Townlands Hospital in Henley and at our major new cancer and renal centre in Bracknell.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a new consultant contract with 10 Programmed Activities and the job plan will be reviewed after six months. The post currently does not involve on-call cover.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder must be a registered medical practitioner and hold Full and registration with the GMC with a current licence to practise or be eligible within six months of the date of the Advisory Appointment Committee. Applicants should possess FRCPath or equivalent. To commence a substantive post they must be on the Specialist Register prior to start.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the Department to meet members of the team. For an informal discussion, please contact: Dr Stephen Winchester (Consultant Medical Virologist, BSPS) on 01932 723029 or Nicola Newman (Clinical Director) 01276 604742.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultant Medical Virologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251036", "validThrough": "2021-01-18T23:59:59+0000"}