{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-19T15:37:46+0100", "description": "&lt;p&gt;&lt;span&gt;This role is based at the Queen Elizabeth Hospital.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to support innovators across industry, healthcare and academia within the West Midlands.&lt;/p&gt;\n&lt;p&gt;The West Midlands Academic Health Science Network (WMAHSN); hosted by UHB, is one of 15 AHSNs across England. We work in partnership with NHS trusts, SMEs, care homes and universities to spread innovations at scale and pace and support the “import and export” of healthcare innovation through Innovation Exchanges.&lt;/p&gt;\n&lt;p&gt;Meridian is the WMAHSN’s Health Innovation Exchange and provides a coordinated approach to identifying, selecting and supporting the adoption of innovations that have the potential to transform the lives of patients and improve the local economy.&lt;/p&gt;\n&lt;p&gt;As Innovation Exchange Co-ordinator you will workclosely with the Head of Innovation Exchange to ensure toensure the operational running and ongoing development of a responsive network and Innovation Exchange across the whole of the West Midlands region. Working closely with the Innovation Exchange team you willadvise innovatorsacross sectors on the development of their innovations and support individuals to clearly define their healthcare challenges.&lt;/p&gt;\n&lt;p&gt;The post holder will need to develop strong trusting relationships, be autonomous and confident to work on your own as well as part of a team. You will be required to have an understanding of the challenges faced by innovators in thehealthcare industry either within industry, the NHS or similar health care setting.&lt;/p&gt;\n&lt;p&gt;While this role is based at the Queen Elizabeth Hospital with regular travel across the West Midlands region and occasional national travel expected, given the nature of the role there is the opportunity to work remotely but the ability to travel between sites is essential. This role is on a 12 month fixed term contract, due to funding.&lt;/p&gt;\n&lt;p&gt;To discuss this role further please contact Tammy Holmes, Head of Innovation Exchange,tammy.holmes@wmahsn.org&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Innovation Exchange Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232956", "validThrough": "2020-11-25T23:59:59+0000"}