{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on Experience"}}, "datePosted": "2020-10-22T16:56:22+0100", "description": "&lt;p&gt;Easington District PCN is an innovative, dynamic PCN combining 4 local GP Practices based in Easington, with a population of over 32,000 patients. We are continually seekingnew ways to support and improve local healthcare services to our patient population.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen an experienced or newly qualified Pharmacy Technician to join our growing multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;It is a requirement of the role to be registered with the General Pharmaceutical Society and have a BTEC/NVQ level 3 or equivalent in pharmaceutical sciences. The successful candidate would preferably have some experience of working as a qualified, registered Pharmacy Technician.&lt;/p&gt;\n&lt;p&gt;Primary care experience would be an advantage but is not essential. Teamwork, flexibility, enthusiasm and the ability to prioritise tasks effectively are essential skills.&lt;/p&gt;\n&lt;p&gt;We are committed to the on-going development of our team, which includes mandatory and developmental training for all our staff. Team members are encouraged to highlight any training they feel would benefit them in the achievement of their role.&lt;/p&gt;\n&lt;p&gt;Under the direction of a Senior Clinical Pharmacist we expect that you will be able to work independently and manage your own workload. You will be self-motivated, and above all you will be passionate about providing the highest standards of care and treatment to patients in primary care.&lt;/p&gt;\n&lt;p&gt;Due to the developing nature of the role and the needs and priorities of individuals requiring support a high degree of flexibility is essential. You will need excellent communication skills, able to meet targets and to be able to liaise with patients, primary care staff, community pharmacists and other partners.&lt;/p&gt;\n&lt;p&gt;You will support the improvement of safety and quality of prescribing, optimise the best use of medicines whilst minimising risk and providing safe patient care.&lt;/p&gt;\n&lt;p&gt;In addition to the patient facing aspect requirements of your role, you will also be required to contribute towards practice financial and quality performance. You will support the Practice Pharmacists work in delivering medicines optimisation initiatives within GP practices.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent written and verbal communication skills, experience of influencing others.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to be mentored and upskilled across a number of GP practices to achieving a greater clinical role for the future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: Previous Applicants need not apply. No Agencies.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If this role appeals to you and you have the qualities we are looking for then please get in touch:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For Clinical and PCN related enquires please contact Dr Dagny Samuel (GP East Durham Medical Group and Clinical Director Easington District Primary Care Network) &lt;/strong&gt;dagnysamuel@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For general enquires please contact Margaret Ross (Business Manager South Durham Health) &lt;/strong&gt;margaretross1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Easington", "postalCode": "TS21 3EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6619", "longitude": "-1.4485"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239437", "validThrough": "2020-11-06T23:59:59+0000"}