{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T14:31:11+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join and help shape a new countywide community stroke service which has been commissioned across Coventry and Warwickshire. The new post sits within a large multidisciplinary team, including band 7 and band 6 Physiotherapists and assistants, which provides assessment and rehabilitation within two distinct care pathways - an Early Supported Discharge pathway and a Community Stroke Team pathway. These pathways offer different intervention models to best meet the needs of stroke patients at different points in their rehabilitation. The varied role provides the opportunity further develop your clinical skills in stroke rehabilitation and use your specialist skills to support the evolution of the service through its early days. The team will be managed operationally by an 8a Clinical and Operational Stroke lead, but professional support will be provided by the Physiotherapy Manager. The post holder will work with the other AHP Band 7 leads to ensure that the services meet the Key Performance indicators set out by the commissioners.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to provide therapy virtually and in a patient’s usual home setting and so a car driver and owner is essential. Although based in George Eliot, the post will require significant travel across primarily the north of the county.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Physiotherapist who already has considerable skills and experience in the assessment and rehabilitation management of movement disorders following stroke. You will feel confident working within a multidisciplinary team to support clients and their families through a challenging time.&lt;/p&gt;\n&lt;p&gt;Regular team and department meetings are held throughout the year. We are a forward thinking department and believe in full clinical engagement in contributing towards improving the quality of our service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy GwynneJob titlePhysiotherapy LeadEmail addressLucy.Gwynne@swft.nhs.ukTelephone number01926 495321 ext. 7329Additional contact information&lt;/p&gt;\n&lt;p&gt;mobile 07917 264 161&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stroke ESD &amp; CNRT G23950, Nuneaton", "postalCode": "CV10 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.512", "longitude": "-1.47512"}}, "title": "Physiotherapy Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256238", "validThrough": "2020-11-18T23:59:59+0000"}