{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 -£51,069 pa +LW"}}, "datePosted": "2020-11-04T15:31:04+0000", "description": "&lt;p&gt;The Ambulatory Emergency Care (AEC) Departments at Imperial College Healthcare NHS Trust are seeking to recruit a ST3+ Doctor to join the team. This is a six month fixed term position with the potential to extend.&lt;/p&gt;\n&lt;p&gt;We are seeking inspirational doctors who are passionate about providing high quality, emergency same day care in this fast paced, evolving and exciting area of acute emergency care. You must have excellent communication skills and be enthusiastic about being part of an innovative multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join ambulatory care as we move to a Same Day Emergency Care (SDEC) unit, and see patients with varying presentations including renal colic, DVT, cellulitis, low risk chest pain and many more. We work closely with the Emergency Department, taking many patients from the Urgent Care Centre and ED triage, as well as those who are referred in by their own GPs. If you are interested in ambulatory and SDEC then this could be the role for you!&lt;/p&gt;\n&lt;p&gt;The AEC team are flexible and supportive of each other and opportunities are available for Doctors to develop their skills or undertake educational projects including in developing ambulatory emergency care pathways.&lt;/p&gt;\n&lt;p&gt;We welcome applications from doctors who may wish to work less than full time or join the team on a secondment and are looking for doctors who are already registered with the GMC and who have at least 6 months experience working in the NHS.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;To find out more, or to arrange an informal visit please contact Dr Lucy Bingham – lucy.bingham@nhs.net or Lead Nurse Sarah Brown – sarah.brown25@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Clinical Fellow (ST3+) in Ambulatory Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256447", "validThrough": "2020-11-18T23:59:59+0000"}