{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum plus Inner HCAS"}}, "datePosted": "2020-11-04T11:09:56+0000", "description": "&lt;p&gt;The SEL ICT Directorate is seeking to recruit an Associate Director of Digital Delivery who is able to work well within a strategic and operational role. The post holder will contribute significantly to the delivery of the ICS ICT strategy.&lt;/p&gt;\n&lt;p&gt;The Associate Director of Digital Delivery will have a pivotal role in ensuring that the CCG has a coherent and ambitious plan for IT and the digital agenda. They will support the Director of IT &amp; IG in developing and delivering an ICS IT strategy encompassing the needs of both the South East London CCG and the evolving digital primary care requirements set out in the Long Term Plan and Digital First.&lt;/p&gt;\n&lt;p&gt;They will respond to all primary care digital delivery requirements by ensuring detailed plans are developed, and then implemented across the six boroughs of South East London; leading a small team but also by working closely with system partners, suppliers and other teams across the ICS.&lt;/p&gt;\n&lt;p&gt;They will have exceptional interpersonal skills and proven skills in working well with partners and stakeholders across multi-faceted systems and organisations making up the SEL ICS. The post holder will be expected to be a strong negotiator and with demonstrable skills in contract and service management.&lt;/p&gt;\n&lt;p&gt;They will need to have a good understanding of the GP IT Futures framework and associated suppliers together with demonstrable programme management experience; be able to create compelling business cases and accurate project plans, and then work tenaciously in a complicated and pressured environment to deliver these across the organisation and member practices.&lt;/p&gt;\n&lt;p&gt;This post holder will also have a role in ensuring operational delivery is provided effectively, acting as a point of escalation for issues where required.&lt;/p&gt;\n&lt;p&gt;This individual will be required to develop good relationships with CCG colleagues, General Practice and wider stakeholders across the South East London ICS, and will have significant responsibility and autonomy. They will need to communicate frequently, manage projects in a robust way, and have very good technical knowledge to be successful in this exciting role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Organisational Context:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role of South East London Clinical Commissioning Group (CCG) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS South East London Clinical Commissioning Group is the statutory body responsible for commissioning healthcare services to south east London’s 1.9 million residents of the boroughs of Bexley, Bromley, Greenwich, Lambeth, Lewisham and Southwark.&lt;/p&gt;\n&lt;p&gt;The CCG buys services from hospitals, ambulance service and community service providers.&lt;/p&gt;\n&lt;p&gt;South East London CCG covers all GP practices in the area and is overseen by a governing body, which is responsible for making decisions about healthcare. The governing body includes GPs, nurses, a hospital doctor and other healthcare professionals and patient representatives. This is supported by other prime committees including Borough Based Boards which will have delegated responsibility for commissioning local services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the CCG’s key functions include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making arrangements to secure public involvement in the planning and commissioning of healthcare services.&lt;/li&gt;\n&lt;li&gt;Contributing to the boroughs’ Joint Strategic Needs Assessment (JSNA) and the Joint Health and Wellbeing Strategies led by the Health and Wellbeing Boards.&lt;/li&gt;\n&lt;li&gt;Adhering to relevant principles of good governance and carrying out its functions effectively, efficiently and economically.&lt;/li&gt;\n&lt;li&gt;Working with the local authorities and their partners to improve the wellbeing of children and their families, as well as supporting community care assessments, local education and the police, prison services and probation services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;South East London CCG’s key priorities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing more systematic and proactive management of chronic disease to improve health outcomes&lt;/li&gt;\n&lt;li&gt;Empowering patients and encouraging self-care&lt;/li&gt;\n&lt;li&gt;Integrating models of care&lt;/li&gt;\n&lt;li&gt;Ensuring urgent care systems maximise appropriate access of care for patients&lt;/li&gt;\n&lt;li&gt;Improving access to services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Working in a single CCG:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will have a core base location and key areas of focus which may be locally within a borough or at scale across South East London. However, as part of operating within a single organisation as we move towards Integrated Care Systems, it is important to note that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We all work ultimately for South East London and the residents/ patients and partners within it, and we will need to support our colleagues in other functions or in other locations. Where required you should work with your line manager to ensure your work is prioritised accordingly.&lt;/li&gt;\n&lt;li&gt;You may work more closely or as part of mixed teams with local authorities, trusts or other partners&lt;/li&gt;\n&lt;li&gt;You may also be asked on occasion to travel to and potentially work in different CCG borough locations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "160 Tooley St, London", "postalCode": "SE1 2TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5032", "longitude": "-.079442"}}, "title": "Associate Director of Digital Delivery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255541", "validThrough": "2020-11-18T23:59:59+0000"}