{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc pro rata"}}, "datePosted": "2020-10-29T15:31:25+0000", "description": "&lt;p&gt;The Kensington &amp; Chelsea Talking Therapies Service are looking for qualified and experienced Cognitive Behavioural Therapists or Clinical/Counselling Psychologists to join our friendly, busy and innovative team.&lt;/p&gt;\n&lt;p&gt;The service, along with teams from neighbouring Boroughs, was awarded Wave 2 Early Implementer for LTC status. We also have an ambitious perinatal service, an extensive Outreach programme, and offer rewarding opportunities for clinicians looking to gain and build on their clinical experience in a supportive service with excellent BABCP accredited supervision and ongoing Continuing Personal Development.&lt;/p&gt;\n&lt;p&gt;The service runs to the national IAPT programme and provides a range of CBT-based interventions for people with common mental health problems. Alongside high and low intensity CBT interventions, our service also benefits from Step 3 Counselling, Step 4 Psychology, Primary Care Psychiatric Nurse Liaison, and a comprehensive Community Living Well programme. Individual and group based treatments are provided.&lt;/p&gt;\n&lt;p&gt;The team has a service development programme to meet new demands and the needs of the local population, including working with health providers across acute, community and primary care settings. There are clear and well defined systems for triaging and screening of incoming referrals, allocation of clients to step 2, 3 and 4, management of waiting lists and stepping up and stepping down clients as appropriate.&lt;/p&gt;\n&lt;p&gt;Beyond providing psychological treatments, successful applicants will also carry out duties such as triage and provision of clinical supervision to low intensity workers, trainees, assistants and other staff as required.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who have enthusiasm for working in a primary care setting, who are adaptable; enjoy variety, and working independently as well as within a team context. This post would be suitable for experienced practitioners or newly qualified CBT therapists or Clinical Psychologists. An ability to deliver therapy in local languages would be desirable. We offer extended hours clinics, which include early morning and late evenings, and successful applicants would be expected to support this service provision.&lt;/p&gt;\n&lt;p&gt;The post holders will receive regular supervision and support from a Senior Clinician as well as benefit from peer support and guidance from other team members. The Kensington &amp; Chelsea Talking Therapies Service has close links with Talking Therapies teams within CNWL and there are opportunities for further development. We have good links with and have trainees from all the Regional training courses and there would be opportunities to mentor and supervise Trainee Clinical or counselling Psychologists, High Intensity Trainees and others as appropriate.&lt;/p&gt;\n&lt;p&gt;The team hubs are based in North Kensington and South Chelsea, with lots of local amenities and transport links. We are well-resourced with ICT and the service promotes CPD and ongoing clinical learning opportunities. The staff team provide services within primary health care centres across the Borough as well as in other community and voluntary sector sites and the post holders will be expected to deliver interventions across these sites&lt;/p&gt;\n&lt;p&gt;In order to be shortlisted for this post, applicants must be BABCP accredited (or working towards and eligible for this), HCPC registered (if Psychologist)&lt;/p&gt;\n&lt;p&gt;Interview date:2nd December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLuca Palmili&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kensington and Chelsea, London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "High Intensity Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248891", "validThrough": "2020-11-12T23:59:59+0000"}