{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T11:31:39+0100", "description": "&lt;p&gt;An exciting opportunity has arisen Band 6 Community Psychiatric Nurse post within Anglesey Substance Misuse Service, based in Isgraig Clinic Llangefni. The successful candidate will be responsible for the provision of comprehensive assessment and treatment interventions to individuals who misuse substances, including risk assessment, substance use, social care and psychological effects. To work as an autonomous practitioner in community settings including services users’ homes. The post holder will manage a case load and support individuals through their treatment within service. They will also be responsible for supervising junior members of staff and supporting their development.&lt;/p&gt;\n&lt;p&gt;The post holder will have knowledge and experience of substance misuse interventions and treatment and will be required to use effective communication skills to engage, motivate and maintain service users in contact with services and to be responsible for the development and continuous evaluation of treatment programmes as appropriate. Induction will be tailored to individual needs, and discussed at interview. The post holder will be expected to work with both alcohol and drug misuse service users. Candidates are requested to use the section &quot;Supporting Information&quot; on the application form to set out their reasons for applying and their suitability, referring to the person specification, for this post.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 08/11/20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Team Manager Aled Hughes&lt;/p&gt;\n&lt;p&gt;03000853355&lt;/p&gt;\n&lt;p&gt;Aled.hughes@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isgraig Clinic, Llangefni.", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240345", "validThrough": "2020-11-08T23:59:59+0000"}