{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-10-15T14:31:33+0100", "description": "&lt;p&gt;&lt;strong&gt;The ‘real’ 24 hours in A&amp;E&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Being part of our amazing #TeamED is wonderful enough…but in this role, you will also work autonomously as this is very much a clinical role. We know you are out there – we just need to find you!&lt;/p&gt;\n&lt;p&gt;We have two amazing Emergency Departments across two hospitals, but just one amazing #TeamED vision. It’s exciting as staff will be flexible across both locations, learning loads of new skills along the way. We can promise you it’s definitely not going to be dull!&lt;/p&gt;\n&lt;p&gt;121,500 patients per year come through our Preston and Chorley hospital doors, nearly 28,000 of these are children and over 700 are major trauma patients…Did we mention we are the Major Trauma Centre for the North West and the very distinctive Air Ambulance helicopter can be seen coming and going at Preston a few times a day – bringing people from all across the area for us to treat.&lt;/p&gt;\n&lt;p&gt;It’s all about #TeamED here and we are so really proud of this – our colleagues feel like family so it’s a pleasure to work with them every day. &lt;strong&gt;You will be guided by an experienced team of consultants and supported by the rest of the wonderful nursing team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is a lot to do and there will be lots of support available to help you along the way so you won’t be on your own. This is your time to shine, to help lead a fab service, make your mark and influence our continual evolution – we know this will be what really lights your fire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Just some of the positives of working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are the Major Trauma Centre for Lancashire and South Cumbria&lt;/li&gt;\n&lt;li&gt;Experienced and longstanding consultant body that doesn’t use locums&lt;/li&gt;\n&lt;li&gt;Dedicated weekly teaching within the ED and monthly regional teaching&lt;/li&gt;\n&lt;li&gt;SPA time&lt;/li&gt;\n&lt;li&gt;You will be encouraged to take on other role e.g. debrief lead, CIP Lead, simulation training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;No matter how much we try, it’s impossible to cram everything in just one advert, so we really welcome you to get in touch and have a chat with us to find out a lot more about joining us. Contact our fab Matron Lynn.Sime@lthtr.nhs.uk on 01772 522402.&lt;/p&gt;\n&lt;p&gt;We also want you to follow us on Twitter – it’s where you will start to see the real ED as we share the stories of our world here @LTHTREmergency1&lt;/p&gt;\n&lt;p&gt;We intend to interview on an ongoing basis for this role, so we won’t be waiting for a closing date, – it means we will get you in even sooner to start with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca BlackAdditional contact information&lt;/p&gt;\n&lt;p&gt;To arrange a visit please contact&lt;/p&gt;\n&lt;p&gt;01772 522402 - 523239 (Christine Cassel PA and /med secretary)&lt;/p&gt;\n&lt;p&gt;Rebecca Black SBM for ACUTE -01772 522061&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "preston, preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Emergency Department Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228605", "validThrough": "2020-11-08T23:59:59+0000"}