{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum"}}, "datePosted": "2020-10-28T10:32:16+0000", "description": "&lt;p&gt;What will I be doing in my new role?&lt;/p&gt;\n&lt;p&gt;Simple…to work closely with both of our ICT Assistant Service Desk Manager and ICT Support Hub Supervisor, providing a first point of contact for our internal colleagues, external service providers and stakeholders, delivering a ‘first class’ support for any ICT or Telephony queries.&lt;/p&gt;\n&lt;p&gt;You will be working with a diverse customer base of users ranging from Consultants, Senior Management, Nurses, Health Care Assistants, Receptionists, Call Handlers, Administrators, and Secretaries, all with varying levels of ICT knowledge / skills who are reliant on our ICT/Telephony systems.&lt;/p&gt;\n&lt;p&gt;This is why we are looking for an individual with a warm, approachable and reassuring manner, who can provide main switchboard services with the ability to offer support to the user through the escalation process with a positive and pragmatic approach. This bank position is primarily providing Telephony services during the working day and ICT 1st Line support out of hours. &lt;strong&gt;Full training will be provided&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for providing a calm, professional and efficient first point of contact for our ICT services to employees, managers and users of Trustwide ICT/Telephony systems working within the newly merged ICT Service Desk and Telecommunications Department; the ICT Support Hub. The right candidate will ideally have previous experience of working within a large Organisation preferably in an ICT support &amp; Telecommunications customer facing service.&lt;/p&gt;\n&lt;p&gt;In return for your endeavours you can expect to part of a team committed to delivering high quality services and innovation to NHS staff and patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Julie Siddique&lt;/p&gt;\n&lt;p&gt;Telecoms &amp; ICT Support Hub Manager&lt;/p&gt;\n&lt;p&gt;julie.siddique@bedfordhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;01234-795929&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital Southwing, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Bank ICT Support Hub Analyst (Telecoms Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246104", "validThrough": "2020-11-06T23:59:59+0000"}