{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum inclusive of HCAS"}}, "datePosted": "2020-10-19T09:45:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Directorate of Integrated Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speech and Language Therapy Department, Regional Hyper-acute Rehabilitation Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Principal Speech and Language Therapist, Band 8a, full time, permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to lead the RHRU SLT team. The department is looking for an enthusiastic and dynamic colleague with established leadership skills who can supervise junior staff and inspire and motivate both the SLT and wider MDT teams. You will demonstrate advanced skills in the management of communication and swallowing disorders in younger adults with complex neurological conditions, as well as competence in instrumental assessment and tracheostomy. You will act as a keyworker to patients and their families requiring skills in diplomacy, negotiation and problem solving.&lt;/p&gt;\n&lt;p&gt;You will be based on the Regional Hyper-acute Rehabilitation Unit (RHRU) at Northwick Park Hospital joining a team of 3 SLT’s plus rehabilitation assistants. The RHRU is a 24-bed tertiary service which caters for young adults with severe complex neurological disability. It operates over a supra-regional area with a population in excess of 5 million. It is a highly specialised service forming the hub of the NW Thames region rehabilitation network. There is strong multi-disciplinary team working and service delivery is patient centered with a goal setting approach.&lt;/p&gt;\n&lt;p&gt;The RHRU SLT team has close links with the larger department of Speech and Language Therapists . The RHRU is dedicated to providing regular in-service training sessions, a formal appraisal system and continuing professional development plans, plus regular supervision, support and opportunities for internal and external training.&lt;/p&gt;\n&lt;p&gt;For further information please contact Katrina Clarkson, Principal Speech and Language Therapist (kclarkson@nhs.net, 020 8869 2807) or Hilary Rose, Head of Therapies (hilaryrose@nhs.net, 020 8869 2809).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatrina ClarksonJob titlePrincipal Speech and Language TherapistEmail addresskclarkson@nhs.netTelephone number020 8869 2807Additional contact information&lt;/p&gt;\n&lt;p&gt;Hilary Rose, RHRU Head of Therapies&lt;/p&gt;\n&lt;p&gt;02088 869 2809&lt;/p&gt;\n&lt;p&gt;hilaryrose@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Principal Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231658", "validThrough": "2020-11-08T23:59:59+0000"}