{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T09:00:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are an enthusiastic and highly motivated Registered Nurse (level 1) with excellent communication and leadership skills, who has a proven interest in disorders of the endocrine system, then this is the vacancy for you.&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity to join the busy Endocrinology Team based at York Teaching Hospital. You will work alongside the Senior Endocrine Specialist Nurse and the wider multi-disciplinary team, as well as being responsible for the management of a defined caseload which will include patients with complex medical conditions.&lt;/p&gt;\n&lt;p&gt;You will need to be able to motivate and lead others and act as an effective role model. The ability to be flexible, creative and adaptable are key personal attributes.&lt;/p&gt;\n&lt;p&gt;Candidates will be expected to be able to demonstrate knowledge and awareness of the current clinical and professional issues affecting people with complex disorders of the endocrine system, incorporating high quality evidence in patient centred care. Additionally, you will demonstrate competency in teaching (patients and healthcare professionals), supervision of team members and sharing good practice.&lt;/p&gt;\n&lt;p&gt;Experience of working in multi-disciplinary teams is essential for this post.&lt;/p&gt;\n&lt;p&gt;We would strongly encourage anyone interested in this exciting opportunity to contact us on the number below to discuss the wider aspects of this role.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name: Ottilia Buch&lt;/p&gt;\n&lt;p&gt;Job title: Senior Endocrine Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Email address: ottilia.buch@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: (01904) 726807&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Endocrine Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253207", "validThrough": "2020-11-16T23:59:59+0000"}