{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T08:16:46+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic Respiratory Physiologist within the Lung Function Department at the Newcastle upon Tyne NHS Trust. The Lung Function Department provides a service within the Cardiothoracic Centre at the Freeman Hospital and also the New Victoria Wing and the Great North Children’s Hospital at the Royal Victoria Infirmary. &lt;br /&gt;&lt;br /&gt;We are looking to recruit a suitably qualified and experienced individual to the post of Specialist Respiratory Physiologist. Applicants must be fully competent in a wide range of Lung Function tests including flow volume loops, plethysmography, respiratory muscle assessments, six minute walk tests, hypoxic challenge and anatomical shunt tests. They should have a good working knowledge of setting up and interpretation of diagnostic sleep studies and CPAP treatment. They must have availability for out of hours work for the setting up of diagnostic sleep studies and continuous positive airway pressure. Applicants should have the knowledge to undertake cardiopulmonary exercise testing&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to take on specific responsibilities within the department, including the training and supervision of junior staff. The post holder must have excellent communication skills with both patients and staff and experience of working in a busy department would also be beneficial. The ability to work as part of a team and on your own initiative is essential.&lt;/p&gt;\n&lt;p&gt;All applicants must hold a BSc in Clinical Physiology including ARTP Part 1 and 2 or have equivalent qualifications or experience. RCCP registration is desirable. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Full time - 37 hours 30 minutes/week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Peter Close&lt;/p&gt;\n&lt;p&gt;Head of Lung Function Department&lt;/p&gt;\n&lt;p&gt;email: peter.close@nuth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01912448201&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Specialist Respiratory Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251312", "validThrough": "2020-11-08T23:59:59+0000"}