{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-06T10:16:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like the opportunity to work in a progressive, ward based and patient focused Pharmacy service?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and innovative pharmacist to join our Pharmacy Team at Musgrove Park Hospital, Taunton to work with lead clinical pharmacists in the provision and ongoing development of a comprehensive clinical pharmacy service to key specialities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want a key role that will support the development of skills in specialised areas whilst still allowing that important work-life balance?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This key role will provide the opportunity to develop clinical pharmacy skills in a variety of specialist areas including antimicrobial stewardship/ infection management, anticoagulation, critical care, acute admissions and cancer services.&lt;/li&gt;\n&lt;li&gt;You will deputise for the lead clinical pharmacists in their absence and will be offered the opportunity to develop a prescribing role in a speciality area that interests you&lt;/li&gt;\n&lt;li&gt;You will support a team of pharmacists, technicians and assistants acting as an exemplar in the provision of clinical pharmacy services and medicines optimisation.&lt;/li&gt;\n&lt;li&gt;You will be involved in measuring key performance indicators to ensure the continued development and sustainability of our high quality clinical pharmacy service.&lt;/li&gt;\n&lt;li&gt;Our department works specific times and as such we can offer you the work-life balance you deserve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work for an impressive pharmacy department, where the service design allows you to spend more time using your clinical skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our purpose built pharmacy department is modern and spacious and our automated dispensary and lean service design means you will spend more time using your clinical skills. A user friendly, electronic prescribing and medicines administration system is in place throughout the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a UK registered Pharmacist with, or actively undertaking, a postgraduate diploma in Clinical Pharmacy.&lt;/p&gt;\n&lt;p&gt;You will ideally have demonstrable hospital pharmacy experience delivering clinical pharmacy practice with experience of general medicine and surgery. Previous experience of training and mentoring pharmacy staff would also be an advantage.&lt;/p&gt;\n&lt;p&gt;We have the flexibility to offer this role at Band 6 or Band 7 dependent on experience so if you are interested in the position, and would like to discuss it further in relation to your personal level of experience, then please do get in touch!&lt;/p&gt;\n&lt;p&gt;Antony Zorzi&lt;/p&gt;\n&lt;p&gt;Job title Clinical Pharmacy Manager and Deputy Chief Pharmacist&lt;/p&gt;\n&lt;p&gt;Email address antony.zorzi@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01823342260&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Specialist Clinical Pharmacist (Band 6/7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259160", "validThrough": "2020-11-17T23:59:59+0000"}