{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum Incl"}}, "datePosted": "2020-11-03T18:30:26+0000", "description": "&lt;p&gt;Wheelchair Service Occupational Therapist or Physiotherapist&lt;br /&gt;Hours: Full time/Part time&lt;br /&gt;Working in South West London&lt;br /&gt;&lt;br /&gt;An opportunity for an experienced, enthusiastic and motivated Occupational Therapist or Physiotherapist to gain experience working within our friendly wheelchair service team in south west London. You could be a band 5 looking to progress to a Band 6 post, or a Band 6 looking to develop new skills. You would join our multidisciplinary team of 16 Occupational Therapists, Physiotherapists, Rehabilitation Engineers, and Administrators which is supported by a well-established wheelchair user group. &lt;br /&gt;You will assess clients of all ages in their own homes, other environments in the community, e.g. special schools and day centres and in clinics at Queen Mary’s Hospital, Roehampton.&lt;br /&gt;You will have excellent opportunities to develop your clinical skills in postural and mobility assessment and related equipment prescription. With supervision you will be responsible for assessing for and prescribing paediatric buggies, standard and active user wheelchairs, specialist wheelchairs, powered wheelchairs, associated postural seating and participate in bespoke seating assessments. &lt;br /&gt;Previous wheelchair service experience is not required but a clinical background in either neurology, paediatrics or community work would allow you to utilise your existing skills. &lt;br /&gt;The wheelchair services are commissioned by 6 CCG’s across SW London and is responsible for approximately 8500 clients.&lt;br /&gt;We are looking for a candidate who has the flexible but well organised approach that is required to meet the varied needs of our client group.&lt;br /&gt;Car owner driver essential. &lt;br /&gt;&lt;br /&gt;The service is committed to continuing professional development. The successful applicant will be given regular support, training, clinical supervision and will participate in in-house training sessions.&lt;/p&gt;\n&lt;p&gt;Interview Date- TBC&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous Applicants advised not to reapply&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lesley Clarridge - Team lead for the Wheelchiar Service and Mary Saunders - Clinical Lead &amp; Mary SaundersTeam Lead Wheelchair Service&lt;/p&gt;\n&lt;p&gt;Queen Mary’s Hospital&lt;br /&gt;Roehampton Lane&lt;br /&gt;London &lt;br /&gt;SW15 5PN&lt;br /&gt;Tel: 020 8487 6084/5&lt;br /&gt;Email: mary.saunders@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Mary&#39;s Hospital, Roehampton, SW15 5PN, London", "postalCode": "SW15 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4555", "longitude": "-.241721"}}, "title": "Wheelchair Service Occupational Therapist or Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254991", "validThrough": "2020-11-24T23:59:59+0000"}