{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 Plus HCA"}}, "datePosted": "2020-11-06T11:01:06+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within West Essex CCG for an experienced and enthusiastic Assistant Director of Nursing &amp; Quality. WECCG is responsible for commissioning high quality health services for a population of approximately 315,000 people. We work closely with health and car partners, local government, regulatory bodies, voluntary and carer groups, patient representatives and the general public to achieve the best outcomes possible and to ensure high quality, safe and effective services.&lt;/p&gt;\n&lt;p&gt;We are looking for an exceptional candidate, who can provide strong, visible leadership and who has a track record of delivering outcomes to improve patient safety and experience. Applicants must be a registered nurse, midwife or health visitor, with excellent knowledge of quality assurance, improvement and change management. You must have strong leadership experience and skills, be a strategic thinker and be skilled in communicating, analysing information, problem solving and decision making.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work with a range of providers, professionals, service users and stakeholders across a range of settings and will need strong communication skills and an ability to work with information and drive change at pace. Innovative and dynamic in your approach you will be skilled at building relationships at all levels and able to support and motivate staff. You can demonstrate a high level of interpersonal and communication skills, including the application of tact and diplomacy in challenging situations.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to lead the CCG Quality and Nursing team, providing support for senior team members and also working with and advising other CCG colleagues, deputising for the Deputy Director of Nursing &amp; Quality when required.&lt;/p&gt;\n&lt;p&gt;The post holder will be able to access support and appropriate training and development opportunities in line with the post.&lt;/p&gt;\n&lt;p&gt;In return you will be supported to develop both professionally and personally and be part of a caring and inclusive team. If you feel you have the necessary skills and expertise and the values we are looking for – we would be delighted to hear from you.&lt;/p&gt;\n&lt;p&gt;If you would like an informal discussion please contact Jane Kinniburgh Director of Nursing and Quality or David Wallace, Deputy Director of Nursing and Quality&lt;/p&gt;\n&lt;p&gt;jane.kinniburgh@nhs.net&lt;/p&gt;\n&lt;p&gt;dwallace1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Essex Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128375"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "WECCG, St Margaret&#39;s Hospital, Epping", "postalCode": "CM16 6TN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7043", "longitude": ".123957"}}, "title": "Assistant Director of Nursing &amp; Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259338", "validThrough": "2020-11-20T23:59:59+0000"}