{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "60000", "unitText": "YEAR", "value": "Up to £60,000 + £3,633 ILW"}}, "datePosted": "2020-10-30T14:07:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Turning Point is a leading Social Enterprise which supports people with a wide range of complex needs across Learning Disabilities, Mental Health, Substance Misuse and Public Health. We are currently recruiting for a Clinical Services Lead to work in our Integrated Substance Misuse Service as a Clinical Services Manager, where you’ll have the chance to make a real difference to the lives of the people we support who are experiencing difficulties from drugs and alcohol usage.&lt;/p&gt;\n&lt;p&gt;Passionate about people, you’ll enjoy the opportunity and support to enhance your own life and career too, as you gain the experience and training you need to progress in your career within a social enterprise. So if you’re ambitious and ready for a fresh challenge with a sector leader then this could be the opportunity for you.&lt;/p&gt;\n&lt;p&gt;Running health and social care services as a social enterprise, we invest every penny back into our care – and our people. So, if you’re ambitious and ready for a fresh challenge, progress your career with a sector leader.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Clinical Services Manager, your vital role will involve a wide range of clinical duties, managing the prescribing and wellbeing clinics, completing audits and ensuring safeguarding. You will also take the lead for aspects of the clinical governance of the service and some key performance indicators. You will lead your team to deliver the same high standards that you do, by providing clinical supervision to nurses, completing appraisals, delivering training and of course, ensuring that all they do is in line with the clinical code of conduct.&lt;/p&gt;\n&lt;p&gt;You will have a real opportunity to help shape service delivery and contribute to delivering clinically excellent services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An inspiring role model, we&#39;ll expect you to already be a senior nurse with clinical experience in a drug and alcohol setting. Building relationships with colleagues, commissioners and service users alike will be a big part of what you do, we’re also looking for a Clinical Services Manager who can confidently engage and influence people.&lt;/p&gt;\n&lt;p&gt;A working knowledge of safeguarding, substance misuse issues and legislation is key – as is the ability to recognise indicators of substance misuse and the issues that service users might face. NMC registered with an active PIN.&lt;/p&gt;\n&lt;p&gt;In addition to the above we are seeking to appoint an individual who can also bring Turning Point’s core values to the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We believe that everyone has the potential to grow, learn and make choices&lt;/li&gt;\n&lt;li&gt;We all communicate in an authentic and confident way that blends support and challenge&lt;/li&gt;\n&lt;li&gt;We are here to embrace change even when it is complex and uncomfortable&lt;/li&gt;\n&lt;li&gt;We treat each other and those we support as individuals however difficult and challenging&lt;/li&gt;\n&lt;li&gt;We deliver better outcomes by encouraging ideas and new thinking&lt;/li&gt;\n&lt;li&gt;We commit to building a strong and financially viable Turning Point together&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration Renewal fee paid for&lt;/li&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from&lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;33 days’ paid holiday a year, increasing with each year of service up to 35 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central London", "postalCode": "W1D 6QR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5116", "longitude": "-.132082"}}, "title": "Clinical Services Manager - DAWS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250478", "validThrough": "2020-11-30T23:59:59+0000"}