{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503"}}, "datePosted": "2020-10-15T12:18:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a Health Professional interested in a new career within Primary Care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for Physicians Associates to work within our Central and West Primary Care Newteork AND our North East Primary Care Network.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;The Central and West&lt;/strong&gt;&lt;/span&gt; Locality Locality Primary Care Network is a collective group of General Practices based in the central and West side of the Island.&lt;/p&gt;\n&lt;p&gt;C&amp;W Primary Care Netowrk comprises of three practices:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Newport Health Centre&lt;/li&gt;\n&lt;li&gt;Cowes Medical Centre&lt;/li&gt;\n&lt;li&gt;Wight Primary Partnership Ltd, Freshwater&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The practices cover the largest geographical area on the Island measuring 16,508 hectares; almost half of the total area and a total population of 49,832; almost two-fifths of the total population.&lt;/p&gt;\n&lt;p&gt;The area includes the seaside towns of Freshwater, Yarmouth, and Cowes as well as the more densely populated, main town of Newport, the Island’s administrative centre. The locality has the lowest percentage of unemployment at 3.7% but the highest proportion of those claiming out-of-work benefits. There are several areas of deprivation within the locality, notably in Newport (Pan) with some of the highest figures on the Island for children living in poverty. At the same time, other parts of the locality such as the towns of Brighstone, Calbourne, Gurnard, and parts of Carisbrooke, Northwood and Cowes are among the least deprived.&lt;/p&gt;\n&lt;p&gt;Its population profile mirrors that of the Island, but this varies considerably across the locality, with areas of the West Wight having an older population profile compared to, for example, parts of Newport in particular Pan. Perhaps surprisingly given its population profile, the locality has the lowest number of residents with a long-term illness or disability (21.7%).&lt;/p&gt;\n&lt;p&gt;Within our network, we share approximately 43,000 patients and although each of our practices has its own unique identity, by working together we strive to provide the best possible patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;North East Locality&lt;/span&gt; &lt;/strong&gt;&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The North East Locality comprises six practices:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Tower House Surgery, Ryde&lt;/li&gt;\n&lt;li&gt;The Esplanade Surgery, Ryde&lt;/li&gt;\n&lt;li&gt;Argyll House Surgery, Ryde&lt;/li&gt;\n&lt;li&gt;East Cowes Medical Centre&lt;/li&gt;\n&lt;li&gt;St Helen&#39;s Surgery, St Helen’s&lt;/li&gt;\n&lt;li&gt;Medina Healthcare, Wootton Bridge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The North East PCN covers approximately 19% of the Isle of Wight’s total area and a population of 53,342 making it the most densely populated locality. The area offers a mix of urban and rural areas including the major gateway towns of Ryde and East Cowes.&lt;/p&gt;\n&lt;p&gt;Its population profile mirrors that of the wider population, with a higher proportion of older people.  Around 22.5% of people living in the North West Locality have a long-term illness or disability. The locality also has the highest rate of unemployment at 4.83% and contains several areas of deprivation but, conversely, parts of the area are also home to many second homeowners. This population profile presents a varied opportunity for healthcare professionals seeking new roles and all within easy commuting distance from the mainland or for those considering a move to the Island.&lt;/p&gt;\n&lt;p&gt;The network is well resourced both in terms of GPs and a wide range of different practitioners operating within and across the practices including Advanced Nurse Practitioners and shared roles like Paramedics, providing a patient visiting service, and Clinical Pharmacists.  The practices also share flu clinics in the Ryde area and phlebotomy services and work to empower patients and their carers to improve their physical and mental wellbeing&lt;/p&gt;\n&lt;p&gt;Together the practices within the network have embraced innovation, working on a number of initiatives to improve patient care including setting up the first Primary Care Mental Health practitioner model on the Island.  This involves mental health practitioners working in practice to support patients, working in partnership with secondary care and with peer support from the Isorropia Foundation – a specialist mental health community interest company working on the Island.  The initiative has been a great success for patients and professionals alike and is now being rolled out across the Island.&lt;/p&gt;\n&lt;p&gt;The member practices within the network work as a cohesive team to provide high quality medical services for their local community and together share learning and provide mutual support.  They work collaboratively with neighbouring networks and with other health partners to deliver holistic services based around the needs of the community and individual patients.&lt;/p&gt;\n&lt;p&gt;Dr Jo Hesse, Clinical Director said: “We are a vibrant and varied group of practices that work together to better the services we offer our patients, and to support each other. We are innovative, hard- working and provide opportunities for clinical leadership. We look forward to welcoming you to our team.”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re keen to work with individuals to find a career that’s just right for them!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Physician Associate &lt;/strong&gt;role is a new role introduced under the Additional Roles Reimbursememnt Scheme (ARRS) for Primary Care. Please review the attached Job description for further information specific to the role.&lt;/p&gt;\n&lt;p&gt;We are looking for multiple roles  - with permamnent and fixed term opportunities available.&lt;/p&gt;\n&lt;p&gt;Relocation support may also be available for the successful candidates.&lt;/p&gt;\n&lt;p&gt;If you are committed to using your skills to improve the lives of our patients and join our supportive teams, we may just have the perfect opportunity for you!&lt;/p&gt;\n&lt;p&gt;DO YOU…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;strive to use your skills to improve the lives of patients and join our supportive teams&lt;/li&gt;\n&lt;li&gt;want to be part of a new programme to improve peoples’ health?&lt;/li&gt;\n&lt;li&gt;want to work in a supportive and pro-active multi-disciplinary team delivering personalised and holistic care?&lt;/li&gt;\n&lt;li&gt;want fantastic work/life balance on the Isle of Wight which offers a fantastic lifestyle and affordable housing?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If the answer if ‘YES’ to any of the above, we’re waiting to hear from you!&lt;/p&gt;\n&lt;p&gt;*Please note, this role will require travel between practices within our locality site and a full, current UK driving and use of a car will be required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 4BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6415", "longitude": "-1.39617"}}, "title": "Physician Associate - Primary Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228135", "validThrough": "2020-11-27T23:59:59+0000"}