{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24, 157 per annum"}}, "datePosted": "2020-10-30T12:16:42+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic, reliable and committed individual to join a team of Medical Secretaries based at Lister to cover the General Surgery department.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate that has excellent communication and organisational skills and has the ability to work to tight timescales. The successful candidate must have excellent interpersonal skills, dedication and the confidence to deal with a wide range of matters with tact and diplomacy. An understanding of the NHS is essential, together with advanced IT skills, proven experience of using a word processing package (preferably Microsoft Word) and excellent keyboard skills. AMSPAR qualification would be an advantage. As a member of the secretarial team you will be working closely with medical, nursing and managerial staff. The role involves the co-ordination of Consultant activity and the management of their administrative workload as well as ensuring the timely management of typing workload.&lt;/p&gt;\n&lt;p&gt;In return, we offer a friendly, supportive and dedicated working environment. We actively support staff development and training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Samantha Biggs  Service Coordinator General, Vascular and Breast Surgery    01438 284820&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Medical PA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250127", "validThrough": "2020-11-13T23:59:59+0000"}