{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31939", "minValue": "31939", "unitText": "YEAR", "value": "£19 per hour"}}, "datePosted": "2020-11-02T11:29:12+0000", "description": "&lt;p&gt;We are seeking friendly, enthusiastic and motivated Mammographers to join our Radiology team on Nuffield Health, Leicester Hospital’s Bank. The role would be to cover our breast clinic service which usually takes place on Wednesdays and Fridays from 5pm.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health Leicester Hospital&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Founded in 1969, Nuffield Health Leicester Hospital was originally built from funds raised by the local community and is now one of the leading providers of private healthcare in Leicestershire. The Hospital has a strong local reputation with patients remaining loyal. The Hospital had a £4.5 million refurbishment in 2011 and was the blue print for the wider Hospitals refresh programme.&lt;br /&gt;The Hospital has 37 ensuite inpatient beds, 2 Laminar flow theatres, Endoscopy Suite, minor treatment room and 14 consulting rooms. The hospital delivers a wide variety of inpatient and outpatient treatments and services using the best possible technologies. Since 2015 we have invested in a static MRI unit, a new digital X ray room &amp; digital mammography. We are a local centre of excellence for Children and Young People Services. Having a Fitness &amp; Wellbeing Gym in Leicester has led to a close working relationship and the Hospital was a forerunner for the Nuffield recovery plus programme.&lt;br /&gt;&lt;br /&gt;The Hospital has been rated as a ‘Good’ hospital by the CQC and achieved this rating across the 5 key lines of enquiry across all departments inspected. We are particularly proud of the ‘Outstanding’ in the caring domain for the Children and Young People’s service.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our small Radiology Department, with its state-of-the-art technology, enjoys a friendly, dedicated and multi-disciplinary team which is committed to delivering high quality diagnostic imaging, through a range of radiographic procedures.&lt;br /&gt;The successful candidates will have the ability to work within a team whilst also being able to use their own initiative and work independently.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;DCR or BSc in Diagnostic Radiography&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Current HCPC registration&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Certificate of competency in mammography and post qualification experience&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate:&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent customer service skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A high level of accuracy and attention to detail&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good computer literacy&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexibility and adaptability to meet the changing needs of the business&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our Pension Scheme.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - Up to £19 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location - Leicester Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Bank contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Working on the bank means you are not contracted to a set number of hours per week but instead work on an ad-hoc basis to suit the needs of the business and your availability.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE5 1HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6439", "longitude": "-1.07144"}}, "title": "Bank Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251776", "validThrough": "2020-11-30T23:59:59+0000"}