{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44240", "minValue": "36329", "unitText": "YEAR", "value": "CS SEO £36,329-£44,240 / AfC Band7 £38,890-£44,503"}}, "datePosted": "2020-11-05T16:31:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Number: &lt;/strong&gt;919-RR-35205058-EXTHPP2&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Health Protection Practitioner&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Places and Regions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; Harlow Office/Mildenhall Office/ Cambridge/ Virtual Health Protection Team, PHE East of England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Agenda for Change band 7 - £38,890 - £44,503 or Civil Service grade SEO - £36,329 – £44,240&lt;/p&gt;\n&lt;p&gt;*A High Cost Area Supplement may be payable to those appointed on Agenda for Change terms but is dependent on contractual base.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; A number of positions are available for individuals able to work over and above 0.6wte&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; 12 months fixed term contract with scope for extension or permanency&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: &lt;/strong&gt;19.11.2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;TBC&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute of Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate consultation prior to any formal transfer taking place.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are currently recruiting to a number of fixed term posts to support the expansion of our Health Protection Team in the East of England specifically working on our response to COVID-19 and our test and trace programme.&lt;/p&gt;\n&lt;p&gt;The roles are available on fixed term/secondment arrangement and will be supporting the service during a time of heightened activity supporting our COVID-19 Incident Response.&lt;/p&gt;\n&lt;p&gt;This is an interesting opportunity to gain experience working as a Health Protection Practitioner at a very busy and important time. While we are working hard to control and prevent the spread of COVID-19, while continuing to prevent and control the spread of other communicable diseases, post holders will work with a range of public and private sector agencies and be involved in the prevention, surveillance, investigation and control of infection, environmental hazards and other components of health protection within the community.&lt;/p&gt;\n&lt;p&gt;These posts may include participation in the out of hours health protection on-call rota after a period of training and assessment (with reimbursement). Our service is currently running 7 days per week, 9am – 6pm to support the national response to covid-19 and therefore some weekend work will be required.&lt;/p&gt;\n&lt;p&gt;You will be a good communicator, able to work in a team and be prepared to take on responsibility, as appropriate. Experience of working within in a community health related setting would be viewed as advantageous. Applicants should also be able to provide evidence of further professional development.&lt;/p&gt;\n&lt;p&gt;While we can be flexible to accommodate hours worked, we are particularly interested in people that are able to work &lt;strong&gt;0.6 wte&lt;/strong&gt; and above&lt;strong&gt; which will include some weekend work as part of your standard hours&lt;/strong&gt;. It is also important to note that although many of these posts will eventually become virtual and allow for flexible bases, initially staff will be expected to attend induction, training and general onboarding at our Fulbourn offices, the roles will initially be based at out Fulbourn offices moving to virtually working for fixed term contract staff,&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;These roles will be initially fixed term, however there may be opportunities to extend contracts or transition to permanent opportunities as they become available subject to Civil Service Commission Recruitment Principles.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Selection interviews will comprise of two sections held by separate panels; the first will be a competency-based interview related to the essential technical skills required for the post of SHPP. The second section will assess behaviours as set out in the PHE People Charter. Assessment from each panel will be used to select successful applicants in strict merit order.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Please be aware that at this time interviews may take place using skype or by video conference. We will aim to give you a minimum of 5 days’ notice before inviting any candidate for interview but please be aware that this may not be possible, and interviews may have to be changed at short notice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Successful candidates not offered a posting will be placed on the reserve list which will be held for 12 months. The reserve list will be used to offer future vacancies. These further posting offers will also be made in strict merit order. The reserve lists may also be used to offer future vacancies not necessarily restricted to the current posts included in the advert. They may also extend to similar vacancies which arise across the wider PHE network. Any such offers would be made in strict merit order to all candidates remaining on the reserve list. The location and job role would be fully explained to you. Refusal of the offer would not change your reserve list position.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Option 3 – External&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Ring fence&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy falls within the clinical ring fence pool of post within Public Health England. Therefore suitable qualified clinical applicants will be employed on NHS terms and conditions and will be able to join the NHS pension.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the posts, please contact Tracy Mann, Public Health Workforce Development Manager on 0300 303 3537 or Olabisi Williams, TBCB Programme Manager on 01223 723244.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow Office/Mildenhall Office/ Cambridge/ Virtual Health Protection Team, PHE East of England, Harlow Office/Mildenhall Office/ Cambridge/ Virtual Health Protection Team, PHE East of England", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Health Protection Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258571", "validThrough": "2020-11-19T23:59:59+0000"}