{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa incl HCAS"}}, "datePosted": "2020-10-30T15:16:21+0000", "description": "&lt;p&gt;Ealing Hospital is part of London North West University healthcare NHS Trust. It is a busy district hospital providing a range of clinical services. Recently the NHS Commissioners and providers in north west London have decided to draw the Shaping a Healthier Future programme to a conclusion. This means that there is currently no plan to close or downgrade Ealing A&amp;E services for the foreseeable future.&lt;/p&gt;\n&lt;p&gt;LNWH NHS Trust pioneers innovative perioperative practice. Recently our Orthopaedic team celebrated the completion of their 100th procedure using robotic surgery for knee replacement. We also commenced robotic surgery in gynaecological surgery.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic and committed individual to join our theatre team as a &lt;strong&gt;Band 5 nurse/practitioner. You will have opportunities to work through our tailored in-house competency based programmes in surgical scrub as well as in anaesthetics support team rotation in Ealing Hospital Theatre. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have five theatre suites with 24 hours Cepod /Trauma service, general surgery, dental and gynaecology surgery. We have a tradition of excellence and our vision is simple, to provide a gold standard in perioperative practice, and invest in you the people who deliver care.&lt;/p&gt;\n&lt;p&gt;The post holder must be a registered nurse or registered ODP with some experience in theatres as well as a good communicator and team player. The role will involve working collaboratively under supervision initially with all the theatre and the peri-operative team to ensure quality, safe and efficient care is delivered to our patients with HEART value.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to support the day to day delivery of anaesthetic and theatre service. You will also take part to create a conducive learning environment to all staff, students/ trainee ODPs in collaboration with the Team Leads and the Peri-operative Education Team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandy Young: 07796705831&lt;/p&gt;\n&lt;p&gt;Julie Aye: 07788388091&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Hospital, London", "postalCode": "UB1 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.507", "longitude": "-.346317"}}, "title": "Theatre/Anaesthetic Practitioner - Theatres", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250717", "validThrough": "2020-11-15T23:59:59+0000"}