{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36644", "minValue": "28050", "unitText": "YEAR", "value": "£28,050 to £36,644 per annum, pro rata"}}, "datePosted": "2020-11-02T10:32:27+0000", "description": "&lt;p&gt;Are you a pharmacist looking for an exciting new challenge? Do you want to be an integral part of a busy acute Trust that is delivers outstanding compassionate care to our communities? If your answers are yes, we have the perfect opportunity for you to join our pharmacy team.&lt;/p&gt;\n&lt;p&gt;We are looking for bank pharmacists to support the delivery of the Clinical Pharmacy service across Huddersfield Royal Infirmary and Calderdale Royal Hospital . This is an extremely exciting time to join our pharmacy team, as we have the Cerner Millennium Electronic Patient Record Trust wide, and we can now embrace the opportunity to develop innovative ways of working that our technology supports.&lt;/p&gt;\n&lt;p&gt;On a daily basis you will deliver ward based services as part of a team of supportive colleagues, ensuring that our patients have access to safe and effective medications from admission to discharge and beyond. You will also act as responsible Pharmacist in one of our two inpatient dispensaries on a rota basis throughout the week. Experience in a range of medical and surgical specialities will be provided.&lt;/p&gt;\n&lt;p&gt;You will need to be able to manage your time, prioritise tasks effectively, be proactive and communicate well with your colleagues to ensure that we deliver an excellent service together as a team.&lt;/p&gt;\n&lt;p&gt;How will we help you develop in your role? We will support you with an induction to the department, alongside a range of e-learning opportunities provided as part of your Trust training and development, and as part of our experienced team of Clinical Pharmacists you will have the opportunity to develop your knowledge and skills with support from your colleagues. Previous hospital experience is not essential, we welcome applications from driven pharmacists working in other sectors who would like to explore a career in secondary care.&lt;/p&gt;\n&lt;p&gt;We require a 4 week period of commitment for induction, training and competency assessment before flexing working hours around the needs of the department.&lt;/p&gt;\n&lt;p&gt;You may be asked to take part in our weekend rota and bank holiday rota. All posts in the organisation are subject to a probationary period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona smithAdditional contact information&lt;/p&gt;\n&lt;p&gt;Fiona Smith&lt;/p&gt;\n&lt;p&gt;Deputy Clinical Director Pharmacy&lt;/p&gt;\n&lt;p&gt;Fiona.smith1@cht.nhs.uk&lt;/p&gt;\n&lt;p&gt;01422 224920&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield Royal Infirmary, Huddersfield", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Flexible Workforce Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251609", "validThrough": "2020-11-16T23:59:59+0000"}