{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-29T16:45:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist - Learning Disabilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In Birmingham, we have about 24,000 people who have a learning disability. In our fast-paced day-to-day lives, many of them face challenges with daily living and being an active member in society. At Learning Disabilities, we are looking for 3 Consultant Psychiatrists to partner with us and make a difference for our patients.&lt;/p&gt;\n&lt;p&gt;Birmingham was named by the Rough Guide as one of the top ten cities in the world as an excellent place to live. Birmingham Community healthcare Trust is one of the City&#39;s biggest employers. As the UK’s second city, we are the city with the youngest population and more canals than Venice. It has excellent transport links, world-class sport and entertainment. We are also leading the way in UK for 5G. The city is a regional centre for shopping and leisure. We have a rich diverse community and have become a popular dining destination from award winning street food to Michelin Star cuisine.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust provides high quality, accessible and responsive community and specialist services within Birmingham and the West Midlands. We deliver over 100 clinical services, out in people’s homes and in over 300 hospitals, health centres and clinics. We provide services for adults, children, people with learning disabilities, those with rehabilitation needs and also dental services.&lt;/p&gt;\n&lt;p&gt;The post holder will join 8 other consultant psychiatrists, working in multidisciplinary teams to meet the specialist healthcare needs of our service users.&lt;/p&gt;\n&lt;p&gt;As a service, our community focus coupled with expansion of established community forensic and intensive support teams leave us well placed to meet the challenges arising from the Transforming Care agenda. We welcome applications from clinical leaders who are motivated to support the multidisciplinary team in the delivery of excellent and innovative care for the population that we serve.&lt;/p&gt;\n&lt;p&gt;Our service users have said the following things;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Lovely place and staff, helpful, friendly, nothing too much trouble”.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“H. was funny and she listened to my son. She helped him to sign. H. was most helpful to us because she also pointed us in the right direction. There was genuine insight into my son’s problems. Her report was concise and explained everything for other agencies to see. Thank you”.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I liked the storyboard that was made for me about change”&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;Come and join our Psychiatry team in providing services to the Adult Learning Disability population in Birmingham. Let’s partner together and make a difference for our service users.&lt;/p&gt;\n&lt;p&gt;Further details are contained in the attached Job Description.&lt;/p&gt;\n&lt;p&gt;Interview date 3rd December 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Tonye SikaboforiJob titleDivisional Medical Director - Learning DisabilitiesEmail addressTonye.Sikabofori@BHAMCommunity.nhs.ukTelephone number0121 466 3900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central Hub, Birmingham", "postalCode": "B10 9JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4733", "longitude": "-1.83514"}}, "title": "Consultant Psychiatrist - Psychiatry of Intellectual Disability", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249138", "validThrough": "2020-11-23T23:59:59+0000"}