{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16625", "minValue": "16625", "unitText": "YEAR", "value": "£9.89 per hour + enhancements"}}, "datePosted": "2020-10-23T16:01:45+0100", "description": "&lt;p&gt;Healthcare Assistants (Nights)&lt;/p&gt;\n&lt;p&gt;£9.89 per hour + enhancements&lt;/p&gt;\n&lt;p&gt;Various part time hours available - 144 hours per month &amp; 81 hours per month&lt;/p&gt;\n&lt;p&gt;Vale of York Planned Service&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November (subject to change)&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;As a Healthcare Assistant with Marie Curie, you&#39;ll be there for people in their time of greatest need. We provide free specialist support and care to patients with terminal illnesses whilst offering vital emotional support for their families. It&#39;s all about giving them the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;/p&gt;\n&lt;p&gt;With experience of End of Life care, you&#39;re ready and able to make a real difference. Ours is a one-to-one approach to care, so you&#39;re sure to enjoy plenty of meaningful contact with patients and their families - in their own homes. Working without close supervision, you&#39;ll have the opportunity to use your own initiative in line with the patient&#39;s established care plan.&lt;/p&gt;\n&lt;p&gt;You&#39;ll be required to carry out a range of duties including monitoring symptoms, helping to assist with medications, undertaking simple dressing and continence care, and keeping detailed records. You&#39;ll also help patients to meet their hygiene and dietary needs.&lt;/p&gt;\n&lt;p&gt;We expect successful candidates to start with us in January 2021.&lt;/p&gt;\n&lt;p&gt;Please note: This role is to work nights.&lt;/p&gt;\n&lt;p&gt;You will be joining a friendly and caring team, who consistently provide excellent on-going training and support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To join our dedicated, caring team, you&#39;ll need an S/NVQ Level 2/3 qualification or an equivalent certificate/diploma and relevant up to date experience in the palliative care setting.&lt;/li&gt;\n&lt;li&gt;Emotional strength and the ability to work on your own are crucial along with excellent communication skills.&lt;/li&gt;\n&lt;li&gt;We expect you to have a talent for forging strong empathetic relationships with all kinds of people, whilst providing palliative care.&lt;/li&gt;\n&lt;li&gt;Due to the nature of the role a flexible approach is essential, you must be able to drive and have access and use of a car. It is also essential that you have access to a computer and the internet.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued access to NHS Pension Scheme (subject to eligibility)&lt;/li&gt;\n&lt;li&gt;Marie Curie Group Personal Pension Scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Loan schemes for bikes; computers and satellite navigation systems&lt;/li&gt;\n&lt;li&gt;Continuous development&lt;/li&gt;\n&lt;li&gt;Industry leading training programmes&lt;/li&gt;\n&lt;li&gt;Employee AssistanceProgramme &lt;/li&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information or an informal chat please contact our Clinical Nurse Manager, Sara Garner on 07 515 135 279 or our Senior Nurse, Charlotte Grainger on 07 515 133 755&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Every day of your life matters – from the first to the last. When you work for Marie Curie, you understand that better than ever. We’re a passionate, committed and diverse team of more than 4,400 staff and 12,000 volunteers, here for people living with any terminal illness, and their families.&lt;/p&gt;\n&lt;p&gt;Marie Curie is committed to its values, which underpin our work.  We take stringent steps to ensure that the people who join our organisation through employment or volunteering, are suitable for their roles and are committed to safeguarding all our people from harm. This includes our staff, volunteers and all those who use orcome into contact withour services. We are dedicated to creating not just a safe place to work but also a supportive and rewarding one.&lt;/p&gt;\n&lt;p&gt;We arecommitted to a world where everyone can thrive and fulfil their potential. We are devoted to the social justice imperatives and organisational benefits of full diversity, inclusion and equity in the workplace, and are a Stonewall champion. We actively encourage and welcome applications from candidates of diverse cultures, perspectives and lived experiences.&lt;/p&gt;\n&lt;p&gt;This role will be subject to receiving a satisfactory Enhanced criminal record check.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this vacancy early.  Agencies need not apply.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Marie Curie", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129502"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vale of York", "postalCode": "YO31"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.971", "longitude": "-1.05852"}}, "title": "Healthcare Assistants - Vale of York", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241227", "validThrough": "2020-11-18T23:59:59+0000"}