{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. (pro rata)"}}, "datePosted": "2020-10-27T15:16:18+0000", "description": "&lt;p&gt;The Transplant Unit at MFT is the North West’s only cardiopulmonary failure, transplantation and ventricular support device programme.&lt;/p&gt;\n&lt;p&gt;This is a unique and exciting opportunity for an enthusiastic nurse to develop skills to manage our patients complex &amp; highly specialist needs.&lt;/p&gt;\n&lt;p&gt;As a team we are committed to delivering the highest standards of care with a multi-disciplinary approach.&lt;/p&gt;\n&lt;p&gt;As a nurse at MFT you will benefit from a number of educational programs and career paths.&lt;/p&gt;\n&lt;p&gt;We are committed to the career development of our nurses and will assist you to develop your career in a highly specialized clinical area.&lt;/p&gt;\n&lt;p&gt;In addition, you will find that all MFT cardio-thoracic nurses are respected for their science, compassion, skill and expertise. Nurses collaborate with physicians on numerous projects.&lt;/p&gt;\n&lt;p&gt;We are a 16 bedded specialist ward admitting patients for pre/post-operative and ongoing care. The ward incorporates 8 high observation beds providing a healthy patient to nurse ratio of between 4-6 patients dependent on acuity.&lt;/p&gt;\n&lt;p&gt;The role will suit newly qualified or experienced nurses who are eager to expand and progress their nursing practice.&lt;/p&gt;\n&lt;p&gt;On appointment the successful candidate/s will receive full support and advice in education and preceptorship with one of our senior nurses.&lt;/p&gt;\n&lt;p&gt;You will be a committed, enthusiastic and a caring individual with an interest in joining our busy regional cardiopulmonary failure &amp; transplant unit.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate strong communication &amp; numerical skills &amp; provide evidence of your commitment to continuing professional development.&lt;/p&gt;\n&lt;p&gt;A flexible approach to shift patterns is essential. Flexible working hours include part time and job share.&lt;/p&gt;\n&lt;p&gt;The trust offers accommodation for staff who want to relocate to this vibrant &amp; diverse city- see additional information for details.&lt;/p&gt;\n&lt;p&gt;MFT offer staff salary sacrifice schemes including the bike scheme, car leasing &amp; child care vouchers.&lt;/p&gt;\n&lt;p&gt;MFT is a family friendly trust we provide staff with a dedicated child care coordinator, child care vouchers, an onsite preschool nursery &amp; will consider flexible working with a flexible working policy.&lt;/p&gt;\n&lt;p&gt;If you would like to develop your career &amp; be part of our exciting developments across cardiopulmonary failure, support &amp; transplantation services please contact us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicky CollinsJob titleWard ManagerEmail addressnicky.collins@mft.nhs.ukTelephone number0161 291 2201Additional contact information&lt;/p&gt;\n&lt;p&gt;Nicky Collins&lt;/p&gt;\n&lt;p&gt;Transplant Ward Manager&lt;/p&gt;\n&lt;p&gt;nicky.collins@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Alison Lofthouse&lt;/p&gt;\n&lt;p&gt;Deputy Transplant Ward Manager&lt;/p&gt;\n&lt;p&gt;alison.lofthouse@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 291 2204 or 2201&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse - Jim Quick Cardiothoracic Transplant Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245145", "validThrough": "2020-11-10T23:59:59+0000"}