{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "up to £30,000 FTE per annum DOE"}}, "datePosted": "2020-11-04T12:37:49+0000", "description": "&lt;h1&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Patient care is at the centre of what we do and we are looking for an enthusiastic, hardworking and committed nurse who wants to make a difference to our patient’s lives.&lt;br /&gt; &lt;br /&gt; HMP Channings Wood is a category C adult male prison situated near the market town of Newton Abbot located in the beautiful village of Denbury. It&#39;s within 3 miles of the Newton Abbot train station.&lt;br /&gt; &lt;br /&gt; HMP Channings Wood does not offer 24 hour healthcare and as such there are no night shifts.&lt;br /&gt; &lt;br /&gt; The salary for this role is up to £30,000 FTE per annum - dependent on experience.&lt;/p&gt;\n&lt;p&gt;We are open to accepting applications from both full and part time applicants.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Primary Care Nurse you will be an integral part of the healthcare team and will be involved in everything from clinical triage to the evaluation of patient care and standards. You will carry out and develop nurse led clinics, reviewing patient’s histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;br /&gt; &lt;br /&gt; You will also be working as part of a larger multi-disciplinary team, alongside the substance misuse and mental health teams. There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;br /&gt; &lt;br /&gt; You will be a Registered Nurse (Adult) looking to develop your current skills in a unique and ever changing environment. You will have a passion for learning and development, as well as having the initiative to bring new ideas and opinions on how to improve the healthcare services. You will be committed to being part of a high functioning and healthy team dynamic and ready for the challenge.&lt;br /&gt; &lt;br /&gt; Prison Healthcare experience is not essential, however experience in primary care is desirable. The Healthcare Team are confident in both the working environment and the quality of the work undertaken and would welcome informal visits from interested candidates.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Channings Wood if suitable for the role.&lt;br /&gt; &lt;br /&gt; For more information or to arrange an informal visit please contact us on the details provided.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced free DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbot", "postalCode": "TQ12 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5105", "longitude": "-3.65184"}}, "title": "Primary Care Nurse - HMP Channings Wood", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255881", "validThrough": "2020-11-18T23:59:59+0000"}