{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-23T15:31:41+0100", "description": "&lt;p&gt;Now is an exciting time to join the Corporate Nursing Team here at The Shrewsbury and Telford Hospital NHS Trust as we continue on our journey of our “Getting to Good” programme supported by our new Improvement Alliance with University Hospitals Birmingham.  If you are an experienced senior nurse leader who is passionate about workforce and education and the impact this has on staff and patient experience and care, this could be the the role for you.&lt;/p&gt;\n&lt;p&gt;We are looking for a senior nurse with knowledge of contributing to the nursing quality agenda with extensive experience in being involved in workforce modelling and establishment reviews utilising key safer staffing tools and professional judgement. You will play a key role in relation to helping deliver the workforce agenda ensuring we have the right staff, with the right skills, in the right place, at the right time. The Trust is currently gaining great success with overseas recruitment which is significantly contributing to a reduction in Registered Nurse vacancies. Alongside this, the Trust is now working towards the Hospital Transformation plan for the foreseeable future which will modernise services for our patients across the Telford, Shropshire and Powys region. There are a number of new and exciting opportunities in regards to our workforce that the successful applicant will be involved in with many opportunities to work closely as part of our senior nursing team. There will also be opportunity to develop you within key areas of interest that support the work required.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be educated to Master’s degree level or have an equivalent demonstrable level of knowledge acquired through experience and further training / development. You will be able to interpret data and apply relevant professional challenge and judgement. You will have excellent communication skills with a requirement to be able to talk informally and formally at all levels of the Trust including executive level and will be able to build strong relationships with internal and external stakeholders. You will need to be able to demonstrate that you have a proven ability to improve services, analyse and understand complex information and motivate nursing staff at all levels.&lt;/p&gt;\n&lt;p&gt;To discuss the challenges and the development the post brings and to see how you can become part of this team and our exciting plans, please contact:&lt;/p&gt;\n&lt;p&gt;Clair Hobbs, Deputy Chief Nurse, on clair.hobbs@nhs.net (preferred) or via phone on 01743 261000 extension 3721.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Lead Nurse for Workforce", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241132", "validThrough": "2020-11-08T23:59:59+0000"}