{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-05T16:46:00+0000", "description": "&lt;p&gt;Service/Ward/Department Summary:&lt;br /&gt;The CMHT work primarily with working age adults who have a diagnosis of a Serious Mental Illness and / or Complex Mental Health Difficulties. As part of the pathway we are improving the continuity of care for people who are open to Community Mental Health Teams but no longer need the ongoing support of a care co-ordinator due to long term stability but are continuing to receive medication treatment in the form of Clozapine or a depot medication and have an exciting developmental opportunity to offer.&lt;br /&gt;&lt;br /&gt;Role Summary:&lt;br /&gt;The successful applicant will provide clinical leadership to the treatment support team as the Deputy Team Manager within HMR and participate in the day to day operations in this part of the service working effectively alongside the Team Manager.&lt;br /&gt;&lt;br /&gt;The post holder will be highly skilled and competent in conducting comprehensive holistic health and social needs assessments, risk assessments and physical health. &lt;br /&gt;&lt;br /&gt;Key Responsibilities of the Post:&lt;/p&gt;\n&lt;p&gt;To provide clinical leadership, advice and support to the junior staff working within the team.&lt;/p&gt;\n&lt;p&gt;To direct and organise the work of junior staff in the team on a day to day basis.&lt;/p&gt;\n&lt;p&gt;To support and implement care that meets the mental, physical, spiritual, psychological and social needs of the patient, being sensitive to age, culture, race, gender, ethnicity, sexuality and disability.&lt;/p&gt;\n&lt;p&gt;To administer intramuscular injections, monitor the effect of medications, contraindications and side effects, To be able to use the POCHI machine and follow processes outlined in Clozaril Clinic procedures. To undertake venepuncture training and maintain knowledge and skills to be able to use this in both clinical and residential settings.&lt;/p&gt;\n&lt;p&gt;To demonstrate skills in the process of supervision, both for personal benefit and in supporting junior staff and students. To develop mentorship skills, and to offer professional assessment &amp; supervision to student nurses.&lt;/p&gt;\n&lt;p&gt;If you are up for change, challenge and an exciting opportunity to acquire management skills as developmental opportunity in CMHTs &amp; physically capable of fulfilling the role demands then this is the role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHayley MclellanJob titleTeam ManagerEmail addresshayley.mclellan@nhs.netTelephone number01706 676600Additional contact information&lt;/p&gt;\n&lt;p&gt;For enquiries, please contact Hayley Mclellan, Team Manager on 01706 676600&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rochdale - Borough wide, Heywood, Middleton and Rochdale", "postalCode": "M24 2HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.55", "longitude": "-2.19024"}}, "title": "RMHN/Deputy Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258622", "validThrough": "2020-11-12T23:59:59+0000"}