{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc"}}, "datePosted": "2020-11-04T14:31:04+0000", "description": "&lt;p&gt;We are looking for an enthusiastic dosimetrist to join the Radiotherapy Physics group at the Sutton branch of the Royal Marsden Hospital. This post will support planning across all treatment sites, with a particular focus (for an appropriate candidate) on the new Cyberknife S7, which started treating patients in July 2020. An appointment may be made at a lower band for a less qualified candidate.&lt;br /&gt;The Radiotherapy Department in Sutton has 7 Elekta linacs (6 Agility and 1 MLCi), an Elekta Unity MR-Linac and a Cyberknife S7. Additional equipment includes EPID portal imaging, in-vivo EPID dosimetry, and Cone Beam CT on all machines. Treatment planning is performed using the RayStation treatment planning system, with most treatment sites planned using a VMAT technique. We have established workflows for adaptive radiotherapy (plan of the day), 4DCT, and breathhold techniques. Multimodality imaging (CT, PET-CT, MR) is used for planning of several treatment sites. Recent clinical development work has included introducing a robust arc technique for whole CNS planning, expanding adaptive radiotherapy planning, expanding the existing SABR service and introducing advanced techniques such as robust planning. We are currently supporting highly flexible working with the majority of the planning team working from home about two thirds of the time.&lt;br /&gt;The radiotherapy physics group consists of 35 physicists, dosimetrists and engineers and forms a substantial part of the Royal Marsden/Institute of Cancer Research Joint Department of Physics, through which we have many active research collaborations, most notably on the MR-linac which was the first in the UK to treat patients. &lt;br /&gt;Sutton is pleasantly located on the border of Surrey with excellent transport links to central London and easy access to the countryside. House prices are a third lower than the London average and schools are excellent.&lt;br /&gt;For further details contact: Karole Warren-Oseni (Karole.warren-oseni@rmh.nhs.uk), Corrinne Brooks (corrinne.brooks@rmh.nhs.uk), principal dosimetrists; or Irena Blasiak-Wal (irena.blasiak­wal@rmh.nhs.uk), Head of Treatment Planning.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Michael Thomas, Head of Radiotherapy Physic, michael.thomas@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Karole Warren-Oseni (Karole.warren-oseni@rmh.nhs.uk), Principal Dosimetrist; or Irena Blasiak-Wal (irena.blasiak­wal@rmh.nhs.uk), Head of Treatment Planning.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Dosimetrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256233", "validThrough": "2020-11-25T23:59:59+0000"}