{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51198", "minValue": "51198", "unitText": "YEAR", "value": "£51,198 per annum, inc London Weighting"}}, "datePosted": "2020-10-27T15:16:41+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Department of Hepatology at Institute of Liver Studies, King’s College Hospital is offering an exciting opportunity to appoint three Senior Clinical Fellows in the department.&lt;/p&gt;\n&lt;p&gt;This post provides an opportunity for further specialised training in advanced chronic liver disease, complex hepatology, liver transplantation, liver cancer and viral hepatitis. It is envisaged that this post is ideal for individuals who have completed training in their base speciality and have a CCT or are at an advanced stage in their specialist training and wish to gain further training in the aforementioned areas. The exact job plan could be individualised to a successful candidates’ needs but is proposed to encompass rotating in 4- or 6-month blocks between advanced chronic liver disease, liver transplantation, liver cancer and viral hepatitis. In all blocks, we will actively encourage participation in clinical trials and research although this is intended to be primarily a clinical training post and not a research fellowship. It is envisaged that this post would be for a period of 12 months.&lt;/p&gt;\n&lt;p&gt;Applications from candidates with a background in Gastroenterology, Hepatology, Infectious Diseases or Transplantation would be welcomed.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to participate in the liver on call and emergency gastrointestinal bleeding on call rota on a 1 in 7 basis if they are trained in upper gastrointestinal endoscopy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameProfessor Debbie ShawcrossJob titleConsultant Hepatologist (Training and Education Lead)Email addressDebbie.shawcross@kcl.ac.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Abid Suddle (Lead for Hepatology) on abid.suddle@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Senior Clinical Fellow in Hepatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245162", "validThrough": "2020-11-09T23:59:59+0000"}