{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T12:46:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Specialist Practitioner in District Nursing (Band 6)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are are currently looking to recruit a Band 6 Community Specialist Practitioner within our District Nursing service. You will be allocated to work in one of the 5 neighbourhoods however the role may require you to work across any of the localities as a service need requirement&lt;/p&gt;\n&lt;p&gt;If you are a Self –motivated dynamic individual with a passion for community care this could be the position for you.&lt;/p&gt;\n&lt;p&gt;You will be working alongside a multi-skilled team of community practitioners led by Specialist Practitioners in District Nursing delivering nursing care to a diverse population within a variety of settings in the community.&lt;/p&gt;\n&lt;p&gt;The District Nurse team promote wellbeing and independence to all our patients in an understandable and approachable way. We provide the most appropriate care, working alongside families, carers and other agencies.&lt;/p&gt;\n&lt;p&gt;As a Specialist Practitioner you must be able to demonstrate effective leadership skills, have the ability to problem solve and provide ongoing support to members of your team.You must be able to demonstrate sound clinical knowledge and the ability to apply evidenced based practice.&lt;/p&gt;\n&lt;p&gt;You must be able to display effective communication skills with patients, family, carers as well as the wider Multi professional workforce.&lt;/p&gt;\n&lt;p&gt;You must be able to work effectively within a team environment and independently organising and prioritising individual workload.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Paula Bell&lt;/p&gt;\n&lt;p&gt;Job title: District Nurse Team Leader&lt;/p&gt;\n&lt;p&gt;Telephone number:07710385822&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Frain - Matron District Nursing - 07989187605&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "T&amp;G Community, Stalybridge", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Community Specialist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254043", "validThrough": "2020-11-17T23:59:59+0000"}