{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-11-05T11:01:03+0000", "description": "&lt;p&gt;&lt;strong&gt;SPECIALTY DOCTOR IN GENERAL SURGERY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to appoint a highly motivated, committed and forward thinking Specialty Doctor to join us in providing excellent services within our Surgery Department at Queens Hospital, Burton.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Duties for the post will be 10 PAs plus an additional 2 PAs per week to ensure compliance with the Working Time Directive working a full shift system with on-call being delivered on site at a rotation of 1 in 9 weeks.&lt;/p&gt;\n&lt;p&gt;The successful applicant would be encouraged to participate in Hospital and Departmental educational activities including audit and supported in pursuing their continuing professional development. The post will rotate between General, Upper GI and Colorectal surgery Specialties.&lt;/p&gt;\n&lt;p&gt;The Queens Hospital General Surgery team consists of 9 consultants, 2 trainee registrars, 7 middle grades (including this post) and 9 junior doctors.&lt;/p&gt;\n&lt;p&gt;We serve patients with varied conditions including colorectal cancer, inflammatory bowel disease, anorectal conditions, gall stone disease, hiatus hernias and complex and simple hernias. We also provide major abdominal wall reconstruction surgery and have a weekly laparoscopic operating session dedicated to GI surgery.&lt;/p&gt;\n&lt;p&gt;We also treat various general surgical emergencies around the clock. Our team provide elective and emergency gastro intestinal endoscopy services both in Burton and Tamworth, where we provide diagnostic and therapeutic endoscopes.&lt;/p&gt;\n&lt;p&gt;Outpatient clinics are run by our team across three of the Trust sites, Burton, Lichfield and Tamworth.&lt;/p&gt;\n&lt;p&gt;There is adequate opportunity to train in clinical skills, laparoscopic surgery and endoscopy. Previous applicants have been successful in career progression and are supported in doing so by the Surgery Division.&lt;/p&gt;\n&lt;p&gt;It is essential that applicants have full GMC registration and hold a license to practice. They should have a minimum of four years full time post graduate training (or its equivalent) gained on a part time or flexible basis at least 2 of which will in a specialty training programme in a relevant specialty or as a Fixed Term Specialty Trainee; or shall have equivalent experience and competencies and have relevant specialty clinical knowledge. It is highly desirable that applicants have NHS experience.&lt;/p&gt;\n&lt;p&gt;All applicants who have a disability and meet the minimum criteria for the job will be short listed for further assessment.&lt;/p&gt;\n&lt;p&gt;The post will be based at Queen’s Hospital, Burton but as a merged organisation, we expect flexibility to be able to work across all sites of University Hospitals of Derby and Burton Foundation Trust should the need arise.&lt;/p&gt;\n&lt;p&gt;You can apply online for this vacancy by clicking the apply button at the bottom of the screen&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Pradeep Thomas, Assistant Clinic Director and Lead Consultant Surgeon or&lt;/p&gt;\n&lt;p&gt;Mr. Stelios Vakis, Consultant Colorectal Surgeon on (01283) 511511 extension 4192&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QHB, Burton Upon Trent", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Specialty Doctor in General Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257337", "validThrough": "2020-11-19T23:59:59+0000"}