{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc HCAs"}}, "datePosted": "2020-11-06T13:16:43+0000", "description": "&lt;p&gt;&lt;span&gt;LNWUH Brent &amp; Harrow Community Children’s Nursing Service are seeking experienced children’s nurses, to join the team in Brent and Harrow. We offer a range of experiences delivering nursing care to children with long term and acute, complex and life-limiting healthcare needs eg; children and young people with oncology and haematology conditions; complex and continuing care including home ventilation; palliative and end of life care. It is one of the most well established teams in London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Band 6 role requires an experienced, dynamic children’s nurse ideally with community experience and/or a specialist practitioner qualification. You will need to be flexible and forward thinking, able to work independently and as part of a friendly and supportive team delivering nursing care to a diverse caseload. There will be a strong focus to deliver an ‘out of hospital’ agenda across community based pathways to reduce hospital attendances and length of stay. There is Trust wide commitment to develop and lead community children’s nursing into an exciting and outcomes driven future, through integration and partnership working, to ensure seamless delivery of services across the health system to meet the needs of children and young people in Brent and Harrow. It is essential that you will have excellent clinical and communication skills. In return we will offer you a comprehensive induction and development programme with robust mentorship and clinical supervision opportunities. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for vibrant community childrens nurses looking for a career in community children’s nursing within a diverse community. Whether you are experienced in this field, or looking to broaden your skills then this is a role for you! All post holders will be responsible for delivering excellent care to children and young people across NWL. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will require excellent communication and clinical skills and have an understanding of planning and delivering care for children and young people in the community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen KellyJob titleActing MatronEmail addresshelekelly2@nhs.netTelephone number0208 453 2125Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal visits welcomed&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please call Helen Kelly to arrange on 02084532125&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London Northwest Health Trust, Brent", "postalCode": "NW10 5AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5374", "longitude": "-.23603"}}, "title": "Community Childrens Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259862", "validThrough": "2020-11-20T23:59:59+0000"}