{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21415", "minValue": "21415", "unitText": "YEAR", "value": "From £12.74 per hour depending on experience"}}, "datePosted": "2020-11-05T15:46:26+0000", "description": "&lt;p&gt;We are looking for compassionate, enthusiastic and caring nurses to join our Contingent Workforce and be deployed in various wards/departments within MSE across Basildon, Southend and Broomfield Hospitals. MSE Trust is a dynamic place to work where individuals are supported and given opportunities to develop to their maximum potential.&lt;br /&gt;&lt;br /&gt;Our Registered Nurse Bank welcomes applications from Nurses with experience in a variety of areas around the hospital including A&amp;E, Medicine, Surgery, Intensive Care, Chemotherapy and many more.&lt;br /&gt;&lt;br /&gt;You will be a motivated team orientated professional with a passion for delivering good nursing care in an ever changing environment. The successful candidates must possess excellent communication skills, a high sense of professionalism and a strong belief in the value of teamwork.&lt;br /&gt;&lt;br /&gt;Nurses within our Trust are expected to ensure that an individual programme of care is planned, implemented and evaluated for each patient within their own sphere of responsibility. They should work as part of the multidisciplinary team ensuring the delivery of a high standard of care to the patients. At times, they may be required to act as team leader including taking charge of the ward in the absence of the Ward Manager/Deputy Ward Manager and participate in all relevant aspects of the Governance process. The ideal candidates will adhere to the NMC code of Professional Conduct at all times and ensure compliance with hospital policies and procedures, always acting as a positive role model at all times.&lt;br /&gt;&lt;br /&gt;At MSE we understand how important the work life balance is and being able to work in an environment that supports this. Working via the Bank is the ideal way, not only can you choose shifts that suit your lifestyle, but you can enjoy all the benefits associated with working within the NHS.&lt;br /&gt;&lt;br /&gt;Work to keep your skills up to date&lt;br /&gt;A way into the NHS&lt;br /&gt;Benefits for Temporary Workers&lt;br /&gt;Competitive rates of pay&lt;br /&gt;Access to the NHS Pension Scheme&lt;br /&gt;Paid annual leave entitlement&lt;br /&gt;Free mandatory training and continuous professional development&lt;br /&gt;&lt;br /&gt;You will also have access to our in house training programs, free of charge, to develop your skills further.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simiso.Ncube-Kaseke@southend.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital NHS Trust, Southend-on-Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Bank Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258421", "validThrough": "2020-11-30T23:59:59+0000"}