{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-07T10:27:23+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Community Staff Nurse (Adult Nurse) - Newbury&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Come&lt;/span&gt; &lt;span&gt;and &lt;/span&gt;join our CQC rated ‘Outstanding’ Trust as a Community Staff Nurse in Newbury. As a Community Staff Nurse you’ll help&lt;span&gt; deliver care to people in their own homes and get to work with inspiring, skilled teams whilst you do it. We offer a supportive environment with opportunities for further career development, a strong in-house training programme, including excellent links with our partner Universities and opportunities to gain further qualifications. For newly qualified staff we offer a comprehensive 12-month preceptorship.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We believe in care that treats the whole person, not just the condition. We enable patients to stay at home longer and leave hospitals faster. Our community nurses work closely with members of the wider multi-disciplinary teams, including our GP&#39;s, local hospices, complex care nurses, health and social care coordinators, specialist nurses and therapist colleagues. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The NHS is changing. More emphasis on community-based care means there&#39;s never been a better time to join Berkshire Healthcare NHS Foundation Trust. And Following our latest Care Quality Commission (CQC) inspection, we’re delighted to announce that we’ve been awarded ‘Outstanding’ as a community and mental health care provider. One of the highlights from the report states ‘Staff across the trust felt valued and there was a real focus on doing what was best for staff, patients and carers and a real commitment to the delivery of good quality patient care at every level. Staff at all levels of the trust were proud to work there and morale amongst staff was good.’ &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;So join us and you can be confident that Berkshire Healthcare is a Great Place to Work!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Further information about this opportunity:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You will visit a number of patients on a daily basis in their own homes to provide a comprehensive range of clinical nursing activities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will provide high quality nursing care to a range of patients with varying healthcare needs.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide a high standard of holistic assessment and care planning.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Administer IV drugs, complex wound management, health promotion and medicines management, end of life care and symptom control.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Full time (37.5 hours per week) and part time opportunities available.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Covering: Thatcham, Chieveley, Compton, Chapel Row, Kintbury, Woolton Hill, Hungerford and Lambourn.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Some of the benefits of joining our team:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;AfC Salary ranging from £24,907 to £30,615 per annum&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working opportunities&lt;/strong&gt; and a strong emphasis on your work , life balance&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Annual leave – 27 days for new starters, &lt;strong&gt;plus bank holidays&lt;/strong&gt;. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent &lt;strong&gt;learning and development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Salary sacrifice scheme for a new car&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Lease car scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous &lt;strong&gt;maternity, paternity and adoption leave&lt;/strong&gt; for eligible staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Advanced IT&lt;/strong&gt; enablement and support&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Confidential telephone care service providing independent &lt;strong&gt;support and advice for staff&lt;/strong&gt;.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;And so much more&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Are you familiar with Newbury?&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are not familiar with Newbury in West Berkshire, it lies at the centre of Southern England, within an hour&#39;s reach of London, Bristol, Oxford and the south coast. Transport links are excellent... it is easy to reach from all parts of the UK. Newbury is also home to beautiful countryside, walking and cycling trails. There’s also a range of nationally loved attractions such as the top class Racecourse or Highclere Castle, home of Downton Abbey.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;The 3 “must haves” for you to be considered for this role:&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;A passion for community nursing, that matches our passion to provide excellent healthcare for patients within their own homes,&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Either a qualified adult nurse or currently in your last year of training (with NMC registration)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Hold a full UK Driving Licence and have use of a car for work purposes&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Should you match up to the 3 points listed above, then we would recommend you make your application for this role! We interview candidates for this role in the order applications are received, so don’t delay and apply today.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact Kelly Ford, Team Leader on email at Kelly.Ford@berkshire.nhs.uk or call Louise on: 07900736939&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newbury, Berkshire", "postalCode": "RG18 3AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4061", "longitude": "-1.29225"}}, "title": "Community Staff Nurse (District Nursing) - Newbury", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215979", "validThrough": "2020-11-08T23:59:59+0000"}