{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc HCAS"}}, "datePosted": "2020-11-05T15:16:35+0000", "description": "&lt;p&gt;We are seeking an enthusiastic Clinical Psychologist to join our dynamic and friendly CAMHS Service either four or five days per week. We would welcome applications from newly qualified clinical psychologists as well as established clinical psychologists who may be looking to move into child and adolescent services.&lt;/p&gt;\n&lt;p&gt;This well established and friendly MDT is looking for a clinical psychologist to join our experienced staff group which provides the opportunity to work alongside a range of professions including nursing, psychiatry, family therapy, psychotherapy, child well-being practitioners and CBT therapists.&lt;/p&gt;\n&lt;p&gt;The post offers opportunities for:&lt;/p&gt;\n&lt;p&gt;Direct clinical work with children and young people and their families Assessment, intervention and training including supervision of CWPs where appropriate The opportunity to become involved with quality improvement projects and other initiatives that enhance our service user experience Developing creative and effective collaborative working with partner agencies The post holder will be supervised and managed within the thriving and supportive Clinical Psychology Group in Hillingdon CAMHS, which affords opportunities for professional development, training and research. We enjoy close links with the London Clinical Psychology Training Schemes, and have trainees from these schemes regularly on placement with us.&lt;/p&gt;\n&lt;p&gt;Clinical work is based in clinics in Hayes and Uxbridge Health Centre.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rachel Tucker, Consultant Clinical Psychologist and Borough Therapy Lead or Dr Hugo Madden Senior Clinical Psychologist on 01895 256 521&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Rachel TuckerJob titleConsultant Clinical Psychologist and Borough Therapy LeadEmail addressracheltucker@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Rachel Tucker Consultant Clinical Psychologist and Borough Therapy Lead and Dr Hugo Madden Senior Clinical Psychologist Tel: 01895 256 521&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Minet Clinic Hayes, Hayes", "postalCode": "UB3 3NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5117", "longitude": "-.40901"}}, "title": "Clinical Psychologist CAMHS Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258306", "validThrough": "2020-11-19T23:59:59+0000"}