{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28324", "minValue": "15482", "unitText": "YEAR", "value": "£9.21ph - £16.85ph"}}, "datePosted": "2020-11-05T12:50:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Bank Housekeeping Band 2&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Worcestershire Health and Care NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Malvern Community Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £9.21 Saturdays Nights: £12.98 Sunday/Bank Hols: £16.85&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work within a trust where they are dedicated with ensuring that all employees have the right values to provide the best service to patients? Would you like to be part of a team at a Trust rated ‘good’ in a recent CQC report?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Worcestershire Health and Care NHS Trust is a leading provider of community nursing, therapy, and mental health services to people of all ages throughout our county.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We believe our staff are our biggest asset. We want to develop a positive, inclusive, and caring culture that engages and inspires all our staff, with a clear focus on improvement and advancing equality of opportunity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Housekeeping services are now recruiting for Bank Housekeepers providing anopportunity to work in a busy and varied environment, alongside clinical and other non-clinical colleagues to make a positive contribution to our patients and staff experience.&lt;/p&gt;\n&lt;p&gt;Shifts are allocated on an as and when required basis to meet the needs of the service and there may be a requirement to cover various shifts throughout the week to include weekends.&lt;/p&gt;\n&lt;p&gt;You would be Working as part of a Roster to cover Mornings, afternoons, Evenings, and Weekends.&lt;/p&gt;\n&lt;p&gt;Shift times may include:&lt;/p&gt;\n&lt;p&gt;08:00-12:30&lt;/p&gt;\n&lt;p&gt;15:00-18:00&lt;/p&gt;\n&lt;p&gt;18:00-20:00&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure cleanliness of the Trust’s retained estate in accordance with the Trust’s strategic cleaning plan and national recommendations (e.g. National Specification of Cleanliness, PAS-5748), follow strictly timed work schedules to ensure smooth operations of other departments and relay any information given that may impact on other services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Clean all furniture, fixtures, and fittings in designated areas as per the cleaning procedures and schedules.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake the cleaning of all hard / soft flooring, utilising the appropriate machinery and method of cleaning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out the safe removal of clinical and other accumulated waste from sack holders / bins across the site. Sack holders / bins must be kept clean inside and out and the bin liners replaced.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;According to local site arrangements and subject to appropriate training and risk assessment, assist / take down and / or re-hang curtains and bed screens.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Replenish all consumables, e.g. toilet rolls, hand towels, washing up liquid, hand soaps, hand hygiene related consumables, as and when necessary and if applicable.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Clean and replenish patient water jugs, prepare meal service trollies, and wash crockery, cutlery and glasses where required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake specialist and enhanced deep cleaning of barrier nursing rooms, clinical areas, and clinical equipment, as directed by the infection prevention and control team (IPCT)/ Housekeeping line report or delegate. Specialist cleans include:&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Bleach clean/Barrier clean&lt;/li&gt;\n&lt;li&gt;Terminal clean&lt;/li&gt;\n&lt;li&gt;Deep clean&lt;/li&gt;\n&lt;li&gt;Full Clean/Team clean&lt;/li&gt;\n&lt;li&gt;Enhanced 3 phase clean&lt;/li&gt;\n&lt;li&gt;Descaling cleans/duties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide housekeeping services to other sites within the Trust’s retained estate as may be required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;Please note this Job role is not open to agencies so I kindly request I am not contacted by any third parties in relation to this role.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Stephanie Phillips, Trust Recruitment Coordinator on 01905 681781 or email Stephanie.phillips@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Malvern", "postalCode": "WR14"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0998", "longitude": "-2.3234"}}, "title": "Bank Housekeeping", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257728", "validThrough": "2020-11-19T23:59:59+0000"}