{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T18:15:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a dedicated and highly motivated individual to work as a &lt;strong&gt;joint Consultant Haematologist at both Sherwood Forest Hospitals NHS Foundation Trust and Nottingham University Hospitals NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a new whole time substantive post, predominantly with laboratory responsibilities based at Sherwood Forest Hospitals (SFH) with 2 days a week spent working at the regional SIHMDS service at Nottingham University Hospitals Trust (NUH).&lt;/p&gt;\n&lt;p&gt;The Sherwood Forest role will focus on providing laboratory support through occupying the Laboratory Director Role, providing diagnostic expertise and leadership particularly within the areas of haematological malignancy and general haematology. The post-holder will also fulfil the Clinical Leadership role for the Blood Transfusion service acting in accordance with the Blood Safety and Quality Regulations. The Trust provides a Public Health England commissioned Antenatal and New-born Screening Service, and the post holder will be expected to provide clinical advice for the Haemoglobinopathy elements of the screening programme.&lt;/p&gt;\n&lt;p&gt;At Nottingham University Hospitals the post-holder will join an enthusiastic team of haematologists and haematopathologists and will help to further develop the expanding Nottingham Specialist integrated Haematological Malignancy Diagnostic service (HMDN) that currently provides haematopathology diagnostic services for Nottingham, Lincolnshire, Sherwood Forest and Derby. A key aspect of the role will be to oversee the expansion of reporting services provided by HMDN to SFH, particularly the introduction of integrated reporting for bone marrow samples to include morphology results as well as flow cytometry and genomic results within one report with expert interpretation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be contracted to Sherwood Forest Hospitals NHS FT and have an honorary contract with &lt;span&gt;Nottingham University Hospitals&lt;/span&gt;.&lt;/p&gt;\n&lt;p&gt;Although this is a whole time position, candidates wishing to work part-time or in a job share are encouraged to apply. If such a person is appointed, modification of the job content will be discussed with the post holder on a personal basis in consultation with Consultant colleagues at both Trusts.&lt;/p&gt;\n&lt;p&gt;It is a requirement for the post holder to have passed both the MRCP and FRCPath examinations or show evidence of their equivalents and be on the full and specialist register with a licence to practise from the GMC or be eligible for &lt;span&gt;specialist &lt;/span&gt;registration within six months of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Rebecca Barker -&lt;/strong&gt; Head of Service for Haematology at Sherwood Forest Hospitals: Secretary 01623 622515 ext. 3613 Email rebecca.barker6@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Emma Das-Gupta -&lt;/strong&gt; Consultant haematologist and clinical lead for HMDN at Nottingham University Hospitals: Secretary 0115 9691169 ext. 756870; Email emma.das-gupta@nuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital with working also at Nottingham University Hospitals, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Consultant in Laboratory Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243609", "validThrough": "2020-11-30T23:59:59+0000"}