{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30627", "minValue": "15179", "unitText": "YEAR", "value": "£9.03 - £18.22 Per Hour/Depending Shift"}}, "datePosted": "2020-11-05T15:46:23+0000", "description": "&lt;p&gt;Nursery Assistant&lt;/p&gt;\n&lt;p&gt;Division: Temporary Resourcing&lt;/p&gt;\n&lt;p&gt;Care Group: Corporate&lt;/p&gt;\n&lt;p&gt;Band: 2&lt;/p&gt;\n&lt;p&gt;Salary: £9.03 - £18.22 per hour/depending on the shift&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Nursery Assistant who shares our ambition and vision to deliver the &lt;strong&gt;&lt;em&gt;Best of Care by the Best People&lt;/em&gt;&lt;/strong&gt; and have the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be expected to be able to work within a child’s day nursery ensuring that each child is provided with a safe and secure, emotionally and physically stimulating environment and programme of activities in which to develop.&lt;/p&gt;\n&lt;p&gt;As a Nursery Assistant you will ensure that the nursery remains at a high standard of cleanliness, promoting personal hygiene standard through monitoring toilet procedures as well as maintaining cleanliness in the playroom and surrounding areas.&lt;/p&gt;\n&lt;p&gt;In addition, you will attending regular staff meetings which may be out of working hours and assist in out of hours events such as fetes and open evenings (as/when required).&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse.&lt;/p&gt;\n&lt;p&gt;To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne Roberts&lt;/p&gt;\n&lt;p&gt;Tiny Tugs Day Nursery Manager&lt;/p&gt;\n&lt;p&gt;joanne.roberts3@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Bank Nursery Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258419", "validThrough": "2020-11-18T23:59:59+0000"}