{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48605", "minValue": "30911", "unitText": "YEAR", "value": "£30,911 to £48,605"}}, "datePosted": "2020-10-12T11:39:21+0100", "description": "&lt;p&gt;Applications are invited for an &lt;strong&gt;Academic Clinical Lectureship in Endodontics ST1-3 at Queen Mary University of London&lt;/strong&gt;training programme across the &lt;strong&gt;London and South East&lt;/strong&gt; starting from &lt;strong&gt;August 2021&lt;/strong&gt; (Subject to change)&lt;/p&gt;\n&lt;p&gt;The application window opens on &lt;strong&gt;16th October 2020, 16:00 &lt;/strong&gt;and closes on&lt;strong&gt; 13th November 2020, 16:00&lt;/strong&gt; UK time. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, Oriel. Registration is available to applicants immediately.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Specialty Training website of Health Education England or from the relevant vacancy page on Oriel. Please visit the relevant vacancy page on Oriel to find out the following information:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Indicative number of vacancies available&lt;/p&gt;\n&lt;p&gt;· Likely locations of posts within the training programme&lt;/p&gt;\n&lt;p&gt;· Expected rotation details&lt;/p&gt;\n&lt;p&gt;· Anticipated outcome of the training programme, subject to satisfactory progression&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Eligibility Criteria for recruitment to Specialty Training – Immigration Requirements&lt;/p&gt;\n&lt;p&gt;Health Education England (HEE) is responsible for the sponsorship of Medical and Dental trainees for their Tier 2 visa application in England. Health Education West Midlands administers the process on behalf of HEE. For more information please visit their website, as well as the Applicant Handbook which can be found on the Oriel Resource Bank.&lt;/p&gt;\n&lt;p&gt;Evidence of immigration status should normally consist of a biometric residence card, date stamped passport, and accompanying letter from the Home Office. Please visit their website for more information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England London and the South East", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123901"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "NIHR Clinical Lecturer in Endodontics (ST1-3) QMUL", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222142", "validThrough": "2020-11-13T23:59:59+0000"}