{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive"}}, "datePosted": "2020-10-23T10:32:07+0100", "description": "&lt;p&gt;Due to expansion in the metabolic service a specialist physiotherapy post has been created which provides an exciting opportunity for a Paediatric Physiotherapist with broad experience across all areas of Paediatrics. The successful candidate will be skilled in completing musculoskeletal / neurological / neurodevelopmental and respiratory assessments in a wide range of highly complex conditions and provide appropriate therapy to both inpatients and outpatients with metabolic and medical conditions.&lt;/p&gt;\n&lt;p&gt;The post holder will coordinate, deliver and evaluate physiotherapy care to children and young people (0 – 18 years) who are admitted to the medical wards as well as children with general metabolic conditions working closely with the metabolic MDT and liaising with local therapy services.&lt;/p&gt;\n&lt;p&gt;This post is part of an established physiotherapy service, consisting of a Neuromedical Band 8 physiotherapist, a Band 7 facial therapy &amp; plastics physiotherapist and a rotational Band 6 physiotherapist. Good communication skills and team working abilities are essential for this post. You will be working closely with other members of the multidisciplinary team and physiotherapy colleagues to deliver coordinated and holistic management for children with complex and sometimes long term conditions.&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity to experience specialist services in a tertiary setting. Great Ormond Street Hospital is located in central London close to Covent Garden and Oxford Street. The Trust values all their staff and has been awarded the Improving Working Lives Practice Plus standard. There is support for research activity and your CPD through provision of study leave and funding. There are also generous staff benefits available including subsidised accommodations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name Michelle Wood Job title Clinical Specialist Physiotherapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address michelle.wood@gosh.nhs.uk Telephone number 02074059200 ext 5144&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information - Lucy Alderson - lucy.alderson@gosh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Physiotherapist in Metabolic and Medical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240070", "validThrough": "2020-11-08T23:59:59+0000"}