{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33660", "minValue": "33660", "unitText": "YEAR", "value": "Up to £33,660 FTE - dependent on experience"}}, "datePosted": "2020-10-19T22:10:48+0100", "description": "&lt;h2&gt;I treat more than just symptoms&lt;br /&gt;&lt;br /&gt;&lt;/h2&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be. &lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health / wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Interested in clinical development?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS/ALS (intermediate life support and advanced life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Want to know more about HMP Hewell?&lt;/h1&gt;\n&lt;p&gt;HMP Hewellis a closed category B male remand prison, with an operational capacity of 1,104. In the main closed site, there are 6 main house block residential units. The prison is operated by Her Majesty’s Prison Service.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;In return for your hard work you will...&lt;br /&gt;&lt;br /&gt;&lt;/h2&gt;\n&lt;p&gt;Receive an annual salary of up to £33,660 depending on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Hewell include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;What do we need from you so you can do the job?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;You will be a qualified Registered Nurse (Adult) with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;br /&gt;&lt;br /&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Next steps&lt;/h2&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role. Amelia will submit your CV to the hiring manager and will arrange an interview for you to attend at HMP Hewell if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;More information&lt;br /&gt;&lt;br /&gt;&lt;/h2&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. We also welcome part-time and bank applications and can offer either day shifts and / or night shifts.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redditch", "postalCode": "B97 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3256", "longitude": "-1.9916"}}, "title": "Primary Care Nurse - HMP Hewell", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233415", "validThrough": "2020-11-10T23:59:59+0000"}