{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-30T09:45:59+0000", "description": "&lt;p&gt;Essential: Current midwifery qualification registered with the NMC.&lt;/p&gt;\n&lt;p&gt;As the maternity quality Improvement lead, the post holder will work as part of a dynamic team in delivering an effective service supporting maternity improvement advisors, maternity services and their clinical leadership teams across England to drive quality improvement.&lt;/p&gt;\n&lt;p&gt;Under the direction of the Deputy Chief Midwifery officer for England the post-holder will lead the operational delivery, management and evaluation of the Maternity safety support Programme ensuring the Chief Midwifery office for England and the Nursing Directorate is able to deliver a Programme of clinically led improvement programmes in line with national priorities. The Maternity Quality Improvement Lead will be responsible for operationalising the improvement Programme, working closely with the Deputy Chief midwifery Officer, the Maternity Improvement advisors, the Improvement Directorate and the regional teams. The role is fundamental to the success of NHS Improvement&#39;s objective of supporting the system to build quality improvement science capability and capacity in the clinical workforce.&lt;/p&gt;\n&lt;p&gt;As the Maternity Quality improvement lead the post holder will lead, champion and uphold our values both within NHS England and Improvement and across the system. With support from colleagues in the nursing directorate and working collaboratively with other directorates and regions, the post holder will and co-deliver the maternity safety support improvement Programme.&lt;/p&gt;\n&lt;p&gt;This post is a national post and office base is flexible dependent upon the region. If London then Inner London weighting will be applied to salary.&lt;/p&gt;\n&lt;p&gt;Please note interviews will be conducted virtually via Microsoft Teams and applicants will be notified if successful for interview within two weeks of shortlisting closing.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sascha Wells-Munro&lt;/p&gt;\n&lt;p&gt;Deputy Chief Midwifery Officer for England&lt;/p&gt;\n&lt;p&gt;sascha.wells-munro@nhs.net&lt;/p&gt;\n&lt;p&gt;07849079078&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NHSE/I office dependent upon the region, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Maternity Quality Improvement Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249540", "validThrough": "2020-11-15T23:59:59+0000"}