{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pr"}}, "datePosted": "2020-11-04T09:00:34+0000", "description": "&lt;p&gt;Due to ongoing developments within the department, new opportunities have arisen for Registered Nurses to work in the Emergency Department at Poole, the local trauma centre dealing with a wide range of patients from across Dorset.&lt;/p&gt;\n&lt;p&gt;Poole Emergency Department remains the main Emergency Department in Dorset seeing over 200 patients per day including trauma, paediatrics, surgery, medicine, obstetrics and specialist surgery. We were also ranked in the top 6 of all Emergency Departments nationally for the standard of care that we deliver.&lt;/p&gt;\n&lt;p&gt;Despite being a thriving and busy Department we remain a friendly and well-motivated team. Staff Nurses have the opportunity to quickly develop skills in all areas of Emergency Medicine in a supportive environment. New staff can expect to receive training in paediatric emergencies, Resus, minor injuries and triage within the first 18 months of their employment.&lt;/p&gt;\n&lt;p&gt;Poole has also developed a new Urgent Care Centre within the Emergency setting which allows for close collaboration with Primary care.&lt;/p&gt;\n&lt;p&gt;The future of Emergency Care in Dorset remains exciting, with a major new Emergency site being developed in the next 5-6 years. Poole Hospital, which will remain as the trauma centre until the new site is built, will be at the forefront of this development with our staff being the cornerstone of the new nursing team in the future.&lt;/p&gt;\n&lt;p&gt;We are looking for high calibre individuals with good interpersonal and communication skills. The successful candidate should relish the challenge of a fast paced and exciting environment whilst wanting to deliver the highest standard of care.&lt;/p&gt;\n&lt;p&gt;Applicants need to be a Registered Nurse / Registered Children’s Nurse with a minimum of 6 months post registration experience in an acute setting.&lt;/p&gt;\n&lt;p&gt;Please note: if this post requires you to have a DBS check to enable you to properly fulfil the requirements of the role, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 18/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date week commencing: 30/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Suzanne Carrington - Suzanne.Carrington@uhd.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole Hospital, Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Staff Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255131", "validThrough": "2020-11-18T23:59:59+0000"}