{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum incl. HCAS"}}, "datePosted": "2020-11-02T16:16:52+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Ward Medicines Management Pharmacy Technician - Acute Medicine and Ambulatory Care - &lt;/strong&gt;&lt;strong&gt;Band 5 &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Full time 37.5 hours/week (&amp; weekend working)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;West Middlesex site&lt;/span&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;West Middlesex University Hospital is a modern, busy acute hospital in West London with excellent transport links to London Waterloo within 20 minutes.&lt;/p&gt;\n&lt;p&gt;Under NHS North West London’s Shaping a Healthier Future programme we have been designated as a major hospital, which will bring further significant investments in our facilities and staffing, expanding a number of our services including accident and emergency and our award winning maternity service.&lt;/p&gt;\n&lt;p&gt;We provide a full range of services to local residents including acute medicine, surgery, paediatric and neonatal services, oncology, haematology &amp; ICU. The Trust is also part of Chelsea and Westminster Hospital.&lt;/p&gt;\n&lt;p&gt;Are you a registered pharmacy technician looking for a new experience and challenge?&lt;br /&gt;Are you looking for a progressive role to develop your skills as a medicines management technician in a friendly department ? Then we are looking to hear more from you.&lt;/p&gt;\n&lt;p&gt;The pharmacy department at Chelsea and Westminster Hospital, West Middlesex site are looking for a permanent full-time Senior Medicines Management Pharmacy Technician to join our Acute medicines ward based team and the ambulatory emergency care team.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to work with a forward thinking and progressive team. Your main duties will include taking medication histories using the wards assessment of patients own medications. In addition you will be an integral part of the ambulatory emergency care team, where by you will be working very closely with the senior pharmacist in AEC, some of the key aspect of your duties there will be patient counselling, working closely with the nurses in the medicines management of stock, there will also be an opportunity to work with the OPAT (Outpatient Parental Antibiotic Therapy) team and training on OPAT self administration teaching.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Key areas of responsibility are :&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible for the provision of the Medicines Management service to designated ward areas, which involves working in clinical areas unsupervised.&lt;/li&gt;\n&lt;li&gt; Counsel patients in order to provide effective and appropriate advice to patients on medication use in order to ensure their understanding of their medication.&lt;/li&gt;\n&lt;li&gt; Be actively involved and Support the management of IV antibiotic supply alongside the Pharmacist.&lt;/li&gt;\n&lt;li&gt; Participate in regular medicines management training sessions for nursing staff.&lt;/li&gt;\n&lt;li&gt;The post holder must possess excellent problem solving and time management skills and be able to bring new ideas to the department. You will be required to work weekends and shifts on a rota basis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;For further information contact Priyanka Babra, Senior Pharmacist Acute Medicines Unit on&lt;br /&gt;02083216250 or Priyanka.babra@chelwest.nhs.uk or&lt;br /&gt;Kiran Phal (Lead Divisional Pharmacist – Emergency and Integrated Care (Thursday-Friday) on&lt;br /&gt;020 83215224 or kiran.phal@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGrace AppiatseJob titleLead Pharmacist AMU/AECEmail addressgrace.appiatse@chelwest.nhs.ukTelephone&lt;/p&gt;\n&lt;p&gt;Jaafar Alhakem Senior Pharmacist AEC Jaafar.Alhakem@ chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital, London", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Ward Medicines Management Pharmacy Technician -Acute Medicine and AEC.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252810", "validThrough": "2020-11-16T23:59:59+0000"}