{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-10-27T14:30:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Fellow (Regional) Anaesthesia &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;East Surrey &amp; Crawley Hospitals&lt;/li&gt;\n&lt;li&gt;Full time – 40 hours per week&lt;/li&gt;\n&lt;li&gt;Fixed term – 12 months&lt;/li&gt;\n&lt;li&gt;£32,478 - £51,069 per annum plus 1A Banding Supplement (50%)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Surrey &amp; Sussex NHS Healthcare Trust wishes to appoint a full-time Regional Anaesthesia Fellow. This is a fixed-term (12 months) appointments from February 2021. It is intended for anaesthetists with a strong interest in, but not necessarily experience in, regional anaesthesia.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will join a team of 36 Consultants, 10 SAS Grades, up to 24 Trainees, 3 Acute Pain Nurses and 4 administrative staff. The department is friendly, engaged and provides excellent training. You would be expected to work flexibly through the week with commitment to the on-call rota. The fellow will be prioritised to lists with blocks but will be expected to cover the full range of anaesthetics services we provide when no block lists are scheduled.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The regional fellows will be encouraged and supported to do the European Diploma in Regional Anaesthesia.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There will be opportunities to present at ESRA and RA-UK annual congress. Fellows will play a large role in organising the very successful 3-day East Surrey Regional Anaesthesia Course. They will teach as a member of faculty in our course and other Regional courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post offers the level and breadth of experience necessary for gaining approval for training, but this would need to be applied for prospectively by the successful candidate, if so desired. This post will provide 40 hours per week of flexible working in theatres, as a part of the trainee on call rota which rolls over an 8 week period. The successful candidates will be encouraged to take part in departmental teaching, clinical governance and QI activities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;East Surrey is the principle hospital for emergencies and inpatients, with day case surgery at Crawley Hospital. Anaesthetists are expected to be available across both hospital sites dependant on operational requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed by contacting the College Tutors, Dr Afolake Bewaji (Afolake.bewaji@nhs.net) and Dr Christie Locke (christie.locke@nhs.net) or Regional Anaesthesia Lead, Dr Venkat Duraiswamy (venkat.duraiswamy@nhs.net).&lt;/p&gt;\n&lt;p&gt;Interview date: TBC (via Skype - East Surrey Hospital)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill and Crawley, Surrey", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Regional Fellow – Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244956", "validThrough": "2020-11-17T23:59:59+0000"}