{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum, pro rata"}}, "datePosted": "2020-11-04T14:31:02+0000", "description": "&lt;p&gt;Do you have a background as a health care assistant and fancy a role with a focus? Do you have the skills required to support to our fantastic therapy and nursing team in providing excellent care? If so, then please read on we may have just the job for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re really excited to be opening our newly refurbished, modern therapy led rehabilitation unit at Lancashire Teaching Hospitals NHS Foundation Trust very soon and we’re looking to recruit first class health care assistants to support delivery of high quality patient care within a rehabilitation service. We know that timely access to excellent nursing care and therapeutic intervention improves recovery for our patients and it’s our mission to deliver treatment in the right place, at the right time so that our patients can achieve their recovery goals and get back to the comfort of their home environment at the earliest opportunity. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Currently some of our patients are with us for long stays so we have decided that we want to complement the existing community offer, through extending our services on site to create a holistic patient journey to support patients to recovery. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re looking for an opportunity to make a real difference to patient outcomes and develop your skills, knowledge and experience in the field of rehabilitation, then this is an excellent opportunity to contribute to our amazing team who are passionate about the care and support they deliver to our patients.&lt;/p&gt;\n&lt;p&gt;We want you there with them, right by their side, helping them through it with your empathetic qualities and calm nature. We want the best and most flexible people to provide support to our therapy and nursing teams in our brand new service and we make no apologies for that…..we need you and the wealth of care experience you bring!&lt;/p&gt;\n&lt;p&gt;You will have ample opportunity to learn and understand the vital role that all our team members play to provide our patients with the gold standard of rehabilitative care. You will work alongside Physiotherapists, Occupational Therapists, Nurses and a range of other Allied Health Professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Tuesday 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;It’s impossible to cram everything in just one advert, so we really welcome you to get in touch and have a chat with us to find out a lot more about joining us. Contact one of our team: &lt;br /&gt;Anna.Conlan@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RPH, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Health Care Assistant - Rehab Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256232", "validThrough": "2020-11-09T23:59:59+0000"}