{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata + 5% HCAS"}}, "datePosted": "2020-10-26T17:01:14+0000", "description": "&lt;p&gt;Are you a qualified in speciality Neonatal Nurse with experience of working within a neonatal unit, who is committed, innovative and looking for an exciting challenge with the opportunity to enhance your leadership, management and professional development?. Why not join our Neonatal Team at the Princess Alexandra Hospital and let us help facilitate your professional journey&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We take great pride in delivering high standards of care to babies and their families in line with our philosophy of promoting family centred care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a motivated, enthusiastic and friendly team, the Trust is committed to staff development and offers us strong support. As a NICU our focus is to provide consistently high quality care in a safe, effective, responsive and caring environment for all our babies and their families.&lt;/p&gt;\n&lt;p&gt;We have 16 cots, with a capacity for 2 intensive care, 4 High Dependency and 10 Special care cots. We have a dedicated Neonatal Community Team, as well as two trainee Advanced Neonatal Practitioners and a practice development nurse&lt;/p&gt;\n&lt;p&gt;As new member of the team you will be fully supported by the whole team and we have an excellent in house training and SIM programme .&lt;/p&gt;\n&lt;p&gt;We are active within the East of England Operational Delivery Network, contributing to pioneering work influencing practices across the East of England Neonatal Networks as well as Nationally.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanelle GardnerJob titleHead of Nursing for Children and ServicesEmail addressjanelle.gardner@nhs.netTelephone number01279827446&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Alexandra Hospital, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Practice Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243526", "validThrough": "2020-11-09T23:59:59+0000"}