{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc."}}, "datePosted": "2020-11-04T14:16:00+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Focus support team provide longer term care for people with serious and enduring mental health concerns.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Trainee Community Nurse working in a community setting you will work under the supervision of a Community Practitioner to promote and deliver evidence-based care for service users with mental health conditions in their own homes and within a variety of accommodation settings.&lt;/p&gt;\n&lt;p&gt;The post holder will deliver, or advise on the delivery of, high quality safe care, ensuring consistently high standards of practice and clinical excellence which comply with their registered professional body and code of professional conduct.&lt;/p&gt;\n&lt;p&gt;The role includes leading the delivery of comprehensive service user assessment, planning, implementation and evaluation of person-centered care in a collaborative way. The post holder will co-ordinate a first-class service that includes assessment and monitoring of physical health, maintaining service users’ rights, supervising junior staff and students, working collaboratively with the Multi-Disciplinary Team and maintaining a safe and therapeutic working environment and accurate records.&lt;/p&gt;\n&lt;p&gt;The band 5 post is only open to staff with a recognised professional qualification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for 3 Centre’s; 332 Brixton Road which is the North Living Well Centre and 312 Brixton Road which is the South-East Living Well Centre. Both Centre’s are within easy reach of Brixton underground and Brixton Train station and regular bus routes.&lt;/p&gt;\n&lt;p&gt;The South West Centre is based at Station House, Streatham High Road, this Centre is right next to the station and has an extensive network of bus routes that stop outside the building.&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Staff restaurants&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJudy NewmanEmail addressJudy.Newman@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "332 Brixton Road, London, SW9 7AA, London", "postalCode": "SW9 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.11294"}}, "title": "Mental Health Community Nurse -  Lambeth", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256185", "validThrough": "2020-11-18T23:59:59+0000"}