{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa"}}, "datePosted": "2020-11-05T16:01:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Improvement Manager &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8b&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position offers an exciting opportunity for an inspiring leader to join our Quality Improvement Hub, taking our Trust to the next level of achievement. We are entering a new era with an accelerated pace for improvement as we restore and transform following the Covid-19 emergency. We are embracing opportunities to achieve excellence using the latest thinking in improvement science and lean methodologies. The post holder will have a pivotal role in this new world, ensuring safety is at the heart of everything we do. Key to this is delivery of our Quality Improvement Strategy, with responsibility for a number of key programmes and development of a new team of skilled improvement specialists.&lt;/p&gt;\n&lt;p&gt;The Trust has committed to a number of large scale change programmes that aim to reduce harm and save lives. The post holder will work with our people and partners from the board to the front line, with a focus on collaboration. The Trust vision is to build a workforce who are passionate about improvement and have skills to achieve the change needed. This post will be key to delivering this ambition.&lt;/p&gt;\n&lt;p&gt;The successful candidate will possess an exceptional level of improvement expertise and have extensive experience of driving and influencing change across a healthcare setting. The ability to manage a number of successful programmes, teach, coach and work directly with patients and families is essential. A working knowledge of lean practices would be a distinct advantage.&lt;/p&gt;\n&lt;p&gt;In return, we offer a unique opportunity to shape tomorrow’s services in an innovative, dynamic and fun team. There will be opportunities to develop your skills and gain new experiences.&lt;/p&gt;\n&lt;p&gt;Interviews to take place on 12th or 13th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatharine GoldthorpeJob titleAssociate Director of Quality ImprovementEmail addressKatharine.goldthorpe1@nhs.neTelephone number01253 956938Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katharine Goldthorpe | Associate Director of Quality Improvement&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whinney Heys Road, Blackpool, Lancashire, FY3 8NR, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Senior Quality Improvement Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258466", "validThrough": "2020-11-08T23:59:59+0000"}