{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-09T09:00:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Join our dynamic team and drive forward an award winning Built Environment Art + Design Programme at an outstanding NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute Trusts in the UK, MFT employs more than 23,000 staff working across nine hospitals and in the community, providing care for approximately 750,000 people every year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lime is a multi-award winning Arts and Health organisation with global recognition for excellence in the delivery of art + wellbeing projects in hospital and community healthcare settings. Established in 1973, and based at Manchester University NHS Foundation Trust (MFT) in central Manchester, Lime boasts a diverse portfolio of projects spanning 47 years. Lime has forged strategic partnerships within health, education and cultural sectors, both nationally and internationally and received numerous awards and recognition, including recently, a Highly Commended award from the Design and Health International Academy, multiple Building Better Healthcare awards including the 2019 shortlist for Best Collaborative Arts Project and winner of the international category ‘Patient Choice’ award and Best Collaborative Arts Project award 2018.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post presents an exciting opportunity for an experienced and skilled project manager to deliver the Built Environment Arts Programme and make an important contribution toward MFT being recognised as a global landmark for culture and wellbeing in healthcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lime is currently presented with new opportunity to integrate innovative art + design schemes across a broad range of major healthcare developments backed by significant multi-million-pound investments. It is an exciting opportunity to apply your expertise, join us at the beginning of an exciting journey and develop through a challenging and complex projects programme. With your help, Lime will build on existing and develop new art and design initiatives to extend the reach of our service for the benefit of 1000’s of NHS patients and staff alike.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the Built Environments Arts Project Manager, you’ll plan, develop and deliver an effective projects programme for our healthcare clients across MFT in line with Lime’s core vision and strategy and MFT key priority areas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will simultaneously manage and deliver a range of complex projects and work across a variety of key areas identifying new project opportunities and securing funding, monitoring projects, managing budgets, preparing reports and presenting complex data to key NHS stakeholders/partners, co-ordinating consultations, focus groups and workshops, managing project teams and preparing project briefs and commissioning contracts, contributing toward Lime’s evaluation framework and research objectives, all the while upholding a positive and professional approach to advocating arts and health across the Trust and in the public domain. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required skills and experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an individual with extensive project management experience upheld by a solid track record of delivering projects in the public realm. Experience of managing art + design projects in healthcare sector is desirable, but not essential.  You will have advanced knowledge of effective project management and adequate knowledge and experience of securing project funds and fundraising. You will evidence an ability to effectively manage others and resolve project issues when they arise.&lt;/p&gt;\n&lt;p&gt;Self- motivation and the ability to work autonomously, strong interpersonal, negotiation and collaborative skills and IT literacy are all essential. You’ll also need a degree and post grad qualification or equivalent Knowledge acquired through training + experience&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Arts Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219507", "validThrough": "2020-11-06T23:59:59+0000"}