{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclsuive of HCAS"}}, "datePosted": "2020-11-05T13:01:37+0000", "description": "&lt;p&gt;&lt;strong&gt;The Royal Free London NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Group Clinical Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Radiology Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MRI Diagnostic Radiographer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6: Full time: 37.5 hrs per week, including Weekends and Bank Holidays&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A wonderful opportunity has become available to join the Radiology Department at the Royal Free London NHS Foundation Trust as a permanent Band 6 MRI radiographer.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and experienced Radiographer who wants to join a dynamic MRI team to provide a high quality and efficient 7-day MRI service at the Royal Free. We are seeking Radiographers ideally with MRI experience.&lt;/p&gt;\n&lt;p&gt;The ideal candidate must also have excellent communication skills, a team and patient centred approach and enjoy teaching and sharing their knowledge with others.&lt;/p&gt;\n&lt;p&gt;The Royal Free London NHS Foundation Trust is a multi-specialism site and a centre of excellence for both Vascular and HPB and is the world leading hospital in treating Infectious Diseases. We have joined with Barnet Hospital and Chase Farm hospitals to become one of the largest NHS Foundation Trusts in the UK.&lt;/p&gt;\n&lt;p&gt;The MRI department performs a wide variety of examinations which include Neuro, ENT, Hepatobiliary, Gastro Intestinal, Oncology, Urology, Breast imaging, Chest, Infectious Diseases, MSK, Gynae, Paediatrics and Angiography specialities. We also participate in clinical trials that support our large Research Department in partnership with UCL.&lt;/p&gt;\n&lt;p&gt;The MRI department is expanding and a multimillion pound replacement program is currently underway. We currently have a Philips 1.5T Ingenia MRI Scanner, a 1.5T Siemens Sola MRI scanner, a 3.0T Siemens Vida and a 1.5T Siemens Aera Mobile MRI Unit. By January 2021 the 1.5T Achieva Nova Dual Scanner will be replaced with Siemens 1.5T Sola scanners so that the department will have 4 state of the art MRI scanners.&lt;/p&gt;\n&lt;p&gt;The Royal Free invests in our staff with many CPD opportunities so if you are looking to enhance your career in a world leading and supportive environment, the Royal Free is the place to be. We encourage advanced practice and currently have Plain Film, CT, and MRI reporting radiographers who have rostered reporting sessions. This position would involve 7 day working and shifts from 7:30am until 7pm including weekends and a Bank Holiday on-call commitment.&lt;/p&gt;\n&lt;p&gt;The Royal Free Hospital is situated in the beautiful Hampstead area, a vibrant part of London with cafes, restaurants, shops and pubs, and the hospital is located in close proximity to Hampstead Heath. The hospital is easily accessible by underground and Overground train services and regular buses.&lt;/p&gt;\n&lt;p&gt;Please note all new appointments at the Royal Free London NHS Foundation Trust are subject to a 6 month probation period.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Magda Barrow&lt;/p&gt;\n&lt;p&gt;Job title: MRI Superintendent&lt;/p&gt;\n&lt;p&gt;Email address: magda.barrow@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02077940500 ext 36121&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 6 MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257767", "validThrough": "2020-11-19T23:59:59+0000"}