{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £51,668 pa (based on full time hours)"}}, "datePosted": "2020-10-12T14:15:28+0100", "description": "&lt;p&gt;Part time post 0.6wte / 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;Are you passionate about older people and their mental health and particularly dementia?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Clinical Psychologist Band 8a (or a Band 7 with preceptorship opportunity) with real enthusiasm to work in the on the Older Peoples Mental Health organic inpatient service Poppy Ward at the Gosport War Memorial Hospital. The service provides care to older people with organic conditions such as people with dementia and behaviour which challenges and support to their carers and families.&lt;/p&gt;\n&lt;p&gt;This is a new and exciting post and an opportunity to develop a new psychological service to OPMH organic inpatients. The responsibilities will include the provision of psychological assessment (including neuropsychology if appropriate) and some therapeutic interventions to older people and their carers an inpatient setting, to be a source of advice to the multi-disciplinary team on psychological issues and to offer consultation and advice to other mental health professionals. This includes the assessment and treatment of the behavioural and psychological symptoms of people with dementia.&lt;/p&gt;\n&lt;p&gt;Gosport is in the Portsmouth and South East Hampshire Division of Southern Health NHS Foundation Trust and there are currently 7 other Clinical Psychologists working with older people in the Trust. Four of the clinical psychologists have roles within the inpatient services and will be additional support to develop this role. Regular clinical supervision will be provided and we also meet monthly as a group for neuropsychological supervision. There are close working relationships with Adult Mental Health Services and the University of Southampton, which is the base for the Doctorate in Clinical Psychology Course. There are opportunities to be involved in teaching Trainee Clinical Psychologists and for collaboration with other professionals and academic staff and participation in research. It is possible some travel may be required.&lt;/p&gt;\n&lt;p&gt;The post can be appointed as a preceptorship towards an 8a role for the right applicant wishing to develop from a band 7 role and responsibilities would be adjusted accordingly.&lt;/p&gt;\n&lt;p&gt;Interview date: TBC Interviews may be conducted via video-conferencing software&lt;/p&gt;\n&lt;p&gt;Applicants will also be considered for other Clinical Psychologist vacancies within OPMH Southern Health.&lt;/p&gt;\n&lt;p&gt;For further information, please do contact: Lauren Rooney Principal Clinical Psychologist on 07776151357 laurenrooney@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO12 3PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7931", "longitude": "-1.14807"}}, "title": "Clinical Psychologist Prinicpal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222696", "validThrough": "2020-11-11T23:59:59+0000"}