{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa Inc"}}, "datePosted": "2020-10-30T11:45:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Speech and Language Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0.4 WTE Preschool Complex Needs Team, 0.6 Community Clinics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Location: Based at Early Years Centre, and Tooting Community Clinic&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join our dynamic, evidence based, motivated and enthusiastic speech and language therapy team. We are seeking a passionate and highly driven Specialist Speech and Language Therapist to take up an exciting opportunity available within early year&#39;s community team with some days specialising in complex needs and other working days in Tooting clinic. &lt;span&gt;The Early Years Centre (EYC) is a multi-agency resource centre for young children with complex needs and their families. The centre aims to ensure that all young children with special needs in Wandsworth have the chance to fulfil their potential through the process of early assessment/ intervention and supporting families. The SLT team have always been an integral part of the team based at EYC, where various services are based such as Portage, Contact a family and paediatrician. Our community clinics predominantly see preschool children (and older dysfluent children)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To achieve our commitment to delivering evidence based, high quality and progressive services we have a strong ethos of excellence. The post holder will contribute to the delivery of a high quality service in both parts of the same team. The role will encompass line management and support of junior speech and language therapists and staff and speech and language therapy assistants. The role will also provide the opportunity to provide specialist assessment, management and treatment of children with a range of communication needs in the clinics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A degree in Speech and Language Therapy and HCPC registration.&lt;/li&gt;\n&lt;li&gt;Some knowledge and experience in working with children with ASD/SCD and a range of complex needs in a multi-disciplinary setting&lt;/li&gt;\n&lt;li&gt;In-depth working knowledge of the Early Years Foundation Stage curriculum&lt;/li&gt;\n&lt;li&gt;Ability to work closely with other agencies such as Education and Social Services as well as health colleagues.&lt;/li&gt;\n&lt;li&gt;Some knowledge of current intervention policies, practice and national drivers particularly in relation to Autistic Spectrum Disorders and young children with a range of developmental difficulties&lt;/li&gt;\n&lt;li&gt;Experience of and specialist skills working with a diverse paediatric caseload in mainstream schools or clinics.&lt;/li&gt;\n&lt;li&gt;Experience of supporting the evaluation of service delivery in mainstream schools or clinics.&lt;/li&gt;\n&lt;li&gt;Excellent organisational skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly and independently where necessary&lt;/li&gt;\n&lt;li&gt;Enthusiasm, imagination and initiative&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The role give you the opportunity to be involved in training early years l staff and parents, the encouragement and opportunity to be involved in research, journal clubs and peer supervision. Twice a year the team completes a ‘skills hub’ which allows time for observation and learning directly from other members of the wider Therapist team.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in developing and delivering universal and / or targeted training sessions.&lt;/li&gt;\n&lt;li&gt;Ability to work effectively as part of a multi-agency team.&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly and independently where necessary.&lt;/li&gt;\n&lt;li&gt;Enthusiasm, imagination and initiative.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We will provide:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work within a highly skilled and experienced team of Speech &amp; Language Therapists.&lt;/li&gt;\n&lt;li&gt;Access to a structured and supportive professional development process.&lt;/li&gt;\n&lt;li&gt;Access to regular line management and clinical supervision&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will report to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Speech and Language Therapy Clinical Team Leader.&lt;/li&gt;\n&lt;li&gt;We are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment.&lt;/li&gt;\n&lt;li&gt;Access to day nursery Season ticket loan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanna HardmanJob titleDeputy Head of Children&#39;s TherapiesEmail addressjoanna.hardman@stgeorges.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Jill Gisby (Clinical Co-ordinator Pre-school Complex Needs team) on 0208 947 9025 or Jill.Gisby@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Clinic and Early Year&#39;s Centre, London", "postalCode": "SW17 0LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4352", "longitude": "-.187312"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250006", "validThrough": "2020-11-13T23:59:59+0000"}