{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-10-15T09:28:19+0100", "description": "&lt;p&gt;Please note that this is a temporary 0.5WTE post to cover maternity leave (anticipated 4-6 months)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity to cover maternity leave for current postholder we are seeking a suitably qualified clinical psychologist to work into the Inpatient Level 1 and Level 2a neuro-rehabilitation units based at Leicester General Hospital. These units provide highly specialist rehabilitation for people with complex acquired brain injuries across the East Midlands.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be required to undertake complex neuropsychological assessments and interventions with individuals and families. There is strong multi-disciplinary working on the units and the contribution of psychology staff is highly valued. This will require close working with MDT colleagues including Rehabilitation Consultants, Nurses, Physiotherapists, Occupational Therapists, Speech and Language Therapists and working with colleagues to provide a psychologically informed environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post sits within the Leicester Neuropsychology department and successful applicants will receive excellent support and regular supervision and opportunities for continuing professional development in line with special interests and service objectives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal visit please contact Dr Amanda Mobley, Consultant Clinical Neuropsychologist , Tel: 0116 258 4956 Email amanda.mobley@leicspart.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE5 4PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6301", "longitude": "-1.08288"}}, "title": "Band 8a Clinical Psychologist in Neuropsychology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227469", "validThrough": "2020-11-13T23:59:59+0000"}