{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "AfC Band 6: £31,365-£37,890 pa"}}, "datePosted": "2020-10-27T09:04:35+0000", "description": "&lt;p&gt;JOIN OUR OUTSTANDING DCHS FAMILY!&lt;/p&gt;\n&lt;p&gt;Derbyshire Community Health Services has been rated as an ‘outstanding’ trust by the Care Quality Commission; we have achieved this by providing high quality patient care within an inclusive organisation that works together and shows care and compassion for each other.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join us as one of the largest specialist community NHS providers in the country – one that is also among the very best NHS employers as voted by its own staff and by CQC.&lt;/p&gt;\n&lt;p&gt;DCHS is a top performing NHS Trust that strives for innovation and improvement for the service and individuals that work within it, we currently have the following opportunity available.&lt;/p&gt;\n&lt;p&gt;As an employee it will be your responsibility to ensure that your behaviour and values reflect those set out in the DCHS Way outlined on our website and in the additional information provided&lt;/p&gt;\n&lt;p&gt;This post is based at  Walton Unit which is a specialist provider of Mental Health Services in North Derbyshire.&lt;/p&gt;\n&lt;p&gt;If you are looking for a role that provides you with the opportunity to further develop your skills in MH / organic illness then this post could be for you.&lt;/p&gt;\n&lt;p&gt;This post is offered on a 12 month, fixed term basis, to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;You will be supported by a multi-disciplinary team in undertaking this role and will receive supervision by the lead OT for the OPMH service. &lt;/p&gt;\n&lt;p&gt;For ore inormation, please contact Julie Thornhill, 01246 515611&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124692.jpg", "name": "Derbyshire Community Health Services NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walton hospital, Chesterfield", "postalCode": "S40 4HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2482", "longitude": "-1.45389"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243775", "validThrough": "2020-11-09T23:59:59+0000"}