{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-19T09:31:08+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Occupational Therapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting permanent Occupational Therapist opportunity has arisen within the Therapy Team at Prospect Park Hospital. This is a 9-5 post working across four adult acute wards, two older adult wards and a Psychiatric Intensive Care Unit You will be part of a diverse team composed of occupational therapy, physiotherapy, dietetics and speech and language therapy.&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can offer you a rewarding career, with great opportunities, where you can really make a difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;Working in the dynamic, people-centred environment of our In-Patient Unit, under the guidance of specialist therapists, as an Occupational Therapist you will be a highly-valued member of our team, supporting a wide range of patients, nurturing their progress and helping them in their transition home.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate Allied Health Professional led team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth with opportunities to help you to build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Enthusiastic and experienced working with working age adults and older adults, you will have a passion for caring, a warm personality and the resilience to play a vital role in helping patients take the next step in their journey. With excellent communication and people skills, you will be empathetic and sensitive to the needs of patients, their families and carers. You will engage and motivate patients therapeutically, using verbal and non-verbal skills where there are barriers to communication and understanding. Collaborating with our multidisciplinary team, you will be eager to learn.&lt;/p&gt;\n&lt;p&gt;Helping patients return into the community, you will enjoy working across multiple locations and have access to your own car. Your energy and drive will be rewarded with the support of an enthusiastic Therapy team that strives to create a warm, friendly and compassionate environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have and you would be very welcome to arrange to visit our unit. Please don’t hesitate to call Jack Cairns on 0118 960 5170 or email Jack.Cairns@berkshire.nhs.uk who would be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to our salary car scheme, and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231617", "validThrough": "2020-11-08T23:59:59+0000"}