{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 4"}}, "datePosted": "2020-11-05T09:57:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Medical Secretary Band 4 | Audio Typing and Secretarial Administration | Bristol | Full Time and Permanent -Monday to Friday.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bristol Hospital have an exciting opportunity for a Senior Secretary ready for their next challenge, to join our team to support our Consultants in providing a high quality service, on a full time and permanent basis. Working with and leading our wonderful team, you will be pivotal in ensuring an effective and efficient service.&lt;/p&gt;\n&lt;p&gt;Long established since 1987, Spire Bristol Hospital have been providing excellent care, expertise and knowledge in a safe, clean environment for over 25 years, offering the greatest range of high quality treatments, services and diagnostic facilities in the South West.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading the team in the provision of an efficient and timely secretarial service to assigned consultants and any other associated teams&lt;/li&gt;\n&lt;li&gt;Production of medical letters, operation/clinic notes and discharge summaries&lt;/li&gt;\n&lt;li&gt;Developing strong working relationships with our Consultants, Administration Teams, Nursing staff and a range of other departments and patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be considered for the role, we would ideally like to see applications from established Medical Secretaries with experience of healthcare and knowledge of medical terminology - this can be one specialism&lt;/li&gt;\n&lt;li&gt;Strong audio-typing and administration skills are essential&lt;/li&gt;\n&lt;li&gt;Previous team management and/or leadership skills is also a requirement for this role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Senior Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257129", "validThrough": "2020-11-19T23:59:59+0000"}