{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T12:46:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Base: Atherstone Clinic &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;South Warwickshire Foundation Trust have been rated “Outstanding” by the CQC; and there has never been a more exciting time to advance or start your career with us!&lt;/p&gt;\n&lt;p&gt;If you are looking for a change of scenery and the prospect of working out in the fresh air in different environments is something that would appeal to you – a job within our dynamic community nursing team could be perfect for you.&lt;/p&gt;\n&lt;p&gt;The NHS is continuously changing to meet the needs of our patients. Care outside of the hospital setting is a critical service in the role of the NHS. It is an essential cog that allows the NHS to function successfully. Different services are working closely together, with the aim to reduce hospital admissions and deliver an excellent standard of care to patients within their own home. This is an exciting opportunity to continually develop and learn new skills to meet these needs as the service continuously evolves.&lt;/p&gt;\n&lt;p&gt;SWFT is an excellent performing NHS Trust who really cares about their staff. We have the exciting opportunity to recruit Community Staff Nurse roles within Rural North Warwickshire due to staff progression and maternity leave. The successful candidate would be working within an area that has outstanding teamwork and leadership to ensure that patients receive the best possible care. The successful candidate will need to have a general knowledge of current best practice in Community Nursing but experience is not essential and newly qualified are welcome.&lt;/p&gt;\n&lt;p&gt;We will provide you with a structured induction process and training period to ensure you have the best opportunity to develop and learn new skills and competence.&lt;/p&gt;\n&lt;p&gt;The Service operates seven days a week and flexible working is required. The requirements are that you should hold a valid UK full driving license and be willing to travel across Rural North Warwickshire which consists of Arley, Atherstone, Polesworth, Kingsbury, Coleshill and surrounding villages. A mileage allowance is available.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa PerrinsJob titleProfessional LeadEmail addressLisa.Perrins@swft.nhs.ukTelephone number07789947204&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Integrated Health Team 1 F63756, Atherstone", "postalCode": "CV9 1AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5785", "longitude": "-1.55019"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257720", "validThrough": "2020-11-19T23:59:59+0000"}