{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 per annum Inc HCAS"}}, "datePosted": "2020-10-23T11:01:51+0100", "description": "&lt;p&gt;We offer an opportunity for a Senior Clinical Manager within Therapies services to join this innovative and friendly AHP department. With a reputation for excellence and a strong commitment to supporting the CPD of our therapists, we are looking for a skilled and enthusiastic therapist to join our innovative department, with a reputation for excellence.&lt;/p&gt;\n&lt;p&gt;There is an opportunity to be part of large services of AHPs to deliver high quality, evidence-based care to inpatients including care of the elderly, acute medical and surgical caseloads at Northwick Park Hospital and other LNWUH sites.&lt;/p&gt;\n&lt;p&gt;The post holder will manage a portfolio of Therapies services within our acute hospital services including the management of Occupational Therapists, Physiotherapists and Support staff.&lt;/p&gt;\n&lt;p&gt;You will be an autonomous practitioner providing specialist Occupational Therapy services to an Acute Therapies caseload of clients with complex needs and /or discharge planning. They will be expected to manage their own caseload, providing second opinions and specialist advice. They will work alongside multidisciplinary staff to ensure specialist therapy assessments and discharge care plans are in place for patients along unplanned care pathways. They will be expected to contribute to collaborative working with clients, carers and with colleagues in Health, the voluntary sector and Social Services in planning and delivery of services. The post holders will also provide specialist Occupational Therapy and discharge planning advice to other MDT colleagues as appropriate.&lt;/p&gt;\n&lt;p&gt;The OT team has a wide skill mix covering acute and community services and is committed to CPD of all of our therapists. LNWUH is an early adopter site of 7-Day Service for acute services. You will be expected to work a maximum of one in five weekends and two bank holiday days per year where required. You will be entitled to the equivalent time off in lieu during the week.&lt;/p&gt;\n&lt;p&gt;The LNWUH NHS Trust adult specialist Occupational Therapy service provides a service to the people of Brent, Harrow and beyond. In order to meet caseload demands and/or to cover sickness absence or other vacancies, you may be required to cover different caseloads or to work at other sites within the London North West University Hospital Trust. Permanent changes to posts will only be made after consultation with the post holder.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie ReadJob titleDeputy Director Of TherapiesEmail addressjulie.read@nhs.netTelephone number07776674035&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NPH / CMH / EHT, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Acute Therapies Services Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240194", "validThrough": "2020-11-06T23:59:59+0000"}