{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 p.a."}}, "datePosted": "2020-10-14T10:17:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you an enthusiastic, motivated and hardworking registered or newly qualified RMN looking for a new experience? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to join an established team at Waterston unit who work well together to develop a high quality service? The team are highly motivated and have a track record of implementing recovery-based care, with an emphasis on therapeutic and diverse interventions. We work closely as a multi-disciplinary team and value learning. We work well together as a team and are able to offer a high level of support.&lt;/p&gt;\n&lt;p&gt;Waterston Unit is an adult, Acute Admissions, Mental Health, mixed sex ward, with a total of 18 beds based at Forston Clinic near Dorchester. Waterston is set in a beautiful location with We provide a high quality of care and treatment for people who have psychiatric, social, psychological and emotional health needs and are in an acute crisis phase of their illness. The purpose of the ward is to offer comprehensive assessments and treatment enabling Service Users to have shorter stays in hospital and to develop clear plans of care.&lt;/p&gt;\n&lt;p&gt;The Trust runs excellent development courses, which you can attend to learn and hone your skills. Your continuous professional development will be planned and tailored to your needs together with support to achieve the personal goals set via annual appraisal and you will receive regular clinical and management supervision.&lt;/p&gt;\n&lt;p&gt;For newly qualified nurses we provide a very comprehensive and fully supported Preceptorship Programme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other key skills are;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Valid NMC Pin is essential and a good working knowledge of CQC standards;&lt;/li&gt;\n&lt;li&gt;An effective communicator with the ability to engage with our service users to understand their needs to provide excellent services of care;&lt;/li&gt;\n&lt;li&gt;The ability to build and maintain excellent working relationships with external care professionals and families to be customer focused and to continually develop the services we provide;&lt;/li&gt;\n&lt;li&gt;Promote ownership of care programmes by fully involving service users and their families in developing, agreeing and evaluating care programmes;&lt;/li&gt;\n&lt;li&gt;Fulfil professional and legal responsibilities with respect to the safe storage handling and administration of medicines;&lt;/li&gt;\n&lt;li&gt;This post requires that you work a shift rotation including nights.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be required to undertake a &lt;strong&gt;Prevention and Management of Violence and Aggression&lt;/strong&gt; course and it is a condition of your employment that you successfully complete all aspects of this course; if this is not achieved you will not be able to commence working in the post.&lt;/p&gt;\n&lt;p&gt;If you are interested in moving to Dorset we also offer a generous relocation package of up to £5,000. For further details on relocation expenses please email dhc.careers@nhs.net.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recommend a friend or family member and earn cash!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a friend or family member you would recommend to join us? Or do you know someone who wants to return to practice in the NHS? If the person you refer is appointed by the Trust and completes their probationary period you will receive £250 reward payment for the introduction! Please contact the recruitment team if you require further info!&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Suart, Ward Manager - Email: sarah.suart@nhs.net Telephone: 01305 362039&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorchester", "postalCode": "DT2 9TB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7543", "longitude": "-2.4534"}}, "title": "Staff Nurse RMN, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225661", "validThrough": "2020-11-11T23:59:59+0000"}