{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T13:01:44+0000", "description": "&lt;p&gt;Are you a newly qualified Nurse? A Nurse looking for a new direction? Or Perhaps you are looking to return to practice. Whatever your circumstances, at Buckinghamshire Healthcare NHS Trust we welcome candidates from a variety of nursing backgrounds and will support &lt;strong&gt;YOU&lt;/strong&gt; and your nursing journey.&lt;/p&gt;\n&lt;p&gt;Buckinghamshire Healthcare NHS Trust has around 6,000 highly-trained, qualified doctors, nurses, midwives, health visitors, therapists, healthcare scientists and other support staff caring for more than half a million patients from Buckinghamshire and neighbouring counties every year.&lt;/p&gt;\n&lt;p&gt;As an integrated Trust, we provide care in people’s home, from one of our five community hospitals at Amersham, Thame, Marlow, Buckingham and Chalfonts &amp; Gerrards Cross Hospital or from one of our acute hospitals at Wycombe Hospital and Stoke Mandeville Hospital.&lt;/p&gt;\n&lt;p&gt;You will join a busy multi-disciplinary team who are dedicated in providing individualised, evidence based care. You will be self-driven, striving to provide a high standard of nursing care. Your philosophy should be that the patient’s needs come first&lt;/p&gt;\n&lt;p&gt;We have exciting opportunities to offer across our divisions:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Integrated Medicine division: Emergency Department, AOU, Short stay ward, Endoscopy, Endocrine, Gastroenterology, Stroke and Cardiology, Respiratory&lt;/li&gt;\n&lt;li&gt;Integrated Elderly Care: Community Adult Nursing teams, Neuro Rehab, Care of the Elderly&lt;/li&gt;\n&lt;li&gt;Surgical and Critical Care division: Intensive care unit, Trauma and Orthopaedics, general surgical floor, Theatres, Outpatients, Plastics and Burns&lt;/li&gt;\n&lt;li&gt;Specialist Services division: National Spinal Injuries Centre, Cancer &amp;Haematology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you don&#39;t see your area of nursing interest in this list, we would still welcome your application as we have vacancies across the various specialties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Training and development – what we can offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We recognise the value of experiences that each individual brings to our organisation. At Bucks, we offer a range of learning support and opportunities for you to enhance your knowledge and skills and to achieve your aspirations!&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;For newly qualified, return-to-practice and international nurses, we can offer a 24 month preceptorship programme including restorative supervision&lt;/li&gt;\n&lt;li&gt;Career Development and CPD support&lt;/li&gt;\n&lt;li&gt;Leadership Training and Development programmes&lt;/li&gt;\n&lt;li&gt;Inter-professional Simulation&lt;/li&gt;\n&lt;li&gt;Clinical Skills Training&lt;/li&gt;\n&lt;li&gt;Local teaching and the opportunity to build your competency portfolio&lt;/li&gt;\n&lt;li&gt;Excellent Library and Outreach services and support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are fully committed to the health and wellbeing of our staff and our &lt;strong&gt;People Directorate&lt;/strong&gt; offers a variety of fantastic services and&lt;strong&gt; dedicated&lt;/strong&gt; resources to support you every step of the way.&lt;/p&gt;\n&lt;p&gt;We are extremely proud of our services and want you to be part of our future, joining our healthcare heroes at Buckinghamshire Healthcare NHS Trust!&lt;/p&gt;\n&lt;p&gt;***We have full time and part time posts available and provide a 24/7 service***&lt;/p&gt;\n&lt;p&gt;***Please specify on your supporting statement what speciality and site you are looking to work***&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Campbell, Recruitment Manager&lt;/p&gt;\n&lt;p&gt;Email address : helen.campbell22@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 07825175373&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital or High Wycombe Hospital, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Band 5 Staff Nurse - Medicine, Surgery, Community, Specialist Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257772", "validThrough": "2020-11-19T23:59:59+0000"}