{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60396", "minValue": "58242", "unitText": "YEAR", "value": "£58,242 - £60,396"}}, "datePosted": "2020-10-19T12:12:36+0100", "description": "&lt;p&gt;&lt;strong&gt;Deputy Head of EHS / Lead at Richmond Cluster (Clinical / Counselling Psychologist or Systemic / Art Psychotherapist)&lt;/strong&gt;&lt;br /&gt;Salary - £58,242 - £60,396 | Based in Twickenham | Permanent | Full Time (36 Hours)&lt;br /&gt;&lt;br /&gt;Achieving for Children recognise these are unprecedented times, but we continue to build capacity to support our most vulnerable groups. To do this we are continuing to attract talented professionals to join us as we continue to provide &lt;strong&gt;OUTSTANDING&lt;/strong&gt; (Kingston ILACS Ofsted 2019) services.&lt;br /&gt;&lt;br /&gt;If you have the skills that will enable us to continue to enhance our practice and improve outcomes for children further, we want to hear from you. We are looking for bright, enthusiastic people who have the passion and the drive to make a positive difference to children’s lives. By recognising and championing strengths we know we can make a real difference. It’s a genuine team effort in AfC. That’s why we want talented people, like you, to join us and help create a brighter future for children and families.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;br /&gt;This role is part of the senior leadership team for the Emotional Health Service and we are focused on improving the emotional and mental health of children and young people. As an EHS Deputy Head of Service for Achieving for Children, you will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To contribute to the strategic leadership of the EHS&lt;/li&gt;\n&lt;li&gt;To provide the operational leadership for the EHS Richmond team including supervision and management of staff&lt;/li&gt;\n&lt;li&gt;To deliver evidence based therapy to children and their families&lt;/li&gt;\n&lt;li&gt;To lead on EHS SEND development plan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About AfC&lt;/strong&gt;&lt;br /&gt;We are a not-for-profit social enterprise owned by three local authorities (Kingston, Richmond and Windsor &amp; Maidenhead), we offer the freedoms of a social enterprise with the employment benefits of local government. To find out more about us click here. &lt;br /&gt;&lt;br /&gt;To be Deputy Head of Service for EHS at AfC, you will be passionate about making a positive difference to the lives of children and young people as well as demonstrating the following points:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualified as a Clinical / Counselling Psychologist, Systemic Psychotherapist or Art Psychotherapist&lt;/li&gt;\n&lt;li&gt;Have significant experience of working in UK CAMHS&lt;/li&gt;\n&lt;li&gt;Have experience in providing clinical supervision / line management of qualified staff&lt;/li&gt;\n&lt;li&gt;Have strong organisational abilities including: time management, creative-thinking, problem-solving and multitasking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About our benefits&lt;/strong&gt;&lt;br /&gt;When you join AfC you will have access to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Positive and supportive working environments&lt;/strong&gt; - We have a highly supportive working environment in which managers are challenging and supporting in equal measures.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Positive work-life balance&lt;/strong&gt; - Access to employee benefits and support forms part of our health and wellbeing offer.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A competitive salary and access to LA pension scheme&lt;/strong&gt; - Our salaries are benchmarked against other local authorities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A range of staff benefits and discounts managed via your own app&lt;/strong&gt; - Staff can enjoy a wide range of discounts on sports and leisure activities and everyday shopping through AfC My Place.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional reflective supervision&lt;/strong&gt; - Regular, high-quality reflective supervision which helps to build confidence is available to all.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong Management -&lt;/strong&gt; A strong performance management culture, with an equally strong focus on practice learning is embedded across the organisation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A fantastic learning and development offer&lt;/strong&gt; - A clearly set out and accessible learning and development pathway, offering an extensive range of training and learning opportunities is accessible for all. This includes funding for post qualifying courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out about all of the breadth of benefits of working for Achieving for Children click here.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Start dates&lt;/strong&gt;&lt;br /&gt;Achieving for Children have fixed start dates and candidates are advised to prepare for this should a job offer be accepted to ensure eligible continuous service is not affected. Please see the attached documentation for more information.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;To apply&lt;/strong&gt;&lt;br /&gt;If you would like more information about this role please see our Role Profile.&lt;br /&gt;&lt;br /&gt;Please apply online including a supporting statement addressing how you meet the criteria for this post detailing what skills, knowledge, experience and abilities you can bring to the role, as outlined in Role Profile posted.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: 8th November 2020&lt;br /&gt;&lt;strong&gt;Provisional Interview Date&lt;/strong&gt;: 27th November 2020 &lt;br /&gt;&lt;br /&gt;If you would like to find out more about this exciting opportunity, please contact Dr Jo Steer, Head of Emotional Health Service &amp; Consultant Clinical Psychologist on email at jo.steer@achievingforchildren.org for an informal discussion.&lt;br /&gt;&lt;br /&gt;Achieving for Children is an equal opportunities employer, this extends to welcoming candidates from BAME backgrounds. &lt;br /&gt;&lt;br /&gt;We are committed to safeguarding and promoting the welfare of children, young people and vulnerable adults. We expect all staff and volunteers to share this commitment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Royal Borough of Kingston upon Thames", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Twickenham", "postalCode": "TW1 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4475", "longitude": "-.326578"}}, "title": "Deputy Head of EHS / Lead at Richmond Cluster", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232193", "validThrough": "2020-11-08T23:59:59+0000"}