{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Unpaid"}}, "datePosted": "2020-11-02T15:20:17+0000", "description": "&lt;p&gt;Solent NHS Trust has been successful in its bid to develop a Mental Health High Intensity Service (HIS) for Veterans across the South East Region. The HIS will cover Hampshire, Isle of Wight, Buckinghamshire, Oxfordshire, Berkshire, Kent, Sussex and Surrey. This is a 22 month pathfinder programme under the leadership of NHSE. We will be working collaboratively with mental health Trusts, NHS 111 providers, other public sector organisations and partners from across the Voluntary, Community and Social Enterprise sector to deliver an ambitious transformative support model for veterans.&lt;/p&gt;\n&lt;p&gt;As part of the fund, the plan will be to roll out the clinical model developed locally in Portsmouth and replicate it elsewhere as appropriate.&lt;/p&gt;\n&lt;p&gt;We are now looking to form a small team to deliver this service in line with our organisational values. Our trust shared values (HEART – honesty, everyone counts, accountable, respectable and team work) support the development of a strong working culture and guides and inspires all of our actions and decisions.&lt;/p&gt;\n&lt;p&gt;An exciting role has arisen for an Honorary Assistant Psychologist who is able to commit to a minimum of 6 consecutive months of service. Under the supervision of a Clinical Psychologist, the successful candidate will undertake psychometric assessments and support in the evaluation of the service. The successful candidate will also support the Clinical and Governance Lead and Mental Health Leads in the provision of clinical work (where appropriate), and support the delivery of evidence-based practice by conducting searches of primary literature and research.&lt;/p&gt;\n&lt;p&gt;This post will be based at The Pompey Centre, Portsmouth, but the post holder may be required to work remotely across the South East region. Remote working may also be possible.&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Anna Weller&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Psychologist, Clinical and Governance Lead&lt;/p&gt;\n&lt;p&gt;Email address: anna.weller@solent.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0300 123 3934&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this is an unpaid post and is exempt from Solent NHS Trust contract and benefits.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth / South East Region", "postalCode": "PO4 8TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7968", "longitude": "-1.0695"}}, "title": "Honorary Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252589", "validThrough": "2020-11-09T23:59:59+0000"}