{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32320", "minValue": "32320", "unitText": "YEAR", "value": "£32,320 ( nights +20%,Bank Holidays +50%)"}}, "datePosted": "2020-10-29T16:25:08+0000", "description": "&lt;h2&gt;Join us today at Priory Hospital Hayes Grove and receive our £3000welcome to Priory bonus&lt;/h2&gt;\n&lt;h2&gt;Are you?&lt;/h2&gt;\n&lt;p&gt;A driven and dynamic Nurse?&lt;br /&gt;An experienced RMN or wanting to return to the profession after a career break?&lt;br /&gt;Wanting to make a difference to someone’s life?&lt;br /&gt;Ready for a new challenge?&lt;br /&gt;Wanting to work with the best nurses in the UK?&lt;/p&gt;\n&lt;p&gt;If you’ve answered yes to the above then get in touch with our nurse Recruiter Adam O&#39;Shea today on 07834514945 and make the first step towards your exciting future with The Priory. &lt;strong&gt;We are proud to offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent salary&lt;/li&gt;\n&lt;li&gt;Many benefits in line with the NHS&lt;/li&gt;\n&lt;li&gt;Working with a dedicated multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;NMC payment in full&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;li&gt;Access to development opportunities including:&lt;/li&gt;\n&lt;li&gt;Sponsorship of professional qualifications through our Individual Professional Development (IPD) panel&lt;/li&gt;\n&lt;li&gt;Improved CPD application &amp; panel process&lt;/li&gt;\n&lt;li&gt;Leadership &amp; management development&lt;/li&gt;\n&lt;li&gt;Support with your Revalidation&lt;/li&gt;\n&lt;li&gt;Long service award&lt;/li&gt;\n&lt;li&gt;Sign on bonus - £5000Welcome to Priory – either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum (T&amp;Cs Apply)&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;Donation to a charity of yourchoice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role :&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are now recruiting for a Charge Nurse will be based on the Lower Court - Private Adult Acute Ward.&lt;/p&gt;\n&lt;p&gt;The applicant will take an active role in management of the ward, under the supervision of the Ward Manager, and will take charge in their absence. The role holder will be expected to participate fully with the clinical team, undertake direct patient care and offer managerial and clinical supervision to nursing staff and Health Care Assistants .&lt;/p&gt;\n&lt;p&gt;Applicants must be self-motivated with good communication skills and leadership experience.&lt;/p&gt;\n&lt;p&gt;Applicants should have the following experience/qualifications:&lt;/p&gt;\n&lt;p&gt;• RMN/RNLD&lt;/p&gt;\n&lt;p&gt;• Mentorship Qualification (preferred)&lt;/p&gt;\n&lt;p&gt;• The ability to lead and motivate others&lt;/p&gt;\n&lt;p&gt;• A genuine interest in quality service delivery and development&lt;/p&gt;\n&lt;p&gt;• The ability to work under pressure and within tight deadlines&lt;/p&gt;\n&lt;p&gt;• Numeracy and evidence of analytical ability&lt;/p&gt;\n&lt;p&gt;• Experience in completing audits&lt;/p&gt;\n&lt;p&gt;Applicants must be willing to take on internal training roles, with the ability to deliver training programmes and demonstrate enthusiasm for learning and development. This responsibility will attract an additional financial enhancement. Excellent verbal and written communication skills are essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Hayes Grove is an independent 46-bed psychiatric hospital for Working Age Adults (mixed), located in SE London in the quiet village of Hayes, Kent. We provide care and treatment for patients with a wide range of Mental Health issues both as Inpatients, Daycare and Outpatients.&lt;/p&gt;\n&lt;p&gt;At Hayes Grove, our private ‘Lower Court’ specialises in treating general psychiatric conditions, and supports patients on our 28-day Inpatient Addiction Treatment Programme (drug, alcohol and other addictions). We also have a specialist, 20-bed NHS England-funded Eating Disorder Unit. as well as the 9-bedded Keston Unit, a specialist NHS-funded Asperger’s ward.&lt;/p&gt;\n&lt;p&gt;The Hospital is situated in a leafy setting, with excellent public transport links to central London, Croydon and the surrounding Borough of Bromley areas. Free car parking is available in the immediate vicinity of the hospital.&lt;/p&gt;\n&lt;p&gt;We welcome informal enquiries by phone or in person if you would like to come and visit before applying for a role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromley, Kent", "postalCode": "BR2 7AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3728", "longitude": ".013892"}}, "title": "Charge Nurse - Lower Court", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249069", "validThrough": "2020-11-30T23:59:59+0000"}