{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-02T13:16:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical and Non Clinical Duty Team Manager Advert&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are in the process of adding to our existing team and putting in place a 24/7 Duty Manager role across both our hospital sites, for this team we are looking for two Team Managers, at least one of which needs to be Clinical, we would very excited to hear from you if:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are excellent at motivating your team and know that by supporting them, we can run a fantastic service across our sites.&lt;/li&gt;\n&lt;li&gt;You have experience of training people at varying levels of experience with different backgrounds and skills.&lt;/li&gt;\n&lt;li&gt;You can write well thought through and meaningful reports and briefings for very senior level discussion within, our, and other organisations.&lt;/li&gt;\n&lt;li&gt;You have an excellent sense of humour – this team works under huge pressure at times and you will need to be able to tackle problems with a smile and a calm approach.&lt;/li&gt;\n&lt;li&gt;You enjoy talking to people across the organisation, the best ideas come from those that work with our patients every day and you will need to be able to draw those out and implement.&lt;/li&gt;\n&lt;li&gt;For the Clinical Team Manager, you will need to support our clinical team members with their revalidation, appraisals and clinical experience, ensuring they continue to make the most of their excellent clinical skills. You will also be supported by the Chief Nursing Office.&lt;/li&gt;\n&lt;li&gt;Work with every member of the team (Site Coordinators and Duty Managers) to ensure they have projects that inspire and excite them so they can develop their skills even further.&lt;/li&gt;\n&lt;li&gt;Provide support on the days where nothing goes right; ensure the team know they can turn to you and that you will help them with working through challenges, and their resilience.&lt;/li&gt;\n&lt;li&gt;You can adapt to working with the slightly quirky Associate Director of Operations, who you will need to deputise for on occasion.&lt;br /&gt;&lt;br /&gt;In addition, you will also be required to cover shifts for the Duty Managers; this means that you need to be an expert in that field (after training!). Although the role will broadly be Monday to Friday -when our activity, and requests from the organisation, is at its height; you will also need to be able to work on the odd weekend or overnight to ensure you have a complete overview of the challenges our team is facing. The role is currently being advertised with the below requirements, which you also need to be able to meet:&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;You have experience of working on an acute hospital site, particularly as a senior nurse, AHP or operationally and understand patient flow.&lt;/li&gt;\n&lt;li&gt;You are able to come in to a challenging day/ night with a smile on your face and a good sense of humour (although we understand it may not be possible to maintain both for the entire shift!).&lt;/li&gt;\n&lt;li&gt;You are enthusiastic and positive about making changes within the organisation, even when it feels like slow progress.&lt;/li&gt;\n&lt;li&gt;You can work flexibly and collaboratively with colleagues from lots of different backgrounds in order to ensure we give our patients the best experience possible.&lt;/li&gt;\n&lt;li&gt;You are good at jigsaws.&lt;/li&gt;\n&lt;li&gt;You have the confidence to make decisions based on the information you have at that time, or know when and how to access the information you need.&lt;/li&gt;\n&lt;li&gt;You can stay cool, calm and collected when others might be struggling or need a plan.&lt;/li&gt;\n&lt;li&gt;You enjoy working with lots of people and moving around the hospital sites to build and maintain relationships – this is not a desk job!&lt;/li&gt;\n&lt;li&gt;You are comfortable with learning new IT applications, and training and supporting others to use them as well, often in a clinical environment.&lt;br /&gt;&lt;br /&gt;This is an exciting opportunity; we have an excellent existing Site Coordinator team, and are currently growing the Duty Managers part of the team, so you will be able to work with a mixture of experienced and new staff, pulling together a new collaboration!&lt;br /&gt;&lt;br /&gt;If any of the above applies to you, we want to speak to you, and receive your application. This role is new to the organisation and will operate across the Royal Hampshire County Hospital and Basingstoke and North Hampshire Hospital (and will provide telephone support to Andover War Memorial Hospital). We do ask that candidates are prepared to work at both sites, and are able to work some unsocial hours – we will be providing consistent and supportive advice and plans for the hospitals and will take the responsibility of this team very seriously.&lt;br /&gt;&lt;br /&gt;We are looking for breadth of experience and skills within the team so there are two job descriptions, Duty Team Manager, for non-clinical operational candidates, and a Clinical Duty Team Manager job description for registered healthcare professionals; please indicate on your application which you are applying for.&lt;br /&gt;&lt;br /&gt;If you would like to discuss this opportunity, you can speak to Beth Norton, Associate Director of Operations by booking in a call via Wendy Slocombe on 01256 852814.&lt;br /&gt;&lt;br /&gt;Applications need to be received by midnight Sunday 15th November. You will be informed of shortlisting on Tuesday 17th November. The interviews and assessment sessions will take place on the 24th and 26th November 2020.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Wendy Slocombe - EA to Chief Operating Officer&lt;/p&gt;\n&lt;p&gt;wendy.slocombe@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01256 852814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Clinical/Non-Clinical Duty Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252191", "validThrough": "2020-11-15T23:59:59+0000"}