{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on experience"}}, "datePosted": "2020-10-23T16:30:37+0100", "description": "&lt;p&gt;We are looking for a full time Patient Services Administrator to join our team. We are a large inner city practice based on the outskirts of Norwich providing health care services from three sites. Part time hours would be considered.&lt;/p&gt;\n&lt;p&gt;The successful candidate must have previous experience working in a busy office environment in an administrative function, ideally in General Practice. Excellent interpersonal, communication and customer care skills are essential with the ability to work independently and also part of a wider multidisciplinary team together delivering comprehensive patient care. Proven IT skills are essential and knowledge of SystemOne would be an advantage.&lt;/p&gt;\n&lt;p&gt;The Patient Services Team is at the forefront of the Practice and we pride ourselves on providing an efficient, courteous, compassionate and caring service to our patients. The delivery of primary care is changing and we are continuously adapting and improving the efficiency of our organsiation to acheive the best outcomes for our patients and the practice.&lt;/p&gt;\n&lt;p&gt;Previous experience working in a primary care organisation is desirable but not essential. Full training will be provided to the right candidate. In return we ask that you have a keen willingness to learn new skills in a supportive environment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich", "postalCode": "NR5 8AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6318", "longitude": "1.24079"}}, "title": "Patient Services Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241308", "validThrough": "2020-11-06T23:59:59+0000"}