{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa inc plus Inner London HCAS"}}, "datePosted": "2020-11-04T15:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for an enthusiastic and dynamic person to take up a new role of Physical wellbeing Lead at Ladywell Mental health unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team at Ladywell unit is multidisciplinary with integrated working on each ward from medical, nursing and social work, psychology , physiotherapy and Occupational therapy. In addition there are dedicated roles in substance misuse, smoking cessation, and all our wards benefit from involvement from volunteers who also contribute to the therapeutic experience for patients.&lt;/p&gt;\n&lt;p&gt;Be a part of the internationally renowned South London &amp; Maudsley NHS Foundation Trust by joining our hard working and energetic team at Ladywell Unit. We value diversity and want our teams to represent our population in Lewisham. With that in mind we welcome applicants who have lived experience as well as those from a BME background&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Physical Well-being Lead will deliver a range of well-being interventions and will co-ordinate activity across the whole Ladywell unit, training other members of the multi-disciplinary team and ensuring a varied programme of activity is available to all inpatients. The Band 5 will be supported and supervised by the Lead Occupational Therapist to deliver the local physical health and well-being strategy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ladywell unit has 5 wards for adults experiencing acute mental health needs requiring inpatient treatment. In the unit itself we have a new wellbeing studio, and outside gym, but are also close to Ladywell part which also offers therapeutic outdoor space.&lt;/p&gt;\n&lt;p&gt;You will not only join a diverse and thriving directorate, but located in the heart of Lewisham, you will have access to excellent social facilities. Wider Lewisham today is a successful and cosmopolitan part of London occupied by energetic, creative and diverse local communities. People benefit from attractive residential neighborhoods, great local schools and a huge number of parks and green spaces. There are excellent transport connections to the rest of London and the wider region, with Canary Wharf, the City, London City Airport and the new international rail terminal at Stratford all within easy reach of the borough. The London Overground is now connecting more of Lewisham with central London and the rail and tube network. In addition, there are exciting developments taking place in local town centres and neighborhoods, bringing new housing, new schools and new leisure facilities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLeonie DownJob titleHead of Occupational Therapy in LewishamEmail addressleonie.down@slam.nhs.ukTelephone number07525236592Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sophia Awan&lt;br /&gt;&lt;br /&gt;Clinical Lead Occupational Therapist for Lewisham Acute and Rehabilitation Services&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;sophia.awan@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ladywell Unit, Lewisham", "postalCode": "SE136LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4536", "longitude": "-.016997"}}, "title": "Physical Wellbeing Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256490", "validThrough": "2020-11-11T23:59:59+0000"}