{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "n/a"}}, "datePosted": "2020-10-01T16:27:07+0100", "description": "&lt;p&gt;Do you ever wish you could turn back time? Well we are offering the opportunity to do this very thing for nurses who want to return back to their nursing career. We would love previously registered Adult or Children’s nurses wishing to return to delivering compassionate and caring nursing practice to think about coming back and joining us. Never has the NHS needed you to come back to us as we do right now.&lt;/p&gt;\n&lt;p&gt;Things change so quickly, technology, approaches, equipment to name but a few – so we want to work with you side by side, bringing you right back up to speed with our fabulous Return to Practice programme delivered within the Trust. Our experienced Mentors will be with you every step of the way, supporting you to gain experience and confidence within the course.&lt;/p&gt;\n&lt;p&gt;The programme includes full OSCE teaching programme, fees and travel for the OSCE 1st attempt and also reimbursement for the Computer Based test (CBT) costs upon completion of the teaching programme and OSCE.&lt;/p&gt;\n&lt;p&gt;The entry requirement for this programme is achieving a pass mark for the CBT within the last 12 months for the field of nursing you are wishing to re-join the register.&lt;/p&gt;\n&lt;p&gt;It doesn’t matter what your reasons for leaving the nursing profession were, for many of us our lives take us along unexpected paths – all we care about is how we can work to support you to get right back to doing the role you were trained to do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Return to Practice Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209315", "validThrough": "2020-12-15T23:59:59+0000"}