{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "24,214.00 - 30,112.00"}}, "datePosted": "2020-11-06T16:26:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Child and Family Wellbeing Nurse, Band 5 (Plus 5% high cost area allowance),&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Loughton -Essex, Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a caring and committed registered nurse / midwife / mental health nurse? Are you looking for a community role within an organisation that is passionate about offering flexibility and work/life balance to their workforce? Are you looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Child and Family Wellbeing Nurse within Virgin Care, Essex you’ll join a team who are focused on improving the health and wellbeing of local children, predominantly between the age of 0-8 years’ and will join a service who recently received a “good” CQC rating.&lt;/p&gt;\n&lt;p&gt;Your days will be rewarding and varied and will include working closely with ourDistrict Healthy Family Teamsworking in collaboration with SCPHN School Nurses, Health Visitors, Healthy Family Support Workers and Assistants as well as a variety of other professionals to deliver the Healthy Child programme and ensure the best health outcomes for the children and families inLoughton, Chigwell and Buckhurst Hill.&lt;/p&gt;\n&lt;p&gt;You will be a registered nurse, midwife or mental health nurse with a minimum of 6 months post-graduate experience and havea caring and approachable demeanour in order to gain the trust and respect of local families and children.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feelvalued as a Child and Family Wellbeing Nurse with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AFC 2020/2021salary and terms and conditions,&lt;strong&gt;including an NHS pension&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/li&gt;\n&lt;li&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/li&gt;\n&lt;li&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/li&gt;\n&lt;li&gt;Access to bespoke career pathways and opportunities to continue your professional development&lt;/li&gt;\n&lt;li&gt;Plus in Essex, we are continuously looking at new ways to improve our staff’s health and wellbeing including ‘wellbeing Wednesdays’ – a virtual yoga/ meditation class ran on a weekly basis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/p&gt;\n&lt;p&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Natalie Jones via email: natalie.jones@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Little Oaks Family Hub Delivery Site", "postalCode": "IG10 3TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6487", "longitude": ".087287"}}, "title": "Child and Family Wellbeing Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260604", "validThrough": "2020-11-20T23:59:59+0000"}