{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 inc"}}, "datePosted": "2020-10-30T15:15:56+0000", "description": "&lt;p&gt;The RNOH is a national centre of excellence with an international reputation for diagnosis, assessment and treatment of neuro-musculoskeletal conditions. This ranges from the most acute spinal cord injury, bone tumour and complex joint reconstruction to orthopaedic and specialist rehabilitation. It offers an integrated range of clinical, teaching and research services unique within the UK and in partnership with University College London.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit an experienced, innovative and highly driven individual to undertake this role. As a pivotal member of the Private Care Senior Management team, the Private Care Head of Marketing and Operations (HMO) will work closely with the Divisional Leadership Team (DLT). The post holder will be key in contributing to the strategic direction of the division. , taking the lead in all aspects of the marketing and business development, operational, administrative and project management of the relevant private patients’ services and teams across the division, including service delivery, service improvement and programme management. The HMO leads new business development initiatives’ business case construction, service re-design, new services’ pathways, end to end processes design and implementation, ensuring ongoing and progressive successful service growth This is a demanding role that requires a ‘hands on’ approach and maximum interaction with the Trust’s senior leadership teams, clinicians, senior nurses and administration with support from the DLT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEileen ScraseJob titleHead of Private CareEmail addresseileen.scrase@nhs.nt&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Head of Marketing and Operations – Private Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250701", "validThrough": "2020-11-15T23:59:59+0000"}