{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-06T15:01:13+0000", "description": "&lt;p&gt;Join us and become part of an engaging and forward thinking Radiology Team. &lt;br /&gt;&lt;br /&gt;You will be joining a dynamic and forward-looking organisation in the heart of Rural Buckinghamshire, where you can develop your career and broaden your horizons.&lt;br /&gt;&lt;br /&gt;We think you will enjoy working for us but you don’t have to take our word for it – 92% of our staff, who took part in the latest national NHS Staff Survey, said their role made a difference to patients and service users.&lt;br /&gt;&lt;br /&gt;We have an exciting opportunity for a highly skilled and ambitious Radiographer who likes a challenge, with at least 18months post qualification experience, to join the Radiology team at Buckinghamshire Healthcare NHS Trust. &lt;br /&gt;&lt;br /&gt;The successful applicant will join our team of Senior Radiographers at Buckinghamshire Healthcare NHS Trust, where we will provide opportunities for you to develop your career. We offer a great working environment, investing in training and new equipment, but our greatest asset is our highly skilled, patient focused and friendly team. Rotation will include CT, MRI, Fluoroscopy, General and A&amp;E.&lt;/p&gt;\n&lt;p&gt;We have just taken delivery of a new MRI scanner on the Wycombe site, and are in the process of installing 2 new MRI scanners at Stoke Mandeville.&lt;br /&gt;&lt;br /&gt;This post will be based at Stoke Mandeville but the successful applicant may work cross-site as required. The successful candidate will be expected to partake in the out of hours service.&lt;br /&gt;&lt;br /&gt;Buckinghamshire Healthcare NHS Trust covers 6 Hospital sites, 2 Acute and 4 community hospitals, the Stoke Mandeville site provides a full range of services including a busy A&amp;E as well as its world renowned National Spinal Injuries Centre. Wycombe is a center of excellence for Stroke and Cardiac Services. We also have a large Radiographer role extension program including; CT Guided BOTOX and Spinal Injections, U/S guided prostate biopsies, PICC line insertions, Reporting etc.&lt;br /&gt;&lt;br /&gt;Radiology provides MRI, CT, Ultrasound and Nuclear Medicine as well as general and mammography. There is a 5 bed day-case unit within the Stoke Mandeville department unit set up to support the busy vascular interventional service. A plain film service is provided at all 4 community sites.&lt;br /&gt;&lt;br /&gt;There are dedicated staff and training facilities in each Department and an active audit/teaching programme. The departments also provide clinical placements for under graduate students. We are keen to develop and train staff and support radiographer role extension.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lead radiographers: lynsey.kitch@nhs.net&lt;/p&gt;\n&lt;p&gt;01296 316918&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital - Radiology, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Senior Rotational Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260251", "validThrough": "2020-11-20T23:59:59+0000"}