{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32500", "minValue": "28000", "unitText": "YEAR", "value": "£28,000 - £32,500 per annum"}}, "datePosted": "2020-11-06T12:24:23+0000", "description": "&lt;p&gt;Burton Park is a neurobehavioural locked rehabilitation hopsital for patients with acquired brain injury and neuroprogressive conditions patient displaying co-existing neuropsychiatric conditions and challenging behaviour.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are three wards offering 50 beds. Warwick Lodge, Dalby and Cleves. A variety of care pathways are available, including acute and longer-term neurobehavioural rehabilitation and person-centred care, emphasising the least restrictive setting.&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team includes psychology, nursing, occupational therapy, speech &amp; language therapy, physiotherapy, social workers and medical.&lt;/p&gt;\n&lt;p&gt;Burton Park is a member of the Independent Neurorehabilitation Providers Alliance (INPA). &lt;/p&gt;\n&lt;p&gt;The role holder will require NMC registration and previous experience gained within a relevant healthcare environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The main role of the Physical Health Nurse is to provide support to the Nursing and wider MDTs in ensuring the patients in the defined area have their physical healthcare nursing needs identified, care planned and evaluated in accordance with best practice and clinical evidence. As well  as providing advice and support to colleagues at the site regarding  physical healthcare needs in general terms; this includes Infection control, screening programmes and site specific requirements, depending on the clinical speciality. Be the site lead for Infection Prevention and control and for student nurses and apprenticeship nurses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• Ensure that all patients are receiving physical healthcare assessments on admission, and that their care needs are commensurate with the assessment and consistent with pre-existing care plans; This includes obtaining relevant historical information, test results etc. in partnership with medical colleagues.&lt;/p&gt;\n&lt;p&gt;• Accurate and efficient date input following screening and results; ensuring process in place regarding communication of the results to the GP and the onsite medics.&lt;/p&gt;\n&lt;p&gt;• Documents all individual patient contacts in their Electronic Clinical record promptly, escalating information to medical and other nursing colleagues as required&lt;/p&gt;\n&lt;p&gt;• Provide briefing and support to Registered nurses at the site regarding the physical healthcare needs in general terms; this includes Chronic disease management; Screening programmes; Diabetes; Hypertension; COPD; wound management&lt;/p&gt;\n&lt;p&gt;• Provides training and support to staff regarding the use of physical healthcare measurement tools, e.g. Waterlow&lt;/p&gt;\n&lt;p&gt;• Provide training and guideline implementation of new equipment for the nursing team&lt;/p&gt;\n&lt;p&gt;• Provides training and support to relevant staff regarding Baseline physical observations, recording, interpreting and escalating&lt;/p&gt;\n&lt;p&gt;• Oversee the nursing care plans for patients with physical healthcare needs, providing training and supervision for newly qualified nurses regarding physical healthcare&lt;/p&gt;\n&lt;p&gt;• Liaise with primary Care services regarding individual patient needs relating to one or more of the following: Diabetic review; Hypertension management; Flu vaccines; Cervical smears; PSA testing; Mammograms; Anticoagulant monitoring; Thyroxine reviews and others as required; Ensuring that recall services are in place on a named patient basis&lt;/p&gt;\n&lt;p&gt;• Maintaining efficient liaison with other agencies and external professionals to ensure continuity of care.&lt;/p&gt;\n&lt;p&gt;• Provide services to patients including Clozapine Clinic; ECG Recordings; Phlebotomy; Wound care, alongside other members of the medical and nursing team&lt;/p&gt;\n&lt;p&gt;• Lead on IPC audits and ensuring any outbreaks, infection and notifiable diseases are reported and managed in accordance with Group and Divisional policy and the Code of Practice for IPC&lt;/p&gt;\n&lt;p&gt;• Act as a resource at site regarding IPC and medical Devices; This includes facilitating the correct audits, checks and actions in these areas are undertaken&lt;/p&gt;\n&lt;p&gt;• Oversee practice placements by student nurses; provide support and mentoring to apprentices on the Priory nursing programme.&lt;/p&gt;\n&lt;p&gt;• Act as Preceptor for newly qualified nurses starting at the hospital&lt;/p&gt;\n&lt;p&gt;• Form and develop positive working relationships with Universities providing Nurse training, be the site liaison officer with the Universities and take a lead, with site HR and DoCs on nurse recruitment&lt;/p&gt;\n&lt;p&gt;• Oversee Health Care Support Worker induction to site; supporting them to achieve their care certificate within the 3 months of starting.&lt;/p&gt;\n&lt;p&gt;• Undertake Quality Walk Arounds; collate data and action plan for Clinical Governance.&lt;/p&gt;\n&lt;p&gt;• Support Smoking Cessation programmes at site&lt;/p&gt;\n&lt;p&gt;• Actively lead Health Education and public Health initiatives that relate to the service&lt;/p&gt;\n&lt;p&gt;• Work as part of a network of Physical Healthcare nurses across the region, and division&lt;/p&gt;\n&lt;p&gt;• In conjunction with the SMT create an annual health promotion programme.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melton Mowbray", "postalCode": "LE13 0RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7567", "longitude": "-.886951"}}, "title": "Physical Health Nurse with £3,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259637", "validThrough": "2020-11-14T23:59:59+0000"}