{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 Per annum inclusive"}}, "datePosted": "2020-10-28T14:01:33+0000", "description": "&lt;p&gt;The Regional Neurosciences Centre at Queens Hospital covers a population of around 750,000. Therefore, this fixed term position offers the opportunity for the postholder to be involved in the assessment of the full range of adult neurology and neurosurgical conditions, including stroke.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of a dynamic, friendly team of Clinical Neuropsychologists offering comprehensive and highly efficient neuropsychological assessments across both inpatient and outpatient settings. The role involves delivering outpatient clinics and managing our inpatient service for neurology and neurosurgery, including patients undergoing lumbar puncture procedures. The post may be particularly attractive to someone seeking relevant experience in the context of the BPS Qualification in Neuropsychology or an opportunity to develop a career within a neuroscience setting.&lt;/p&gt;\n&lt;p&gt;Applicants must have demonstrable experience in administering and interpreting neuropsychological assessments, as this is a core area of expertise relevant to the post. Previous experience of diagnostic work would be desirable. The post holder will also have excellent communication, team working and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;Postgraduate doctoral level training in Clinical Psychology (or its equivalent for those trained prior to 1996) as accredited by the BPS is required.&lt;/p&gt;\n&lt;p&gt;Please note this position may be considered for both Part time and Full time.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Dr Charlotte Fuller, Consultant Clinical Neuropsychologist, on 01708 503102.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Rebecca Hills, Recruitment Advisor, on 01708 435000 ext. 4206.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neuropsychology, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 8a Clinical Neuropsychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246890", "validThrough": "2020-11-08T23:59:59+0000"}