{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum(based on a 10PAs from"}}, "datePosted": "2020-10-19T08:16:55+0100", "description": "&lt;p&gt;&lt;strong&gt;The Shrewsbury and Telford Hospital NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT INTENSIVIST/ANAESTHETIST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a Consultant with a special interest in Critical Care looking for an exciting new challenge this year? Are you looking for an interesting and rewarding job in a stunningly beautiful rural location within easy reach of the West Midlands conurbation? If so, we would like to welcome you to join our friendly, supportive, expanding team supporting 520,000 people in Shropshire, Telford &amp; Wrekin and Mid-Wales.&lt;/p&gt;\n&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust has Trauma Unit status, is the Regional Pediatric Trauma Centre, the Regional Head and Neck Centre and offers support across a broad range of specialties which work in close collaboration with our forward thinking team of Anaesthetists/Intensivists. It has a new £4.8m state of the art Cancer &amp; Haematology Centre providing dedicated facilities to patients at the Royal Shrewsbury Hospital.&lt;/p&gt;\n&lt;p&gt;The Trust has been a well-established Teaching Hospital for medical students since August 2017 in conjunction with Keele University Medical School. The Medical School consistently achieves a very high rating in the National Student Survey being placed second amongst Medical Schools in the UK in 2018 and 2019, and joint first from 2014 to 2017.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic Consultant with a special interest in Critical Care. The successful applicant will cover Critical Care at both hospitals, alongside a dedicated team of consultant colleagues that work across sites. Theatre sessions may be based at The Royal Shrewsbury Hospital and The Princess Royal Hospital depending upon your special interest.&lt;/p&gt;\n&lt;p&gt;The post is full time and will consist of 10 PAs plus the opportunity to take up further clinical activity. Part time, job share and flexible working applications will be given full consideration. Candidates for this role must have GMC registration and recent experience within the NHS.&lt;/p&gt;\n&lt;p&gt;There are currently 2.5 SPAs allocated for supporting professional activities, 1 of which is for revalidation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Department &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a progressive and dedicated team in which you will have the opportunity to develop. Several consultants have regional or national responsibilities; we have an FICM board member, regional clinical lead for organ donation, AAGBI board member, and Training school programme director.&lt;/p&gt;\n&lt;p&gt;We currently have two vibrant hospital sites each with a varied range of services available. Our Hospitals are located in Shrewsbury and Telford and are brimming with exemplary teams of hardworking individuals. Both Hospitals will be further enhanced in the future due to a significant investment that will see the creation of one acute hospital site (The Royal Shrewsbury Hospital) which will include a 30 bed Critical Care Unit and one planned care hospital site (The Princess Royal Hospital) for most elective surgery. The successful candidate is invited to actively contribute to the redevelopment of the service.&lt;/p&gt;\n&lt;p&gt;The Royal Shrewsbury Hospital has 14 physical Critical Care beds. These can be used flexibly to accommodate level 2 and level 3 patients to a dependency of 8.0. The Princess Royal Hospital currently has 11 physical bed spaces across Critical Care that can be used flexibly to accommodate level 2 and level 3 patients to a dependency of 6.0.&lt;/p&gt;\n&lt;p&gt;There are currently 9 Critical Care Consultants based at The Royal Shrewsbury Hospital. We also have 2 Critical Care Consultants working primarily at The Princess Royal Hospital. On call commitments are based at the Royal Shrewsbury Hospital on a 1 in 9 basis.&lt;/p&gt;\n&lt;p&gt;We are in the process of redeveloping our service to enable a 1 in 10 rota at The Royal Shrewsbury Hospital and full 7-day cover for The Princess Royal Hospital and we invite you to play an active role in this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It is a particularly exciting time to join the Trust as we have developed through 5 years collaboration with the Virginia Mason Institute in Seattle known as the SaTH Transforming Care Production System (TCPS). We are one of only 5 UK hospitals to receive this support, from what is regarded as the safest hospital in the world. For our Trust, this is about having a single management system as part of a journey of cultural change.&lt;/p&gt;\n&lt;p&gt;TCPS is a system of tools based on lean principles, designed to help deliver continuous improvement. The Kaizen Promotion Office (KPO) team teach and coach staff in the use of the TCPS management system&lt;/p&gt;\n&lt;p&gt;- Showing tools &amp; methods that can be used at every level of the organisation&lt;/p&gt;\n&lt;p&gt;- Developing teams who can frame problems&lt;/p&gt;\n&lt;p&gt;- Empowering staff to come up with ideas and sustain locally led improvements&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are very proud of our achievements to date and are looking for ways to engage with all of our staff through our Transforming Care team. There will be many opportunities for you to become involved in our KPO and improvement streams of work and we will be able to provide you with help and guidance independent of your level of expertise. We have a unique opportunity to make a difference and we hope that you will want to be a part of our journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shropshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Shropshire is a beautiful county located between the West Midlands and North Wales. Whilst rural and home to the Shropshire Hills it is anything but sleepy. The county is bustling with idyllic towns including Shrewsbury, Oswestry, Bridgnorth and Ludlow, with plenty to do regardless of your interests. More information can again be found under further links.&lt;/p&gt;\n&lt;p&gt;We are ideally located between the north and the south making travelling around the UK extremely easy. As well as being only a short distance from major cities and busy transport links including Birmingham airport, our county also borders beaut&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Shrewsbury and Telford Hospital NHS Trust, The Shrewsbury and Telford Hospital NHS Trust", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Consultant Intensivist/Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231480", "validThrough": "2020-11-16T23:59:59+0000"}