{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa based on full time hours"}}, "datePosted": "2020-10-29T13:00:24+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Are you looking for an exciting and rewarding Band 2 role in an inpatient unit? Would you like to work in a forensic service to build a brighter and better future where you belong?  If so, perhaps this will be the opportunity for you.  &lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Southfield provides specialist care and treatment for people with serious mental illness in a secure environment who are detained under the mental Health Act, service users are aged between 18 – 65 years old, and may have either committed a criminal offence, or have challenging behaviour.  The main purpose of the unit is to assist Service Users to understand and manage their own mental health, so that where possible, they can be reintegrated back into the community. This role is for our male wards at Southfield (Oak and Beech ward). &lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role of Healthcare Support Worker will offer an opportunity to offer career defining training and challenges; it will offer exposure to a very distinctive and rewarding environment, where you will be part of a close knit team.  There will be opportunities to develop, were you will gain experience working in a low secure forensic setting. &lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our LEAD team offer unparalleled training and development opportunities and CPD and all staff are encouraged to access these.&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Southfield operates a shift working pattern and there are a variety of shifts available.  We do aim to be as flexible as possible to ensure your working pattern helps with childcare/work/life balance and gives you plenty of free time to spend with family and friends, so please do feel free to discuss your preferences at interview. &lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note that due to the nature of this role access to a vehicle is essential. This job may close early if we get large volumes of applications.  &lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Happy to Talk Flexible Working&lt;em&gt; - &lt;/em&gt;all &lt;/strong&gt;&lt;strong&gt;requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2RZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.5288"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248408", "validThrough": "2020-11-06T23:59:59+0000"}