{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110667", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,667"}}, "datePosted": "2020-10-20T12:17:03+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant Dermatologist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a very welcoming dermatology team working in a modern department. The Dermatology service at BHRUH NHS Trust is highly supported by management team with plans for further growth and development of specialist services. All consultants within the service will be primarily based at Queen’s Hospital in Romford but may be required to undertake some sessions at other sites; King George Hospital and Barking community Hospital. &lt;br /&gt;We are looking to appoint at a full-time substantive Consultant Dermatologist to join our Dermatology team at BHRUH NHS Trust (General Consultant Dermatologist will be considered). The successful candidates must possess a primary medical degree; Full GMC Registration with a License to Practice; together with a wide experience in General Dermatology and full MRCP or equivalent. Candidates must be on or eligible to join the GMC’s Specialist Register with a CCT or equivalent in Dermatology or in Paediatric with experience in Paediatric Dermatology. Candidates with wide experience in paediatric dermatology and without a CCT will be considered and supported to apply for CESR). &lt;br /&gt;There is a dedicated area within the outpatient department for dermatology clinics. Clinics are supported by an experienced dermatology nursing team; consultants have access to BAD information sheets, an extensive dermatology formulary, cryotherapy, dermoscopy, clinical photography and reference textbooks. The department provides patch testing, phototherapy and minor skin surgery. Operative procedures can be also undertaken within the dedicated Dermatology day case operating theatre.&lt;/p&gt;\n&lt;p&gt;We offer a complete phototherapy service with TL01, bath PUVA, tablet PUVA and hand &amp; foot phototherapy, in addition to hand/foot phototherapy. There are opportunities to develop our PDT and iontophoresis service with equipment available. There are nurse specialist led clinics for biologics, isotretinoin, phototherapy, minor surgery, skin cancer counselling and skin cancer follow-up.&lt;/p&gt;\n&lt;p&gt;Medical Staff in Dermatology &lt;br /&gt;Dr Fawad Hussain Consultant Dermatologist (Clinical Lead, Skin Cancer Lead and Medical Director at KGH)&lt;br /&gt;Dr Taha Aldeen General Dermatologist, Part-time&lt;br /&gt;Dr Martin Wade Consultant Dermatologist Part-time &lt;br /&gt;Dr Simon Davison Consultant Dermatologist Part-time&lt;br /&gt;Dr Beebee Meaugan Consultant Dermatologist Part-time&lt;br /&gt;Dr Bhat Locum Consultant Dermatologist Part-time&lt;br /&gt;Dr Dimple Jain Dermatology Specialty Doctor&lt;/p&gt;\n&lt;p&gt;Lorraine Mossman Biologic and Acne Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Nina Dowie Skin Cancer Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further details / informal visits contact: Dr Fawad Hussain, Consultant Dermatologist at 01708435000 ext 3679&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dermatology Medical Staff, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant Dermatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234353", "validThrough": "2020-11-18T23:59:59+0000"}