{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-22T14:13:07+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Trainee Urogynae Nurse Specialist/ women’s health unit nurse&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and highly motivated, experienced Band 5 Registered Nurse to join our outpatient team on the Women’s Health Unit at the Bradford Royal Infirmary. This developmental role will help you gain the knowledge and skills to work as across the Women’s Service and at Westwood Park Community Hospital. Your primary role will be to develop as an Urogynaecology Nurse Specialist where you will learn to assess and manage women with a number of bladder/incontinence issues. You will be able to undertake clinics independently in percutaneous tibial nerve stimulation, bladder instillation assessment of prolapse and pessary management and TWOC. You will assist the medical staff in Outpatient Cystoscopy, Urodynamic Studies and Perineal Trauma clinics.&lt;/p&gt;\n&lt;p&gt;On the Women’s Health Unit we provide a number of specialist gynaecological services which include Hysteroscopy, Colposcopy, Urogynaecology, the termination of pregnancy (Lilac) service. On this progressive unit you will be expected to integrate within our team and train to work across some of these services including working within the Hysteroscopy service at Westwood Park Community Hospital&lt;/p&gt;\n&lt;p&gt;We invite applications with significant post registration experience of working within a women’s health environment. This role will expect you to work as an independent practitioner following the individualised personal and professional training plan which will continue to enhance your nursing skills and knowledge. You will be provided with a supportive supernumerary induction period as we help you develop your confidence in working within this varied role with supervision from the Consultant body as well as the nursing team.&lt;/p&gt;\n&lt;p&gt;Following the training period you will work independently but within a supportive team. You will need excellent communication skills in order to deliver high quality specialist nursing care to women attending the WHU.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120952.JPG", "name": "Bradford Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120952"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD9 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8059", "longitude": "-1.79488"}}, "title": "Trainee Urogynaecology Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238810", "validThrough": "2020-11-12T23:59:59+0000"}