{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T09:46:00+0000", "description": "&lt;p&gt;Are you passionate, enthusiastic, well organised and wanting to make a difference? Then we want to hear from you. We are looking for motivated and passionate individuals who want to work within the Neonatal team to provide exceptional nursing care to babies and their families. Following a review of our establishment we have a Staff Nurse (QIS) position available to join our highly skilled team of nursing staff on SCBU, this job includes a rotation to Woodlands ward which is our 16 bedded paediatric ward. Our SCBU is a Level 1 - 7 cot unit with a gold accreditation for UNICEF Baby Friendly Initiative – the first in the UK. A ‘level one unit’ means that the level of care provided is for babies of 32 weeks’ gestation and above. Ideally, babies below this gestation should be transferred to a level 3 unit in-utero. However, if this is not possible they will be stabilised after birth within SCBU and then retrieved by the Neonatal Network Transport Team, and transferred to a tertiary centre. In addition to premature infants, a baby may also be admitted to SCBU if they require more care than that which can be provided by the mother with the support of a Midwife.&lt;/p&gt;\n&lt;p&gt;You will need to have the QIS qualification in Neonates and be committed to delivering a high standard of patient care, whilst maintaining your own personal professional development. We will provide a supportive environment and are committed to the professional development of our staff. The neonate and their family / carers are at the centre of everything we do and we are always looking at ways to improve. The unit operates on an 11.5 hr shift system on an internal rotation shift basis. Team working is an integral part of the running of our SCBU and this is an exciting opportunity for an enthusiastic and motivated nurse to join our team.&lt;/p&gt;\n&lt;p&gt;Become part of a great team promoting our Trust’s values – responsible, passionate and respectful. If you are dedicated to working in a team which strives to deliver excellence in neonatal care and are serious about pursuing a rewarding career, please do contact us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like some further information, you can contact Vicky Lister on 01423 557736 or at vicky.lister@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**This job advert will close as soon as a sufficient amount of applications have been received. Please apply for this job as soon as you can, if you are interested.**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate &amp; District NHS Foundation Trust, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Registered Nurse, Neonates (QIS Qualification)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257107", "validThrough": "2020-11-19T23:59:59+0000"}