{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T13:46:27+0000", "description": "&lt;p&gt;The role is defined as a First Level Nurse/Allied health professional, at Stockport NHS Foundation Trust the Advanced Practitioner will provide highly specialised care within the hospital setting, to those patients with chronic and acute conditions using advanced clinical knowledge that is evidence based&lt;/p&gt;\n&lt;p&gt;The Advanced Practitioner will function independently or within a clinical team and will demonstrate competence complementary to the doctor’s role in the delivery of health care. Provide expert advice and to ensure the needs of the patient are met by leading, challenging and changing practice within the clinical setting.&lt;/p&gt;\n&lt;p&gt;Work collaboratively with other health care professionals in primary and secondary care to ensure a high quality easily accessible service. And be proactive in acting as the hospital wide lead in the development of the role of the Advanced practitioner and the service provided&lt;/p&gt;\n&lt;p&gt;In addition the role will include accepting new and follow-up referrals, discharging patients as appropriate, undertaking clinical audit and research, lead change as required and ensure resolution of conflict. Recognises and acts as an advocate for patients, carers, service and organisation.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful, this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane BunnageJob titleMatron for SurgeryEmail addressjane.bunnage@stockport.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242730", "validThrough": "2020-11-09T23:59:59+0000"}