{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62286", "minValue": "52606", "unitText": "YEAR", "value": "£52,606 - £62,286 per annum"}}, "datePosted": "2020-10-21T17:45:39+0100", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and thefuture National Institute for Health Protection.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;Public Health England provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health. It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally, independent manner.&lt;/p&gt;\n&lt;p&gt;The Emerging Infections and Zoonoses (EIZ) Section is currently within TARGET (Tuberculosis; Acute Respiratory, Gastrointestinal, Emerging and zoonotic infections; and Travel health) division of the National Infections Service. The work of the Section covers a range of activities including providing scientific secretariat support to the UK’s Human Animal Infections Risk Surveillance group (HAIRS); epidemic intelligence for infectious disease threats nationally and globally and assessing any potential human health threats identified; coordinating activities related to zoonoses across PHE; incident response to emerging and zoonotic pathogens; participating in High Consequence Infectious Disease (HCID) preparedness and response activities; undertaking surveillance of emerging infections and zoonoses; and working closely with animal health and human health colleagues on the assessment, management and control of zoonoses and emerging infections.&lt;/p&gt;\n&lt;p&gt;The postholder will work in the Emerging Infections and Zoonoses (EIZ) section as the Scientific Lead for emerging infection epidemic intelligence and risk assessment activities. This includes leading and coordinating the analysis and interpretation of qualitative and quantitative data feeds (official and un-official) about often complex emerging situations nationally and internationally. The postholder will be responsible for the production of rapid assessments of the public health significance of incidents using a holistic approach encompassing available data and knowledge of the pathogen involved, as well as drawing on an understanding of previous similar incidents and their management. The post holder would be expected to liaise regularly with senior staff within PHE, Other Government Departments (OGDs) and International Organisations, and represent the Section and PHE at internal and external meetings. The postholder will be expected to continue to develop and improve the epidemic intelligence and assessment functions of the team. The post holder will also contribute to the wider work of the Section on zoonoses-related activities and contribute to national incident response work.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Jake Dunning by email: Jake.Dunning@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJake DunningEmail addressJake.Dunning@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale, London", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Principal Scientist (Emerging Infections)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237467", "validThrough": "2020-11-10T23:59:59+0000"}