{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 p.a."}}, "datePosted": "2020-10-15T16:26:52+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an enthusiastic and motivated leader with excellent time managements skills who can work both independently and as part of a team to lead our Business Support in our Autism Service. This is an office based role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be the first point of contact for families and other health care professionals and will be responsible for providing a high level professional and patient focused service. You will be subject to some very sensitive and in some cases distressing information. Therefore, ensuring confidentiality at all times is of utmost importance together with having a very calm and empathetic nature. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will also need to be able to demonstrate flexibility and adaptability, be a good team player but also someone who works well on their own initiative who is willing to take on a variety of duties whilst being able to pay meticulous attention to detail. You will also have skills in data collection and reporting, a comprehensive understanding of Microsoft Office applications, and be responsible for the ongoing development of digital platforms.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is a full-time post, 37.5 hours and if you have experience within the NHS this would be an advantage, but not essential as full training will be provided. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are looking for a new challenge and would like to join us in improving health outcomes for children and young people, then we look forward to hearing from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please read the attached job description and person specification for more details and should you wish to discuss the role further please contact email Chantal Homan on c&lt;/span&gt;&lt;span&gt;hantal.homan@solent.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Business Support Lead Autism", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229000", "validThrough": "2020-11-08T23:59:59+0000"}