{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum"}}, "datePosted": "2020-10-26T15:00:25+0000", "description": "&lt;h1&gt;EPMA Pharmacist&lt;/h1&gt;\n&lt;p&gt;Portsmouth Hospitals University NHS Trust is in the exciting position to be able to recruit a competent and detail-driven pharmacist to work within the Digital Medicines team and support the Digital Medicines Deputy Lead Pharmacist in the configuration of our new EPMA system. This is an exciting opportunity to deploy a complex technology-enabled process change, working with a diverse range of clinical and non-clinical staff to build, develop, and validate drug files and formulae ensuring that, once in place, our electronic prescribing system underpins the ultimate in quality of care and patient safety that reflects our Trust values.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a pharmacist to work closely with the Digital Medicines team to build drug files and formulae for the EPMA system, ensuring that existing paper protocols are transferred into electronic protocols on the system, and that they are checked for clinical appropriateness. The post-holder will write, implement, and promote policies and SOPs related to EPMA and its management across the trust, updating staff on changes or updates to the EPMA system as necessary, ensuring that this is reflected in mandatory training programmes. The post-holder will additionally be a subject matter expert for the EPMA system, providing highly specialist advice to colleagues across the trust, as well as being involved in the design and content of relevant teaching packages, delivering staff training throughout the implementation period.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be suitably qualified, exhibiting relevant clinical knowledge from a variety of different areas (preferably within healthcare and the public sector); demonstrating an understanding of clinical system and user requirements.&lt;/li&gt;\n&lt;li&gt;You will have a proven ability to work well in multi-disciplinary teams, able to organize yourself and others to prioritize workloads appropriately and effectively.&lt;/li&gt;\n&lt;li&gt;You will be a confident individual, demonstrating sound judgement, self-belief, drive, mental resolve, and competence in conflict management.&lt;/li&gt;\n&lt;li&gt;You will possess the necessary professionalism to work closely with different clinical specialities, and excellent communication skills, both written and verbal.&lt;/li&gt;\n&lt;li&gt;You must be able to act as a subject matter expert for the EPMA system, providing highly specialist advice to colleagues across the trust.&lt;/li&gt;\n&lt;li&gt;You will be able to demonstrate the intellectual flexibility necessary to work in a complex and changing environment, actively engaging with clinical staff by ‘floor-walking’ before and during go live.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Join a dynamic team in a progressive organisation committed to improving patient care through digital innovation.&lt;/li&gt;\n&lt;li&gt;Make a significant difference to clinical outcomes and patient safety for patients of Portsmouth Hospitals University Trust (serving a population of around 675,000 residents of Portsmouth and South East Hampshire).&lt;/li&gt;\n&lt;li&gt;Support healthcare staff colleagues who are receptive to change and impatient for new EPMA technology.&lt;/li&gt;\n&lt;li&gt;Work with a great group of people in our well-resourced IT department who are dedicated to delivering the best services and informatics solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;A healthy work-life balance is valued in PHT&lt;/strong&gt;. Portsmouth is a vibrant city and tourist destination on the south coast with convenient access to the South Downs National Park and the Isle of Wight and just 90 minutes from London Waterloo by train. Whether your passion is the outdoors – with beaches, sailing, kite-surfing, horse-riding and hiking on our doorstep – or culture – in the birthplace of Charles Dickens, with two theatres and a major concert venue in the city – Portsmouth has something for everyone. If history is your hobby, Portsmouth Historic Dockyard offers a rich exploration of Britain’s naval history, but if retail therapy is more likely to float your boat, discount designer-label shopping at Gunwharf Quays attracts shoppers from far and wide. If you like to travel and explore, ferries sail from Portsmouth to the Channel Islands, France and Spain and cruise ships depart from nearby Southampton to the Mediterranean, Baltic, Caribbean and Nordic seas. Southampton airport is just 20 miles away, serving destinations across the British Isles and Europe&lt;/p&gt;\n&lt;p&gt;Closing date 10th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "EPMA Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243008", "validThrough": "2020-11-10T23:59:59+0000"}