{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T14:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant in Intensive &lt;/strong&gt;&lt;strong&gt;Care Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newham University Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Barts Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;12 month fixed term&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are looking for a fulfilling post in a busy, evolving critical care unit in which you can contribute your skills and expertise, then this is the job for you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is for a locum full time ICM consultant based primarily at Newham University Hospital. We are looking for someone with great team working skills who will help to build on recent progress to deliver the medical care, staff development and innovation required to bring us to the front line of critical care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited from doctors with appropriate training and qualifications in critical care medicine as defined by the Faculty of Intensive Care Medicine or provide evidence of similar experience. Applicants must hold a CCT (or equivalent) in ICM, anaesthesia, medicine, emergency medicine or surgery, or be within 6 months of obtaining this at the time of interview and have advanced training in ICM.&lt;/p&gt;\n&lt;p&gt;You will join a team of 5 intensive care consultants providing 24/7 ICU cover. This is worked in blocks of 7 days with on-call responsibility shared within the team. There is funding to increase the establishment to 7 consultants. A recent increase in middle grade staffing has resulted in 8 registrar posts, one ICM fellow, and Educational fellow (part funded by the Education Academy) a Core Medical Trainee and two SHO posts. There is in addition support from physiotherapy, speech and language, pharmacy and nutrition.&lt;/p&gt;\n&lt;p&gt;A key part of this post will be to support the education and training of these doctors.&lt;/p&gt;\n&lt;p&gt;The ICU has currently eight beds providing general critical care to the local population. There are over 400 admissions per year with a challenging case mix of acute medical and surgical emergencies.&lt;/p&gt;\n&lt;p&gt;Sessions in a parent specialty may be available depending on the skills of the successful candidate. We have strong links with the Critical Care Units within Barts Health and we play an active role in the North East and North Central London Adult Critical Care Network.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For enquires about the post please contact:&lt;/p&gt;\n&lt;p&gt;Dr James Napier, Clinical Lead for ICU: james.napier2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ITU Medical Staff, LONDON", "postalCode": "E13 8RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": ".032558"}}, "title": "Locum Consultant in Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254294", "validThrough": "2020-11-17T23:59:59+0000"}