{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-03T11:15:24+0000", "description": "&lt;h2&gt;&lt;strong&gt;Band 7 Trainee Advanced Clinical Practitioner&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Our Trust is recognised for our staff engagement, great care and rated &lt;strong&gt;GOOD&lt;/strong&gt; by the Care Quality Commission. Would you like the opportunity to join our team as a Trainee Advanced Clinical Practitioner at Leeds Liver Unit.&lt;/p&gt;\n&lt;p&gt;We are looking for innovative, forward thinking clinicians who have a desire to train and develop skills in Advanced Clinical Practice and in Liver Surgery and Liver Transplant. The role of the Trainee Advanced Clinical Practitioner is dynamic and the post-holder will be proactive in pioneering and developing this role further in response to challenging healthcare needs and advances in practice.&lt;/p&gt;\n&lt;p&gt;As a trainees you will work alongside the Multi-disciplinary team covering the Liver Transplant and surgery teams within the Leeds Liver Unit. You will be working closely with the surgical teams. Successful candidates will be supported in their development, through high quality clinical supervision, with time dedicated for continuing professional development and funding to complete an advanced clinical practice MSc&lt;/p&gt;\n&lt;p&gt;The roles will be hosted within one of the National Liver Transplant Centres and is an exciting opportunity to work within a large transplant unit which is well established. There may be a requirement to cover some Transplant on call and unsocial hours working commitments.&lt;/p&gt;\n&lt;p&gt;Candidates must be registered with a profession that is eligible to complete independent Non-Medical Prescribing training and as part of the apprentice standard the minimum contracted hours allowable are 30 hours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to apply and gain a place on an apprentice advanced practice masters MSc course&lt;/strong&gt; with our chosen education provider. You will be asked to apply only when invited for interview. On successful completion of the training program and obtaining an advanced practice MSc award, candidates will be eligible to apply for an ACP position at LTHT.&lt;/p&gt;\n&lt;p&gt;These posts are part subsidised by Health Education England (HEE) and an offer of employment is subject to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;LTHT securing funding from HEE&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Gaining a place on an apprentice advanced practice MSc course&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHS Pre-employment checks&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interested candidates are invited to discuss these posts, advice for university places and organise a visit if required or alternatively contact laura.fileccia@nhs.net for further information.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122273.jpg", "name": "Nursing Cohort", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122273"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Trainee Advanced Clinical Practitioner (XR07)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253647", "validThrough": "2020-11-17T23:59:59+0000"}