{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T13:46:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Nurse – specialist clinics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The West Midlands Rehabilitation Centre in Birmingham provides a specialist Neuro-rehabilitation service across the whole West Midlands Region and encompasses Consultant led specialist clinics for ,Intrathecal Baclofen (ITB), Non Traumatic Spinal Injury, Multiple Sclerosis, Neuromuscular disorders, Young Adults, Spasticity and Complex Rehabilitation. The clinics are supported by a wide range of specialist rehabilitation services at the centre, including: Functional Electrical Stimulations (FES) Access to Communication and Technology, Posture and Mobility, Wheelchair Services, Clinical Measurements Laboratory, Orthotic Services, Counseling and Psychology Services.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a registered nurse, with neurological rehabilitation experience or wanting to develop, to work within the multidisciplinary team to provide high quality assessment and interventions to patients with long term neurological conditions attending the specialist clinics . The main focus of this role will be on the continence management, via advice and support, of patients particularly non traumatic spinal injury patients. There will be a requirement to support the other clinics patients with Multiple Sclerosis, spasticity and neuromuscular conditions.&lt;/p&gt;\n&lt;p&gt;You will need to have relevant clinical experience including some experience within neurology and the assessment of complex disability. You must have good organisational skills including prioritisation of workload and time management skills and be able to demonstrate sound knowledge and application of up to date clinical trends and practices including evidence based ones&lt;/p&gt;\n&lt;p&gt;You must be able to communicate effectively with patients /carers /colleagues and other agencies and be able to generate written communication, which is relevant, concise, accurate and legible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmjad MahmoodJob titleAdvanced Nurse Practitioner ITBEmail addressAmjad.mahmood@bhamcommunity.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Midlands Rehabilitation  Centre, Birmingham", "postalCode": "B29 6JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4364", "longitude": "-1.93885"}}, "title": "Band 6 Clinical Nurse Specialist (CNS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240780", "validThrough": "2020-11-09T23:59:59+0000"}