{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T09:00:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Recruit to Train Therapy Training posts – IPT-A (1 post) SFT (1 post)&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Are you a graduate or do you already have a core profession in mental health with experience of working with children and young people?&lt;/p&gt;&lt;p&gt;Are you interested in training to deliver evidence based treatments with children and young people and at the same time working within a dynamic Children and Young People’s Mental Health Service (CYPMHS/YPWS) here in Kent &amp; Medway? &lt;/p&gt;&lt;p&gt;NELFT are recruiting candidates interested in undertaking a Recruit to Train post. In collaboration with Health Education England and NHS England, we are delighted to offer salaried post-graduate diploma training posts in partnership with King’s College London (for CBT and SFP training courses; course start date 25.1.21). Please see attachment documents for more information about each course. &lt;/p&gt;&lt;p&gt;We are looking for full-time trainees to join our multi-disciplinary teams. We will invest in you and train you to post-graduate diploma level in one of these interventions.&lt;/p&gt;&lt;p&gt;Over the next year you will work within NELFT’s CYPMHS/YPWS providing evidence based interventions whilst undertaking a Post Graduate Diploma programme of training at University. You will work within the service 2.5-3 days a week using your newly developed skills whilst attending the training programme 2-2.5 day a week depending upon the stage of the course. Clinical supervision will be provided from within the service and you will be paid a full-time salary with no training costs to you.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The unique nature of the posts means that applicants are required to apply to both the University and to NELFT at the same time&lt;/strong&gt;. Full details of the process, the job description, information on the courses and guidance for an application are below.&lt;/p&gt;&lt;p&gt;Guide to application:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;In your NELFT application please put at the top of your supporting information statement which modality of intervention training you are applying for. You may apply for more than one modality.&lt;/li&gt;&lt;li&gt;This a Post Graduate Diploma training position so all candidates will need to apply for both the trainee role with NELFT using the NELFT application form and also at the University for your chosen modality of intervention following the application guidance for the relevant University attached.                        &lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Salary:                                                                   Band 5 (Agenda for Change pay scale)&lt;/p&gt;&lt;p&gt;Start Date:                                                          04.01.2021          &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;For further information about these opportunities in Kent &amp; Medway please do contact:&lt;/p&gt;&lt;p&gt;Isaac Igwe  0300 3001986&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Probationary Period&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Assessment/Interview info&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website.  If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Starting with NELFT&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust.  All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment.  As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes.  The induction will be held at our head office in Rainham, Essex.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;                     &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;NameIsaac IgweJob titleIntegrated Team ManagerEmail addressisaac.igwe@nelft.nhs.ukTelephone number0300 3001986", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Twisleton Court Dartford, Dartford", "postalCode": "DA1 2EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4457", "longitude": ".210762"}}, "title": "Kent CYPMHS Practitioner CYP-IAPT Trainee in IPT-A", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255133", "validThrough": "2020-11-18T23:59:59+0000"}