{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Hourly Paid"}}, "datePosted": "2020-11-02T13:01:30+0000", "description": "&lt;p&gt;The Royal Free Intensive Care Unit is looking for Band 6 Staff Nurses to join our team.&lt;br /&gt;Our brand new 34 bedded unit admits in excess of 1500 patients per year. Specialities include hepato-biliary services with an established liver transplantation programme, haematology, complex vascular surgery, plastic surgery and renal services. You may have the opportunity to work in the UK high security infectious diseases unit. We also have an expanding research program.&lt;br /&gt;&lt;br /&gt;We provide a structured supernumerary orientation programme to meet your individual needs. We run an in-house band 6 development course and offer opportunities to advance your interest in specialist areas. Staff development and education is facilitated and supported by our Clinical Practice Education Team.&lt;br /&gt;&lt;br /&gt;We are committed to equal opportunities in employment and are keen to support flexible working by welcoming applicants who would like to work part-time hours. Benefits include a staff day nursery, staff recreation centre, season ticket loans and accommodation.&lt;br /&gt;&lt;br /&gt;We will offer you an enhanced rate for your services in line with the Agenda for Change framework. &lt;br /&gt;&lt;br /&gt;We are very easy to reach being situated within walking distance of both Belsize Park and Hampstead underground, and supported by both local rail and bus networks. Hampstead is a lively part of London with fantastic recreational facilities, Hampstead Heath and easy access to central London.&lt;br /&gt;&lt;br /&gt;Please note: In order to be hired as an ITU nurse, you must provide the relevant critical care certificates.&lt;br /&gt;&lt;br /&gt;Please note that these vacancies may close prior to the advertised closing date, subject to the number of applications received, so we would advocate early application if interested in these posts.&lt;br /&gt;&lt;br /&gt;Criteria required for posts:&lt;br /&gt;* NMC Registered RGN with.&lt;br /&gt;* Critical Care course&lt;br /&gt;* Relevant ICU experience &lt;br /&gt;* Experience in teaching and mentoring&lt;br /&gt;* Good communication skills.&lt;br /&gt;* Manage total patient care and be able to work independently&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Temporary Staffing&lt;/p&gt;\n&lt;p&gt;Email address: rf.tsrecruitment@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0207 794 0500 EXT 23400 option 3&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free, Hampstead and Barnet General Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Bank ITU Nurse Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252144", "validThrough": "2020-11-08T23:59:59+0000"}