{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum"}}, "datePosted": "2020-10-27T11:01:58+0000", "description": "&lt;p&gt;&lt;span&gt;NEL is currently recruiting for a Senior Analyst to join our Business Intelligence/ Analytics team. This is an exciting opportunity to join NHS England&#39;s Specialised Commissioning Business Intelligence Team providing analytical support. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Developing positive and robust relationships with the specialised commissioning, dental and Health in the Justice System teams, you will undertake contract monitoring, performance reporting and quality and outcomes analysis on a provider and service basis for all London providers of specialised services, developing in-depth knowledge of a range of services, ensuring stakeholder engagement with providers, clinical networks, CSUs, CCGs and national specialised commissioning colleagues.&lt;br /&gt;&lt;br /&gt;This role requires excellent numerical and analytical skills, and experience of designing systems using SQL server, working with diverse and complex information sources and automating data processing. You will be responsible for interpreting and presenting complex data relating to specialised services, dental, screening and offender health services to directors of commissioning, finance managers and providers, and will provide advice on complex informatics issues. You will need to work proactively, to develop strong working relationships internally and externally and will need to be a capable communicator. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;F&lt;span&gt;&lt;span&gt;or further details on this role, please see the attached job description. Please ensure that you pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameShakill AllybocusJob titleSenior AnalystEmail addressshakill.allybocus@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House (Waterloo) so inner London, London - Waterloo", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Senior Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244119", "validThrough": "2020-11-10T23:59:59+0000"}