{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T14:31:12+0000", "description": "&lt;p&gt;Ward 22 is an acute medical ward for the elderly with a bed capacity of 30. We are looking for a staff nurse who is passionate, conscientious and motivated to make a difference. This post will give you the opportunity to have a voice within nursing, have input into the priorities and strategies for ward 22, and that of the Trust as a whole. This will help drive us forward as an enthusiastic and inspirational team.&lt;/p&gt;\n&lt;p&gt;We strive to deliver a comfortable atmosphere for all patients and relatives whilst providing a very high standard of care. We are currently taking part in a pilot ‘Amber’ which has seen changes in the way we look after our patients and relatives/carers. we also enforce the beliefs behind John’s Campaign where ward 22 is working closely with our Dementia Matron and her team to ensure we have an appropriate environment and that all staff are highly trained to provide excellent innovative dementia friendly care.&lt;/p&gt;\n&lt;p&gt;We are open to RM Nurses applying as we feel there is room for the skills and expertise due to the increasing patients admitted with delirium and other cognitive impairment. We feel by having adapted and specialised skills on the ward we can deliver what we promise.&lt;/p&gt;\n&lt;p&gt;We are proud of the care that we provide and we strive to embed the 6 C’s in all we do. We want to be the best in all that is nursing including dementia care, falls, pressure ulcer prevention and end of life care. We want to ensure our most vulnerable patients receive the support and care they deserve.&lt;/p&gt;\n&lt;p&gt;We have implemented SAFER on the ward to help improve patient flow, accommodate discharges and prioritise patients within our specialty.&lt;/p&gt;\n&lt;p&gt;Preceptor-ship will be offered to the successful candidates and opportunities will be given for further education and support. We as a team want to grow and broaden our nursing knowledge and we want you to be part of this.&lt;/p&gt;\n&lt;p&gt;These posts are suitable for newly qualified applicants and applicants with post registration experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sr Yvonne Whiston on 0151 678 5111 ext 2283&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Staff Nurse - Ward 22", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252433", "validThrough": "2020-11-16T23:59:59+0000"}