{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum, inc HCA"}}, "datePosted": "2020-10-29T10:46:25+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen for an Implementation Manager to lead a team to implement eRostering using Allocates HealthRoster Suite V10 to the Medical Workforce. Part of the role will to also play a pivotal role in the job planning strategy and compliance within the medical eRostering team here at King’s College Hospital (KCH). This is an ambitious new project offering you the opportunity to make a real difference across a thriving organisation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here at King’s we constantly challenge ourselves to be better. We are transforming King’s and part of this change is introducing and implementing eRostering to the medical workforce. In line with the new NHS People Plan as well as NHSI Levels of Attainment, it is crucial to the organisational development of medical staffing and having transparent processes for the co-ordination of our medical teams so that we can deliver the best for our patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an outstanding person to join our driven and motivated team. We are looking for someone with strong organisational skills who will provide support to the Project Lead to successfully deliver the implementation of eRostering across the medical workforce in the organisation. You will be committed to identifying, maintaining and pro-actively communicating with key stakeholders at all times as well as ensuring the implementation is in line with best practice standards and risks are managed and mitigated and the benefits realised.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have excellent communication and customer service skills, the ability to lead a team and a positive mind set toward continuous improvement and bringing positive changes. You will have great attention to detail and a drive to make positive changes and a “can do” attitude.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are someone with:&lt;br /&gt;• Proven experience in leading and managing change&lt;br /&gt;• Proven technical experience of Allocates HealthRoster Suite V10 (with an appetite to move to V11 in due course!)&lt;br /&gt;• Experience in project governance and report to a wide range of audiences&lt;br /&gt;• Experience of successfully working with stakeholders and securing their engagement&lt;br /&gt;• Has a passion for IT systems delivery and good working knowledge of Microsoft Office Packages&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Then we would love to hear from you.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Interviews - Friday 13th November&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Georgina Lee&lt;/p&gt;\n&lt;p&gt;Job title Medics eRostering Lead&lt;/p&gt;\n&lt;p&gt;Email address georgina.lee@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 8AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4712", "longitude": "-.090317"}}, "title": "Implementation Manager Electronic Roster and Job Planning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247969", "validThrough": "2020-11-08T23:59:59+0000"}