{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27041", "minValue": "24982", "unitText": "YEAR", "value": "£24,982 - £27,041 per annum"}}, "datePosted": "2020-10-22T09:35:47+0100", "description": "&lt;p&gt;In Norfolk we have exciting and ambitious plans to enhance the way we work with young people and their families. We are building a brand-new Targeted Youth Support Service. This will form part of a multi-agency commitment to improving outcomes for young people at risk of suffering harm outside of their family home. Relationship based practice will be at the heart of what we do. We are looking for a range of practitioners who can build trusted relationships with young people and provide interventions that increase safety and support a positive transition to adulthood.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an enthusiastic and skilled professional, you will contribute to the delivery of actions against individual safety plans, working with social care colleagues and other relevant partners. You will initiate, build and maintain trusting relationships with young people that contribute to creating safety, particularly in relation to risks outside the family home including, exploitation, youth violence and peer abuse. You will engage with young people to promote their emotional wellbeing and mental health, equip them with safeguarding techniques and facilitate informal learning activities based on their needs.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With an NVQ level 3, or equivalent in a subject relevant to youth work, health and social care or youth justice, you will have previous experience of working with vulnerable young people. You will have a working knowledge of child exploitation, the county lines model, factors impacting young people who go missing and understand adolescent development. With experience of working in partnership to improve outcomes for young people, you will understand safeguarding policy and practice and have the ability to assess and address risk.&lt;/p&gt;\n&lt;p&gt;You are required to travel as part of your role, the majority of which will involve working in a range of locations across the community with young people where they feel comfortable and in their family homes.  You will be responsible for your own travel arrangements and you may also be required to transport children in your own vehicle. In order to facilitate positive engagement with young people, you will be required to work outside of normal office working hours, including evenings and weekends.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join one of our teams within our brand-new Targeted Youth Support Service to connect, safeguard and improve outcomes for young people.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;APPLY&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City &amp; South. North, East &amp; Broadland. West &amp; Breckland", "postalCode": "NR1 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6154", "longitude": "1.30769"}}, "title": "Youth Support Workers (Case Workers)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237734", "validThrough": "2020-11-08T23:59:59+0000"}