{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82086", "unitText": "YEAR", "value": "£82,086 - £110,683 per annum"}}, "datePosted": "2020-11-04T10:32:03+0000", "description": "&lt;h2&gt;&lt;strong&gt;Sheffield Teaching Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Vascular Services Directorate&lt;/strong&gt;&lt;/h2&gt;\n&lt;h1&gt;&lt;strong&gt;Consultant Vascular Surgeons - 2 Posts&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;Located on rolling hills and dissected by river valleys, Sheffield is one of the greenest and most wooded cities in Europe. More than a third of the city lies inside the beautiful Peak District National Park, and it is virtually surrounded by open countryside. Its central location and excellent transport links also means it is less than two hours from most major metropolitan areas.&lt;/p&gt;\n&lt;p&gt;The Directorate of Vascular Services is seeking to appoint whole-time (10 PA) Consultant Vascular Surgeons to cover vacancies arising through retirements. We have already appointed two consultants who have recently joined the team, one of which will also take the role of Clinical Director for the Directorate. We are therefore now seeking our final appointments to complete the team. When fully established the whole team will be expected to support and extend the foundation for the redevelopment of the service as a cornerstone of our excellent tertiary, secondary and community services, including being the Major Trauma Service for adults across South Yorkshire &amp; Bassetlaw. The service is also responsible for supporting our colleagues at our local hospitals and some roles will therefore require delivery of clinical care by working across multiple sites. We also wish to rejuvenate the research and education profile of the Directorate and would be particularly interested in applicants who could help foster these improvements alongside a core focus on service delivery. Additional PAs could also be available to appropriate candidates to undertake research and other specific SPA work to support directorate ambitions.&lt;/p&gt;\n&lt;p&gt;Sheffield Teaching Hospitals NHS Foundation Trust is one of the UK’s busiest and most successful NHS foundation trusts. This is an exceptional opportunity to join an award winning and internationally recognised team, with a focus on innovation, research and high quality care, as well as family friendly working, and we are keen to discuss with individuals about how we can support their ambitions.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from candidates across the full spectrum of experience, from those who have recently completed training to those who have well-established careers. A clear commitment to deliver the very best services possible for our patients is imperative, and in the field of endovascular procedures, a flexible and truly collaborative approach to multidisciplinary working is essential.&lt;/p&gt;\n&lt;p&gt;Should any further vacancies arise, shortlisted candidates will be considered.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be registered with the GMC with a valid licence to practice. For further information please visit the GMC website and click on the Registration and Licensing link. You will also have completed Specialist Training (or equivalent) and be entered on the Specialist Register of the GMC, or have a CCT date within six months of the date of interview.&lt;/p&gt;\n&lt;p&gt;Research is encouraged and full facilities are available. Applications from those unable, for personal reasons, to work on a whole time basis or a job share basis will be considered.&lt;/p&gt;\n&lt;p&gt;Non-UK/EEA applicants should ensure they are aware of the recent changes to the Immigration rules. For further information on how this may affect your application visit the UK Government website.&lt;/p&gt;\n&lt;p&gt;If you experience problems applying please contact Medical HR Department, telephone (0114) 271 2968 quoting reference number 190-STH-20-225&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Akhtar Nasim, Clinical Director for Vascular Services, Email address: akhtar.nasim@nhs.net, Telephone number: 0114 2266080&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Mr Peter Braidley, Clinical Director for Cardiothoracic Directorate (previously also including Vascular Services) (email p.braidley@nhs.net). Telephone contact can be arranged via Jess McComb (PA to the Clinical Directors) on 0114 2266080.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Consultant Vascular Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255403", "validThrough": "2020-11-29T23:59:59+0000"}