{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55000", "minValue": "55000", "unitText": "YEAR", "value": "Up to £55,000pa DOE"}}, "datePosted": "2020-10-29T19:11:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical or Forensic Psychologist Adult Secure Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Opportunity...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a psychologist to provide psychological services for the male personality disorder and mental illness wards. The post holder will also have a clinical case load and be expected to work systemically with staff as well as directly with clients. You will provide consultation about the psychological care of the client group to staff, families and other agencies.&lt;/p&gt;\n&lt;p&gt;You will have experience of working with clients who present with personality disorder and mental illness. This should include experience of undertaking risk assessments as well experience of delivering interventions to target forensic treatment needs. Experience of using psychological therapies with this client group would also be regarded as advantageous (e.g. CBT/ DBT etc).&lt;/p&gt;\n&lt;p&gt;Within the multi-disciplinary team setting you will be expected to offer psychological insight and knowledge, whilst supporting the clinical, nursing and direct care teams in making skilled evaluations and decisions about risk and promoting psychologically informed environments.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will have a key role in the training and clinical supervision of trainee/assistant psychologists, as well as volunteers and psychology trainees/students on site. You will also have the opportunity to provide training to other professionals and to engage in consultancy, research and service development.&lt;/p&gt;\n&lt;p&gt;You will be joining a large psychology team so will have access to a wide range of knowledge and support from your colleagues and there will be considerable opportunity for further professional development through access to training and various CPD activities/events and research.&lt;/p&gt;\n&lt;p&gt;The post is full time however flexible working hours or reduced hours could be considered for the right candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for people who have...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HCPC Registration in Forensic or Clinical Psychology (or are well established in their route to achieving this)&lt;br /&gt;Experience of working with adult client groups with personality disorder/mental health difficulties/mild learning disability/autism etc.&lt;br /&gt;Knowledge and experience of psychological assessment and formulation as well as planning and delivering psychological interventions&lt;br /&gt;Experience of various risk assessments and psychological therapies&lt;br /&gt;Training and supervision experience is desirable&lt;br /&gt;The ability to work independently and as part of a multi-disciplinary team&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet, we&#39;ll offer you...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: up to £55,000 (depending on experience)&lt;br /&gt;Company pension scheme&lt;br /&gt;Free meals&lt;br /&gt;Free parking&lt;br /&gt;A comprehensive employee assistance programme and discount centre&lt;br /&gt;CPD opportunities&lt;br /&gt;Expert clinical supervision and peer support&lt;br /&gt;Opportunities to broaden experience and enhance service development across Cygnet Mental Health Services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Cygnet Health Care you’ll have the chance to make a real impact on patients and their families. We have been providing a national network of high quality specialist mental health services for over 30 years. With a true focus on outcomes those who use or commission our services can be assured we are an experienced, service-user focused, provider of quality treatment, care and rehabilitation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge where you can make a positive difference?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Click the link to apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury", "postalCode": "BL8 2BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5872", "longitude": "-2.31677"}}, "title": "Clinical/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249278", "validThrough": "2020-11-12T23:59:59+0000"}