{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "Up to £33,000 per annum"}}, "datePosted": "2020-10-15T14:28:40+0100", "description": "&lt;p&gt;&lt;strong&gt;We all agree on the importance of a good work life balance. If you currently find that long days with few breaks, night shifts, weekend working and ever-changing rotas are making that balance difficult to achieve then this post may be for you. The Nuffield Wessex radiology department strives to provide a work environment that allows you to be at your best so that you can deliver the best service to our patients. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our unique approach to connected healthcare means the difference can be truly transformative. As Britain’s largest not for profit healthcare provider, we’d love to take good care of you too. Investing every penny in our services and people, we’ll bring out the specialist in you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join us as a full-time Radiographer in our Wessex Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full-time (37.5hrs) post but there may be the opportunity for part-time hours for the right candidate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Nuffield Health Wessex Hospital is located in Chandlers Ford, just off of the M3 at Junction 12. We know how important parking is for staff and the hospital has arrangements which mean you won’t be charged nor have to drive around for an hour looking for spaces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has 40 ensuite bedrooms and 4 state of the art operating theatres. The radiology department provides a wide range of imaging including MR, CT, Fluoroscopy, DXA, mammography, ultrasound and general radiography.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you join us from the NHS or a private setting, you will find that we offer you an unrivalled opportunity to grow the respected career that you always wanted. You will benefit from our investment in state-of-the-art equipment and our commitment to give you more time with patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Radiographer you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver a high-quality diagnostic imaging service for a very varied caseload – within the department, on the ward and in theatre.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Work in an environment which allows the time to develop your skills. For the right candidate there will be the opportunity to learn / develop your CT skills.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Working with leading practitioners and experiencing new practices, equipment and facilities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Providing a service of the highest quality, delivered with sensitivity and compassion.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Radiographer you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;High levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A caring nature – to see each patient as an individual and carry out this role with understanding and empathy.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A BSC degree in diagnostic radiography or equivalent to meet the registration requirements of the Health and Care Professions Council (HCPC)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Evidence of post-graduate learning is desirable, as is evidence of involvement in areas such as infection prevention, radiation protection and/or health and safety.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent communication and team working abilities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you our unique health &amp; wellbeing focused benefits package. This includes free private healthcare and membership across all of our Fitness &amp; Wellbeing clubs. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £33,000 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location - Wessex Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekly Hours - 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested and would like to know more about this post then please contact Martin Coleman, Radiology Manager Nuffield Wessex on 02380 258 416 or 409&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wessex", "postalCode": "SO53 2DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9944", "longitude": "-1.36312"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228573", "validThrough": "2020-11-30T23:59:59+0000"}