{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27300", "minValue": "26197", "unitText": "YEAR", "value": "£26,197.41 - £27,300 per annum (DOE)"}}, "datePosted": "2020-10-16T13:57:17+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Staff Nurse / Outpatients RGN in our Exeter Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health Exeter Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Exeter Nuffield hospital is based next to the RD&amp;E hospital in Wonford, Exeter. The hospital has 2 theatres, as well as a hybrid cardiac catheter laboratory/theatre and an Endoscopsy suite. There are two ward areas; an inpatient area with 21 beds and a day-case ward with 12 beds. We also have a busy outpatient department, pharmacy, physiotherapy and radiology department including an MRI scanner. We specialise in elective orthopaedic and spinal surgery, cardiology including invasive procedures, general surgery, plastics and cosmetic surgery, ENT and gynaecology. The Hospital has a MAKO robot that undertakes some of the joint replacement surgery which we have become well known for in this field of surgery.  We are proud to have a team of friendly and motivated staff who are committed to providing safe, compassionate and high quality services to its patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our most recent CQC inspection was undertaken in the summer of 2016 and we were very proud to be rated as GOOD.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you join us from the NHS or a private setting, we are sure you will discover a more interesting and rewarding career with us. Here, you will discover nursing as it should be – with more time to care and get to know the people who are your patients. As a Staff Nurse / Outpatients Nurse you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Combine a passion for delivering excellent patient care, with the ability to manage varied and interesting caseloads.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Reassure and encourage patients while also having the clinical skills to take part in procedures and recovery.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have exposure to a wide range of procedures, requiring all your skills and experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Fully understand each case from a technical and personal viewpoint.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Instinctively meet patient’s needs, giving them and their families the comfort and reassurance they need when they are at their most vulnerable.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Interact with practitioners from other areas because you understand the importance of continuity in patient care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Staff Nurse in our Outpatients department you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be registered with the appropriate governing body. You will have the qualifications and experience relevant to your registration including NMC.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have post-registration experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be an excellent communicator and team worker. You will also be flexible and motivated.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £26,197.41 - £27,300 per annum (depending on experience)&lt;br /&gt;Closing date - 13/11/2020&lt;br /&gt;Location - Exeter&lt;br /&gt;Contract Type - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekly Hours - 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 4UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7163", "longitude": "-3.51129"}}, "title": "Staff Nurse - Outpatients (RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230487", "validThrough": "2020-11-13T23:59:59+0000"}