{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T10:16:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Welsh Student Nurses must apply via the Student Streamlining Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to permanently recruit a 37.5hrs Band 5 Community Learning Disability Nurse to join the Denbighshire Community Learning Disability Team. Applications are invited from Registered Learning Disability Nurses (RNLD) to join an experienced and innovative multi disciplinary team to provide a high quality service. The Denbighshire Community Learning Disability Team supports adults within the county of Denbighshire. &lt;br /&gt;&lt;br /&gt;The successful applicant will provide person centred assessments and interventions for adults with Learning Disabilities who have associated complex health needs in partnership with other agencies and carers. As a member of the team the post holder should possess strong interpersonal, communication and literacy skills as well as demonstrating an ability to work with a range of professionals, agencies and carers in a wide range of venues. The post holder will be expected to provide positive clinical services with a strong understanding of clinical governance. The post holder will be expected to work autonomously and as part of a team to improve outcomes for adults with Learning Disabilities within their local community, maintaining quality lives and free from harm. The post holder will be expected to be able to attend a variety of locations in a timely manner.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 18/11/20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rhona McCarthy, CLDN&lt;br /&gt;Tel: 01824 712750&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Caledfryn, Denbigh, Denbighshire", "postalCode": "LL16 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1814", "longitude": "-3.42575"}}, "title": "Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255344", "validThrough": "2020-11-18T23:59:59+0000"}