{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-13T11:46:17+0100", "description": "&lt;p&gt;&lt;strong&gt;SUBSTANTIVE GENERAL SURGEON POST:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT GENERAL AND LAPAROSCOPIC UPPER GI SURGEON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA’s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Department of General Surgery at Croydon University Hospital is a dynamic department looking to consolidate quality and continue to deliver excellence for patients of Croydon. This post was created due to the increasing pressures on elective and emergency general surgery in South London and the Croydon area. It supports the delivery of the London Emergency Standards and complements the separation of elective and emergency workloads. The General Surgery Department comprises 10 general surgical Consultants with supporting junior medical staff.&lt;/p&gt;\n&lt;p&gt;Croydon University Hospital NHS Trust provides a broad range of elective and emergency services to a population of 337,000, including General/Laparoscopic Surgery, Breast Surgery, Colorectal, Urological, Orthopaedic, ENT and Dental Surgery, and Gynaecology.&lt;/p&gt;\n&lt;p&gt;The applicants require emergency and elective general surgery experience as well as endoscopy skills. The successful applicant should have an audit and research portfolio, with an ongoing interest in expanding the portfolio and participation in clinical trial recruitment. They should also demonstrate management responsibilities and a significant commitment to teaching and training of junior staff.&lt;/p&gt;\n&lt;p&gt;Applicants must have FRCS or equivalent and be listed on the Specialist Register of the General Medical Council or be within 6 months of achieving CCT at the time of interview. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;INTERVIEW DATE: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Miss Stella Vig, Clinical Director for Consultant General Surgery on stella.vig@nhs.net or Rhys Thomas, Consultant General Surgeon on rhys.thomas3@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Consultant UGI Surgeon (Perm)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224102", "validThrough": "2020-11-08T23:59:59+0000"}