{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43520", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £43,520 per annum/pro rata for part time"}}, "datePosted": "2020-10-27T12:01:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Aneurin Bevan University Health Board&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Medical &amp; Dental Recruitment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Full Time Junior Clinical fellow (Lower Level) in General Medicine, based at Ysbyty Ystrad Fawr, Caerphilly with On-calls will be at The Grange University Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a Fixed Term Contract for up to 12 months initially, with potential for extension to a maximum of 2 years (following formal review). The anticipated start Date for this post is November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THIS IS A NON TRAINING POST &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is part of a team of junior (FY2) grade Doctors within Medical Directorate and general medicine based at Ysbyty Ystrad Fawr (Aneurin Bevan Hospital) and post holder will be doing on-calls at GUH. Ysbyty Ystrad Fawr is a new hospital that opened in November 2011 and GUH will be commissioned on 16th November 2020.&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board is an integrated organisation providing acute, community and mental health services across 5 unitary authorities. It serves a population in excess of 600,000, with additional services delivered to the neighbouring county of Powys.&lt;/p&gt;\n&lt;p&gt;Staff wellbeing is one of the Health Board’s priorities, with a comprehensive package of support and development opportunities available to all. It is the Health Board’s aim that it is an enjoyable and fulfilling place to work as feeling valued at work has a positive impact on both staff and patients. We have a well developed teaching programme for medical staff across the acute and community divisions. &lt;strong&gt;Close working between general medicine and community services is encouraged within the Health Board.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pre-interview/application visits to the team are warmly encouraged. Those wishing to discuss the post informally in the first instance or to arrange a visit should contact &lt;strong&gt;Dr Inder Singh, Clinical Director for YYF on 01443 802234&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position involves Regulated Activity with &lt;strong&gt;children and adults&lt;/strong&gt; as defined by the Safeguarding Vulnerable Groups Act (amended by the Protection of Freedoms Act 2012) and the following checks will be undertaken following any conditional offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced check with barred list information, including an adults and children’s barred list check Applicants must hold full registration and a licence to practice with the GMC&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Free parking is available across all Aneurin Bevan University Health Board Sites.&lt;/p&gt;\n&lt;p&gt;Course Funding: Please note that unless agreed by the Division in advance, course funding is not available for Clinical Fellow or fixed term cover for training grades.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Inder SinghJob titleClinical Director for YYFEmail addressinder.singh@wales.nhs.ukTelephone number01443 802234&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Ystrad Fawr, Ystrad Mynach, SE Wales, Ystrad Mynach", "postalCode": "CF82 7EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6333", "longitude": "-3.23584"}}, "title": "Junior Clinical Fellow in General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244388", "validThrough": "2020-11-10T23:59:59+0000"}