{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "Band 8A £45,753 - £51,668"}}, "datePosted": "2020-10-26T17:15:39+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We have an exciting opportunityin health technology assessment to join our team as a Health Technology Assessment Analyst.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;br /&gt;&lt;br /&gt; &lt;br /&gt;&lt;br /&gt; &lt;span&gt;The National Institute for Health and Care Excellence (NICE) is the independent organisation responsible for providing national guidance and advice on promoting high quality health, public health and social care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our role is to improve outcomes for people using the NHS and other public health and social care services. We do this by producing evidence-based guidance and advice for health, public health and social care practitioners; developing quality standards and performance metrics for those providing and commissioning health, public health and social care services and providing a range of information services for commissioners, practitioners and managers across the spectrum of health and social care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The &lt;strong&gt;Centre for Health Technology Evaluation&lt;/strong&gt; develops guidance on the use of new and existing medicines, treatments and procedures within the NHSthrough our Technology Appraisals, Medical Technologies and Diagnostic Assessment programmes.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The good news is due to additional funding from NHS England, the volume of guidance we produce on medical devices, diagnostics and digital technologies will increase significantly next year. This will allow us to help the NHS identify which of the many new technologies will deliver the best advances in patient care. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are therefore recruiting a range of technical roles that will be pivotal to delivering this increase in guidance production.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for enthusiastic individuals with technical skills to be responsible for the development, publication and quality assurance of guidance. You will provide technical oversight and guidance to the assessment of the clinical and cost effectiveness of pharmaceuticals, medical devices and diagnostic technologies, contribute to the training and development of new and existing members of staff, and the development of high-quality methods and technical practice across the guidance programme.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will need to have a relevant postgraduate qualification (masters or doctorate or equivalent) in a relevant area (such as health economics, medical statistics, clinical trials, epidemiology, or health services research). You should have the ability to analyse complex clinical and cost-effectiveness evidence, and to develop high-quality technical documents. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are recruiting into permanent Health Technology Assessment Analyst roles across the CHTE guidance producing programmes.&lt;br /&gt;&lt;br /&gt; &lt;br /&gt;&lt;br /&gt; Informal enquires welcome to:&lt;/span&gt;&lt;/span&gt;&lt;br /&gt;&lt;br /&gt; &lt;span&gt;&lt;span&gt;Alex Filby – Health Technology Assessment Adviser&lt;br /&gt;&lt;br /&gt; alexandra.filby@nice.org.uk&lt;br /&gt;&lt;br /&gt; 0161 4134092&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Closing date: Midnight, Monday 9November &lt;/span&gt;&lt;/span&gt;&lt;br /&gt;&lt;br /&gt; &lt;span&gt;&lt;span&gt;Interview date: w/c 23 November&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You can also find more information on working for NICE via our jobs page on the NICE website.&lt;/span&gt;&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "National Institute for Health and Care Excellence", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120816"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester  UK", "postalCode": "M1 4BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4805", "longitude": "-2.23899"}}, "title": "Health Technology Assessment Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243558", "validThrough": "2020-11-09T23:59:59+0000"}