{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T12:31:37+0000", "description": "&lt;p&gt;Tees, Esk and Wear Valleys are looking to recruit a skilled and motivated Band 7 Team Manager to work on a full-time substantive basis managing the Adult Integrated Community Mental Health team based in the centre of Scarborough. This is an exciting opportunity that has become available.&lt;/p&gt;\n&lt;p&gt;The successful candidate with the support of their leadership team will improve the lives of people with mental ill health by minimising the impact of their condition through effective leadership, management and service development to enable the delivery of excellent services to promote recovery and well-being for all service users.&lt;/p&gt;\n&lt;p&gt;The team operates across Scarborough area to meet the needs of the local population who present with mental health need. The team provide assessment and intervention for people who have mild through to severe and enduring needs.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is passionate about delivering excellent mental health services and can support and enable the team to achieve their potential. Key responsibilities will include supervision and appraisal for the team, performance, recruitment and management of staff, ensuring that people have timely access to our services and receive treatment in line with our pathways. You will need to have excellent relationship building and engagement skills and be capable of managing varied work demands based on the changing needs of the service. You will understand and embrace the challenge of delivering a service which is both high in quality, efficient and sustainable.&lt;/p&gt;\n&lt;p&gt;You will be working as part of the Senior Nurse On call system that operates out of hours, you will contribute to the existing Rota that is in place. On call payments are additional.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes. If necessary, adjustments can be considered in accordance with the Equality Act 2010.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You can expect ongoing commitment and support to your Continuous Professional Development and robust Supervision, Appraisal and Training.&lt;/p&gt;\n&lt;p&gt;Interviews will be supported via video or telephone conferencing during the COVID-19 social distancing measures.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicky Scott, Locality Manager nicky.scott1@nhs.net 01723384631&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ellis centre, Scarborough", "postalCode": "YO12 7SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2847", "longitude": "-.404394"}}, "title": "Integrated Community Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242458", "validThrough": "2020-11-16T23:59:59+0000"}