{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35806", "minValue": "30621", "unitText": "YEAR", "value": "£30,621 - £35,806 MF"}}, "datePosted": "2020-10-21T12:08:06+0100", "description": "&lt;p&gt;We are looking for two ambitious Social Workers with a desire to develop themselves, who have already undertaken the ASYE and/or other Post Graduate Social Work training, who have supervisory experience and/or the potential to supervise based on their level of knowledge, skill and practice experience. We’d like to hear from Social Workers who share our core values and who are passionate and motivated about supporting people in Buckinghamshire. &lt;/p&gt;\n&lt;p&gt;The Older People with Physical and Sensory Disabilities Team primarily provides advice, guidance, assessment and support to adults who need assistance to maintain or improve their overall wellbeing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the Aylesbury team, your role will be to manage a varied and interesting caseload to help support older adults with physical and sensory disabilities. You will have the opportunity to supervise less qualified and unqualified team members. You will also be provided with regular supervision and guidance, have access to numerous training opportunities and receive a competitive remuneration package.&lt;/p&gt;\n&lt;p&gt;We are a friendly and supportive team who all share a desire to achieve great results for our service users. We’d love you to come and join us.&lt;/p&gt;\n&lt;p&gt; We are looking for motivated, ambitious and inspiring people to join us on our journey. Not only will you be an integral part of the unique and exciting transition through the unitary process, you will also be entitled to a range of different benefits to make sure you are happy both at work and at home.&lt;/p&gt;\n&lt;p&gt; Our OPPSD Team, like the other teams with the Adult Social Care Service, works efficiently and collaboratively by using the Strengths-Based Approach. We focus on people’s strengths and work collaboratively with our customers. You will be part of this partnership by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Promoting a strengths-based approach to identify peoples’ and their communities’ resources&lt;/li&gt;\n&lt;li&gt;Maintaining and improving the standards of practice within the service&lt;/li&gt;\n&lt;li&gt;Leading areas of responsibility across the service&lt;/li&gt;\n&lt;li&gt;Working with customers who have a variety of strengths, aspirations and challenges and their families.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To support you in your role, you will start with a thorough induction over six weeks when you will have the opportunity to shadow colleagues, meet other relevant health professionals and visit various services.&lt;/p&gt;\n&lt;p&gt;You will have numerous opportunities for development and career advancement. We provide access to the latest research and practice tools in the form of e-learning and class-based learning on a variety of topics related to your professional and personal development, from Deprivation of Liberty Safeguards (DoLS) to presentation skills. We also support our staff to undertake specialised training needed to become Practice Educators, Best Interest Assessors or Approved Mental Health Practitioners.&lt;/p&gt;\n&lt;p&gt;You will have regular formal supervision with experienced senior members of staff and ongoing support from a team that is dedicated to sharing ideas and supporting each other.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached job summary for further information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We feel that it is important that our core values - Proud, Ambitious, Collaborative and Trustworthy - resonate with yours as we train and guide you to develop your knowledge and skills.&lt;/p&gt;\n&lt;p&gt;We are looking for colleagues who can help us to make our vision a reality by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Keeping our customers’ lived experiences at the heart of everything we do&lt;/li&gt;\n&lt;li&gt;Working collaboratively with our customers and families by acknowledging their contribution and building on their strengths&lt;/li&gt;\n&lt;li&gt;Remaining passionate about supporting the wellbeing of our customers and promoting their rights&lt;/li&gt;\n&lt;li&gt;Making sure that everyone’s voice is heard, so that we work reflectively, openly, and with integrity&lt;/li&gt;\n&lt;li&gt;Assuring the quality of practice and managing our performance, to inform service improvement and development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To achieve this, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be a qualified, Social Work England registered Social Worker&lt;/li&gt;\n&lt;li&gt;be able to work in partnership with people with diverse needs - customers, carers, colleagues and providers&lt;/li&gt;\n&lt;li&gt;be caring, motivated, reliable, flexible and resilient&lt;/li&gt;\n&lt;li&gt;demonstrate your ability to organise your own time and work efficiently&lt;/li&gt;\n&lt;li&gt;be able to support colleagues by using your leadership skills&lt;/li&gt;\n&lt;li&gt;have excellent observation, assessment and communication skills&lt;/li&gt;\n&lt;li&gt;be proactive in developing and sharing your knowledge and skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; We offer  agile and flexible working.&lt;/p&gt;\n&lt;p&gt;Access to / use of a vehicle is an essential requirement.&lt;/p&gt;\n&lt;p&gt;This post is exempt under the Rehabilitation of Offenders Act 1974. Due to the sensitive nature of the duties the post holder will be expected to undertake a criminal record check as part of the recruitment process.&lt;/p&gt;\n&lt;p&gt;Hard work and success deserves recognition. That’s why we pride ourselves on the benefits we give our people. We actively encourage a good work-life balance and promote flexible and agile working arrangements.&lt;/p&gt;\n&lt;p&gt;We provide discounts on various Cafés, restaurants, shops and auto enrolment onto our generous Pension Scheme with an employer contribution of &lt;strong&gt;26%&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We also offer a salary sacrifice personal car lease scheme and the opportunity to gain membership to Costco. We have discounted gym memberships, Travel discounts with Arriva and Chiltern Railways and much more.&lt;/p&gt;\n&lt;p&gt;Social Workers are also entitled to a generous enhanced reward package, as follows:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive basic salary with a special pay increment of £1,500 (Grade 5) or £1,750 (Grade 6) (full time, annual equivalent)&lt;/li&gt;\n&lt;li&gt;A ‘Golden Hello’ lump sum payment of £1000, paid upon successful completion of probation&lt;/li&gt;\n&lt;li&gt;New lease car scheme&lt;/li&gt;\n&lt;li&gt;Annual leave up to 30 days per year, as well as other types of leave&lt;/li&gt;\n&lt;li&gt;Up to 15 days per year training, learning and development offer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131354.jpg", "name": "Buckinghamshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aylesbury", "postalCode": "HP20 1XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8145", "longitude": "-.812314"}}, "title": "2 x Social Workers - OPPSD Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236279", "validThrough": "2020-11-22T23:59:59+0000"}