{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31098", "minValue": "31098", "unitText": "YEAR", "value": "£18.50 per hour"}}, "datePosted": "2020-10-27T11:01:14+0000", "description": "&lt;p&gt;Our Theatre team in our Wolverhampton Hospital currently have an internal opportunity for a Theatre Practitioner / ODP in aesthetics &amp; recovery. Continue your journey with us whilst we’ll support you to be your best.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We value expertise at Nuffield Health. It’s our combination of expert knowledge, innovative thinking and passion for care that has enabled us to become Britain’s largest not for profit healthcare provider. It has also helped us to build a unique network delivering connected healthcare - from hospitals, to Fitness and Wellbeing Clubs, to specialist services including physiotherapy. Across our network, brilliant people benefit from our commitment to invest every penny in our services and people. With more time and greater scope to do what you love, the specialist in you will thrive here.&lt;br /&gt;&lt;br /&gt;We’re looking for an exceptional Theatre Nurse or Practitioner with drive, passion and high standards. You might join us from the NHS or a private setting. Either way, you’ll discover unrivalled scope to work autonomously, make full use of your skills and knowledge and add value. This is nursing as it should be. You’ll be able to grow your career and be free of the constraints that prevent you from achieving job satisfaction. We know you thrive on the pressure and intensity of theatre work. So you’ll work closely with leading consultants and other like-minded professionals, who will respect and value what you bring to the close-knit multidisciplinary team. You’ll enjoy opportunities to work on a varied caseload using technology, equipment and facilities which are state-of-the-art. As well as supervising, supporting and developing junior staff, you’ll deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;br /&gt;&lt;br /&gt;As a registered Theatre Nurse or Operating Department Practitioner, you’ll have the qualifications and experience relevant to your registration, including NMC or HCPC. You’ll have post-registration experience, be an excellent communicator and team worker – flexible and motivated. As part of the wider hospital team you’ll interact with colleagues on the ward because you understand that continuity in patient care is key. Like us, you’re driven by quality. You don’t like to make compromises and we won’t ask you to. We’ll make sure you have everything you need to do a job you’re proud of.&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. So we promise to support you with training, career development and our unique health and wellbeing focused benefits package.This includes free membership of your local Fitness and Wellbeing Club, physiotherapy services and an annual health assessment, as well as a range of lifestyle and financial wellbeing benefits. Along with a competitive salary package you will also be paid enhancements for shift/unsociable hours worked and on call.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With drive, passion and high standards, you might join us from the NHS or a private setting. Either way, you will discover unrivalled scope to work autonomously, making full use of your skills and knowledge and adding value. As a Theatre Practitioner/ ODP – Anaesthetic &amp; Recovery you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work closely with leading consultants and other like-minded professionals, who will respect and value what you bring to the close-knit multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Enjoy opportunities to work on a varied caseload using technology, equipment and facilities, which are all state-of-the-art.&lt;/li&gt;\n&lt;li&gt;Supervise, support and develop junior members of staff.&lt;/li&gt;\n&lt;li&gt;Deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;/li&gt;\n&lt;li&gt;As part of the wider hospital team you will interact with colleagues on the ward because you understand that continuity in patient care is key.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Theatre Practitioner / ODP – Anaesthetic &amp; Recovery you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualifications and experience relevant to your registration, including NMC or HCPC.&lt;/li&gt;\n&lt;li&gt;Post-registration experience.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and will be a great team worker. You will also be flexible and motivated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key information about the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Up to £18.50 per hour&lt;br /&gt;Location - Wolverhampton&lt;/p&gt;\n&lt;p&gt;Hours - Bank contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV6 8LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5936", "longitude": "-2.17134"}}, "title": "Theatre Nurse/ ODP – Anaesthetics &amp; Recovery (RGN/ ODP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244106", "validThrough": "2020-11-24T23:59:59+0000"}