{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £40,000 dependent on experience"}}, "datePosted": "2020-10-20T14:06:11+0100", "description": "&lt;p&gt;How would you like to be in charge of an extensive estate of clinic locations? Do you have what it takes to manage the rapid expansion of this estate by providing precise and exacting operational and health and safety support across London and the South East? Are you dedicated to providing outstanding, efficiently run services to NHS patients for a dynamic fast-growing, successful award-winning privately owned NHS provider?&lt;/p&gt;\n&lt;p&gt;This role will offer you the opportunity to rapidly grow and develop your skills in an environment with an exacting focus on your personal growth and development. The team also conscientiously focuses on providing a positive environment and culture to work within, ensuring all team members benefit from a highly satisfying work experience. This is vital to enabling the team to provide the stunningly positive customer experience we aspire to provide to our NHS patients, their referring GPs and our local commissioning teams.&lt;/p&gt;\n&lt;p&gt;You will maintain the very highest standards within the NHS clinic locations and ensure delivery of those standards by developing excellent working relationships with each GP practice team. You will have experience of and the ability to manage health and safety processes and be able to evidence a demanding attitude to the highest standards of safety and service provision. You will utilise excellent attention to detail and organisational skills to ensure that all locations, equipment and support staff at each clinic site offer the best possible service, driving efficiency and continual service improvements. You will be looking for a professionally rewarding role within a busy, growing operational team, with the opportunity to progress as the company continues to grow.&lt;/p&gt;\n&lt;p&gt;Your role will involve ensuring that all clinic locations and facilities are accurately monitored, maintained and supported to the highest standards. This is a varied fast paced role where you will have the opportunity to use a solution focused approach to resolve any service delivery challenges. You will have the opportunity to travel regularly to sites within and around London. Your ability to adapt to changing priorities will be pivotal in ensuring the successful delivery of outstanding services at all of our locations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achievement of all clinic locations exacting standards to ensure that all services are offering an outstanding patient service.&lt;/li&gt;\n&lt;li&gt;Positive outcomes achieved for all CQC location visits, through effective monitoring, maintenance, quality improvement planning and strong relationships with location practice teams.&lt;/li&gt;\n&lt;li&gt;Establishing and maintaining strong working relationships with location practice/ facilities managers to ensure the highest standards of delivery at all clinic locations&lt;/li&gt;\n&lt;li&gt;Delivery of precise, regular location audits and subsequent specific improvement actions completed for all locations at least twice per year.&lt;/li&gt;\n&lt;li&gt;Pro-active support in the mobilisation and set-up of new locations and services.&lt;/li&gt;\n&lt;li&gt;Oversee the purchasing, registering, maintenance and monitoring of all site equipment, ensuring that clinical equipment maintenance is documented.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please find job description and person specification attached for your review. Please note that this role is band 5 role salary range; £30,000 - £40,000 dependent on experience and development needed (inclusive of London weighting).&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about this opportunity to join our dynamic and positive team, please send us your application today.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Communitas Clinics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thornton Heath", "postalCode": "CR7 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3973", "longitude": "-.103387"}}, "title": "Clinic Location and Health and Safety Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234707", "validThrough": "2020-11-10T23:59:59+0000"}