{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40500", "minValue": "34000", "unitText": "YEAR", "value": "£34,000 to £40,500 per annum, pro rata"}}, "datePosted": "2020-10-20T14:14:26+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Psychiatric Nurse /Mental Health Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Liaison Nurse (CLN)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Veteran’s Complex Treatment Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:  East Midlands&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £34,000 to £40,500 per annum, pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 x post Fixed Term Contract until April 2022&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 x post Fixed Term Contract until June 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full time 37.5 hours Monday to Friday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Andrew’s Healthcare is one of five National providers of the Complex Treatment Service for Veterans. Our team is growing and we have an exciting opportunity for Nurses with Minimum 1+ years’ experience who are passionate about helping Veterans cope with the effects of living with complex trauma and/or mental health needs to join our team.  If you are a proactive Community Psychiatric Nurse or Mental Health Nurse with excellent communication skills who would like to join our dynamic, passionate and highly skilled team as a Clinical Liaison Nurse, we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;St Andrew’s Community Partnerships&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Andrew’s is a charity commissioned by the NHS to provide specialist mental healthcare for people with some of the most complex and challenging mental health needs in the UK.  Community Partnerships specialises in taking our clinical expertise into community outpatient settings.  We, therefore, offer a variety of services both in Northampton, London and surrounding areas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In April 2018 we were commissioned by NHS England to provide a specialist Complex Treatment Service (CTS)  for Military Veterans across the East of England.  Veterans are referred by colleagues in the Transition, Intervention and Liaison Service (TILS) teams in Essex and Lincoln for military related trauma and/or mental health needs with the expectation that they will be seen as close to their homes as possible.  The ideal candidates will live within the East Midlands and be able to commute to the service’s central base in Northampton.  The team also have the ability to work remotely, and deliver support via telephone and video, as well as face to face.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a highly motivated and friendly team, reporting directly to the Clinical Lead.  You will be a key part of the multi-disciplinary team in helping to design and implement a service that is uniquely tailored to meet the needs of Veteran’s living in the East Midlands.  You will be working in close collaboration with our partner TILS in Lincoln and Colchester.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the Clinical Liaison Nurse, you will play a pivotal role in all aspects of a Veteran’s care whilst they are engaged with our service, acting as the liaison between them and all partners involved in their care.  You will act as a single point of contact for the Veteran as well as for other agencies working with the Veteran.  You will lead in assessing and maintaining an overview of the Veteran’s mental health needs and progress through regular telephone and individual appointments and will also be responsible for delivering trauma focused interventions as part of a multi-disciplinary treatment plan.  You will therefore have had some prior experience of delivering psycho-social treatment interventions.  You will also have excellent written and interpersonal communication skills so that you can liaise with other agencies involved in the Veterans care to ensure that all aspects of their treatment are reflected in their CTS care plan to promote their recovery.  You will also be comfortable working in a range of community settings as well as working remotely and using digital platforms to offer video consultations as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In the event of the Veteran being referred to a secondary care service (e.g. acute or PICU admission), your role as Clinical Liaison will be to work with the Veteran, the secondary care provider and the appropriate people within TILS and the CTS team to ensure that the Veteran’s stay is as short as possible and the appropriate support is in place when they return home.  Similarly, if the Veteran comes into contact with the Criminal Justice Service during their treatment, your role will be to support them and to ensure continuity in their care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Given the extensive geographical region the service covers, a full, clean driver’s license is essential for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to the pioneering nature of this service, there will be opportunities for service development including co-production with service users and an interest and enthusiasm in these areas is desired.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;One of our Clinical Liaison Nurses, shared this about his experience of working in the role: &lt;strong&gt;&lt;em&gt; ““This new and exciting role allows me to work as a Clinical Liaison Nurse with a forward thinking service, helping military veterans and their families.  As a veteran myself, I find my role extremely rewarding, although not without its challenges. Being an integral part of this dedicated and friendly team makes this my ideal job.”&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an excellent benefits package including pension, 35 days holiday, sickness policy on par with NHS, life cover, cycle to work scheme and childcare vouchers and opportunities for research, teaching and continuing professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion about this opportunity, please contact  Dr Melanie Coxall, Clinical Lead of Veterans Complex Treatment Service on 01604 616 420 or mjcoxall@standrew.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Sunday 8th November&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Midlands", "postalCode": "LN1"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2829", "longitude": "-.64467"}}, "title": "Community Clinical Liaison Nurse, Veteran&#39;s Service - East Midlands", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234716", "validThrough": "2020-11-08T23:59:59+0000"}