{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £31,615 pro rata"}}, "datePosted": "2020-10-09T14:27:24+0100", "description": "&lt;p&gt;Circle Bath Hospital, a leading healthcare provider in Somerset, has an opportunity for an Experienced Registered Nurse or ODP to join the Endoscopy Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We were founded in 2004 by a group of doctors and managers who believed in a fresh approach to healthcare. We wanted to create a culture of partnership where each staff member is empowered and feels able to make a real difference, where the best management ideas from other sectors to health were applied, and where patients come first above all else.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role &amp; Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide excellent nursing care, and to actively participate in and contribute to the management in the Endoscopy Unit. Participate in the maintenance of endoscopes and other specialized equipment used in endoscopic and non-endoscopic procedures and provide technical assistance during such procedures&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;DUTIES AND RESPONSIBILITIES:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring a high standard of  care to patients attending the Endoscopy Unit, working within company policies and procedures.&lt;/li&gt;\n&lt;li&gt;Providing technical assistance during diagnostic and therapeutic Endoscopic procedures, ensuring safe working practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Setting, monitoring and maintaining excellent standards of nursing care.&lt;/li&gt;\n&lt;li&gt;Maintaining personal contact with patients and relatives, being sensitive to their needs for courtesy, dignity and privacy and ensuring a friendly environment at all times.&lt;/li&gt;\n&lt;li&gt;Maintaining timely and accurate patient records and ensuring that confidentiality is respected.&lt;/li&gt;\n&lt;li&gt;Storing, checking and administering drugs in accordance with established standards and guidelines&lt;/li&gt;\n&lt;li&gt;Working with minimal supervision during endoscopic procedures, admission and recovery of patients and other related procedures&lt;/li&gt;\n&lt;li&gt;Contributing to the local resolution, investigation and follow up action of any informal or formal complaints.&lt;/li&gt;\n&lt;li&gt;Participating in the care and maintenance of endoscopes and other specialized equipment, ensuring an agreed standard of decontamination at all times including accurate records of traceability of all endoscopes and associated equipment.&lt;/li&gt;\n&lt;li&gt;Ensuring the safe discharge of all patients from the Endoscopy unit.&lt;/li&gt;\n&lt;li&gt;Maintaining a safe and clean environment within the clinical area in accordance with established standards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;30 hours Part Time Shift patterns:  08.00-16.000/10.00-18.00/08.00-18.00&lt;/p&gt;\n&lt;p&gt;Monday-Friday occasional Saturdays&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Pin or HCPC&lt;/li&gt;\n&lt;li&gt;Previous experience within endoscopy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional benefits of joining Circle Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days’ annual leave with additional days for long-term service&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme: save money on a new bike and benefit from interest-free instalments&lt;/li&gt;\n&lt;li&gt;Private pension scheme helping your to live well in retirement&lt;/li&gt;\n&lt;li&gt;Employee assistance programme: get confidential support 24/7&lt;/li&gt;\n&lt;li&gt;Private medical insurance to help you get any treatment you need quickly&lt;/li&gt;\n&lt;li&gt;Non-contributory life assurance and income protection insurance&lt;/li&gt;\n&lt;li&gt;Perkbox for employee discounts at a range of retailers, restaurants and other services&lt;/li&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;Free Uniform&lt;/li&gt;\n&lt;li&gt;Season ticket loan: get the benefit of an annual ticket and pay the cost over 12 months&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 8SQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3113", "longitude": "-2.41636"}}, "title": "Endoscopy Nurse/ODP part time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220644", "validThrough": "2020-11-27T23:59:59+0000"}