{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105000", "minValue": "80000", "unitText": "YEAR", "value": "80,000.00 to 105,000.00"}}, "datePosted": "2020-10-26T14:37:47+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;General Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Full and Part Time Sessions&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Up to £105,000&lt;br /&gt;Location: Southend-on-sea&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you acaring and passionate,General Practitionerbased in the Southend-on-sea area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use serviceswould recommend them?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a General Practitioner delivering NHS services with us you will receivea salary of up to £105,000 – including NHS pension.We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. Wewill offer a combination of in house eLearning, workshops and courses to support your development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as up to discounted experience days, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health. All this, and flexible working patterns to help support your work/life balance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a GMC registered General Practitioner as well as having experience working within Primary Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a General Practitioneryou will be a proactive member of the team whose skills will ensure safe, quality and value for money services are being provided in an efficient and systematic manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working within a large team, you will work alongside a multi-disciplinary team of other dedicated and highly skilled healthcare professionals to care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice and actively improving the way we work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have built organisation-wide committees in many specialist fields. You’ll have the option to join your clinical specialism, networking with professionals from across the country. We get together regularly, auditing and sharing standard methodology for innovation and service re-design. You’ll be a part of the pool of subject matter experts bringing together clinical and operational leads. You will be a part of quality improvements, research and development activity. Here we recognise and celebrate clinical excellence and dedication.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Inspired&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserve acknowledgment for their commitment for going above and beyond to ensure that their colleagues and service users feel the difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to discuss the role further or request a job description then please contact our Recruitment Advisor via email: Samantha Hamilton, Samantha.Hamilton@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We partner with the NHS to make a real difference to people in Southend-on-sea and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend-on-Sea", "postalCode": "SS2 4BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.551", "longitude": ".729334"}}, "title": "General Practitioner - Full and Part Time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242927", "validThrough": "2020-11-09T23:59:59+0000"}