{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-05T13:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;East Lancashire Hospitals NHS Trust&lt;/strong&gt; provides a range of health care services primarily for the people of East Lancashire, which comprises of the Boroughs of Blackburn, Burnley, Hyndburn, Pendle, Ribble Valley and Rossendale. Our Trust aims to provide appropriate, high-quality personal and organisational development interventions, which will improve patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Complex Case Management team/Integrated Discharge Service. The successful applicants will work as an integral part of the ward multi-disciplinary teams and supporting organisational improvements in discharge planning and patient flow so that East Lancashire Hospitals Trust can deliver its objectives of Safe, Personal and Effective care delivery through safe, appropriate and timely discharge.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to influence and develop services within our organisation. The integrated discharge service is a major facet of our transformation work and discharge to assess model of care. This is an evolving and dynamic environment, and the ability to lead change through people is essential for the role.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual with outstanding leadership skills, excellent communication skills and the ability to operate and manage a team to provide an organisational wide service. The post holder must have a detailed understanding of discharge planning processes as well as recent experience within an acute hospital environment.&lt;/p&gt;\n&lt;p&gt;The post holder must have the confidence and skills to work effectively across organisational boundaries and understand the complex and sometimes conflicting priorities that this role entails.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure you check the email account from which you apply regularly as we may use this to contact you regarding your application. &lt;br /&gt;&lt;br /&gt;Only those applicants who demonstrate clearly how they meet our person specification will be shortlisted for interview. &lt;br /&gt;&lt;br /&gt;We reserve the right to close any vacancies from further applications when we have received a minimum number of applications from which to make a shortlist. Please ensure you apply without delay if you wish to be considered for this role. &lt;br /&gt;&lt;br /&gt;The Trust is committed to creating a well managed, flexible working environment that supports staff and promotes their welfare and development. We are committed to promoting equality and diversity; we value the contribution of individual talent, skills, knowledge and experience and aim for a workforce demography representative of the local community. We operate Zero Tolerance to aggression, violence, bullying and harassment. We will make reasonable adjustments to ensure our recruitment and selection process is accessible to all. Flexible Working applications will be considered. The Trust operates a No Smoking Policy. &lt;br /&gt;&lt;br /&gt;Should you require a reasonable adjustment to our recruitment process please contact a member of Recruitment Services on 01254 73075 at the earliest opportunity to ensure that measures can be put in place to enable your application for this post. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Please Note: new entrants to the NHS will normally commence on the first pay point of the relevant band.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea IsherwoodJob titleHead of Complex Case ManagementEmail addressandrea.isherwood@elht.nhs.ukTelephone number01254 733460&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Hospital, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Complex Case Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257947", "validThrough": "2020-11-19T23:59:59+0000"}