{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T09:34:31+0000", "description": "&lt;p&gt;We are looking for a committed and enthusiastic Officer on a 12-14 Month Secondment basis to cover the role of Emergency Preparedness, Resilience and Response Officer – Interoperable Capabilities with the following main roles and duties:&lt;/p&gt;\n&lt;p&gt;Provides a focal point for the Trust in relation to the Interoperable Capabilities (CBRNE, MTA, Mass Casualty Planning and Command and Control). Ensuring that planning and response arrangements are in place to achieve an effective and co-ordinated response to adverse events, major incidents and emergencies as defined by the Civil Contingencies Act (2004).&lt;/p&gt;\n&lt;p&gt;Managing the recruitment, training, performance and delivery of Special Operations Response Teams (SORT) and Marauding Terrorist Attack Teams (MTA). Providing leadership to these teams and managing external relationships with partner agencies.&lt;/p&gt;\n&lt;p&gt;Being accountable for the delivery of the NHS England National Interoperable Capability standards relevant to their area of responsibility.  &lt;/p&gt;\n&lt;p&gt;Develops, tests and evaluates plans for specific threats and events relating to the Interoperable Capabilities as identified by the Trust or Community Risk Registers. Liaising with multiagency partners to ensure plans align with other agencies.&lt;/p&gt;\n&lt;p&gt;Actively participates in multi-agency forums at the Tactical Level to ensure that there are robust arrangements in place that enable the efficient and effective health response in the event of a major incident. These include national Technical User Groups.&lt;/p&gt;\n&lt;p&gt;Remain up to date in National, European, NHS or emergency services strategies concerning civil protection issues related to the Interoperable Capabilities as necessary. Supporting the EPRR Manager with interpreting these and ensuring that the Trust is aligned. &lt;/p&gt;\n&lt;p&gt;Full details as per the Job Description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The interview date is set as the 18th November 2020. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Shortlisting will be completed on the 12th November 2020. &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Start date: ASAP. &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121045.png", "name": "South Western Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121045"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol or Exeter", "postalCode": "EX2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7202", "longitude": "-3.46476"}}, "title": "EPRR Officer - Interoperable Capabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243851", "validThrough": "2020-11-11T23:59:59+0000"}