{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum pro rata"}}, "datePosted": "2020-11-04T11:02:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Chef&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a chef to join our busy team to assist and support the Head Chef, Catering Manager and other teams as directed and required.&lt;/p&gt;\n&lt;p&gt;As part of your role you will carry out food production duties throughout the facilities, manage services in the provision of a high quality, cost effective service to meet the standards, policies and objectives of the department.&lt;/p&gt;\n&lt;p&gt;You will be required to cook food in the manner laid down, using the ingredients specified, following recipes, production methods and achieving the required standards.&lt;/p&gt;\n&lt;p&gt;It will be part of your role to ensure high standards of personal hygiene and maintain good hygiene practices and strict compliance with the Trusts Code of Practice on Food Hygiene Regulations 2006.&lt;/p&gt;\n&lt;p&gt;You must adhere to safe working practice and procedures within the Trust’s Code of Practice and the Health and Safety at Work Act 1974; whilst cooperating with the Occupational Health Department to enforce preventive efforts to improve health and safety.&lt;/p&gt;\n&lt;p&gt;You will be required to attend courses, lectures and meetings when considered necessary by management and also to attend all relevant annual mandatory training.&lt;/p&gt;\n&lt;p&gt;If this role fits your profile, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stewart Nimmo - Catering Manager&lt;/p&gt;\n&lt;p&gt;Email address: stewart.nimmo@qehkl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01553 613540&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital NHS Foundation Trust, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Chef", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255527", "validThrough": "2020-11-18T23:59:59+0000"}