{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Agenda for change"}}, "datePosted": "2020-10-29T09:56:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Post Title: Specialist Biomedical Scientist - Band 6&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Directorate/Department: Microbiology / Virology Pathology&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Agenda for Change: Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Purpose:&lt;/strong&gt;&lt;br /&gt;To work as part of the laboratory team, providing a high level of Microbiological analysis in order to provide patients with the highest level of diagnosis and treatment.&lt;br /&gt;Utilising the appropriate testing, in a timely manner, to assist the Consultant Microbiologists and thus ensure the correct clinical diagnosis.&lt;br /&gt;To perform a range of specialist microbiological, technical and scientific activities, including testing samples from NHS and other laboratories.&lt;br /&gt;The post holder would be expected to assist in any co-ordinated response or activity of a national/international nature, e.g. a bioterrorism incident or a major disease outbreak, e.g. SARS, H5N1 influenza etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To process the specimens received and to undertake the related tasks in the various sections of the laboratory, leading to the reporting and interpretation of results in accordance with agreed policies and standard operating procedures (SOPs).&lt;br /&gt;To validate all wound swabs from General Practice and other defined clinical areas. This requires an in depth knowledge of antibiotics used to treat wound, skin, throat and ulcer infections. To check clinical details before validation and ensure correct antibiotics are released to ensure appropriate treatment of infectious diseases. To initiate further work where appropriate e.g. MRSA and ESBL confirmation. To refer to the medical validation queue any isolates that are more resistant than expected.&lt;br /&gt;To initiate further work where appropriate e.g. MRSA and ESBL confirmation. To refer to the medical validation queue any isolates that are more resistant than expected.&lt;br /&gt;To validate all Campylobacter species, Salmonella species and Giardia lamblia isolated from General Practice and other defined clinical areas. To refer to the medical validation queue any isolate where an outbreak is suspected. To refer any isolate of Salmonella typhi, Salmonella paratyphi A and B.&lt;br /&gt;Utilising microbiological techniques to work competently in all sections of the Microbiology Laboratory, namely diagnostic bacteriology, Mycology, General Serology, Chlamydia and Molecular diagnostics.&lt;br /&gt;To demonstrate a good understanding of clinical microbiology and to maintain scientific and specialist knowledge, commensurate with the grade of specialist BMS. Also to undergo further training as may be necessary and available.&lt;br /&gt;To be responsible for equipment and automated processors in the area of responsibility and identify any problems. To act as first-line ‘trouble-shooter’, when and where appropriate, and to bring problems to the attention of senior staff. To ensure technical failures are documented using the appropriate laboratory quality policies.&lt;br /&gt;To communicate effectively with all members of the Microbiology team and other health care professionals.&lt;br /&gt;To respond accordingly to changes in laboratory protocols and quality changes.&lt;br /&gt;To liaise with senior BMS, medical and scientific staff in all matters relating to the diagnosis of infection.&lt;br /&gt;To monitor quality control results and bring any anomalies to the attention of Senior BMS staff as soon as is practicable.&lt;br /&gt;Where appropriate to assist with research and audit projects.&lt;br /&gt;To assist in the production and dissemination of laboratory reports, data and statistics and to maintain relevant records appropriately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;&lt;br /&gt;The above is only an outline of the tasks, responsibilities and outcomes required of the role. You will carry out any other duties as may reasonably be required.&lt;br /&gt;The job description and person specification may be reviewed on an ongoing basis in accordance with the changing needs of the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duty of Care&lt;/strong&gt;&lt;br /&gt;You are responsible for ensuring that the patient, family and carers are at the centre of everything you do.&lt;br /&gt;Be open, honest and willing to acknowledge when something has gone wrong. Make timely apologies and take action to report incidents, including near misses; to ensure that as an organisation we learn.&lt;br /&gt;You should continuously seek to reduce harm by speaking up to managers and leaders if you believe that a lack of skills, knowledge or resources place patients at a risk of harm or if your concerns are not being listened to. Managers and leaders must listen to others when they raise concerns and take action.&lt;br /&gt;Wholeheartedly commit to learning about safety, continually striving to improve excellent care. Develop your own ability to detect and correct defects.&lt;br /&gt;NHS Standards of Business Conduct and Professional registration All employees must abide by the guidance set out in the NHS Code of Conduct and Standard Business Conduct for NHS Staff (HSG 93/5), as amended or replaced from time to time. Managers must also comply with the NHS Code of Conduct for Managers.&lt;br /&gt;All clinical professionally regulated staff must abide by the codes of conduct issued by their respective regulatory bodies (e.g. NMC, GMC, HPC) and ensure that they maintain updated registration as required by the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental Capacity Act 2005&lt;/strong&gt;&lt;br /&gt;All Staff are required to ensure knowledge regarding the Mental Capacity Act 2005 (MCA) at a level deemed essential for their role.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Biomedical Scientist Specialist Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247790", "validThrough": "2020-12-31T23:59:59+0000"}