{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T11:01:47+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;We are seeking to recruit Band 6 midwives to join our dedicated and caring team. We are continuing to implement the principles outlined within &#39;Better Births&#39;, so continuity of carer is high on our agenda. We have a geographical model in the community. This position will be based both in the community and hospital setting, with a view to becoming a part of our transformational workforce. These are exciting times.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;We are an acute Foundation Trust which spans both East Suffolk and North East Essex; these posts are for the Colchester Site caring for women in the unit and in the community. Car driver is essential.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;We support approximately 3.600 women to birth their babies per year, we have a co-located Midwife birthing unit which has four Birthing rooms with birthing pools in three and a &#39;multi-trac&#39; system in the other room. We also offer, Cube couches low level lighting and other facilities to support normal birth including the use of Aromatherapy and Hypnobirthing. We have 8 birthing rooms in the Delivery Suite for women with more complex pregnancies, with two Birthing pools, telemetry for continuous monitoring of the foetus, with a central consul in the handover room, thus reducing the amount of intrusion in the birthing environment. We also offer the low level lighting, and actively support hypnobirthing across all birth settings. We also have two theatres and a recovery as part of Delivery Suite. We have an average of approximately 20% midwife led births per month&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our community teams have recently adopted the &#39;buddy system&#39; to enhance the provision of continuity of carer and the Better Birth values and standards. Maternity Medway is used for recording all of our care provision in the community, which enables all midwives to have at their fingertips the whole information regarding the care and plans of care for their women. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;If your application is successful and you are invited to interview please note that you will be asked to complete a CTG interpretation using the FIGO method. If you would like any support with this, please use the details below.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;‘Please note that this role is subject to a DBS check which will be charged to the successful candidate. Full details can be found within the ‘DBS Information’ documents attached to this advert.’&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouisa WhiteJob titleMaternity MatronEmail addressLouise.White@esneft.nhs.ukTelephone number01206 742651Additional contact information&lt;/p&gt;\n&lt;p&gt;Justyna Skonieczny - Maternity Matron Justyna.Skonieczny@esneft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester, Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Continuity of Care Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255514", "validThrough": "2020-11-18T23:59:59+0000"}