{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142 per annum (pro-rata for part time)"}}, "datePosted": "2020-11-02T11:12:25+0000", "description": "&lt;p&gt;A new opportunity has arisen for a Band 3 Healthcare Assistant working for Defence Primary Healthcare. If you would like the opportunity to work in a friendly and exciting environment and provide an important service to patients then this may be the role for you. As a Band 3 Healthcare Assistant you will support the team to ensure optimum health and wellbeing for patients and maximum deployability.&lt;/p&gt;\n&lt;p&gt;An important part of the service is clinical care including taking blood samples to be sent to the laboratory for testing, wound care and health promotion. The healthcare assistant also supports the delivery of the service by providing some administrative support, such as ordering clinical supplies.&lt;/p&gt;\n&lt;p&gt;Your primary duties will include but are not be limited to:&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Clinical Practice&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing safe, evidence-based, cost-effective and individualised patient care as delegated, prioritising own workload and ensuring effective time management strategies are embedded in own practice.&lt;/li&gt;\n&lt;li&gt;Offering a holistic service to patients and their families, developing where appropriate an on-going plan of care/support, with an emphasis on prevention and self-care.&lt;/li&gt;\n&lt;li&gt;Working with nursing, medical and health care assistant (HCA) colleagues to ensure that National Service Frameworks (i.e. diabetes, mental health) are being delivered.&lt;/li&gt;\n&lt;li&gt;Provision of a phlebotomy (blood-taking) service as requested by a registered practitioner ensuring test samples are appropriately labelled and packaged for transportation to the lab.&lt;/li&gt;\n&lt;li&gt;Carrying out health screening and measurements, including: blood pressure; weight, height and body mass index; urinalysis; pulse rate and rhythm; ECG; glucose tolerance test; and peak flow readings.&lt;/li&gt;\n&lt;li&gt;Carrying out patient health checks, including health screening and measurements, and recording previous medical history, family history and current medications.&lt;/li&gt;\n&lt;li&gt;Undertaking wound care.&lt;/li&gt;\n&lt;li&gt;Providing education, support and encouragement to patients to self-manage their conditions, including teaching inhaler technique.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Management &amp; Leadership&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Encouraging and developing teamwork within the practice.&lt;/li&gt;\n&lt;li&gt;Participating in the development of nursing policies and procedures.&lt;/li&gt;\n&lt;li&gt;Helping the Medical Facilitator operate in a cost-effective manner.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Training, Supervision &amp; Development&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting the education and development needs of colleagues, less experienced staff and trainees.&lt;/li&gt;\n&lt;li&gt;Contributing to the planning and implementation of the teaching for existing staff and attached leaners including students.&lt;/li&gt;\n&lt;li&gt;Taking responsibility for maintaining a record of own personal development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Professional&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Participating in continuing professional development opportunities to ensure that up-to-date evidence-based knowledge and competence in all aspects of the role is maintained.&lt;/li&gt;\n&lt;li&gt;Recording accurate consultation data in patients records in accordance with the military guidelines and other pertinent standards.&lt;/li&gt;\n&lt;li&gt;Planning and implementing health promotion activities in the waiting room, e.g. smoking, exercise and diet.&lt;/li&gt;\n&lt;li&gt;Organising the provision of patient information leaflets, as requested.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NVQ level 3 or equivalent experience.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Technical Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB1 – Promotion of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB5 – Provision of Care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RM 7050, QEMHC, St Michaels Ave, Tidworth UK SP9 7EA", "postalCode": "SP9 7EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.234", "longitude": "-1.67015"}}, "title": "Band 3 Health Care Assistant (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251728", "validThrough": "2020-12-01T23:59:59+0000"}