{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "NHS AFC Band 2"}}, "datePosted": "2020-10-26T14:30:53+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An opportunity has arisen for Bank PTS Care Assistants in Northamptonshire. We are delighted to be recruiting for our Patient Transport Service covering numerous locations across Northamptonshire. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an ideal opportunity for individuals to join a service which is committed to delivering outstanding patient care across Northamptonshire and the East Midlands. If you are looking for a role that truly delivers job satisfaction and the opportunity to develop in an environment where the patient is at the centre of everything we do, then this role is for you. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are particularly looking for individuals who: - Are truly committed to delivering excellent patient care - Have personal values that match those values of EMAS of, respect, integrity, teamwork, contribution and competence - Are looking to join an employer who is committed to developing its’ workforce - Are looking to develop themselves - Have a desire to be the best they can possibly be You will be required to attend a full-time training course for four weeks.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;On successful completion of the training you will be required to provide high quality patient care and transportation to and from designated destinations as directed, maintain high standards of service delivery and ensure the safety and well-being of patients at all times. It is essential that you hold a full current driving license (including Categories A &amp; E – old style license or Categories B new style license). Minor offences may be considered. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;With excellent communications skills, you must have 2 GCSE’s in Maths and English minimum Grade D or above, or an equivalent qualification in numeracy and literacy (level 1). Evidence of a caring approach in a work or personal environment is essential.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy WellsJob titlePerformance Delivery ManagerEmail addressamy.wells@emas.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "East Midlands Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121632"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Northamptonshire", "postalCode": "NN2 8DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.269", "longitude": "-.90072"}}, "title": "PTS Care Assistant - Bank (Northamptonshire)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242897", "validThrough": "2020-11-08T23:59:59+0000"}