{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T08:16:51+0000", "description": "&lt;p&gt;It is an exciting time to join the newly formed Bedfordshire Hospital NHS Foundation trust.&lt;/p&gt;\n&lt;p&gt;You will be joining a friendly, high performing Trust committed to ensuring the health and wellbeing of the staff. Access to programmes of high quality training and development to help you grow in your career.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a dynamic and experienced nurse to take on a Team Leader role in Critical Care at Bedford Hospital.&lt;/p&gt;\n&lt;p&gt;Our adult Critical care service provides an integrated level 1, 2, and 3 Critical Care service with 6 level 3 and 4 Level 2 Critical care beds in a purpose built unit and 24/7 level 1 service.&lt;/p&gt;\n&lt;p&gt;Our unit is exciting, challenging and supportive and you will be working as part of highly skilled dynamic and friendly team.&lt;/p&gt;\n&lt;p&gt;The role requires taking charge of the unit, supervising clinical care, managing a group of team members on a given shift. The post holder will assist the Critical Care Matron with the continuing responsibility for Critical Care services, to ensure the assessment of care needs, the development, implementation and evaluation of programmes of care is of a high standard. Also providing leadership, role modelling good professional practice and behaviour and maintaining safe environment.&lt;/p&gt;\n&lt;p&gt;We are looking for a reliable, motivated, approachable and enthusiastic Team Leader for Critical Care Complex.&lt;/p&gt;\n&lt;p&gt;This is a challenging position in a fast moving environment, must have substantial experience in critical care setting, have excellent communication skills and ability to work as a part of multi professional team managing a wide range of complex problems and sometimes conflicting priorities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Wendy Millard Job title Practice Development Nurse Email address Wendy.Millard@bedfordhospital.nhs.uk Telephone number 01234792257&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital Critical care Complex, South wing, Bedford", "postalCode": "MK429DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258880", "validThrough": "2020-11-16T23:59:59+0000"}