{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-04T12:31:10+0000", "description": "&lt;p&gt;We are looking for an outstanding senior nurse to lead the Discharge Team as Discharge Matron. This role is pivotal to ensuring a safe, caring and effective discharge pathway for all patients that meets each individual’s needs.&lt;/p&gt;\n&lt;p&gt;As Discharge Matron, you will role model Trust behaviours and values and embed these into a seamless patient centred discharge pathway. Developing relationships across professional boundaries is key to the success of this so the ability to engage with colleagues across the whole healthcare economy is vital.&lt;/p&gt;\n&lt;p&gt;Your role will be to work alongside operational colleagues and ensure discharge across the organisation runs smoothly, ensuring our discharge processes are safe, coordinated and occur in a timely manner by working closely with the Discharge Nurses, MDT, wards and the operational teams to plan and coordinate discharge.&lt;/p&gt;\n&lt;p&gt;Your proven skills and experience will ensure that you can develop and maintain excellent relationships with stakeholders even when under pressure, sustaining clear links with external partners to ensure seamless support and timely decision making – we just want the best for our patients.&lt;/p&gt;\n&lt;p&gt;You will also coordinate and regularly report on performance in relation to discharge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note candidates will be required to present original certificates for qualifications at interview stage. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates must be able to participate in the Trust senior manager on call (SMOC) as required through the Trust on call rota.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will require you to work across all areas in the Trust which includes those that are designated as positive, asymptomatic and negative COVID wards. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Talbot-Crosby&lt;/p&gt;\n&lt;p&gt;Divisional Director of Nursing&lt;/p&gt;\n&lt;p&gt;Email address sue.talbot-crosby@wwl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01942 778868&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Albert Edward Infirmary, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Discharge Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255841", "validThrough": "2020-11-18T23:59:59+0000"}