{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £56,490 per annum inc HCAS depending on"}}, "datePosted": "2020-10-12T12:01:53+0100", "description": "&lt;p&gt;POST TITLE&lt;/p&gt;\n&lt;p&gt;Senior Clinical / Counselling Psychologist&lt;/p&gt;\n&lt;p&gt;REFERENCE No.&lt;/p&gt;\n&lt;p&gt;BASE&lt;/p&gt;\n&lt;p&gt;Hillingdon Older Adult Mental Health Service, Woodland Centre, Hillingdon Hospital.&lt;/p&gt;\n&lt;p&gt;CLOSING DATE&lt;/p&gt;\n&lt;p&gt;GRADE&lt;/p&gt;\n&lt;p&gt;Band 7 / 8a, (permanent: full-time, part-time, job share considered).&lt;/p&gt;\n&lt;p&gt;INTERVIEW DATE&lt;/p&gt;\n&lt;p&gt;SALARY&lt;/p&gt;\n&lt;p&gt;as for AFC Band 7/8a&lt;/p&gt;\n&lt;p&gt;POST REQUIREMENTS&lt;/p&gt;\n&lt;p&gt;Applications are invited from HCPC registered Senior Clinical / Counselling Psychologists with an interest in working with older people. This is an interesting and varied post within a well-established older people’s mental health service in the London Borough of Hillingdon. The post holder(s) will be working across our memory service, bed-based unit, and CMHT settings.&lt;/p&gt;\n&lt;p&gt;This is a permanent post (full-time or part-time considered) comprising of:&lt;/p&gt;\n&lt;p&gt;· Two days (0.4 WTE) in our memory service, delivering high quality assessment (including the formal assessment of cognition) and intervention&lt;/p&gt;\n&lt;p&gt;· Two days (0.4 WTE) delivering a high-quality psychology service to Oak Tree ward, our acute inpatient ward for older people (providing services for people living with both dementia and / or psychiatric problems)&lt;/p&gt;\n&lt;p&gt;· One day (0.2 WTE) delivering high quality professional psychology assessment and intervention service in our Older Adult Community Mental Health Team (CMHT).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· &lt;strong&gt;We will consider applications from those looking for part-time / job share roles.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will suit individuals with an interest in assessing and working with older people living with dementia (from early to advanced stages) and a range of other mental health conditions using skills in both direct clinical work and training and consultation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would consider a band 7 as a developmental role depending on your experience. In this instance we would consider candidates who can demonstrate some relevant post qualification experience and are willing to work toward achieving a set of agreed developmental objectives. A band 7 Job Description and Person specification is attached under Additional Documents.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in the developmental role, please state this in the supporting information section of your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Depending on experince, there will be opportunities to supervise unqualified staff and host trainee psychologists on placement in the service. The post holder will also have a role in supporting the development of psychology, and the wider service, across the CMHT, Memory Service, and Oak Tree ward. It is an opportunity which will allow for an enthusiastic and innovative person to further develop their career in psychology.&lt;/p&gt;\n&lt;p&gt;The post holder will join an established group of psychologists working with older people across Five Boroughs of London: one of the largest groups of its kind. This group holds regular professional and clinical development meetings and a development program for psychologists across the experience range.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In the current COVID 19 context our recruitment process will be in keeping with social distancing guidance at the time of interview. Interviews for this post may need to take place using internet video media.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UNIT INFORMATION&lt;/p&gt;\n&lt;p&gt;The post holder will be based in Hillingdon at The Woodland Centre, Hillingdon Hospital, Pield Heath Road, UB8 3NN.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;ENQUIRIES&lt;/p&gt;\n&lt;p&gt;For further information about this post please contact:&lt;/p&gt;\n&lt;p&gt;Dr Guy Harman, Consultant Clinical Psychologist: 01895 488998, or;&lt;/p&gt;\n&lt;p&gt;Jennifer Grogan, CMHT &amp; Memory Service Manager: 01895 488998.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Guy HarmanJob titleConsultant Clinical PsychologistEmail addressguy.harman@nhs.netTelephone number01895 488998&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodland Centre, Hillingdon Hosptial, Uxbridge", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Senior Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222239", "validThrough": "2020-11-09T23:59:59+0000"}