{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 (with a £5,000 joining bonus)"}}, "datePosted": "2020-11-02T09:26:36+0000", "description": "&lt;p&gt;We are currently recruiting for Specialist Biomedical Scientists to join our fast paced and dynamic Blood Sciences team. This role is part of a team which provides an efficient and effective Blood Sciences service to two general hospitals (Southend University/Basildon and Thurrock University Hospitals) and local GP community.&lt;/p&gt;\n&lt;p&gt;This an exciting time for us and our transition into our state-of-the-art laboratories that delivers 900 different tests across a multitude of disciplines.&lt;/p&gt;\n&lt;p&gt;As an important member of our team, you will be the fundamental principle of making a positive difference to our healthcare service and in return you will receive regular training and coaching to develop your skills and to support you in your working life. Ideally, we seek candidates who are passionate with good interpersonal skills and the drive to develop their career forward within our supportive environment. Applications are sought from self-motivated candidates who are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC registered, have at least 2 years post registration experience and have a Specialist portfolio or equivalent in (Blood Science). We will consider applications from people nearing the completion of their specialist portfolio.&lt;/li&gt;\n&lt;li&gt;Able to work across 3 different sites in a 24-7 work environment.&lt;/li&gt;\n&lt;li&gt;Able to work with a high degree of accuracy, numeracy, interpretive skills and good problem-solving skills.&lt;/li&gt;\n&lt;li&gt;Able to demonstrate a good knowledge and experience of industry standard laboratory information management systems and computer applications including Word, Excel, Power Point, Access and Statistical Packages.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "iPP Analytics Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Essex", "postalCode": "SS14"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5783", "longitude": ".471053"}}, "title": "Specialist Biomedical Scientist - Band 6 - Blood Sciences", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251397", "validThrough": "2020-11-16T23:59:59+0000"}