{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-11-06T09:45:47+0000", "description": "&lt;p&gt;Trust Registrar (ST3-ST7) – Respiratory and Acute Medicine&lt;/p&gt;\n&lt;p&gt;On-call – Band 1A/1B (depending on rota)&lt;/p&gt;\n&lt;p&gt;Maternity Cover Until July 2021&lt;/p&gt;\n&lt;p&gt;Applications are welcome for two Trust Grade Registrars (ST3-ST7) – Respiratory.&lt;br /&gt;&lt;br /&gt;We have a busy 33 bedded Acute Medicine Unit which sees the majority of acute medical admissions and a busy 33 bedded Respiratory ward. The post holders will be expected to be able to provide cover to the unit and support the registrars and consultants in Respiratory and AMU. It is an excellent opportunity to gain/develop experience in both Respiratory and Acute Medicine.&lt;br /&gt;&lt;br /&gt;In Respiratory our aim is to provide a continuum of care for Respiratory diseases spanning the acute District General Hospital, and the necessary medical, social and therapies provision to promote maximal independence of people living with Respiratory diseases in the community.&lt;br /&gt;&lt;br /&gt;The appointees will generally be responsible for the assessment and treatment of patients admitted to the Respiratory department under direct supervision of 3 Respiratory consultants.&lt;br /&gt;&lt;br /&gt;There is also the opportunity to get involved in outpatient activities, which include sessions in the Lung Cancer Clinic pathway where patients undergo a comprehensive assessment, a multi-disciplinary approach to managing care and follow-up clinics for sensitive consultations about the optimum management of the disease. There will also be the opportunity to develop specialist interests such as TB.&lt;br /&gt;&lt;br /&gt;All candidates should be eligible for registration with the GMC. &lt;br /&gt;MBBS (or equivalent), MRCP UK (or equivalent), Full registration with GMC are essential. &lt;br /&gt;&lt;br /&gt;Successful completion of Core Medical Training (or equivalent) and Experience of Elderly Care Medicine are essential. &lt;br /&gt;&lt;br /&gt;Where equivalent qualifications or experience are being offered, it is essential that the candidate provides written confirmation and attaches this to their application. &lt;br /&gt;&lt;br /&gt;Please note that this advert will close once an adequate number of candidates have applied.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr. Rachel Tennant - rachel.tennant@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Trust Registrar in Respiratory Medicine (NPH)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259072", "validThrough": "2020-11-20T23:59:59+0000"}