{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-10-30T16:17:03+0000", "description": "&lt;p&gt;The University Hospitals of North Midlands NHS Trust (UHNM) is a large teaching hospital serving over 3 million people. The Trust has 2 hospital sites; The Royal Stoke Hospital and County Hospital. The pharmacy team is forward thinking, enthusiastic and continually strives to improve the delivery of patient focused pharmaceutical care and optimise the use of medicines within the Trust. The pharmacy at County Hospital has a refurbished dispensary, an electronic medicines management system , ward based dispensing in remote dispensing hubs and supports the sales of medicines to staff and patients.&lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, highly motivated, dynamic and enthusiastic person to join our friendly team. You must have excellent organisational and communication skills and you’ll need to be able to work effectively with the existing team both at ward level and within the pharmacy directorate.&lt;/p&gt;\n&lt;p&gt;The ATO post will work with and assist Senior ATOs, Pharmacy Technicians and Pharmacists in providing a wide range of Pharmaceutical services in all areas including dispensary, stores and wards. The directorate actively promotes development, education and training. The post holder will be given specific training in all areas to help develop skills further, this will include working towards an NVQ level 2 in Pharmacy Services.&lt;/p&gt;\n&lt;p&gt;The post holder must have 4 GCSEs (or equivalent) including Maths and English at grade C/4 or above.&lt;/p&gt;\n&lt;p&gt;The post is 28 hours per week, participation in weekend and Bank Holiday rotas are essential. flexible working applications will be considered.&lt;/p&gt;\n&lt;p&gt;The post will be based at County Hospital.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel AdamsonJob titleLead Pharmacy Technician – Dispensary ServicesEmail addressrachel.adamson@uhnm.nhs.ukTelephone number01785 230743&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, Stafford", "postalCode": "ST16 3SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8113", "longitude": "-2.09774"}}, "title": "Pharmacy Assistant Technical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250919", "validThrough": "2020-11-15T23:59:59+0000"}