{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-29T10:15:57+0000", "description": "&lt;p&gt;Westham Ward is a busy, acute and dynamic 27 bedded Acute Medical Ward that specialises in Care of the Elderly &amp; Rheumatology, The team is both friendly and supportive, with a strong commitment to providing a high standard of care, and we are looking for highly motivated, dynamic and passionate individuals.&lt;/p&gt;\n&lt;p&gt;Our aim is to maximise and deliver excellent patient care by using all the resources available. To reduce length of hospital stay and maintain patient flow. This is achieved by having a daily multi-disciplinary meeting, to discuss every patient. The Hospital Intervention Team, Social Services, medical teams and the nursing staff, meet to establish the needs of the patient, the management plan and how a safe discharge can be achieved in the timeliest manner.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Whether you are just starting out on your Nursing career, looking for a change of job, working in a Nursing Home or even returning to practice, we would welcome the opportunity to meet with you, our team is both friendly and supportive, with a strong commitment to providing a high standard of care.&lt;/p&gt;\n&lt;p&gt;Thee successful applicant will have recent NHS experience with at least 6 months at Band 5 in the field of acute medical nursing. Ideally you will have, or be willing to undertake a recognised teaching and assessing qualifications be able to work within a team and have effective communication skills.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and dedication, East Sussex Healthcare Trust offers excellent opportunities for career progression and professional development as well as a personal induction programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Matron Andrea Hall on 0300 131 4500 extension 134737&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne DGH, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Staff Nurses  - Westham Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247873", "validThrough": "2020-11-12T23:59:59+0000"}