{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142  per annum pro rata"}}, "datePosted": "2020-10-21T11:28:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Clinical Support Worker Children’s Complex Care – Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Springbank Resource Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £19,737 to £21,142 per annum pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – Full-time and Part-time posts offered&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 16th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 24th November (Via Microsoft Teams)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Children’s Complex Care Team provide care in children’s own home delivering 1-1 clinical care to children with life limiting and life threatening conditions. The shifts required are mainly night time shifts from 22.00 - 08.00. There are requirements to attend day time shifts for training.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical tasks include oral suction, tube feeding and delivery of personal care. We are looking for staff who have experience working with children. Experience of the clinical skills are advantageous but all training is provided so this is not essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Support Worker you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service.&lt;/p&gt;\n&lt;p&gt;Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not.&lt;/p&gt;\n&lt;p&gt;You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to meet the Care Certificate standards.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheltenham", "postalCode": "GL51 0LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9114", "longitude": "-2.12011"}}, "title": "Support Worker - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236110", "validThrough": "2020-11-15T23:59:59+0000"}