{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-11-03T14:22:11+0000", "description": "&lt;p&gt;&lt;strong&gt;We are seeking a General Practitioner (Salaried) to join the Omnes Healthcare Family; become part of a company that makes a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Hours: 24 hours per week&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Location: Seeking General Practitioners to join our team at&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Tessa Jowell Health Centre,72H, E Dulwich Grove, East Dulwich, London SE22 8EY &lt;em&gt;(Monday and Fridays) &lt;/em&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;&lt;em&gt;Parkside Medical Centre, Camberwell Green, SE5 7AQ (Tuesdays)&lt;/em&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Omnes Healthcare Limited are operating within the NHS to provide personalised, quality healthcare services and have been doing so since 2006. We aim to develop supportive, genuine relationships with every patient, physician, nurse and healthcare professional that we come into contact with. We believe each patient is unique and deserves treatment that is both effective, heartfelt and has a positive outcome on their well-being.&lt;/p&gt;\n&lt;p&gt;When you join us, you&#39;ll be part of something special–an innovative and rapidly growing organisation where we know that the finest patient care comes from empowering our teams to be the very best at what they do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the purpose of the position?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This is an exciting opportunity to join a successful expanding team working within the NHS. We are seeking enthusiastic General Practitioners to work within established teams&lt;/li&gt;\n&lt;li&gt;The environments are busy and hands-on. Applicants must be capable of rising to the challenge of working in new ways and willing in time to practise autonomously.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide the full range of NHS Primary Medical Services to the patients registered to Omnes Healthcare, temporary residents and patients presenting for immediately necessary treatment including clinical examination, diagnosis, treatment and referral as appropriate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to join the Omnes Healthcare Family?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current GMC Registration&lt;/li&gt;\n&lt;li&gt;Inclusion on the GP register&lt;/li&gt;\n&lt;li&gt;Experience of working in a Primary Care environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Omnes Healthcare will offer you in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;An extra day off to celebrate your birthday&lt;/li&gt;\n&lt;li&gt;NHS Discount&lt;/li&gt;\n&lt;li&gt;And other benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also offer mentoring and are committed to training and development with a view to becoming a local GP Lead, GP Trainer and/or GPSI status. GP Leads, GP Trainers and GPSI’s will receive enhanced remuneration should their skills be utilised within the business. Study leave and training cost support is also available.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Apply today if you want to make a difference.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We believe in innovation; we believe in listening to everyone; we believe in providing quality service; and we believe our employees will help us achieve our mission.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please be aware that all communications about this vacancy will be received to you via email. Always check your mail box and junk mail folders and provide a UK mobile number if available.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Dulwich", "postalCode": "SE22"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4522", "longitude": "-.069111"}}, "title": "General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254323", "validThrough": "2021-01-15T23:59:59+0000"}