{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa pro rata"}}, "datePosted": "2020-11-05T13:16:03+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Senior Clinical Fellow in Emergency Medicine (ST4+)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Love Emergency Medicine but wish you could combine it with your specialist interest? Want to broaden your interests in a non-clinical area without losing too much training time? Can you help us strive for clinical excellence?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our senior clinical fellow posts are split into 80/20%, are open as OOPT/E for EM HSTs and as stand-alone posts for non-trainees, and can be 100% EM if required. We are also open to SAS and Specialty Doctors if that suits.&lt;/p&gt;\n&lt;p&gt;You will be joining a forward thinking Trust, recently awarded outstanding by the CQC for 2 years in a row, based in the heart of Bristol – a city that has been rated in the top 3 best places to live and work in the UK!&lt;/p&gt;\n&lt;p&gt;The post provide an ideal opportunity for the successful candidates to develop their own specialist interests while working in a busy inner city university hospital, with teaching and research responsibilities and are based in the adult side of the department, serving the Bristol Royal Infirmary (BRI).&lt;/p&gt;\n&lt;p&gt;What could your specialist interest be?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Global Health (overseas partnerships)&lt;/li&gt;\n&lt;li&gt;Expedition Medicine (established expeditions)&lt;/li&gt;\n&lt;li&gt;Ultrasound&lt;/li&gt;\n&lt;li&gt;Paediatrics&lt;/li&gt;\n&lt;li&gt;RCEM Learning digital education fellow&lt;/li&gt;\n&lt;li&gt;Research&lt;/li&gt;\n&lt;li&gt;Frailty&lt;/li&gt;\n&lt;li&gt;Wellness&lt;/li&gt;\n&lt;li&gt;Safety&lt;/li&gt;\n&lt;li&gt;Pre-Hospital Education Emergency Medicine (PHEM).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have a particular specialist interest which you would like to pursue which is not listed above then we will look to see if this is something that we can accommodate. Please also specify which special interest you would like to apply for in your application.&lt;/p&gt;\n&lt;p&gt;The main posts include 80% time working in the adult emergency department and 20% paid time to develop in a specialist interest of the successful candidate’s choice, which might include things as diverse as expeditions, humanitarian work, global health or staff wellbeing. The full time posts are based solely in the adult Emergency Department and would be perfect for someone wishing to gain more experience prior to applying for higher EM training – support and advice is available for this.&lt;/p&gt;\n&lt;p&gt;The posts are offered as a fixed term contract until August 2020 with a review at 6 months. Educational support, computer and office facilities will be provided to the successful candidate, including a study budget.&lt;/p&gt;\n&lt;p&gt;Applicants should hold a relevant postgraduate qualification (MRCEM, MRCP, MRCS, FRCA or equivalent), and should be ST4 + or equivalent, having completed a minimum of 3 years in approved SHO posts (Post Foundation Medicine) or equivalent in relevant acute specialities including at least 1 year in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Duncan Courtney Duncan.Courtney@UHBristol.nhs.uk and Elizabeth Martin Elizabeth.Martin2@UHBristol.nhs.uk and their Secretary Emily Broughton on 0117 342 1499 /97&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Senior Clinical Fellow in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257822", "validThrough": "2020-11-19T23:59:59+0000"}