{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Salary negotiable depending on level of experience"}}, "datePosted": "2020-10-30T17:01:36+0000", "description": "&lt;p&gt;Requirements: HCPC registration as an Applied Psychologist.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of specialist psychological assessment and treatment of patients across care settings, including community and inpatient settings.&lt;/li&gt;\n&lt;li&gt;Must be trained or have experience in the assessment tools HCR-20 and RSVP.&lt;/li&gt;\n&lt;li&gt;Experience of representing Psychology within a multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;Experience of working with individuals with mental health difficulties and a forensic history or challenging behaviour.&lt;/li&gt;\n&lt;li&gt;Experience of working with patients detained under the Mental Health Act (1983).&lt;/li&gt;\n&lt;li&gt;Experience of teaching and / or presentation of research or Clinical or Forensic work in a range of settings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your skills and qualities we offer&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking available, Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General, Comprehensive Learning &amp; Development Package, Progression Opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check and Hepatitis B vaccination&lt;/p&gt;\n&lt;p&gt;About the role: Are you seeking a new opportunity within a successfully Mental Health Hospital?&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit an Applied Psychologist, to be based at New Hall Independent Hospital in Ruabon. The Hospital caters for up to 32 patients and has over 90 staff.&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative and motivated Psychologist who will support the Head of Psychology to lead and develop psychology services in New Hall. This will include opportunities to be innovative and to develop psychological therapy approaches and interventions to meet the individual needs of the patients. We are looking for someone with relevant experience from previous practise or from their core training if newly qualified. But most of all we are looking for an individual with passion and drive to be the best they can be for our patients. In return, we will show a real commitment to upskill and develop you within what is an ambitious and exciting services that thrives on excellent care and treatment for patients.&lt;/p&gt;\n&lt;p&gt;Good working knowledge of up to date therapy, research and evidence based practices are essential for this role. Experience of working as part of an MDT and therapist is vital.&lt;/p&gt;\n&lt;p&gt;The ability to be innovative; focused on quality; have team ethics; be honesty and transparent, have empathy and supporting others are essential to the position.&lt;/p&gt;\n&lt;p&gt;As the Applied Psychologist your role will include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To work autonomously within professional and organisational guidelines and exercise responsibility for the governance of psychological practice within relevant services.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To provide psychological assessment, formulation and interventions to inpatients at New Hall and to act as a specialist resource to the wider professional community.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To work collaboratively as a member of the Multidisciplinary team and in line with the organisational policy for Multidisciplinary Team working.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To utilise research skills for audit, policy and service development and research within MHC.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide systemic support and training to the nursing and support team to assist in the delivery of effective care and rehabilitation of service users.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To contribute to service development, Clinical or Forensic governance and multi-disciplinary forums as directed.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Location Details: New Hall Independent Hospital provides a rehabilitation and recovery model of care and treatment for 32 male patients, aged 18-65 years, who have Mental Health Problems requiring hospital admission and treatment. Currently the Hospital has a low secure ward and controlled egress ward, supporting patients on their journey to recovery and eventually stepping down into the community or other supporting accommodation or residential services.&lt;/p&gt;\n&lt;p&gt;New Hall&#39;s philosophy of care is based upon the principles of rehabilitation, recovery and social inclusion, and focuses on enhancing the strengths and resilience of individuals and their families.&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion / belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact Dr Jonathan Jones, Consultant Clinical Psychologist on 01490 430288 or alternatively MHC Workforce on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest)&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ruabon, Wrexham", "postalCode": "LL14 6HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9984", "longitude": "-3.03144"}}, "title": "APPLIED PSYCHOLOGIST - NEW HALL", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251030", "validThrough": "2020-11-29T23:59:59+0000"}