{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T10:31:29+0000", "description": "&lt;p&gt;&lt;strong&gt;DEPUTY WARD MANAGER - INPATIENT MENTAL HEALTH &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HOURS: 37.5 - FULL TIME&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OLDER PEOPLE ASSESSMENT AND TREATMENT UNIT &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; CRYSTAL CENTRE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has now arisen and we are in the position to recruit a Deputy Ward Manager to be part of dynamic, multi-disciplinary team working at our older adult inpatient ward based at Crystal Centre, Chelmsford.&lt;/p&gt;\n&lt;p&gt;We offer a service which is provided by a team that shares the workload fairly, acknowledges individual abilities and skills and recognises the individual staff member’s responsibility when providing care. Staff support and supervision are integral to our service. The Ward team is multidisciplinary, consisting of Nurses, Consultant Psychiatrist, Clerical staff, domestics, Physio therapy staff and occupational therapists with close liaison with Social Services, and other related disciplines.&lt;/p&gt;\n&lt;p&gt;An understanding of the Recovery Model approach is required, taking into account the needs of families and carer’s, whilst providing leadership to a team and be prepared to become part of an established multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for people who can bring commitment, fresh ideas, and determination to take forward our service in new and innovative ways. In return we offer Training and development of staff, support through regular Supervision and Appraisal, assisting you in setting realistic objectives.&lt;/p&gt;\n&lt;p&gt;The Crystal Centre has close transport links to Chelmsford and the surrounding areas, plus easy access to the A12 with free parking on site.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated staff who share our Trust values of &lt;strong&gt;Positive, Welcoming, Respectful, Involving, Kind and Accountable. In return EPUT can offer you a range of benefits including;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary Sacrifice schemes including Childcare Vouchers, lease cars and Cycle to Work&lt;/li&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;Participation in the Working Longer Review supporting staff to work longer&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Weekly health &amp; wellbeing articles&lt;/li&gt;\n&lt;li&gt;Equality and Diversity Sub-Groups where staff can raise issues relating to equality at work&lt;/li&gt;\n&lt;li&gt;Equality Champions who are there to support other staff requiring support at work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Debbie Turner Job title Matron Email address debbie.turner8@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crystal Centre, Chelmsford", "postalCode": "CM1 7LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7768", "longitude": ".461006"}}, "title": "Deputy Ward Manager - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244017", "validThrough": "2020-11-10T23:59:59+0000"}