{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13000", "minValue": "13000", "unitText": "YEAR", "value": "£13,000 per annum"}}, "datePosted": "2020-11-03T11:29:55+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Non-Executive Director&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston NHS Foundation Trust (UHBW) is a dynamic and thriving organisation. We serve some of the country&#39;s most culturally diverse communities. We have a workforce of over 13,000 staff, delivering over 100 different clinical services across 10 different sites serving the population of Bristol, Weston and the south west.&lt;/p&gt;\n&lt;p&gt;UHBW is also a leading clinical education and research institution. We have strong links with both of the city’s universities and teach students in medicine, nursing and other professions allied to health. Research is a core aspect of our activity and it has an increasingly important role in the Trust’s business.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint to an upcoming vacancy for a Non-Executive Director on our Board of Directors. Our ideal candidate would have knowledge and experience of developing organisational change in relation to Diversity and Inclusion in order to give our Board a fresh perspective on this important area of work within the Trust. We are also looking for the following experience and attributes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working in a large and complex organisation at a senior/executive level&lt;/li&gt;\n&lt;li&gt;A demonstrable history of success within the field of health academia or research&lt;/li&gt;\n&lt;li&gt;The motivation and enthusiasm to make a real difference to the wellbeing and social inclusion of the people using the Trust’s services&lt;/li&gt;\n&lt;li&gt;In-depth knowledge of the current challenges and opportunities for the health and care system in Bristol, North Somerset and South Gloucestershire&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please upload a copy of your CV and a covering letter.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date for applications is Friday 27 November 2020.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Working pattern - (A minimum of 3-5 days per month)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Fixed term length -The term of office is 3 years, and can be renewed by agreement with the Trust&#39;s Council of Governors up to a recommended maximum of 9 years.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Non-Executive Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253712", "validThrough": "2020-11-27T23:59:59+0000"}