{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-11-04T10:16:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Full Time Band 7 / 8a Linked Sonographer &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;With its close road and rail links to London, the coast and Europe, Maidstone’s rural setting in the Garden of England is ideal for country and town lovers alike.&lt;br /&gt;This rotational post serves Maidstone and The Tunbridge Wells at Pembury Hospitals. You will be joining a well established, forward-going team of Sonographers and Radiologists providing a wide range of high quality ultrasound examinations and independent reports. The new PFI build at Pembury provides direct access for trauma &amp; in-patient services, with a dedicated ultrasound room and Surgical Assessment Unit also soon to have its own Ultrasound Room. Maidstone Hospital progresses with its Oncology and Stroke Care. &lt;br /&gt;&lt;br /&gt;We provide obstetric services for 12 week Nuchal Assessment, Anomaly and Growth scans as well as General Abdominal, Small Parts and Gynae examinations. A ‘One Stop Stroke Service’ is in operation along with direct GP access for suspected DVT. We offer sonographer-led musculoskeletal ultrasound and there is a lead sonographer for head &amp; neck work. We also have a rolling sonographer training program which has a waiting list. &lt;br /&gt;&lt;br /&gt;The service operates extended days (8am to 6pm) Monday to Saturday and this will extend to Sundays when staffing levels permit. &lt;br /&gt;&lt;br /&gt;Continued Professional Development is well supported, both in-house and with access to outside courses and we have a well-established in-house training program.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Tuesday 17th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: To be confirmed &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine ParrinJob titleLead Superintendent of UltrasoundEmail addresscatherine.parrin@nhs.netTelephone number01622 225689&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255332", "validThrough": "2020-11-17T23:59:59+0000"}