{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-02T12:54:50+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Breast Screening Co-ordinator&lt;/span&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Band 4&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the Breast Screening administration team in a brand new role as a Breast Screening Co-ordinator on a fixed term/secondment basis for 12 months.&lt;/p&gt;\n&lt;p&gt;This is a new role with the aim to improve screening uptake and coverage and reduce the variation in cancer screening programmes, focusing on population groups who are particularly vulnerable to screening inequalities.&lt;/p&gt;\n&lt;p&gt;You will engage directly with clients and support them to participate in screening. Demonstrating excellent organisational skills, you must be flexible in approach and be able to exercise initiative and demonstrate a consistently high standard of professionalism, being aware of the need for confidentiality and integrity. With excellent communication skills, the role involves daily and direct (eg face to face and telephone) communication with clients, relatives and other health and social care professionals. The information and nature of the communication required is sensitive due to the nature of screening for cancer and a high degree of empathy and understanding is required. For this reason you will have excellent communication skills and be willing to undertake on-going training and development.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for the service, as planning is underway for relocation of the unit.&lt;/p&gt;\n&lt;p&gt;For more information or an informal chat please contact:&lt;/p&gt;\n&lt;p&gt;Janette Richardson, Breast Screening Services Programme Manager 01925 662505&lt;/p&gt;\n&lt;p&gt;Sheryl Barnett, Breast Screening Services Office Manager 01925 275500&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Breast Screening Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252118", "validThrough": "2020-11-08T23:59:59+0000"}