{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T12:45:14+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;DIVISION: Clinical Support and Screening&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;NUTRITION &amp; DIETETICS&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;BAND 6 SENIOR DIETITIAN - GASTROENTEROLOGY &amp; SURGERY&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;37.5 HOURS PER WEEK PERMANENT (Subject to probationary period)&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;SALARY £31,365- £37,890 Band 6 (full-time rate)&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;REF: 297-2021-3037&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a highly motivated Dietitian to join our friendly and pro-active Nutrition and Dietetics Service at the Queen Elizabeth Hospital in Gateshead.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a fully integrated team comprising 14 Dietitians, 3 Dietetic Assistant Practitioners, 3 specialist Nutrition Nurses and 3 Clerical Officers. This permanent post offers an enthusiastic dietitian with an interest or previous experience in gastroenterology and surgery to develop their skills and knowledge and provide a high quality dietetic service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates’ clinical caseload will include covering our 29 bed gastroenterology ward, 30 bed surgical ward and gastroenterology specialist clinics. Planned and emergency surgeries for colorectal cancer, fundoplication’s, bowel perforation and obstruction are carried out within the Queen Elizabeth Hospital and it benefits from a number of specialist nurses including Hepatology, IBD and Upper GI cancer with whom close working is encouraged, in addition to the medical and surgical teams. Working within the MDT, you will promote the profile of dietetics and be the source of nutritional expertise. This role will be supported with help from a dietetic assistant practitioner with 4 years’ experience on the gastroenterology ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a department we will support your individual personal development with regular CPD sessions and training opportunities e.g. TPN. Service development opportunities include progression of a Prehabilitation nutritional pathway, further developing the outpatient IBS management pathway, and teaching opportunities with nursing and medical staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as supporting band 5 rotational dietitians, you will be actively involved in student training and we currently take students from Leeds Beckett University and Teesside University for their clinical placements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our department is situated in a modern and spacious open-plan office, alongside nutrition nurses, speech and language therapists and a variety of other allied health professionals; staff benefitting from a personal desk and cupboard space, access to library services, and local shops and cafes, including Subway, Costa, Amigo’s and our trust restaurant and café Quenellies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Gateshead is situated on the south bank of the river Tyne, close to Newcastle and benefits from the amenities of this vibrant city. Gateshead has many of its own attractions, such as the Sage, the Baltic Art Galleries, the Angel of the North and the Metro Centre. It is also close to Hadrian’s Wall and the beautiful Northumbrian coast and countryside.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Anyone applying for a position which involves a regulated activity will require an Enhanced Disclosure and Barring Service check and that the disclosure will, where appropriate to the role, include information against the Independent Safeguarding Authority barred lists for working with children or working with adults or both.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information or to arrange an informal visit, please contact Fiona Vause, Nutrition &amp; Dietetics Service Lead or Lisa Ferris, Acute Team Lead Dietitian, on 0191 445 2074.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121054.PNG", "name": "Gateshead Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121054"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gateshead", "postalCode": "NE9 6SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9389", "longitude": "-1.58106"}}, "title": "Senior Dietitian - Gastroenterology and Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248360", "validThrough": "2020-11-12T23:59:59+0000"}