{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30863", "minValue": "30863", "unitText": "YEAR", "value": "£18.36 per hour"}}, "datePosted": "2020-11-04T12:39:48+0000", "description": "&lt;h1&gt;I help to make a difference!&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you ever thought about working within the prison environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a challenging and rewarding role with career development?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then look no further… &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care. To ensure the continued quality of care at HMP Channings Wood, we’re looking for a Bank Staff Nurse (RGNs) to join our team.&lt;/p&gt;\n&lt;p&gt;HMP Channings Wood is a category C resettlement prison, taking adult males aged 21 and over; with an operational capacity of 720. The health centre is open Monday-Friday 07:30-18:30 and Sat &amp; Sun 08:30-17:30. Practice Plus Group manage delivery of the NHS healthcare services at HMP Channings Wood.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;So what do we offer?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We recognise training and development is key, therefore we have training centres to facilitate for your needs. You will gain insight and training in Mental Health and Substance Misuse. If you are new to offender health, we will create a suitable induction package to ensure you are equipped for this exciting role. About the Job Nursing in prison is never dull or predictable. On any given day the skills you use may be similar to those you need working in health promotion or A&amp;E, alternatively you may be supporting people to manage their mental health or substance misuse. It’s this variety that keeps things fresh and stimulating.&lt;/p&gt;\n&lt;p&gt;Every day will bring new challenges and new experiences. But at the same time, you’ll have all the support you need to deliver the best care possible. The role will be an experience like no other, requiring a diverse and mixed nursing skills and background. One minute you could be delivering a nurse led clinic and the next you are attending an emergency response. You can expect to be involved in everything from initial assessment, clinical triage, suturing, wound care and fracture clinics to the evaluation and development of patient care and standards. You’ll carry out – and potentially develop – nurse-led clinics (Primary Care, Wellman, Asthma, Diabetes, Chronic Disease, Blood Born Virus, Infection Control), reviewing patient histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About You...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Adult) with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service. If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Further Information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a Bank Role and we will be paying £18.36 per hour for the role.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please note that we reserve the right to close this role early if a sufficient number of applications are received. At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbott", "postalCode": "TQ12 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5105", "longitude": "-3.65184"}}, "title": "Bank Staff Nurse- HMP Channings Wood", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255886", "validThrough": "2020-11-18T23:59:59+0000"}