{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38253", "minValue": "38253", "unitText": "YEAR", "value": "£38,253 p.a."}}, "datePosted": "2020-11-06T14:10:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Social Worker, Adult Social Care - Adult Safeguarding Team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £38,253 p.a.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Swindon Borough Council are ranked in the top 10 most highly innovative areas in the UK and we are seeking to reflect this level of innovation in the way we deliver council services. We want Swindon to be a place that communities are proud of.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Advanced Social Worker role is an exciting opportunity and the post holder will contribute to our vision and re-shaping of our Adult Safeguarding Team. You will be supported by the Safeguarding Leadership team in promoting a culture of continuous improvement through ownership of performance and maintaining quality assurances system for the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Safeguarding team works closely with Police and Health colleagues and other Safeguarding partners and we have just completed the first steps towards a Multi-Agency Safeguarding Hub (MASH). We help adults with care and support needs to stay safe and realise their own outcomes. Our aim is to find out what is most important to the individual, to support personalised solutions that promote well-being and independence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of a multi-disciplinary team and to be part of how we are re-shaping our service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As our Advanced Social Worker you will: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have at least two years of experience in managing Adult Safeguarding Concerns and Enquiries&lt;/li&gt;\n&lt;li&gt;Have a passion and enthusiasm for Person Centred, Strength Based approaches to Safeguarding&lt;/li&gt;\n&lt;li&gt;Be able to energise and inform the registered workforce to deliver the Care Act 2014 duties, especially Chapter 14&lt;/li&gt;\n&lt;li&gt;Be committed to working in partnership with other professions&lt;/li&gt;\n&lt;li&gt;Provide leadership and a professional perspective across organisational and professional boundaries, including health and social care&lt;/li&gt;\n&lt;li&gt;Promote quality and consistency of social work practice&lt;/li&gt;\n&lt;li&gt;Work closely with the senior Leadership team to support junior staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Swindon Borough Council offer a range of staff benefits including corporate subscription to RiPFA and opportunities for professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get in return&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supervision and support from team and service manager&lt;/li&gt;\n&lt;li&gt;Wider training and support, including access to mentoring&lt;/li&gt;\n&lt;li&gt;25 days holiday&lt;/li&gt;\n&lt;li&gt;A career average revalued earnings (CARE) pension scheme&lt;/li&gt;\n&lt;li&gt;Eating Out, Shopping and Entertainment discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates must be fluent in the English language (as a requirement of Part 7 of the Immigration Act – for the effective performance of a customer-facing role).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Christiane Plaum, cplaum@swindon.gov.uk or Leona McCalla LMcCalla@swindon.gov.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:  22 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 26 November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Swindon Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN1 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5602", "longitude": "-1.77996"}}, "title": "Advanced Social Worker, Adult Social Care - Adult Safeguarding Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260059", "validThrough": "2020-11-22T23:59:59+0000"}