{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-22T13:00:44+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Leeds&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; Teaching Hospitals NHS Trust&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant in Respiratory Medicine with an interest in Pleural Disease&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;St James’s University Hospital&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date: 19 November 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ref: 298-CON-635&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic Respiratory consultant to join the Leeds Specialist Respiratory Team at St James’s Hospital to develop a dedicated pleural service in order to provide effective and responsive service for patients with pleural effusions and to develop and promote an ambulatory service for patients and GP’s. The appointee will become a key member of a dedicated and highly experienced multidisciplinary team.  The post holder will chair and coordinate the regional specialist Mesothelioma MDT. &lt;/p&gt;\n&lt;p&gt;The job is a full time post comprising of ten programmed activities, with supervision of the junior doctors and specialist nurses. There will also be an on-call commitment to cover the Respiratory medicine medical rota on a 1: 12 basis and contribute to the Acute Medicine rota 1:17.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Leeds Teaching Hospitals&lt;/strong&gt; NHS Trust makes up one of the largest &lt;strong&gt;teaching&lt;/strong&gt; &lt;strong&gt;hospitals&lt;/strong&gt; in Europe housing over 2,000 beds and providing a range of general, acute and elective services, together with a significant number of regional and supra-regional specialties.  The department of Respiratory Medicine has undergone significant modernisation over recent years and remains a centre for clinical and educational excellence. Inpatient services are provided in Gledhow Wing at St James’s Hospital. This includes three Respiratory wards, an NIV / Weaning unit, a dedicated CF ward, a procedures room, Sleep services and a Nurse-led day unit. There are cross city outpatient facilities including a dedicated chest clinic at Leeds General Infirmary. The unit has a strong commitment to both undergraduate and postgraduate teaching and research. &lt;/p&gt;\n&lt;p&gt;The appointee must hold the Membership of the Royal Colleges of Physicians of the United Kingdom, or equivalent, and have completed higher specialist training in Respiratory Medicine. Applicants must be on the Specialist Register or within six months of being admitted to the Register for trainees if currently in a training programme within the UK. In accordance with the consultant appointment regulations, all other categories of doctors must be on the Specialist Register.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates are encouraged to visit by prior appointment.Consideration will be given to applicants who wish to work full or part time and those wishing to job share.&lt;/p&gt;\n&lt;p&gt;Informal enquiries may be made to:&lt;/p&gt;\n&lt;p&gt;Dr Ian Clifton, Consultant Respiratory Physician and Respiratory Clinical Lead i.clifton@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Kirsty Rodger, Consultant Respiratory Physician and Lung Cancer Lead kirsty.rodger1@nhs.net &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;INTERVIEW DATE: Tuesday 8 December 2020 &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this, or have any queries, please contact Lynn Lindley in Medical Staffing on (0113) 2064895: E Mail Address: LynnLindley@nhs.net &lt;/p&gt;\n&lt;p&gt;Please note that only electronic applications can be accepted for this post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122872.jpg", "name": "Consultants", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Consultant in Respiratory (Pleural)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238546", "validThrough": "2020-11-19T23:59:59+0000"}