{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "Band 6 - £30,401 - £37,267 per annum"}}, "datePosted": "2020-10-26T10:47:17+0000", "description": "&lt;p&gt;Are you a Registered mental health nurse looking for a new leadership opportunity? Would you like to work in a hospital that won the National Positive Practice Awards 2018 Team of the year and are LGBTQ Gold Accredited?&lt;/p&gt;\n&lt;p&gt;Opal Ward is an integrated ward with an amazing caring and compassionate team. We support both working age and older adult service users and we have a big MDT ranging from pharmacy to HCAs. We are a 19 bedded ward based in Langley Green Hospital in Crawley. Crawley is situated closely to London and Brighton and benefits from a thriving, vibrant and diverse community. Opal Ward has an experienced team and works collaboratively with other wards and services within the hospital and the wider community.&lt;/p&gt;\n&lt;p&gt;We are looking for passionate and motivated leaders to support Opal Ward and drive forward positive change.&lt;/p&gt;\n&lt;p&gt;We believe that staff who feel valued by their employers and are truly engaged, provide a better outcome for our service leaders. We are committed to investing in our staff in order to provide you with further training and development to enhance leadership skills. To help our staff thrive in their roles we offer regular, good quality supervision, appraisals, in-depth training and development opportunities. On the wards there is regular reflective practice, bitesize training sessions and team ‘huddles’, all with the focus to develop and support our staff.&lt;/p&gt;\n&lt;p&gt;If you want to work somewhere where your ideas are heard and your development supported- please apply and/or contact us.&lt;/p&gt;\n&lt;p&gt;This post offers The Trust&#39;s Golden Hello for band 5 or 6 Nurses, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Scarlett Dewbery&lt;/p&gt;\n&lt;p&gt;Opal Ward Matron&lt;/p&gt;\n&lt;p&gt;07824529754&lt;/p&gt;\n&lt;p&gt;We welcome you to arrange a visit to Langley Green Hospital alongside your application or even give us a follow on our Twitter page: @OpalWardLGH&lt;/p&gt;\n&lt;p&gt;We will support you and invest in you- don&#39;t miss this exciting opportunity!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Langley Green Hospital, Crawley", "postalCode": "RH11 7EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": "-.188818"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242071", "validThrough": "2020-11-09T23:59:59+0000"}