{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T14:15:26+0000", "description": "&lt;p&gt;We are looking for a motivated and creative qualified nurse to work with Lincolnshire Partnership NHS Foundation Trust’s Community Home Assessment and Treatment Team (CHAT).&lt;/p&gt;\n&lt;p&gt;The team provides a 7 day service to people with Learning Disabilities within Lincolnshire who are in need of additional intensive support for a brief period of time. In line with the Transforming Care agenda there is a focus on admission prevention into hospital and ensuring that people are getting the right care in the right place at the right time. The CHAT team work with individuals who have a need for urgent support related to physical health, mental health and/or behaviours of concern.&lt;/p&gt;\n&lt;p&gt;The successful applicant must be organised, have effective time management skills and be able to deliver interventions, supervisions and manage a small team on a daily basis. The successful applicant will support the band 6 nurses but will also be expected to work autonomously. Good communication skills and the willingness to develop are also essential.&lt;/p&gt;\n&lt;p&gt;The post holder should ideally have experience of nursing people with a Learning Disability, however training could be provided to the successful applicant with the relevant qualifications. The role requires the successful candidate to travel independently throughout the county and to work flexible hours when required. These are to include weekends and evenings.&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust is well established, forward thinking organisation with a real vision for making a positive difference to people in our care, and support for its staff. The post holder will receive regular supervision both management and clinical and there are training opportunities available to support growth within the role. Not only have we maintained our “Good” rating at the recent CQC inspection, but we are deemed “outstanding” at being well-led - something we are extremely proud of.&lt;/p&gt;\n&lt;p&gt;Please contact Michelle Laker on 01522 309138 for further details&lt;br /&gt;Please refer to the job description and person specification for additional information about this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unit one, St George&#39;s Site, Long Leys Road, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Intervention Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244899", "validThrough": "2021-01-04T23:59:59+0000"}