{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-21T16:16:30+0100", "description": "&lt;p&gt;Consultant in Restorative Dentistry or Periodontology&lt;/p&gt;\n&lt;p&gt;University College London Hospitals is seeking to appoint a part-time Consultant post in Restorative Dentistry (with an interest in Periodontology) or Consultant in Periodontology (depending on qualifications) with a commitment to high quality patient care, innovative service models, delivery of performance targets, and excellence in education/training.&lt;/p&gt;\n&lt;p&gt;The post is a2 (PA)session Consultant position in the Division of Restorative Dentistry based in the Department of Periodontology and has arisen due to internal staff reorganisation. The Post holder will be expected to show drive and initiative towards patient care putting the patient first in line with the Trust core values, and to have a high level of knowledge and expertise in the field of Periodontology and Restorative Dentistry, including the provision of implant treatment. He/she should have a specific interest and experience in undertaking periodontal surgical procedures (simple and difficult) as well as managing complex challenges and multidisciplinary work. He/she should demonstrate a high quality approach to patient management and will be expected to contribute to the departments educational and research activities. The successful candidate will be expected to have experience, personal engagement and enthusiasm for teaching and training of Specialist trainees. The ability to lead and work as a team member is an essential requirement for this post. The post holder will be an integral part of the team and will be expected to participate in the management of referrals into the department.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with the Clinical Lead and Departmental Consultants to ensure that the clinical effectiveness standards and administrative tasks are undertaken to maintain quality standards. Whilst based in Periodontology the candidate, when necessary and appropriate, may be asked to assist in patient management in the Division and lead quality improvement projects across the Division.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Possible opportunity of Locum post following outcome of Advisory Appointments Committee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal inquiries about the post and visits are welcome.&lt;/p&gt;\n&lt;p&gt;Please contact Mr Kalpesh Patel, Clinical Lead in Periodontology and Consultant in Restorative Dentistry (email: kalpesh.patel15@nhs.net; Telephone no: 0203 456 2336)&lt;/p&gt;\n&lt;p&gt;Short-listed candidates are encouraged to visit the hospitals before being interviewed by the Advisory Appointments Committee. The interview date is to be confirmed.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital, London", "postalCode": "WC1E 6DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5223", "longitude": "-.134396"}}, "title": "Consultant in Restorative Dentistry or Periodontology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237252", "validThrough": "2020-11-18T23:59:59+0000"}