{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T14:01:53+0000", "description": "&lt;p&gt;The Trust is seeking to appoint a Consultant Psychiatrist to join our Coastal Community Learning Disability Team (CLDT) based in Worthing, West Sussex. West Sussex has lots to offer including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Journeys from coast to the countryside in minutes&lt;/li&gt;\n&lt;li&gt;A lifestyle where there are renowned cycle routes and picturesque walks, including the famous South Downs Way in the South Downs National Park&lt;/li&gt;\n&lt;li&gt;City life that is never far away either. Brighton and Hove and London are both within easy reach via local and national bus routes and national mainline stations&lt;/li&gt;\n&lt;li&gt;Easy access to airports - Gatwick and Heathrow are both within 90 minutes of the county, providing links to Europe and beyond!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will provide specialist psychiatric services for assessment and treatment of adults with a learning disability and provide community psychiatric care to adults with a learning disability living in West Sussex. You will ensure clients are supported adequately to enable them to function optimally in the community and where they relapse they receive prompt and appropriate treatment to retain mental health and social functioning.&lt;/p&gt;\n&lt;p&gt;It is a really exciting time to join the service as the successful applicant will be working with Dr Jane McCarthy, who has an international reputation in intellectual disability and neurodevelopmental disorders.&lt;/p&gt;\n&lt;p&gt;We value our doctors’ time and you will benefit from assigned administrative support. On appointment, you will join a Trust-wide Consultant Network and a Learning Disability specific peer group. You will also meet Consultant peers at the weekly local academic programme. Your Consultant peers are a highly supportive group who are engaged in a number of national initiatives.&lt;/p&gt;\n&lt;p&gt;You will also be part of a friendly and supportive multi-disciplinary community team that is based alongside Social Care to provide specialist services to people with a Learning Disability. Our CLDT consists of speech and language therapists, clinical psychologists and behaviour support practitioners, learning disability nurses, physiotherapists and occupational therapists.&lt;/p&gt;\n&lt;p&gt;The West Sussex Community Learning Disability Service is comprised of 3 Community Teams supported by Consultant Psychiatrists and Specialty Doctors. In East Sussex we provide 3 Community Learning Disability Teams in Brighton &amp; Hove and East Sussex. The service also has a 10 bedded in-patient service for adults with a Learning Disability in the county, which is at the Selden Centre, Worthing.&lt;/p&gt;\n&lt;p&gt;Please note this post is being advertised as full time. However, please get in touch if you are interested in the position but want to work different hours or work flexibly. Please also note that this post attracts a golden hello payment of up to £5000 as well as a relocation Package of up to £8000. Information on these can be obtained from our Medical Staffing Team on 0300 304 0393.&lt;/p&gt;\n&lt;p&gt;Not decided yet or want to discuss your individual interests in working at Sussex Partnership then please pick up the phone and talk to us! We want to hear your thoughts and ideas on how our jobs can work for you. We also encourage and welcome candidates to visit our services and meet the team so please give us a call to get this booked in.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jane McCarthy -&lt;/strong&gt; Consultant Psychiatrist &amp; Medical Lead for Learning Disability Service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mobile:&lt;/strong&gt; 07471034322 &lt;strong&gt;Email: &lt;/strong&gt;Jane.McCarthy@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Viki Baker&lt;/strong&gt; - Clinical Director, Learning Disability Services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mobile:&lt;/strong&gt; 07785 554777 &lt;strong&gt;Email: &lt;/strong&gt;viki.baker@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worthing", "postalCode": "BN13 3EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8412", "longitude": "-.411136"}}, "title": "Consultant Psychiatrist - Learning Disability Services (Coastal CLDT)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244848", "validThrough": "2020-11-17T23:59:59+0000"}