{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on previous experience within the NHS"}}, "datePosted": "2020-11-02T17:30:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced (B7) – Coagulation, Ipswich – 15 hrs per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;East Suffolk and North Essex NHS Foundation Trust (ESNEFT) is one of the largest NHS organisations in the region, employing over 10,000 staff and serving a population of almost 800,000 residents. We are an ambitious trust with a simple vision, to provide the communities we serve with excellent healthcare and build a better future for the people of east Suffolk and North Essex. To help us do this, we will work closely with our local partners to deliver more of the joined-up services and care for our residents’ needs.&lt;/p&gt;\n&lt;p&gt;We are a partnership of pathology laboratories that provide an excellent laboratory and phlebotomy service all year round to the patients of ESNEF.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post: Advanced Biomedical Scientist Coagulation – B7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Blood Sciences based at Ipswich Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 15 hrs per week (Thursday and Friday 9 – 5 pm* although some additional hours may be required for absence cover)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £37,570 - £43,772 Depending on previous experience within the NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt; We are looking for an enthusiastic and motivated individual who is professional, reliable, innovative and flexible to join our friendly and hardworking team and to assist with running of the routine Haematology &amp; Coagulation service at Ipswich Hospital (the Hub laboratory) for ESNEFT.&lt;/p&gt;\n&lt;p&gt;The role will include: supervising the Coagulation section and managing the daily organisation and staffing of the section with the current post holder: ensuring the analysers are maintained correctly and undertaking any troubleshooting that is required; dealing with engineering visits and organising the section around planned and unplanned analytical down time; monitoring internal and external quality-control performance and initiating any remedial action required; dealing with stock control and ordering of reagents and materials; the writing and updating of SOPs and staff competency logs; and ensure that the section is ISO:15189 compliant. The role also includes deputising for the Haematology Lead in their absence, so a good knowledge of both routine and specialist coagulation is required.&lt;/p&gt;\n&lt;p&gt;The role involves overseeing the raising of purchase orders and receipting invoices; networking with our referral providers; dealing with information requests and problems. The post is line managed by the Blood Sciences – Haematology Manager at Ipswich&lt;/p&gt;\n&lt;p&gt;Applicants should be HCPC registered with knowledge and experience of laboratory Haematology &amp; Coagulation commensurate with this band. Applicants should be confident and motivated and must possess a wide range of skills demonstrating good numeracy and literacy, training experience and attention to detail. Preferably, you will have previous experience of using the ACL TOP analysers or demonstrate an understanding of the technologies used within Haematology &amp; Coagulation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we need from you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrate knowledge and understanding of the role.&lt;/li&gt;\n&lt;li&gt;Good people management skills.&lt;/li&gt;\n&lt;li&gt;Willingness to undertake cross training to extend skill set to deliver role with the ability to be flexible and respond to the needs of the service.&lt;/li&gt;\n&lt;li&gt;Good communication and IT skills&lt;/li&gt;\n&lt;li&gt;Demonstrable interpersonal skills – must be able to demonstrate working as part of a team and the ability to work under pressure and meet deadlines.&lt;/li&gt;\n&lt;li&gt;High level of accuracy and attention to detail&lt;/li&gt;\n&lt;li&gt;Integrity and personal credibility putting the patient first in everything that is undertaken.&lt;/li&gt;\n&lt;li&gt;Experience / understanding of working to ISO:15189&lt;/li&gt;\n&lt;li&gt;Willingness to work to the “OAK” values of the trust.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Please note that once this advert closes, your application form will be moved to the Trusts&#39; recruitment system, TRAC, and therefore all email correspondence will be sent via the TRAC system.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information contact: &lt;strong&gt;Ben Bhattacharjee (Blood Sciences Manager Haematology - Ipswich) on 01473 703707&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Midnight 22nd November 2020 – unless there is high demand for the post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBen BhattacharjeeJob titleBlood Sciences Manager Haematology - IpswichEmail addressben.bhattacharjee@nhs.netTelephone number01473703707&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based at Ipswich Hospital, Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Advanced Biomedical Scientist Coagulation - B7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253024", "validThrough": "2020-11-22T23:59:59+0000"}