{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-28T12:00:47+0000", "description": "&lt;p&gt;A fantastic work-life balance awaits you in sunny Cornwall when you join our ever-expanding cardiac department. Cardiology services at RCHT are consistently rated 5* by patients due to our strong duty of care.&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospital, Truro, is the main provider of acute healthcare to the majority of Cornwall’s residents and many seasonal visitors. Cardiology Services offer a comprehensive range of investigations and treatments appropriate to a ‘non-surgical’ tertiary centre.&lt;/p&gt;\n&lt;p&gt;Due to rapid expansion and development in the cardiac department and the services that it offers, we are looking for new team members to be part of our dynamic, busy and friendly team.&lt;/p&gt;\n&lt;p&gt;This post is suitable for newly qualified individuals as well as Physiologists who are keen to broaden their depth of knowledge and experience; we welcome all applicants and offer the most supportive environment for both personal and professional development to allow you to further develop your career. This is evidenced in the fact that the department holds the Work Placed Educator Award for Excellence and Best Work Placed Educator Award from Plymouth University.&lt;/p&gt;\n&lt;p&gt;We are seeking a candidate that shares our values and commitment to ensuring the quality of our services. We encourage open engagement in service design and delivery, and seek an individual eager to share knowledge and ideas in an open and friendly forum.&lt;/p&gt;\n&lt;p&gt;Cornwall is idyllic. The lifestyle here is the best that the UK has to offer. After work possibilities are endless: go for a coastal walk; dine in a Michelin-starred celebrity chef&#39;s restaurant; surf at an internationally renowned hotspot; or watch the latest performance from one of the many Cornish theatrical art companies.&lt;/p&gt;\n&lt;p&gt;With such a strong sense of community both within the hospital and outside, you will question why you hadn&#39;t joined us sooner.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role is full time: 37.5 hours per week. However part-time opportunities are available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Murray - Chief Cardiac Physiologist on Tel: 01872 252433. Or email: claire.murray31@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246460", "validThrough": "2020-11-10T23:59:59+0000"}