{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-20T10:35:31+0100", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ward Sister&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen at Dawlish Community Hospital for a Band 6 Ward Sister/ Charge Nurse. We are looking for someone with excellent communication skillsto co-ordinate clinical care and provide leadership tothe nursing team. We are a 16-beddedward admitting patients from local acute hospitals and directly from their own homes for rehabilitation following orthopaedic, general surgery and medical admissions. We also take palliative patients for End of Life care.&lt;/p&gt;\n&lt;p&gt;We are looking for an caring and compassionate person who is able to manage the day-to-day challenges of Community Hospital working in the absence of the Ward manager, and management of a team of staff. We work as an MDT, liasing closely with GP&#39;s. Intermediate Care teams and Community Services.&lt;/p&gt;\n&lt;p&gt;This post will give you great job satisfaction; not only will you be working within a friendly and innovative team, you will play an integral part in enabling patient choice and facilitating discharge home.&lt;/p&gt;\n&lt;p&gt;We can offer a period of supernumary to the right candidate to support you into your role, and further learning and development are encouraged.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 9DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5806", "longitude": "-3.4748"}}, "title": "Ward Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233897", "validThrough": "2020-11-17T23:59:59+0000"}