{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-10-30T10:47:04+0000", "description": "&lt;p&gt;Are you looking for a rewarding job supporting people with acute mental health needs? Do you embrace new challenges and thrive in a team environment?&lt;/p&gt;\n&lt;p&gt;If so we have a number of fantastic opportunities for Mental Health Nurses to join our dedicated multidisciplinary team within the adult acute inpatient mental health service at Tameside General Hospital. We are seeking person centred, competent nurses who are dynamic and enthusiastic, committed to the provision of high quality care and treatment and enjoy the challenge of working within a complex care environment.&lt;/p&gt;\n&lt;p&gt;You will be enthusiastic about working with adults with acute mental health needs and be able to demonstrate a real commitment to providing high quality and compassionate care to patients and their families. Working as part of a multidisciplinary team you will have excellent communication skills and team working abilities.&lt;/p&gt;\n&lt;p&gt;Newly qualified staff will be fully supported through a comprehensive preceptorship framework, a transitional phase for newly registered practitioners, where you continue your professional development, build your confidence and further develop your competencies.&lt;/p&gt;\n&lt;p&gt;We offer a commitment to developing staff through regular supervision and appraisals, training opportunities and career development, both clinically and managerially.&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to have a flexible approach to work to be able to meet the rotational shift patterns to cover a 24 hour period and should be physically fit to undertake PMVA training.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Service/Ward/Department Summary:&lt;br /&gt;&lt;br /&gt;Tameside Adult Acute Wards Ward are based at Tameside General Hospital.&lt;br /&gt;Taylor ward provides assessment, care and treatment for individuals with a variety of acute mental health needs from a team of professionals including nursing staff, medical staff, occupational therapists, a psychologist, a dietician and a pharmacist. We provide a range of personalised therapeutic interventions which focus on individual strengths and promote recovery.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Role Summary:&lt;br /&gt;&lt;br /&gt;The post holder will be expected to undertake all aspects of the role identified in the job description and meet the requirements of the person specification. The role will be to deliver all aspects of care to the service user group on the wards and to undertake the responsibilities required of a qualified nurse.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Key Responsibilities of the Post:&lt;br /&gt;&lt;br /&gt;• To assess, plan, implement &amp; evaluate care of service users defined as requiring in-patient care. To take on the role of bleep holder to acute services. To liaise with key stakeholders to ensure seamless care delivery across acute services&lt;br /&gt;&lt;br /&gt;• The post holder is responsible for the assessment of care needs and the development, implementation and evaluation of initiatives within the acute service.&lt;br /&gt;&lt;br /&gt;• Providing evidence based interventions to clients and relatives to aid recovery from current mental illness.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to supervise junior staff and act as a mentor and assessor for all learner bands.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to liaise professionally with all outside agencies and services and to co-ordinate their activities at service level.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to assist the Ward Manager in the investigation of complaints within the acute service.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to keep updated with their own practice and maintain their fitness for purpose.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to have an understanding of the models of care delivery planned for Pennine Care services and show appropriate skills in order to deliver such models.&lt;br /&gt;&lt;br /&gt;• The post holder will engage in clinical supervision and promote this service to others within the unit.&lt;br /&gt;&lt;br /&gt;• The post holder will engage with and deliver job role supervision.&lt;br /&gt;&lt;br /&gt;• The post holder will be actively involved in the implementation of the KSF &amp; IPDR process.&lt;br /&gt;&lt;br /&gt;• The post holder is expected to show initiative and develop and implement change ideas within the acute Service.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Key Requirements of the Person Specification:&lt;br /&gt;&lt;br /&gt;Must be first level registered nurse, RMN or RN in Mental Health or be within 12 months of completing qualification.&lt;br /&gt;&lt;br /&gt;Must have a good understanding of both numeracy and language skills. &lt;br /&gt;&lt;br /&gt;Must have knowledge base and experience in terms of this client group.&lt;br /&gt;&lt;br /&gt;Be able to perform required duties of the post.&lt;br /&gt;&lt;br /&gt;Must be flexible and able to work on an internal rota basis.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBernadette ConnellyJob titleWard ManagerEmail addressbernadette.connelly@nhs.netTelephone number0161 716 3661&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taylor Ward, Ashton-Under-Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Staff Nurse - Adult Acute Inpatient Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249807", "validThrough": "2020-11-13T23:59:59+0000"}