{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum pro rata"}}, "datePosted": "2020-11-04T10:01:07+0000", "description": "&lt;p&gt;An exciting opportunity is available for band 5 nurses to join our forward thinking nursing team. We are looking for highly motivated and committed band 5 staff nurses to work on our medical and stroke rehabilitation ward.&lt;/p&gt;\n&lt;p&gt;We require enthusiastic motivated individuals who have the ability and passion to work within our friendly ward team. Ysbyty Cwm Rhondda is continuously expanding its services and we require staff nurses who have the ambition to help drive these changes and help expand the service we offer. Commitment to undertake ongoing training and development is essential. We offer ward based training so you should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our development plan. We are able to offer both full and part-time posts within our team.&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our role offers much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Ysbyty Cwm Rhondda is a Community Hospital situated close to Tonypandy. the hospital supports patients with rehabilitation needs and complex discharge planning.&lt;/p&gt;\n&lt;p&gt;We are 2 minutes from Llwynypia Train Station and we offer free car parking on site.&lt;/p&gt;\n&lt;p&gt;We would like to hear from you if you can demonstrate your passion and commitment to the provision of high quality patient centered care. You will be able to work as part of a large multi disciplinary team, demonstrating excellent communication skills and an ability to work effectively with the ward team in a very busy and fast paced environment to deliver excellent standards of patient care.&lt;/p&gt;\n&lt;p&gt;If you are motivated to deliver high standards of care and have the personal qualities and characteristics we are looking for then this could be the post for you.&lt;/p&gt;\n&lt;p&gt;We encourage informal visits to allow applicants to familiarise themselves with our services and to answer any questions they may have.&lt;br /&gt;&lt;br /&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Leanne Davies&lt;/p&gt;\n&lt;p&gt;Tel: 01443 430022 ext 2691&lt;/p&gt;\n&lt;p&gt;Email: leanne.davies7@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Cwm Rhondda Hospital, Tonypandy", "postalCode": "CF40 2LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6372", "longitude": "-3.44731"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255276", "validThrough": "2020-11-18T23:59:59+0000"}