{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37940", "minValue": "32707", "unitText": "YEAR", "value": "Band 6 £32,707-£37,940 pro rata"}}, "datePosted": "2020-11-05T18:43:40+0000", "description": "&lt;p&gt;&lt;strong&gt;St Ann&#39;s Hospice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At St Ann’s, there’s one thing that motivates us, and that’s providing excellent care and support to those living with or affected by life-limiting illnesses.&lt;/p&gt;\n&lt;p&gt;We’re continuously developing our plans for delivering world-class, innovative care and to ensure St Ann’s is in the best shape possible for future generations.&lt;/p&gt;\n&lt;p&gt;You’ll be challenged, inspired and empowered to help us achieve our purpose and to play your part in making a difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you got what it takes?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you an experienced Physiotherapist with interest or skills in Palliative Care?&lt;/li&gt;\n&lt;li&gt;Can you demonstrate the ability to work as an effective team member, managing competing priorities?&lt;/li&gt;\n&lt;li&gt;You must be passionate about our patients and a collaborative colleague&lt;/li&gt;\n&lt;li&gt;Most importantly, you must be wholeheartedly committed to and motivated by the purpose and values of St Ann’s Hospice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a part time permanent position. With a working pattern of 18 hours per week,2/3 days to include Thursdays and Fridays. This posistion is based at our Heald Green site with some across site working at our Heald Green site when required.&lt;/p&gt;\n&lt;p&gt;The pay scale is set at St Ann&#39;s pay scale of Band 6 £32,707-£37,940 pro rata.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join an ambitious, much loved charity and help us achieve our goals. If you’re looking for a new challenge and the opportunity to make a difference, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;An Enhanced DBS check will be requried, the cost of which is covered by the hospice. St Ann’s Hospice is committed to safeguarding and promoting the welfare of adults at risk and children.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St Ann's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130015"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Little Hulton", "postalCode": "M28 0FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5278", "longitude": "-2.42282"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258781", "validThrough": "2020-11-25T23:59:59+0000"}