{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "dependent upon qualification in module of advanced"}}, "datePosted": "2020-10-15T10:31:07+0100", "description": "&lt;p&gt;Are you an Advanced Practitioner with modules in Breast Imaging? Or are you a qualified Breast Radiographer keen on advancing your career by undertaking advanced practice?&lt;/p&gt;\n&lt;p&gt;We are in the unique position to offer a fantastic opportunity to expand your practice and train in a module of advanced practice, or to consolidate your current advanced practice in a very busy and expanding Breast Imaging department.&lt;/p&gt;\n&lt;p&gt;We are a large University Hospital located in Staffordshire with close links with Keele University and the newly approved Radiography under graduate course, where there can be opportunities to contribute to the clinical teaching modules. The University Hospitals of North Midlands NHS Trust (UHNM) is one of the largest and most modern in the country. We serve around three million people and we’re highly regarded for our facilities, teaching and research. Our mission to provide the very best health care includes recruiting the best people. Our goal is to be a world-class centre of achievement, where patients receive the highest standards of care and the best people come to learn, work and research.&lt;/p&gt;\n&lt;p&gt;The large screening population of approximately 102,000 women and the large population served for Symptomatic services attracts investment from the Trust the and the Commissioners, enabling the service to participate in many oncology trials and research. This provides team members with a stimulating and varied work experience and a range of CPD opportunities.&lt;/p&gt;\n&lt;p&gt;The location of the UHNM has great access to local amenities and transport links, being close to the M6 and A50, and lies centrally between Manchester to the North and Birmingham to the South. Manchester, Birmingham and Liverpool are all reachable within an hour, as well as the Peak District and the Roaches. The city benefits from being surrounded by some of the most beautiful and diverse countryside the country has to offer. House prices in the area are competitive.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, pro-active Radiographers to join our friendly patient-centred team to provide Breast Screening and Symptomatic services to the population of Mid/North Staffordshire. You should be adaptable, have excellent work ethics, be able to demonstrate initiative, and possess good communication skills; the ability to work flexibly and as part of a multi-disciplinary team is essential.&lt;/p&gt;\n&lt;p&gt;Breast Imaging has excellent career prospects particularly here within the UHNM family where advanced practice and career progression is actively encouraged and supported both by the Breast Service and the Imaging Directorate. We currently employ 8 members of staff with advanced practice within the Breast Imaging team, this includes 2 clinical specialists and 1 Consultant Radiographer, many of whom have carried out their advanced training while employed within this service.&lt;/p&gt;\n&lt;p&gt;Our service has expanded to include tomography with biopsy, first line VAB, Magseed localisation and contrast enhanced mammography. The new techniques bring with them a multitude of opportunities for further advancement and research.&lt;/p&gt;\n&lt;p&gt;Support would be provided to work on accreditation with the Society of Radiographers. For exceptional candidates further training in additional areas would be considered.&lt;/p&gt;\n&lt;p&gt;We currently provide services at UHNM sites e.g. Royal Stoke/County Hospitals, including screening at Hanley Breast Screening and mobile sites throughout North Staffordshire. It is expected that successful applicants will be able to travel to all of the sites.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Deonne Lee, Professional Head of Imaging on 01782 675855 or Michelle Ellitts, Superintendent Radiographer on 01782 674121 or 01785 886012&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Ellitts&lt;/p&gt;\n&lt;p&gt;Job title: Superintendent Radiographer&lt;/p&gt;\n&lt;p&gt;Email address: michelle.ellitts@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01782 674121&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Deonne Lee&lt;/p&gt;\n&lt;p&gt;Professional Head of Imaging&lt;/p&gt;\n&lt;p&gt;01782 675855&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals North Midlands (County and Royal Stoke sites), Staffordshire", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Breast Care Advanced Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227719", "validThrough": "2020-11-11T23:59:59+0000"}