{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-27T09:31:07+0000", "description": "&lt;p&gt;The Critical Care Unit at The Royal Hampshire County Hospital is looking to recruit for the future. We would like to hear from motivated and enthusiastic nurses with excellent interpersonal skills and a passion for critical care.&lt;/p&gt;\n&lt;p&gt;The unit at RHCH is a 10 bedded facility, we recently received a rating for ‘outstanding’ for the care we provide from the CQC with an overall rating of good for our services. We are a team of approximately 40 nurses and pride ourselves on our friendly and supportive reputation. Patients vary and we admit both medical and surgical admissions from the Emergency Department and the wards. We have an outreach service and this team works alongside the critical care team to ensure best care for our patients. We also run an established Advanced Critical Care Practitioner program. Our Clinical Education team have been bestowed the title of &quot;High Performing Education and Training Team of the Year - Wessex SHINE award&quot; by Health Education England for 2016.&lt;/p&gt;\n&lt;p&gt;All staff nurses new to RHCH are provided with a robust training plan in order to support their transition to critical care. We have 4 teams of nurses and within those teams each new nurse is allocated a mentor as well as a team leader. A minimum of 5 weeks supernumerary is given initially to allow the minimum competencies and capabilities that are required to work independently to be achieved. Each nurse is then placed on our in-house critical care foundation program (CCFP) where a systems based approach to learning is followed. The Critical Care National Framework step 1 competencies are used to support clinical learning also during this phase and upon completion of these, each year, there is an opportunity to apply for the Critical Care course at Bournemouth University.&lt;/p&gt;\n&lt;p&gt;As your career develops there are many other opportunities for learning and development within critical care at RHCH; weekly SIM sessions, regular M&amp;M meetings, 1:1 working with the clinical education team and the bespoke ‘experienced nurse program’ all contribute to help hone further clinical and leadership skills.&lt;/p&gt;\n&lt;p&gt;If you would like to know more about the unit or the services and support we offer please contact us. We encourage and welcome informal visits.&lt;br /&gt;We offer flexible working patterns, and encourage both full and part time interested parties..&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie Doney (Clinical Matron) Natalie.Doney@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01962 825030&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hampshire County Hospital, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Critical Care/Intensive Care Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243828", "validThrough": "2020-11-10T23:59:59+0000"}