{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "Band 5 £24,907 to £30,615 per annum, pro rata"}}, "datePosted": "2020-10-29T16:45:23+0000", "description": "&lt;p&gt;Hi! Do you like working with inspiring children in a fun, dynamic and friendly environment? Then we have the job for you!&lt;/p&gt;\n&lt;p&gt;We would love to let you know about an opportunity that has just become available for a Registered Nurse to come and work for our forward thinking and innovative team. As Special Needs Nurses we are based across 2 sites in Cheshire. These are Hebden Green Community School in Winsford, and Springfield School in Crewe. Both schools are outstanding educational settings, and all of the staff work very closely with all of the health professionals within the school to ensure we can provide the best possible learning environment for the children. For the role, you will be working closely with the wonderful children that attend the settings, completing a wide variety of tasks, alongside our vastly experienced team members. Both schools are busy environments and regularly provide opportunities to challenge you as a professional.&lt;/p&gt;\n&lt;p&gt;There is a great support network throughout the whole team. We are keen to help all of our nurses and healthcare assistants to develop both personally and professionally and so we will make sure there is support from experienced colleagues and the special schools co-ordinator.&lt;/p&gt;\n&lt;p&gt;If this sounds like the role for you, please feel free to give us a call or send an email to discuss any queries or questions that you may have. If you love working with children and helping to shape their development then this role is perfect for you!&lt;/p&gt;\n&lt;p&gt;shift patterns : are 4 days per week, variable shift patterns between early (07:45-15:45), day (08:30-16:30), late (10:00-18:00)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winsford", "postalCode": "CW7 1AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1909", "longitude": "-2.53126"}}, "title": "Special Needs Nurse, Hebden Green School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249123", "validThrough": "2020-11-18T23:59:59+0000"}