{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 Per Hour"}}, "datePosted": "2020-10-26T11:25:23+0000", "description": "&lt;p&gt;Job Title: Receptionist&lt;/p&gt;\n&lt;p&gt;Trust: East Kent Hospitals Uni NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Location: Kent and Canterbury, Ethelbert Rd, Canterbury CT1 3NG&lt;/p&gt;\n&lt;p&gt;Shift pattern: 12 hour shifts Shift Pattern Mon – Sun Rota’d 8am – 8pm&lt;/p&gt;\n&lt;p&gt;Duration: 4 months subject to review  &lt;/p&gt;\n&lt;p&gt;Pay Rate per hour: £9.21 Per Hour&lt;/p&gt;\n&lt;p&gt;The Role:&lt;/p&gt;\n&lt;p&gt;East Kent Hospitals Uni NHS Foundation Trust is rated as an Outstanding organisation for Caring with an overall rating of Good. They believe in brilliant care through brilliant people.&lt;/p&gt;\n&lt;p&gt;They work together to help people affected by mental ill health and learning disabilities.&lt;/p&gt;\n&lt;p&gt;There workforce includes more than 3,200 staff from a range of professions including nursing, occupational therapy, and psychiatry plus they provide a number of specialist services.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, East Kent Hospitals Uni NHS Foundation Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a Receptionist available at Kent &amp; Canterbury Hospital for our East Kent Trusts&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide reception cover for the Urgent Treatment Centre split across Kent and Canterbury Hospital and Buckland Hospital.&lt;/li&gt;\n&lt;li&gt;Booking in patients for the Urgent Treatment Centre, Urology and Vascular and Stroke.&lt;/li&gt;\n&lt;li&gt;Will need to have a good customer service skill to welcome and book in patients.  You will also be required to stream the patients to the correct area, ensure the correct discharge is logged.&lt;/li&gt;\n&lt;li&gt;Full training on our systems will be provided.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242196", "validThrough": "2020-11-13T23:59:59+0000"}