{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T12:01:00+0000", "description": "&lt;p&gt;An exciting opportunity has arisen at Sherwood Forest Hospitals NHS Foundation Trust for the post of Band 5 Theatre ODP/RN (Dual-rolled) within our main and day-case theatres. The trust currently has 16 operating theatres across 2 sites including Obstetric, emergency, urology, Breast, gynaecology, ENT, max-fax, general, trauma and orthopaedic, ophthalmology, pain, paediatric and dermatology services.&lt;/p&gt;\n&lt;p&gt;The Trust is looking for exceptional individuals who are proactive and motivated to deliver high-quality, safe and compassionate patient care, someone who can demonstrate excellent communication and organisational skills and work well within a cohesive multidisciplinary team. You will be committed to clinical excellence and have a flexible approach to working hours and be prepared to further develop your skills whilst working closely with the clinical education team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a minimum of 1 year clinical theatre experience, although we encourage exceptionally talented, newly qualified staff may apply. The successful candidates will be enthusiastic about developing like-minded staff to provide the highest quality of care for our patients whilst working within the trusts CARE values.&lt;/p&gt;\n&lt;p&gt;You will be organised and able to prioritise a busy workload in order to meet the needs of the department and will be supportive to the Band 4, 3 and 2 staff in all areas. On occasion you may be expected to work at Newark hospital which is also part of SFH trust.&lt;/p&gt;\n&lt;p&gt;You will also demonstrate an aptitude to develop your knowledge, ideas and work practice to improve quality and maintain our high standards of theatre practice. Working closely with the clinical education team, you will actively monitor your own training needs.&lt;/p&gt;\n&lt;p&gt;We are proud of our ethos of welcoming new practitioners and providing a friendly, team orientated environment. We provide an in depth induction and support personal and professional development.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have a proven track record or, if newly qualified, will be outstanding in their delivery of safe and effective care to patients in the peri-operative setting. You will possess excellent multidisciplinary communication skills, and will be flexible in your approach to their role. You will be expected to take part in the on-call rota.&lt;/p&gt;\n&lt;p&gt;We are welcoming prospective applicants who are seeking to contribute to SFH theatre&#39;s progressive journey to outstanding and whose career development is an important motivating factor....&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For an informal discussion or visit please contact:&lt;/p&gt;\n&lt;p&gt;Jason Goddard - Department Leader #4537&lt;/p&gt;\n&lt;p&gt;Delrose Morrison - Department Leader #4537&lt;/p&gt;\n&lt;p&gt;Tracey Jacks - Department Leader #4537&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Registered Nurse/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250076", "validThrough": "2020-11-15T23:59:59+0000"}