{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-09-29T13:45:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Geriatrics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Frimley Health is a leading innovative NHS foundation Trust which came into being on October 1st, 2014. It provides hospital services for 900,000 people across Berkshire, Hampshire, Surrey and South Buckinghamshire. Services are delivered from three main hospital sites including Frimley Park near Camberley, where these posts will be based, Heatherwood at Ascot, and Wexham Park at Slough. Diagnostic and outpatient services are also run from Aldershot, Farnham, Fleet, Bracknell, Gerrards Cross, Maidenhead and Windsor.&lt;/p&gt;\n&lt;p&gt;The vision for this new post is to creatively expand our Medicine for Older People service and design posts with and around an individual who may wish to develop services in orthogeriatrics, stroke, community geriatrics, acute frailty or other aspects of geriatric medicine. There is scope for part-time and flexible working and the department may wish to carry out team Job Planning and/or annualisation, depending on the team membership.&lt;/p&gt;\n&lt;p&gt;We currently have 86 inpatient beds looked after by the department. We expect daily consultant presence on the acute wards with daily MDT board rounds and review of new admissions and unwell patients, twice weekly ward rounds and a weekly MDT. We support a 7 day acute frailty service.&lt;/p&gt;\n&lt;p&gt;There is flexibility in the Job Plans for the design of an optimal service. 1.5 SPAs will be offered in a 10 PA job and this is flexible and negotiable between members of the team with the ultimate approval of the Medical Director.&lt;/p&gt;\n&lt;p&gt;There is currently a 1:18 acute medical on-call rota for day or night takes. There is also a second on call 1:9 for medicine covering medical admissions unit and Elderly care zone on the weekends as part of 7 day working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Lucy AbbottJob titleConsultantTelephone number01276 604604Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Lucy Abbott&lt;/p&gt;\n&lt;p&gt;01276 604604&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park Hospital, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Consultant in Geriatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916204673", "validThrough": "2020-11-14T23:59:59+0000"}