{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per Annum"}}, "datePosted": "2020-11-05T15:46:07+0000", "description": "&lt;p&gt;So many people want to join us to work as a Porter – the things is, we don’t want just anyone, we want the very best.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for anyone who wishes to progress and to gain knowledge and skills as a line manager within a busy patient focussed environment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our Portering Department provides an essential support service to the clinical wards and departments. Transferring patients throughout the site, transportation of laundry, internal mail deliveries, internal waste collection (clinical and domestic) and disposal. Collection and delivery of bloods and specimens, internal pharmacy deliveries. Your duties will be to oversee our Portering services and duties.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will also plan staff rotas, supervise the Portering workforce including delegation of work and prioritise Workload using an electronic Portering Trac system. Responding to routine, ad hoc and emergency requests. You will also carry out staff appraisals and will train staff including new starters.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You should have substantial experience within a Portering department/environment essential. It would be desirable if you have previous supervisory experience and experience of working with the general public is essential. It is essential that you have good communication and inter personal skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We need people with fabulous customer services skills who are passionate in working to their very best to deliver services right across our hospitals and you should be aware of the Health and Safety regulations. You should have the ability to work as part of a team in a very busy environment. The shift pattern for this post is rotational over 4 weeks and does include weekends and some Bank Holidays. Hours of work 5 over 7&lt;/p&gt;\n&lt;p&gt;Interview Date: 2nd December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJonathan MorrisJob titlePortering Services Manager RPHEmail addressjonathan.morris@lthtr.nhs.ukTelephone number01772 522497&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Portering Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258407", "validThrough": "2020-11-15T23:59:59+0000"}