{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-26T08:34:16+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Are you passionate about patient care? &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;An exciting opportunity has arisen to join a committed and high performing team which has a track record of delivering service improvements for patients&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated Case Manager to join the High Intensity User Team working across County Hospital and Royal Stoke. The team supports the development of care planning and co-ordination of care for patients with high numbers of bed days and admissions. The team has shown significant success supporting patients and has been commissioned to deliver the service with an increased number of patients this year.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will have come from an elderly care, acute, community or primary care background and will be able to demonstrate a track record of working with patients with a history of complex health and social care problems. They must have a passion for patient care and be able to communicate with a wide range of professionals. The ability to work independently is essential although you will be working as part of a small team. Although based in one central location, the post holder must also hold have the ability to work in various locations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Day to day the successful candidate will be consenting and recruiting patients in the community and as inpatients. Implementing care plans normally via MDT’s, working co-productively with patients and families in conjunction and with collaboration from other professionals as needed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford / Stoke", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "High Intensity Team Case Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241764", "validThrough": "2020-11-09T23:59:59+0000"}