{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-11-05T11:31:15+0000", "description": "&lt;p&gt;‘We have a vacancy for a Band 6 Specialist Speech and Language Therapist for a fixed term post to cover a maternity leave for 12 months. Barnet is also developing and expanding their service and there may be an opportunity to extend this role to a permanent position at the end of the fixed term contract.&lt;/p&gt;\n&lt;p&gt;You will be part of the Barnet Children&#39;s Integrated Therapists (CIT) who work across a range of Pathways including Speech, Voice, Dysfluency, Social Communication and Language.’&lt;/p&gt;\n&lt;p&gt;This post would be ideal for a Band 6 Speech and Language Therapist, who is looking to further progress their career within one of the above Pathways.&lt;/p&gt;\n&lt;p&gt;We encourage CPD including attendance at SIGs/CENs, regular in-house training and team meetings. We have a strong Supervision framework including regular Clinical and Managerial Supervision alongside Group and Peer Supervision.&lt;/p&gt;\n&lt;p&gt;The key components of the post will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To manage a caseload of pre-school and school-aged children with a range of communication needs across settings including and not exhaustive of clinic, Children’s Centres and home as required.&lt;/li&gt;\n&lt;li&gt;Complete assessments, attend annual reviews, write individual programmes, implement groups, provide advice and resources and review outcomes with a functional based focus.&lt;/li&gt;\n&lt;li&gt;To work collaboratively with children, families and other professionals to achieve outcomes for individuals, providing support, programmes, ideas, advice and assessment.&lt;/li&gt;\n&lt;li&gt;To provide advice to others regarding the management and care of children with communication difficulties.&lt;/li&gt;\n&lt;li&gt;To demonstrate clinical effectiveness by use of evidence based practice and outcome measures.&lt;/li&gt;\n&lt;li&gt;To provide a service considering the needs of clients from a range of ethnic and linguistic backgrounds.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hadassah - Integrated Clinical Lead&lt;/p&gt;\n&lt;p&gt;3rd Floor Westgate House, Edgware Community Hospital, Edgware, HA8 0AD&lt;/p&gt;\n&lt;p&gt;Tel: 0300 300 1821 / 0300 555 1200 x53669 / 07813 969367&lt;/p&gt;\n&lt;p&gt;Hadassah.lev@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgware Community Hospital, London Borough of Barnet", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257460", "validThrough": "2020-11-19T23:59:59+0000"}