{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T12:30:41+0000", "description": "&lt;p&gt;A new and exciting opportunity has arisen within the Dietetic team at Velindre Cancer Centre for a Specialist Oncology Dietitian. &lt;strong&gt;This is a newly funded post.&lt;/strong&gt; The successful candidate will be responsible for providing a clinical and supportive dietetic service to Oncology patients.&lt;/p&gt;\n&lt;p&gt;Working within the Dietetic Team, supported by the Clinical Lead Dietitian and Therapies Management team, you will work with nursing and other AHP colleagues in well developed multi-disciplinary teams.&lt;/p&gt;\n&lt;p&gt;The role will include seeing patients who require complex dietetic input to optimize their nutritional status through oral, enteral and parenteral feeding, as well as managing their treatment side effects.&lt;/p&gt;\n&lt;p&gt;The post holder will be a qualified dietitian, registered with the HCPC, with relevant CPD, postgraduate development and clinical experience. Strong clinical skills in nutrition support and an ability to demonstrate a good understanding of the challenges experienced by patients undergoing treatments for cancer is important. It is desirable to have experience of working within oncology. We are also looking for a good team player and an ability to manage a busy caseload, delivering on both clinical and non-clinical responsibilities. A high standard of personal organisation and time management are essential. You will be able to demonstrate advanced communication skills and have experience of MDT working. Skills to supervise and support junior staff and student dietitians are required.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rhiannon Williams - Clinical Lead Dietitian&lt;/p&gt;\n&lt;p&gt;rhiannon.williams7@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;029 20615888&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Kate Baker, Macmillan Deputy Head of Therapies. ext 6490 or email&lt;/p&gt;\n&lt;p&gt;kate.baker@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123256.jpg", "name": "Velindre Cancer Centre", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123256"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CF14 2TL, Cardiff", "postalCode": "CF14 2TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5164", "longitude": "-3.22902"}}, "title": "Specialist Oncology Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257666", "validThrough": "2020-11-19T23:59:59+0000"}