{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-13T15:09:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant in Acute Medicine with a Sub-Specialty Interest&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Three posts – whole or part-time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The NHS is changing.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Within South Yorkshire and Bassetlaw, The Rotherham Foundation Trust is providing local, regional and national direction in different ways of working to address some of the greatest issues facing the sustainability of our health and social care system.&lt;/p&gt;\n&lt;p&gt;We are interested in recruiting three new Locum Consultant Physicians in Acute Medicine who wish to work differently, who share a passion for change, growth and quality improvement and who are keen to join us in our pursuit of clinical excellence combined with innovative approaches to person-centred care.&lt;/p&gt;\n&lt;p&gt;Rotherham Hospital is working towards becoming a person-centred organisation – addressing the needs and aspirations of all patients and staff, integrating care within the community, realising new and different ways of working to address current challenges.&lt;/p&gt;\n&lt;p&gt;We invite applications from Consultants seeking to work collaboratively within South Yorkshire and Bassetlaw, finding new economies of scale and efficiency, utilising the strengths of our diverse staff.&lt;/p&gt;\n&lt;p&gt;We are exploring agile, new ways of working, bringing together the best of technology, research, telemedicine, workforce development and holistic care – ensuring you are supported to provide great care with a focus on maintaining a healthy work-life balance.&lt;/p&gt;\n&lt;p&gt;If you wish to join a developing team of acute physicians spearheading the move to a positive, sustainable, exciting new future in South Yorkshire, please let us know.&lt;/p&gt;\n&lt;p&gt;We are happy to accommodate different sub-specialty interests and will provide you with all the support and facilities required to champion ways of working that are more difficult to achieve in larger organisations.&lt;/p&gt;\n&lt;p&gt;Want to make a difference?&lt;/p&gt;\n&lt;p&gt;Come to Rotherham.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact:&lt;/p&gt;\n&lt;p&gt;Dr Kishor Athavale; Consultant Physician and Director of Clinical Services for Integrated Medicine on 01709 424163 (Secretary) orEmail: Nandkishor.athavale@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Locum Consultant in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224821", "validThrough": "2020-11-13T23:59:59+0000"}