{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-04T12:31:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Special School Nurse.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We would welcome applications from enthusiastic committed children’s nurses or learning disability nurses with proven clinical experience to work in the special schools that form The Vale Federation in Aylesbury, Buckinghamshire.&lt;/p&gt;\n&lt;p&gt;We would therefore welcome applications from nurses who have excellent communication skills and are able to manage their time effectively. An understanding of the needs of children and young people with Special Educational Needs &amp; Disability (SEND) and additional health problems is essential.&lt;/p&gt;\n&lt;p&gt;The children are aged from nursery age through to 19 years and have a wide range of learning disabilities and some have complex health needs. The successful candidate will be based within The Vale Federation Special Schools in Aylesbury, Buckinghamshire and must be able to travel across sites during the working day.&lt;/p&gt;\n&lt;p&gt;This is a permanent special school nurse contract. The post is available from September 2020, the hours are up to 37.5 &lt;strong&gt;hours per week term time only&lt;/strong&gt;, (part time hours may be considered) You would be working as a member of a wider dedicated and enthusiastic team of special school nurses working across the county of Buckinghamshire.&lt;/p&gt;\n&lt;p&gt;The special school nurse will be responsible for ensuring that all children with complex health needs have detailed health care plans and that these are reviewed and evaluated on a yearly basis.&lt;/p&gt;\n&lt;p&gt;There is a Multidisciplinary team at the school and a real ethos of working together for the benefit of the children, in order to help them reach their potential. The role will very much involve teaching and supporting the school staff in meeting and maintaining the health needs of the children for example by providing training in &lt;strong&gt;management of medication&lt;/strong&gt;, &lt;strong&gt;epilepsy management,&lt;/strong&gt; and &lt;strong&gt;gastrostomy feeding etc.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Full training and support will be given.&lt;/p&gt;\n&lt;p&gt;An Enhanced DBS will be required for this post.&lt;/p&gt;\n&lt;p&gt;The aim of the Trust is to provide a high quality standard of healthcare to the population we serve. We value our staff and can offer excellent opportunities for further training and development, flexible working, a final salary pension scheme and childcare facilities. We are an equal opportunities employer and are constantly striving to improve the working lives of our staff through consultation and awareness sessions. &lt;br /&gt;&lt;br /&gt;* Only those candidates invited for interview will receive further communication. If you have not heard from us within four weeks of the closing date, please assume that on this occasion your application has not been successful * &lt;br /&gt;&lt;br /&gt;*This position may be closed early if adequate applicants are received* &lt;br /&gt;&lt;br /&gt;*The post will close on the closing date stated at midnight*&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ann Poll, Team Lead&lt;/p&gt;\n&lt;p&gt;Email address : ann.poll@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 07827 982198&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vale Federation of schools, Aylesbury", "postalCode": "HP21 9ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7941", "longitude": "-.808342"}}, "title": "Special School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255868", "validThrough": "2020-11-18T23:59:59+0000"}