{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 incl. Fringe HCAS"}}, "datePosted": "2020-10-15T15:03:36+0100", "description": "&lt;p&gt;&lt;strong&gt;1 post - East Surrey (Gatton Place, Redhill) and North West (Abraham Cowley Unit, Chertsey)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting new opportunity has arisen to develop psychological provision to our Home Treatment Teams across Surrey. The post holder would be working with friendly and supportive multi-disciplinary teams who truly value the skills and expertise of our Clinical/Counselling Psychologists and Psychological Therapists. We provide high quality, recovery-focused, services to adults who experience severe and enduring mental health difficulties. In particular, people with personality disorder, complex trauma and psychosis.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join SABP and an ideal position in which to grow your career as a practitioner Psychologist. We are at the forefront of developing services and are working closely with NHS England to develop and test out new models of care. Developing psychological services within 24/7 care and developing Trauma Informed services are viewed to be an important component of clinical care going forward. We have received additional funding to transform our community and our crisis services and you will be joining us at an interesting and exciting time in NHS Mental Health Services. We are going to be receiving additional funding to support training in psychological treatments and it will be possible to engage in additional training to improve access to a range of specialist therapy approaches for Severe and Enduring Mental Health difficulties. We are also developing a strategy for trauma informed care and have received funding for rolling out this approach across services. The post holder will work closely with the Psychology lead for Trauma Informed Care and Acute Services as well other psychologists in both the community teams and inpatient teams to develop pathways. We are innovative in developing new initiatives and the work is rewarding. We would hope that you will be keen to join us in the transformation of services to increase access to psychological therapies.&lt;/p&gt;\n&lt;p&gt;A large part of the work will involve working clinically with clients in crisis, identifying psychological intervention needs within the teams, developing a training programme and supporting the ongoing supervision of this. Your clinical work will involve providing assessments, formulations and brief psychological interventions to clients in crisis and at risk of admission, along with their carers, and consultation to the team. You will also hold a small caseload in one of the local Community Mental Health Recovery Service offering evidence based psychological therapy. Experience in group therapy work and project work would be essential. The post requires good teamwork skills and enthusiasm for working with a complex yet rewarding client group.&lt;/p&gt;\n&lt;p&gt;You will be supervised by an experienced Senior Psychologist. There will also be opportunities for you to meet regularly with other Psychologists in Working Age Adults services within the Locality, as well as across the Trust for supervision groups, CPD events and service development/transformation projects.&lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licence due to the community element of the role and the large geographical area that these Teams cover.&lt;/p&gt;\n&lt;p&gt;We would welcome and encourage expressions of interest, or an informal visit. To know more, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Anna Redding, Consultant Clinical Psychologist, 07717 801 054&lt;/p&gt;\n&lt;p&gt;Dr Maria Geoghan, Consultant Counselling Psychologist, 01306 732 000&lt;/p&gt;\n&lt;p&gt;Dr Lucy Leonard , Consultant Counselling Psychologist, 07810506849&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill and Cherstey", "postalCode": "KT16 0AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3793", "longitude": "-.528933"}}, "title": "Snr Clinical/Counselling Psychologist / Snr Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228724", "validThrough": "2020-11-17T23:59:59+0000"}