{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-06T13:45:10+0000", "description": "&lt;p&gt;This is a 10 PA locum appointment for a Consultant Physician in General Medicine/Diabetes/Endocrinology. This post will be available for a period of 6 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will deliver 10 PAs supporting the team with a pre-dominant focus on General Medicine cover. The post-holder will form part of a rota whereby they will be working on the ward for 2 weeks, and then off the wards for 2 weeks.  During the weeks on ward the post holder will spend an estimated 8.5 PAs a week on the ward in addition to 1.5 SPAs.However, some flexibility will be considered for the right candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;During the “off” ward period the post holder will concentrate on Endocrinology or Diabetes outpatient services without clinical responsibility for general medical wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will be based at St James’s Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant should hold accreditation in Diabetes, Endocrinology in the Royal College of Physicians or equivalent, and should be on the Specialist Register or within six months of being admitted to the Register for trainees if currently in a training programme within the UK, or have references which have been authorised by the Deputy Medical Director and Clinical Director.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should have established skills in Diabetes and Endocrinology.  Excellent communication and team working skills, a strong commitment to teaching and service development are essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Consideration will be given to applicants who wish to work full or part time and those wishing to job share. Prospective applicants are encouraged to visit the hospital, which can be arranged by contacting:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Emma Ward, Lead Clinician Diabetes and Endocrinology 0113 2065014&lt;/p&gt;\n&lt;p&gt;or emma.ward17@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Sarah Davey, Interim Clinical Director for Emergency and Specialty Medicine Clinical&lt;/p&gt;\n&lt;p&gt;Service Unit. 07730599070  or  sarah.davey3@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ms Lucy Pittaway, General Manager for Emergency and Specialty Medicine, Clinical Service Unit, 0113 2066692 or lucy.pittaway@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122056.jpg", "name": "Emergency & Specialty Medicine", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122056"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Locum Consultant in Diabetes and Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259958", "validThrough": "2020-11-20T23:59:59+0000"}