{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37500", "minValue": "35000", "unitText": "YEAR", "value": "£35000 to £37500 pro rata."}}, "datePosted": "2020-10-23T17:48:18+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Summary&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a pharmacist to join our team, to work in the pharmacy department of HMP Isle of Wight. This is a 12 month fixed-term contract. The Prison Pharmacy provides a range of pharmaceutical services to the prisoners, including dispensing and provision of advice. We are a forward-thinking service, utilising technology to automate dispensing and supply of medicines to patients. This position offers the opportunity for career development, for example undertaking the independent prescribing or practice pharmacist qualification. No weekend or bank holiday work is required. HMP IOW Healthcare Services consist of: a Pharmacy Service; a Mental Health Service and two Primary Healthcare Centres providing care in acute and chronic illness. There is also an Inpatient Healthcare Unit providing care to prisoners with mental health, physical health or substance use need. If you are looking for a challenging work environment and the opportunity to join our award winning services as they further develop, then do please get in touch. Salary will be based on qualification and experience, in the range of £35000 to £37500 pro rata.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Responsible To&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lead Pharmacist&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll be responsible for the provision and delivery of an integrated, safe, legal, high quality prison pharmaceutical service. Working closely with the Head of Healthcare and the multidisciplinary team, you&#39;ll be responsible for ensuring that the provision of service meets the contractual obligations. The role also involves responsibility for providing daily expert advice on pharmaceutical matters and ensuring that a safe but modern medicines management service is provided to prisoners. You will be responsible for leading a team of Pharmacy technicians and be required to deliver some wing based clinics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to have a clinical diploma or be working towards a clinical diploma.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have a real passion for developing your own Pharmaceutical skills and those of your team. You’ll have a flexible approach working within a team that encourages new ideas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Qualifications&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a qualified Registered Pharmacist - BSc or Master’s Degree in Pharmacy, holding registration with the General Pharmaceutical Council (GPhC).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional Information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For informal discussions and visits, please contact: Janna Whelan – lead pharmacist, on (01983) 635742, or janna.whelan@practiceplusgroup.com For general enquiries about working for Practice Plus Group in Prison Health Services in HMP Isle of Wight, please contact Gemma McMaster - Service Manager on 01983 556741 - or e mail gemma.mcmaster@practiceplusgroup.com&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7144", "longitude": "-1.30639"}}, "title": "Pharmacist- HMP Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241465", "validThrough": "2020-11-08T23:59:59+0000"}