{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum, inc HCA + Recruitment"}}, "datePosted": "2020-11-04T16:46:10+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;span&gt;Sonographer - Part time / Full time 37.5 hrs per week&lt;br /&gt;Salary Scale – Band 8a plus HCA’s. There is also currently a £5k per year recruitment &amp; retention premia.&lt;/span&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a motivated, enthusiastic and experienced Sonographer to join our friendly and hardworking team based at the Princess Royal University Hospital (PRUH) in Bromley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are a sonographer who values team working highly, has the ability to use an innovative and flexible approach to problem solving and has the confidence to work within a busy acute hospital we would like to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to the delivery of a high quality service. Appointed candidate(s) will have the opportunity to make full use of their experience and skill in an environment that supports and promotes continued professional development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have ultrasound rooms across our PRUH, Orpington Hospital and Beckenham Beacon sites where we deliver a wide range of examinations including gynae TV, abdominal, small parts, vascular and MSK ultrasound.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would be expected to work across the sites.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The PRUH is part of King’s College Hospital NHS Foundation Trust and is situated in outer London, providing comprehensive health care and emergency services for Bromley and Kent areas. King’s College Hospital NHS Foundation Trust has over 1,400 beds across various sites, making it one of the largest and busiest hospital trusts in London, with a well-established national and international reputation for clinical excellence, innovation and achievement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be HCPC registered, hold a Pg Dip in Medical Ultrasound or equivalent, and must have recent/relevant NHS experience.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Debs Bettesworth&lt;/p&gt;\n&lt;p&gt;Job title US Superintendent&lt;/p&gt;\n&lt;p&gt;Email address debsbettesworth@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01689 863633&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Christopher Redrup&lt;br /&gt;US Deputy Superintendent&lt;br /&gt;christopher.redrup@nhs.net&lt;br /&gt;01689 863633&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256713", "validThrough": "2020-11-28T23:59:59+0000"}