{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-04T09:22:41+0000", "description": "\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;School Staff Nurse&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Barechurch Family Hub - Colchester,          &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full time &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a dynamic and motivated Registered Nurse looking to work with children and families in the Colchester area? Are you looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The School Staff Nurse is a registered general nurse working as part of the public health nursing team in providing preventative and supportive health care to children, young people and their families.  The post holder works with a public health focus under the supervision of a Specialist Community Public Health Nurse (SCPHN) with a defined population.  As part of the public health nursing team the post holder collaborates with a wider multi-disciplinary and inter-agency team in offering public health services to the community.  The work takes place in a variety of settings, including home, clinic and community venues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your days will be rewarding and varied and will include but not be limited to: delivery of the healthy child programme at four levels as delegated by the Specialist Community Public Health School Nurse, recognise health needs for individual clients and situations in relation to the health of children, young people, individuals and families, undertake health assessments in schools and prepare for, attend and participate in relevant case conferences and inter-agency meetings as delegated by the Specialist Community Public Health nurse (SCPHN).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a registered nurse with a minimum of 6 months post graduate experience and have access to a vehicle for work purposes. You will have a caring nature with excellent listening skills in order to gain the trust of students within the schools. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will feel valued as a School Staff Nurse with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;AFC 2020/2021 salary and terms and conditions, &lt;strong&gt;including an NHS pension&lt;/strong&gt;.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Flexible working to provide you with that true work / life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to bespoke career pathways and opportunities to continue your professional development&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Plus in Essex, we are continuously looking at new ways to improve our staff’s health and wellbeing including ‘wellbeing Wednesdays’ – a virtual yoga/ meditation class ran on a weekly basis.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Ryan Shortall via email: ryan.shortall@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Virgin Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO2 8NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8682", "longitude": ".903876"}}, "title": "School Staff Nurse Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255172", "validThrough": "2020-11-18T23:59:59+0000"}