{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum Incl. HCAS"}}, "datePosted": "2020-11-02T15:46:27+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 6 Static Physiotherapist Stroke and Neurology&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;£36,070 - £42,712 per annum Incl. HCAS&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;West Middlesex University Hospital&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;A new and exciting opportunity has arisen for a static band 6 Physiotherapist to join our Stroke and Neurology team at West Middlesex Hospital. We are looking for a flexible and highly motivated Physiotherapist with broad clinical experience including working with Stroke and Neurology patients.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be based primarily in the stroke therapy team, but will also provide support and input to neurology patients elsewhere in the hospital. The post holder will be able to work in a dynamic and autonomous way. You will be working alongside other therapy teams to support and guide their practice to ensure high quality patient care.&lt;/p&gt;\n&lt;p&gt;The stroke therapy team are passionate about delivering excellent patient care, consistently score an A on SSNAP and are always striving to develop the service in line with best practice.&lt;/p&gt;\n&lt;p&gt;We are a friendly and welcoming team and are committed to professional development. You will have regular supervision, training and development opportunities. You will also have the opportunity to work with peers across the in-patient on wider projects and initiatives.&lt;/p&gt;\n&lt;p&gt;You will be working as part of a 5 in 7 rota – your weekend shifts will be based in the Emergency Department, respiratory and orthopaedics depending on rotas and be part of the respiratory on call service.&lt;/p&gt;\n&lt;p&gt;We have strong links with our local universities, enabling us to make valuable contributions to fieldwork education. You will be given the opportunity to supervise both students, junior and Therapy assistants. We have a structured model for supervision and appraisal that will support you in developing your management skills.&lt;/p&gt;\n&lt;p&gt;If this sounds like the opportunity for you, we would warmly welcome you to visit our West Middlesex University Hospital site and meet our passionate and enthusiastic therapy teams to find out more!&lt;/p&gt;\n&lt;p&gt;We look forward to welcoming you to the therapies department at Chelsea and Westminster NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephen Bass, Band 7 Physiotherapist - Acute Stroke Unit&lt;/p&gt;\n&lt;p&gt;stephen.bass@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;07825227469&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Emily Berrisford - Clinical Lead Therapist for Orthopaedics&lt;/p&gt;\n&lt;p&gt;emily.berrisford@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital Site, Isleworth, London", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Static Physiotherapist Stroke and Neurology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252710", "validThrough": "2020-11-16T23:59:59+0000"}