{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-05T13:01:13+0100", "description": "&lt;p&gt;We’re looking for nurses to join the emergency medicine care group at University Hospital Southampton NHS Foundation Trust (UHS). Our care group includes both the emergency department and the acute medical unit (including same day emergency care). Join a team delivering services to over 1.9 million people as both a designated major trauma centre, and one of only two places in the south of England to offer adults and children full onsite major trauma care provision.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy is for experienced nurses – if you’re a newly qualified nurse you should apply through our dedicated newly qualified adult or child nurse adverts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EMERGENCY DEPARTMENT &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ED is a major trauma centre providing care to approximately 320 patients a day with a mixture of major trauma, majors assessment and treatment area and minor injuries. The department also has an enhanced care suite dedicated to those patients experiencing a mental health crisis. The ED prides itself on delivering high quality patient centred care in a fast paced environment.&lt;/p&gt;\n&lt;p&gt;The ED is an exciting place to work, great team work and multi-disciplinary working ensures that all new starters are made to feel supported and welcome. As you progress through your induction a vast array of learning opportunities are available such as triage competency, suturing, dementia champion, ALS, cannulation and venesection and trauma ILS.&lt;/p&gt;\n&lt;p&gt;The department has been recently rated “Outstanding” in both ‘Effective’ and ‘Caring’ categories by the CQC and “Good” overall as a department. We’re currently undergoing radical development to deliver the brand new purpose built children’s emergency department, alongside a brand new resuscitation room.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ACUTE MEDICAL UNIT (INCLUDING SAME DAY EMERGENCY CARE)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The AMU is a 54 bedded unit with its own discharge lounge. There are a number of different areas within AMU, from a seven bedded high observation area, to dedicated male and female areas with private side rooms. This is a busy, fast paced area aiming for a turnaround time of up to 72 hours before patients are discharged or moved to a specialist medical ward.&lt;/p&gt;\n&lt;p&gt;Same day emergency care (SDEC) is part of a national project transforming ambulatory services, which is one of the fastest growing areas across the NHS. This is a diverse area specialising in a range of acute medical problems as part of a multi-disciplinary team. A typical day in SDEC will see you providing initial assessment, triage and exemplary care to our patients through same day care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CHILDREN’S EMERGENCY AND TRAUMA DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our current children’s ED and the paediatric assessment unit will be joining to make our new children’s emergency and trauma department in September. If you’re a registered children’s nurse with an interest in emergency care – this could be the time to join.&lt;/p&gt;\n&lt;p&gt;Within a large teaching hospital we’re also the regional children’s major trauma centre. The new children’s emergency and trauma centre is anticipated to see approximately 30 000 children and young people. The purpose build service is a standalone department offering the following facilities – an 11 trolley acute illness and injury service, a safe room, eight bedded children short stay, children’s X-ray within the service, a treatment/procedural room. The department is also aiming to open the new resuscitation room the end of the year.&lt;/p&gt;\n&lt;p&gt;The benefit of the new service is the integrated skills of a PAU nursing team and a children ED team which will streamline and improve the experience for children requiring emergency care. The service is part of the Southampton Children Hospital strategy to ensure children’s nursing standards are maintained.&lt;/p&gt;\n&lt;p&gt;Flexibility to work the full range of shifts within a 24 hour shift pattern is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The emergency medicine care group has a reputation for innovation and are committed to developing our staff. The care group has a strong leadership network of matrons, consultant nurses and advanced practitioners who will be able to guide and support your learning.&lt;/p&gt;\n&lt;p&gt;You’ll be given the opportunity to develop both clinically and professionally to enhance your skills in acute care. As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working where the needs of the service allow and you’ll have an opportunity to discuss this at interview. UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Get in touch with us if you have any questions, or if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Attrill&lt;/p&gt;\n&lt;p&gt;Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;lisa.attrill@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381204488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff Nurse - Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212812", "validThrough": "2021-01-05T23:59:59+0000"}