{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-26T12:46:47+0000", "description": "&lt;p&gt;Clinical Skills Trainer&lt;/p&gt;\n&lt;p&gt;Would you like to influence and develop clinical practice across the workforce?&lt;/p&gt;\n&lt;p&gt;Are you a clinician with a passion for teaching others, looking for a change in your career whilst maintaining your clinical skills?&lt;/p&gt;\n&lt;p&gt;An exciting role has just been developed in Lincolnshire Community Health Services to support the transformation, development and quality of clinical skills across our service lines within our beautiful county. We are looking to recruit 6 individuals that have either NMC or HCPC registration to facilitate and sign off clinical competencies within our clinical service lines. The Clinical Skills Trainers will deliver an identified programme of skills training with clear objectives, which involves working clinically with the learners as well as facilitating study days, programmes and workshops.&lt;/p&gt;\n&lt;p&gt;You should possess excellent communication and organisational skills along with the ability to negotiate learning objectives and give challenging feedback.&lt;/p&gt;\n&lt;p&gt;You will role model Trust and NHS values, be inspirational, with a desire to give learners the best experience in clinical practice.&lt;/p&gt;\n&lt;p&gt;You will be able to further develop your coaching, teaching, and assessment skills for learners in a variety of settings and will be support by the existing Clinical Practice Educator Team.&lt;/p&gt;\n&lt;p&gt;It is essential that the candidate will be able to work as a team player and also be able to work autonomously. The candidate should be able to work flexibly to support the needs of the workforce and ultimately our community.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVicki LightfootJob titleEffective Practice LeadEmail addressvicki.lightfoot@nhs.netTelephone number07920544845&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "County Wide Post, TBC", "postalCode": "LN5 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2265", "longitude": "-.524149"}}, "title": "Clinical Skills Trainer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242508", "validThrough": "2020-11-10T23:59:59+0000"}