{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-27T13:15:16+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a staff nurse to join the Ambulatory are team based on Ward 15 at Leighton Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ambulatory Care Unit (ACU) aims to provide patients with rapid access to investigations and treatment without the need for hospital admission. Often patients are discharged to return to the unit for continued treatment, diagnostics or review. We are open Monday to Friday 0800am until 10pm.  The Unit is supported by a team of acute care Medical Consultants and Advanced Nurse Practitioners.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a valued member of the team, the successful candidate will be supported in the development of a wide range of clinical skills and practice which will enable them to provide excellent care and ensure the best outcomes for our patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role is ideal for a dynamic individual who enjoys no two days being the same. It is an ideal role for someone who is perhaps looking at returning to acute care, a newly qualified nurse or someone simply looking for a change and a new challenge.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust has been rated ‘Good’ by the Care Quality Commission (CQC) following the recent inspection of its services and leadership and Mid Cheshire Hospitals Foundation Trust has been named a Top40 hospital at CHKS Top Hospital Awards 2019.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our clinical facilities are excellent, as we have invested in state of the art theatres, Critical Care, Emergency Department and our Children’s Wards (to name but a few). We have also invested in our people, ensuring we have the right number of the right people delivering care, fostering a culture of compassion, support and excellence.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Nurse- Ambulatory Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244676", "validThrough": "2020-11-08T23:59:59+0000"}