{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "63792", "minValue": "54959", "unitText": "YEAR", "value": "£54,959 - £63,792 per annum, pro rata (incl of HCA"}}, "datePosted": "2020-11-05T15:46:35+0000", "description": "&lt;p&gt;*** Previous Applicants Need Not Apply ***&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and experienced principal clinical psychologist / counselling psychologist with strong leadership qualities to manage, co-ordinate the clinical delivery of the Veterans Complex Treatment Service across the South Central region. The service provides assessment and psychological treatment for military veterans with attributable complex mental health issues including Posttraumatic Stress Disorder (PTSD), depression, anxiety disorders, substance mis-use and/or anger issues.&lt;/p&gt;\n&lt;p&gt;The postholder will be responsible for the development, management and delivery of a complex treatment service for military veterans. The postholder will oversee service delivery and will be responsible for the development and maintenance of service operating procedures, quality control and reporting to NHS England. The post-holder will be involved in supporting the CTS staff and will provide supervision and line-management to the band 7/8a psychologists, as well as other HCPs where appropriate. As the service is the lead provider for South West and South Central region, the post-holder will also support the clinical delivery of the service to the South West region, where appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from &lt;strong&gt;[&lt;em&gt;£54,959 - £63,792]&lt;/em&gt;&lt;/strong&gt; per annum, pro rata (incl of HCAS)&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;“must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Holder of an HCPC regulated Clinical/Counselling Psychology qualification&lt;/p&gt;\n&lt;p&gt;Training in evidence-based psychological therapy for PTSD&lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call: Dawne West on 07768 250045 or email: dawne.west@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Veterans Mental Health Complex Treatment Service, Reading", "postalCode": "RG6 6BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4408", "longitude": "-.936464"}}, "title": "Principal Clinical Psychologist - Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258427", "validThrough": "2020-11-26T23:59:59+0000"}