{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-21T08:15:55+0100", "description": "&lt;p&gt;&lt;strong&gt;Proudly Providing Children’s Heart Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Opportunities – Children’s Hospital – University of Leicester NHS Trust&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have a range of Band 5 positions across our expanding and reconfiguring Children’s Hospital at the Leicester Royal Infirmary and Glenfield Hospital in Leicester.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In September 2019 we received the exciting news that we had funding agreed to create a standalone Children’s Hospital at the Leicester Royal Infirmary. The first phase of our reconfiguration will see our Paediatric Congenital Cardiac Centre and ECMO service at Glenfield Hospital re-locate to new facilities at the Leicester Royal Infirmary in April 2021. We will then progress with creating a new age appropriate environment for all bringing together all acute paediatric services into one defined area of the Leicester Royal Infirmary (LRI) to create a fully integrated Children’s Hospital to serve the population of Leicester, Leicestershire, Rutland, the East Midlands and beyond. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The children we care for are at the heart of everything we do. We recognise that delivering high quality care requires a culture of lifelong learning and development. With this in mind we have developed an extensive and exciting band five career pathway offering a number of exciting options to develop your Nursing career. We are totally committed to helping you realise your potential.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have positions in our Children’s Cardiac Ward, Intensive Care Units, High Dependency Unit, Out-Patients, Surgical Day Care, General Medical and Surgical and Oncology Wards. By joining our team now, you will have the opportunity to be part of shaping children’s services in the future.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We know that you will have lots of questions to ask us and so we are going to be at one of the largest national Nursing Jobs Fair which was due to be held in Leicester on the 4th November 2020 but due to the current restrictions is going to be held virtually. The event is the Midlands Virtual RCNi Nursing Careers and Jobs Fair and you can register for the event on their website and you will able to talk the teams about our amazing opportunities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants can be experienced or newly qualified Children’s Nurses. We are also able to accommodate Registered Adult Nurses and Registered Learning Disability Nurses in some of our areas.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Ennis joanne.ennis@uhl-tr.nhs.uk 07921 545963&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Staff Nurse - Childrens", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235527", "validThrough": "2020-11-16T23:59:59+0000"}