{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T11:01:02+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the all age mental health liaison service within Oldham. You will be working as part of a multi-disciplinary team to provide an effective and efficient response to referrals from the Emergency Department and Medical wards at The Royal Oldham Hospital.&lt;/p&gt;\n&lt;p&gt;You will assess individuals mental health, risk manage, support and appropriately refer on and signpost patients who come through the services within the general hospital. You will be working with a wide range of individuals of all ages, experiencing mental health crises and co-morbid physical and mental health problems.&lt;/p&gt;\n&lt;p&gt;As part of this dynamic and progressive multidisciplinary team you will also ensure the development of effective interfacing between teams, other mental health services and agencies such as the POLICE, NWAS and local authority and be involved in the co-ordination of S136 of the Mental Health Act 1983.&lt;/p&gt;\n&lt;p&gt;Within the mental health liaison service you can expect professional support and development in this exciting and challenging area of work. If you are an experienced mental health practitioner who holds professional registration in health or social care, who has a passion for working in an autonomous role with a wide range of people across all ages, including later life this is an opportunity to be part of some exciting service developments.&lt;/p&gt;\n&lt;p&gt;These posts will be worked on a shift basis with 24 hour working required including bank holidays and weekends.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMags MaysJob titleClinical Lead/Team ManagerEmail addressmmays@nhs.netTelephone number07825052948Additional contact information&lt;/p&gt;\n&lt;p&gt;Mags Mays Clinical Lead/Team Manager on 07825052948 or&lt;/p&gt;\n&lt;p&gt;Lesley Williams Service Manager on 07769935979&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Forrest House Royal Oldham Hospital Oldham Ol1 2JH, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Senior Liaison Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249855", "validThrough": "2020-11-13T23:59:59+0000"}