{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T08:16:20+0000", "description": "&lt;p&gt;Due to internal staff members being released to undertake a research secondment, this opportunity has arisen to join our friendly proactive team delivering a dietetic service to the hospitals in Oxfordshire. The acute dietitians work in the Oxford University Hospitals Foundation Trust (OUH) which is a world renowned centre of clinical excellence and one of the largest NHS teaching trusts in the UK. The Trust is made up of four hospitals - the John Radcliffe Hospital (which includes the Children&#39;s Hospital, West Wing, Eye Hospital, Heart Centre and Women&#39;s Centre), the Churchill Hospital and the Nuffield Orthopaedic Centre, all located in Oxford, and the Horton General Hospital in Banbury, north Oxfordshire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is suitable for newly qualified dietitians or Band 5 dietitians looking for further experience. This post offers the opportunity for you to develop your clinical and communication skills within a variety of areas including complex medicine, specialist surgery, trauma, oncology, cardiothoracic and paediatrics – within the ward and out-patient setting. The acute team includes specialist dietitians for adult gastroenterology, surgical emergency, neurosciences, oncology and critical care and there are opportunities for further development into these areas as part of a structured rotation programme. Please phone to find out more about this exciting opportunity. (see contact details below)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The acute adult dietetics team is made up of approximately 40 Dietitians, 3 Dietetic Assistants and administrative support on all sites. There are 7 acute clinical teams, each responsible for providing a service to an identified clinical area across all four acute hospitals in Oxfordshire. We work closely across all four hospitals with staff and patients moving between them, shared CPD opportunities and joint meetings. We work closely with the children’s dietitians who are based in the Oxford Children’s Hospital, and the community dietitians based at the East Oxford Health Centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 14-Nov-2020&lt;/p&gt;\n&lt;p&gt;Interview planed: 24-Nov-2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Matt Newby&lt;/p&gt;\n&lt;p&gt;Dietetic Team Lead&lt;/p&gt;\n&lt;p&gt;matt.newby@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01865221702&lt;/p&gt;\n&lt;p&gt;Joanne Watson, Dietetic Service Manager, 01865-221701 joanne.watson@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill/John Radcliffe, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249339", "validThrough": "2020-11-14T23:59:59+0000"}