{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Pay to existing Grade"}}, "datePosted": "2020-10-15T11:00:31+0100", "description": "&lt;h1&gt;&lt;strong&gt;Could you be a Trust Freedom to Speak up Guardian?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Ashford and St Peter’s are looking to appoint a new Freedom to Speak Up Guardian. This important Trust position is open to all staff from any field, designation or seniority ideally with experience as a FTSU Ambassador or in supporting staff and/or others to raise concerns in the organisation.&lt;/p&gt;\n&lt;p&gt;The position will be for 15 hours per week which should be solely spent on progressing the FTSU agenda and contributing to embedding a culture of speaking up and a ‘Just Culture’ organisation wide.&lt;/p&gt;\n&lt;p&gt;The role of the Trust Freedom to Speak Up Guardian is to help raise the profile of raising concerns in the organisation and provide confidential advice and support to employees who have concerns about patient safety or the way their concern has been handled. The FTSU Guardian should not be involved in investigations but help to ensure the process is followed correctly.&lt;/p&gt;\n&lt;p&gt;The FTSU Guardian role is designed to contribute to achieving the following outcomes:&lt;/p&gt;\n&lt;p&gt;• A culture of speaking up is instilled throughout the organisation.&lt;/p&gt;\n&lt;p&gt;• Speaking up processes are effective and continuously improved.&lt;/p&gt;\n&lt;p&gt;• All staff have the capability to speak up effectively and managers have the capability to support those who are speaking up.&lt;/p&gt;\n&lt;p&gt;• All staff are supported appropriately when they speak up or support other people who are speaking up.&lt;/p&gt;\n&lt;p&gt;• The Board is fully sighted on, and engaged in, all Freedom to Speak Up matters and issues that are raised by people who are speaking up.&lt;/p&gt;\n&lt;p&gt;• Safety and quality are assured.&lt;/p&gt;\n&lt;p&gt;• A culture of speaking up is instilled throughout the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please register your interest if you are;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Open, honest, approachable and able to commit to the role 15 hours/week&lt;/li&gt;\n&lt;li&gt;Interested in helping your colleagues raise any concerns they have at work no matter how small&lt;/li&gt;\n&lt;li&gt;Excellent at listening and have good communication skills&lt;/li&gt;\n&lt;li&gt;Well organised&lt;/li&gt;\n&lt;li&gt;Able to attend training in order to undertake the role&lt;/li&gt;\n&lt;li&gt;Supported by your manager&lt;/li&gt;\n&lt;li&gt;Have an understanding of the importance of confidentiality and independence&lt;/li&gt;\n&lt;li&gt;Have an understanding of Caldicott principles and data protection&lt;/li&gt;\n&lt;li&gt;Familiar with the Trust Raising Concerns policy and practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Charlotte Broughton Freedom to Speak Up Guardian on; 07967 835781 or &lt;/strong&gt;&lt;strong&gt;charlotte.broughton1@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Freedom to Speak up Guardian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227829", "validThrough": "2020-11-08T23:59:59+0000"}