{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T10:31:17+0000", "description": "&lt;p&gt;Do you want to be part of improving mental health care for the future? Taking a lead role in improving access to Mental Health Services and creating a comprehensive liaison service for West Wales?&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to work in the new mental health liaison service within Hywel Dda University Health Board. This is an opportunity for an experienced Advanced Nurse Practitioner (ANP) to work full time and contribute to the development and direction of the team. The service will support any adult over the age of eighteen.&lt;/p&gt;\n&lt;p&gt;The post holder will have experience of assessing and managing complex risks of service users and will be skilled in providing clinical leadership and supervision to other team members and students. This role is suitable for a confident practitioner who will manage the local population under supervision from a consultant psychiatrist. You will be able to assess, diagnose, treat or refer patients within the scope of professional qualifications, skills and abilities. This will be a challenging and diverse role suited to someone wishing to make a real difference to the provision of mental health liaison, within district general hospital.&lt;/p&gt;\n&lt;p&gt;The post will be based in Carmarthen but will be extended to cover the areas of liaison in Pembrokeshire and Ceredigion. The successful applicant will work alongside a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;If you are an innovative, motivated experienced Advanced Nurse Practitioner, with excellent communication skills, passionate and committed to patient experience, staff development and service improvement. Then this role would be perfect for you. We would expect all candidates to meet the essential criteria.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this further please contact Amanda Davies, Senior Nurse Tel:- 01554 781071 or email Amanda.davies37@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Interviews to be held on 1st December 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda DaviesJob titleSenior NurseEmail addressamanda.davies37@wales.nhs.ukTelephone number01554 781071&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Advanced Nurse Practitioner Mental Health Liaison", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255372", "validThrough": "2020-11-22T23:59:59+0000"}