{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T13:46:08+0000", "description": "&lt;p&gt;We are looking to appoint a Consultant in Critical Care Medicine to join our dynamic team at the North Middlesex Hospital. You will get to work in modern purpose built facility with modern and spacious operating theatres housing state of the art anaesthetic delivery and monitoring equipment.&lt;/p&gt;\n&lt;p&gt;The Critical Care Department in the hospital includes an Intensive Care (ICU) and a High Dependency (HDU). ICU has a total of 8 individual rooms with single beds and 2 large rooms with 2 beds each. All rooms in ICU are negative pressure rooms. HDU has 09 beds including 3 single rooms and two large 3 bedded areas. All beds in the Critical Care Complex are equipped with full monitoring facilities and a central monitoring station on each side.&lt;/p&gt;\n&lt;p&gt;The Critical Care Complex admits close to 1000 patients per year. Median length of stay for the unit is 3.4(1.8-6.9) days. Bed occupancy is more than 90% for majority of time. Turnover of patients is really high hence the unit is a very busy. Of the all the referrals over 90% are from medical specialities. There is a weekly radiology meeting on Thursday morning. Microbiology involved multi-disciplinary meeting is held every day afternoon in the critical care complex. Daily there are two consultant lead ward rounds plus a night telephone ward round. There are two handovers every day directly supervised by critical care consultants. Critical care also provides 24/7 outreach services to the hospital. It is led by a lead nurse for outreach. Critical care provides a follow up clinic bimonthly for identified patients. There are plans in place to increase the frequency of this clinic to once a month.&lt;/p&gt;\n&lt;p&gt;For discussions regarding this post, please contact DrThaventhran Prabhahar Clinical Lead for Critical Care via email thaventhran.prabhahar@nhs.net&lt;/p&gt;\n&lt;p&gt;The Trust is an Equal Opportunities Employer. We provide a smoke free work environment. Due to the nature of this post, an enhanced Disclosure &amp; Barring Service search will be conducted on the successful applicant.&lt;/p&gt;\n&lt;p&gt;It is essential you have full GMC Registration and are either included on the Specialist Register, or within 6 months of CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date - 16th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Thaventhran Prabhahar, Clinical Lead for Intensive Care onthaventhran.prabhahar@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120622.jpg", "name": "North Middlesex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120622"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Middlesex University Hospital NHS Trust, London", "postalCode": "N18 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6135", "longitude": "-.07424"}}, "title": "Consultant in Critical Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250400", "validThrough": "2020-11-27T23:59:59+0000"}