{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc HCAS"}}, "datePosted": "2020-11-06T15:31:26+0000", "description": "&lt;p&gt;Applications are invited for a Clinical Research Nurse to work at St George’s University Hospitals NHS Foundation Trust. The post holder will be a member of the CRN South London flexible delivery team working closely within the Paediatric infectious diseases research group and will be responsible for delivering an agreed portfolio of clinical research.&lt;/p&gt;\n&lt;p&gt;The Research Nurse will play a key role in the planning, implementation and evaluation of the support required to deliver CRN portfolio studies and ensuring that any research supported by the Network safeguards the well-being of the patients and is conducted according to Good Clinical Practice (GCP) and the Medicines for Human Use (Clinical Trial) Regulations 2004 and Amended Regulations 2006. In conjunction with the other members of the team, they will facilitate the production of good quality of research.&lt;/p&gt;\n&lt;p&gt;The Research Nurse will provide expert services to NIHR CRN portfolio teams and support recruitment of patients to ensure the successful working of the clinical research projects that they are assigned to. They will also act as a patient advocate providing support and assistance as required and assist in the execution, co-ordination and management of local initiatives and schemes.&lt;/p&gt;\n&lt;p&gt;Although the post holder will work primarily within the Division they may be required to work on studies within other divisions, should the need arise. This role will be matrix managed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAderonke AdebiyiJob titleHead of Research NursingEmail addressaderonke.adebiyi@stgeorges.nhs.ukTelephone number0208 7253412Additional contact information&lt;/p&gt;\n&lt;p&gt;Jennifer Pearce, Senior Clinical Research Nurse on 0208 725 6226 or&lt;/p&gt;\n&lt;p&gt;j.pearce@sgul.ac.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George’s University Hospitals NHS Foundation Trust, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Clinical Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260398", "validThrough": "2020-11-20T23:59:59+0000"}