{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T10:16:04+0000", "description": "&lt;p&gt;This is an exciting opportunity for a CAMHS Consultant Psychiatrist to join Chichester Specialist CAMHS and also join the developing Neuro-Developmental service in West Sussex. Some of the duties the role holder will be involved in is; providing medical psychiatric assessment, intervention and reviews and providing psychiatric advice and consultation to colleagues in CAMHS. Additionally, the successful post-holder will offer assessment and reviews within the NDP pathway for ASC and ADHD.&lt;/p&gt;\n&lt;p&gt;Please note this post is being advertised as part-time (0.6).&lt;/p&gt;\n&lt;p&gt;The post will be based in Chichester CAMHS which is in close distance of the City Centre and will cover West Sussex as part of NDP. Travel between sites will be required.&lt;/p&gt;\n&lt;p&gt;You will work as part of a friendly and supportive multidisciplinary team which includes Nurses, Clinical Psychologists, Child psychotherapy, Family Psychotherapists and social workers.&lt;/p&gt;\n&lt;p&gt;You will also be part of a Trust wide consultant network where there are opportunities to liaise with colleagues in other posts throughout the Trust and develop peer networks. You will also see consultant peers weekly at the local academic programme, at regular division meetings in the locality and at clinical governance meetings.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership is committed to people participation, meaning that we involve patients and their carers and supporters, in service decision-making and planning. You will be expected to contribute to this shared value and to support the functioning of this service in the delivery of its participation strategy.&lt;/p&gt;\n&lt;p&gt;Not decided yet or want to discuss your individual interests in working at Sussex Partnership then please pick up the phone and talk to us! We want to hear your thoughts and ideas on how our jobs can work for you&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the Job Description is still with the Royal College for approval. If there are any small changes we will ensure all applicants receive the final version before interview.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Carly Mendy&lt;/p&gt;\n&lt;p&gt;Job title General Manager&lt;/p&gt;\n&lt;p&gt;Email address carly.mendy@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07464925770&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Caroline Flisher Consultant Lead Psychiatrist for CHYPS:&lt;/p&gt;\n&lt;p&gt;caroline.flisher@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;0300 304 0021&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chichester CAMHS, Chichester", "postalCode": "PO19 8QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8261", "longitude": "-.78596"}}, "title": "Neurodevelopmental Child and Adolescent Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243967", "validThrough": "2020-11-17T23:59:59+0000"}