{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42481", "minValue": "36329", "unitText": "YEAR", "value": "£36,329 - £42,481 per annum"}}, "datePosted": "2020-10-29T16:30:42+0000", "description": "&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PHE is a Category 1 responder as defined by the Civil Contingencies Act, 2004 and Emergency Preparedness, Resilience and Response (EPRR) is an important element of its activity. This role is pivotal in ensuring that PHE delivers and maintains a high quality service in this area.&lt;/p&gt;\n&lt;p&gt;The Emergency Preparedness Managers (EPMs) report to the Senior Emergency Preparedness Manager and work with Emergency Preparedness Officers to enhance the ability of the PHE SW Region to respond to incidents, in particular Covid-19. EPMs will also assist the Health Protection Team by supporting Programme Leads with specific areas of work. EPMs will represent PHE at Local Resilience Forums to provide input into planning, training, exercises and response to incidents.&lt;/p&gt;\n&lt;p&gt;Applicants should review the job description for the post prior to completing their application. When completing their application form candidates should demonstrate how they meet the essential requirements of the role.&lt;/p&gt;\n&lt;p&gt;Interviews will be held via skype or MS teams at the beginning of December 2020.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;PHE employees who are at risk or in the redeployment pool are given prior consideration for any suitable alternative employment. Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and thefuture National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Richard Clarke on 0117 9689168.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "2 Rivergate, Bristol or Follaton House, Totnes", "postalCode": "BS1 6EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4502", "longitude": "-2.58323"}}, "title": "Emergency Preparedness Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249089", "validThrough": "2020-11-12T23:59:59+0000"}