{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44863", "minValue": "39880", "unitText": "YEAR", "value": "£39,880 - £44,863"}}, "datePosted": "2020-10-30T14:25:14+0000", "description": "&lt;p&gt;Lincolnshire County Council has an exciting opportunity for a Practice Supervisor to lead and manage the East Lindsey South Children&#39;s Health Team. Our Children&#39;s Health Service includes the delivery of the Healthy Child Programme by Health Visitors, Children and Young People&#39;s Nurses and support staff.&lt;/p&gt;\n&lt;p&gt;Here at Lincolnshire County Council, we believe that children, young people and families deserve outstanding care. Our high aspirations to become a fully integrated Children&#39;s Services mean we are at the forefront of innovation; we have started on this journey but need dynamic and forward looking people to help us take this forward.&lt;/p&gt;\n&lt;p&gt;As a Practice Supervisor you&#39;ll supervise registered and non-registered practitioners in the delivery of the healthy child programme and safeguarding cases. The right person will work alongside and support the integration of other key stakeholders including working with our wider Children&#39;s Service colleagues to ensure the safe and effective allocation of new work and that service delivery is according to the needs of the client.&lt;/p&gt;\n&lt;p&gt;The role of Practice Supervisor has a range of responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsibility for the day to day local support and supervision including providing advice on safeguarding and complex cases. This will also include the responsibility to conduct all mandatory clinical and safeguarding supervision for relevant members of the team.&lt;/li&gt;\n&lt;li&gt;Taking responsibility and promoting safeguarding and clinical governance agenda. This will include taking any action required to ensure service compliance, leading investigations of both clinical and safeguarding incidents from fact finds to root cause analysis. Ensuring that any lessons learnt from internal and external reviews are embedded in practice and providing the assurance evidence.&lt;/li&gt;\n&lt;li&gt;Local responsibility for ensuring and providing assurance on the service being compliant with the relevant CQC regulations and to escalate any deficits to the locality health manager. This will include ensuring that all staff evidence their responsibility within the relevant CQC regulations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Utilising specialist clinical skills using evidence base to identify any risks and needs you will protect children and provide assurance that practitioners are adhering to safeguarding policies and procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be registered with the NMC as a nurse or midwife and be a Specialist Community Public Health Nurse. They must have an active NMC registration highlighting both of these elements along with an active mentor status and or supervision qualification.&lt;/p&gt;\n&lt;p&gt;You&#39;ll evidence experience and an expert knowledge of the 0-19 public health/children&#39;s health service delivery including within safeguarding with a sound proven working knowledge of safeguarding children, Children Act 1989/2004, Working Together to Safeguard Children (2015) and Domestic Abuse (DASH/MARAC).&lt;/p&gt;\n&lt;p&gt;As a Practice Supervisor you will demonstrate the ability to manage and implement change, including sharing the vision of the service and the organisation. Promoting and developing integrated approaches to care through the development of multi-disciplinary working across teams, children&#39;s services and where relevant other partner agencies, is an important part of the role.&lt;/p&gt;\n&lt;p&gt;If this sounds like the next step in your career, then please read through the full Job Description, to ensure that you can meet the required criteria and to help you do the best application possible, before clicking apply.&lt;/p&gt;\n&lt;p&gt;For a confidential and informal discussion about the role, please contact Lynn Wilkinson, Children&#39;s Health Locality Manager on 07741605844.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lincolnshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129675"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lindsey", "postalCode": "LN2 1DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2294", "longitude": "-.539362"}}, "title": "Practice Supervisor - Children&#39;s Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250557", "validThrough": "2020-11-15T23:59:59+0000"}