{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "11086", "unitText": "YEAR", "value": "£82,096 - £110,86"}}, "datePosted": "2020-11-04T10:39:59+0000", "description": "&lt;p&gt;Full or part time applicants are invited to apply for Consultant posts in Respiratory Medicine based at West Hertfordshire Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;A post has been approved following the ongoing expansion and reconfiguration of the department of Thoracic Medicine at West Hertfordshire Hospitals NHS Trust. The appointee will join the team delivering in-patient, out-patient and bronchoscopy services which include sub-specialty clinics (Interstitial lung disease, sleep, domiciliary ventilation, COPD, asthma and bronchiectasis; all in collaboration with our community partner, Central London Community Healthcare Trust), together with pure WHHT services which include TB, lung cancer and the new dedicated pleural program with medical thoracoscopy. In addition the department is actively involved in the acute sector of the hospital with an increasing emphasis on level 2 medical HDU support. Integral to the department’s strategy is the expansion of our physiology services which include cardio-pulmonary exercise testing.&lt;/p&gt;\n&lt;p&gt;Applicants with existing skills in CPET, NIV and/or medical HDU are particularly encouraged to apply.&lt;/p&gt;\n&lt;p&gt;There are 9 established respiratory consultants, two associate specialists and 4 Lung CNS supported by a team of community-based respiratory specialist nurses and physiotherapists providing nurse led clinical care, ‘hospital at home’, oxygen and pulmonary rehabilitation.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to contribute to the weekday SMART (specialist respiratory take) on call rota, which will replace the GIM rota. By substitution the chest physicians have dropped G(I)M on call commitments at weekends for a specialist respiratory rota (Saturday/Sunday mornings/ 1in 10).&lt;/p&gt;\n&lt;p&gt;Enquires about these posts with a view to arranging informal visits are welcomed. Please contact Dr Ajitha Jayaratnam on 01923217699, ajitha.jayaratnam@nhs.net or Dr Rahul Mogal on 01923217158, rahul.mogal@nhs.net&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospitals NHS Trust is situated in a pleasant part of Hertfordshire and affords easy access to London (1/2 an hour by train) and to other parts of England via the M1 and M25 Motorways.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Consultant in Respiratory and General Internal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255414", "validThrough": "2020-11-22T23:59:59+0000"}