{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-29T13:01:00+0000", "description": "&lt;p&gt;&lt;strong&gt;VARIETY, FLEXIBILITY AND THE CHANCE TO DEVELOP YOUR NURSING SKILLS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If these are qualities you look for in a role then we could have the perfect opportunity for you.&lt;br /&gt;The Division of Surgery at Oldham Care Organisation are looking to recruit Band 5 staff nurses of varying experience to join the Surgical Nursing Rotation Programme. This new rotational programme, built around your specialty preferences, will provide you with the opportunity to learn a variety of nursing skills in a supported environment.&lt;/p&gt;\n&lt;p&gt;The programme runs for a period of 18 months, broken down into three 6 month placements. On each placement you will be supported by a specialty mentor along with the divisional practice based educators. Your placement will start with a supernumerary period allowing you to get to know the team and the ward environment, followed by a structured roster allowing you specific time to develop your nursing skills. During your placement you will complete a series of pre-determined competencies, all of which will be signed off at the end of each placement.&lt;/p&gt;\n&lt;p&gt;Specialties where you could have an opportunity to rotate are:&lt;/p&gt;\n&lt;p&gt;General Surgery, Colorectal, Vascular, Trauma and Orthopaedics, Gastroenterology&lt;/p&gt;\n&lt;p&gt;Our team at the Oldham Care Organisation appreciate that you will have lots of commitments in your home life and that finding a job to fit around that can sometimes be a challenge. We are keen to ensure our workforce is supported as much as possible, and that our people feel valued so that staff and patient experience is positive. Therefore we will work with you to create a roster that can be adapted to suit your needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• If you’re a newly qualified nurse, your preceptorship will be supported and run alongside this programme.&lt;br /&gt;• Support and chance to grow and develop your skills. If you are already a registered nurse any current training or development you are involved in will naturally be honoured. Additionally you will receive support for mentorship training or a CPD course of your choice.&lt;br /&gt;• Support and encouragement from future focussed practice based educators and senior nursing team.&lt;br /&gt;• Flexibility, where possible we will support you with a shift pattern that fits in with your day to day life.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nursing for the future&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and energetic individuals, who work well under pressure, are keen to learn, are a great team player but are self-motivated and can work independently when needed. You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to your team members.&lt;/p&gt;\n&lt;p&gt;A sense of ownership for your patients, a ‘can do’ attitude and determination to deliver the best patient care is essential in departments that can have a massive impact on the patient experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome the chance for you to see how our departments work together and encourage you to visit us as part of your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All positions offered and appointed are in full recognition and acceptance of these requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alex Baker&lt;br /&gt;&lt;/strong&gt;Nursing Resourcing Lead&lt;br /&gt;alex.baker@srft.nhs.uk&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Care Organisation, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Staff Nurse - Surgical Rotation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248423", "validThrough": "2020-11-12T23:59:59+0000"}