{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "85000", "minValue": "85000", "unitText": "YEAR", "value": "85,000"}}, "datePosted": "2020-10-26T10:04:53+0000", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort.  So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Hospital Arnold provides acute adult mental health services, delivered in partnership with Nottinghamshire Healthcare Trust, at our purpose built facility in Arnold. After nearly three years of successfully providing services for men and women, we have successfully opened 2 new PICU Wards.&lt;/p&gt;\n&lt;p&gt;We currently provide mental health services for patients who are 18 years and over in an acute setting:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; Bestwood ward - 16 bedded mixed acute ward&lt;/li&gt;\n&lt;li&gt; Newstead ward - 16 bedded mixed acute ward&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Each existing ward has two permanent Consultant Psychiatrists with dedicated speciality doctor support.&lt;/p&gt;\n&lt;p&gt;The aim at Priory Hospital Arnold is to provide a person centred approach and therapeutic environment, which promotes collaborative care planning to optimise treatment goals. Right from the point of admission to our acute services, our aim is to support patients to be discharged safely back into the community where they can continue to progress towards recovery in a less restrictive environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This will be achieved by:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Thorough assessment of individuals needs throughout admission&lt;/li&gt;\n&lt;li&gt;Person centred collaborative treatment plans&lt;/li&gt;\n&lt;li&gt;A range of interventions available from a diverse MDT&lt;/li&gt;\n&lt;li&gt;Being cared for in the least restrictive environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The clinical team at Arnold encourage full involvement of the service user, their family and external professionals throughout their stay. They are invited to attend Ward Reviews and CPA meetings to ensure clear communication throughout the care pathway in order to promote individuals&#39; recovery and facilitate discharge.&lt;/p&gt;\n&lt;p&gt;In order to maximise recovery, interventions offered include a wide range of therapeutic approaches, combining psychiatric and cognitive behavioural perspectives with occupational therapy, psychology, leisure and recreational activity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A unique opportunity to work in our brand new service  (Male PICU) where extensive medical support is offered to our patients. You will work alongside one Consultant Psychiatrist covering up to 10 patients.  As a Specialty Doctor you will work closely with the Consultant Psychiatrist to provide continuous medical cover on a daily basis to the patients on the ward.&lt;/p&gt;\n&lt;p&gt;Alongside the Consultant, you will care for a maximum of 10 patients, referred to the psychiatric intensive care unit usually from our local NHS trust.  During working hours, you will be responsible for clerking in new patients and reviewing their mental/physical state throughout the working week.      &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other duties include&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessment, appropriate investigation, diagnosis and treatment under will occur with Consultant supervision of inpatients. Each patient must be interviewed and reassessed at a frequency appropriate to their individual clinical needs and sufficient to monitor changes and make timely modifications to the treatment plan.&lt;/li&gt;\n&lt;li&gt;Good communication with ward staff, including morning handovers daily.&lt;/li&gt;\n&lt;li&gt;To participate in treatment plans and programmes as appropriate to ensure good medical practice within the MDT settings.&lt;/li&gt;\n&lt;li&gt;On call commitment 1:5 first on call basis.&lt;br /&gt;  &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;General working hours are Monday to Friday 9:00 – 17:00.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC registration&lt;/li&gt;\n&lt;li&gt;12 months’ adult psychiatry experience&lt;/li&gt;\n&lt;li&gt;Relevant experience within a similar setting (preferred)&lt;/li&gt;\n&lt;li&gt;Approval under Section 12 of the Mental Health Act (preferred)&lt;/li&gt;\n&lt;li&gt;Excellent knowledge of the Mental Health Act 1983 (2007) and Code of Practice along with Mental Capacity Act 2005 and Code of Capacity&lt;/li&gt;\n&lt;li&gt;The ability to interview, assess and treat patients and write clear comprehensive medical notes&lt;/li&gt;\n&lt;li&gt;Proven record of CPD&lt;/li&gt;\n&lt;li&gt;Desirable: Membership of Royal College of Psychiatrists, Physicians, General Practitioners or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary: up to £85,000 (Depending on Experience)&lt;/li&gt;\n&lt;li&gt; Opportunity to progress to a Consultant through the CESR programme and support with MRCPsych examinations  - we have a track record of supporting colleagues with career progression. &lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement and study leave to attend CPD opportunities, conferences etc.&lt;/li&gt;\n&lt;li&gt;Departmental education programme and peer group to support RCPsych requirements.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Opportunity to undertake further learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Free meals on duty.&lt;/li&gt;\n&lt;li&gt;Access to a pooled wellbeing fund which is used to improve health and wellbeing of all priory staff&lt;/li&gt;\n&lt;li&gt;Access to kitchen facilities.&lt;/li&gt;\n&lt;li&gt;Supportive staff&lt;/li&gt;\n&lt;li&gt;Dedicated office space&lt;/li&gt;\n&lt;li&gt;Manageable caseload / inpatient caseload – the role covers 10 beds working alongside one Consultant&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development. &lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer. Priory Group will cover the cost of a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG5 8PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0314", "longitude": "-1.11149"}}, "title": "Speciality Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241955", "validThrough": "2020-11-27T23:59:59+0000"}