{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "3000", "unitText": "YEAR", "value": "34,000.00 plus £3k Welcome Bonus"}}, "datePosted": "2020-11-04T14:07:11+0000", "description": "&lt;p&gt;Priory Hospital Enfield is a 53 bed hospital in the Borough of Enfield and is situated with very good transport links. The site provides services in both a forensic setting (male medium secure &amp; low secure) and acute services (mixed sex). The hospital can cater for up to 53 patients at one time across the four wards, and the responsibility for staffing the hospital is of vital importance.&lt;/p&gt;\n&lt;p&gt;Benefits of working on site includes free and secure parking, excellent transport links to Central London (via the Overground which is one minute walk from the site) as well excellent links to the M25 via the A10. Free meals are provided to all staff and you will be entitled to the Priory’s excellent benefits package.&lt;/p&gt;\n&lt;p&gt;Works as Senior Nurse in a Ward or equivalent area ensuring a safe and therapeutic environment for patients, their families and visitors&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applies relevant policies and statutory requirements within the ward and hospital framework of governance and communicates requirements to the wider team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ensures that risk is assessed and managed across the immediate and wider working environment and that statutory requirements are met.&lt;/p&gt;\n&lt;p&gt;Respects and applies the requirements of equality and diversity, promoting and role modelling these across the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Identifies deficits in skill mix and safe staffing levels and acts to address these.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Supervises a defined group of team members and contributes to their overall CPD, mandatory training and appraisal process recognising the skills required across the team. This will also include addressing any performance issues that are below the expected standard.&lt;/p&gt;\n&lt;p&gt;Acts as a role model to promote a culture of learning development, inquiry and a team vision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Implements, monitors and evaluates therapeutic interventions within an overall care programme, enabling people with mental health and or learning disability needs to develop coping strategies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Actively supports and contributes to effective Multi Disciplinary Working&lt;/p&gt;\n&lt;p&gt;Engages in collaborative problem solving, supporting and encouraging clients to take ownership of issues, identify problems and to develop solutions to them based on their own needs and preferences.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Contributes to the process of collaboratively assessing and acting on risks of harm, danger and abuse.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Is named nurse for a small group of patients, acting as Associate nurse for colleagues when on duty, and is a regular shift leader.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Provides Clinical Supervision to a group of defined nursing staff&lt;/p&gt;\n&lt;p&gt;Undertakes Lead roles for the ward, as agreed with the Ward manager&lt;/p&gt;\n&lt;p&gt;Deputises for the Ward manager as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Adheres to all National, Company and local standards, policies and procedures  &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Enfield", "postalCode": "N9 9DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6258", "longitude": "-.063435"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256145", "validThrough": "2020-11-14T23:59:59+0000"}