{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T11:04:35+0000", "description": "&lt;p&gt;&lt;span&gt;Salary: BANK Band 6, Salary starting at £31,365 to £37,890 per annum subject to performance evaluation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bank Contract / Temporary contract.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;37.5 hours per week Bank, Temporary contract Full Time / Part-time, variable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;TheWest Suffolk Hospital is a 480 bed unit providing a full range of acute services to a population of approximately 275,000 living in the west of the county. Along with our Hospital in Bury St Edmunds, The West Suffolk NHS Foundation Trust in partnership with Ipswich Hospital NHS Trust and Norfolk Community Health and Care NHS Trust provide a range of community services across the county as part of Suffolk Community Health Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Development Team are responsible for the delivery of the physical environment aspect of the Trust’s capital programme. The main challenge for the post holder is to implement projects whilst minimising the operational impact on the Trust. Along with the further development of system/processes to ensure best practice is adopted for managing projects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is our ambition to build a Bank of construction professionals that can be called on as required to deliver projects for the Trust as the need is identified. It will be expected that the appointed bank professional will deliver the projects in line with the specification requirements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to our expanding capital work load and portfolio the Trust require a Bank Band 6 project manager to aid on the development, build and delivery of the main building roof and structure refurbishment programme, a ward refurbishment programme, minor works programme and various projects as prioritised by the Capital and Development management team annually. The Project manager with be an individual that is highly experienced in delivering complex construction projects to tight deadlines. Experience in delivering projects within a working hospital setting will be regarded as beneficial. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key areas of responsibility for each post include: -&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Managing projects from inception through to implementation and evaluation.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Implementation and management of a project management quality system.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Responsibility for the management of the professional team of Architects and Engineers to ensure regulatory compliance and value for money service is received for the projects under your control.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Assisting in the preparation of business cases/national bids for funding.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Responsible for the system of managing estate records and accurate filing for the projects under your control and responsibility.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Acting as Project Manager on local and national initiatives.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Contributing to the planning, implementation and documentation of the Trusts estate strategy, site development and site master plans.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Providing technical support to the Development Team and contractors.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Planning and client management for R&amp;D surveys for asbestos in project under your control&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide site surveys of space and infrastructure and update CAD drawings as agreed with the development team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage and develop minor works projects and budgets on an on-going basis.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage contractors on site in line with on-going projects.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage within the bounds of your experience service shutdowns, crane lifts etc. both in and out of hours.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage and respond to client complaints and questions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;From time to time work outside normal office hours to achieve project goals.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Produce programme documentation to direct project time scales.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Will be required to participate on an on-going basis in an out of hours Estates on call rota.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an experienced project manager with previous operational experience of working in building services and/or quantity surveying and/or building surveying and/or building design and/or electrical/mechanical engineering or design.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have a strong track record with the delivery of construction projects, be a highly motivated, experienced team player with excellent financial and communication skills. Ideally you will be a practically minded individual with experience of working in Health Care or Public Sector environments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity for someone with enthusiasm, commitment and energy to contribute to the continuing development of the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information on the Directorate please visit our web site at:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Jason McCormack, Estates and Facilities Capital Project Manager at jason.mccormack@wsh.nhs.uk.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;DOES NOT &lt;/strong&gt;entitle you to apply to park on the Hospital site.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Bank Project Manager (Band 6) - West Suffolk Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253619", "validThrough": "2020-11-18T23:59:59+0000"}