{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa (pro rata)"}}, "datePosted": "2020-10-28T11:15:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Neighbourhood Clinical Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hours: Various hours available ranging from a min 22.5 to 37.5 hpw.&lt;/p&gt;\n&lt;p&gt;Base: there are 13 neighbourhood teams providing services across Leeds so location can be agreed on appointment.&lt;/p&gt;\n&lt;p&gt;Do you want to be one of our key workers helping the NHS respond to Covid -19 and looking for a varied role which supports delivery of outstanding patient care in Leeds?&lt;/p&gt;\n&lt;p&gt;We need compassionate and dedicated healthcare support workers who are qualified to NVQ level 3 or have equivalent experience/qualification. We need you to have experience of working in teams and with the public and ideally you will have experience of working in a health and social care setting. We also need you to be a car owner/driver or have access to other suitable transport.&lt;/p&gt;\n&lt;p&gt;The role includes many different aspects of patient care delivered to a wide range of patients in their own homes. You will have lots of opportunity to develop and learn skills from a supportive team which is made up of a variety of professionals.&lt;/p&gt;\n&lt;p&gt;We will support you with a full tailored induction programme and will encourage on-going development.&lt;/p&gt;\n&lt;p&gt;We value all our hardworking staff so in return we do our best to offer a range of benefits. Here are just a few:&lt;/p&gt;\n&lt;p&gt;- Competitive salary in line with Agenda for Change banding &lt;br /&gt; - 27-33 days annual leave plus bank holidays &lt;br /&gt; - Highly regarded NHS Pension Scheme &lt;br /&gt; - Professional development opportunities including coaching, training and education support &lt;br /&gt; - Salary sacrifice or lease car schemes &lt;br /&gt; - Health and wellbeing including discounted gym membership, occupational health service and priority access to mental health services&lt;/p&gt;\n&lt;p&gt;Our service operate from 07:00am - 22:00pm providing care for patients requiring care in their own home. We also have opportunities in our Night service.&lt;br /&gt; &lt;br /&gt; What now? &lt;br /&gt; If you feel like we&#39;re the place for you to make a difference then start your application now. To find out more about working at Leeds Community Healthcare then head to our website or contact us on 0113 2033458.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123892.jpg", "name": "(AS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Neighbourhood Clinical Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246229", "validThrough": "2020-11-12T23:59:59+0000"}