{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694"}}, "datePosted": "2020-11-05T09:15:46+0000", "description": "&lt;p&gt;Team NNUH’s Emergency Department is seeking motivated and dedicated doctors to join the team as &lt;strong&gt;Junior Clinical Fellow (ST1/2 equivalent)&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Our busy and friendly emergency department is the perfect place to kickstart your career at our modern hospital; we are the 6th largest acute trust in the UK and our city location in the beautiful county of Norfolk is the ideal setting, no matter what your interests.&lt;/p&gt;\n&lt;p&gt;Working as a Junior Clinical Fellow in Emergency Medicine will give you the chance to work at the very start of a patient’s time with us and no two days will be the same. The environment you will work within is ever changing, our clinical teams are passionate about what they do, and they want talented doctors with shared passion to join them.&lt;/p&gt;\n&lt;p&gt;Our growing Trust provides a full range of acute clinical services through the Norfolk and Norwich University Hospital (1,000 beds) and Cromer and District Hospital, including more specialist services, such as oncology and radiotherapy, neonatology, orthopaedics, plastic surgery, ophthalmology, rheumatology, paediatric medicine and surgery. As a university teaching hospital we have developed our research and development strategy in partnership with the University of East Anglia. We have strong links with the East Anglian Air Ambulance and are working on increasing our trauma provision with aspirations to become a Major Trauma Centre over the coming years.&lt;/p&gt;\n&lt;p&gt;We are passionate about supporting our colleagues and helping them to achieve their personal and professional goals, whether you want to develop a special interest in a certain area, or take time to complete further education – we are here to help facilitate that.&lt;/p&gt;\n&lt;p&gt;Not only will you be working in a rapidly developing hospital, you will also be living in a beautiful part of the UK. Norfolk is well known for its beautiful coastline and stunning countryside, less than 2 hours from London and serviced by excellent transport links, you can enjoy anything from surfing, hiking, eating out in one of our many independent restaurants and bars or shopping during your free time, our county has it all. The Guardian has recently ranked Norwich as one of the best cities to work in, coupled with the fact 77% of people say they love their jobs here, we really do have the best of both!&lt;/p&gt;\n&lt;p&gt;If you are passionate about emergency medicine and seeking a challenging new role, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full and part time opportunities are available, you will be expected to work a shift pattern, including night duties; with a basic salary of £38,694pa (pro rata) plus additional elements for extra hours, weekend and evening working. This post is initially for a 12 month contract, which could be extended if you’d like to stay!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Dr Frank Sutherland, Service Director on 01603 287452.&lt;/p&gt;\n&lt;p&gt;or Dr Francoise Sheppard francoise Sheppard@nnuh.nhs.nhs on 01603 286286&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ED Medical Staff, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Junior Clinical Fellow in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257021", "validThrough": "2020-11-12T23:59:59+0000"}