{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-23T09:30:49+0100", "description": "&lt;p&gt;Applications are invited for a full-time Consultant Microbiologist post based at the East and North Hertfordshire NHS Trust. The successful applicant will form part of the Trust’s pathology department and will be a part of a team of 4 consultants providing a comprehensive microbiology service. The department provides a comprehensive range of services for our resident population of approximately 500,000 residing mainly in east and north Hertfordshire and extends to the borders of Bedfordshire, Cambridgeshire, west Hertfordshire and Essex.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in a large district general hospital covering the full range of acute services including an active renal unit, orthopaedics, gastroenterology, respiratory medicine, cardiology, oncology, rheumatology, urology, plastic surgery, obstetrics &amp; gynaecology, paediatrics and elderly care medicine. There is a well-established infection control team covering all hospital sites. The on-call commitment is paid at A rate under the new Consultant Contract.&lt;/p&gt;\n&lt;p&gt;If an applicant is UK trained, they must ALSO be a holder of a Certificate of Completion of Training (CCT), or be within six months of award of CCT by date of interview.&lt;/p&gt;\n&lt;p&gt;If an applicant is non-UK trained, they will be required to show evidence of equivalence to the UK CCT &lt;em&gt;(CCT or equivalence in Medical Microbiology or Medical Microbiology and Virology)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Applications from those wishing to work part-time or job share are welcomed.East &amp; North Hertfordshire NHS Trust is an employer committed to equal opportunities.&lt;/p&gt;\n&lt;p&gt;It is imperative that you also attach your CV to your application as this is an integral part of the application process. Dependent on the number of applications, we may not contact you if you fail to do so. Please ensure to supply the names and addresses of referees. This must cover a period of 3 years with no gaps, one of whom must be your current employer.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Applicants wishing to arrange either an informal discussion or visit should contact Dr Ashish Narula, Consultant Histopathologist and Clinical Director of Pathology 01438 286326 (Ext 6326) or Dr Eleni Mavrogiorgou, Consultant Microbiologist on 01438 284288 (Ext 4288) or 01438 284043 (Ext 4043) (Lister hospital).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: Sunday 29th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Consultant Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239827", "validThrough": "2020-11-29T23:59:59+0000"}