{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51068", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,068 pa plus London weighting"}}, "datePosted": "2020-10-27T12:01:28+0000", "description": "&lt;p&gt;University College London Hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;The UCLH FELLOWSHIP in INTENSIVE CARE MEDICINE (ST5+ LEVEL)&lt;/p&gt;\n&lt;p&gt;Full time – 9 months FTC&lt;/p&gt;\n&lt;p&gt;Candidates are invited to apply for our new and exciting post aimed at senior trainees / post-CCT doctors in Anaesthesia/Critical Care Medicine. Our objective is to develop future leaders in this important emerging field. We offer a 9 month fixed term contract with a start date of Wednesday 4th November 2020.&lt;/p&gt;\n&lt;p&gt;Based at University College Hospital, the successful candidate will partake in an innovative programme aimed to improve a model of care for high-risk patients. Clinical duties include being the senior trainee on the Intensive Care (level 2 and 3 care) and under the supervision of Critical Care consultants. This post will be an opportunity to be part of an innovative multidisciplinary team working with general medical and surgical patients but also specialist services suggest as haematology (including TTP/HUS, HaemOncology, HLH, and CAR-T cell therapies) and Cancer Surgery. Fellows will also undertake supervised preoperative assessment clinic training and develop their clinical competencies in a wide range of technical and non-technical skills (Royal College of Anaesthetists Advanced level training/Faculty of Intensive Care Medicine specialty year compliant). The fellow will be senior doctor on site out of hours and will have responsibility for emergency care (including cardiac arrest).&lt;/p&gt;\n&lt;p&gt;The key feature of the post is the opportunity to undertake the fully funded specialist fellowship with opportunities to undertake UCL MSc.s or PGCE. In addition, fellows will have the opportunity to undertake supervised clinical research with departmental clinical scientists. Substantial time is allocated within the weekly programme for Fellowship, MSc and research activities, built into a rolling programme of education and training. Additionally, opportunities exist for those wishing to accredit in trans-thoracic echocardiography (BSE level-1 or level 2), participate in the development of master’s level education, data science, management and QI, electronic health care systems and a number of other translational research projects. Please see the Job description for more detailed description of the fellowships. The rota is banded at 1A.&lt;/p&gt;\n&lt;p&gt;UK and overseas students are encouraged to apply, and all applicants must be eligible for full GMC registration and have a background in Anaesthesia/Critical Care Medicine, having achieved competencies to ST5 training year and FRCA, FFICM (or equivalent). UK based trainees must seek approval for OOPE and will be supported in applications to the RCoA and GMC for OOPT / OOPR approval as appropriate.&lt;/p&gt;\n&lt;p&gt;Previous critical care experience with appropriate airway skills are essential for this post. Additionally, candidates will need to demonstrate self-motivation and excellent time management skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the hospital. For further information or to arrange a visit to the department, please contact Dr Sam Clark via email: Samuel.clark1@nhs.net. When applying candidates should use their personal statements to express their interest in the precise version(s) of the fellowship that most appeal to them and the reasons why they might be appropriate for that particular program.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Clinical Fellow (ST5+) - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244389", "validThrough": "2020-11-10T23:59:59+0000"}