{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-10-05T11:45:58+0100", "description": "&lt;p&gt;&lt;strong&gt;Operating Department Practitioners and Theatre Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It’s an exciting time to join The Shrewsbury and Telford Hospital NHS Trust! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our two hospitals, The Princess Royal Hospital in Telford and the Royal Shrewsbury Hospital in Shrewsbury, provide a wide range of acute hospital services for around half a million people across Shropshire, Telford &amp; Wrekin and Mid Wales. Together the hospitals have over 700 beds and assessment &amp; treatment trolleys across a variety of services.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide excellent care for the communities that we serve, and now is an exciting time to join us and live our values to ensure we continue to offer the best possible care and keep our patients at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;The Princess Royal Hospital, Telford consists of 10 operating theatres, 8 theatres and 2 maternity theatres. We have an on call team that covers the main theatres 24/7 and a team consisting of an ODP and scrub practitioner that covers maternity 24/7. On our Telford site we cover the following specialities: Trauma &amp; Orthopaedics, ENT, MaxFax, Gynae, Paediatrics, Breast surgery, CEPOD and Maternity.&lt;/p&gt;\n&lt;p&gt;The Royal Shrewsbury Hospital comprises of 9 Operating Theatres covering a range of Major and Day Case Surgery including Colorectal, Urology, Upper GI and Bariatric, Vascular, ENT, Max Fax, Orthopaedic Trauma and an Emergency CEPOD Theatre 24/7.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Shropshire is a beautiful rural county rich in historic sites and opportunities for outdoor activities, so whether you’re an adventure seeker or enjoy time for relaxation there’s sure to be something for you. With an exciting food scene and charming market towns, Shropshire is also a wonderful county for eating, drinking and planning a day out shopping. We also have excellent transport links to nearby cities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whether you’re an experienced Operating Department Practitioner or Theatre Nurse looking for your next move, or you’re just graduating and looking to make a start in your new exciting career, you’ll find a welcoming and supportive environment here at SATH to encourage you to reach your full potential.&lt;/p&gt;\n&lt;p&gt;Working in either the theatre or recovery teams, you’ll find it extremely rewarding working with other pro-active individuals to deliver the best standards of perioperative care. You’ll be joining our Trust at an exciting time as we continue to grow and improve our services, and we know you will make a positive contribution to its future success.&lt;/p&gt;\n&lt;p&gt;You must have a flexible attitude to work and be able to cover a range of shifts which will include weekends, bank holidays and on-calls. Cross site travel between The Royal Shrewsbury Hospital and The Princess Royal Hospital, Telford may be required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Trust, we are passionate about helping our staff to achieve their career aspirations, and can offer a variety of learning and development opportunities to support your continued professional development. Working with the Transforming Care Institute we can also offer in-house training such as degree/master modules, secondments and acting up opportunities. You will also have the opportunity to gain experience in those specialities not covered at your base site.&lt;/p&gt;\n&lt;p&gt;We can also offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Paid attendance at mandatory training courses&lt;/li&gt;\n&lt;li&gt;Access to the NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Support for re-validation should you need it&lt;/li&gt;\n&lt;li&gt;27 days annual leave entitlement on appointment, increasing after 5 and 10 years’ service&lt;/li&gt;\n&lt;li&gt;Various local and national discounts through the Blue Light Card and Health Service Discounts&lt;/li&gt;\n&lt;li&gt;Access to staff health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interested? Apply today!&lt;/p&gt;\n&lt;p&gt;* &lt;strong&gt;Please note that holding a Literacy and Numeracy qualification (as per the person specification), is a requirement for this position. If you do not hold an English and Numeracy Qualification at GCSE grades 9-4 or equivalent, you will have the opportunity to complete a simple Literacy and Numeracy assessment once you commence in post.*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Operating Department Practitioners and Theatre Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212487", "validThrough": "2021-01-31T23:59:59+0000"}