{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T08:30:37+0000", "description": "&lt;p&gt;Welcome to East Kent Hospitals NHS University Foundation Trust and thank you for considering us as your choice of employer.&lt;/p&gt;\n&lt;p&gt;The Trust covers a population area of 760,000 and we need people like ‘You’ with fresh ideas and energy to come and join us on our journey. The Trust is set in an area of outstanding beauty with great transport links to London &amp; the continent but with easy access to many great Kentish beaches and towns.&lt;/p&gt;\n&lt;p&gt;The Child Health Department at EKHUFT encompasses a broad range of paediatric services with Inpatient paediatric and neonatal services located at the William Harvey Hospital (WHH) in Ashford, inpatient and Special Care Baby Unit facilities at Queen Elizabeth the Queen Mother Hospital (QEQM) in Margate. Ambulatory paediatric care is provided at Dolphin Ward, Kent and Canterbury Hospital (KCH), Canterbury and Carousel Ward, Buckland Hospital, Dover. Community and outpatient services are provided in other facilities. Community Child Health is integrated within the East Kent Hospitals Trust.&lt;/p&gt;\n&lt;p&gt;The Executive Team has recently approved a business case to expand the Child Health Governance Team and within this is the opportunity to develop our services as well as implement new and innovative ways of working. We are seeking to appoint a compassionate, enthusiastic and proactive team member to join our multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;You will support the Child Health Governance Matron and be involved in the day-to-day delivery and development of the governance agenda across the Child Health Care Group including Neonatal Care, Patient safety, Quality Improvement, compliance with national guidance, risk assessment and management as well as incident investigation will all form an integral part of the role.&lt;/p&gt;\n&lt;p&gt;You will be required to encourage, influence and facilitate healthcare professionals and other colleagues to develop practice that is patient centred, health promoting and evidence based, and to use service improvement skills, to enable more consistent performance within Child Health.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sophia Lindsay, Head of Nursing for Child Health&lt;/p&gt;\n&lt;p&gt;Email address:sophia.lindsay@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number:07929018366&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Child Health Governance Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256929", "validThrough": "2020-11-19T23:59:59+0000"}