{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18500", "minValue": "18500", "unitText": "YEAR", "value": "Circa £18,500 pro rata - Plus Enhancements"}}, "datePosted": "2020-11-04T10:30:40+0000", "description": "&lt;p&gt;We are recruiting for a Nursing Support Assistant to join our In Patient Unit Team, to contribute to the provision of a high standard of holistic care to patients, families and carers as part of the multi-disciplinary team.  Your main responsibilities will be to assist with patients’ personal care, helping to move, position and mobilise patients and observing their general condition in line with the care plan, reporting any changes as required.  You will also assist with patients’ nutritional needs and update the patient record system.&lt;/p&gt;\n&lt;p&gt;To be considered for this post you will need previous experience working in a health care setting and preferably hold a Level 2 Qualification in Health and Social Care. You should be aware of the physical and emotional needs of patients suffering from a life-limiting illness and those of their relatives and carers and be kind and caring in your approach.  Good team work and the ability to work a full range of shifts including earlies, lates, nights, weekends and bank holidays is also required. &lt;/p&gt;\n&lt;p&gt;You may also be required to vary your base for work and to work within the Hospice at Home Team according to service requirements, therefore a full driving licence and access to your own transport is also required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing Date 16th November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note that this advert may close earlier depending on applications received&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isabel Hospice ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welwyn Garden City, Herts", "postalCode": "AL7 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8009", "longitude": "-.194002"}}, "title": "Nursing Support Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255367", "validThrough": "2020-11-16T23:59:59+0000"}