{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T20:30:20+0000", "description": "&lt;p&gt;We have an exciting opportunity for an experienced Band 7 Family Therapist to join our Medway YPWS team based at The Courtyard, Gillingham.&lt;/p&gt;\n&lt;p&gt;You will be part of a multi disciplinary team (MDT) which offers assessment and treatment to children and young people, who have mental health disorders. Our community based team has a robust and innovative treatment &#39;pathway&#39; system which allows young people to be streamlined directly into either our Mood and Anxiety, Complex, or Conduct and behaviour pathways.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake initial assessments to identify the mental health needs of the young person and then deliver evidence based treatment within their discipline in the community setting which can include schools and patients homes as well as our hub.&lt;/p&gt;\n&lt;p&gt;In addition, the post holder will clinically supervise junior members of the team and take on a leadership role within the team. The post holder will have a caseload which they will need to manage effectively utilising excellent communication and documentation skills.&lt;/p&gt;\n&lt;p&gt;Our team thrives on the creativity and innovation that comes from within the MDT, we all work closely to manage the teams caseload and to ensure our treatment offers are evidence based and accessible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIsaac IgweJob titleIntegrated Team ManagerEmail addressisaac.igwe@nelft.nhs.ukTelephone number0300 3001986Additional contact information&lt;/p&gt;\n&lt;p&gt;Isaac Igwe&lt;/p&gt;\n&lt;p&gt;Integrated Team Manager&lt;/p&gt;\n&lt;p&gt;0300 300 1986&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Twisleton Court Dartford, Dartford", "postalCode": "DA1 2EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4457", "longitude": ".210762"}}, "title": "CYPMHS Family Therapist (CAMHS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247578", "validThrough": "2020-11-11T23:59:59+0000"}