{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50548", "minValue": "44346", "unitText": "YEAR", "value": "£44,346 - £50,548 per annum Inc HCA"}}, "datePosted": "2020-10-26T15:16:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Team leader/ Senior Sister/Charge Nurse ED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Kings College Hospital is a large teaching hospital at the forefront of academic and nursing excellence. The Emergency Department (ED) is one of the busiest in London, and sees approximately 143,000 patients per year including 31,000 children and young people. As a Major Trauma Centre (MTC) for South East London and Kent, the ED receives patients from two ambulance services and two different air ambulance providers. It is one of few centres in London to have its’ own designated Helipad. It is also a regional centre for Hyper Acute Stroke and primary angioplasty. Our Emergency Department now has a 10 bedded resuscitation area with a nursing ratio of 2:1. We provide care to patients from a diverse inner-city population and believe that the diversity of the local population is reflected in our staff and recruitment strategy.&lt;/p&gt;\n&lt;p&gt;We are committed to developing our nursing staff and we have strong links with King’s College London, London South Bank University and City University. We also have an ED dedicated Practice Development Team across the adult and children’s areas and we are able to offer the advanced assessment, HDU, ENP, BSc and Masters level postgraduate education.&lt;br /&gt;As an Academic Health Science Centre (AHSC) we are seeking to establish the ED as an academic and research department with the support of our critical care colleagues and we now have a dedicated ED research nursing team&lt;/p&gt;\n&lt;p&gt;Why not become part of the team delivering excellent care?&lt;/p&gt;\n&lt;p&gt;this role you will be responsible for the delivery of care across the ED on a shift-by-shift basis. We have an established Band 7 team which allows us to ensure they also have exposure to managing discreet areas of the ED such as Resus as well as undertaking the overall in-charge role. In addition you will be managerially responsible for a small group of nurses with the support of the Matrons and Lead Nurse.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated, innovative nurses with strong clinical knowledge, excellent communication, management and leadership skills who are able to demonstrate suitability and experience for the position. At King’s we are able to offer some unique opportunities and are continuing to explore how we best ensure senior ED nurses have opportunities to expand their clinical expertise and practice, such as, Emergency Nurse Practitioner and Advanced Clinical Practitioner development programmes.&lt;/p&gt;\n&lt;p&gt;King’s takes a flexible approach to working and will consider dual role options such as; Team Leader/ENP, Team Leader/TNC, Team Leader/UCC, or Team Leader/Resuscitation.&lt;/p&gt;\n&lt;p&gt;As part of King’s College Trusts staff benefits scheme, specifically for this post we are offering the successful candidate a generous relocation package which includes up to 3 months paid and arranged accommodation, financial assistance with additional relocation costs, a wide range of staff benefits schemes (cycle scheme, technology scheme, lease cars, childcare), pension scheme, flexible working opportunities, training &amp; development opportunities.&lt;/p&gt;\n&lt;p&gt;Applicants who have been unsuccessful within the last 3 months need not apply.&lt;/p&gt;\n&lt;p&gt;Interviews: 11th March 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed and strongly recommended. If you require any further information or would like to have an informal visit, please contact Clyve Davis-Turner on clyve.davis-turner1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s College Hospital, Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Team Leader/Senior Sister/Charge Nurse ED", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243098", "validThrough": "2020-11-09T23:59:59+0000"}