{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-01T08:15:39+0000", "description": "&lt;p&gt;We have a trained vacancy for a Junior Sister/Charge Nurse. Ward 32 is a busy and vibrant 20 bedded surgical ward. We will shortly have the exciting opportunity of providing 6 enhanced care surgical beds on our ward which will be supported by ITU and our surgical team. You will be dealing with acutely unwell patients with varying complex needs. We transfer patients to Intensive Care and also receive patients from the Intensive Care Unit. You will have ample opportunity to learn and develop yourself as a Band 6 in this supportive environment. You will need to be adaptable and be able to cope working in an environment which can be stressful at times. We would also expect you to stand in for the Band 7 when not on shift and be aware of the Management structure within the Trust.&lt;/p&gt;\n&lt;p&gt;We have a strong clinical leadership and a robust nursing management structure and support network. We also have the services of a Band 7 Practice Development Nurse who is available to develop your skills. We require someone with excellent communication and interpersonal skills as well as an organised person with a positive attitude who is flexible and proactive. We are a friendly team and all enjoy working in our new environment.&lt;/p&gt;\n&lt;p&gt;The Trust and the ward are extremely keen to develop you as a Junior Sister and there is a wealth of training opportunities for you to select.&lt;/p&gt;\n&lt;p&gt;Tunbridge Wells is a vibrant and thriving town with historical sites as well as excellent schools, superb shopping and theatres. It has good transport links to both London and the Coast. It is set in an area of outstanding natural beauty.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Saturday 14th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: To be confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise ToddJob titleSenior SisterTelephone number01892634633&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ward 32, Tunbridge Wells Hospital", "postalCode": "TN2 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Junior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251168", "validThrough": "2020-11-14T23:59:59+0000"}