{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28243", "minValue": "28243", "unitText": "YEAR", "value": "£28,243 pa"}}, "datePosted": "2020-10-29T16:00:35+0000", "description": "&lt;p&gt;Trust Service Post @F1 equivalent in General Surgery / General Medicine.&lt;/p&gt;\n&lt;p&gt;We are looking for a number of Trust Doctors at Foundation 1 level to work at our friendly and supportive District General Hospital with a December start date.&lt;/p&gt;\n&lt;p&gt;Both the Trust and the Departments have a commitment to personal and professional development for each trainee / trust doctor. We encourage and enable all doctors (whether locum or substantive) to gain required competencies and offer advice on preparation of a portfolio, which can be used as evidence to support applications to further Specialty Training. In particular, we have an excellent simulation suite and have recently appointed a Clinical Fellow to further develop the educational programme.&lt;/p&gt;\n&lt;p&gt;For applicants wishing to take up the posts, appropriate clinical supervision, training and support will be provided and the department is familiar with the full range of trainees and portfolios.&lt;/p&gt;\n&lt;p&gt;Our Medical Education Department is readily available to offer support.&lt;/p&gt;\n&lt;p&gt;Applicants for this programme must hold a medical degree from an institution recognised by the GMC. They must have full GMC registration and a licence to practise. They should be able to demonstrate evidence of ability to undertake the core clinical and generic skills required of all doctors at the end of F1, as documented in the FP Curriculum. Applicants must be able to demonstrate an ability to communicate in English in a clinical environment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134574.jpg", "name": "Northern Devon Healthcare Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "TSP @ F1 in General Surgery / General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248956", "validThrough": "2020-11-07T23:59:59+0000"}