{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum"}}, "datePosted": "2020-10-26T15:15:34+0000", "description": "&lt;h1&gt;Stroke Nurse Practitioner&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&#39;Time lost is brain lost’&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Stroke is a medical emergency. Brain tissue at risk of damage can be saved with active management in the initial hours after a stroke starts. Rapid admission to hospital and access to specialised stroke care, including brain scanning and assessment for thrombolysis, is vital for ensuring the best possible outcome for stroke patients. The Department of Health has encouraged the development of specialised stroke services and published the National Stroke Strategy for improving stroke care nationally. In Portsmouth Hospitals University NHS Trust, we have used this to guide the development of our service and ensure these improvements are actually delivered in practice.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Portsmouth Hospitals University NHS Trust is one of the largest acute Hospital Trusts in the country. We provide acute and specialist services to people across Portsmouth, South East Hampshire and West Sussex. We continue to build our reputation for innovation and excellence, consistently delivering outstanding performance, whilst developing the skills and abilities of our staff.&lt;/p&gt;\n&lt;p&gt;The Stroke Service at Portsmouth Hospitals University NHS Trust has developed and continues to evolve to meet the needs of the patients who require specialist Stroke care. We are focused on ensuring a high quality seamless patient pathway and patient experience from admission to discharge delivered by a highly skilled, motivated and compassionate clinical team and we are very proud to have received Level A in the latest Sentinel Stroke National Audit Programme (SNAPP) data published.&lt;/p&gt;\n&lt;p&gt;Our services include 24/7 Thrombolysis provision, access to Thrombectomy services, Hyper Acute Stroke unit (HASU), Acute Stroke unit (ASU), inpatient Neuro Rehabilitation, Stroke specific Rehabilitation and Community Stroke Rehabilitation (CSRT). All of these areas are led by committed specialist multidisciplinary stroke experts.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to review and improve our stroke services we are looking to expand our Hyper- acute stroke team to provide a 24/7 service. As part of this exciting expansion we are looking to recruit an experienced stroke nurse to develop and lead this team. We would welcome applications from highly motivated and dynamic individuals who will provide strong clinical leadership and strategic direction for the hyper acute team and our TIA clinic. You will work with the stroke medical team and assess patients in the emergency department, organise investigations and arrange direct admission to our hyper acute stroke unit.&lt;/p&gt;\n&lt;p&gt;This post is supported by a Core Stroke Skills programme, a Practice Education Team and a culture where all staff are encouraged to be part of the Stroke service changes. You will also have access to the Passport to Manage programme run within the organisation.&lt;/p&gt;\n&lt;p&gt;We welcome all applicants to contact us for an informal visit and encourage you to make contact with us to arrange this. Please telephone Maggie Stoppard (Matron for Stroke) on 02392286000 ext 5340&lt;/p&gt;\n&lt;p&gt;Closing Date 17th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date 1st December 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Stroke Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243083", "validThrough": "2020-11-17T23:59:59+0000"}