{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 - 37,890.00"}}, "datePosted": "2020-11-05T09:16:16+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Inpatient Nurse&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Band 5 / Band 6&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;BANES Community Hospitals - Paulton / St Martins&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Are you a Nurse looking for a new opportunity?&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We have several vacancies a cross both of our inpatient areas here in&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;BANES and would love to hear from you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be working as part of the NHS system in BANES where we deliver services across Bath and North East Somerset - Bath is a cultural hotspot, full of rural landmarks, eateries and a fantastic high street.Set only 11 miles from Bristol and neighbouring towns/cities - this is a fantastic accessible workplace for candidates all round the BaNES area.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our hospitals are based in Paulton and Bath where we provide general medical and stroke rehabilitation for those stepping down form the acute trusts; as well as supporting our primary care colleagues with admission avoidance; stepping up from the community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You&#39;ll be working in a tight-knit team who will support you throughout your work endeavours and push you for success. Team Leaders and Managers are hands-on and approachable on the wards, they will lead yourself and the rest of the team to be innovative and forward-thinking with your approach to nursing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a registered nurse you will receive:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;AFC&lt;/span&gt;&lt;/span&gt;&lt;span&gt;20/21 salary and terms and conditions including an NHS pension.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;We will provide you with access to a committed learning and development team, with access to a combination of in house learning to support your development. We also work closely with Universities and Health Education England to further your potential and support any progression you wish to make.&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;You will have access our central online health and lifestyle platform&lt;/span&gt;&lt;span&gt;and become part of the Virgin Tribe family granting you premier offers, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Across both inpatient areas you will be part of a team who are passionate about the rehabilitation of their patients and always strive to ensure they regain as much independence as possible.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be based primarily at one site but will rotate through both as an opportunity to enhance your learning, broaden your skills and develop stronger working relationships with colleagues.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will have a RN qualification and will be able to work collaboratively within our multi-disciplinary team. You will be responsible for contributing to the holistic assessment, planning delivery and evaluation of patient care, displaying strongcommunication and organisation skills, along with a flexible approach at all times to ensureyou deliver positive patient experiences.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to discuss these opportunities further or wish to see the full job descriptions please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Claire Plumley on 07976 917697 &lt;/span&gt;&lt;span&gt;Claire.Plumley@virgincare.co.uk&lt;/span&gt;&lt;span&gt;or&lt;/span&gt;&lt;/span&gt;&lt;span&gt;Naomi O’Neil on 07976 918514 /&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Naomi.O&#39;Neill@virgincare.co.uk&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We partner with the NHS to make a real difference to people in Bath and North East Somerset and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Inpatient Nurse Band 5/6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257029", "validThrough": "2020-11-19T23:59:59+0000"}