{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 - £20,795 per annum"}}, "datePosted": "2020-11-05T16:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;***This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Available - 1 X Permanent, Part Time 18.75 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work pattern can be agreed with a successful candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are looking for an opportunity to be part of a small friendly motivated team which will help you to develop your administrative and customer service skills then look no further. A vacancy has arisen within the team and we would like to invite interested applicants to apply for the role of Training and Compliance Officer to help them manage the Trust temporary workforce. If you are innovative, motivated and look forward to new challenges then this is the perfect post for you post for you.&lt;/p&gt;\n&lt;p&gt;The Temporary Staffing Service is a busy and diverse working environment which provides temporary clinical and administration staff to services across Birmingham. We pride ourselves on providing high quality dedicated Bank members to meet staffing shortfalls in our clinical and non-clinical services.&lt;/p&gt;\n&lt;p&gt;The Training and Compliance Officer will need to provide efficient business focussed administration and support to the Compliance function of the Temporary Staffing Service on a day to day basis, contributing to the efficient and effective running of all compliance-related functions within the Department.&lt;/p&gt;\n&lt;p&gt;To perform well in this position you will need to demonstrate excellent customer service skills, be a good team player who is able to use own initiative, prioritise your workload, whilst working to tight deadlines and dealing with frequently changing priorities. Your work will mainly be telephone and IT based so you should have an excellent customer service background as well as good keyboard skills and a proven working knowledge of Microsoft Office packages is essential. Full training will be provided for our specialist software.&lt;/p&gt;\n&lt;p&gt;You will need to be willing to learn and undertake training and development that the role requires. Excellent written &amp; verbal communication and interpersonal skills are essential as direct contact with a range of staff and departments internally as well as external to the Trust is pivotal to this role.&lt;/p&gt;\n&lt;p&gt;This role involves working between Monday to Friday and the work pattern can be agreed with a successful candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process.&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRyan CarrollJob titleBank Systems and Compliance ManageEmail addressRyan.Carroll@bhamcommunity.nhs.ukTelephone number0121 466 7426Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ryan Carroll &lt;/strong&gt;&lt;strong&gt;Trust Bank Systems and Compliance Manager, &lt;/strong&gt;&lt;strong&gt;Tel:&lt;/strong&gt; 0121 466 7426, &lt;strong&gt;Mobile:&lt;/strong&gt; 075950 91026. &lt;strong&gt;Email:&lt;/strong&gt; Ryan.Carroll@bhamcommunity.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3 Priestley Wharf, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 3 Training and Compliance Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258459", "validThrough": "2020-11-19T23:59:59+0000"}