{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T13:16:09+0000", "description": "&lt;p&gt;The Resuscitation Team is looking to appoint a Band 6 Workforce Development Officer (Resuscitation Officer).&lt;/p&gt;\n&lt;p&gt;The Resuscitation Team is an enthusiastic team of registered and non-registered staff who support training from basic to advanced life support to fulfil the Trust&#39;s training needs analysis and comply with nationally recognised courses.&lt;/p&gt;\n&lt;p&gt;We are looking for a knowledgeable and motivated individual with excellent communication skills, Paediatric experience is desirable.&lt;/p&gt;\n&lt;p&gt;The post would suit an enthusiastic and dynamic individual who can motivate, demonstrate and influence proficiency in the field of both Paediatric and Adult Resuscitation. The post requires a positive approach to change and the ability to engage, support and motivate others to give high quality care.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to lead and deliver training programmes in all aspects of resuscitation attend Cardiac Arrest calls and participate in the daily running of the resuscitation department and the wider education and Workforce Development Department.&lt;/p&gt;\n&lt;p&gt;In return we can offer the potential to further develop your resuscitation, clinical and leadership skills.&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for all essential and desirable criteria required for the role.&lt;/p&gt;\n&lt;p&gt;Full Time 37 Hours 30 Minutes/Week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Workforce Development Officer (Resuscitation Officer)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244686", "validThrough": "2020-11-09T23:59:59+0000"}