{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32691", "minValue": "32691", "unitText": "YEAR", "value": "£32,691 per annum"}}, "datePosted": "2020-11-06T13:31:19+0000", "description": "&lt;p&gt;We are a pioneering Trust, on an exciting journey of healthcare transformation, with award-winning research and innovation, and a strong team ethos. We’re looking for positive clinical leaders who want to help us deliver first-class patient care to a fascinating and complex population and be part of something special.&lt;/p&gt;\n&lt;p&gt;As you would expect from a large teaching Trust, we prize training doctors, nurses and other health professionals and we already work closely with local universities and King’s College, University of London. We now have the exciting new opportunity of working with Kent and Medway’s new Medical School, jointly provided by the University of Kent and Canterbury Christchurch University, which opens in September 2020.&lt;/p&gt;\n&lt;p&gt;The Trust has five hospitals providing a wide range of high quality services and opportunities for innovation. The William Harvey Hospital in Ashford has the full range of district general hospital services, as well as regional specialities, including the country’s best performing trauma unit. The Queen Elizabeth, The Queen Mother Hospital in Margate, also provides district general hospital services, while Kent &amp; Canterbury Hospital in Canterbury is a specialist services hub which provides adult medical care, inpatient renal, urology and vascular services and robotic surgery.&lt;/p&gt;\n&lt;p&gt;Our new hospital in Dover, the Buckland, and Royal Victoria Hospital, Folkestone, provide a variety of outpatient, diagnostic and minor injury services, alongside a range of services throughout the local area.&lt;/p&gt;\n&lt;p&gt;We have a clear clinically-led strategy to transform secondary care in east Kent to deliver outstanding standards across all specialties which build services around the characteristics of our patients and a commitment to refreshing our estate and facilities. We support clinicians who see opportunities to make tertiary care available locally for our population, and we have a strong research ethic as a high recruiter to research studies.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide ‘great healthcare from great people’, and we are proud of what we have achieved to date for our population and are excited about what’s to come. If you would like to be part of this exciting journey, your rewarding work-life will be complemented by the advantages of living in the Garden of England, with a choice of rural, seaside and picturesque places to enjoy and live in, alongside the essentials like excellent schools and easy access to London – and Europe.&lt;/p&gt;\n&lt;p&gt;In March 2018 the Government and Health Education England announced that a joint bid by Canterbury Christ Church University and the University of Kent to establish a medical school was successful.&lt;/p&gt;\n&lt;p&gt;The medical school opens its doors in September 2020, offering 100 undergraduate medical places on a yearly basis. The five year programme will be taught at the Canterbury campuses of both universities with medical placements within Primary, Community and Secondary Care across Kent and Medway.&lt;/p&gt;\n&lt;p&gt;The Kent &amp; Medway Medical School (KMMS) will be Kent and Medway’s first ever medical school, bringing together the existing centres of excellence in health and medical education provided by the two universities, and local healthcare organisations such as East Kent Hospitals University Foundation Trust. It will offer a new model of patient-focused medical education.&lt;/p&gt;\n&lt;p&gt;The KMMS will also play a key part of the solution to the challenges of recruiting and retaining medical professionals for this region. You will have the chance to be there at the start of what is expected to be an exciting and productive relationship and help to shape the Drs of the future.&lt;/p&gt;\n&lt;p&gt;One of the largest acute trusts in England, we have a predicted turnover of almost £600 million. We serve a population of 695,000 people in East Kent and over a million through our regional services, employ 7,950 staff and have 1,000 beds across three main hospital sites.&lt;/p&gt;\n&lt;p&gt;If you think this could be the start of something special, please apply as quickly as possible because we will close the advert for this job once we’ve received sufficient applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmber HowlettEmail addressamber.howlett@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Trust Doctor in Urology (FY2)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259930", "validThrough": "2020-11-20T23:59:59+0000"}