{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "up to £38,000 per annum DOE"}}, "datePosted": "2020-09-28T09:39:28+0100", "description": "&lt;h1&gt;&lt;strong&gt;Are you an inspiring team leader?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Registered Nurse (Mental Health) you’ll be an integral part of the healthcare team by bringing your top-notch clinical skills, passion for care and leadership to the role.&lt;br /&gt; &lt;br /&gt; As a member of the wider management team, your role as the Mental Health Clinical Lead will be responsible for providing the day to day clinical and operational management of the integrated mental health team, contributing to the strategic direction of the service. There will be an expectation for the post holder to lead/contribute to clinical and consumer audits. You&#39;ll be responsible to the Service Managers, to ensure the management of the service meets its contractual obligations.&lt;br /&gt; &lt;br /&gt; This includes ensuring all operational and clinical data requirements on the Key Performance Indicators (KPI’s) are submitted within agreed deadlines and that KPI data is utilised to manage the performance of the team and individual staff, taking proactive action in the case of clinical or financial under-performance.&lt;br /&gt; &lt;br /&gt; You’ll receive an annual salary of up to £38,000 - depending on experience; free DBS check, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt; &lt;br /&gt; As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays plus other benefits including cycle to work scheme and clinical development opportunities.&lt;br /&gt; &lt;br /&gt; This is a full-time, permanent role working 37.5 hours a week. There may be some on-call responsibility with this role although this will be discussed at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;How will we support you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;• Bespoke induction&lt;br /&gt; • Competency framework&lt;br /&gt; • Regular clinical supervision&lt;br /&gt; • Supported development into specialities such as CBT&lt;br /&gt; • Regional and national career development opportunities&lt;br /&gt; • Our bespoke Learning Management System to address your learning needs&lt;br /&gt; • Support from the wider team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn, will arrange an interview for you to attend at HMP Wayland if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;HMP Wayland is a Category C male training prison with a capacity for 1,017. Located near the village of Griston in Norfolk the site is built up of 13 residential units and has a full healthcare unit.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check, CTC clearance and prison vetting.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thetford", "postalCode": "IP25 6RL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5534", "longitude": ".861554"}}, "title": "Mental Health Clinical Lead - HMP Wayland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201983", "validThrough": "2020-11-15T23:59:59+0000"}