{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "£20,000 per annum"}}, "datePosted": "2020-11-06T16:28:30+0000", "description": "&lt;p&gt;&lt;span&gt;Do you have experience of working within a HR or recruitment environment? Are you looking for a new challenge within an innovative and driven internal recruitment team?  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently recruiting for a Recruitment Assistant based in Cheshire for a 12 month fixed term contract. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Recruitment Assistant you will receive a salary of £20,000 per annum, and you’ll benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Virgin Care’s Group Pension&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;25 days holiday plus Bank Holidays&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Laptop and Mobile enabling fantastic flexible working patterns that can help you lead a perfect work/life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;We will offer a combination of in house eLearning, workshops and courses to support your development&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Virgin Tribe – granting you access to premier offers and discounts which includes gyms, restaurants, experience days, high street stores and much more! &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to a central online health and lifestyle platform supporting you, your wellbeing and your physical and mental health&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;The chance to be a part of a forward thinking HR team, which have a great social calendar despite working remotely, great 1-2-1 dedicated time with your manager and a team that always encourage continuous development!&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working within our team as a Recruitment Assistant you will join us on a fixed term contract for 12 months. You will proactively support and manage vacancies to build strong pipelines and talent pools, administrate our central careers inbox and take calls on recruitment queries. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have HR or recruitment (internal or agency) experience and a passion for social media and apply that knowledge to managing and analysing our careers social media channels, whilst developing and creating content across Facebook, Twitter, LinkedIn and more! &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your role will currently be based working from home due to COVID-19 and we will provide full equipment to work remotely. We are looking for a candidate based in the North-West and commutable to Runcorn, Cheshire as your induction will be a blend of face to face and virtual.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, please contact &lt;span&gt;careers@virgincare.co.uk&lt;/span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We partner with the NHS to make a real difference for our service users and colleagues. It’s the kind of place where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Part of the Virgin Group, we’ve delivered services to millions of people since 2006 by developing our own unique approach where our service users are at the centre of everything we do. We do things differently, but we’re proud to be part of the NHS family – providing care that’s free at the point of use.&lt;br /&gt; &lt;br /&gt; We’re really privileged that Sir Richard Branson, who ultimately owns the organisation, has invested more than £60m into our partnerships with the NHS (over and above what we’re paid by them), helping us to make real changes and he has pledged to reinvest his future profits back into NHS services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Runcorn", "postalCode": "WA7 4QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3247", "longitude": "-2.7329"}}, "title": "Recruitment Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260607", "validThrough": "2020-11-20T23:59:59+0000"}