{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-10-26T16:06:17+0000", "description": "&lt;p&gt;Are you looking to become a Band 6 Community Mental Health Practitioner and work in a friendly and exciting environment? Then this is the job for you. Within this role you will work autonomously to provide flexible and individualised care packages to meet the mental health needs of military personnel with mental health problems.&lt;/p&gt;\n&lt;p&gt;Benefits to the role include free parking and access to a gym.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are two full time vacancies being advertised. Both are 37.5 hours each weekly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your primary duties will include but not be limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Receiving, appraising and advising on the direct referrals for mental health problems from relevant General Practitioners/Medical Officers (GP/MO).&lt;/li&gt;\n&lt;li&gt;Providing initial assessment and formulation of the mental health and treatment needs for referred patients, planning, implementing and evaluating care with a high level of autonomy.&lt;/li&gt;\n&lt;li&gt;Delivering up to date, evidence-based interventions for mental health problems based on guidance from the National Institute for Clinical Excellence (NICE) and the National Treatment Agency (NTA), which can include individual, group and tele-therapy.&lt;/li&gt;\n&lt;li&gt;Facilitating emergency patient assessment during daily working hours, as part of a rota, in order to prevent where possible unnecessary admissions to the Inpatient Service Provider (ISP).&lt;/li&gt;\n&lt;li&gt;Performing clinical risk assessments on all patients seen, evaluating the safety of the patient and others in the community and be able to manage/ advise on therapeutic risk taking.&lt;/li&gt;\n&lt;li&gt;Routinely provide advice and recommendations to GP/MO on all matters regarding mental health support, management, care and treatment, including ISP admission advice. Provide advice to GP/MO in relation to prescribing medication for mental health disorders.&lt;/li&gt;\n&lt;li&gt;Providing recommended clinical interventions and managerial guidance for a varied and often complex caseload of patients with mental health problems. Maintaining accurate and contemporaneous records and clinical notes of all patient contact. Provide clinical reports to GP/MOs and other relevant professional agencies after initial assessment, on discharge from caseload and where otherwise appropriate.&lt;/li&gt;\n&lt;li&gt;Supporting visits to medical centres in the DPHC Region as requested by the Clinical Lead / Department Manager where clinical need and facilities allow, balancing workload against patient need, ensuring effective management of clinical time.&lt;/li&gt;\n&lt;li&gt;Maintaining clinical liaison with ISP/ Service Liaison Officer (SLO) for service personnel from DCMH that have been admitted.&lt;/li&gt;\n&lt;li&gt;Initiating and participating in clinical supervision, case conferences/care meetings where mental health clinical input is required. Present patients seen to the MDT for guidance, support, supervision, training.&lt;/li&gt;\n&lt;li&gt;Communicating, where appropriate, on occupational information directly with service person’s Commanding Officer whilst respecting the principles of patient confidentiality (Caldicott).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Registered Mental Health Nurse or graduate level professional with background in mental health; substantial post-qualification training and experience in at least 2 evidence based psychological therapies and accredited or eligible for accreditation from a recognised body (BABCP,BACP, UKCP).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Technical Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK1 – Information Processing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Department of Community Mental Health Bulford Healthcare Facility, Kandy Road, Bulford SP4 9AA", "postalCode": "SP4 9AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1942", "longitude": "-1.73425"}}, "title": "Band 6 Community Mental Health Practitioner (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243314", "validThrough": "2020-12-01T23:59:59+0000"}