{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pr"}}, "datePosted": "2020-10-28T13:16:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Practitioners&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Anaesthetic Practitioners&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Operating Department Practitioners, Anaesthetic Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For this post you will be based at Poole Hospital &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Main Theatres &lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;University Hospitals Dorset are working to develop an expanded service for the Dorset community and wider areas. Poole is a great place to live and work where patient care and staff welfare are our top priorities. We are located in Poole town centre near the coast and New Forest. All this is on offer to any nursing and theatre practitioners making their next career move.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At this exciting time, are you what we are looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With the new management team in place and focus on quality, transformation and service development, we are increasing our operating theatre suite and are looking for motivated and passionate people, to join our expanding theatre department delivering a 24 hour service.&lt;/p&gt;\n&lt;p&gt;We offer great opportunities with an extensive educational program, to include the development of Surgical First Assistants (SFA), Assistant Theatre practitioners, nurse associates, leadership and management development to name but a few.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on our friendly working environment and our desire to lead on Best Practice in the Operating Theatre setting. If you have the knowledge, skills, experience and drive that we are looking for to join our friendly and supportive team, then Poole Hospital theatres is the place for you.&lt;/p&gt;\n&lt;p&gt;Working with multi professional colleagues, you will have experience in working in a operating theatre setting across different specialities specifically with an interest in anaesthetics, we undertake a wide variety on specialities – head and neck, gynaecology, orthopaedic trauma, obstetrics, general surgery, and recovery– and become a valued member of a core team. We encourage duel or multi skilled practitioners, however full training will be given to facilitate development. Your peers, Anaesthetists, surgeons and senior staff will support you to learn new skills and to expand your practice&lt;/p&gt;\n&lt;p&gt;You will be a:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Registered Nurse with a recognised anaesthetic course, or Registered Operating Department Practitioner who has recent experience across a range of different specialties and emergency theatres&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Newly Qualified&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 11/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: week commencing 23/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INFORMAL VISITS ARE MOST WELCOME AND ENCOURAGED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details or to arrange a visit please contact:&lt;/p&gt;\n&lt;p&gt;Clinical Team Manager Anaesthetics: Richard Perry&lt;/p&gt;\n&lt;p&gt;Email: richard.perry@uhd.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Theatre Practitioner - Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246741", "validThrough": "2020-11-11T23:59:59+0000"}