{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "Up to £36,500 FTE - DOE + Golden Hello"}}, "datePosted": "2020-10-20T17:46:12+0100", "description": "&lt;h2&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;HMP Winchester is a category B men’s prison for those on remand to local courts. With an operational capacity of 690, HMP Winchester is based in Winchester, Hampshire; by car it’s approximately 20 minutes from Eastleigh, 25 minutes from Southampton, 30 minutes of Andover, Basingstoke and Newbury and 45 minutes from Salisbury. On foot, it’s a 20 minute walk from Winchester town centre and 15 minutes’ walk from Winchester train station.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Winchester, we’re looking for a Substance Dependency Nurse to support us and the existing team in this new venture.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;You’ll receive an annual salary up to £36,500 FTE - depending on experience + 2 year Golden Hello (£2,000 in Year 1 of service and £1,500 in Year 2 of service - conditions apply). You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP Winchester include access to an onsite gym and free parking.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;&lt;/h2&gt;\n&lt;p&gt;As a Substance Misuse Nurse you will work as part of a multi-disciplinary team, whilst being a support and resource to other staff. You must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users.&lt;br /&gt;&lt;br /&gt;You will work with individuals, on a 1-1 basis, providing advice and information. You will support in group work delivery and liaise with prescribers and Recovery Practitioners on clinical interventions. You will be required to support dispensing and attend medical emergencies. You must have an understanding and commitment to recovery and a person centred approach. This is an exciting role to support and motivate individuals to take control of their lives and to make changes to overcome dependence on substances and move onto a life free of offending.&lt;br /&gt;&lt;br /&gt;You will also be working as part of a larger multi-disciplinary team, alongside the substance misuse and mental health teams. There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;br /&gt;&lt;br /&gt;If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;Amelia will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;For further information, please contact us on the details provided.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;This is a full-time role working 37.5 hours per week on a rota basis. The salary for this role is up to £36,500 FTE - dependent on experience.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO22 5DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0624", "longitude": "-1.32874"}}, "title": "Substance Misuse Nurse - HMP Winchester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235453", "validThrough": "2020-11-10T23:59:59+0000"}