{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-11-02T09:15:38+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for an expert project manager to help us engage frontline staff effectively, advise senior staff and provide project management support to deliver the integration of clinical services across the Weston and Bristol campus in the division of medicine.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;During a time of change, we are looking for an experienced Project Manager to provide some additional support to our clinical and operational management. The post holder will work with clinical services to develop and deliver full integration across all applicable medical services.&lt;/p&gt;\n&lt;p&gt;The role will require a level of autonomous working and responsibilities will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing programme and project management expertise and advice within the Division; acting as a subject matter expert in project management methodology&lt;/li&gt;\n&lt;li&gt;Facilitating clinical and operational teams in delivery of significant service integration&lt;/li&gt;\n&lt;li&gt;Engage with clinical and operational teams to develop project documentation, including business cases&lt;/li&gt;\n&lt;li&gt;Monitoring and managing delivery against projects, identifying where mitigating actions may be required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is vital that the successful candidate has a solid track record of project delivery, understands project management methodology and is confident in advising others on this subject. Ideally they will hold a formal project management qualification. They will use their expertise to work alongside clinical and operational colleagues with expert knowledge of clinical services, in order to form an effective team and deliver real service change for the benefit of service users and patients.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Sufi Husain , Deputy Divisional Director – Medicine on Sufi.Husain@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sufi Husain Deputy Divisional Director Sufi.Husain@uhbw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary/Weston, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251381", "validThrough": "2020-11-09T23:59:59+0000"}