{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T12:31:32+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for the position of Band 5 Senior Trauma and Orthopaedic Practitioner to join our dynamic and motivated team in the Queen Elizabeth, The Queen Mother Hospital in Margate, Kent.&lt;/p&gt;\n&lt;p&gt;We provide a Monday to Friday out patient and virtual fracture clinic service for adults and children following their admission to either the Emergency Department or Minor injuries unit. We also provide a service to our inpatient trauma wards and provide advice and support to the Emergency Department and operating theatres. We run a mixture of fracture and orthopaedic clinics during the week.&lt;/p&gt;\n&lt;p&gt;The Fracture clinic also provides specialist neck washing service to patients with cervical spine fractures. This service not only provides hygiene support to this group of patients but enables us to monitor patients skin and ensure the cervical collar in effective.&lt;/p&gt;\n&lt;p&gt;You may either be a Registered Nurse or an experienced plaster technician but you must hold the Stanmore plastering qualification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Louise Walker via email louisewalker7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth, The Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Senior Orthopaedic Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246607", "validThrough": "2020-11-11T23:59:59+0000"}