{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-30T11:00:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Opportunity to join Neonatal services ay UHCW NHS Trust, Coventry.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Coventry and Warwickshire (UHCW) is one of the newest and busiest NHS teaching Trusts in the country caring for over 1,000,000 people across Coventry, Warwickshire and beyond&lt;/p&gt;\n&lt;h2&gt;‘Our mission is to CARE, ACHIEVE and INNOVATE’&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;CARE&lt;/strong&gt; we strive to deliver the best care for our patients by improving quality of care, safety and patient experience throughout the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ACHIEVE&lt;/strong&gt; we seek to achieve excellence in education and training by supporting and inspiring the current and future workforce through our positive culture of achievement, education, training and development.&lt;/p&gt;\n&lt;p&gt;We uphold that a first class workforce is essential to create and maintain UHCW as a first class health care provider.&lt;/p&gt;\n&lt;p&gt;We provide excellent learning and development opportunities for all staff, so everyone can achieve their full potential.&lt;/p&gt;\n&lt;p&gt;We endeavor to endorse a working environment that promotes communication, equality and diversity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INNOVATE&lt;/strong&gt; we strive to lead in improving and innovating patient care driven by clinical leadership, championing research and collaborating with our partners and stakeholders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UHCW’S Level III Neonatal Unit&lt;/strong&gt; provides a wide range of services to sick newborn babies and forms part of the West Midlands Neonatal Operational Delivery Network . The unit strives to provides family centered care to a range of babies from those born extremely prematurely around 22 weeks gestation to term babies who are sick at birth. We offer therapies such as Nitric Oxide, Cooling and ROP laser surgery using state of the art, new equipment.&lt;/p&gt;\n&lt;p&gt;UHCW neonatal unit looks after up to 8 Intensive care cots, 9 High dependency cots, 14 Special care cots and 6 Transitional care cots. The unit has recently been accredited as the first level 3 Neonatal unit in the area as Baby Friendly by Unicef for the excellent practice in the support of infant feeding and parent-infant relationships. In our last CQC inspection (2018) UHCW was rated as good.&lt;/p&gt;\n&lt;p&gt;Over the years the unit has built an excellent reputation for high quality healthcare and outstanding career development. We support extended roles such as Transport Nurse, Neonatal Educational Practitioner, Advanced Neonatal Nurse Practitioner, Developmental Care Nurse &amp; Infant Feeding Nurse roles. We also encourage development onto UHCWi sessions and management courses to help you progress to your career. Our team of nurses help support parent resuscitation training, Sibling support sessions as well as monthly parent coffee mornings and ‘Graduate’ parties. We are proud to have a motivated team of UHCW change makers on the unit who are given time to drive communications between staff and higher management as well as promoting a social, nurturing environment for staff.&lt;/p&gt;\n&lt;p&gt;Due to investment in our service and internal promotions, we are looking for an experienced, motivated, innovative, dynamic and friendly band 7 Neonatal Co-Ordinator to join our expert team of clinical staff. You should be keen to be part of a forward looking team that is not afraid of change to progress and improve the family’s journey in neonates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have significant experience post specialist neonatal course in an intensive care environment and are interested in this exciting opportunity to join our enthusiastic multidisciplinary team then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We welcome informal visits or discussions to explore what we can offer you. To request an appointment please contact Andrea Davies, Rose Blake or Sara Wheatley on 02476966668 / 02476967316&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea DaviesJob titleNeonatal Unit ManagerEmail addressandrea.davies2@uhcw.nhs.ukTelephone number02476966668 / 02476967316&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Neonatal Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249849", "validThrough": "2020-11-13T23:59:59+0000"}