{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum."}}, "datePosted": "2020-10-29T09:46:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Director of Communications&lt;/strong&gt;&lt;strong&gt;, NHS, Bristol, £91,004 to £104,927 + excellent NHS benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A Director of Communications is required by one of the UK’s largest NHS Hospital Trusts. Based at Southmead Hospital with a basic of up to £104,927 + excellent NHS benefits the successful applicant will play a key role in taking the Trust to CQC rated as outstanding&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHY APPLY?&lt;/strong&gt; The Director of Communications is a critical role for our Trust and you will need to ensure all stakeholders are bought into increasing our current rating and are fully engaged as partners.&lt;/p&gt;\n&lt;p&gt;The impact of Covid-19 means that a very different conversation is needed to determine the strategic direction of the Trust and this role will be fundamental in ensuring these conversations take place.&lt;/p&gt;\n&lt;p&gt;The significance of these conversations will be particularly relevant in determining Acute service provision across Bristol and the wider area served by the city’s 2 acute Trusts, which also now includes The Nightingale Hospital, hosted by NBT on behalf of the Severn Network.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE ROLE:&lt;/strong&gt; As Director of Communications, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide outstanding support to our incoming Chief Executive in the next phases of our operational response to the Covid-19 pandemic, ensuring they quickly achieve visibility and credibility.&lt;/li&gt;\n&lt;li&gt;Champion the ways in which clinical and organisational collaboration can transform acute services and how patient voice should be at the forefront of any organisational change.&lt;/li&gt;\n&lt;li&gt;Provide first class strategic advice and insight to some of the highest profile transformation projects across the Trust and wider Bristol, North Somerset and South Gloucestershire (BNSSG) partners as the system moves towards an Integrated Care System.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU:&lt;/strong&gt; Candidates will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive experience at a senior level with a large-scale communications function including stakeholder engagement&lt;/li&gt;\n&lt;li&gt;A successful track record in dealing with large scale change&lt;/li&gt;\n&lt;li&gt;Confidence in handling press, radio and TV interviews on contentious subjects&lt;/li&gt;\n&lt;li&gt;Experience in implementation of large-scale organisation wide communication systems&lt;/li&gt;\n&lt;li&gt;Extensive experience of crisis preparedness and management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT US: &lt;/strong&gt;Why work here?&lt;/p&gt;\n&lt;p&gt;North Bristol NHS Trust is the largest hospital trust in the South West of England, providing hospital and community healthcare to the residents of Bristol, South Gloucestershire and North Somerset. We are also a specialist regional centre for a number of services including neurosurgery, renal (kidney) medicine, plastics, burns, orthopaedics and major trauma.&lt;/p&gt;\n&lt;p&gt;We employ over 8000 staff across multiple sites including our flagship 800 bed Brunel Building. Southmead Hospital is now one of the most technologically advanced in Europe, with robots conducting cancer surgery, 7 dispensing pharmacy medicines, transporting supplies, and analysing blood samples.&lt;/p&gt;\n&lt;p&gt;We provide high quality clinical services to our patients from both the local area and across the region. We want to be nationally recognised for our specialist services, leading regional provider networks and developing our services through a combination of clinical excellence, research and high quality training.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Provisional interview date: &lt;/strong&gt;&lt;/em&gt;Tuesday 1st December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Emily Davis&lt;/p&gt;\n&lt;p&gt;Job title: PA to the Director of People of Transformation&lt;/p&gt;\n&lt;p&gt;Email address: emily.davis@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0117 4143664&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Director of Communications", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247778", "validThrough": "2020-11-12T23:59:59+0000"}