{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-10-13T11:16:21+0100", "description": "&lt;p&gt;Kent Clinical Neuropsychology&lt;/p&gt;\n&lt;p&gt;We are currently looking for someone to join our Kent Clinical Neuropsychology Service for Stroke. This post is commissioned to work across the stroke care pathway, to meet the psychological needs of adult stroke survivors and their families within the Maidstone locality. The post is community based, working closely with colleagues in the Community Neurorehabilitation Team.&lt;/p&gt;\n&lt;p&gt;The post holder would be part of a county wide stroke psychology service which has been well established for almost a decade. It is integrated and managed within a wider Clinical Neuropsychology Service which provides neuropsychological assessment and rehabilitation to other neurological and neuropsychiatric populations.&lt;/p&gt;\n&lt;p&gt;The post will be based Avalon House Coxheath, Maidstone alongside a Consultant Clinical Psychologist.&lt;/p&gt;\n&lt;p&gt;The post would best suit a person with neuropsychology experience; however candidates with relevant or transferrable skills and newly qualified Clinical Psychologists are also invited to apply. The Kent Clinical Neuropsychology Service has a strong rehabilitation ethos and members of the service have interests in a range of different therapeutic approaches including acceptance and commitment therapy, mindfulness, CBT and systemic approaches.&lt;/p&gt;\n&lt;p&gt;All of our posts provide opportunities for continuing professional development, project working and peer support. We can sometimes provide opportunities to work within the wider neuropsychology service to help people extend their experience if they are interested to do this. Further sessions within the stroke service may also become available in the future. All members of the service receive regular clinical and management supervision. We have close and supportive links with the Salmons Centre for Applied Psychology and many of us are actively involved in teaching and research. For further details and discussion contact Catherine Mc Donagh Consultant Clinical Psychologist: Telephone 01732-228226&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To deliver an effective service it is essential that you are able to travel between sites in a timely manner.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If your application is successful, you will be notified by e-mail. Therefore, please ensure that you regularly check your NHS jobs account.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Contact Catherine Mc Donagh Consultant Clinical Psychologist: Telephone 01732 228226&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Avalon House, Coxheath, Maidstone, Maidstone", "postalCode": "ME17 4AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.232", "longitude": ".497974"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223983", "validThrough": "2020-11-09T23:59:59+0000"}