{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 £31365 - £37,890 pro rata"}}, "datePosted": "2020-10-29T15:16:16+0000", "description": "&lt;p&gt;Speech and Language therapist&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a qualified SLT to work 3 days a week in the NHS Children&#39;s Speech and Language Therapy School Service in Stockport.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be based at Kennedy Way, SK4 2JT at the Children&#39;s Therapy Base , and will work within the school team supporting assessment and planning for children of school age with speech language and communication needs.&lt;/p&gt;\n&lt;p&gt;You will be part of a team of very motivated and enthusiastic therapists serving the needs of the school aged children in the borough and work with partner agencies to meet needs.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be degree qualified and a member of the Royal College of Speech and Language therapist. He/she will also be registered with the HCPC.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have worked with children. He/she will have a good grasp of the the SEND Code of Practice. Excellent communication skills are essential, as is the ability to work both as part of a team and autonomously.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43. This cost will be deducted from your first Trust salary. &lt;strong&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise HirschJob titleSLT School Service LeadEmail addresscypdisp@nhs.netTelephone number0161 204 4153 / 4154Additional contact information&lt;/p&gt;\n&lt;p&gt;Louise Hirsch on 0161 204 4153 or louise.hirsch@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kennedy Way, Stockport", "postalCode": "SK4 2JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4126", "longitude": "-2.17572"}}, "title": "Children&#39;s School Service Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248835", "validThrough": "2020-11-07T23:59:59+0000"}