{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum"}}, "datePosted": "2020-11-05T08:15:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 3, Clinical Trials Assistant - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a motivated individual to work as a Clinical Trials Assistant at Stockport NHS Foundation Trust, based at Stepping Hill Hospital.&lt;/p&gt;\n&lt;p&gt;The post holder will assist the Research and Innovation (R&amp;I) team with all aspects of administration relating to clinical research, in accordance with Good Clinical Practice, Trust standard operating procedures and policies. They will be an integral part of the R&amp;I team providing administrative support across multiple clinical specialisms, under the supervision of the R&amp;I Coordinator and clinical research nursing team. They will provide support in daily research activity, reception duties, internal and external communications and assist with workload management of different clinical studies.&lt;/p&gt;\n&lt;p&gt;Applicants must have a good standard of education (minimum GSCE or equivalent, including English and Maths) and be able to demonstrate an awareness of the clinical trials process, data protection and patient confidentiality. Experience of administrative work including data management is essential with the ability to demonstrate good IT, organisational, interpersonal, oral and written communication skills.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerry HughesJob titleResearch &amp; Innovation CoordinatorEmail addressResearch.Development@stockport.nhs.ukTelephone number0161 419 5814Additional contact information&lt;/p&gt;\n&lt;p&gt;Please note: due a to COVID-19 Vaccination trial hosted by Stepping Hill &lt;strong&gt;all&lt;/strong&gt; calls to the 5814 number are currently directed to a answer machine. &lt;br /&gt;If you wish to discuss the vacancy please email Research.Development@stockport.nhs.uk for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Clinical Trials Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256918", "validThrough": "2020-11-12T23:59:59+0000"}