{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T17:45:22+0000", "description": "&lt;p&gt;Recruit to Train CAMHS Systemic Family Practitioner&lt;/p&gt;\n&lt;p&gt;This is a training post for Social Workers, Occupational Therapists and Registered Mental Health Nurses with post registration experience to work as a Mental Health Practitioner within our established CAMHS Teams, providing services for Children and Young People with Emotional and Mental Health problems. This post provides the opportunity to complete the Children and Young People Improving Access to Psychological Therapies (CYP-IAPT) training in Systemic Family Practice that is being run in collaboration with Manchester University.&lt;/p&gt;\n&lt;p&gt;The posts will be based within Community CAMHS South (Hopewood, Nottingham), Community CAMHS West (Lindsay Close, Mansfield) and Community CAMHS North (Newark and Langold Clinic). You will be able to express a preference for location at interview.&lt;/p&gt;\n&lt;p&gt;You would be working as a Systemic Family Practice Trainee Practitioner within one of the CAMHS community teams for the duration of the one year course and would split your time between training and carrying out clinical work.&lt;/p&gt;\n&lt;p&gt;After successful completion of the course your job will be converted to a Specialist Mental Health Practitioner Band 6 post and you may be based in any of our three Community CAMHS Teams across Nottinghamshire.&lt;/p&gt;\n&lt;p&gt;The successful applicants will work within CYP MH as part of a multi-disciplinary team delivering, under supervision, high-quality, outcome –informed, focused and evidence-based interventions for children and young people in accordance with the competency framework for their therapeutic modality.&lt;/p&gt;\n&lt;p&gt;Please note in this instance the course is not optional; there will be a joint interview process including Manchester University to appoint to this role. The roles are dependent on meeting all course requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants need to be able to start the Post Graduate training programme taught academic dates in March 2021 and commit to attendance at all university based taught and self-study days required by Manchester University. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work in the service for the remaining days of the week using your newly developed skills to ensure you gain the necessary clinical practice hours to fulfil the academic programme. This is 200 hours of modality and case specific practice for the full time courses.&lt;/p&gt;\n&lt;p&gt;Applicants must be willing to travel. A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 restrictions it is likely that a proportion of the training will be delivered remotely, and therefore you must have access to appropriate IT equipment to engage in online learning.&lt;/p&gt;\n&lt;p&gt;NOTE:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Applicants must have a relevant degree and a core profession.&lt;/li&gt;\n&lt;li&gt;Students cannot be accepted onto any training programme if they are currently undertaking studies elsewhere or registered with another university.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatalie TitchenerJob titleClinical Team LeadEmail addressnatalie.titchener@nottshc.nhs.ukTelephone number0115 8440500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community CAMHS, Nottinghamshire, Nottinghamshire", "postalCode": "NG5 3FL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9905", "longitude": "-1.14201"}}, "title": "Recruit to Train CAMHS Systemic Family Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247511", "validThrough": "2020-11-11T23:59:59+0000"}