{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55000", "minValue": "50000", "unitText": "YEAR", "value": "£50,000 - £55,000 Depending upon experience"}}, "datePosted": "2020-11-05T10:33:51+0000", "description": "&lt;p&gt;Priory Group is the leading healthcare provider for mental health services in the UK with an established track record of delivering high-quality clinical care.  The Priory Hospital Southampton is part of the  Priory Group offering outpatient, day care and inpatient treatment for a wide range of mental health difficulties.  The hospital is located in Marchwood on the outskirts of Southampton and comprises of 40 inpatient beds across three wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sandpiper Ward: This is an acute admissions unit comprising of 17 beds.&lt;/p&gt;\n&lt;p&gt;Skylark Ward: 11 bedded specialist eating disorder unit&lt;/p&gt;\n&lt;p&gt;Kingfisher Ward: 12 bedded CAMHS inpatient unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has a combination of employed and visiting consultants and well established multidisciplinary teams in all wards including nursing, therapy, occupational therapy and psychology input.&lt;/p&gt;\n&lt;p&gt;The hospital provides a combination of NHS funded and private care and has been rated &quot;Good&quot; in recent CQC inspection with &quot;Outstanding&quot; rating in the &quot;caring&quot; domain.&lt;/p&gt;\n&lt;p&gt;We are looking for a passionate, enthusiastic individual who is looking for the opportunity to work alongside likeminded people within the Senior Management Team.  The Director of Clinical Services is a pivotal role in ensuring high quality clinical care and robust clinical governance processes within the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working in close collaboration with Ward Managers, Medical Director and Hospital Director this role will be at the forefront of patient centred care working towards achieving an OUTSTANDING rating with CQC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will be responsible for assuring and improving the quality of care given to patients.  Using their own initiative and drawing on Priory and wider healthcare best practice the post-holder will lead on ensuring the hospital has the systems, knowledge and culture in place to deliver, consistently, care that is safe, effective, caring, responsive and well led.  The post-holder has a key role in representing the quality case to stakeholders including the wider Priory Group, CQC and NHSE. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In recognition of the importance of the role, the successful applicant will attend and report to Senior Management Team (SMT) meetings and must have:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• NMC (Nursing &amp; Midwifery Council registered)&lt;/p&gt;\n&lt;p&gt;• Have a minimum of 5 years frontline clinical or equivalent experience&lt;/p&gt;\n&lt;p&gt;• Have experience at ward manager level or equivalent preferred and clear experience or knowledge of the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• Have experience in Clinical Governance inspection planning and procedures, audit and reporting&lt;/p&gt;\n&lt;p&gt;• Be proficient in the sharing of clinical best practice from national bodies such as the National Institute for Clinical Excellence (NICE)&lt;/p&gt;\n&lt;p&gt;• Have the ability to harness the commitment and potential of others&lt;/p&gt;\n&lt;p&gt;•  Have excellent organisational capability&lt;/p&gt;\n&lt;p&gt;• Be forward thinking and able to challenge the status quo&lt;/p&gt;\n&lt;p&gt;• Be a role model &amp; mentor to other staff - providing advice and support to promote good practice in supervision and reporting&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioral care and specialist support services to adults and young people, Priory Group promises a challenging and fulfilling career with the support of a world-class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits:-&lt;/p&gt;\n&lt;p&gt;Our benefits are flexible and tailored to each individual staff member.  Some of the benefits we offer you include;&lt;/p&gt;\n&lt;p&gt;* A competitive salary&lt;/p&gt;\n&lt;p&gt;* Up to 25 days annual leave plus bank holidays&lt;/p&gt;\n&lt;p&gt;* Birthday leave&lt;/p&gt;\n&lt;p&gt;* Continuous Professional Development opportunities&lt;/p&gt;\n&lt;p&gt;* Pension scheme with a Priory contribution&lt;/p&gt;\n&lt;p&gt;* Your Priory, Your Benefits+ - Our shopping discount site where you&#39;ll find great offers for online and in-store shopping, negotiated specially for everyone who works at the Priory Group.&lt;/p&gt;\n&lt;p&gt;* Enhanced Maternity Pay in line with NHS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.883", "longitude": "-1.44604"}}, "title": "Director of Clinical Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257259", "validThrough": "2020-11-30T23:59:59+0000"}