{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-03T09:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;**Banding subject to confirmation of Agenda for Change evaluation**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced senior HR leader looking for your next challenge?&lt;/p&gt;\n&lt;p&gt;We are pleased to be recruiting a Senior Workforce Business Partner to play a key role in supporting the successful delivery of our People strategy, The post holder will take a corporate role in driving the HR/people agenda forward throughout the Trust, building key partnerships with our Executive and Senior management team in ensuring that the Trust is an employer of choice and adopting excellent employment practice.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the provision of strategical and specialist HR advice which impact across the organisation and so must be able to quickly build relationships with all stakeholders and apply your expert employee relations knowledge in the role. The Senior Workforce Business Partner is responsible for the provision of high quality strategic and operational HR leadership to ensure best practice people management within their areas of responsibility, across the wider HR function and across the Trust, they will also be design strategic lead on various Trust-wide workforce initiatives, programmes and pathways.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who have significant and successful senior HR leadership experience in a complex unionised environment subsequent to obtaining CIPD qualification. Candidates must have experience at a senior level in the NHS or relevant environment with proven track record of change management and have the ability to balance a multi-faceted workload with competing demands. The post holder will have contribute to organisational development within our corporate areas and will lead programmes designed to deliver culture change.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Senior Workforce Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253313", "validThrough": "2020-11-20T23:59:59+0000"}