{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-27T14:02:07+0000", "description": "&lt;p&gt;The Information Governance Service is looking to appoint an Information Governance CHC Business Partner to support the internal delivery of the Information Governance Service to our Continuing Healthcare service, as part of the wider programme of delivery to the CSU and CSU customers. We are looking for a delivery driven, forward thinking individual, with proven experience within an information governance role.&lt;/p&gt;\n&lt;p&gt;Reporting to the Deputy Head of Information Governance you will be responsible for providing specialist advice and guidance in relation to all aspects of Information Governance, whilst developing and implementing robust business processes, in relation to information governance, to ensure the CHC team meet their statutory and legal requirements.&lt;/p&gt;\n&lt;p&gt;In this role it will be critical for you to fully understand the business and proactively support your assigned customer areas by developing the culture and improving service quality and experience. In support of this you will have demonstrable proven experience of developing and maintaining successful relationships with key stakeholders.&lt;/p&gt;\n&lt;p&gt;Working closely with the wider team you will support the development and delivery of the Information Governance service for the entire CSU, ensuring that the services we deliver are value added, high quality and customer focused.&lt;/p&gt;\n&lt;p&gt;Who you’ll support:&lt;/p&gt;\n&lt;p&gt;The role is supporting the entire CSU, working from the following sites:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Jubilee House, Leyland&lt;/li&gt;\n&lt;li&gt;1829, Countess of Chester&lt;/li&gt;\n&lt;li&gt;Heron House, Stoke on Trent&lt;/li&gt;\n&lt;li&gt;Kingston House, West Bromwich&lt;/li&gt;\n&lt;li&gt;St Johns House, Leicester&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As such you will need to be able to travel across the entire foot print of the CSU, with the ability to travel to CCG customer areas if required. The base for this role can be flexible and therefore could be any of the stated bases above, based on the preference of the successful applicant. We have a well-established approach to agile working allowing our people to manage organisational demands whilst maintaining a good work life balance.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Emma Styles (Deputy Head of Information Governance) or Hayley Gidman (Head of Information Governance) via our Information Governance team at mlcsu.ig@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible, Flexible", "postalCode": "ST4 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9918", "longitude": "-2.16773"}}, "title": "Information Governance Business Partner (CHC)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244857", "validThrough": "2020-11-16T23:59:59+0000"}