{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34628", "minValue": "27936", "unitText": "YEAR", "value": "£27,936 to £34,628 per annum inc"}}, "datePosted": "2020-11-05T11:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Elective Trauma and Orthopaedic Nurse (Chestnut) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Chestnut ward is a 12 bedded elective trauma and orthopaedic ward, specialising in patients with musculoskeletal injuries and spinal injuries .&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated registered nurse with at least one years experience to join our already established team. Successful applicants will work within our team to provide a high quality and safe patient care environment for patients with a range of acute traumatic injuries.&lt;/p&gt;\n&lt;p&gt;Experience in the area of orthopaedics is desirable. All successful candidates will be mentored and will be supported in their position having the opportunity to further their academic career by being put forward for the orthopaedic and mentoring courses.You will be supported by the Practice Development Nurse and the Matron for Surgery.&lt;/p&gt;\n&lt;p&gt;The Care Quality Commission has recognised the significant improvements made at Whipps Cross in their latest visit and the 2018 Staff Survey results showed staff have seen many improvements in their working lives. With our passionate staff and commitment to safe and compassionate care, we know Whipps Cross will keep getting better and better. We’d love you to join us on our journey to good and outstanding. Come and be part of the Whipps Cross family where you can make a difference.&lt;/p&gt;\n&lt;p&gt;For further information please contact Rahul Luka rahul.luka@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross University Hospital, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Elective Trauma and Orthopaedic Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257354", "validThrough": "2020-12-03T23:59:59+0000"}