{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa - Plus £2500 Welcome Payment"}}, "datePosted": "2020-10-15T10:56:15+0100", "description": "&lt;p&gt;&lt;strong&gt;For this post we are offering all registered nurses an attractive employment package, including a welcome payment of £2,500 (paid in two instalments during year one) and £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package** In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be successful in this role, we want to hear from Leaders who really want to ‘make a difference’, with the Trust values at the core of patient care and who have previous experience of working within acutes, or are seeking to develop a career within acute inpatient care.&lt;/p&gt;\n&lt;p&gt;The post holder should be able to demonstrate excellent leadership skills with the ability to be able to assess and prioritise clinical situations. The management of effective communication between medical and nursing staff both verbal and written is a key element of this role.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for supporting the day to day management of the ward, monitoring and auditing ensuring the nursing team delivers high quality care to patients who access our service. In addition to this the candidate will be able to develop and create a culture that aspires to delivering best practice for individuals using our services and demonstrates effective communication and promotes a culture of transparency and equity.&lt;/p&gt;\n&lt;p&gt;Charlesworth Ward is the only female acute ward within the Lincolnshire Partnership NHS Foundation Trust which is AIMS accredited by the Royal College of Psychiatrists. The ward is for working age (18-65) who are experiencing acute mental health difficulties. Applications are invited from highly motivated and dynamic candidates with a “can do” attitude to deliver the Trusts Vision and Values and help to improve our patient experience within acute care services. This is an exciting and challenging role which will afford the successful candidate to work as part of a supportive team that is focused on delivering high standards of care through evidence based practice.&lt;/p&gt;\n&lt;p&gt;You will be joining a forward thinking Trust, where, within the last 12 months our CAMHS team was rated as ‘outstanding’ in a recent CQC Comprehensive Inspection, whilst the Trust was rated, as ‘good’ overall.&lt;/p&gt;\n&lt;p&gt;In return we can offer a wide range of enhanced benefits, including:&lt;br /&gt;•excellent career development with close working relationships with the University of Lincoln,&lt;br /&gt;•weekly clinical group supervision facilitated by our Consultant Psychologist,&lt;br /&gt;•regular management supervision and annual appraisal&lt;br /&gt;•free onsite parking,&lt;br /&gt;•childcare vouchers, cycle to work scheme,&lt;br /&gt;•early access to our staff wellbeing service, psychology therapies and occupational therapy services&lt;/p&gt;\n&lt;p&gt;We offer 24 hour services within our Inpatient, Crisis and SPA teams, if you are successfully appointed to posts in these areas or others that might have specified, you will be required to work unsociable hours and shift patterns.&lt;/p&gt;\n&lt;p&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/p&gt;\n&lt;p&gt;** Eligibility criteria applies, for more information contact Recruiting Manager.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peter Hodgkinson Centre, Greetwell Road, Lincoln.", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227811", "validThrough": "2020-11-15T23:59:59+0000"}