{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-02T12:31:48+0000", "description": "&lt;p&gt;Are you a registered nurse looking for a new challenge? If you are passionate about providing the highest standards of care to patients wanting to develop your skills and knowledge we would like to hear from you. We are looking for a hard working qualified nurse to deliver high quality care to our patients on ASU Billinge Ward.&lt;/p&gt;\n&lt;p&gt;The Acute Stroke Unit is a 22 patient ward with both male &amp; female patients. You will be caring for patients and their families after experiencing life changing illness following a stroke.&lt;/p&gt;\n&lt;p&gt;You will be helping the patient and their families through a rehabilitation process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of work are 37.5 Hours per week with shifts across 7 days. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Excellent communication skills and flexibility to meet the needs of the service are required. The successful candidate will enjoy full training and support from our experienced staff, all you need is a desire to learn, enthusiasm and a commitment to delivering an excellent service for our patients.&lt;/p&gt;\n&lt;p&gt;If you wish to be considered for this position please click apply now to complete an application form.&lt;/p&gt;\n&lt;p&gt;Throughout the application form, and particularly in the supporting information, please ensure you clearly demonstrate how you meet each of the criteria on the person specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will require you to work across all areas in the Trust which includes those that are designated as positive, asymptomatic and negative COVID wards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this vacancy may close before the advertised closing date if a sufficient number of suitable applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All candidates will be required to present their original certificates for qualifications to the interview panel.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For overseas candidates wishing to apply for the job role and require immigration sponsorship, you can self-assess the likelihood of obtaining a CoS for the post on the &lt;/em&gt;&lt;em&gt;GOV.UK website.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Paul Watterson - Matron&lt;/p&gt;\n&lt;p&gt;Email address paul.a.watterson@wwl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01942 822536&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Albert Edward Infirmary, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Staff Nurse - ASU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252075", "validThrough": "2020-11-16T23:59:59+0000"}