{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29602", "minValue": "29602", "unitText": "YEAR", "value": "£17.61 per hour"}}, "datePosted": "2020-10-27T08:16:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Why would you want to work for Staffing Solutions? We offer competitive pay, support with Revalidation, paid Trust training and excellent staffing levels!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for reliable, enthusiastic and dedicated registered general nurses who pride themselves on providing safe high-quality care to join our supportive and rewarding flexible staffing team.&lt;/p&gt;\n&lt;p&gt;We know how important your work life balance is and being able to work within an environment that supports this. By joining our flexible team, you can choose shifts that suit your lifestyle and enjoy the variety of working within our different Community Hospitals.&lt;/p&gt;\n&lt;p&gt;Oxford Health NHS Foundation trust has services at the following locations: Abingdon, Bicester, Didcot, Oxford City, Wallingford, and Witney.&lt;/p&gt;\n&lt;p&gt;You will possess excellent communication skills, a high sense of professionalism and a strong belief in the value of teamwork.&lt;/p&gt;\n&lt;p&gt;There is no doubt that the work can be challenging but hugely rewarding, here at Oxford Health it is a particularly fulfilling experience. We work hard to ensure high quality patient centred care is in place and that our staff are supported in their roles and encouraged to develop.&lt;/p&gt;\n&lt;p&gt;If you are passionate about making a difference to the lives of the people who use our services, and those who care for them and want to contribute to an organisation which is continuously striving to improve then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;In return we can offer you competitive pay rate of £17.61 per hour (£15.65 per hour plus 12.5% of annual leave) with the option of being paid weekly or monthly.&lt;/p&gt;\n&lt;p&gt;Please note: This post requires valid NMC Registration and Certificate of Preceptorship Completion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;FWrecruitment@oxfordhealth.nhs.uk &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Community Hospital, Oxford", "postalCode": "OX3 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.751", "longitude": "-1.21598"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243690", "validThrough": "2020-11-08T23:59:59+0000"}