{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £43,772"}}, "datePosted": "2020-10-30T14:00:51+0000", "description": "&lt;p&gt;An opportunity has arisen for a fourth Ward Manager on AMU, Fairfield General Hospital, Pennine Acute Hospitals NHS Trust due to expansion of the unit&lt;/p&gt;\n&lt;p&gt;AMU is a busy 24 hour service currently comprising 40 in-patient beds (increasing to a 60 bedded unit) and an Ambulatory Care Unit. The unit accepts patients presenting with acute medical conditions who require short term acute medical care and patients with ambulatory care conditions from the Emergency Department, and direct referrals from GP’s .&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, motivated individual who has worked at band 6 level or above to provide operational and clinical leadership within the unit setting. The role is vitally important in supporting an already established team of nurses through strong leadership, professional advice and clinical expertise enabling the best care, the best environment and best patient’s experience whilst delivering the Trust’s quality agenda.&lt;/p&gt;\n&lt;p&gt;This is a demanding post that requires a positive approach towards change and the ability to engage and motivate a team of nurses.&lt;/p&gt;\n&lt;p&gt;You must have a proven ability in supervising, managing and controlling the activities of a unit in an effective and efficient manner. You must have the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RGN registration with demonstrated experience&lt;/li&gt;\n&lt;li&gt;Proven managerial/leadership skills at band 6 level or above&lt;/li&gt;\n&lt;li&gt;Knowledge and experience in looking after people with medical conditions&lt;/li&gt;\n&lt;li&gt;Health related degree or willingness to work towards&lt;/li&gt;\n&lt;li&gt;Excellent standards of care and a positive attitude to managing people&lt;/li&gt;\n&lt;li&gt;Ability to communicate and work collaboratively within a wide range of disciplines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Adele Hughes&lt;/p&gt;\n&lt;p&gt;Job title Lead Nurse&lt;/p&gt;\n&lt;p&gt;Email address adele.hughes@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 778 2591&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury &amp; Rochdale Care Organisation, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Ward / Unit Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250459", "validThrough": "2020-11-15T23:59:59+0000"}