{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T16:16:26+0000", "description": "&lt;p&gt;We have a rare opportunity for a Specialist Speech and Language Therapist at University Hospital Southampton NHS Foundation Trust (UHS) who is passionate about providing a high quality and responsive service to our elderly and frail inpatients (part time applicants would be considered). This role includes leading on SLT and MDT initiatives within MOP , as well as supervising and supporting less experienced staff working in this area.&lt;/p&gt;\n&lt;p&gt;You will be working as in a dynamic and busy pool of speech therapists that offer a prioritised and responsive service to cover to our wide range of acute wards and regional specialist units. There will be numerous opportunities to advocate for older and frail patients, as well as represent the SLT service. Whilst being innovative in your approach to treatment and service delivery you will be part of MDT working groups and service development initiatives.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;We take pride in being a tertiary centre, providing highly specialised treatment for our patients who have complex needs as well as undertaking instrumental assessments as a crucial part of the management of dysphagia. This post offers a wide range of opportunities to be able to develop your knowledge and professional skills. As a high performing team we have nationally recognised clinicians and have ‘advanced clinical practitioners’ in FEES and VF. There are career and academic pathways and research opportunities. As part of the SLT team you would have access to senior therapists for daily support and regular, scheduled, clinical supervision which is considered an essential part of your ongoing development&lt;/p&gt;\n&lt;p&gt;We are a department that is responsive, dynamic and flexible and we are always challenging ourselves and others to ensure we are meeting individual patient needs in the most efficient and evidence based way. The whole Trust encourages innovation and quality improvements and all staff have the opportunity to be involved in projects, audits and clinical effectiveness schemes. As part of this initiative we have recently developed a virtual learning dysphagia awareness training module. With our close links with Southampton University this is a stimulating environment to work in. For example, we have been able to support academic development such as short-term internships, post-graduate courses and clinical academic careers&lt;/p&gt;\n&lt;p&gt;WHAT YOU&#39;LL DO&lt;/p&gt;\n&lt;p&gt;SLT at UHS is recognised as an essential part of the collaborative MDT working approach and environment that provides a quality and timely service to acute patients,&lt;br /&gt;You would be required to:&lt;br /&gt;• Complete daily patient data&lt;br /&gt;• Work closely with MDT colleagues in the planning and delivery of clinical services and initiatives&lt;br /&gt;• Liaise closely with relatives and carers and provide relevant support with an individual’s communication and swallowing function.&lt;br /&gt;• Design and implement swallow and communication rehabilitation programmes&lt;br /&gt;• Contribute to capacity assessments, decisions and ‘best interest meetings’&lt;br /&gt;• Measure and present clinical outcomes and activity data&lt;br /&gt;• Collect and act on patient and carer feedback&lt;br /&gt;• Support less experienced colleagues , as well as be responsible for Reading University student placements&lt;br /&gt;• Contribute to audits and specific projects &lt;br /&gt;• Provide training to ward staff and MDT colleagues.&lt;/p&gt;\n&lt;p&gt;For an individual who is motivated to improve the care to older patients , this post offers the perfect combination of specialist clinical skills, team leadership and project development for this clinical area and so there will be endless development opportunities.&lt;/p&gt;\n&lt;p&gt;WHAT WE&#39;RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;Individuals who:&lt;br /&gt;• Are passionate and compassionate about working with acute elderly patients and their families&lt;br /&gt;• Have proven knowledge and expertise in managing complex elderly patients with multiple conditions&lt;br /&gt;• Who can motivate a team and colleagues to ensure best practice and service provision&lt;br /&gt;• Who have wide experience in the assessment and management of acute patients presenting with both communication and swallowing difficulties&lt;br /&gt;• Are keen to provide education and training to others within the SLT and wider MDT teams &lt;br /&gt;• Thrive on working in a busy, dynamic and constantly changing environment.&lt;br /&gt;• Value and actively contributes to an MDT culture&lt;br /&gt;• Genuinely want to make a difference!&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability. &lt;br /&gt; &lt;br /&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Thursday, 19 November 2020&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we would really encourage you to get in touch and arrange to visit, so you can meet the MDT team and experience the dynamic environment and patient care first hand. Feel free to use the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Anne Blamey&lt;br /&gt;&lt;br /&gt;Adult SLT&lt;br /&gt;&lt;br /&gt;Anne.Blamey@uhs.nhs.uk&lt;br /&gt;&lt;br /&gt;02381206454&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Sanet de Wet&lt;/p&gt;\n&lt;p&gt;Dietetic Leads&lt;/p&gt;\n&lt;p&gt;Sanet.DeWet@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Specialist  Speech and language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243358", "validThrough": "2020-11-09T23:59:59+0000"}