{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary plus Benefits"}}, "datePosted": "2020-10-06T14:14:21+0100", "description": "&lt;p&gt;BMI Beaumont Hospital in Bolton is part of BMI Healthcare, Britain&#39;s leading provider of independent healthcare with a nationwide network of hospitals &amp; clinics, performing more complex surgery than any other private healthcare provider in the country. &lt;/p&gt;\n&lt;p&gt;We have an opportunity for a Clinical Services Manager to join their team of staff in the Outpatients department.&lt;/p&gt;\n&lt;p&gt;This is a Full time role for 37.5 hours a week. The role holder will be required to cover a flexible shift pattern.&lt;/p&gt;\n&lt;p&gt;Applicants should meet the following criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Evidence of relevant professional development, both clinically, managerially, preferably evidenced by certification RN with valid NMC Registration.&lt;/li&gt;\n&lt;li&gt;Registered Nurse Level 1 / Diploma / BSc in Nursing Studies.&lt;/li&gt;\n&lt;li&gt;Robust understanding of Clinical Governance requirements for the area.&lt;/li&gt;\n&lt;li&gt;Up-to-date knowledge in area of practice.&lt;/li&gt;\n&lt;li&gt;Awareness of NMC Code of Accountability.&lt;/li&gt;\n&lt;li&gt;Recruitment and selection skills.&lt;/li&gt;\n&lt;li&gt;Maths, English GCSE at grades A to C or equivalent functional skills level 2 evidence.&lt;/li&gt;\n&lt;li&gt;Proficient in the use of a PC, including the use of software and systems.&lt;/li&gt;\n&lt;li&gt;Extensive experience working in an acute hospital setting in a Senior Registered Nurse post or equivalent.&lt;/li&gt;\n&lt;li&gt;Previous experience within a Clinical Lead role.&lt;/li&gt;\n&lt;li&gt;Previous experience in pre-assessment and outpatient departments.&lt;/li&gt;\n&lt;li&gt;Experience of customer care, including interacting with challenging customers and situations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Duties of this role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To strategically plan the clinical services, responsible for day to day organisation and management of clinical departments. Providing clear direction and leadership to all clinical staff, whilst supporting the initiatives of the hospital. Taking responsibility to lead the department under the direction of the Director of Clinical Services. &lt;/li&gt;\n&lt;li&gt;Responsible for the deployment, supervision and teaching of staff within the clinical area supporting the hospital management team in providing clinical leadership.  The role is responsible for development, motivation and performance of all clinical staff, ensuring the achievement of CQC Standards as required for nursing services in an acute care hospital accepting planned and emergency surgical and medical admissions.&lt;/li&gt;\n&lt;li&gt;Maintenance of professional, cost-effective department service including financial management and business planning.&lt;/li&gt;\n&lt;li&gt;To work clinical as required, with a minimum of one clinical shift per week.&lt;/li&gt;\n&lt;li&gt;Achievement of labour management target, nursing costs KPI and weekly completion of staff utilisation spreadsheets.&lt;/li&gt;\n&lt;li&gt;To ensure the provision of individualised patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further detailed information on the responsibilities and accountabilities of this vacancy please refer to the job description.&lt;/p&gt;\n&lt;p&gt;Salary &amp; Benefits:&lt;/p&gt;\n&lt;p&gt;BMI Healthcare have committed to being a national living wage employer and offer a competitive starting salary alongside access to a wide range of employee benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BMI Healthcare Private Medical Insurance&lt;/li&gt;\n&lt;li&gt;BMI Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 days holiday per annum increasing up to 30 days with long service&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity, Paternity &amp; Adoption Leave&lt;/li&gt;\n&lt;li&gt;Market leading learning and development, including free courses and industry recognised qualifications&lt;/li&gt;\n&lt;li&gt;Nationwide Gym discounts &amp; Online Fitness Classes&lt;/li&gt;\n&lt;li&gt;BMI Staff Health Checks&lt;/li&gt;\n&lt;li&gt;Blue Light Discount Card for 1,000s of nationwide discounts and exclusive offers&lt;/li&gt;\n&lt;li&gt;Cycle to Work – and much more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interested?&lt;/p&gt;\n&lt;p&gt;For more information on this role or for an informal chat please contact Isobel Kearney on 01204404404  &lt;/p&gt;\n&lt;p&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory Enhanced Disclosure Check&lt;/p&gt;\n&lt;p&gt;Disability Confident – Committed Employer:&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed Employer BMI we endeavour to ensure that disabled people and those with long term health conditions have the opportunities to fulfil their potential and realise their aspirations within BMI. If you require reasonable adjustments for your application, interview or during your onboarding/induction process BMI will support you. For more information on the Government’s Disability Confident Employer Scheme, please click here&lt;/p&gt;\n&lt;p&gt;Safeguarding&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton", "postalCode": "BL6 4LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5815", "longitude": "-2.4993"}}, "title": "Clinical Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214975", "validThrough": "2020-11-08T23:59:59+0000"}