{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 PA inc. HCAS"}}, "datePosted": "2020-10-27T12:16:25+0000", "description": "&lt;p&gt;Medicines Optimisation Pharmacist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is a 2 year fixed term contract.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a change within the pharmacy world? Perhaps a move from secondary care but still wanting to work as a clinical pharmacist and help patients&#39; with their medicines? If yes, this could be the post for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Central London Community Healthcare (CLCH) NHS Trust are looking to recruit a dynamic and innovative pharmacist to join the Medicines Management Team for an exciting post as a Medicines Optimisation Pharmacist working predominantely within the Wandsworth Primary Care Network (PCN) for 4 days a week in the borough of Wandsworth. For the remaining 1 day a week, you will work as part of the wider medicines management team within CLCH. Key components of the post include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working as part of a PCN as a Medicines Optimisation Pharmacist, providing specialist expertise in the use of medicines whilst supporting to address both public health and social care needs of patients within the PCN. Pharmacist will be involved in conducting structured medication reviews for patients with polypharmacy, long term conditions or high risk patients ensuring an integrated approach to the management of medicines. This may involve conducting clinical medication reviews in the clinic setting,patients&#39; homes, care homes or via telephone consultations and acting as a source of pharmaceutical expertise to various health and social care professionals e.g. GPs, hospital clinicians, district nurses, carers, families, community pharmacists and care coordinators. They will also be involved in supporting practices with audits and meeting medicines related QOF targets. Continuous evaluation of the service will also be key to demonstrate value and areas for further development.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Medicines Optimisation Pharmacist will also provide leadership on streamlining services e.g medicines audits, policies, training from the GP practice level across the PCN to support collaborative working and address unwarranted variation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust wide Medicines Management Service Provision including policy development, implementation of patient safety initiatives e.g. drug alerts, patient safety alerts, training for health professionals in the community across the trust and PCN. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post will predominantly be working in Wandsworth with the CLCH base at Parsons Green and will involve lone-working and travelling between sites. The postholder may also be required to travel to other sites and services within the organisation so will require flexibility as the organisation continues to grow. A car would be useful for travelling in outer London or outside of London but is not essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The postholder must have post registration experience in hospital pharmacy and a postgraduate qualification to at least diploma level as well as independent prescribing qualification or currently working towards completion of this. Previous experience in community health services or primary care is desirable. A sound knowledge of prescribing and medicines management issues faced in both primary and secondary care is essential with excellent decision-making and problem solving skills. Additionally, compassion, flexibility, excellent communication and time management skills are essential and the ability to build relationships with various health and social care professionals e.g. GPs, hospital clinicians, district nurses, carers, family, community pharmacists and care coordinators.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Previous unsuccessful applicants need not apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parsons Green Health Centre, London", "postalCode": "SW6 4UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4738", "longitude": "-.199117"}}, "title": "Medicines Optimisation Pharmacist- Primary Care Network", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244425", "validThrough": "2020-11-09T23:59:59+0000"}