{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-02T12:02:30+0000", "description": "&lt;p&gt;UNITY are seeking to recruit a full time Band 4 Recovery Coach to join the West Cumbria team in Allerdale and Copland. The role may involve travel across North Cumbria.&lt;/p&gt;\n&lt;p&gt;The position is temporary for up to 12 months to cover the existing post holders maternity leave, therefore a secondment will be considered if you can demonstrate that learning from this specialist service will be taken back to your current employer.&lt;/p&gt;\n&lt;p&gt;Unity offers inspirational care and supported recovery for people living with substance misuse problems across Cumbria. From those showing early signs of substance dependence to those who have lived with addiction for years. We are passionate about people and we aim to provide the best and safest care to our service users and support our staff.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic individual at Band 4 level to make a difference to the lives of those people experiencing substance misuse problems.&lt;/p&gt;\n&lt;p&gt;You will carry out a range of duties to support people towards their own recovery, carrying out assessments, organising and running group work programmes, and general support with running of the service. Signposting/ support to access other agencies including Mutual Aid and Recovery Networks. Preparing people for detoxification/post-detoxification.&lt;/p&gt;\n&lt;p&gt;The post holder will have experience of working with individuals in a health or social care setting (including working with vulnerable/socially excluded individuals or groups,) along with high positive regard for people who experience problems with substance use. You will have a long term commitment in promoting and assisting people in their recovery. These are among the essential qualities we are looking for in the successful candidate for this post. The right candidate would be expected to make good use of opportunities for training, supervision and reflective practice.&lt;/p&gt;\n&lt;p&gt;Please read this in conjunction with the Job description and Personal specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLinzi ButterworthJob titleTeam LeaderEmail addresslinzi.butterworth@gmmh.nhs.ukTelephone number07789558770Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Benson&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;emma.benson@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;0161 358 3753&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Allerdale and Copeland, Whithaven/Workington", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Recovery Coach", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251974", "validThrough": "2020-11-13T23:59:59+0000"}