{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-06T15:16:44+0000", "description": "&lt;p&gt;&lt;strong&gt;A unique &lt;/strong&gt;&lt;strong&gt;opportunity has arisen within Bristol Royal Hospital for Children for a Haematology, Oncology and &lt;/strong&gt;&lt;strong&gt;Haemopoietic&lt;/strong&gt;&lt;strong&gt; Stem Cell Transplant Service Co-ordinator.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Paediatric Haematology and Oncology service at University Hospitals Bristol and Weston NHS Foundation Trust is responsible for delivering care to children and young people with benign and malignant disease from across the South West, and additionally for performing Haemopoietic Stem Cell Transplant (HSCT) for benign, malignant and metabolic conditions from further afield (South Wales, Northern Ireland, Oxford, Southampton and Cambridge). HSCT is the procedure of giving a patient either their own or donated stem cells, following intensive chemotherapy and / or radiotherapy. Inpatient chemotherapy and HSCT is delivered on two wards within Bristol Royal Hospital for Children: Starlight Ward and Apollo 35.&lt;/p&gt;\n&lt;p&gt;The Service Co-ordinator plays a pivotal role within these specialties, responsible for the detailed task of co-ordinating and scheduling HSCT and working closely with the clinical team to enable the department to run efficiently and effectively.&lt;/p&gt;\n&lt;p&gt;This interesting post will involve coordinating the pre-HSCT patient and donor pathways to ensure that treatment proceeds as planned. This will be achieved in conjunction with a number of services provided by NHS Blood and Transplant: Apheresis collection, Stem Cell Immunotherapy (SCI) and Histocompatibility and Immunogenetics (H &amp; I). The post-holder will also liaise with the Anthony Nolan Bone Marrow Donor Registry, who co-ordinate unrelated donor services both in the UK and internationally. Additionally, the role will involve organising, monitoring and communicating the scheduling of planned patient admissions, regular communication with shared care centres and organisation of proton beam therapy.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills, confidence to work autonomously and an ability to work with Trust IT systems are essential. The successful candidate will be a dynamic and self-motivated individual with the ability to work on their own initiative, and the enthusiasm to drive the service forward.&lt;/p&gt;\n&lt;p&gt;This is a 1.0 WTE maternity leave cover post, fixed term until February 2022 with a possibility of extension until March 2022.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerry BullockJob titleQuality ManagerEmail addressKerry.Bullock@UHBW.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Kerry Bullock, Quality Manager. Kerry.Bullock@UHBW.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Hospital for Children, Bristol", "postalCode": "BS2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4578", "longitude": "-2.5973"}}, "title": "Paediatric Haematology, Oncology and HSCT Service Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260335", "validThrough": "2020-11-22T23:59:59+0000"}