{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-06T13:13:40+0000", "description": "&lt;p&gt;&lt;strong&gt;The Rotherham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in Dermatology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Consultant Dermatologist at The Rotherham NHS Foundation Trust (TRFT). This will be a substantive position and full or part-time working will be considered.&lt;/p&gt;\n&lt;p&gt;The Dermatology Department at The Rotherham NHS Foundation Trust has a well established and highly performing team treating a broad range of dermatological conditions including skin cancer. The successful applicant will join 2 Locum Consultants, Associate Specialist, a team of Specialty Doctors, 2 Nurse Consultants, Matron, a group of Nurse Specialists, Department Manager and the nursing team to complement, strengthen and help further develop the service. This is a full-time (10 PA) replacement post.&lt;/p&gt;\n&lt;p&gt;We have close links with the Sheffield Teaching Hospitals NHS Trust as our regional tertiary referral centre. There are opportunities to pursue honorary academic positions with the University of Sheffield.&lt;/p&gt;\n&lt;p&gt;The Rotherham NHS Foundation Trust is a busy modern hospital with an excellent standard of care. We have excellent transport links, being near to the M1 and M18 as well as Robin Hood and East Midlands international airports. The Hospital is located close to the Peak District National Park.&lt;/p&gt;\n&lt;p&gt;The appointee will possess full GMC registration at the time of interview.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the department. For further information or to arrange a visit please contact Mrs Sandra Lawton, Interim Clinical Lead, 01709 424960 or email Operational &amp; Performance Manager Emma Danks:emma.danks2@nhs.net&lt;/p&gt;\n&lt;p&gt;Alternately for general enquiries please contact Medical and Dental Recruitment:&lt;/p&gt;\n&lt;p&gt;Abigail Fairhurst - Medical and Dental Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Abigail.fairhurst@nhs.net or 01709424089&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant in Dermatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259841", "validThrough": "2020-12-06T23:59:59+0000"}