{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-05T13:15:57+0000", "description": "&lt;p&gt;Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;A truly exciting opportunity has arisen for a team of enthusiastic pharmacy staff with a desire to work within a brand new pharmacy outpatient service ‘RM Medicines’ to provide best quality of care and leading edge treatments to patients with cancer.&lt;/p&gt;\n&lt;p&gt;RM Medicines has been set up by the Royal Marsden NHS Foundation Trust, as a separate entity to provide outpatient pharmacy services, focussed on ensuring efficient and safe supply of medicines to their patients. The Royal Marsden is a specialist cancer hospital and together with its principal academic partner, the Institute of Cancer Research they are ranked in the top five cancer centres in the world for the impact of their research. It is a centre of excellence with an international reputation for ground-breaking research and pioneering the very latest in cancer treatments and technologies, as well as specialising in cancer diagnosis and education.&lt;/p&gt;\n&lt;p&gt;Forming RM Medicines allows the exciting introduction of significant benefits to our patients, for example, the provision of direct support to ‘care closer to home’ treatments, delivery of oral chemotherapy to patients at home and will provide the platform for a cohesive and responsive pharmacy service across the Royal Marsden.&lt;/p&gt;\n&lt;p&gt;Individuals recruited to the RM Medicines team will be supported to provide expert care to oncology patients and will benefit from training and the learning experiences of working closely with an institute providing outstanding, leading‑edge treatment to cancer patients.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for individuals who are passionate about improving the lives of patients with cancer and have a background in pharmacy either as a registered pharmacy professional or are keen to work in a pharmacy team. Together with the Royal Marsden Team, the pharmacy team at RM Medicines will review existing processes for medicines supply to continually ensure the patient has the best experience.&lt;/p&gt;\n&lt;p&gt;The Royal Marsden operates from two centres, in Chelsea and Sutton, and we also have a Medical Daycare Unit at Kingston Hospital.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit 1 x full time Pharmacy Technician for RM Medicines Outpatient Services on our Sutton site.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Kulpna Daya, Deputy Governance Lead &amp; Education &amp; Development Technician, kulpna.daya@rmh.nhs.uk, 020 7352 8171 Ext: 1970&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "RM Medicines Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257818", "validThrough": "2020-11-26T23:59:59+0000"}