{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-27T17:00:20+0000", "description": "&lt;p&gt;“Substantive full-time post for a RN – Adult or Mental Health.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to be part of the Gloucestershire Clinical Commissioning Group (CCG) within the NHS Continuing Healthcare (CHC) Clinical Team. We are seeking to recruit  an experienced Band 6 Registered Nurse (either Adult or Mental Health) with an understanding of the continuing healthcare process to undertake comprehensive nursing assessments and determining the level of care required within the National Framework for NHS Continuing Healthcare and NHS Funded Nursing Care. The post will also support CHC assessments within the Discharge to Assess pathway (D2A).&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative, forward-thinking, enthusiastic and confident nurse to be part of the NHS CHC team. You will be an expert practitioner familiar in working with multidisciplinary teams and conducting robust assessments and reviews with knowledge and experience of working with the National Framework for Continuing Healthcare and Funded Nursing Care (revised 2018) and any associated guidance.&lt;/p&gt;\n&lt;p&gt;You are required to hold a full UK driving licence and have access to a car to assess individuals across the county of Gloucestershire and occasionally out of county. You will be part of a transforming service, focussed on continuous improvement to ensure we are a high performing team, working productively to ensure robust and timely decision making for service users.&lt;/p&gt;\n&lt;p&gt;Closing date 08/11/2020&lt;/p&gt;\n&lt;p&gt;Shortlisting 09/11/2020&lt;/p&gt;\n&lt;p&gt;Interview date tbc (likely w/c 16/11/2020)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128636.png", "name": "Gloucestershire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL3 4FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8485", "longitude": "-2.17476"}}, "title": "NHS Continuing Healthcare Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245502", "validThrough": "2020-11-08T23:59:59+0000"}