{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-16T11:01:26+0100", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 7 Superintendent Radiographer&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; The Rotherham NHS FT – Rotherham Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; MRI Radiology&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35290&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, working in a location with all the benefits of country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available in the Radiography Department at The Princess Alexandra Hospital NHS Trust specifically aiding in the MRI Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Princess Alexandra Hospital NHS Trust provides a full range of general acute, outpatient and diagnostic services at The Princess Alexandra Hospital in Harlow, the Herts and Essex Hospital in Bishop’s Stortford, and St Margaret’s Hospital in Epping.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The trust employ 3,500 staff and serve a local population of around 350,000 people living in west Essex and east Hertfordshire, centred on the M11 corridor and the towns of Harlow, Bishop’s Stortford and Epping. Their catchment area incorporates a population of up to 500,000 and includes the areas of Hoddesdon, Cheshunt and Broxbourne in Hertfordshire.&lt;/p&gt;\n&lt;p&gt;In October 2019, the Government announced that the truest are to receive funding to rebuild a new hospital in Harlow for our patients, community and people.&lt;/p&gt;\n&lt;p&gt;The details around the funding and the timeframe are currently being finalised and we are completing our business case for the new hospital. We are continuing to develop the essential business case plans to take this amazing change forward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The MRI Department Superintendent Radiographer provides credible leadership, operational management and technical expertise for the MRI service to the Trust. They will allocate the staff supplied on a daily basis and maintain a service provision for the MRI Department, Outpatient clinics and wards. They ensure that MRI works with the Emergency Department to ensure that urgent referrals are scanned within national timeframes. They will contribute to service planning, advising on best practice and innovation to ensure continued development and improvement of the service. They undertake training of qualified and student Radiographers in MRI by leading by example. They will be responsible for maintaining a high standard of images produced by the MRI department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsabilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Daily organisation of staff allocated to MRI&lt;br /&gt; Matching workload to staff ability and areas of competency&lt;br /&gt; Monitoring performance standards of expensive equipment and bearing responsibility&lt;br /&gt;for organisation of repairs/replacements when necessary.&lt;br /&gt; Advising on and participating in procurement of new equipment&lt;br /&gt; Development of all MRI Radiographers by performing annual appraisals when required&lt;br /&gt; Participating in complaints handling and investigation for the MRI Department team, where appropriate.&lt;br /&gt; Teaching and Supervision of qualified staff&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Aaron Higgs, Recruitment Consultant on 0333 014 4370 or Aaron.Higgs&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham Hospital", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Band 7 Superintendent Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229796", "validThrough": "2020-12-28T23:59:59+0000"}