{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-02T10:45:21+0000", "description": "&lt;p&gt;An exciting opportunity exists to join the Trust’s risk management team. The post will allow the successful candidate to join the team, learn the key areas of work and to contribute to the Trust’s work to keep patients safe.&lt;/p&gt;\n&lt;p&gt;The Risk Management Team is based at the Trust Headquarters, although there will be a need to work from other locations, depending on the needs of the service.&lt;/p&gt;\n&lt;p&gt;The main areas of work for the Risk Management Team are focused around the arrangements for reporting and management of incidents &amp; risks, management of serious incidents, administration of meetings and development &amp; review of policies.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a suitable person to learn the key work areas of the Trust’s Risk Management team, on successful completion of this the post will become a full time employee of the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a great package with inclusion in the following benefits to name but a few:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;NHS Pension Scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Up to 6 weeks annual leave with the opportunity to purchase an additional 4 weeks annual leave &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Access to a Staff Health &amp; Wellbeing Hub which offers advice, support and schemes including Occupational Health services which include self-referral access to medical assessment facilities, Physiotherapy and a Counselling Helpline service which can be accessed 24 hours a day, 7 days a week &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Staff Salary Sacrifice Scheme including a Childcare Vouchers Scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A to Z list of staff benefits and discounts &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Opportunities to join our Staff Champions and Staff Engagement Group&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Optional Annual Health Checks, Flu Vaccines and Healthy Lifestyle Initiatives&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Special leave provisions, including some over and above statutory entitlements&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options to help staff achieve a work/life balance&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure that you read the Job Description which also includes the person specification before applying for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal chat or further information regarding this post please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the advertised post requires a DBS check the successful candidate will incur the cost of the DBS check which will be taken in three equal monthly instalments from salary.&lt;/p&gt;\n&lt;p&gt;We advise that you complete and submit your application form as soon as possible, because should we experience a high level of interest in the post it may be closed early.&lt;/p&gt;\n&lt;p&gt;Any applicant who applies for a position online will be contacted thereafter using the email address provided upon login. Please ensure that after application you check your emails often to ensure that you do not miss any communications from Bridgewater Community Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bridgewater is an equal opportunities employer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value and respect the diversity of our employees and aim to recruit a workforce that reflects our local communities, we therefore welcome applications from everyone with the necessary attributes for the job, irrespective of age, disability, gender/gender identity, sexual orientation, ethnicity, religious belief or other personal circumstance. We are committed to improving the working lives of our employees and we have an active flexible working policy and welcome applications for job share and flexible working. An interview is guaranteed to any applicant with a disability who meets the essential criteria of the person specification. If you require any reasonable adjustments to the application process please contact the Recruiting Manager for this post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Bridgewater Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121090"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 7TY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4164", "longitude": "-2.62843"}}, "title": "Apprentice Risk Management Admin", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251632", "validThrough": "2020-11-22T23:59:59+0000"}