{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "Starting salary from £24,907 per annum pro rata"}}, "datePosted": "2020-10-30T11:46:17+0000", "description": "&lt;p&gt;Colchester Hospital has an exciting opportunity for enthusiastic Operating Department Practitioners or Registered Nurses to join our caring, supportive, and compassionate team. This position is ideal for individuals who are passionate about their profession and committed to delivering high-quality patient focused care.&lt;/p&gt;\n&lt;p&gt;Based at Colchester Hospital, you will work within the theatre suites comprising of 17 days case and inpatient theatres, including dedicated emergency and trauma theatres and two obstetric theatres. One of the inpatient theatres is a hybrid vascular theatre used for vascular and interventional radiological procedures, a new state of the art robotic system for abdominal and pelvic surgery and three theatres are integrated for Laparoscopic use. You will receive excellent in-house training to support all areas of working across Anaesthetics and Surgery, including to cover all cardiac and trauma calls, and out of hospital transfers for critically ill patients.&lt;/p&gt;\n&lt;p&gt;This exciting position offers opportunity for ongoing professional development to practice and advance your theatre knowledge and skills beyond your current boundaries of practice to become a multi-skilled Theatre practitioner. You will also have opportunities to receive in-house continued clinical skills training and interpersonal skills workshops. We aim to have a multi-skilled workforce with skills in anaesthetics and scrub.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The surgical division have developed opportunities to train as a Surgical Care Practitioner across the various surgical specialities and Physician’s Assistant in Anaesthesia within the Anaesthetic &amp; Technical Services Division. A wide range of CPD modules at BSc and MSc Levels prospects are also possible from our strong links with Anglia Ruskin University, the University of Suffolk, and the University of Essex.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The trust offers a range of benefits, including paid annual leave, occupational sick pay, NHS pension and a range of staff discounts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Wendy Hobbs or Karen Briton, Theatres Education Lead and Clinical Lead , Wendy.Hobbs@esneft.nhs.ukor Karen.Briton@esneft.nhs.uk,01206 746031&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester Hospital", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250018", "validThrough": "2020-11-15T23:59:59+0000"}