{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T16:15:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Band 6 Occupational Therapist - Bank&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Royal Papworth Hospital NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Professional Support Services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£31,365 - £37,890 per annum pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Bank - Flexible&lt;/p&gt;\n&lt;p&gt;Are you an occupational therapist looking for a new challenge to develop your clinical expertise, within a world-renowned cardio-thoracic hospital? We have an exciting opportunity for an experienced and motivated occupational therapist to join our innovative team.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic clinician; recent clinical experience in neurology/stroke would be an advantage. You will be providing comprehensive assessment and treatment to the following patient demographics:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cardiac surgery&lt;/li&gt;\n&lt;li&gt;Thoracic surgery&lt;/li&gt;\n&lt;li&gt;Cardiology&lt;/li&gt;\n&lt;li&gt;Transplant&lt;/li&gt;\n&lt;li&gt;Thoracic medicine&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be provided with the opportunity to develop your clinical, leadership and service development skills. You will also be provided with regular supervision, appraisal and have the opportunity to develop your use of evidence based practice.&lt;/p&gt;\n&lt;p&gt;You will be joining a friendly team who are forward thinking and place an emphasis on team working. In April 2019 we moved to our brand new hospital on the Cambridge Biomedical Campus. The state-of-the-art, 310 bed building has virtually 100% single occupancy rooms.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Our Trust&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Royal Papworth Hospital is one of the largest specialist cardiothoracic (heart and lung) hospitals in Europe and includes the country&#39;s main heart and lung transplant centre. Over the last three years, it has performed the highest number of heart surgery procedures in the UK whilst achieving the country’s lowest cardiac surgery mortality rate.&lt;/p&gt;\n&lt;p&gt;The Hospital has an extraordinary commitment to delivering the highest levels of clinical quality and providing the best possible standards of personalised care to its patients.&lt;/p&gt;\n&lt;p&gt;Papworth Hospital has been named as a top healthcare employer and one of the top 40 places to work based on the results of a staff survey by the Health Service Journal and Nursing Times, supported by the Department of Health and NHS Employers.&lt;/p&gt;\n&lt;p&gt;Papworth Hospital was the first NHS hospital in England to receive a joint Investors in People and NHS Health and Wellbeing Award for looking after the health and wellbeing of its staff and continues to retain this award.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits to you&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a range of benefits including; a subsidised restaurant, support with child care vouchers and an NHS nursery, an NHS pension scheme, use of the hospital gym and corporate membership at a leisure club and travel to work options.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in joining our team or require further information please contact :&lt;/p&gt;\n&lt;p&gt;Amy Chadwick, Team Lead Occupational Therapist on 01223639113or email amy.chadwick3@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: &lt;/strong&gt;19/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;25/11/2019&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254734", "validThrough": "2020-11-19T23:59:59+0000"}