{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "145000", "minValue": "145000", "unitText": "YEAR", "value": "Up to £145,000 per annum plus relocation"}}, "datePosted": "2020-11-04T16:01:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Group Chief Digital &amp; Information Officer (CDIO)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Up to £145,000 per annum plus relocation&lt;/p&gt;\n&lt;p&gt;On 1st July 2020, Kettering General Hospital NHS Foundation Trust (KGH) and Northampton General Hospital NHS Trust (NGH) established a group model to develop greater collaboration between the two hospitals in the further delivery of high quality, patient focussed clinical services supported by pooled corporate resources to enable better outcomes for local people.&lt;/p&gt;\n&lt;p&gt;The county’s population, already diverse and widespread population at c750,000 people, is one of the most rapidly growing in England. Collectively, the two hospitals have 1,440 beds, revenue budget of over £500m and approximately 10,000 staff. Moving to a group model but retaining the existing boards, will enable KGH and NGH to integrate their clinical services whilst developing innovate approaches to streamlining pathways, with a clear focus on doing the right thing for patients every time. Working together, they will also design more effective ways in which corporate support services are provided, including the establishment of a new shared corporate services hub that will harmonise processes across the two organisations.&lt;/p&gt;\n&lt;p&gt;The group has ambitions to become a university hospitals group, and with major capital investment approved by the Secretary of State, is now planning to reshape the estate and its technology assets to rival many of the most modern acute care facilities at a scale that will attract the best available talent in the market.&lt;/p&gt;\n&lt;p&gt;With a number of group roles now in place, we are now seeking to appoint a Group CDIO to develop and deliver our Group Digital Strategy. This is a Board level appointment and the post holder will be an Executive member of the Board of Directors at each Trust and report to the Group Chief Executive Officer.&lt;/p&gt;\n&lt;p&gt;The key responsibility of the CDIO role is to ensure that the Trust has a cohesive, engaging and deliverable digital strategy that reflects the values of both Trusts and the needs of patients. The group CDIO will lead our digital and information technology transformation across both sites to create a strong, values-based culture which is vital to the success of our new organisation.&lt;/p&gt;\n&lt;p&gt;We need a kind, compassionate and inclusive leader who will make great things happen in each Trust and bring people together and with them on our ambitious group journey. For this role, we’re looking for someone with substantial Board or senior management level business transformation and technical experience in large complex organisations (in or outside the NHS) leading on digital, IT and information services. Experience of working with agile methodologies will be an advantage.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you have any queries on any aspect of the appointment process, need additional information or wish to have an informal and confidential discussion, please contact our advising consultants Veredus:&lt;/p&gt;\n&lt;p&gt;Nick Cole&lt;/p&gt;\n&lt;p&gt;07736 491 804 or nick.cole@veredus.co.uk&lt;/p&gt;\n&lt;p&gt;Reece D’Alanno&lt;/p&gt;\n&lt;p&gt;07711 779 022 or reece.d’alanno@veredus.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 12pm on 20th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews to be held: 15th December&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Group Chief Digital &amp; Information Officer (CDIO)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256545", "validThrough": "2020-11-20T23:59:59+0000"}