{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "(£31,365 - £37,890 per annum)"}}, "datePosted": "2020-10-29T10:02:05+0000", "description": "&lt;p&gt;Urgent Care Nurse (primary role Rapid Response nurse, NIghts) Band 6&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen due to unforeseen circumstances for a band 6 Urgent Care Practitioner to support patients in our Urgent Care Lounge overnight for a period of 6 months (fixed term contract) .&lt;/p&gt;\n&lt;p&gt;We are looking for a “can help” person to help us develop a flexible response to individuals who are either presenting urgent mental health needs or at risk of their mental health deteriorating to the point of crisis, by offering specialist intervention.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a nurse who can demonstrate competence in risk assessment of individuals presenting in crisis toward formulating clear and safe plans that support a person’s presenting needs to be managed in the least restrictive environment. The role provides response to a range of referrers including healthcare professionals, other statutory services including the police and third sector organisations. The team has access to an Urgent Care Lounge where individuals can await assessment and/or onward plans to be put into place.&lt;/p&gt;\n&lt;p&gt;This role works closely with and supports the work of other Urgent Care Teams based in same department (Crisis Resolution and Home Treatment Team, Street Triage and Mental Health Liaison Team) to provide an alternative to Emergency Department attendance and hospital admission. To provide a dedicated space where individuals referred to the service can be supported whilst awaiting assessment and/or whilst arrangements are put in place for onward care. In exceptional circumstances patients may remain in the lounge for longer periods. Staff will pay attention to maximising privacy, dignity and personal comfort.&lt;/p&gt;\n&lt;p&gt;The appointed candidate will be required to work at night within a rota, supported by a Senior Nurse Practitioner. It is not anticipated at this time that there will be a requirement to work day shifts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Geraldine Beal&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: geraldine.beal@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01323 438279&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne District General Hospital, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Urgent Care Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247824", "validThrough": "2020-11-12T23:59:59+0000"}