{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "AFC"}}, "datePosted": "2020-10-27T10:02:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurses, King’s Critical Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time 37.5&lt;/strong&gt; hours/week&lt;/p&gt;\n&lt;p&gt;King’s College Hospital NHS Foundation Trust (King’s) is one of the largest organisations in the UK. We are the busiest Major Trauma and Critical Care service provider in the capital with a well-established national and international reputation for clinical excellence, innovation, achievements and patient outcomes.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, knowledgeable and motivated nurses to provide outstanding clinical nursing care within the Critical Care department which is the busiest and one of the largest in the UK and Europe treating over 3000 patients each year. We offer multi-speciality exposure across our Critical Care units, we are part of the South London Adult Critical Care Network (SLACCN) and key providers within the South East London Kent and Medway Major Trauma Network (SELKaM). This is an exciting opportunity to be part of our dedicated Critical Care workforce in a prestigious Trust where we are motivated by innovation, the desire to make a difference and our passion for patient centred care.&lt;/p&gt;\n&lt;p&gt;If you have a caring and compassionate approach to your work and patients, and want to join a motivated, friendly and supportive team, we are keen to hear from you. Requirements for application include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registration&lt;/li&gt;\n&lt;li&gt;6 months post qualification experience within an acute clinical setting&lt;/li&gt;\n&lt;li&gt;Desire to succeed in a busy, challenging and exciting environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your commitment and hard work, the units actively encourage your education &amp; development. A dedicated Critical Care education team provides Band 5 nurses with a structured and proven development programme, supporting individuals gain the required skills and knowledge to become excellent Critical Care nurses. This comprehensive educational package includes the opportunity to undertake the Intensive Care course at King’s College London, and gain academic credits towards a BSc or MSc pathway.&lt;/p&gt;\n&lt;p&gt;King’s is part of King’s Health Partners Academic Health Sciences Centre (AHSC), a pioneering collaboration between King’s College London, Guy’s and St Thomas’, King’s College Hospital and South London and Maudsley NHS Foundation Trust. As one of only five accredited Academic Health Science Centres (AHSC) in the country, King’s faces exciting challenges as it develops to bring together an unrivalled range and depth of clinical and research expertise to improve patient care and outcomes.&lt;/p&gt;\n&lt;p&gt;To discuss this further you can call us on 0333 577 3398 or apply today and a member of the recruitment team will be in touch to follow up your enquiry.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chandini Meka&lt;/p&gt;\n&lt;p&gt;0333 577 3398&lt;/p&gt;\n&lt;p&gt;chandini.meka@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings College Hospital, Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Staff Nurse-Intensive Care/Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243940", "validThrough": "2020-11-08T23:59:59+0000"}