{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-13T14:57:25+0100", "description": "&lt;p&gt;&lt;strong&gt;FIXED TERM 18 MONTHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Brief Description of the Role: &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, collaborative and highly organised researcher, with experience in conducting high quality, health-related qualitative and quantitative research to join our team. The successful applicant will work on a study funded by the NIHR Health Service and Delivery: Covid-19 Recovery and Learning scheme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With guidance from the Principal Investigator and work-package leads and support from other research staff, a staff and patient panel, the successful candidate will take a lead role in the design and delivery of a programme of work entitled&lt;strong&gt; Lessons from the frontline:&lt;/strong&gt; &lt;strong&gt;The impact of redeployment during Covid-19 on nurse well-being, engagement and retention&lt;/strong&gt;. This programme will be delivered within our national NIHR funded Yorkshire and Humber Patient Safety Translational Research Centre.&lt;/p&gt;\n&lt;p&gt;The appointee will work creatively and collaboratively with the team, and manage a Research Fellow, to deliver the programme of work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The overall aim of this programme of work is to address the question: What is the impact of redeployment during Covid-19 on nurse well-being, engagement and retention? There will be a particular focus on nurses from Black, Asian and Minority Ethnic (BAME) groups. To achieve the aim we will undertake two work-packages to address the following research questions:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WP1&lt;/strong&gt;: How was the process of redeploying nursing staff managed prior to and during the Covid-19 crisis?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Method: Interviews with 30 senior staff (across 3 NHS Trusts) responsible for decision making about how, where and when staff were redeployed and what support was provided to these staff and how their return to previous teams was managed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WP2:&lt;/strong&gt; What were the emotional and performative challenges for redeployed nurses and how didthey adapt to and cope with their changing of roles during the Covid-19 crisis?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Method: Questionnaires and follow up interviews with a sample of frontline staff at each Trust. We plan to recruit 60 staff in total (20 from each site) and follow them up at 3 points in time.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;The successful candidate will join our wider research network: the Yorkshire Quality and Safety Research Group (YQSR group). This is a dynamic group comprising researchers and leading academics from the Universities of Leeds, York and Bradford teamed with clinicians and managers across the region, UK and internationally which conducts high quality, rigorous and applied researchwith a real impact on the way health services are delivered. Over more than a decade the YQSR group has established a national and international reputation for working collaboratively across institutions and disciplines to address key, clinically relevant questions in patient safety.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Located on the Bradford Royal Infirmary site, the team has real and lasting research relationships with both local and national clinicians. The group is housed withinthe new Wolfson Centre for Applied Health Research, part ofthe Bradford Institute for Health Research, with easy transport links to elsewhere in the region.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are very interested in receiving applications from members of Black, Asian and Minority Ethnic groups, who are currently under-represented within the YQSR group. We would be happy to discuss the role further with anyone who is interested in the post and/or the work of the research group. Please contact:Professor Rebecca Lawton r.j.lawton@leeds.ac.uk or Dr Jenni Murray jenni.murray@bthft.nhs.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can offer staff gymnasiums on both hospital sites, excellent pension scheme and advice on childcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 06.11.20 (This date may change dependent on the response)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 18.11.20&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120952.JPG", "name": "Bradford Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120952"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradforde", "postalCode": "BD9 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8059", "longitude": "-1.79488"}}, "title": "Senior Research Fellow - 18 months", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224773", "validThrough": "2020-11-06T23:59:59+0000"}