{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "50000", "unitText": "YEAR", "value": "Up to £50,000 - DOE"}}, "datePosted": "2020-10-26T10:27:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an inspiring team leader?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;HMP Bullingdon operates as a local prison holding both remanded and sentenced prisoners. It has a dedicated healthcare unit, specialising in supporting patients with complex medical requirements, mental health issues and primary care needs. Healthcare is provided 24/7, including first and second reception screening for new arrivals, triage and phlebotomy and vaccination clinics. Long term condition clinics are a core clinical activity. The roles are varied, involving assessing and treating patients and carrying out effective care in an ever changing environment; responding to both their physical and mental well-being needs including substance dependency. Our team includes GP’s, Clinical Leads, Nurses and HCA’s; emergency care is supported by our paramedic and all our clinical staff are trained to deliver intermediate life support (ILS). Pharmacy is managed by our pharmacist and supported by technicians and assistants.&lt;br /&gt;&lt;br /&gt;HMP Bullingdon is located 10 minutes from Bicester, 30 minutes from Aylesbury, Oxford and Banbury, and 40 minutes from High Wycombe.&lt;br /&gt;&lt;br /&gt;To ensure the continued quality of care at HMP Bullingdon, we’re looking for a Mental Health and ISMS Clinical Lead to join our team.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;In return for your hard work you will...&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Receive an annual salary of up to £50,000 - depending on experience, pro rota. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;br /&gt;Onsite benefits at HMP Bullingdon include access to an onsite gym, free parking and subsidised café/restaurant.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;A bit about the role..&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;As a Registered Nurse (Mental Health) you’ll be an integral part of the healthcare team by bringing your top-notch clinical skills, passion for care and inspiring leadership to the role.&lt;br /&gt;&lt;br /&gt;As a member of the wider management team, your role as the Mental Health &amp; ISMS Clinical Lead will be responsible for providing the day to day clinical and operational management of the integrated mental health and ISMS teams, contributing to the strategic direction and development of the service. There will be an expectation for you to lead/contribute to clinical and consumer audits. You&#39;ll be responsible to the Head of Healthcare, to ensure the management of the service meets its contractual obligations.&lt;br /&gt;&lt;br /&gt;This includes ensuring all operational and clinical data requirements on the Key Performance Indicators (KPI’s) are submitted within agreed deadlines and that KPI data is utilised to manage the performance of the team and individual staff, taking proactive action in the case of clinical or financial under-performance. As well as supporting and developing junior members of your nursing teams and driving forwards the quality of mental health and ISMS at HMP Bullingdon.&lt;br /&gt;&lt;br /&gt;There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;For further information, please contact us on the details provided.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;This is a full-time role working 37.5 hours per week. The salary for this role is up to £50,000 - dependent on experience.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Mental Health &amp; ISMS Clinical Manager - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242010", "validThrough": "2020-11-08T23:59:59+0000"}