{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-04T16:04:30+0000", "description": "&lt;p&gt;Do you want to work in a friendly, committed and established service where your knowledge, experience and skills will be valued? &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you are a Consultant Psychiatrist with an interest in rehabilitation or forensic psychiatry and are looking for a new full or part time opportunity, then join our team at either Victoria Gardens in Huyton or Arbury Court in Warrington.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The position can be based at either the locked rehabilitation service at Victoria Gardens, Huyton, Merseyside or in the female secure service at Arbury Court, Warrington, Cheshire – depending on your experience and interests. &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will join an established team of experienced, friendly and supportive consultant colleagues with an excellent CPD programme and peer-group. &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be working with an established multi-professional team delivering individualised care and treatment of patients with severe and complex mental disorders.   &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Each service is close to the major urban centres of Liverpool and Manchester with good public transport links, two major airports and excellent schools and amenities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;When you work for Elysium Healthcare, you have access to a large and supportive peer group of like-minded professionals – there are currently 18 consultants in the Elysium Northwest who meet regularly. You will be supported with your appraisal and&lt;/p&gt;\n&lt;p&gt;revalidation, and will receive regular clinical and managerial supervision. &lt;em&gt;There is an on-call element to this role (currently 1 in 13). &lt;/em&gt;&lt;em&gt;Part-Time applications will be considered.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;br /&gt;• Competitive salary&lt;br /&gt;• Private medical cover&lt;br /&gt;• Car allowance or lease vehicle &lt;br /&gt;• The equivalent of 30 days annual leave (or pro-rata) – plus your birthday off!&lt;br /&gt;• Free meals whilst on duty&lt;br /&gt;• Wellbeing support and activities&lt;br /&gt;• Career development and training&lt;br /&gt;• Pension contribution&lt;br /&gt;• Life Assurance&lt;br /&gt;• Enhanced Maternity Package &lt;/p&gt;\n&lt;p&gt;There are also a range of other benefits including retail discounts and special offers, holiday financing and much more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huyton / Warrington", "postalCode": "L36"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4135", "longitude": "-2.8411"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256559", "validThrough": "2020-12-04T23:59:59+0000"}