{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-21T13:18:42+0100", "description": "&lt;p&gt;Applications are invited for a Speciality Doctor within the East Assessment &amp; Treatment Service, based at the East Brighton Community Mental Health Centre, Brighton General Hospital.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership NHS Foundation Trust was formed in April 2006 and provides mental health, learning disability and substance misuse services to the people of Brighton and Hove, East Sussex and West Sussex. We are part of a wider network of health and social care and are working in partnership with our staff, volunteers, education and other agencies. Close links are established with Brighton and Sussex Medical School, and there is a Sussex wide training scheme in Psychiatry. The Trust is divided into the localities of East Sussex, Brighton and Hove, and West Sussex.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for an enthusiastic and skilled Speciality Doctor to join a vibrant, dynamic, and professional adult mental health service in Brighton and Hove. The team caseload reflects the full spectrum of mental illness in adult mental health across the city and we subscribe to the core values of collaborative and compassionate treatment using best evidence practice. You will be a key member of the multidisciplinary team, and you are expected to embrace new ways of working in your clinical practice.&lt;/p&gt;\n&lt;p&gt;This post is for 10 sessions and you will provide outpatient appointments, attendance at case conferences, CPA, and Section 117 reviews as required. There are no mandatory out of hours commitments and you will have the opportunity to attend a regular academic programme. You will receive regular supervision from the Consultant Psychiatrist, and there will be opportunities for training and development.&lt;/p&gt;\n&lt;p&gt;This post represents an excellent opportunity to gain experience and develop clinical skills in community psychiatry and to develop leadership management, psychotherapy, research and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebekah FisherJob titleService ManagerEmail addressRebekah.fisher@sussexpartnership.nhs.ukTelephone number07391 017259&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Brighton Community Mental Health Centre, Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Specialty Doctor, East Assessment &amp; Treatment Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236599", "validThrough": "2020-11-10T23:59:59+0000"}