{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-06T11:34:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Staff Nurse – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Cotswolds View Ward, North Cotswolds Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £24,907 to £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An opportunity has arisen for highly motivated individuals to join our Community Hospital Nursing Team at the North Cotswolds Hospital. We are looking for nurses with passion and commitment who hold patient experience and care at the heart of their nursing practice and share our organisational values. All of this will feature largely in our short-listing and selection criteria. In return we will offer you day to day support along with excellent training and a real commitment to your personal development plan with opportunities for continued professional development and study.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ideally you will be an experienced Registered Nurse. However, if you are newly qualified you will have plenty of opportunity to learn new skills and further your career here at Gloucestershire Health and Care NHS Foundation Trust. We would also welcome applications from Registered Mental Health Nurses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a newly qualified, you will be assigned a mentor. This person will help you find your feet, show you how we work and ensure you are able to perform your job to the best of your ability as a Community Hospital Nurse. If you join us, you will notice quickly that professional development and a preceptorship programme is high on the agenda.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For the more experienced nurse, we will support you in your clinical and managerial development to become a more autonomous practitioner, by providing access to academic programs such as ‘Physical Assessment and Clinical Reasoning’. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Cotswolds Hospital is a purpose-built hospital on the outskirts of Moreton-in-Marsh and is close to borders with Oxfordshire, Warwickshire and Worcestershire, providing 22 inpatient beds delivering sub-acute care, re-habilitation and end of life care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You see what makes us unique, apart from being based in beautiful Gloucestershire, is that we’re also one of the first Trusts to offer a truly integrated service. What that means is our nurses work holistically with Occupational Therapists, Social Workers and Physiotherapists, as part of a multi-disciplinary team to deliver the highest quality care to our patients. It means our patients and their families are given all the solutions available to them under one umbrella service. As a predominantly nurse led ward this means you will have greater autonomy and ultimately gain more job satisfaction by giving the best patient service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion or to arrange to visit the ward please contact Senior Sister Denise Gillett on 0300 421 8822 / 8823 / 8824 / 8825.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moreton-in-Marsh", "postalCode": "GL56 0DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9841", "longitude": "-1.70564"}}, "title": "Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259455", "validThrough": "2020-11-29T23:59:59+0000"}