{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T12:46:03+0000", "description": "&lt;p&gt;The Oxford University Hospitals NHS Trust is one of the most respected Trusts in the country. This is your opportunity to join one of our foremost clinical services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Oxford Neurosciences Department is acknowledged globally for its excellence in clinical research, treatment and patient care, and this is a particularly exciting time for neuroscience nursing. We are reconfiguring our inpatient service provision and creating four brand new wards, and as such we are looking to add to both our Neurology and Neurosurgery nursing teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We provide care for patients suffering from a number of conditions and who undergo a wide range of invasive and interventional procedures, for example craniotomy for brain tumours, haemorrhage or trauma, implantation of deep brain stimulators and spinal surgery. We also have a surgical short stay and investigation unit which accommodates patients having radiological investigations or minor procedures such as lumbar punctures and muscle biopsies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to learn, develop or extend your existing skills in this fascinating specialty. Previous experience of caring for patients in a neurology or neurosurgical setting is not a necessity, but a keen interest in this field together with the drive and commitment to help deliver the highest standard of patient care are.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Trust values include compassion, respect and excellence. If you consistently strive to achieve these values in your practice, then you are who we are looking for.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates can expect excellent learning opportunities, both in house with our highly regarded Neuroscience Education Programme, and externally through our links with Oxford Brookes University. You will also have the opportunity to rotate across the neuroscience wards, thus developing your overall skills as a Neuroscience Nurse.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah KingJob titleWard ManagerEmail addresssarah.king@ouh.nhs.ukTelephone number01865 223032&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254013", "validThrough": "2020-11-12T23:59:59+0000"}