{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T10:46:58+0000", "description": "&lt;p&gt;The Procurement Department at Wirral University Teaching Hospital has a vacancy for an experienced Catalogue &amp; Data Manager to join the team. Procurement is recognised by the Trust as a key enabler of transformational business change and this post presents an exciting opportunity for a highly motivated individual to support the delivery of the Trust’s e-Procurement workstream.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Buyers, finance team and external partners to identify opportunities to improve the Trust’s e-procurement capability and to contribute to the delivery of effective and efficient transactional procurement activity.&lt;/p&gt;\n&lt;p&gt;The post holder will be a highly motivated individual able to work independently and interdependently with procurement colleagues, suppliers and wider stakeholder groups to ensure that these dual objectives are met&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A significant aspect of the post holder’s role will be the development, management and delivery of the Trust’s suite of e-catalogues with the purpose of improving the quality of procurement data and making the P2P process as lean as possible. The post holder will possess excellent analytical skills and be able to interpret data effectively to improve the transactional purchasing performance of the Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have proven experience of managing e-procurement initiatives, and practical experience of setting up and managing e-catalogues for a wide range of clinical and non-clinical products and services.&lt;/p&gt;\n&lt;p&gt;They will also possess the excellent communication and inter-personal skills necessary to represent the Procurement Department at meetings and training events with internal and external stakeholders.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience of working in a similar role in finance and procurement and the ability and commitment to manage a demanding and full programme of work. The post holder will be accountable for the successful delivery of their own work plan and will be used to working within a procurement environment that is rigorously performance managed.&lt;/p&gt;\n&lt;p&gt;If you are ready for this challenge and have the necessary skills and experience that this post demands, please apply giving detailed examples of successful e-procurement initiatives that you have personally delivered and the benefits that were achieved.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Previous applicants will be automatically considered and do not need to re-apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jane Christopher (Head of Procurement) jane.christopher1@nhs.net 0151 482 7592&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clatterbridge Site, Bebington", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Catalogue &amp; Data Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242059", "validThrough": "2020-11-09T23:59:59+0000"}