{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36150", "minValue": "36150", "unitText": "YEAR", "value": "36,150."}}, "datePosted": "2020-10-23T16:02:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Job title: Programme Lead roles – Development and Employment team, NHS Employers &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location: Leeds (currently working from home until further notice) with national travel required&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Role: Fulltime 36.5 hours per week, 1 x &lt;strong&gt;permanent position &lt;/strong&gt;and 1 x FTC until October 2021 (Happy to discuss flexible working options)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary: C Grades £36,150 - £42,400 per annum (FTE)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Do you want to support employers to improve the experience of staff across the NHS workforce?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Do you understand the significance of the wellbeing of the workforce, good employment practices including culture, leadership, retention and the impact this has on patient care?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;We would love to hear from you if you:&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;enjoy engaging, listening, sharing and influencing &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;have excellent communication skills and competent computer skills &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;are improvement, behaviour change and positive outcomes driven &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;can develop engaging resources and information to support employers&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;understand the importance of equality, diversity and inclusion&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;have experience of managing workforce programmes, negotiating deliverables, evaluating the impact of your work, managing budgets, meeting deadlines and delivering positive change &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;enjoy being part of a team who are passionate about supporting employers to enable the NHS workforce to be safe, well and the best they can be&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;enjoy managing, supporting, developing and leading a team&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the lead for specific programme areas (health and wellbeing or staff experience), you will use existing research, the evidence base and examples from employers to design and deliver programmes of work to support organisations in these key areas of workforce across the NHS. Your skills and expertise will ensure the work is delivered to specification, budget and to time. This will include; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Overall management of the programme and team.&lt;/li&gt;\n&lt;li&gt;Developing and maintaining key stakeholder relationships internally and externally with commissioners, subject matter experts, and employers.&lt;/li&gt;\n&lt;li&gt;Influencing national policy and working with key stakeholders across the NHS at a national level. (An understanding of the NHS would be helpful but not essential).&lt;/li&gt;\n&lt;li&gt;The ability to build rapport quickly, listen, contextualise, and influence senior managers and a variety of stakeholders.&lt;/li&gt;\n&lt;li&gt;Coordinate, attend and/or represent employer views at internal and external meetings and events.&lt;/li&gt;\n&lt;li&gt;Developing a sound knowledge of NHS Employers work, working with and promoting the National Engagement Team and NHS Employers tools and resources.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills, including use of Social Media.&lt;/li&gt;\n&lt;li&gt;Use of relevant IT, and financial systems.&lt;/li&gt;\n&lt;li&gt;Can-do attitude and solution focused approach.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receive an excellent benefits package, including 30 days annual leave, pension scheme, flexible working, salary sacrifice schemes and travel season ticket loans.&lt;/p&gt;\n&lt;p&gt;Equality, diversity and inclusion is at the heart of the NHS Confederation and we are actively seeking to increase diversity in our workforce through a process that is fair, open, consistent, and free from discrimination. We welcome all applications from all backgrounds and encourage applications from our BAME communities, our LGBTQ+ communities and from individuals who identify as being disabled, as well as all other protected characteristics. We are committed to building a diverse and inclusive company culture where all employees feel valued, respected, and acknowledged.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is committed to being a flexible employer. We understand the value and benefit to our employees being able to work flexibly to respond to changing circumstances and we want to ensure we do as much as possible to help support a work life balance and take care of employee health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is a membership body that brings together and speaks on behalf of all organisation’s that plan, commission and provide NHS services with our members drawn from every part of the health and care system. At the NHS Confederation we are passionate about our values (voice, openness, integrity, challenge, empowerment and respect). These are supported by a set of behaviours that demonstrate the attitudes and approach we take to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply please read the job description and complete the application form - please note on the application which role you are applying for i.e FTC or permanent.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss the post before applying, then please contact Jennifer.gardner@nhsemployers.org&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application deadline: 11th November 2020 (midnight)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Interview date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Employers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121179"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS10 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7935", "longitude": "-1.53896"}}, "title": "Programme Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241228", "validThrough": "2020-11-11T23:59:59+0000"}