{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T10:45:52+0100", "description": "&lt;h1&gt;Community Nutrition Support Dietitian Band 6&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;United Lincolnshire Hospitals NHS Trust&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, hardworking dietitian with an interest in community dietetics to join the United Lincolnshire Hospitals Trust Dietetic Team.&lt;/p&gt;\n&lt;p&gt;The post provides a nutritional support service in the community to some of our most vulnerable patients. This is a great opportunity to gain experience and develop your knowledge and skills in community services and home enteral nutrition. You would be well supported in a friendly team whose aim is to provide an excellent, compassionate and cost effective service. The post provides domiciliary visits to those patients unable to attend a hospital appointment in addition to community based clinics. You would also see patients enterally fed in the community working closely with the Home Enteral Nutrition Team. You will also work closely with care providers in the community, providing education and advice on the nutritional care of patients, contributing to the development of safe practice guidelines and policies. You will also be involved in guiding the CCGs in the appropriate use of oral nutritional supplements.&lt;/p&gt;\n&lt;p&gt;We are constantly looking at ways to develop our service and you will be involved by contributing your ideas and trying different ways of delivering the service. You will have the opportunity to conduct audits and be involved in evaluating patient feedback.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is an interesting county, the second largest in the UK. It is steeped in history with the very beautiful Lincoln cathedral and nearby castle. If you enjoy the countryside, the seaside or football, there will be lots to keep you occupied. If it’s a show, or a concert that makes you happy, we have our own Theatre Royal and Nottingham is close by. Even London is only a short train journey away.&lt;/p&gt;\n&lt;p&gt;An interest in community dietetics and/or home enteral nutrition, some relevant post registration experience and a desire to undertake relevant post-registration training are essential. Car driver and access to transport is required. We will value your ability to use your initiative. You will have a flexible approach, excellent communication and time management skills and the ability to work independently, liaising effectively with a wide range of staff, patients and the public.The department provides clinical placements for A, B and C dietetic students. Regular CPD is provided and there are opportunities for further training and development.&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;Katy McMillan Site Lead for Paediatrics and Home Enteral Nutrition on 01522 597765 or 0788774504;&lt;/p&gt;\n&lt;p&gt;or Katherine Green, Trust Lead Dietitian on 01522 573418.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Katy McMillan&lt;/p&gt;\n&lt;p&gt;Job title: Site Lead Dietitian for Home Enteral Nutrition and Paediatrics&lt;/p&gt;\n&lt;p&gt;Email address: katy.mcmillan@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01522 597765&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Community Nutrition Support Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240131", "validThrough": "2020-11-09T23:59:59+0000"}