{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365  - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T11:01:54+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity for Band 6 specialist nurses to join the All Age Eating Disorder team in Kent and Medway.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will be a qualified nurse who is fully registered with the NMC and ideally will have additional post-graduate qualifications relevant to the area.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to assess and treat all age patients who present with an eating disorder. As the service is exclusively an outpatient service, the post holder will not hold an inpatient case load, but the post holder will work with adolescent units and adult units in order to maintain joint working and smooth transition into and out of inpatient beds. The post holder will be expected to attend and participate in MDT team meetings as well as CPA meetings of cases on their case load.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to hold a caseload and provide evidence based treatment to children, adolescents and adults who present with an Eating Disorder.&lt;/p&gt;\n&lt;p&gt;The post holder will support their peers and team leader and be an effective team member whilst working on their own initiative. They will supervise other staff members as required. They will have a commitment to collaborative working and actively supporting and liaising with other health and social professionals and agencies.&lt;/p&gt;\n&lt;p&gt;There are two bases within Kent in Maidstone and Canterbury. However travel is required across some sites in Kent.&lt;/p&gt;\n&lt;p&gt;This post will be subject to a six months probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSara BoormanJob titleIntegrated Team ManagerEmail addresssara.boorman@nelft.nhs.ukTelephone number0300 300 1980Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Sara Boorman&lt;/p&gt;\n&lt;p&gt;Integrated Team Manager&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "George Turle House/Pudding Lane, Kent", "postalCode": "ME14 1PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2739", "longitude": ".520338"}}, "title": "Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255519", "validThrough": "2020-11-18T23:59:59+0000"}