{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-16T16:28:45+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for Band 5 Staff nurse posts on Brant ward Witham Court.&lt;/p&gt;\n&lt;p&gt;Brant ward is an 18 bedded acute assessment and treatment ward for older adults experiencing functional mental health problems. It has been newly refurbished to a very high standard with single bedrooms &amp; ensuite bathrooms.&lt;/p&gt;\n&lt;p&gt;The ward is dynamic; fast paced and offers excellent opportunities for professional development. Whilst the ward was being refurbished the core team have been working as part of an OA Home Treatment team which has resulted in enhancing their skills, and the excitement of looking at working in a more dynamic way with patients to ensure their hospital stay promotes, and maintains a level of independence whilst supporting with their recovery.&lt;/p&gt;\n&lt;p&gt;The staff nurse would be expected to work closely with the team in the delivery, evaluation and development of the care programme approach and be forward thinking and innovative in the on-going development of service provision. The candidate must be genuinely patient and carer focussed in their approach to all they do.&lt;/p&gt;\n&lt;p&gt;The successful candidate will ideally possess excellent communication skills, determination, drive and an ability to manage their workloads in a challenging ever changing environment. This will work towards providing a quality of mental health care that achieves confidence and effective outcomes to all those who come into contact with the ward.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across a variety of shifts in order to meet the needs of the 24 hour service.&lt;/p&gt;\n&lt;p&gt;A full induction package will be offered, access to training, regular supervision, annual appraisal and a commitment to developing staff to their full potential.&lt;/p&gt;\n&lt;p&gt;The salary for this post, depending upon relevant experience, is A4C band 5-£22,128 - £28,746. The hours are 37.5 per week worked on a shift basis to cover 24 hour period to include nights and weekends.&lt;/p&gt;\n&lt;p&gt;We are offering all registered nurses for this position an attractive employment package, including a welcome payment of £2,500 (paid in two instalments during year one) and £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package** if appropriate. In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD.&lt;/p&gt;\n&lt;p&gt;** Eligibility criteria applies, more information can be provided&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Sue Brace Ward Manager on 01522 307873 or email sue.brace1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Witham Court, Fen Lane, North Hykeham, Lincoln", "postalCode": "LN6 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1854", "longitude": "-.575247"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231095", "validThrough": "2020-11-06T23:59:59+0000"}