{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus HCAS"}}, "datePosted": "2020-11-05T14:16:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 6 Mental Health Occupational Therapist to join the Redbridge Access, Assessment &amp; Brief Intervention Team.&lt;/p&gt;\n&lt;p&gt;This multi-disciplinary community mental health team includes Psychiatrists, Mental Health Nurses, Social Workers, Occupational Therapists, Support Time and Recovery (STR) workers, Specialist Employment workers and administrative staff. They work closely with a range of statutory and voluntary partners such as inpatient mental health services, Home Treatment Teams, specialist drug and alcohol services, personality disorder services and psychological therapies.&lt;/p&gt;\n&lt;p&gt;The Redbridge Access, Assessment and Brief Intervention Team provide a single point of access to adult Mental Health Services in the borough. The team provides assessment and advice and acts as a signposting service to other teams and organisations as appropriate. They offer short term individual interventions and groups for service users aimed towards recovery and independence. We are looking for an enthusiastic, flexible individual who has a passion for supporting service users with mental health conditions on their recovery journey, working with them in their homes, the wider community and clinical settings.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapy service is embedded within the team, and consists of a Clinical Lead Band 7 OT, rotational Band 5 OT, STR and employment workers in addition to the Band 6 post advertised. The service works to the Recovery model and uses the Model of Human Occupation as a framework for clinical practice. The post holder would provide OT assessment and intervention and co-facilitate psycho-educational groups, in addition to supporting the Clinical Lead with OT service development and support and supervision for junior staff. They would be expected to complete generic assessments as part of the wider clinical team and carry a small caseload of OT-specific and generic key-worked clients. Specialist training opportunities such as AMPS are available and there is an established OT network spanning all health and social services in Redbridge with regular developmental and support meetings. NELFT offers excellent opportunities for career development and has well embedded systems of appraisal and professional support.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Probationary Period&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assessment/Interview info&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Starting with NELFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;High Cost Area Supplement – London&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLiz PascarellaJob titleClinical Lead Ocuupational TherapistEmail addressLiz.Pascarella@nelft.nhs.ukTelephone number07522 218620Additional contact information&lt;/p&gt;\n&lt;p&gt;Alternative contact Service Manager: Sue Tatch&lt;/p&gt;\n&lt;p&gt;Email: Sue.Tatch@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mobile: 07713 089315&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mellmead House, Wanstead", "postalCode": "E11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5838", "longitude": ".028749"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258069", "validThrough": "2020-11-22T23:59:59+0000"}