{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "UP TO £39,000 per annum DOE"}}, "datePosted": "2020-11-04T11:56:14+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Make a difference from day one!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skills we want to meet you!&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Interested in development?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer opportunities to develop in to a specialist role of your interest which in turn benefits the service. Examples include ANP, BBV, CBT, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses. As well as team and manager essentials training.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; What can we offer you?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Registered Nurse you’ll be an integral part of the senior team at HMP YOI Exeter, bringing your well-developed clinical skills, passion for care and leadership skills to the role. You will be leading from the front, keeping your skills sharp by delivering some clinics directly and developing knowledge within the team to continually improve the care for patients at HMP YOI Exeter.&lt;br /&gt; &lt;br /&gt; This is a leadership role and with your team leaders you will model a culture of compassion, care, courage, commitment, communication and competence. The role will include providing support and mentorship; drawing the best from our staff and improving the quality of care received by patients at HMP YOI Exeter.&lt;br /&gt; &lt;br /&gt; As the Senior Nurse – Inpatients at HMP YOI Exeter you will be innovative, bringing fresh ideas and solutions to the challenges of proving healthcare in a prison that is also changing its focus to a remand and resettlement prison; you will see men at beginning and end of their time in prisons, both are times of transition in the community and require a coordinated approach to continuity of care with other services.&lt;br /&gt; &lt;br /&gt; You’ll receive an annual salary of up to £39,000 FTE - depending on experience; free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt; &lt;br /&gt; As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;How will we support you?&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; • Bespoke induction&lt;br /&gt; • Competency framework&lt;br /&gt; • Regular clinical supervision&lt;br /&gt; • Supported development into specialities&lt;br /&gt; • Regional and national career development opportunities&lt;br /&gt; • Our bespoke Learning Management System to address your learning needs&lt;br /&gt; • Support from the wider team&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; Next steps&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP YOI Exeter if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX4 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.728", "longitude": "-3.53224"}}, "title": "Senior Primary Care Nurse - HMP YOI Exeter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255695", "validThrough": "2020-11-18T23:59:59+0000"}