{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T14:00:26+0000", "description": "&lt;p&gt;Health Visitor Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 full time permanent post and 1 x 12 month Fixed Term Post based in North Lincolnshire &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Specialist Community Public Health Nurse (SCPHN) will work as part of an integrated team contributing to family health needs assessment. The post holder will lead the 0-5 Healthy Child Programme and work in partnership with the family, education and other agencies to develop implement and evaluate packages of care. The health Visitor role forms a vital and integral part of the 0-19 offer.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Why Work in North Lincolnshire?&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Innovation&lt;/strong&gt;- the 0-19 Health and Wellbeing service is at the forefront of service redesign in Health Visiting and School Nursing. Innovation is high on the agenda, you will receive encouragement to innovate, push boundaries and gain real job satisfaction.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Quality&lt;/strong&gt;- the RDaSH Children’s Services have recently been rated as &lt;strong&gt;outstanding by CQC&lt;/strong&gt; and strive to continue to facilitate high quality, measurable practice.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Training&lt;/strong&gt;- Opportunity to access valuable training delivered across 0-19/25 SEND service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Development- &lt;/strong&gt;The service offers a robust Preceptorship package and peer support groups.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Aspirational-&lt;/strong&gt; Professional development is provided to support your career aspirations and role development.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support- &lt;/strong&gt;An embedded clinical supervision policy is utilised effectively in practice.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Technology&lt;/strong&gt;-Innovative technology package and agile working to support positive work life balance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Multi- Disciplinary&lt;/strong&gt;-Practical support from an experienced skills mix workforce.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What do we expect in return?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Passion&lt;/strong&gt; - for improving the health and wellbeing of our children and families.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enthusiasm&lt;/strong&gt;- to embrace challenge and change.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Commitment-&lt;/strong&gt; to engage in Building Community Capacity.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Resilience-&lt;/strong&gt; when working with complex families and situations.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Leadership-&lt;/strong&gt; and confidence to ensure the effective delivery of services to the Children and Families if North Lincolnshire.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applications are welcomed from SCPHN – Health Visitor NMC Registered Practitioners who are proactive and enthusiastic with excellent communication, interpersonal and organisational skills and are keen to work in North Lincolnshire.&lt;/p&gt;\n&lt;p&gt;For additional information please contact Ruth Chittenden – Health Visitor Team Leader Tel: 07443291400&lt;/p&gt;\n&lt;p&gt;Or email ruth.chittenden@nhs.net Team lead 0-5:0-19/25 SEND Health and Wellbeing Service or&lt;/p&gt;\n&lt;p&gt;Joanne Shearman – Acting Service Lead/Community Practice Educator email joanne.shearman@nhs.net phone 07971084706&lt;/p&gt;\n&lt;p&gt;Interviews are scheduled to take place at Meridian House, Normanby Road, Scunthorpe, DN15 8QZ on Monday 23rd November 2020. Due the covid19 pandemic interviews may take place via Microsoft Teams&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 8QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6135", "longitude": "-.654649"}}, "title": "Health Visitor (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248607", "validThrough": "2020-11-16T23:59:59+0000"}