{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T14:46:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced neonatal nurse, looking for a new challenge and/or career progression?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Situated in the heart of Essex, Colchester offers excellent housing, schools, shopping and eating facilities in addition to local beaches and outstanding local countryside, including Constable Country.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Colchester University Hospital Foundation Trust serves a growing population of children and young people within North East Essex. Providing both acute and community neonatal and children’s services our staff are committed to caring with pride, developing and delivering excellence in children’s care.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This demanding role requires passionate, highly motivated and experienced neonatal trained nurses with excellent communication skills who wish to continue to develop their clinical and leadership skills, delivering high quality care to neonates and their families. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You will have the opportunity to work and learn in diverse child focused environments. We will offer you the support of a committed team to advance your skills with a structured ongoing professional Band 6 development programme to support your learning with access to development opportunities both internally and with our excellent links to local universities.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;As a team, we are committed to recruiting staff who uphold our values and can deliver excellent care putting babies at the heart of everything we do, with an emphasis on working in partnership with the families to provide the best possible experience and outcomes. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are excited at the prospect of supporting motivated individuals to help lead, develop and influence our growing services. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Our Level 2 Neonatal Unit comprises of 17 cots including 1 IT, 4 HD and 12 SC cots and is part of the Eastern Region Neonatal Network. Advanced Neonatal Nurse Practitioners and a Neonatal Outreach Team facilitating early discharge and care in the community complement our committed team of neonatal nurses. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This post includes shift work with internal rotation to night duty and may occasionally involve some cross cover for Children’s Ward.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Interviews may be held at short notice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please note that this role is subject to a DBS check which will be charged to the successful candidate. Full details can be found within the ‘DBS Information’ documents attached to this advert.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren MossJob titleSister - SisterEmail addressKaren.Moss@esneft.nhs.ukTelephone number01206 742484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester, Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Deputy Sister/Charge Nurse - Neonatal Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256269", "validThrough": "2020-11-18T23:59:59+0000"}