{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-10-27T14:30:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a Nurse or Allied Health Professional working as or training to be an Advanced Clinical Practitioner (ACP)? If so this is an exciting opportunity to join our Community Hospital Team at Lincolnshire Community Health Services NHS Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lincolnshire Community Health Service NHS Trust (LCHS) are the primary community healthcare provider across Lincolnshire. Delivering services aimed to support people to manage their own health closer to home, both in the community and in our nurse led inpatient units.&lt;/p&gt;\n&lt;p&gt;As an organisation we have been rated ‘Outstanding’ by the Care Quality Commission and are playing an integral part in shaping future health service provision countywide alongside our partners in Health and Social care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LCHS Way&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We listen&lt;/strong&gt;: we engage with everyone we work with; we are united; we are always positive&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We care&lt;/strong&gt;: everyone is valued, respected and developed; knowledge and skills are nurtured; success is celebrated&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We act&lt;/strong&gt;: clear goals and the right resources; freedom coupled with accountability; emphasis on simplicity&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We improve&lt;/strong&gt;: we are creative, resourceful and innovative; integration &amp; collaboration is the way forward; we’re always striving to do better.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have four community hospital sites across Lincolnshire providing inpatient care. Our care pathways include Palliative care and end of life; rehabilitation (this includes stroke patients stepping down from acute care; and transitional care (which includes avoiding admission into acute hospitals, and recuperation and recovery for patients having had an acute hospital stay).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Welland Ward and the Tulip Suite:&lt;/strong&gt; are located in Johnson Community Hospital, Spalding and is a 32 bed unit. The four beds on the Tulip suite are dedicated to palliative and end of life care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Scotter Ward&lt;/strong&gt;: is located in John Coupland Hospital, Gainsborough and has 17 beds, two of which are for palliative and end of life care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Archer Ward and Archer Assessment Unit: &lt;/strong&gt;are located in Louth County Hospital, Louth and has 39 beds across two wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucester and Scarbrough Wards: &lt;/strong&gt;are located in our Skegness Hospital, Gloucester Ward has 24 beds and Scarbrough Ward has 16 beds, two of which are dedicated to palliative and end of life care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we offering?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of our work to ensure we are delivering a service sustainable for 21st century community health services, we have reviewed our Medical Model and have opportunities for Band 8a ACPs or B7 Trainee ACPs to join our multidisciplinary team and participate in our work to shape the service to meet the needs of our community.&lt;/p&gt;\n&lt;p&gt;As part of a team you will work as an autonomous practitioner, with support from our ward GPs. Using your advanced clinical practice skills you will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible for the clinical assessment, investigation, diagnosis and treatment and/or referral of patients within Community Hospital services, identifying complex and specialist needs and will develop, implement and evaluate programmes /plans of care.&lt;/li&gt;\n&lt;li&gt;Manage undifferentiated and undiagnosed patient presentations, using advanced clinical skills within your own sphere of competence.&lt;/li&gt;\n&lt;li&gt;Provide direct consultations which dependent upon competency and area of practice, may be via telephone or face to face across the community hospitals.&lt;/li&gt;\n&lt;li&gt;Work collaboratively with the team and external providers, to ensure the right care, by the right person, at the right time and in the right place. Practitioners will aim to enable individuals to maintain or regain independence or ensure a plan is in place for them to achieve their optimum personal potential and to prevent unnecessary acute hospital admission.&lt;/li&gt;\n&lt;li&gt;Demonstrate a commitment to providing a quality, evidence based service, excellence in clinical practice, together with continuous professional development are integral to the role and development of the service.&lt;/li&gt;\n&lt;li&gt;Support the delivery of policy and procedures, providing clinical leadership to achieve a quality, evidence based service, excellence in clinical practice, this together with continuous professional development are integral to the role and development of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful applicants would hold a professional registration with the NMC or HCPC, along with a Masters level qualification in Advanced Clinical Practice. Our trainee ACPs will have evidence of professional study at Masters Level and/or postgraduate certification in Advanced Clinical History taking; Advanced Physical Assessment and Diagnostics; and be a Non-Medical Prescriber. Support will be given to achieve these goals with leadership and academic support.&lt;/p&gt;\n&lt;p&gt;There may also be an opportunity to work with our Urgent Care colleagues to gain insight and experience in this area of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Living in Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lincolnshire is wonderfully diverse, from a thriving University City in the centre, to the rolling hills of the Wolds and the beautiful 30 mile stretch of sand at the coast. We celebrate the mix of heritage and modern developments which provide fun opportunities for all the family.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Thinking of relocating?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lincolnshire boasts an affordable lifestyle and LCHS also offer relocation packages for successful applicants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in applying or would like to visit us for an insight visit, please contact Angela Wilson, Clinical Service Lead on 07798937293 or by email angelawilson2@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Hospitals, Gainsborough", "postalCode": "LN5 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2265", "longitude": "-.524149"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244962", "validThrough": "2020-11-09T23:59:59+0000"}