{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa pro rata"}}, "datePosted": "2020-11-03T11:46:31+0000", "description": "&lt;p&gt;This post offers an exciting opportunity to work within our dynamic and innovative Neonatal Unit. As a Clinical Support Worker, you will be an integral part of the team providing support to the day to day running of the unit.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic clinical support workers to join our Neonatal Unit Team. This role is designed to support nursing, clerical and housekeeping staff on this busy unit. You will need to enjoy variety, be flexible and willing to learn new skills. You must enjoy working with babies and their families and have a positive and proactive approach to your work, which will include working alongside staff providing direct clinical care.&lt;/p&gt;\n&lt;p&gt;This is a part-time post working 23 hours per week. You will be required to work 11.5 hour shifts, covering weekdays and weekends and 5.75 hour shifts to provide cover during annual leave.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to work on your own initiative in a diverse and varied role, liaising with many different departments from across the Trust as well as with patients and carers.&lt;/p&gt;\n&lt;p&gt;We work together to create a positive team spirit, recognising achievements and celebrating success so come and join our team! Cornwall is an area of outstanding natural beauty and the stunning coastline is at your fingertips. Come and work for the Neonatal Unit at Royal Cornwall Hospital in one of the most beautiful places on earth. Why wouldn’t you?&lt;/p&gt;\n&lt;p&gt;Opportunities for development are available.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Neonatal Sisters Melanie Frost, Claire Tregonning or Rachel Bailey on 01872 252036/2342.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Clinical Support Worker/Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253802", "validThrough": "2020-11-17T23:59:59+0000"}