{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-10-27T16:45:56+0000", "description": "&lt;p&gt;Interested in working for a NHS Trust that is in the Top 20% of similar hospitals for excellent Staff engagement?&lt;/p&gt;\n&lt;p&gt;The Estates Capital and Development Department are looking to recruit an organised and efficient projects assistant to provide support in the day to day management of the team in connection with any refurbishment or new build work . The post will be based at Bournemouth hospital but will involve working with Bournemouth, Christchurch and Poole Hospitals. The role requires a high level of attention to detail, accuracy and the ability to work under pressure.&lt;br /&gt;The role will involve a variety of responsibilities and tasks which will include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicate effectively and work collaboratively with others ; taking and passing on messages and drawing these to the attention of the relevant person promptly.&lt;/li&gt;\n&lt;li&gt;General office administration using Microsoft packages (Word, Excel, Outlook and PowerPoint).&lt;/li&gt;\n&lt;li&gt;Organising meetings, preparing agendas and typing minutes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Full training will be given on the systems you will be required to use and developmental opportunities and extra training courses will be available. Flexible working or job sharing could be considered provided the full time hours of the role can be met.&lt;/p&gt;\n&lt;p&gt;The Royal Bournemouth and Christchurch hospital has been rated &quot;Good&quot; in all areas and &quot;Outstanding&quot; in Well-Led by the CQC in 2018 and the Trust was the top performing acute Trust in this year&#39;s NHS National Staff Survey.&lt;/p&gt;\n&lt;p&gt;The Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust and Poole Hospital NHS Foundation Trust have now merged into the University Hospitals Dorset NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Peter Curtis&lt;/p&gt;\n&lt;p&gt;Job Title: Head of Estates Development&lt;/p&gt;\n&lt;p&gt;Email Address: peter.curtis@uhd.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone Number: 07748 982316&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bournemouth Hospital, Bournemouth", "postalCode": "BH7 7DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.8205"}}, "title": "Estates Capital Projects Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245470", "validThrough": "2020-11-15T23:59:59+0000"}