{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 2"}}, "datePosted": "2020-10-30T12:46:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Try something innovative&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve within the &lt;strong&gt;Forensic Directorate&lt;/strong&gt;. Enabling our patients with mental health needs to receive a truly integrated &amp; holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge &amp; expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;Specialising in the management &amp; treatment of mental health needs of offenders and those who present a risk to the public, offering bespoke pathways to recovery, within an environment which is safe &amp; focused on rehabilitation &amp; community re-integration, the hospital have established an excellent reputation for providing the highest standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;It is a very exciting time in Forensic services and you could be part of it &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Selected as one of 4 pilots Nationally to deliver a new care model through a core partnership between the three secure care providers in the West Midlands, working together to build on current good practice, bring together the best of what we do across organisations &amp; create opportunities to develop new, innovative solutions to respond to challenges raised in the Five Year Forward View. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;This partnership uses the freedoms of two highly performing NHS Foundation Trusts &amp; the agility of the independent sector. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;As a Proven Secure Services Provider we work collaboratively with a strong value base. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;We demonstrate excellence in practice, robust awareness, clear oversight, &amp; solid procedural measures, with high standards of safety &amp; security for our service users, staff &amp; visitors. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Working alongside patients, carers, advocacy groups &amp; local communities, we have a strong focus on physical health &amp; reducing health inequality.&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Our Clinical Strategy is built on strong customer focus, high quality service delivery &amp; business development. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;We are proud of our clinical excellence &amp; reputation consistently rating highly across all services in Quality Network Peer review.&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Our services are based on strong clinical models &amp; ensure the patient is central to our plans. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;To ensure &amp; protect our future viability, we aim to add to our portfolio of services, we offer a broad range educational, vocational, &amp; therapeutic opportunities. &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our highly experienced team of mental health professionals and support staff, which include consultant psychiatrists, psychologists, nurses &amp; therapists, deliver personalised treatment programmes &amp; a range of therapies.&lt;/p&gt;\n&lt;p&gt;You will be an experiencedHealth Care Support Worker who is flexible, enthusiastic, self-motivated &amp; interested in working within a modern, forward thinking &amp; effective specialist service. You will be a key member of our multi-disciplinary teams, adopting a pro-active &amp; therapeutic approach to care management within a supportive &amp; healing environment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will undertake &amp; manage direct patient care, having participated fully in the assessment, planning &amp; evaluation of care needs. Undertaking the delivery of care, including individual &amp; group sessions to agreed quality standards as prescribed by internal procedure &amp; health legislation. You should be prepared to work in an environment that can be very challenging, but also very rewarding.&lt;/p&gt;\n&lt;p&gt;You will be professional at all times &amp; conduct your duties with care, consideration &amp; kindness towards others which are in line with our Trust Values.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;What you need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Good working knowledge of CQC standards;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An effective communicator with the ability to engage with our service users to understand their needs to provide excellent services of care;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The ability to build &amp; maintain excellent working relationships with external care professionals &amp; families to be customer focused &amp; to continually develop the services we provide;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Promote ownership of care programmes by fully involving service users &amp; their families in developing, agreeing &amp; evaluating programmes of care;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;It is essential to be Health &amp; Safety aware, to ensure the safety of our services users &amp; colleagues&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we will support and facilitate your development in this role through supervision &amp; a personal development plan tailored to your needs, experience &amp; personal/professional goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;With all of this opportunity on offer, why go anywhere else?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Redwoods Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Located in the heart of theShropshire countryside with easy access to Manchester to the north and Birmingham to the south, Shrewsbury is the county town.&lt;/p&gt;\n&lt;p&gt;TheRedwoods site is less than 10 minute drive from theA5 with plenty of free car parking. Shrewsbury train station is approximately a 15-20 minute walk from the Redwoods’ site &amp; the hospital is well served by local bus services.&lt;/p&gt;\n&lt;p&gt;Close to the centre of the county town with an array of local shops &amp; amenities, with your high street favourites.&lt;/p&gt;\n&lt;p&gt;Shropshire house prices are very competitive by national standards. The range &amp; choice of housing in the County is extensive, &amp; more importantly affordable. Whether renting or buying there is a fabulous home to be found in Shropshire. Within the County, there is a vast range of housing to suit all tastes: from modern prestige developments to Victorian &amp; pre-war houses in leafy lanes. Bustling towns, attractive suburbs &amp; peaceful rural villages within easy travelling distance of each other make Shropshire an ideal place to make your home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury, Shropshire", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Health care support worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250253", "validThrough": "2020-11-22T23:59:59+0000"}