{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-04T14:45:18+0000", "description": "&lt;p&gt;italk is an exciting, transformative and expanding psychological therapies service within which to work. We are a strong partnership service; comprised of a collaboration between Southern Health NHS Foundation Trust and Solent Mind charity. We strive to deliver a high quality, evidence-based, patient-centred therapy service, to the population of Hampshire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Southern Health NHS Foundation Trust (SHFT) has a strong track record of delivering high quality services and leading change to serve local people better.  The Hampshire Clinical Commissioning Groups (CCGs) are working in collaboration with SHFT and Solent Mind to deliver the italk Health Long Term Conditions service across various locations within Hampshire. We aim to deliver integrated care across physical and mental health care, which puts the patient at the centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the development of the italk Health pathway we are looking for a Clinical / Counselling Psychologist with interest and experience in Physical Health.  The post would also be suited for an Applied Psychologist with relevant experience and accreditation, or an experienced CBT therapist with LTC and MDT experience. Application will also invited by Band 7 Clinical Psychologists seeking a preceptorship to an 8a position. The post is based across Hampshire. It is advertised as a full time position, and job share opportunities are welcome. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting and varied role. As a senior member of the team you will provide evidence based treatment to people referred to the service, offer MDT support and training to Physical Health Care staff, and be involved in the development of the italk Health pathway. The post offers an opportunity for innovation, and service development alongside the Senior Management Team.  As well as working closely with the clinical team, including Clinical Psychologist, CBT therapists, Psychological Wellbeing Practitioners, and Assistant Psychological Therapists to deliver evidence-based interventions as part of italk Health Long Term Conditions pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will receive excellent support in this role, including skills development and regular supervision. You will be joining a friendly and dynamic team. We are committed to recruiting not only people with the right skills, but also the right values to support effective learning, team working and excellent patient care and experience. As a supervisor, you will be expected to show clinical leadership though the supervision of junior colleagues on a regular basis.&lt;/p&gt;\n&lt;p&gt;Applicants should be familiar with the values of the NHS Constitution, and the visions of Southern Health; to improve patient and carer experience, to improve outcomes for patients and their families, and finally, reducing our costs to ensure that we operate in the most efficient manner possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;italk delivers a stepped care IAPT model, and is comprised of 3 ‘strands&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;italk core&lt;/strong&gt;, delivers evidence based psychological therapeutic interventions for our local population in Hampshire.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;italk health&lt;/strong&gt;, italk work in collaboration with local health services including community respiratory, musculoskeletal, perinatal and diabetes teams.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;italk@work&lt;/strong&gt;, offers a range of services to enable organisations and industries to support the emotional wellbeing of their employees.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are dedicated to delivering superb quality, evidence-based assessment and interventions with the patient always at the heart of our offer.  The range of psychologically focused therapies we deliver include:  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Step 2: Guided self-help, Psycho-education groups, computerised CBT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Step 3: Cognitive Behavioural Therapy (CBT), Interpersonal Therapy (IPT), Mindfulness Based Cognitive Therapy (MBCT), Cognitive Analytic Therapy (CAT), Compassion Focused Therapy (CFT), Comprehend, Cope and Connect (CCC), Eye Movement Desensitisation and Reprocessing (EMDR) and Couples Therapy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;italk are split into 3 clusters; Mid and North Hampshire (Andover, Winchester, Basingstoke and Alton), East Hampshire (Gosport, Fareham, Havant, Waterlooville, Bordon and Petersfield), West Hampshire (Eastleigh, Romsey and the New Forest) with a centralised hub for each area.&lt;/p&gt;\n&lt;p&gt;For this role you would be considered a ‘mobile worker’ as we operate where our patients need us; this may be at one of our ‘hubs’, in local community venues or medical sites. You would be nominated a ‘base’ from which to claim travel and where you would most likely be based for computer based work.  Some travel will be required, and there are opportunities for remote working within this role using digital platforms.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to find out more about the post please contact:&lt;/p&gt;\n&lt;p&gt;Amy Francis, Clinical Lead Service Manager italk: amy.francis@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Laura Dannay, Divisional Lead for Psychological Therapies: laura.dannay@southernhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mobile Worker", "postalCode": "SO50 9FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.97", "longitude": "-1.35236"}}, "title": "Clinical/Counselling Psychologist – iTalk Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256265", "validThrough": "2020-11-18T23:59:59+0000"}