{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-04T16:45:48+0000", "description": "&lt;p&gt;Are you a Registered Staff Nurse looking for a new opportunity to work in an organisation, that will help you to develop your skills and knowledge in adolescent care. Ward 14 is a 12 bedded ward that cares for children and young people 12 – 18 years of age. The ward works closely with the Child and Mental Health Service and boasts a leading service for adolescents with mental health disorders. UHCW is committed to providing excellent care to children and young people aged up to 18 years.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an experienced Band 5 RGN or RNC who is highly motivated with a range of transferrable skills, and is enthusiastic about working with young people. We are looking for a passionate nurse who has an understanding of working with children and young people and who will strive to provide high quality care for children and adolescents requiring medical, orthopaedic, surgical, gynaecological, social and mental health interventions.&lt;/p&gt;\n&lt;p&gt;We are passionate about the delivery of a high quality service that promotes and improves the well-being of children and young people .Working within a systemic and holistic framework you will undertake needs led, evidence based assessments and therapeutic interventions with children and young people, their families and carers, who present to the service.&lt;/p&gt;\n&lt;p&gt;We have a dedicated multidisciplinary team providing care for children and young people. This is complemented by a proactive multi-disciplinary team and benefits from the expertise of CAMHS Liaison Team, Clinical Nurse Specialists and Paediatric Practice Educators.&lt;/p&gt;\n&lt;p&gt;Working within this challenging yet very rewarding environment will enhance your own professional development and at UHCW we are committed to providing education opportunities for nurses at every level. As well as first-class facilities, you’ll benefit from the support of a visible management team and a dedicated team of Clinical Practice Facilitators, excellent career and educational development opportunities and bespoke training plans and study leave.&lt;/p&gt;\n&lt;p&gt;A comprehensive induction, orientation and training will be provided for successful candidates. We will also ensure that you have tailored, individual personal development plans with support for further training and development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Boyle&lt;/p&gt;\n&lt;p&gt;emma.boyle@uhcw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "uhcw, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Experienced Registered Nurse - Ward 14", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256697", "validThrough": "2020-11-18T23:59:59+0000"}