{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18185", "unitText": "YEAR", "value": "£18,185 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-03T13:00:39+0000", "description": "&lt;p&gt;To support the professional practitioners to assist in the provision of high standards of holistic care for people with sexual and reproductive health needs in both acute and community environments. The Health Care Assistant (HCA) should assist with creating a welcoming, caring and safe environment. The post holder will be required to work both within the clerical and clinical environment.&lt;/p&gt;\n&lt;p&gt;To provide support and direct assistance to medical and nursing staff within all aspects of the integrated sexual and reproductive health service by undertaking nursing care and treatment as appropriate and as planned for clients.&lt;/p&gt;\n&lt;p&gt;The post holder will deal with the general public and demonstrate good customer relations on behalf of the Trust. Good communication skills are an essential element of the role.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to carry out a range of assigned tasks involving direct and indirect care for the benefit of the client. The range of responsibilities will be in support of and supervised by a registered nurse and will involve rotation within areas, as appropriate to the needs of the service. The post holder will be expected to act in a caring and professional manner, ensuring confidentiality at all times.&lt;/p&gt;\n&lt;p&gt;This role is linked clearly to minimum training requirements providing competency to practice. Professional guidance and support are also key elements to role effectiveness.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 08/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Name: Christine Edwards&lt;/p&gt;\n&lt;p&gt;Job title: Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: christine.edwards2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01685 728972 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PCH, Merthyr Tydfil", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254076", "validThrough": "2020-11-08T23:59:59+0000"}