{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-29T16:45:50+0000", "description": "&lt;p&gt;We are looking to register a Health &amp; Wellbeing Practitioner to our temporary staffing bank to support the team as and when required. We can offer weekly pay and experience of working in a large acute NHS Trust providing specialised advice in relation to the Health and Wellbeing needs of our colleagues.&lt;/p&gt;\n&lt;p&gt;As post holder, you will function as part of the Multidisciplinary Team within the Workplace Health &amp; Wellbeing Department, to provide a seamless service for our staff under the remote supervision of an Occupational Health Nurse Adviser. You will be the responsible for delivering aspects of the Staff Health &amp; Wellbeing Strategy for the organisation and also represent Workplace Health &amp; wellbeing to our external clients if required.&lt;/p&gt;\n&lt;p&gt;In this post, you will be delivering elements of Occupational health and wellbeing and undertake clinical work in domains that have previously only been within the remit of registered professionals. You would also have the underpinning knowledge and assessed level of competence to undertake such as role – locally assessed following academic instruction.&lt;/p&gt;\n&lt;p&gt;To support the delivery of a high quality, safe and compassionate healthcare service, all staff are expected to act as a role model to others in all aspects of their work and consistently demonstrate NNUH’s ‘PRIDE’ values of People focused, Respect, Dedication, Integrity and Excellence.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hilary Winch, Head of Workplace Health, Safety and Wellbeing via office.staffbank@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Temporary Health and Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249134", "validThrough": "2020-11-08T23:59:59+0000"}