{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-21T11:53:53+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Scrub Nurse / Operating Department Practitioner in our Ipwich Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Ipswich Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Ipswich Hospital opened in 1997 and is an established part of the local community. As East Anglia&#39;s only purely private healthcare provider, we offer our patients the highest levels of service and comfort with access to specialist medical equipment. Set in over 19 acres of woodland, the modern purpose-built hospital is a haven of tranquillity and repose with the majority of our bedrooms having patio doors with access to the gardens and woodland views.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are registered with the CQC for 60 bedrooms and in our most recent inspection in 2016, we were awarded a “Good” rating overal. The CQC also highlighted several areas of outstanding practice including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Staff, teams and other services worked exceptionally well together as a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;The care provided to patients&lt;/li&gt;\n&lt;li&gt;The range and selection of home cooked food available to patients, and the ability to provide a patient’s dedicated food request&lt;/li&gt;\n&lt;li&gt;The hospital provided regular training events for local GPs, which demonstrated outstanding practice&lt;/li&gt;\n&lt;li&gt;Outcomes for people who used the service were outstanding. The hospital participated in certain national audits, including the National Joint Registry (NJR), which showed 100% consent rate&lt;/li&gt;\n&lt;li&gt;Outcomes from the Oxford Hip and Knee score, as well as Patient Reported Outcome Measures (PROMS) outcomes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can provide treatments under a wide range of specialities including: breast surgery; cardiology; dermatology; ENT; gastroenterology; general surgery; gynaecology, neurology; ophthalmology; oral and maxillofacial surgery; cosmetic surgery; rheumatology and urology. Our theatre suite houses five operating theatres including two major theatres with laminar flow and one minor operating theatre, and outpatient services include 15 private consulting rooms, two treatment rooms, diagnostic imaging with CT and MRI on-site, health screening, nurse-led pre-assessment, pharmacy and physiotherapy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Scrub Nurse or Theatre Practitioner (ODP), you might join us from the NHS or a private setting. Either way, here you will discover a unique opportunity to work with some of the best in the field, and to grow your career. Not only this but you will be valued and free from the constraints that currently prevent you from achieving job satisfaction. As a Theatre Nurse / Operating Department Practitioner you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work on a varied caseload using technology, equipment and facilities, which are all state-of-the-art.&lt;/li&gt;\n&lt;li&gt;Supervise, support and develop junior members of staff.&lt;/li&gt;\n&lt;li&gt;Deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Theatre Nurse/ ODP / Scrub RGN you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;High levels of focus and engagement.&lt;/li&gt;\n&lt;li&gt;A passion for high standards and a meticulous eye for detail.&lt;/li&gt;\n&lt;li&gt;Qualifications and experience relevant to your registration, including NMC or HCPC.&lt;/li&gt;\n&lt;li&gt;Post-registration experience.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and will be a great team worker. You will also be flexible and motivated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;br /&gt;Access to our Pension Scheme.&lt;br /&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;p&gt;Working on the bank means you are not contracted to a set number of hours per week but instead work on an ad-hoc basis to suit the needs of the business and your availability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Depending on experience&lt;br /&gt;Location - Ipswich&lt;br /&gt;Hours - Bank Contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0475", "longitude": "1.22896"}}, "title": "R0025110 Bank Operating Department Practitioner  (ODP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236217", "validThrough": "2020-11-21T23:59:59+0000"}