{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-05T12:30:44+0000", "description": "&lt;p&gt;Are you passionate about nursing? Would you like to make a difference or take on a new challenge? Featured in the BBC &#39;Hospital&#39; series of programmes, Nottingham University Hospitals NHS Trust has exciting opportunities for Registered Staff Nurses to be part of our specialised multi- disciplinary team within our regional Neurosciences Unit. We are looking for highly motivated, dynamic and passionate individuals to drive our clinical pathways forward.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you are interested in something new we would welcome the opportunity to meet with you. We offer a full range of acute neurosciences services for our local community and the wider populations of South Derbyshire, Leicestershire, Lincolnshire and beyond. We have excellent opportunities for nursing development in our neurosciences wards. Caring for our patients ensures a varied role where you can learn speciality care for those who may have complex conditions and who need highly skilled care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Ward D10 is a 28 bedded ward that specialises in the care of acute neurosurgical and neurology patients. The ward sits within the Division of Surgery. Supported by the Ward Sisters, you will be responsible for the assessment and care of patients that are admitted from various regional Emergency Departments, Critical Care areas, surrounding hospitals and home. You will work closely with the medical staff and the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;These posts offer a tremendous opportunity for personal and career development, and for you to make a real difference to patient care and to gain experience within the acute hospital environment.&lt;/p&gt;\n&lt;p&gt;We can offer positions to Registered Nurses (Adult) but are also interested in hearing from experienced Mental Health Nurses and Learning Disability Nurses who are eager to learn and to join our multi-talented teams.&lt;/p&gt;\n&lt;p&gt;Part time hours available&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;kara.wesley@nuh.nhs.uk Ext 69010 Ward D10 Sister&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257668", "validThrough": "2020-11-19T23:59:59+0000"}