{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668"}}, "datePosted": "2020-10-07T15:24:07+0100", "description": "&lt;p&gt;&lt;strong&gt;WORCESTERSHIRE FOR GERIATRICIANS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;WORCESTERSHIRE Acute NHS trust (WAHNT) is a large organisation providing acute services to a population of 580,000 people from the Alexandra Hospital in Redditch, Kidderminster Hospital and Treatment Centre and Worcestershire Royal Hospital, as well as caring for patients from surrounding counties and further afield. We also run some facilities at Evesham and Malvern Community Hospitals. Last year 40% of the Worcestershire population received care at one of our hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our workforce is nearly 6,000 strong, and our caring staff are recognised as providing good and outstanding patient-centred care. You could be one of them. We are committed to recruiting the best people to work with us to achieve our Vision - working in partnership to provide the best healthcare for our communities, leading and supporting our teams to move 4ward. Our 4ward signature behaviours, which we ask all staff to demonstrate, underpin our everyday work and remain firmly at the heart of all we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Frailty is a top priority for the Trust. We have a talented, enthusiastic and motivated multi-disciplinary team to deliver comprehensive Geriatric assessment which wants to expand both within the trust and into the community. Working together, the two provider Trusts have roles for geriatricians in acute and community settings along with the Worcestershire Health and Care Trust investing in Worcestershire’s Integrated Care of Older People (ICOPE) pathway. We want to get the best outcomes for people living with frailty and aligning acute service with current and developing services in the county.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working as a single commissioner, Worcestershire’s CCGs are investing in infrastructure and services that will develop the ICOPE pathway, supporting Worcestershire Health and Care Trust and local GP leaders to develop neighbourhood teams, fourteen in all, which bring together primary, community and social care in neighbourhood hubs. The ICOPE project is not based around financial savings and consequently does not have a savings target attached to it. It is however anticipated that if the project achieves all its objectives it will enviably produce savings through reduced admissions/readmissions/LoS/ambulance transfers/reduction in interventions etc. Here, professionals are developing new roles, trusted assessor models of working, common IT and information systems, urgent and proactive models of care that together will improve the current ICOPE pathway. The role of geriatricians and other professionals who specialise in care of older people is crucial in identifying and implementing best practice so our ICOPE pathway grows into an exemplar of person-centred care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are keen to hear from both senior clinicians and those just starting out. We can work with you to develop your area of special interest.&lt;/p&gt;\n&lt;p&gt;This is your time to shine.&lt;/p&gt;\n&lt;p&gt;There are new academic opportunities with the University of Worcester (Association For Dementia Studies as well as a new medical school that is due to start in 2021 which is focusing on a curriculum emphasis on primary care, long term conditions and rurality.)&lt;/p&gt;\n&lt;p&gt;Applications welcomed for permanent or fixed-term positions, full or part time&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information or to discuss a visit please contact Dr Jackson or Dr Dutta, Consultant Geriatricians via 01905 763333&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countywide", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Consultant Physician - Integrated Care of Older People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217111", "validThrough": "2020-11-08T23:59:59+0000"}