{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-09-28T10:39:58+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Staff Nurse - Shepton Mallet Community Hospital / West Mendip Community Hospital&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note - there will be an expectation to work across both Hospitals currently.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to join a team that work together to make a difference to the patients they care for? Then come and join the friendly team at Shepton Mallet Community Hospital where we currently have two vacancies for compassionate Registered Nurses.&lt;/p&gt;\n&lt;p&gt;Shepton Mallet Community Hospital is located in the historical town of Shepton Mallet in the beautiful Mendip area. It is a small hospital with 8 beds and an Ambulatory Care Unit. This is an exciting time for us, as we work towards escalating patients care in the community to prevent them going into acute beds. An opportunity for you to work in a rehabilitation environment with an amazing team, whilst upskilling in areas such as end of life care and ambulatory care.&lt;/p&gt;\n&lt;p&gt;Successful applicants will have excellent communication skills and be responsible for the development, implementation and evaluation of personalised care plans to ensure high quality care is given and also to ensure that patients are treated with dignity and respect whilst promoting a safe environment within the unit.&lt;br /&gt;&lt;br /&gt;You will be required to work flexibly on an internal rotation, which will include working days and nights over the seven days. In return you will receive enhanced payments for weekend work, a generous holiday entitlement and pension scheme. A relocation package is also available.&lt;br /&gt;&lt;br /&gt;Transferable clinical skills will be supported with training packages and we are able to offer a period of induction/orientation tailored to your needs. Somerset Partnership also run a great Preceptorship programme for newly qualified staff.&lt;/p&gt;\n&lt;p&gt;If you are a forward thinking, compassionate nurse who is keen to be involved in the fantastic hands on care provided at the community hospital, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;All staff at the hospital also benefit from free parking.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ruth Diligent&lt;/p&gt;\n&lt;p&gt;Matron&lt;/p&gt;\n&lt;p&gt;01749 342931&lt;/p&gt;\n&lt;p&gt;- Or -&lt;/p&gt;\n&lt;p&gt;Amy Mitchell - Ward Sister - 01749 342931&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet Community Hospital, Shepton Mallet", "postalCode": "BA4 4PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1906", "longitude": "-2.56249"}}, "title": "Staff Nurse (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916202148", "validThrough": "2020-11-13T23:59:59+0000"}