{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pr"}}, "datePosted": "2020-10-27T13:52:31+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Band 5 Dietitian who is interested and motivated to work within established community clinics, care homes and patient’s own homes. This rewarding community role provides you with a wide range of opportunities to develop your practice and work alongside an experienced and welcoming Dietetic Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your caseload will be varied within primary care, to include nutrition support, enteral feeding, non-complex gastroenterology and weight management. Previous experience in community working is desirable but not essential and you will have the support of specialist Dietitians in a variety of clinical areas across the service. The service operates across Hull and the East Riding of Yorkshire with the Team consisting of 9 Dietitians, 4 Dietetic associate Practitioner and 2 administration and clerical staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinical Supervision is a valued part of our timetable and is routinely scheduled into your work. We offer a probationary period when starting to enhance your induction and promote safe and effective professional consolidation once qualified. We endeavour to support your role where we can and ensure that we offer a wide range of opportunities for learning and development; we hold monthly group supervision and quarterly CPD sessions. We take students for B and C placements and expect the post-holder to be directly involved in their training after a period of induction.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer a two week induction planner once successful for the post and each candidate is given the opportunity to settle within the team and undertake shadowing and access any support they require. We are a friendly and enthusiastic team and we have a drive to promote professional development both individually and collectively. We welcome your application. If you are still studying but due to qualify in 2020 we would be happy to consider your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carla Hume / Jo Devon on 01482303667&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124994.jpg", "name": "City Health Care Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull &amp; ER Dietetics, Highlands Health Centre, Hull", "postalCode": "HU3 4AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7302", "longitude": "-.374505"}}, "title": "Dietitian - This post may attract a Recruitment Premium", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244804", "validThrough": "2020-11-08T23:59:59+0000"}