{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-30T10:46:27+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 3 Medical Laboratory Assistant in Blood Sciences. The post is based in Pathology at Broomfield Hospital in Chelmsford, Essex.&lt;br /&gt;&lt;br /&gt;The Pathology department provides a service to in-patients and to the wider community. Blood Sciences is a division of Pathology where blood samples (and some other types) are analysed and interpreted by skilled laboratory staff to enable clinicians to diagnose and monitor medical conditions. This post-holder will initially work in the Biochemistry laboratory, but rotation and multi-disciplinary working may be required at a later stage.&lt;br /&gt;&lt;br /&gt;Clinical Biochemistry involves the detection and measurement of many different substances in biological samples. This includes hormones, minerals, vitamins, proteins, drugs and many more. The department utilises automated analysers for the majority of its workload. Several thousand tests are processed every week.&lt;br /&gt;&lt;br /&gt;The role of a Medical Laboratory Assistant (MLA) is essential for the laboratory to provide a safe and efficient service by providing support to qualified Biomedical Scientists. An MLA working in the laboratory will perform duties such as receiving samples into the department, registering them onto the computer system, preparing the samples for analysis, performing some maintenance tasks on laboratory equipment, loading samples onto analysers, filing and retrieval of samples, preparing reagents, collecting data, answering queries and general housekeeping and administrative tasks.&lt;br /&gt;&lt;br /&gt;The successful applicant should be enthusiastic with an interest in healthcare science and a minimum of 5 GCSEs or equivalent. &lt;br /&gt;&lt;br /&gt;There may be a requirement for some weekend working, with the department moving towards an Agenda for Change shift pattern in the future.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMarcus McDougallJob titleBlood Sciences ManagerEmail addressmarcus.mcdougall@meht.nhs.ukTelephone number01245 515089Additional contact information&lt;/p&gt;\n&lt;p&gt;Beverley Farley&lt;br /&gt;Biochemistry&lt;br /&gt;Beverley.farley@meht.nhs.uk&lt;br /&gt;01245 515852&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield Hospital, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Medical Laboratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249782", "validThrough": "2020-11-13T23:59:59+0000"}