{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-04T16:01:22+0000", "description": "&lt;h1&gt;&lt;strong&gt;Senior Healthcare Support Worker&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Full Time 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Male Acute Mental Health Service to join a highly motivated and dynamic team delivering person-centred care for patients at Dorothy Pattison Hospital on Langdale Ward.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work as part of the MDT to deliver outstanding care to this vulnerable group of patients. This includes: conducting mental health observations, facilitating 1:1 time with patients, escorting patients outside the ward, leading and supporting therapeutic activities, meal time support, physical health observations, accurate recording of clinical details, de-escalation and management of challenging behaviours and occasionally, support with personal care. As a senior HCSW you will be expected to demonstrate initiative, role model good practice and support less experienced colleagues to ensure patients receive the best care. If successful, you will work closely with the ward management team, MDT, patients, carers and family.&lt;/p&gt;\n&lt;p&gt;Whilst experience working in acute psychiatry/urgent care is desirable, we will consider applications which indicate a sound understanding of the core principles underpinning the service, along with drive and enthusiasm and the right values for working in this challenging environment. We will provide you with training and supervision to support you as you begin your journey as part of the team and develop your professional interests. All staff are supported through clinical and management supervision, and participation in Team Meetings and Reflective Practice is encouraged.&lt;/p&gt;\n&lt;p&gt;Other benefits include generous Annual Leave and Pension provision, and Employees’ Lease Car Scheme.&lt;/p&gt;\n&lt;p&gt;If you are interested in this opportunity to develop your career and help people achieve positive outcomes at a challenging time, we would like to hear from you. There is more information about this exciting opportunity below, but the best way to find out what it’s like to work for team BCHFT is to talk to us! Potential candidates are invited to get in touch to discuss applications or visit the ward prior to interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristopher MooreJob titleWard ManagerEmail addresschristopher.moore7@nhs.netTelephone number01216128530/8535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heath Lane Hospital, West Bromwich", "postalCode": "B71 2BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.538", "longitude": "-1.99211"}}, "title": "Senior Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256552", "validThrough": "2020-11-18T23:59:59+0000"}