{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum Inclusive"}}, "datePosted": "2020-11-06T08:16:55+0000", "description": "&lt;p&gt;We are looking to recruit Band 7 Charge Nurse / Sister to enhance our senior team within our A &amp; E department at King George Hospital.&lt;/p&gt;\n&lt;p&gt;As an Acute Trust serving a population of approximately 700,000 our Emergency Department is extremely busy which provides our staff with exceptional opportunities for learning and development. Providing high quality patient care is at the heart of our work, as a Band 7 Charge Nurse / Sister you will take responsibility for managing a team of nurses in the initiation, delivery and immediate care of a group of patients within ED and you will participate in the further development of the service. You will be caring for patients with a wide spectrum of medical conditions across the department. If you are looking for the next step in your career and want to be part of a frontline department with a strong team spirit then please apply online today&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal meeting please contact:&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal meeting please contact: Emma Beard Deputy Matron on 01708435000 ext. 8818 or email emma.beard1@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Oyinda Agoro, Recruitment Advisor, on 01708 435000 ext. 2291.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King George Hospital, Ilford", "postalCode": "IG3 8YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5805", "longitude": ".112133"}}, "title": "Band 7 Senior Sister Charge  Nurse -ED KGH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258882", "validThrough": "2020-11-22T23:59:59+0000"}