{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109830", "minValue": "82022", "unitText": "YEAR", "value": "£82,022 - £109,830 per annum, including London Wei"}}, "datePosted": "2020-10-05T16:46:20+0100", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust is one of the UK’s largest and busiest teaching hospitals with over 1.5 million patient contacts a year and more than 13,000 staff based across five main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;/p&gt;\n&lt;p&gt;DETAILS / SUMMARY OF JOB&lt;/p&gt;\n&lt;p&gt;As a senior employee of the Trust you will work in close co-operation with, and support other clinical, medical professional and managerial colleagues in providing high quality healthcare to the Trust’s patients. Integral to these responsibilities is the following:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The provision of a first class clinical service&lt;/li&gt;\n&lt;li&gt;Effective leadership to all staff engaged in the specialty&lt;/li&gt;\n&lt;li&gt;Sustaining and developing teaching and research in conjunction with King’s College London&lt;/li&gt;\n&lt;li&gt;Undertaking all work in accordance with the Trust’s procedures and operating policies&lt;/li&gt;\n&lt;li&gt;Conducting clinical practice in accordance with contractual requirements and within the parameters of the Trust’s service plans&lt;/li&gt;\n&lt;li&gt;Maintaining the confidence of business plans and development strategies formulated for the specialty, the Division or the Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must be fully registered with the GMC and hold a Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent to be eligible for interview.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years), therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975, and as such, it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Dr Debbie Ramsey&lt;/p&gt;\n&lt;p&gt;Job title PRUH Stroke Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address Deborah.ramsey@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01689 865880&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Sree Andole (PRUH Post-Acute Medicine Clinical Director) Sreeman.andole@nhs.net / 01689 865818&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 29/11/2020, midnight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AAC Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Consultant Stroke Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213678", "validThrough": "2020-11-29T23:59:59+0000"}