{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa, based on full time hours"}}, "datePosted": "2020-10-26T12:30:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;*********£2,500 ‘Golden Hello’ Payment**********&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Awarded with this vacancy! Apply now and if you are successfully recruited you will receive £2500- does not apply to current Hampshire and Isle of Wight NHS Staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are relocating to the area then we are able to offer accommodation for up to three months and offer a relocation package up to £8,000.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Are you an exceptional Mental Health Nurse looking for &lt;/strong&gt;a &lt;strong&gt;change in your career path&lt;/strong&gt;? &lt;strong&gt;Are you ready for a new and exciting challenge?&lt;/strong&gt; If so then we would love to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At Bluebird House you will have the opportunity to work with some of the most complex young people in the country. We offer a fun and dynamic environment where we priorities the best outcomes for the young people we care for.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bluebird House is one of six Forensic Children’s mental health units in the country and one of only two that accept both male and female patients. The young people we look after are aged between 12 - 18 years of age who are experiencing complex mental health difficulties and challenging behavior. The young people we work with are very challenging but looking after them is incredibly rewarding. Unlike adult sites you feel you can help them before they reach adulthood and we have a very high success rate. Many of the young people we help will have had other placements breakdown before being admitted to Bluebird so we spend a lot of time building a relationship with them by providing a safe, controlled environment where we act as role models. Due to our continued success we are currently in the process of opening a new ward and are currently recruiting for new staff to join the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a staff nurse you will develop, implement and evaluate care plans in conjunction with service users, carers and other professionals ensuring individual needs are met. You will carry out all relevant forms of care and will be designated to take charge of a ward in the absence of a charge nurse.&lt;/span&gt;Bluebird House operates 24 hour cover therefore, you are required to work shifts which will include nights. There are a variety of shifts available and all requests for flexible and part time working will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Click the video link at the side to find out more about working in our team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to Talk Flexible Working -&lt;/strong&gt; all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2RZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.5288"}}, "title": "Staff Nurse- Mental Health, Learning Disability, Children&#39;s Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242423", "validThrough": "2020-11-23T23:59:59+0000"}