{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "dependant on experience"}}, "datePosted": "2020-10-26T14:16:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Recovery Nurse Practitioner&lt;/strong&gt;&lt;strong&gt;s&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Chief Inspector of Hospitals has rated The Whittington Hospital NHS Trust in Islington, North London, as Good overall, with caring at the trust rated as Outstanding.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whittington hospital theatres have 6 main theatres and a Day treatment centre which has 4 theatres. Specialities include Trauma and Orthopaedic, General Surgery, Colo- Rectal Bariatric, Gynaecology, Breast, Urology, Paediatric Dental and Urology and Emergency surgeries.&lt;/p&gt;\n&lt;p&gt;At the Whittington we are dedicated to the delivery of highest quality of care. We pride ourselves in being forward thinking and engaging with of our staff. We are currently looking to recruit band 5 Recovery nurses for our friendly and supportive theatres team. We are looking for enthusiastic, motivated nurses with a positive attitude.&lt;/p&gt;\n&lt;p&gt;We would prefer experienced recovery nurses. Qualified nurse who have surgical ward experience are welcome to apply. Applicants should have excellent communication and inter personal skills, the ability to work as part of the Recovery and multi-disciplinary team. You will have an understanding of recovery principles, be able to undertake appropriate duties including assisting in the delivery of patient care during the post-operative phase. Applicants will need underpinning theoretical knowledge and practical experience, contributing in the assessment, planning, implementation and evaluation of patient care.&lt;/p&gt;\n&lt;p&gt;There is opportunity for personal development to enhance skills and enable further career progression. You must be able to participate in the out of hours rota which includes night duty, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;For further details and informal visits, please contact-&lt;/p&gt;\n&lt;p&gt;Francis Johnston&lt;/p&gt;\n&lt;p&gt;Team Leader Band 7, Main Theatres&lt;/p&gt;\n&lt;p&gt;Landline 020 7288 3602&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFrancis JohnstonJob titleRecovery Team LeadEmail addressfrancisjohnston@nhs.netTelephone number0207 288 3602Additional contact information&lt;/p&gt;\n&lt;p&gt;Francis Johnston can be contacted Monday to Friday from 8am to 6pm.&lt;/p&gt;\n&lt;p&gt;email francisjohnston@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington Hospital, London", "postalCode": "N195NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Recovery Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242859", "validThrough": "2020-11-09T23:59:59+0000"}