{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T14:46:40+0000", "description": "&lt;p&gt;&lt;span&gt;The opportunity has arisen for a full time (37.5 hours per week) Registered Mental Health Nurse Band 5 who is enthusiastic and motivated to join our Adult inpatient team on Treatment Ward, based at the Cavell Centre in Peterborough.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ideal candidate will have a commitment to team work, a sense of accountability, plus an ability to work under pressure.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff and encourage greater opportunities within the Trust.&lt;br /&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team making a difference to our community then we want to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return for your commitment and enthusiasm, working within the unique Adult 3-3-3 inpatient system will give you the opportunity to practice a full range of core mental health nursing skills and to also teach, supervise and support colleagues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are an enthusiastic and motivated staff nurse looking for a new challenge or a student looking for your first job post qualifying, then we would love you to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer regular individual and group supervision and a 5-day induction on commencement in post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;CPFT are dedicated to the development of its workforce with many in house leadership courses and clinical skills modules. There is access to professional leadership programmes through the NHS Academy. The Trust also has strong relationships with Anglia Ruskin University and has access to higher education modules to support continuing professional development. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent patient care, research and education.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Benefits of working for CPFT include:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Annual leave allowance 27 days plus bank holidays (this may increase depending on NHS service)&lt;br /&gt;Pension scheme&lt;br /&gt;Flexible job share opportunities&lt;br /&gt;Salary sacrifice schemes&lt;br /&gt;Staff discount schemes&lt;br /&gt;Professional development via the CPFT Academy which provides in-house training programmes&lt;br /&gt;Stress awareness training&lt;br /&gt;Mindfulness training&lt;br /&gt;Counselling service&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please read the Job Description for a comprehensive guide to what the job entails, and the personal specification to see what requirements / skills are required to fulfill the post&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lizzie Benson - Ward Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;lizzie.benson@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01733 218617&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edith Cavell Centre, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245035", "validThrough": "2020-11-10T23:59:59+0000"}