{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T16:01:10+0000", "description": "&lt;p&gt;Band 5 Theatre Practitioners - Rugby St Cross Hospital.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Band 5 Theatre practitioners to join our busy Theatre Department. Rugby St Cross Hospital is part of UHCW NHS trust . We currently have 5 Theatres at our Rugby St Cross Hospital site with further plans to expand. Our Surgical Specialties include Elective Orthopedics, Ophthalmic Surgery, Plastics and Pain .&lt;/p&gt;\n&lt;p&gt;We are looking for HCPC / RN Registered Practitioners. Experience in Theatre Practice is desirable but full training will be given to the right candidate. As a provider of patient-centered care, we are passionate about delivering excellent care to our local and extended population. I n recent years, our Theatres have achieved large gains in productivity and efficiency through improved capacity management and real-time tracking of Theatre activity.&lt;br /&gt;UHCW is a large teaching trust providing innovative and leading edge clinical services to Coventry and Warwickshire and beyond. We are closely integrated to the Medical School at Warwick University and are part of various surgical rotations. We are a Cancer Centre and a key provider of secondary and tertiary services. &lt;br /&gt;&lt;br /&gt;Candidates will be committed to Continuous Professional Development and possess excellent communication and organisational skills. Delivering care of the highest and Safest standard is required at all times. In return, full training in all aspects of the service will be given to the successful candidate. We have a dedicated team of Theatre Clinical Educators who will support and guide you through the excellent range of opportunities that UHCW NHS Trust has to offer.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Larissa Belgrove&lt;/p&gt;\n&lt;p&gt;Job title: Theatre Manager&lt;/p&gt;\n&lt;p&gt;Email address: larissa.belgrove@UHCW.NHS.UK&lt;/p&gt;\n&lt;p&gt;Telephone number: 01788 663779&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hospital of Saint Cross, Rugby", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Theatre Practitioner - Rugby", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243277", "validThrough": "2020-11-09T23:59:59+0000"}