{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 pa (pro rata)"}}, "datePosted": "2020-11-03T11:00:51+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and experienced Specialist Nurse to work as part of our multidisciplinary team and lead the weight management clinic at Seaside View Child Development Centre, Brighton General Hospital.&lt;/p&gt;\n&lt;p&gt;The Specialist Nurse role will involve using advanced clinical skills and expert knowledge to assess, diagnose and support the needs of children and young people with complex needs who are known to Child Development Service. Training and professional development will be offered as part of your continuing development, and to help you meet the skills, knowledge and competencies required for this post.&lt;/p&gt;\n&lt;p&gt;You will also provide clinical leadership/expert knowledge to the nursing teams and other professionals through clinical advice and support, and through caseload management.&lt;/p&gt;\n&lt;p&gt;The emphasis will be on providing clinical expertise, advice and support for children and their families, working in collaboration with the Paediatricians as well as the wider multidisciplinary Child Development Service including Physiotherapists, Occupational Therapists, Speech and Language Therapists and Specialist Early Years Practitioners.&lt;/p&gt;\n&lt;p&gt;The post holder will also lead a multidisciplinary Weight Management Service for children and young people 9am-5pm on Thursdays throughout the year, working with colleagues from Brighton and Sussex University Hospitals NHS Trust (BSUH) and outside agencies. In addition to undertaking assessment of children and young people, they will have the opportunity to widen their portfolio by providing operational leadership for the service and sharing expertise with other professionals.&lt;/p&gt;\n&lt;p&gt;The post holder will need to have experience of working within a variety of clinical settings, particularly community working as part of a multi-professional team.&lt;/p&gt;\n&lt;p&gt;The post holder will need to demonstrate advanced clinical assessment skills. ADI or ADOS training would be an advantage, but training appropriate to the role will be provided when/if required.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will have the opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Participate in in-service learning programmes&lt;/li&gt;\n&lt;li&gt;Develop specialist areas of practice, relevant to the team&lt;/li&gt;\n&lt;li&gt;Supervise and support development of other staff within your team and training professionals&lt;/li&gt;\n&lt;li&gt;Assist in shaping future clinical practice for the nursing team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vanessa Sharp&lt;/p&gt;\n&lt;p&gt;Clinical Service Manager&lt;/p&gt;\n&lt;p&gt;vanessasharp@nhs.net&lt;/p&gt;\n&lt;p&gt;07768 278940&lt;/p&gt;\n&lt;p&gt;Fiona Springham&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Nurse - Child Development and Disability&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;fiona.springham@nhs.net, 01273 696011 ext. 4223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Specialist Nurse and Weight Management Clinic Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253589", "validThrough": "2020-11-15T23:59:59+0000"}