{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on grade"}}, "datePosted": "2020-11-03T14:16:55+0000", "description": "&lt;p&gt;We are looking to recruit suitably qualified doctors to work across all grades and specialties for work ranging from a single shift to an extended post, with evening, weekend and on-call shifts available. Specialties include Anaesthetics, Emergency Department and associated areas, General Medicine, Obstetrics and Gynaecology, Orthopaedics, Paediatrics and General Surgery.&lt;/p&gt;\n&lt;p&gt;As this is Bank work, it is on an ‘as and when’ basis with no guaranteed hours.&lt;/p&gt;\n&lt;p&gt;Full Registration with the GMC is required, as well as having achieved the appropriate level of competencies to carry out the role you have been employed to do.&lt;/p&gt;\n&lt;p&gt;Duties within the shifts which you are booked to fulfil are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;to liaise between nurses, other clinicians, patients, relatives in order to support safe care&lt;/li&gt;\n&lt;li&gt;to attend and participate in board rounds, ward rounds and other related daily unit activities&lt;/li&gt;\n&lt;li&gt;to provide appropriate workplace supervision to other staff as and when needed as requested&lt;/li&gt;\n&lt;li&gt;to maintain high standards of professionalism, especially in relation to documentation&lt;/li&gt;\n&lt;li&gt;to arrive on time for the shift and be available for work from the arranged start time&lt;/li&gt;\n&lt;li&gt;to co-operate with the workforce team in relation to the administration of the shift&lt;/li&gt;\n&lt;li&gt;attend local induction as appropriate when working in new areas&lt;/li&gt;\n&lt;li&gt;to comply with all local policies, including upholding the trust’s values and behaviours&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS at a cost of £43.50, this will be deducted from your first Trust salary.&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Medical Staffing Team medical.staffing@stockport.nhs.uk 0161 419 5020&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stepping Hill Hospital", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Bank Medical Staff", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254312", "validThrough": "2020-11-08T23:59:59+0000"}