{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T16:30:40+0000", "description": "&lt;p&gt;Are you an experienced AHP ready to take on a new challenge of leading multi- professional inpatient therapy teams at Calderdale and Huddersfield. You will be responsible for the operational management of Dietitians, Occupational Therapists , Physiotherapists and Speech and Language Therapists as well as assistant and administration staff in these areas.&lt;/p&gt;\n&lt;p&gt;This post is open to any of the therapy professions listed above.&lt;/p&gt;\n&lt;p&gt;You will hold responsibility for the operational management of the teams on a day to day basis requring a comprehensive knowledge of using a range of appropriate management and leadership skills and specialist clinical skills within your profession.&lt;/p&gt;\n&lt;p&gt;The post requires people with passion and vision to lead the inpatient therapy services, embracing discharge to assess and Right to Reside principles and being a role model for the inpatient therapy services. You will work closely with the Inpatient Therapy Manager. There is potential to have a clinical element to the role to maintain skills and competencies and work alongside the inpatient therapy teams.&lt;/p&gt;\n&lt;p&gt;You will be reponsible for the effective and efficient delivery of services ensuring effective monitoring of budgets and agreed national or local performance objectives.&lt;/p&gt;\n&lt;p&gt;You will need to be an excellent communicator, have strong interpersonal, leadership, supervsion, training and organisational skills with the ability to work flexibly under your own initiative, as well as part of multi-professional health team. We sit in the Community divison so have excellent links with community nursing and therapy colleagues.&lt;/p&gt;\n&lt;p&gt;You will need a passion and ability to act as an ambassador for your own profession as well as a strong desire to share skills across blurred inter-professional boundries&lt;/p&gt;\n&lt;p&gt;For further iformation please contact Karen Turkington, Inpatient Therapy Services Manager on 07468 708613.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren TurkingtonJob titleInpatient Therapy Services ManagerEmail addresskaren.turkington@cht.nhs.ukTelephone number07468 708613&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HRI and CRH, Halifax", "postalCode": "HX3 0PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7053", "longitude": "-1.85728"}}, "title": "Inpatient Therapy Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256658", "validThrough": "2020-11-15T23:59:59+0000"}