{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "On experience"}}, "datePosted": "2020-10-12T11:20:59+0100", "description": "&lt;p&gt;Miller Street Surgery is a busy, friendly GP Surgery serving approximately6,600 patients. We are recruiting for an enthusiastic, hard-working and motivated Healthcare Assistant to join our dedicated team.&lt;/p&gt;\n&lt;p&gt;This is a varied role providing dedicated support to both the clinical and business agenda of the organisation. The post holder will be expected to provide clinical support to the nursing and clinical teams. The person ideally will have a minimum of 12 months Health care assistant (HCA) experience.&lt;/p&gt;\n&lt;p&gt;Excellent communication, clinical facilitation, and time management skills are required together with an ability to cope under pressure. The person must be self-motivated, computer literate, and able to work autonomously without direct supervision. A familiarity with EMIS web would be advantageous.&lt;/p&gt;\n&lt;p&gt;A good understanding of clinical programmes such as QoF, enhanced services, QiF and LIS would be advantageous as you will be expected to support the delivery of these programmes.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible to work part time hours between 8.00am and 6.00 pm on a rota basis. Hours will be confirmed with the successful candidate.  &lt;/p&gt;\n&lt;p&gt;Only those applicants selected for interview will be contacted.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal visits are encouraged and can be arranged on request.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Dependent on experience.&lt;/p&gt;\n&lt;p&gt;Contact: Bernadette McCormick&lt;/p&gt;\n&lt;p&gt;Bernadette.mccormick@northstaffs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle under Lyme", "postalCode": "ST5 1JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0138", "longitude": "-2.21842"}}, "title": "HealthCare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222083", "validThrough": "2020-11-20T23:59:59+0000"}