{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum incl.HCAS"}}, "datePosted": "2020-10-26T16:16:47+0000", "description": "&lt;p&gt;We are looking for someone who is motivated, enthusiastic and has excellent interpersonal, communication and organizational skills along with the ability to work with a complex range of clients in an innovative Pan -London sexual health service&lt;/p&gt;\n&lt;p&gt;You will ideally be able to provide specialist sexual health advice, information, education and counselling to patients diagnosed with sexually transmitted infections including HIV and also to provide effective partner notification for STIs and HIV over the telephone.&lt;/p&gt;\n&lt;p&gt;You will be familiar with the care pathways for young people and vulnerable adults and be able to appropriate liaison and referral to statutory organisations such as social services and voluntary external agencies.&lt;/p&gt;\n&lt;p&gt;You will also rotate into the John Hunter Clinic where you will you work as an autonomous practitioner, which involves planning and carrying a caseload, providing health education, counselling support and behavioural change interventions which include risk assessment and complex case management of patients.&lt;/p&gt;\n&lt;p&gt;You will possess either a degree in Psychology, Health Promotion or another relevant health related degree. Or be an RGN/RMN (1st level) or have a CQSW qualification, and have previous experience as a Sexual Health Adviser in a GUM clinic or equivalent setting within the UK.&lt;/p&gt;\n&lt;p&gt;A recognised counselling or risk reduction qualification is desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sophie Jones&lt;/p&gt;\n&lt;p&gt;Job title: SHL Service lead&lt;/p&gt;\n&lt;p&gt;Email address: Sophie.Jones@Chelwest.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminister Hospital-Fulham Road site, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Sexual Health Adviser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243372", "validThrough": "2020-11-09T23:59:59+0000"}