{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-06T15:46:42+0000", "description": "&lt;p&gt;We are looking for a versatile, motivated, committed and experienced mental health nurse to work with Older People who are living with a functional and/or organic illness. We are particularly searching for a person with a special interest in the care of adults that live with a dementia. The role will also involve providing support to all Trust staff with any age patients experiencing mental health crises, ensuring care given is safe and complies with relevant legislation.&lt;/p&gt;\n&lt;p&gt;You will care co-ordinate a caseload of service users with varying levels of needs and complexities and deliver high quality care and support. You will be expected to contribute to the assessment of new referrals, planning care and managing risk. You will also actively contribute to a multidisciplinary approach to the management of the health and social care needs of the service users and assist in discharge planning. Part of the role will involve working closely with staff on our specialist Dementia Unit, promoting best practice for this patient group. In addition the post holder would be expected to lead on the roll out of the new Dementia Care bundle with support from the Clinical Lead for Mental Health.&lt;/p&gt;\n&lt;p&gt;You will be expected to supervise junior staff and student nurses during their placement within the team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an excellent and effective teacher and will be expected to regularly participate in the Trust&#39;s mandatory teaching schedule regarding Mental Health Law and Dementia Awareness, along with Dementia Friends training.&lt;/p&gt;\n&lt;p&gt;In addition as a Shift Lead you will be expected to manage governance and HR issues with support from the Clinical Lead for Mental Health.&lt;/p&gt;\n&lt;p&gt;We are a small, supportive and highly motivated team with a strong commitment to learning and practice development. As a service we hold complex case and risk management discussions alongside team formulations and individual supervision.&lt;/p&gt;\n&lt;p&gt;You can expect to receive&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly supervision&lt;/li&gt;\n&lt;li&gt;Informal support&lt;/li&gt;\n&lt;li&gt;Regular training&lt;/li&gt;\n&lt;li&gt;A commitment to support you in your own personal development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachael Collins - Matron Older People&lt;/p&gt;\n&lt;p&gt;Email address: rachael.collins1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 456111 extn.3307&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RHH, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Shift Lead - Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260451", "validThrough": "2020-11-22T23:59:59+0000"}