{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T18:00:35+0000", "description": "&lt;p&gt;CONSULTANT PSYCHIATRISTS IN EMOTIONAL WELLBEING AND MENTAL HEALTH SERVICES (EWMHS) North East London NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Would you like to be at the forefront of exciting developments within children and young people’s services? Do you have a passion for helping young people struggling with mental health problems? Then, come and work for NELFT’s new Emotional Wellbeing and Mental Health Service (EWMHS), and be part of one of the UK’s most innovative healthcare services. NELFT is an experienced provider of mental health and community services for people of all ages across the four London boroughs of Barking &amp; Dagenham, Havering, Redbridge and Waltham Forest. We also provide children’s mental health services across Essex. NELFT is at the forefront of being progressive with cutting edge, award winning expertise. You can find out more about us by visiting the NELFT website.&lt;/p&gt;\n&lt;p&gt;About NELFT’s new EWMHS NELFT’s EWMHS is for anyone aged between 0-18, with emotional and mental health problems, living in the Southend, Essex and Thurrock. The service is also for young people with special educational needs (SEN) up to the age of 25. The CAMHS Tier II and Tier III services no longer exist, replaced with an integrated EWMHS.&lt;/p&gt;\n&lt;p&gt;Applications are invited for a full time Consultant Psychiatrist post based in Chelmsford to work closely with another Consultant and Specialty doctor in the team. The post has received approval from the Royal College of Psychiatrists. The post holder will have Full GMC Registration, License to practise in the UK, MRCPsych and a CCT in Child and adolescent psychiatry or will be within 6 months of obtaining the CCT. Section 12 approval or eligibility for it and Approved Clinician status or eligibility for it is essential. We are looking for enthusiastic and flexible candidates who are committed to working in a multidisciplinary setting. All posts attract relevant Direct Clinical Care and Supporting professional activities and offers excellent CPD and study leave arrangements as well as good research and service development and leadership opportunities.&lt;/p&gt;\n&lt;p&gt;The Trust has excellent relationships with all stakeholders. The trust also has robust governance structures. We offer a range of NHS benefits including flexible working, the NHS Pension Scheme and the Childcare voucher scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Viviana Porcari (viviana.porcari@nelft.nhs uk) Associate Medical Director for Essex&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Gill Burns (gill.burns@nelft.nhs.uk) Deputy Integrated Care Director &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing the opportunities that are available, have professional registration and speak fluent English, please contact Dr Viviana Porcari, Consultant Psychiatrist, Associate Medical Director for Essex , NELFT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Room C302, County Hall, Duke Street, Chelmsford, CM1 1QH, Chelmsford", "postalCode": "CM1 1QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7348", "longitude": ".470062"}}, "title": "Consultant Psychiatrist EWMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245606", "validThrough": "2020-11-27T23:59:59+0000"}