{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 per annum, inc HCA"}}, "datePosted": "2020-10-30T10:17:00+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and well-organized Administrator to join our busy Trauma and Orthopaedics service at Princess Royal University Hospital. You will be responsible for providing an effective support service to Virtual Fracture Clinic, Physio’s and Consultant teams.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post offers an excellent opportunity for an enthusiastic and conscientious individual to be a part of a busy team. The work involves booking appointments on EPR and PIMS typing ad hoc clinic letters, checking, printing and filing letters from the Dscribe system, booking outpatient appointments, liaising with internal as well as external providers. You will be dealing with incoming queries and day-to-day administrative duties.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate must have experience of performing administrative duties, preferably in an NHS or private hospital setting, as well as excellent communication and organizational skills, be able to work well in a team and take instructions from several sources. We are looking for someone who can multitask, have strong admin abilities and can prioritise their own workload.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Familiar with I.T. packages, have a good telephone manner with the ability to take clear messages and perform general office duties. You will have a good general education with the equivalent of GCSE’s in English and Math’s at Grade A-C and have a keen eye for detail. A willingness to learn and develop skills will be positively encouraged. You will become part of an enthusiastic team and will play an instrumental part in the smooth running of the department. We value our diverse workforce and consider all applicants on the ground of their ability to do the job.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would like to take this opportunity to thank you for your interest in King&#39;s College Hospital NHS Foundation Trust and look forward to receiving your application for employment. This vacancy may close before the current listed closing date. You are advised not to delay submitting your completed application. Please note that if you have not heard from us within 3 weeks of the closing date of the advert to assume that you have not been shortlisted on this occasion. Previous Applicants need not apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At King’s, we fully support the right of all staff to equal opportunities and are committed to the development of a diverse workforce. Applications are welcome from anyone who meets the specific criteria of the post regardless of age, gender, disability, religion/ belief or sexual orientation.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Prajakta Sinha&lt;/p&gt;\n&lt;p&gt;Job title Assistant Service Manager, Trauma &amp; Orthopaedics (PRUH site)&lt;/p&gt;\n&lt;p&gt;Telephone number 01689-864456&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Junior Medical Secretary/Admin Assistant - Virtual Fracture Clinic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249689", "validThrough": "2020-11-06T23:59:59+0000"}