{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per anum, pro rata"}}, "datePosted": "2020-11-04T15:16:52+0000", "description": "&lt;p&gt;&lt;strong&gt;#TEAM 24 WANTS YOU....&lt;/strong&gt; Are you looking for a motivating and rewarding career? Do you thrive on a challenge and want to make a difference to patients at Lancashire Teaching Hospitals NHS Foundation Trust in the Medicine Division? Then come and join our dynamic, forward thinking team.&lt;br /&gt;&lt;br /&gt;Experienced or Newly Qualified we want to welcome YOU! Come and work with a fantastic team and be supported and encouraged to develop within your role as part of a rapidly developing ward with an established nursing team who strive to provide an excellent standard of care to all patients.&lt;br /&gt;&lt;br /&gt;We are looking to appoint dynamic individuals with strong interpersonal skills that will look forward to the challenges of nursing patients who have Gastric problems. This role would be suited to an individual who is highly motivated, committed and enthusiastic, with a desire to learn and develop strong clinical skills in caring for our patients.&lt;br /&gt;&lt;br /&gt;We will provide you with a full induction programme, accessible support and advice from the Medical Directorate Team. We will provide extensive on-going training and personal development with annual appraisals.&lt;/p&gt;\n&lt;p&gt;In addition to the many other benefits of working at Lancashire Teaching Hospitals NHS Foundation Trust, you may also be entitled to apply for our relocation package. As a Trust we recognise the importance of securing the right candidate for a role; and we therefore offer an attractive relocation package of £1,500 for any nurse relocating more than one hour away from their current address.&lt;/p&gt;\n&lt;p&gt;Interview date: To be confirmed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJacqueline MarlowJob titleWard ManagerEmail addressJacqueline.Marlow@lthtr.nhs.ukTelephone number01772 522319&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Staff Nurse - Gastroenterology (Ward 24)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256407", "validThrough": "2020-11-18T23:59:59+0000"}