{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Up to Band 7 - Pro rata"}}, "datePosted": "2020-10-17T14:23:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Psychotherapist/Art Therapist/Family Therapist/Social Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Up to Band 7 (Depending on experience &amp; Qualifications)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent: Fulltime or Part time working hours &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Covering across a number of Specialist Residential Children&#96;s homes (Complex Care) in Colchester, Takeley, Great Dunmow and Dunmow&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambian Group, the UK’s largest provider of specialist services in children’s residential care, education, mental health rehabilitation and learning disabilities, is looking for a dedicated individual to join the company as a Mental Health Practitioner. The post will require someone with previous experience of working with children presenting with complex needs, such as in CAMHS, specialist residential settings or Looked After Children’s services. The service provision is guided and informed by a number of theoretical models, including child development and attachment theories.&lt;/p&gt;\n&lt;p&gt;We offer excellent training and career progression opportunities as well as a variety of staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be providing a clinical service to young people placed within community residential setting by assessing and identifying their needs and meeting them through using a consultation model, with the exception of The Brambles where you will delivering direct therapy. The consultation sessions offer the team around the young person the opportunity to review the young person’s emotional wellbeing and/or behavioural presentation, discuss concerns and therapeutic approaches that will be delivered through the care team. You will be supporting with issues such as challenging behaviours, aggressive outbursts, self-harm, low mood &amp; suicidal ideation, PTSD, ADHD, anxiety, attachment issues, relationships between the young people in the home, protective behaviours etc. The aim is to work collaboratively with the management and staff of the residential homes in developing and sharing a vision of the therapeutic work which enhances a young person’s life opportunities and choices and helps them maximise their strengths. The Mental Health Practitioner will play a key role in the continuous assessment of young people’s mental health and in supporting staff through the delivery of appropriate training and workshops that upskills staff working with the young people to be able to better meet their emotional needs. The Mental Health Practitioner is also available to de brief staff that are experiencing difficulties with processing traumatic events.&lt;/p&gt;\n&lt;p&gt;Dependant on your experience you may be required to supervise other staff member as identified by the Clinical Director.&lt;/p&gt;\n&lt;p&gt;Further duties are described in the attached Job Description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated, forward thinking Mental Health Practitioner to join our friendly team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered with the relevant professional organisation (HCPC,BAAT, NMC, Social Worker&#96;s England)&lt;/li&gt;\n&lt;li&gt;Be a strong team player, with excellent communication skills&lt;/li&gt;\n&lt;li&gt;Sound organisational and time management skills&lt;/li&gt;\n&lt;li&gt;Experience in working with children with complex needs/Look After Child&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Beneficial&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience in working with children &amp; adolescents is advantageous&lt;/li&gt;\n&lt;li&gt;CAMHS experience&lt;/li&gt;\n&lt;li&gt;Social Worker&#96;s background/Psychotherapist/Art psychotherapist/Family therapist&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full support from a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Regular clinical supervision&lt;/li&gt;\n&lt;li&gt;Meetings and peer support supervision&lt;/li&gt;\n&lt;li&gt;Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Research opportunities&lt;/li&gt;\n&lt;li&gt;Internal/external training on new initiatives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also learn from some of the most dedicated and inspirational people in our profession.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to meet the person specification in order to be offered this post.&lt;/p&gt;\n&lt;p&gt;Cambian is committed to Safeguarding and protecting the young people and service users within our care.&lt;/p&gt;\n&lt;p&gt;All candidates will be subject to an enhanced DBS check and reference checks.&lt;/p&gt;\n&lt;p&gt;Cambian is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Essex", "postalCode": "CO1"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8884", "longitude": ".910296"}}, "title": "Psychotherapist/Art therapist/Family therapist/Social worker  -  Essex", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231370", "validThrough": "2020-11-15T23:59:59+0000"}