{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:01:52+0000", "description": "&lt;p&gt;The Primary Care Support Service Management Team manage a number of outsourced service providers which together provide a range of support functions which are essential to the running of primary care services.&lt;/p&gt;\n&lt;p&gt;The team bring together commercial, contracting and performance management capabilities which work to ensure that service providers are held to account for delivering effective and value for money contracted services. The team work closely with primary care and public health commissioning teams, and NHS Digital.&lt;/p&gt;\n&lt;p&gt;Primary Care Support Services include: Payments to GPs, ophthalmic contractors and pharmacies; GP pensions; patient registrations; cervical screening administration; administering the National Performers Lists; and logistics services for medical records and contractor supplies.&lt;/p&gt;\n&lt;p&gt;The team are also responsible for oversight of an ambitious transformation programme to improve the quality and efficiency of these services through introduction of new IT systems and improved workflows.&lt;/p&gt;\n&lt;p&gt;As a Business Support Co-ordinator, the post holder will work as part of a dynamic team in delivering an effective service supporting managers and staff across the Service Management Team to support the Business and Governance Manager in discharging their responsibilities.&lt;/p&gt;\n&lt;p&gt;In particular the post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide high quality project, service, initiative and administrative support including information and analysis.&lt;/li&gt;\n&lt;li&gt;Personal Assistant and minute taking experience&lt;/li&gt;\n&lt;li&gt;Undertake reporting and analysis of information to support delivery.&lt;/li&gt;\n&lt;li&gt;Support the Business and Governance Manager to ensure the effective operation of the team.&lt;/li&gt;\n&lt;li&gt;Book travel arrangements for the team.&lt;/li&gt;\n&lt;li&gt;Support the management of the team’s central email account&lt;/li&gt;\n&lt;li&gt;Provide administrative support to monthly meetings ensuring that meeting papers are produced in a timely manner.&lt;/li&gt;\n&lt;li&gt;Provide secretariat cover for Board meetings when required.&lt;/li&gt;\n&lt;li&gt;Provide diary management for the team&lt;/li&gt;\n&lt;li&gt;Support management of project/programme activities including gathering and updating documentation&lt;/li&gt;\n&lt;li&gt;Support the tracking and reporting of key actions, risks and issues.&lt;/li&gt;\n&lt;li&gt;Support the tracking and reporting of audit actions.&lt;/li&gt;\n&lt;li&gt;Support the management of the team’s information archive and shared file system.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Location to be discussed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela MarksJob titleBusiness &amp; Governance ManagerEmail addressangela.marks3@nhs.netTelephone number07702 410338&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House / Skipton House, Leeds / London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Business Support Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242132", "validThrough": "2020-11-09T23:59:59+0000"}