{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-22T09:31:26+0100", "description": "&lt;p&gt;We would like to recruit to our new paediatric dietetic development post. We are a friendly department of 26 dietitians, supported by dietetic support workers, special feed unit staff and admin staff. This post offers fantastic development opportunities for someone wanting a career in Paediatric Dietetics. The post largely focuses on acute specialities including BMT and oncology, surgery and cardiology but will also offer some support to our metabolic team. Our wider specialities also include nephrology, diabetes, gastroenterology, inherited metabolic disease, Barth’s syndrome, neonatology, neurology including ketogenic, obesity, PICU, burns, medical, cystic fibrosis and some cross cover will be required. We also have a rapidly growing outpatient service which includes feeding problems, faltering growth, allergy and complex needs and the post will support this as felt appropriate.&lt;/p&gt;\n&lt;p&gt;Our department is committed to student training, quality improvement, research and audit. This new role will be led and supervised by a specialist dietitian and also you will have access to a dietetic mentor. We pride ourselves on our commitment to continuing professional development and will provide a sound platform for your developing career.&lt;/p&gt;\n&lt;p&gt;We have good clerical and IM&amp;T support. We are part of the newly merged University Hospitals Bristol and Weston NHS Foundation Trust (UHBW).&lt;/p&gt;\n&lt;p&gt;Bristol is a fantastic city to live and work in and full of opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ideally you will be able to evidence that you have gained considerable paediatric experience within your student placement or already have gained some adult dietetic experience and have a passion to learn paediatrics within a tertiary unit. You must be enthusiastic and flexible. Additionally, you must be a good communicator with both adults and children and a team player who can self-direct your learning quickly. You should be computer literate and enjoy working with children.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Laura Sealy 0117 3428802 &lt;/span&gt;&lt;span&gt;laura.sealy@uhbw.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kerry Houlden 0117 3428802 &lt;/span&gt;&lt;span&gt;kerry.houlden@UHBW.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Sealy Specialist Paediatric Dietitian Laura.Sealy@UHBW.nhs.uk 0117 3428802&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Kerry Houlden Paediatric Dietitan 0117 3428802&lt;/p&gt;\n&lt;p&gt;Kerry.Houlden@UHBW.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Hospital for Children, Bristol", "postalCode": "BS2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4578", "longitude": "-2.5973"}}, "title": "Dietitian (Paediatrics)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237715", "validThrough": "2020-11-09T23:59:59+0000"}