{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T11:59:03+0000", "description": "&lt;p&gt;Working within a District Nursing team provides an exciting opportunity for staff nurses to gain both experience and skills within a primary care setting. Our care communities consist of a multi-professional workforce, who strive to deliver a fully integrated approach to patient care delivery. Northwich Care Community has a part time vacancy of 22.5 hours worked over 3 days, covering 7 days a week over a 3 day period covering the hours between 8am – 5pm, 7.5 hours per day.&lt;/p&gt;\n&lt;p&gt;Do you enjoy working independently, but also like to feel supported and valued by the rest of the team? Are you innovative, committed, motivated and caring? Do you have good time management and able to prioritise? Would you like to be involved in transforming and developing services within the community? If so this could be the role for you!&lt;/p&gt;\n&lt;p&gt;Community Nurses are responsible for the assessment and review of nursing needs and the delivery of high quality holistic care within the community setting. Working in the community will enable you to be part of a positive, pro-active, supportive team, who pull together for the benefit of our patients. Our values are underpinned by our commitment and dedication to improving patient outcomes. This is achieved by adopting a collaborative approach to patient centred care in partnership with the wider Multi-Disciplinary team.&lt;/p&gt;\n&lt;p&gt;As a Community Staff Nurse you will have the opportunity to change patients’ lives for the better, providing care within their homes is the preferred option when possible in avoiding hospital admission. Our District Nursing teams are passionate about caring for patients in the community, and over the years the service has evolved into a highly skilled workforce,  who deliver all aspects of patient care. If you would like the opportunity to advance your skills and practice in this exciting area of nursing we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;If you would like more information about this position prior to applying, please call me and I can arrange for you to visit our base or if preferred have an informal chat over the phone. Either way we look forward to hearing from you and wish you well in your application.&lt;/p&gt;\n&lt;p&gt;As travel is an essential part of this role, please demonstrate on your application form how you would meet this requirement.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwich", "postalCode": "CW9 5HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2582", "longitude": "-2.51218"}}, "title": "Community Staff Nurse, Northwich", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253841", "validThrough": "2020-11-17T23:59:59+0000"}