{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T13:00:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a consultant with expertise and enthusiasm for paediatric oncology? Would you like to work in the busiest POSCU in East Anglia? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NNUH’s Jenny Lind Children’s Hospital is seeking a 10PA consultant to join their busy and dedicated paediatric team. This is a replacement post to support the large Level 2 POSCU and acute paediatric medicine at Norfolk and Norwich University Hospitals Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Jenny Lind Children’s Hospital (JLCH) within the Norfolk and Norwich University Hospital provides a full range of acute clinical services for children and young people, including more specialist services such as Endocrinology, Oncology, Orthopaedics, Plastic Surgery, Gastroenterology, Ophthalmology, Rheumatology, Paediatric Medicine and Paediatric Surgery. Incorporating inpatient and ambulatory care the department provides family centered care to children and young people from Norfolk and the Eastern Region including the provision of High Dependency Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is the perfect opportunity for the ideal candidate to join an ambitious and enthusiastic paediatric team; you will be encouraged to progress personally and professionally and to work to your full potential in a rapidly expanding and highly rated service.&lt;/p&gt;\n&lt;p&gt;The 10PA post comprises 8.25 clinical PA of which 4 are dedicated to paediatric oncology clinical related work and 4.25 for paediatric medicine. There are a total of 1.75SPA including 0.25 for the deputy lead role for POSCU.&lt;/p&gt;\n&lt;p&gt;We encourage applicants who may be POSCU trained, have completed their SPIN/equivalent training or grid trainees in Haematology/Ocology or General Paediatricians who are committed to a post CCT SPIN training haematology/oncology, to apply.&lt;/p&gt;\n&lt;p&gt;You will be joining 20 other acute medical consultants, the majority working across both clinical areas to provide an integrated acute paediatric service in this busy teaching hospital.&lt;/p&gt;\n&lt;p&gt;This an opportunity to be part of a dynamic department working to meet RCPCH ‘Facing the Future Standards’, who are excited about meeting the challenges of delivering high quality care and high quality training in the modern NHS.&lt;/p&gt;\n&lt;p&gt;We are expanding and developing our children’s services and would like &lt;strong&gt;you&lt;/strong&gt; to be part of our planning and delivery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NNUH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Norfolk and Norwich University Hospital (NNUH) is in the heart of East Anglia. Norwich is one of the most vibrant and attractive cities in Europe. It is the perfect location to enjoy the contrasts of one of England’s most picturesque counties - from glorious open countryside and traditional villages to the unspoilt tranquility of the Norfolk Broads with the contrast of the vibrant historic city of Norwich. Norwich with its magnificent cathedral and cobbled streets is ranked in the Top 10 shopping cities in the UK as well as being popular for the arts, culture, music, nightlife, and tourism.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To discuss the opportunity in further detail please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Jo Ponnampalam, Lead for POSCU on 01603 287622 or email Jo.ponnampalam@nnuh.nhs.uk or Dr Mary-Anne Morris, Chief of Service Paediatrics on 01603 289936 or email mary-anne.morris@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;*Terms and conditions apply&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jo Ponnampalam&lt;/p&gt;\n&lt;p&gt;Job title: POSCU Lead, Consultant&lt;/p&gt;\n&lt;p&gt;Email address: jo.ponnampalam@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01603 287622&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk &amp; Norwich University Hospital Trust, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Consultant in Paediatric Medicine &amp; Shared Care Paeds Haem/Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250284", "validThrough": "2020-11-30T23:59:59+0000"}