{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32175", "minValue": "32175", "unitText": "YEAR", "value": "£32,175"}}, "datePosted": "2020-10-02T10:33:02+0100", "description": "&lt;p&gt;Priory Hospital Romiley, located in Cheshire, is a 10-bedded, locked rehabilitation and recovery service for females of working age. We support those who have a primary diagnosis of psychosis and/or affective disorders who may also have co-morbidities including post-traumatic stress disorder (PTSD), substance misuse issues, physical health difficulties and emotionally unstable personality disorder.&lt;/p&gt;\n&lt;p&gt;Our primary purpose is to support patients to develop confidence, skills and independence whilst managing their mental health symptoms, in order to achieve a life worth living in the community or the least restrictive alternative.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The applicant will take an active role in management of the ward, under the supervision of the Ward Manager. The role holder will be expected to participate fully with the clinical team and undertake direct patient care.&lt;/p&gt;\n&lt;p&gt;Applicants must be self-motivated with good communication skills and leadership experience.&lt;/p&gt;\n&lt;p&gt;Applicants should have the following experience/qualifications:&lt;/p&gt;\n&lt;p&gt;• RMN qualfied&lt;/p&gt;\n&lt;p&gt;• Mentorship Qualification (desirable)&lt;/p&gt;\n&lt;p&gt;• The ability to lead and motivate others. Must be flexible, enthusiastic, self-motivated and have the ability to supervise clinical teams.&lt;/p&gt;\n&lt;p&gt;• A genuine interest in quality service delivery and development&lt;/p&gt;\n&lt;p&gt;• The ability to work under pressure and within tight deadlines&lt;/p&gt;\n&lt;p&gt;• Numeracy and evidence of analytical ability&lt;/p&gt;\n&lt;p&gt;• Experience in completing audits&lt;/p&gt;\n&lt;p&gt;We are looking for qualified Registered Mental Health Nurses (RMN) with a minimum of 3 years post-registration experience within a mental health environment. Must be flexible, enthusiastic, self motivated and have the ability to supervise clinical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role provides a great opportunity for an innovative nurse to join our senior team and to contribute to the ongoing development of our services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "STOCKPORT", "postalCode": "SK6 4NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4187", "longitude": "-2.08268"}}, "title": "CHARGE NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210084", "validThrough": "2020-11-27T23:59:59+0000"}