{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a. pro rata"}}, "datePosted": "2020-11-02T17:16:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We have embarked on an exciting major programme to transform and improve services for children and young people across the region.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Embedded with genomic and psychological research, we are designing and developing a new children’s hospital designed to take care of the whole child with no distinction between physical and mental health.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Cambridge Children’s (CC) will take a new approach to healthcare, treating the whole child, not just the illnesses or conditions, using all the talent available across the region. The new hospital will respond to the health challenges facing children through innovative clinical programmes and research.&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;The new hospital is a unique collaboration between Cambridgeshire and Peterborough NHS Foundation Trust (CPFT), Cambridge University Hospitals (CUH) and University of Cambridge (UoC).&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;The Lead Nurse for Quality and Patient Engagement for Cambridge Children’s will provide clinical, professional and strategic leadership within the CC project team. You will support the development of high quality clinical guidelines and pathways together with the Lead Nurse for integrated Models of Care. They will ensure quality of care across pathways that will reach into communities across the East of England. A major focus will also be engaging with children and young people, ensuring their voice is heard and meaningfully embedded in all aspects, and at all stages, of the project. You will work with established patient and family groups throughout the development and design of the new hospital. You will support efforts across several organisations and coordinate staff members involved in the co-production and co-design of the Cambridge Children’s project.&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Together, the nursing and project team will combine their expertise, experience and shared vision to create a new vision for child health in the region and beyond. We’re seeking creative and experienced staff to join our growing multi-disciplinary team. &lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Working in a fast-paced environment with ever changing and increasing demands, you will need to be resilient, flexible, highly organised and proactive. You will be able to work independently, and be experienced in, and passionate about providing the very best, innovative, and creative solutions to support the project’s ambitious aspirations for integrated research, mental and physical health. In the journey of developing a ‘Whole New Way’, there will be a focus on using research methodology to evidence best practice and support innovative models of care. Research expertise in both physical and mental health domains, via their University of Cambridge departments, is embedded in the project team. &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;You will be highly skilled at engaging and managing key stakeholders and be able to develop and maintain strong working relationships across multiple organisations, in particular working closely with communications and project teams at CUH and UoC. You will have an understanding of clinical research and seek to develop nursing research within the role.&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Used to working with a diverse range of people and organisations, you’ll welcome the opportunity to act as an ambassador and key advisor for the project, and will be confident in managing high-profile, multi-agency projects.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;Closing date: 15 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held in the week commencing 30 November 2020&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Tara Llewellyn&lt;br /&gt;Job tile: Divisional Head of Nursing&lt;br /&gt;Email address: tara.llewellyn@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 01223 274864&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Lead for Quality &amp; Patient Engagement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253017", "validThrough": "2020-11-15T23:59:59+0000"}