{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 Per Annum"}}, "datePosted": "2020-10-23T13:45:20+0100", "description": "&lt;p&gt;&lt;span&gt;County Durham and Darlington NHS Foundation Trust is one of the largest integrated care providers in England, serving a population of around 600,000 people. We are a high performing organisation with a track record of success. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Research within our organisation has grown exponentially over the past seven years, we have a thriving research portfolio of studies and a number of clinical research nurses, CRP’s and data assistants. We are currently looking for a clinical research nurse to join our team to work on commercial and non-commercial studies within stroke. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Stroke clinical team at UHND along with the Research and Innovation Department have been awarded funding for a full time Clinical Stroke Research Nurse for a period of 9 months. We are looking for an enthusiastic and motivated person to undertake the role. The successful applicant(s) will take responsibility for the set-up, recruitment and follow up of patients for a number of NIHR portfolio and commercially funded studies. They will be working within an established team who has consistently demonstrated excellent performance and recruitment within this specialty. The successful applicant(s) will have the clinical skills, experience of stroke and ideally experience of the research process in order to advance professionally in this role. For those without current research experience full training will be given. This is an exciting opportunity for someone with interest in research to work within a dynamic team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for 1 RGN who would like to become involved in clinical research at CDDFT. The post will be based at UHND, but the post holder may be required to undertake duties at any of CDDFT Hospital sites or further afield within the NENC Comprehensive Research Network as required, to meet the needs of the studies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants should have excellent organisational and communication skills and be computer literate. Attention to detail is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact either Ellen Brown or Andrea Kay at the contact details above.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will consider requests for flexible working or job share.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note this position requires a Disclosure Barring Service check (DBS) formerly CRB. (Employment Services may delete this is not required for the post)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Of North Durham", "postalCode": "DH1 5TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7889", "longitude": "-1.59294"}}, "title": "Clinical Research Nurse in Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240756", "validThrough": "2020-11-12T23:59:59+0000"}