{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 -£43,772 per annum"}}, "datePosted": "2020-11-04T09:30:45+0000", "description": "&lt;p&gt;Our mission at North Bristol Trust is simple, to provide our patients with ‘excellent healthcare, personally delivered’. To achieve this we work hard to maintain an environment of continuous learning and development, by investing in our people and our facilities. Across our various locations from the Brunel building, Severn Pathology, to the Maternity Services at Southmead Hospital, to Cossham Hospital, and the Bristol Centre for Enablement, we are committed to creating a workforce for the future.&lt;/p&gt;\n&lt;p&gt;North Bristol NHS Trust is a specialist Centre for acute stroke, and we can offer thrombolysis and other emergency care to people from across the region. We also offer specialist inpatient aftercare and have a dedicated stroke trained team of Doctors, Nurses, Physiotherapists, Occupational Therapists, Speech and Language Therapists, Dieticians, Pharmacists, Psychologist and Stroke Practitioners. We also have close links with our social worker colleagues in Bristol and South Gloucestershire social services. Our ethos is to provide specialist, personalized stroke care in a timely and efficient manner.&lt;/p&gt;\n&lt;p&gt;The Physician Associate is a key position to support our busy team of consultants, junior doctors and nursing staff and therapists within each department. The post holder must hold a science-related degree prior to graduating from an established UK Physician Associate Training programme, which follows the Department of Health’s Competence Curriculum Framework, has successfully passed the UK National Physician Associate Examination and is registered with the Managed Voluntary Register for Physician Associates. Consideration will be given to appropriately qualified Physician Associates from other countries as well. This is an innovative idea to give newly qualified or more experienced Physician Associates the chance to put into practice the knowledge and skills they have acquired in their training.&lt;/p&gt;\n&lt;p&gt;It is expected that the Physician Associates will become involved in the activities of the Department, including review of inpatients, assessment of acute admissions (including through Accident and Emergency), practical procedures and outpatient clinics. It would be envisaged that the role would be developed flexibly over time in accordance with the appointee’s ability and interests. The posts would suit Physician Associates looking to work in a very exciting, very rewarding but demanding environment. Quick thinking, flexible and thorough professionals will find the post to their liking. The successful candidate will join a team of Physician Associates already working in the departments of stroke and neurology.&lt;/p&gt;\n&lt;p&gt;Come and work in the largest city in the South West with a population of 449,300 and only 90 minutes from London. Bristol is a thriving, modern city which strikes an unusual balance: it offers all of the facilities of a big city, but is small enough to enjoy living in. From bars on boats to art galleries in former toilets, there is a thriving independent spirit in the city that gave the world both Banksy and Wallace &amp; Gromit.&lt;/p&gt;\n&lt;p&gt;Getting around the city is easy with Bristol being named as Britain&#39;s first cycling city in 2014. Bristol is undoubtedly one of the most vibrant cities in the UK. With its rich maritime history as one of the country’s largest ports for over a century, Bristol is a network of architectural, historical and cultural delights. Full of restaurants, bars, festivals and countryside within hopping distance, Bristol is a commercial, creative hybrid which truly promotes work life balance. Consistently ranked as having the highest quality of life in England and Wales, it’s easy to see why Bristol has the highest retention rate of students post-graduation than any other UK city.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Linda Matthews&lt;/p&gt;\n&lt;p&gt;Job title: General Manager&lt;/p&gt;\n&lt;p&gt;Email address: linda.matthews2@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07708 317 092&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Dr Kanch Sharma, Consultant Neurologist via &lt;strong&gt;kanchan.sharma@nbt.nhs.uk&lt;/strong&gt; or Linda Matthews, Stroke General Manager via &lt;strong&gt;linda.matthews2@nbt.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews for this post will take place on Thursday 17th December 2020. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Stroke / Neurology Physician Associate - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255195", "validThrough": "2020-11-18T23:59:59+0000"}