{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-10-29T15:31:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Part-time Admin Support: Band 2 (£18,005 - £19,337) + shift enhancements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;St Michael’s Hospital, Warwick&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;24/7 Switchboard/Reception &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(day/night/weekends/bank holiday shifts).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Michael’s Hospital is a mental health in-patient site, open 24/7, 365 days/nights per year with a Reception and Switchboard that also supports CWPT Trust-wide sites out-of-hours.&lt;/p&gt;\n&lt;p&gt;We currently rely on a relatively small team of staff to provide cover for the Reception/Switchboard during day and night time hours, which includes providing admin support for on-call rotas and lone workers during out-of-hours periods for staff from all bases across the Trust. As you can imagine, this is a responsible post requiring careful handling of calls, ensuring callers are put through to the correct person and team; this is especially important out of hours when there are on-call teams for virtually all services that we provide, eg, IT, Medics, Estates, Senior Management, etc.&lt;/p&gt;\n&lt;p&gt;We require a reliable and conscientious individual who will work with an integrated and skill mixed team, providing effective and efficient admin support services alongside the operation of a switchboard system, for which training will be provided. You must be able to multi-task, be computer literate and pay attention to detail. The role requires the ability to switch between tasks on an on-going basis in addition to following guidelines and procedures whilst being able to display compassion and respect at all times for patients, carers, staff and all visitors to the site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Hours: &lt;/strong&gt;You will provide support to a 24/7 service working various shifts across days/nights/weekends/bank holidays and may be required to swap shifts at times of staff absences to provide cover. Outside of normal daytime working hours (ie Monday to Friday 8.30 am to 5.00 pm) as a member of admin staff you will essentially be working alone within the Reception area, but with back-up support from nursing staff and a clinical bleepholder. &lt;strong&gt;Whilst this post is part-time at 25 hours per week, hours will be worked flexibly. If you are not required to cover annual leave or shift shortfall your working week will be Tuesday – Friday 6¼ hours a day. &lt;/strong&gt;When covering annual leave/shift shortfalls the shifts are lengthy, working 06.45 – 19.00 or 18.45 to 07.00, but do carry attractive enhance pay benefits!&lt;/p&gt;\n&lt;p&gt;Please note that you will require a Disclosure and Barring Service check and will be required to pay for this and also sign up to NHS Professionals (NHS bank agency) to cover any additional shifts over and above your normal shift pattern if required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bev McGrory - Admin Team Co-ordinator, Tel: 01926 406765 or Amanda Green - Senior Admin Lead, Tel: 01926 406766.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Michael&#39;s Hospital, Warwick", "postalCode": "CV34 5QW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2885", "longitude": "-1.59408"}}, "title": "Part time Admin Support / Receptionist - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248878", "validThrough": "2020-11-12T23:59:59+0000"}