{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T12:31:31+0000", "description": "&lt;p&gt;These are exciting times for Cheshire and Wirral Partnership NHS Foundation Trust. We are looking for a Band 6 Clinical Lead to work in our brand new, modern, 26 bedded Adult Specialist Mental Health Inpatient Unit. To view more information about our new facilities search for cwp.nhs.uk/news-and-blogs/news/welcome-to-mulberry-ward-and-silk-ward/ in your internet browser.&lt;/p&gt;\n&lt;p&gt;We have been recognised by the Health Service Journal as one of the top places to work in the health service for the last two years running and committed to delivering person centred care. The Care Quality Commission (CQC) has rated CWP as ‘Good’ overall, and ‘Outstanding’ for care. We have successful MDT working which includes a Resource Manager, Occupational Therapy /Physio/ Podiatry/Dietitian.&lt;/p&gt;\n&lt;p&gt;We are looking for a registered nurse with a passion for development of services and systems, knowledge of supervision and audit processes and awareness of the leadership style and skills required to be part of a ward senior team. We are looking for someone who can step immediately into the role so this would require experience of inpatient services and / or currently working at band 6.&lt;/p&gt;\n&lt;p&gt;We are proud of being caring, competent and compassionate, with patients at the heart of what we do. We aim to provide high quality, safe services which improve the health, well-being and independence of the people within our locality. We are looking for a motivated nurse to join our friendly team. You should possess commitment to team working and innovative delivery of excellent standards of care. You will be able to demonstrate a real enthusiasm for mental health nursing, as well as a desire for on-going professional development. You will receive excellent training and opportunities for development, clinical supervision and appraisal. We also offer our staff training packages, development and leadership pathways and a comprehensive preceptorship program for those who are newly qualified.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team who strive to make a difference in the assessment and treatment of mental health patients, some also with complex physical health needs. The ward offers a 24 hour service; therefore the successful candidates must be able to work a full range of 12 hour shifts including night shifts and weekends.&lt;/p&gt;\n&lt;p&gt;In return, not only does CWP offer a comprehensive benefits package which includes an excellent pension scheme, 35 days annual leave on commencement (pro rata) inclusive of bank holidays which rise to 37 days after 5 years and 41 days after 10 years. CWP also offer a competitive salary based upon Agenda for Change which is part of the incremental pay progression. There are also regular opportunities for career progression throughout the organisation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Lisa Lawrenson, Ward Manager, lisa.lawsrenson@nhs.net Tel:  01625 712032&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mulberry Ward, Macclesfield", "postalCode": "SK10 3SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2631", "longitude": "-2.15029"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259672", "validThrough": "2020-11-20T23:59:59+0000"}