{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23180", "minValue": "23180", "unitText": "YEAR", "value": "£13.79 PH Basic"}}, "datePosted": "2020-10-16T18:15:39+0100", "description": "&lt;p&gt;With COVID-19 continuing to play a major part in all our everyday lives, we are expanding our capacity over the winter period and need your support to help deliver excellent care to our patients. We can offer ad-hoc shifts and/or longer-term placements through our Staff Bank, to work around your commitments.&lt;/p&gt;\n&lt;p&gt;We wish to appoint innovative and creative Speech and Language Therapists with very good communication skills to work across our services in London&lt;/p&gt;\n&lt;p&gt;Are you looking for an interesting and varied posts that are developing new ways of working taking account of the current pandemic?&lt;/p&gt;\n&lt;p&gt;We offer care in in the patients’ homes, virtually and in some in-patient settings (clinics are currently suspended). This post offers variety and opportunity to develop the range of your clinical skills in both dysphagia and a range of communication disorders, supervisory skills, as well as joint working with a range of professionals and opportunities to contribute to service development.&lt;/p&gt;\n&lt;p&gt;CLCH offers a range of training and development opportunities as well as excellent supervision and management support. There is a support network of SLTs across CLCH, with regular meetings where clinical and professional issues can be discussed.&lt;/p&gt;\n&lt;p&gt;If you are innovative, talented and adaptable with excellent communication skills and would like to be part of a growing and forward thinking organisation then come and join us.&lt;/p&gt;\n&lt;p&gt;Our temporary staffing shifts are calculated hourly and paid weekly. You are paid only for the hours you actually work during any Assignment. Bank workers are paid on fixed third point based on the Agenda for Change (AFC) pay bands.&lt;br /&gt;&lt;br /&gt;HCAS: Inner 20% - Outer 15% - Fringe 5% (As per AfC)&lt;br /&gt;&lt;br /&gt;Weekly pay will include: Basic pay + HCAS + 12.07% Holiday pay + Unsocial hours (If applicable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, Various", "postalCode": "SW1P 2PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4943", "longitude": "-.134014"}}, "title": "Bank Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231305", "validThrough": "2020-12-31T23:59:59+0000"}