{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum"}}, "datePosted": "2020-11-04T17:15:40+0000", "description": "&lt;p&gt;We are seeking to recruit enthusiastic individuals to join our existing team of nurses in the Emergency Department. If you like to be busy, enjoy a good team atmosphere and enjoy the challenge of working in ED we would like to hear from you.Sandwell &amp; West Birmingham NHS trust are currently planning for the new Midland Metropolitan hospital. This is an exciting opportunity for staff to work in a newly built hospital and where two ED’s are merging into one.&lt;/p&gt;\n&lt;p&gt;We offer a supportive, exciting and challenging work environment that is committed to providing high quality care for our patients and to the development of our staff. Full local induction and competency-based training is in place. A Band 5 12 month development program has been developed. This is designed to offer the opportunity to develop teaching, leadership and service development skills.&lt;/p&gt;\n&lt;p&gt;Currently at Sandwell ED we have trauma unit status and regularly see patients with a variety of trauma injuries.&lt;/p&gt;\n&lt;p&gt;We have dedicated paediatric facilities and offer you the opportunity to develop skills in providing care for sick children.&lt;/p&gt;\n&lt;p&gt;There will be a rotation programme between Sandwell ED &amp; City Hospital ED in preparation for Midland Metropolitan Hospital.&lt;/p&gt;\n&lt;p&gt;The role will include nights, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;INVITATION FOR INTERVIEW WILL BE VIA E-MAIL. Please note that we are unable to contact all applicants after the short listing stage due to cost implications. Therefore, if you have not heard from us within three weeks of the closing date, please assume that you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;We understand that work is only one part of life. We are committed to helping our colleagues achieve the best possible work/life balance. We proudly offer supportive, inclusive and family friendly employment and flexible working policies. We have a wide range of professional services and employee networks to help our colleagues be at their best - and find support if they need it.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to Public Health all SWB Trust premises will be smoke free from July 2019.&lt;/p&gt;\n&lt;p&gt;Applicants for patient facing roles are required to verify their immunisation status as part of pre-employment checks process and where necessary comply with the mandatory requirement to receive immunisation for any unverified vaccinations, to include but not exclusive to MMR, Varicella, TB and Hepatitis based on national immunisation guidelines. The only exceptions will be those individuals with medical contraindications and/or those who are otherwise protected by the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;INVITATION TO INTERVIEW WILL BE VIA E-MAIL ONLY&lt;/p&gt;\n&lt;p&gt;If you require any further advice regarding your application, please ring the appropriate number below&lt;/p&gt;\n&lt;p&gt;Recruitment Team on 0121 507 5070&lt;br /&gt;Trust Bank on 0121 507 3600&lt;/p&gt;\n&lt;p&gt;Please note the closing date may change if there is a high response, therefore please ensure that you apply for the post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;Sandwell &amp; West Birmingham Hospitals NHS Trust works with DisabledGo to provide detailed access guides covering all areas of the Trust, including where to park, wheelchair access, and accessible facilities. Search for our sites on disabledgo.com&lt;/p&gt;\n&lt;p&gt;MINDFUL EMPLOYER - Sandwell and West Birmingham Hospitals NHS Trust has signed the Charter for Employers who are positive about Mental Health.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon AndersonJob titleSenior SisterEmail addresssharon.anderson1@nhs.netTelephone number0121 507 3155&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell General Hospital, West Bromwich", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256788", "validThrough": "2020-11-25T23:59:59+0000"}