{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc. HCAS"}}, "datePosted": "2020-10-26T16:45:44+0000", "description": "&lt;p&gt;Staff Nurse&lt;/p&gt;\n&lt;p&gt;Marjorie Warren ward is general rehabilitation adult inpatient ward in Finchley Memorial Hospital, North Finchley. The Hospital is a beautiful new build surrounded by beautiful landscaped gardens and open spaces.&lt;/p&gt;\n&lt;p&gt;The site has good access to local transport and easy parking facilities.&lt;/p&gt;\n&lt;p&gt;We have dedicated rehabilitation Multi-Disciplinary Teams consisting of Registered Nurses, Occupational Therapists, Physiotherapists, Dieticians, Speech therapist, Pharmacists, Activities Coordinators, Senior Care Assistants, Rehab Support Workers, Care assistants and Housekeepers. As a team, the aim is to support patients to regain function, confidence, self-respect and much more.&lt;/p&gt;\n&lt;p&gt;Our vision is to ensure that our patients are provided with an excellent experience and an excellent standard of care. We are a caring, dedicated and progressive team and aim to be the best in the field of rehabilitation. If you share our vision and have what it takes to lead and support a team on this exciting journey of excellence then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You will need to display excellent communication skills, and offer care in a kind and compassionate manner. You will be dynamic, innovative, hardworking, and have excellent written and verbal communication skills. We can offer you the opportunity to develop your nursing and management skills as well as supporting you to develop your leadership style and skills that will support you throughout your career.&lt;/p&gt;\n&lt;p&gt;This is a full time position of 37.5 hours a week.&lt;/p&gt;\n&lt;p&gt;You can look forward to an award-winning training and development, excellent benefits including assistance with transport, child care, parking and comprehensive pension and health care schemes.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Finchley Memorial Hospital Marjory Warren Ward, Finchley", "postalCode": "N12 0JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6066", "longitude": "-.177315"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243484", "validThrough": "2020-11-09T23:59:59+0000"}