{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-10-30T12:31:31+0000", "description": "&lt;p&gt;Band 7 Clinical Lead Community Nutrition Support : Permanent&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic and dynamic Dietitian with excellent team-working skills? An opportunity has arisen to join our forward thinking and dynamic community Dietetic team across Hywel Dda University Health Board to provide clinical leadership in the area of community Nutritional support.&lt;/p&gt;\n&lt;p&gt;Despite this being a challenging time for us it is also an excellent time to be involved in forward-thinking and innovative change. This post is a new post that has resulted from considerable investment in the service as a result of a Malnutrition business case. The post-holder will work collaboratively with community clinical leads across the three counties as well as acute clinical leads to optimise nutritional care across the patient pathway.&lt;/p&gt;\n&lt;p&gt;The post-holder will provide operational leadership to the community dietetic team in Ceredigion supporting with caseload management and prioritisation. They will also act as an expert in their area of expertise, taking a pro-active leadership view on community nutritional support.&lt;/p&gt;\n&lt;p&gt;The post-holder will actively carry a complex clinical caseload including home enteral tube feeding and patients with neurological conditions and will be involved in the delivery of multi-disciplinary enteral tube feeding and Motor Neurone disease clinics. They will be involved in supporting the wider community team with planning, undertaking and evaluating training, will support student training as well as the development and implementation of Assistant practitioners. They will also lead, innovate and drive forward policies, procedures and nutritional care pathways in the area of community nutritional support.&lt;/p&gt;\n&lt;p&gt;As a service we pride ourselves on being a supportive team and welcome applicants wishing to discuss opportunities for flexible working.&lt;/p&gt;\n&lt;p&gt;Please note that the base for this post is TBC and can be discussed with those that apply.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For informal queries please contact : Victoria Prendiville 07971334014 / Victoria.prendiville@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Interviews for this vacancy will be held on 25th November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria PrendivilleJob titleService Lead Nutrition SupportEmail addressvictoria.prendiville@wales.nhs.ukTelephone number07971334014&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TBC, Ceredigion", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Clinical Lead Community Nutritional Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250179", "validThrough": "2020-11-16T23:59:59+0000"}