{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27635", "minValue": "27635", "unitText": "YEAR", "value": "£16.44 per hour inclusive of HCAS"}}, "datePosted": "2020-10-29T08:15:59+0000", "description": "&lt;p&gt;&lt;span&gt;Our CQC ‘Outstanding’ rated Intensive Care Unit (ICU) is now welcoming applications from dedicated, passionate Bank Staff Nurses looking to use their knowledge on our supportive and friendly unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our mixed 12 bedded unit cares for ICU level 3 and HDU level 2 patients with a wide variety of medical and surgical conditions and admits around 800 patients per year. Our ICU is a modern, light and spacious unit with up to date equipment and facilities, including a paperless clinical information system. The experience of our team will provide you with the support to enable you to continue developing your skills caring for critically ill patients undergoing a variety of critical care interventions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be an individual who has at least one year of recent experience working as an ICU nurse. You will be forward thinking and passionate about delivering a high standard of care with empathy and compassion. We follow the national standards patient ratio of 1:1 and you will lead on your patient’s assessment, formulate their care plans and be passionate about working towards patient independence and rehabilitation. You will have excellent attention to detail, particularly when working with ventilated patients and be committed to provide quality holistic care. You will have good knowledge of ventilators, infusion pumps, ‘ICU’ medications including vasopressors and sedatives and be confident in using specialised ICU equipment. You will have patience and resilience, a strong teamwork ethic and be committed to ICU nursing. Our unit provides you with a fantastic opportunity to give dedicated patient care and the satisfaction each day knowing that you have attended to every part of your patient’s care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All new bank starters will receive 2 days supernumerary on ICU and we can offer you shifts to work around any other commitments you may have. You will also receive a 1-day induction to the hospital/Trust if you are from outside the area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a unit we are committed to education and professional development. We run internal study days and staff are also encouraged to attend external study days. These courses include: BACCN study day, Drager ventilator training, major incident planning, in house critical care patient safety study day, CRRT training and patient transfer training. Support is also offered with your revalidation. Debriefing and emotional support will also be given when needed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a bank staff nurse you would very much be part of the team. If you have the drive and passion to continue in your ICU role on shifts of your choosing then it’s time for you to join our friendly team!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rita Mody&lt;/p&gt;\n&lt;p&gt;01276 604146&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park Hospital, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Bank ITU Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247629", "validThrough": "2020-11-12T23:59:59+0000"}