{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "132284", "minValue": "87624", "unitText": "YEAR", "value": "87,624 - 132,284"}}, "datePosted": "2020-10-27T10:08:12+0000", "description": "&lt;p&gt;Situated just 40 minutes flying time from London with excellent&lt;br /&gt;transport links to Europe the small beautiful Island of Jersey enjoys&lt;br /&gt;great weather, sandy beaches surrounded by soaring cliffs and offers a&lt;br /&gt;healthy work-life balance. Whether watching the sun set into the sea&lt;br /&gt;over a beach barbecue, dining out in Michelin starred restaurants or&lt;br /&gt;club or bar hopping is the end to your perfect day, Jersey has the ideal&lt;br /&gt;lifestyle and work environment. An exciting opportunity has arisen for&lt;br /&gt;the successful applicant to relocate to the Island.&lt;br /&gt;&lt;br /&gt;The post holder will be expected to take on the full range of duties&lt;br /&gt;including the routine and emergency diagnosis and management of&lt;br /&gt;children and young people (up to the age of 18) with significant&lt;br /&gt;mental health problems, the support of other team members and&lt;br /&gt;providing consultation and advice to other agencies. The service has&lt;br /&gt;expanded and continues to develop its service delivery to meet the&lt;br /&gt;needs of the community. As a senior clinician you will have&lt;br /&gt;opportunity to shape the service and influence child mental health&lt;br /&gt;more widely on the island.&lt;br /&gt;&lt;br /&gt;Full travelling expenses are paid from a UK port of entry, with a&lt;br /&gt;generous relocation package available and the appointee may take&lt;br /&gt;advantage of Jersey taxation policies. The post attracts residential&lt;br /&gt;qualifications and Jersey has excellent affordable private education for&lt;br /&gt;children. Under Jersey Law, applicants must possess FULL registration&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the job, please contact Dr Catherine Keep, 01534 445030 or Dr Muktansu Patil 01534 442045&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jersey", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "CONSULTANT IN CHILD &amp; ADOLESCENT PSYCHIATRY (CAMHS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243949", "validThrough": "2020-11-16T23:59:59+0000"}