{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T13:01:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a pharmacy technician to work on full time basis within the healthcare team at HMP Ranby. HMP Ranby is a secure setting for men aged 18 and over who are serving a sentence.&lt;/p&gt;\n&lt;p&gt;You will be an integral member of the Pharmacy Team and of the wider Healthcare service within HMP Ranby.&lt;/p&gt;\n&lt;p&gt;The role of pharmacy technicians within the Offender Health directorate support the Pharmacy services in delivering the technical aspects of safe medication practice as part of the comprehensive healthcare package based on the prison service needs.&lt;/p&gt;\n&lt;p&gt;You will have responsibilities for administering medicines to the prisoner population, as well as wider responsibilities relating to Medicines Management including running Medicines Use Review clinics, carrying out medicines administration, ordering medications and undertaking audits.&lt;/p&gt;\n&lt;p&gt;Offender Health is the largest NHS provider of healthcare service within a prison setting and is currently looking for motivated people who can contribute to maintaining this position. The healthcare services within Offender Health provided by Nottinghamshire Healthcare NHS Foundation Trust aim to provide consistent, equitable, high quality and timely health services available to all offenders.&lt;/p&gt;\n&lt;p&gt;You will be part of a team of Pharmacy Technicians taking responsibility for medicines management, providing medication directly to patients in accommodation areas. The team works a shifted roster covering 7 days per week. You will be required to work flexibly, providing assistance as and when necessary, which may involve them in a developing role.&lt;/p&gt;\n&lt;p&gt;Working closely with Lead Pharmacy Technician, you will contribute to the promotion of cost efficient medicines management with a target to reduce waste whilst achieving improved access to quality healthcare services&lt;/p&gt;\n&lt;p&gt;You will be responsible for achieving key performance targets based on agreed personal performance plans.&lt;/p&gt;\n&lt;p&gt;You should be a team worker, enthusiastic, motivated, patient focused and enjoy a challenge with ability to work under pressure. You MUST have current registration as a technician with The General Pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;Please see the person specification for further details.&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare NHS Foundation Trust enjoys a good reputation as an employer offering applicants the opportunity of an interesting role in a developing and stimulating environment but also with access to a range of established terms and conditions of service and access to continuing professional development and access to NHS pension scheme. Additional developmental opportunities are available across a wide range of Trust services that include Rampton Hospital, Arnold Lodge and Wathwood Medium Secure Units, Wells Road Centre low secure unit, Criminal Justice and Liaison services as well as a range of mental health and learning disability services and a variety of specialist services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our DBS check is free, you have no fees to pay!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon BransonJob titleClinical MatronEmail addresssharon.branson@nottshc.nhs.ukTelephone number01777 862158&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Ranby, Retford", "postalCode": "DN22 8EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3201", "longitude": "-.996117"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242564", "validThrough": "2020-11-09T23:59:59+0000"}