{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-27T16:00:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Early Intervention Matron Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time – 37.5 hours/week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division 7 was established in August 2020 in response to the increasing focus on system working across Birmingham and Solihull between our health and social care partners. The Division brings together Solihull Community Services, our Discharge Hubs across all our acute hospital sites and UHBs intermediate care beds into a single management structure. Division 7 also works closely with Division 3 on the strategy and delivery of OPAL, the multidisciplinary interface service based at our hospital front-doors.&lt;/p&gt;\n&lt;p&gt;In addition the Division is leading the Trust’s work in primary care both in terms of the management of its first General Practice and the establishing collaborations with interested GP organisations and the redesign of clinical pathways as well as opportunities for closer integration.&lt;/p&gt;\n&lt;p&gt;The Division plays a leading role in a number of significant system change programmes:&lt;/p&gt;\n&lt;p&gt;‘The Early Intervention Programme’ is the Birmingham Integrated Care Partnership scheme which has driven integration of health and social care across the city over the past 3 years, resulting in new models of care delivery and improved outcomes for citizens and organisations. UHB have been a partner in this work, with OPAL, discharge hubs and the Norman Power Centre (intermediate care beds) as key projects. This work is now continuing into a second phase and a similar project is now being established in Solihull via the ‘Solihull Ageing Well Programme’.&lt;/p&gt;\n&lt;p&gt;In Solihull as part of Ageing Well the Division’s community services are working with Primary Care Networks and Local Authority social work and enablement teams to deliver new neighbourhood models and improve the support to care homes to enable Solihull residents live healthier lives in their own homes.&lt;/p&gt;\n&lt;p&gt;A key enabler of this transformation will be to harness the opportunities of existing and emerging digital technology with our partners. The use of video and digital diagnostic devices for example will enable paramedics in patients homes to link remotely to geriatrician led MDTs for a comprehensive assessment and treatment plan. This could include the use of digital stethoscopes in a patients home with the consultant listening to the patients heat and lungs remotely.&lt;/p&gt;\n&lt;p&gt;We have an opportunity to expand the Division 7 management team with the appointment of an Early Intervention Matron. The post-holder will be responsible for the non-acute beds in the Norman Power and Homeward Centres. They will be instrumental in the ongoing development of these services according to the requirements of the BSol system, and will work closely with their counterparts in the partner organisations across health and social care. They will play a key role in ensuring that the citizens of the city are able to access their care and support through a truly integrated, seamless service across acute and community care.&lt;/p&gt;\n&lt;p&gt;You will need to have extensive experience in leading and managing multi-professional teams, a knowledge of community services and be able to form effective partner relationships within and outside of the Trust. An innovative approach is essential; constantly seeking better ways of working to improve outcomes for patients, drive quality and meet performance requirements. You will have a highly visible presence and ensure that the needs of the patients are placed on the centre of care delivery. In conjunction with the senior nursing team you will ensure that staff will feel supported and thrive within the clinical areas, providing evidenced based quality care to every patient.&lt;/p&gt;\n&lt;p&gt;For your information assessment process operates in two stages. If you are shortlisted for the post you will be invited to an assessment centre and if you successfully complete the assessment, you will then be invited to attend a panel interview.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Ursula Hare, Deputy Director of Nursing on 07966 457329&lt;/p&gt;\n&lt;p&gt;Closing date: 08/11/2020&lt;br /&gt;Assessment date: 16/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 8a - Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245294", "validThrough": "2020-11-08T23:59:59+0000"}