{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:31:09+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 2 YEARS TO &lt;/strong&gt;&lt;strong&gt;MEET THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;ANEURIN BEVAN UNIVERSITY HEALTH BOARD&lt;/p&gt;\n&lt;p&gt;DEPARTMENT OF CLINICAL RADIOLOGY&lt;/p&gt;\n&lt;p&gt;BAND 6 SCP Navigator Radiographer&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board is seeking to recruit enthusiastic and committed individuals. We are looking for enthusiastic Radiographers looking to advance their career pathway in this expanding Health Board.&lt;/p&gt;\n&lt;p&gt;A full time Band 6 SCP (Single Cancer Pathway) Navigator radiographer post has arisen in the ABUHB. This opportunity is open to a suitably qualified and experienced Radiographer who wishes to join our friendly, enthusiastic team. Experience in cross-sectional Imaging Modalities is essential.&lt;/p&gt;\n&lt;p&gt;Band 6 SCP Navigator Radiographer work closely with the other specialities and Primary Care Clinicians in promoting a 28-day timeframe for the diagnostic interval of the patient pathway in order to achieve the SCP metric. The Navigators will be dedicated to the implementation, coordination and improvement of the diagnostic interval of the patient pathway.&lt;/p&gt;\n&lt;p&gt;There are a variety of shift systems in operation and the successful candidate will be expected to provide a flexible approach to shift systems and weekend working. Whilst the post is primarily based at Royal Gwent Hospital, there may be requirements to work at other sites within the Health board.&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board can offer you a great place to live and work, as well as the opportunity to develop and progress your career. We are a caring, award-winning organisation and one of the largest Health Boards in Wales employing more than 13,000 staff. A new 560 bed Grange University Hospital will open in 2020 providing specialist and critical care for our sickest patients.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 17th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andrew Carter - Radiology Services Manager&lt;/p&gt;\n&lt;p&gt;andrew.carter@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01633 234310&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Newport", "postalCode": "NP20 2UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5798", "longitude": "-2.99816"}}, "title": "SCP Radiographer Navigator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253452", "validThrough": "2020-11-17T23:59:59+0000"}