{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-30T14:16:44+0000", "description": "&lt;p&gt;Bury and Rochdale Care Organisation is one of four care organisations which make up the newly formed Northern Care Alliance. Using our mantra of ‘Saving lives, Improving lives’, the aim is for our Care Organisations to work closely with the communities they serve to deliver safe, high quality and reliable care.&lt;/p&gt;\n&lt;p&gt;Our community focused team at Fairfield General uses a variety of new and interesting service models to deliver on The Alliance promise by providing award winning, patient-centred care and we are looking for like-minded healthcare professionals to join our ever growing team.&lt;/p&gt;\n&lt;p&gt;Fairfield General Hospital provides a unique and much needed service not only to its local community but also across Greater Manchester.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Registered or student Band 5 Staff Nurses to join the enthusiastic team on the Acute Medical Unit.&lt;/p&gt;\n&lt;p&gt;Our Acute Medical Unit has 40 inpatient beds and an Ambulatory Care Unit. All patients are triaged on arrival and cared for in the most appropriate setting. You will work between the 2 areas as an Acute Medicine nurse which will provide plenty of opportunity to grow and develop within your career. Gaining exposure to a variety of patients and skills in specialties such as Cardiovascular, Gastroenterology, Respiratory care and much more.&lt;/p&gt;\n&lt;p&gt;The team is heavily influenced and supported by an experienced team of physicians, and has a lead Advanced Nurse Practitioner who supports the Lead Nurse in delivering specific in house training delivered in a way for you to relate it to practice.&lt;/p&gt;\n&lt;p&gt;Previous nurses who’ve worked on this unit have gone on to roles such as advanced nurse practitioner and specialist nurses, along with higher band progression.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Exposure to a variety of medical conditions and specialist treatment options, you will learn transferable skills such as recognising the acutely unwell adult, catheterisation, intermediate life support, mentorship and dysphagia training.&lt;/li&gt;\n&lt;li&gt;Support from an experienced and knowledgable team of multi-skilled professionals&lt;/li&gt;\n&lt;li&gt;A dedicated, supportive leadership team who are keen to ensure you grow in your career&lt;/li&gt;\n&lt;li&gt;Flexible shifts - nights only, weekends only, long or short shifts, full or part time. We have something for everyone&lt;/li&gt;\n&lt;li&gt;Access to a full time Practice Based Educator who will tailor development options around your career aspirations and support dedicated study time.&lt;/li&gt;\n&lt;li&gt;Rotation options, some current staff members are part of a rotation programme with other departments. Depending on your preference we are happy to support this.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The part you play&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and energetic individuals, who work well under pressure and are keen to learn. A great team player, you will also be self-motivated and able to work independently when needed. You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to team members at all levels.&lt;/p&gt;\n&lt;p&gt;A sense of ownership for your patients, a ‘can do’ attitude and determination to deliver the best patient care is essential in a unit that for many patients is the start of their time with us.&lt;/p&gt;\n&lt;p&gt;We welcome the chance for you to see how our unit works and encourage you to visit us as part of your application.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namevikki deanJob titleward managerEmail addressviki.dean@pat.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Adele Hughes&lt;/p&gt;\n&lt;p&gt;Lead Nurse&lt;/p&gt;\n&lt;p&gt;adele.hughes@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 778 2591&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury &amp; Rochdale Care Organisation, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Staff Nurse - AMU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250518", "validThrough": "2020-11-15T23:59:59+0000"}