{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82096 - £110683"}}, "datePosted": "2020-10-29T12:46:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Come and join our successful, patient focused team&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pennine MSK Partnership Ltd are at the forefront of delivering a consultant led, NHS community service for the people of Oldham in Rheumatology, Orthopaedics and Persistent Pain.&lt;/p&gt;\n&lt;p&gt;We live by our mission statement to keep the patient at the heart of everything that we do by providing outstanding care and support to every patient, every time.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join our dynamic, fast-growing and forward thinking team:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job Summary&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pennine MSK Partnership Ltd. (PMSKP) provides rheumatological care for the people of Oldham, a population of approximately 230,000. We are an innovative community-based organisation that provides comprehensive care of patients with musculoskeletal problems. In addition to rheumatology, the service also provides specialised physiotherapy assessment and treatment, podiatry, occupational therapy, elective orthopaedics, fracture liaison and persistent pain services. The rheumatology service is based at the Integrated Care Centre (ICC), a well-equipped, modern community facility in the centre of Oldham.&lt;/p&gt;\n&lt;p&gt;Oldham is a large town situated on the edge of Greater Manchester encompassing both urban areas and the beautiful Saddleworth Moors.  We have great transport links to the buzzing cultural centre of Manchester and beyond and direct access to outdoor activities to suit any need.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, dynamic and motivated consultant who will contribute to the provision and development of quality rheumatology care for the residents of Oldham. You will be joining a team of three consultants, five specialist nurses and a fully functioning wider MDT.&lt;/p&gt;\n&lt;p&gt;The post provides an opportunity to join one of the pioneering community based rheumatology services in the country, providing comprehensive integrated musculoskeletal care where we see the person with musculoskeletal problems as being at the heart of the service, and have been proactive in developing systems for shared decision making and supporting self-management along with social prescribing. We believe that we should use the full potential of all our clinicians and have a strong multi-disciplinary ethos to help maintain long term sustainability to work-life balance.&lt;/p&gt;\n&lt;p&gt;The post offers excellent opportunities for you to develop as a consultant, contribute to the service development and shape the future of the local rheumatology Services.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to play an active role in training of the junior medical staff that rotate through PMSKP and contribute to the education and development of the wider rheumatology MDT alongside clinical audit, research and clinical governance. Research is encouraged and full facilities are available.&lt;/p&gt;\n&lt;p&gt;This is a replacement post and is available on a full time ten Programmed Activities (PAs) basis though we are open to discuss any specific or specialist job plans that candidates may desire including flexible or less than full time working. For an appropriately dual-trained candidate, additionally sessions supporting the work of the medical division at The Royal Oldham Hospital may be possible.&lt;/p&gt;\n&lt;p&gt;Applicants will be expected to have MRCP or equivalent and be fully registered with the GMC and hold a license to practice. Applicants must have entry on the GMC Specialist Register for Rheumatology or be within 6 months of achieving CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;Approval of the Job Description and Person Specification has been sought from the Royal College of Physicians.&lt;/p&gt;\n&lt;span&gt;If you wish to apply for this position please do so via NHS Jobs. For any further information please contact: Dr Hugh Sturgess, Executive&lt;span&gt; Director, PMSKP by email hugh.sturgess@nhs.net &lt;span&gt;or Dr Robert Ley, Consultant Rheumatologist on 01616213838 or by email robert.ley@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;\n \n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham", "postalCode": "OL1 1NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5438", "longitude": "-2.11687"}}, "title": "Rheumatology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248385", "validThrough": "2020-11-27T23:59:59+0000"}