{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43213", "minValue": "43213", "unitText": "YEAR", "value": "Potential to earn £43213"}}, "datePosted": "2020-11-04T17:19:28+0000", "description": "&lt;p&gt;&lt;strong&gt;10 Primary Healthcare across Derbyshire - Recruiting NHS 111 Pathways trained Nurses, Paramedics and Pharmacists for Remote working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*YOU MUST BE NHS 111 PATHWAYS TRAINED WITH AT LEAST 12 MONTHS CURRENT EXPERIENCE AND WORKING ON VERSION 21.1 TO BE CONSIDERED FOR THE ROLE* &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Tired of the daily commute?&lt;/li&gt;\n&lt;li&gt;Frustrated with searching for parking spaces?&lt;/li&gt;\n&lt;li&gt;Do you need access to flexible working hours?&lt;/li&gt;\n&lt;li&gt;Are you looking to change to a role that suits your lifestyle?&lt;/li&gt;\n&lt;li&gt;If the answer to any of these questions is yes, then we have the perfect role for you&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;DHU 111 (East Midlands) CIC is looking for experienced NHS 111 Pathways trained nurses, paramedics and pharmacists from across the country to work remotely providing clinical care for our patients here in the East Midlands. You will need to have a minimum of 12 months telephone triage experience using the NHS Pathways Clinical Decision Support Software.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Training and days £16.46&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Evenings / Nights £21.40&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekends £23.87&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;We offer a great benefits package: -&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Occupational sick pay (after qualifying period)&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;Private healthcare benefits&lt;/li&gt;\n&lt;li&gt;Dedicated remote management support&lt;/li&gt;\n&lt;li&gt;Team working and support in a specialised care environment&lt;/li&gt;\n&lt;li&gt;High quality equipment is provided that brings the contact centre environment to the comfort of your home&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Due to expansion, we are currently recruiting &lt;strong&gt;NHS 111 Pathways Accredited Clinicians&lt;/strong&gt; to join our NHS 111 East Midlands team. As a DHU 111 Clinician you will be guaranteed the clinical autonomy to deliver safe, effective and patient focused care. You will be making a real difference to patients by utilising your clinical knowledge supported by assessment software to carry out telephone triage; assessing patient’s presenting symptoms, advising them on next steps and referring them on to further care when appropriate.&lt;/p&gt;\n&lt;p&gt;Working on NHS 111 is a highly skilled and exciting role that gives you the opportunity to use and develop your assessment skills for a wide variety of patients and clinical presentations. We receive excellent feedback from our patients who appreciate a service that is always accessible to them when they are unsure of what level of care they need.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from capable, proactive and experienced &lt;strong&gt;NHS Pathways&lt;/strong&gt; &lt;strong&gt;111 &lt;/strong&gt;accredited registered nurses, paramedics or pharmacists who have excellent communication skills, are calm under pressure and enjoy working within a team environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*YOU MUST BE NHS 111 PATHWAYS TRAINED WITH AT LEAST 12 MONTHS CURRENT EXPERIENCE AND WORKING ON VERSION 21.1 TO BE CONSIDERED FOR THE ROLE* &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Working hours&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a homeworking clinician you will be required to commit to a minimum of &lt;strong&gt;30&lt;/strong&gt; hours over a 24 hour period 7 days a week.&lt;/p&gt;\n&lt;p&gt;NHS Pathways clinicians who do not meet the Continuous Quality Improvement requirements may be required to work from site for additional hours until requirements are met.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional Information – Essential &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a homeworking clinician you will need to have a minimum of 6 MB of broadband download speed and 1.5MB of upload speed. All patient assessments need to be completed in a confidential area&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Derbyshire Health United (DHU) is a &#39;not-for-profit&#39; social enterprise organisation and is the provider for NHS Out-of-Hours services on behalf the North Derbyshire, South Derbyshire, Hardwick and Erewash Clinical Commissioning Groups. DHU also have a subsidiary company DHU 111 (East Midlands) Community Interest Company who are the provider for the NHS111 Services for Derbyshire, Nottinghamshire, Northamptonshire, Leicestershire, Leicester and Rutland and Lincolnshire. DHU believe that patients deserve good quality treatment in a caring and safe environment. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As a team DHU are committed to doing the right thing, in the right way, at the right time, in the right place and with the right results - improving the lives of patients 24 hours a&lt;/em&gt; day, 365 days a year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Infection Prevention &amp; Control is pivotal in ensuring a safe &amp; clean environment for both patients and staff. IPC&amp;C is everyone&#39;s responsibility and strict adherence to the IP&amp;C policy is expected of ALL employees of the organisation.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;DHU Health Care CIC is committed to safeguarding and promoting the welfare of Adults, Children and Young People and expects all staff and volunteers to share this commitment.&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130356.PNG", "name": "DHU Health Care CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130356"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancashire &amp; surrounding areas", "postalCode": "PR1 8AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.756", "longitude": "-2.7072"}}, "title": "111 Clinical Advisor - Remote Working (Nurse/Paramedic/Pharmacist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256801", "validThrough": "2020-11-18T23:59:59+0000"}