{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T08:59:05+0000", "description": "&lt;h1&gt;Specialist Ocupational Therapist&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our vision is high quality, safe healthcare and our staff working together to provide excellent health care services. If you’re passionate about making a difference and would like to be a part of our exciting and progressive NHS Foundation Trust then we welcome you to apply below.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Specialist Occupational Therapist in our Acute Medical Therapy Team at Warrington Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful post holder will work across the acute medical inpatient bed base. The post holder will have the opportunity to increase their knowledge and experience of working across this specialist area as part of the Multi-Disciplinary Team. The candidate will have the specialist clinical skills to functionally assess and provide therapeutic intervention. Working closely with the Multi-Disciplinary Team and community partners to prevent hospital re-admission.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our philosophy is “Home First”, whenever possible, with an emphasis on the person’s preferences, personal strengths, self-care, consultation and inclusion in every stage of their care plan. We have recently introduced an early mobilisation model of care when home first is not the best option. Our therapy early mobilisation approach offers patients a pathway of care which aims to reduce hospital deconditioning, enabling a person to maintain as much of their independent as possible whilst in hospital. We work jointly with individual’s to maintain function whilst they become medically optimised, supporting them to return to their usual place of residence as timely as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for talented individuals who are committed to working as part of our Therapy Team delivering an excellent, caring service to patients across our inpatient bed base.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate must be confident, have appropriate experience and be able to demonstrate a desire to actively participate in all aspects of this specialist role. The successful candidate must be an effective team player with good communication, organisational skills and have a passion for older people living with Frailty. They must have excellent clinical reasoning skills and have the ability to explain their decisions and actions in a way that all concerned, will be able to understand to progress assessments and facilitate discharges.&lt;/p&gt;\n&lt;p&gt;Within the Acute Medical Therapies we offer the opportunity to rotate across our three Clinical Hubs: Frailty, General Medicine and Dementia/Palliative Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• Regular clinical supervision&lt;br /&gt; • Opportunities for professional &amp; personal development&lt;br /&gt; • Service Development opportunities&lt;/p&gt;\n&lt;p&gt;• In-service training &amp; post graduate education&lt;br /&gt; • Excellent Multi-disciplinary working&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The working hours for this post are up to 37.5 hours over 5 days; this includes covering a weekend rota which does include Saturdays and Sundays.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Therapies Team is based at Warrington Hospital, Lovely Lane, Warrington WA5 1QG, this post may include cross site working at Halton Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome visits to the department prior to interview.&lt;/p&gt;\n&lt;p&gt;For further information related to this post please contact Michelle Smith, Therapy Manager on 01928 753267 or 01925 662106 or email at michelle.smith93@nhs.net&lt;/p&gt;\n&lt;p&gt;or contact Clare Fairhurst, Highly Specialist Occupational therapist on 01925 662992 or email at clarefairhurst@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253190", "validThrough": "2020-11-17T23:59:59+0000"}