{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T13:45:51+0000", "description": "&lt;p&gt;An opportunity has arisen within the East Early Intervention for Psychosis team for suitably qualified individuals with an interest in psychosis to enhance their clinical skills in this specialist field. We are able to a vacancy for a part time Band 6 Care Coordinator.&lt;/p&gt;\n&lt;p&gt;Working to support the national agenda of intervening early in the development of psychosis we would welcome applications from RMNs, Occupational Therapists or Social Workers to engage with our caseload to help them achieve positive health outcomes.&lt;/p&gt;\n&lt;p&gt;As an EIP practitioner you will be part of a team that triages, assesses and offers a treatment pathway over a 3 year period in line with NICE guidelines to people who are experiencing first episode of psychosis.&lt;/p&gt;\n&lt;p&gt;You need to utilise social inclusion and Recovery approaches and develop links with other agencies and GP surgeries within the community to create opportunities for individuals and promote collaborative working.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals with a mature approach to team working, who have the ability to motivate, to have excellent communications skills to be able to work with a broad age range of clients; and are able to adopt a flexible, creative, adaptable and proactive approach to your work.&lt;/p&gt;\n&lt;p&gt;You will hold a share of the team caseload in line with EIP guidelines and have the support of experienced clinicians within the multi-disciplinary team and be expected to work to a high standard in engaging with and educating clients and their support network. In addition you will benefit from regular supervision and monthly service focused CPD events. We are looking to support suitable clinicians in training in Family Intervention and Cognitive Behavioural Therapy for Psychosis over the next few years in order to build on key psychological interventions that we offer.&lt;/p&gt;\n&lt;p&gt;The applicant should have an awareness of national drivers in reference to physical health and psychiatric medications.&lt;/p&gt;\n&lt;p&gt;Candidates must be able to demonstrate and give examples of their experience within their supporting information relating to the essential criteria outlined on the job description.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Relocation expenses of up to £3000 will be considered for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLuke TaylorJob titleTeam ManagerEmail addressluke.taylor3@nhs.netTelephone number02108 834276Additional contact information&lt;/p&gt;\n&lt;p&gt;Luke Taylor - Team Manager 01208 834276&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bodmin,", "postalCode": "PL31 2QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4683", "longitude": "-4.74305"}}, "title": "Care Co-ordinator - Early Intervention in Psychosis - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254191", "validThrough": "2020-11-17T23:59:59+0000"}