{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-11-06T14:46:41+0000", "description": "&lt;p&gt;The Buckingham Adult Community Health Care Team (ACHT) based in Winslow Health Centre is delighted to announce a new opportunity for a part Time Band 3 Community Health Care Assistant. &lt;br /&gt;&lt;br /&gt;The ACHT reflects an integrated approach that has been designed in response to the changing needs of the local population, with a special emphasis being placed on the proactive vision of care for patients in the community setting. &lt;br /&gt;&lt;br /&gt;The post will involve working in the community, supporting the community nurses and promoting independence in the patient’s home environment.&lt;br /&gt;&lt;br /&gt;This is an exciting and innovative service. Candidates to be experienced carers and be able to demonstrate having experience or knowledge of supporting patients in their own homes. You will have excellent communication skills and the ability to work with a range of health professionals and informal carers. The ideal candidate will be flexible and adaptable, being able to respond to need at short notice.&lt;br /&gt;&lt;br /&gt;In order to respond to the healthcare needs of the local population, the services covers a 7 days a week rota which therefore includes weekends and bank holidays&lt;br /&gt;&lt;br /&gt;Ideally the candidate should hold a NVQ level 3 in Health and Social Care or equivalent, on appointment the post will be attached to an apprenticeship.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Teresa Blease&lt;/p&gt;\n&lt;p&gt;07798 628736&lt;/p&gt;\n&lt;p&gt;t.blease@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winslow Health Cnetre, Buckingham - work within the community", "postalCode": "MK18 3DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9451", "longitude": "-.882053"}}, "title": "Community Healthcare Assistant - Buckingham ACHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260204", "validThrough": "2020-11-20T23:59:59+0000"}