{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-30T11:31:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Anaesthetic and Recovery Practitioner/ Operating department practitioner for Women&#39;s Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Women&#39;s Theatres &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5, Anaesthetics and Recovery - Nurses and ODP’s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have experience in a theatre environment or would like to gain experience and like working in a challenging, innovative and supportive environment, then the Women’s Theatres would be the place for you. Comprising of 2 Gynaecology theatres, 3 Obstetrics theatres and an outpatients Diagnostic list. The post holder will rotate between the two clinical areas gaining experience and knowledge in this area of Women’s Health.&lt;/p&gt;\n&lt;p&gt;We are an accredited Urogynaecology and Endometriosis Centre performing complex laparoscopic surgery. We have established procedural clinics in our Diagnostic Suite, performing innovative surgical procedures under a local anaesthetic, many not performed elsewhere.&lt;/p&gt;\n&lt;p&gt;We are acknowledged as being a friendly, small and welcoming team working in a supportive environment. We offer a supernumerary period within theatres, a designated mentor to support you and a comprehensive competency package to provide structure and facilitate learning, and opportunities to develop skills within the theatre environment.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for an enthusiastic and self-motivated individual to be part of our Women’s Theatre team. This department provides 24-hour emergency cover; therefore there will be nights duty and weekends.&lt;/p&gt;\n&lt;p&gt;It is in one of the largest NHS teaching trusts in the UK, Oxford University Hospitals group. Our collaboration with the University of Oxford underpins the quality of the care and pioneering surgical techniques that are provided to our patients.&lt;/p&gt;\n&lt;p&gt;Oxford isn&#39;t just a good place to work; it&#39;s also a great place to live. The compact easy-to navigate city boasts a rich architectural history, with plenty of green spaces, riverside walks and it is surrounded by beautiful countryside. From Oxford there is easy access to London, and major transport links. Blenheim Palace, Windsor Castle and the Cotswolds are all within easy reach. Our location is conveniently situated for public transport. The bus and mainline train stations are both within a short bus journey or bike ride&lt;/p&gt;\n&lt;p&gt;Our core values are excellence, compassion, respect, delivery, learning and improvement. Collaboration and partnership are also central to our approach in delivering our fundamental activities of patient care teaching and research&lt;/p&gt;\n&lt;p&gt;If you would like to know more or would like to arrange an informal visit, please contact Mrs Kay Adair, Theatre Manager on kay.adair@ouh.nhs.uk .&lt;/p&gt;\n&lt;p&gt;--------------------------------------------------------------------------------&lt;/p&gt;\n&lt;p&gt;ANAESTHETIC AND RECOVERY PRACTITIONER&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our ideal candidate will also be highly motivated, a pro-active team player and be fully conversant with all aspects of current theatre practices. Excellent communication skills and a flexible approach are essential as an on-call commitment is required for this post as well as participation in programmes of additional surgical activity.&lt;/p&gt;\n&lt;p&gt;You will have experience of working in anaesthetics and recovery and have proven clinical abilities.&lt;/p&gt;\n&lt;p&gt;If you are keen to progress your career and are committed to developing and enhancing the quality of care provided in the operating theatre environment, then this is the opportunity for you.&lt;/p&gt;\n&lt;p&gt;Personal and professional growth is actively encouraged and a wide range of career development opportunities are available including professional development support and access to perioperative degree modules.&lt;/p&gt;\n&lt;p&gt;In return we will offer you the opportunity to broaden your existing knowledge of perioperative practice in a supportive and friendly environment.&lt;/p&gt;\n&lt;p&gt;Our department supports the development of Student Operating Department Practitioners and Student Nurses, we are keen to seek interest from proactive professionals who appreciate effective team working and strive to support to learners and colleagues.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Band 5: £24,907 – £30,615 per annum pro rata&lt;/p&gt;\n&lt;p&gt;Hours: 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 13th Nov 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKay AdairJob titleTheatre ManagerEmail addresskay.adair@ouh.nhs.ukTelephone number01865 2 27614Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact us now for an informal chat or further information:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Theatre Manger - Kay Adair or Tatiana Dan &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01865 222013 or 01865 2 27614 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Women&#39;s Theatres, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Anaesthetic and Recovery Practitioner/ Operating department practitio", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249952", "validThrough": "2020-11-13T23:59:59+0000"}