{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T11:17:30+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for a Highly Specialist Psychologist /Psychological Therapist to join Durham and Darlington Directorate’s Adult Mental Health Services. The candidate will join an established Community Intervention Team, providing clinical services to patients within the team’s geographical areas. Particular emphasis is placed on evidence-based practice and the delivery of NICE-recommended clinical interventions.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates should have excellent interdisciplinary working skills and be interested in developing and delivering innovative interventions. They will have significant experience in engaging with individuals suffering from severe mental health problems. They will be skilled in offering clinical leadership, consultancy, supervision and training to colleagues as well as participating in service developments and evaluations as appropriate.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Trust is committed to providing support and supervision for continuing professional development and we have an excellent track record for developing our workforce. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Psychologists and Psychological Therapists provide key leadership roles within the Trust. To support this we have developed leadership profiles for each psychology band and the profile card associated with this post is attached on NHS Jobs. You can find more information about the NHS Leadership Academy’s Healthcare Leadership Model and the profiles at their website. We encourage you to look at these resources as they will play a part in the interview process.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Angela Prout, Consultant Clinical Psychologist and Locality Lead for AMH Psychological Services Durham and Darlington Tel: 01325 552019 Email: angela.prout@nhs.net&lt;/p&gt;\n&lt;p&gt;Nicola Raine Team Manager 01207 585197&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derwnet Clinic, Consett", "postalCode": "DH8 0NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8691", "longitude": "-1.84293"}}, "title": "Highly Specialist Applied Psychologist/ Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246271", "validThrough": "2020-11-11T23:59:59+0000"}