{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-23T20:45:18+0100", "description": "&lt;p&gt;Oxford Health NHS Foundation Trust (OHFT) provides physical, mental health and social care for people of all ages across Oxfordshire, Buckinghamshire, Swindon, Wiltshire, Bath and North East Somerset. Our services are delivered at community bases, hospitals, clinics and people’s homes. We focus on delivering care as close to home as possible.&lt;/p&gt;\n&lt;p&gt;As a leading teaching, training and research trust, we have close links to Oxford and Oxford Brookes, Buckinghamshire, Reading and Bath universities. We are part of the Oxford Academic Health Science Centre, working closely with our university colleagues to translate their findings into clinical care as quickly as possible, enabling people using our services to benefit from the latest advances in healthcare.&lt;/p&gt;\n&lt;p&gt;In everything we do, we strive to be caring, safe and excellent. We expect our staff to share and demonstrate these values as we work to constantly improve the quality of care we provide. This ensures that we have the right workforce to deliver effective team-working and excellent patient care and experience.&lt;/p&gt;\n&lt;p&gt;Oxford Health is committed to safeguarding and promoting the welfare of children and vulnerable adults. We expect all staff and volunteers to share this commitment. All successful candidates will be subject to Disclosure Barring Service and other relevant employment checks.&lt;/p&gt;\n&lt;p&gt;Our learning disability service is currently organised into three community teams throughout the County based in Oxford, Abingdon and Banbury. Each team has a psychiatrist, psychologists, occupational therapists, community nurses, a physiotherapist and a speech and language therapist. The teams provide assessment, consultation and therapeutic services to adults with a learning disability and their carers. We are looking for a skilled and dynamic Consultant Psychiatrist in Learning Disability to work in and provide clinical leadership in a well-established community team in Abingdon.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who have worked in Learning Disability and who can demonstrate their ability to adapt to the changing circumstances of modern mental healthcare provision. We welcome applications from highly motivated colleagues to work collaboratively with colleagues, and to provide leadership and clinical expertise to our highly skilled and committed multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;There are also close links with Oxford University which include a term-time weekly academic meeting, regular research meetings, research opportunities, journal clubs and audit meetings. The Trust hosts or collaborates with a wide range of research infrastructure. In September 2016, a partnership between Oxford Heath NHS Foundation Trust and the University of Oxford was awarded £12.8M to support a new NIHR Biomedical Research Centre (BRC; Director Prof John Geddes) focused on mental health and dementia. Trust has recently set up a Centre for Patient Safety and Quality. There will be opportunities for medical input into this Centre.&lt;/p&gt;\n&lt;p&gt;The Trust welcomes applications from appropriately qualified clinicians who would like to work with the BRC, CLAHRC or NIHR CRN (Clinical Research Network) as part of their agreed job plan.&lt;/p&gt;\n&lt;p&gt;The post holder will have the opportunity to enrol on the Trust Leadership Development Programme.&lt;/p&gt;\n&lt;p&gt;There are extensive opportunities for teaching and training of medical students, postgraduate doctors, members of the multidisciplinary team and other service providers, and for appraising and mentoring consultant colleagues.&lt;/p&gt;\n&lt;p&gt;Applicants for the above vacancies must be fully registered with the General Medical Council (GMC) and on the Specialist Register or be within six months of attaining their Certificate of Completion of Training (CCT) or an equivalent approved indicator of training.&lt;/p&gt;\n&lt;p&gt;New starters have a 6-month probationary period. This, together with the induction process aims to create a positive supportive working environment allowing new employees to learn key elements of their role over a reasonable timescale.&lt;/p&gt;\n&lt;p&gt;Appointment to this post is subject to the trust receiving satisfactory references covering 3-5 years of employment or study. Please ask your referees to respond promptly to reference requests.&lt;/p&gt;\n&lt;p&gt;Employees are expected to undertake mandatory and statutory training related to their role.&lt;/p&gt;\n&lt;p&gt;We positively encourage applications from all areas of the community, regardless of gender, race, faith, disability, age or sexual orientation and we encourage applications from users of mental health services. This is part of our commitment to equality and reflecting the diversity of our population.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal enquiries and arrangements to visit the Trust are welcomed by Kirsten Prance, Associate Clinical Director Learning Disabilities, Specialist Directorate (Tel: 07799348981) and Dr Tim Andrews North Learning disability team consultant, Timothy.Andrews@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Abbey House, Abingdon", "postalCode": "OX14 3JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6706", "longitude": "-1.27988"}}, "title": "Consultant Psychiatrist in Learning Disability", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241529", "validThrough": "2020-11-08T23:59:59+0000"}