{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-02T15:01:04+0000", "description": "&lt;p&gt;&lt;em&gt;*Applications are welcome from candidates who are working towards registration with the Health &amp; Care Professions Council as a Clinical Scientist, in which case appointment will initially be at AfC Band 6, until full state registration has been achieved.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the Lancashire Teaching Hospitals Clinical Biochemistrydepartment for a suitably qualified and experienced Senior Clinical Scientist. We are looking for a self-motivated individual to take on this challenging role within our busy and progressive department. You should have completed or be undertaking a formal post graduate training programme approved as appropriate for registration and have obtained or be on track to obtain HCPC registration on completion of the training programme. Applicants close to registration with sufficient experience will be considered and be appointed at Band 6 level until registration is achieved. Applicants in their 3rd year of the STP programme will be considered if they have completed all 2nd year modules.&lt;/p&gt;\n&lt;p&gt;The department supports both adult and paediatric services across two hospitals (Royal Preston Hospital and Chorley and South Ribble District General Hospital) which together comprise Lancashire Teaching Hospitals NHS Foundation Trust. We are a UKAS accredited department providing diagnostic services across Lancashire and South Cumbria. Lancashire Teaching Hospitals provides acute healthcare for 400,000 people and tertiary services for a population up to 2 million. The Clinical Biochemistry department is the largest in Lancashire providing diagnostic support to primary and secondary care, including specialist services to the Oncology, Renal, Neuroscience, Paediatric, Endocrinology and advanced Trauma services.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and committed individual who is self-motivated but has the skills and attributes to work well within a team. You should have good communication skills and be able to take initiative and prioritise workload. The role requires consistent attention to detail and excellent organisational skills. Evidence of interest/experience of scientific research and development is essential. Key areas of responsibility will include analytical method development, audit, clinical ward rounds and responsibilities for external quality control and assessment. Clinical liaison and advisory duties will be performed under supervision of an experienced practitioner until the post holder is HCPC registered.&lt;/p&gt;\n&lt;p&gt;There is an opportunity to enrol the post holder onto the Higher Specialist Scientist Training programme from September 2021, giving the successful candidate the opportunity to complete a 5 year work-based training programme. Further professional development for FRCPath membership is strongly encouraged with regular internal seminars and financial assistance to attend external courses.&lt;/p&gt;\n&lt;p&gt;STP trainees in their third year of training are encouraged to apply and the department will support completion of all academic and clinical aspects of the Healthcare Sciences training programme. Appointment would be at AfC band 6 until HCPC registration is obtained.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;Rebecca Allcock rebecca.allcock@lthtr.nhs.uk 01772 522122&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Senior Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252517", "validThrough": "2020-11-09T23:59:59+0000"}