{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum plus Inner HCAS"}}, "datePosted": "2020-11-04T12:32:24+0000", "description": "&lt;p&gt;The South East London Integrated Care System is a partnership of health and social care organisations with an ambition to deliver a clinically and financially sustainable health and care system for the future, taking collective action to improve outcomes and address health inequalities in our population. Initially this was through collaborative development of the Our Healthier South East London Sustainability and Transformation Plan (2015) and Partnership or STP thereafter. Now we have continued to work closely together more formally as a partnership as an Integrated Care System (ICS); following designation a wave 3 ICS by NHSE/I in June 2019. We are pursuing our vision by adopting a population health management approach and taking action at different geographical levels – very locally in our neighbourhoods, in each borough, and across south east London. We operate as a ‘System of Systems’, bringing partners together to take action at the optimal scale to effect change.&lt;/p&gt;\n&lt;p&gt;The south east London integrated care system (ICS) brings together all of the organisations involved in planning and delivery of health and care for the 1.9 million people who live in south east London (SEL).&lt;/p&gt;\n&lt;p&gt;This role will be required to lead key programmes and projects in response to and in support of the implementation of ICS priorities including those set out in the ICS’s response to the NHS Long Term Plan and Recovery Plans.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced and talented NHS manager used to working with very senior individuals to join the ICS team as Chief of Staff. This role will lead key programmes and projects in response to and in support of the implementation of ICS priorities including those set out in the ICS’s response to the NHS Long Term Plan and Recovery Plans. This will require a range of skills, flexibility and confidence to take on a wide range of responsibilities, often with minimal oversight.&lt;/p&gt;\n&lt;p&gt;In addition to programme delivery, the postholder will directly support the independent ICS Chair, Lead and Programme Director – ensuring that they are well supported to work efficiently and effectively and developing briefings and pieces of work on their behalf. The postholder will also need to respond to ad hoc requests from the ICS leadership, working closely with other ICS partners to produce high quality work rapidly and in a complex and often time pressured environment.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join one of the first ICS’ and be part of a committed and talented team trying to improve health and care in this part of the capital. Please see the job description for more detail.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virtual interviews will be held on Friday 20th November for shortlisted candidates.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tooley Street, London – currently working from home", "postalCode": "SE1 2TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5032", "longitude": "-.079442"}}, "title": "ICS Chief of Staff", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255872", "validThrough": "2020-11-16T23:59:59+0000"}