{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc HCAS"}}, "datePosted": "2020-11-05T11:16:03+0000", "description": "&lt;p&gt;Central &amp; North West London NHS Foundation Trust is looking to recruit experienced and skilled practitioners to join our new Mental Health in Schools Teams (MHST) in our boroughs of Brent and Harrow.&lt;/p&gt;\n&lt;p&gt;We are working in collaboration with commissioners and schools to enhance the offer of emotional health and wellbeing to children, young people and parents/carers within a school setting. This is an exciting and innovative approach.&lt;/p&gt;\n&lt;p&gt;The successful post holder(s) will have experience of working with children, young people and parents/carers and be able to support our trainees in the teams. There is also the expectation that the post holder(s) are willing to undertake a supervisory course to improve and enhance their skills.&lt;/p&gt;\n&lt;p&gt;If you are interested in this exciting opportunity please read the full job description and job specification to make sure you meet the requirements of the role.&lt;/p&gt;\n&lt;p&gt;CNWL CAMHS covers five London Boroughs and Milton Keynes. We also have an adolescent unit based in Kensington and Chelsea (Lavender Walk), our Under13&#39;s unit (Collingham Gardens) and our Children and Young People&#39;s Eating Disorders Unit. We are committed to developing our workforce in line with the demand for services and improving access and waiting times for our population.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRumyana NenovaJob titleTeam ManagerTelephone number020 3317 5050&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brent CAMHS, Wembley", "postalCode": "HA9 6JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5482", "longitude": "-.271727"}}, "title": "EMHP Practitioner Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257401", "validThrough": "2020-11-19T23:59:59+0000"}