{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata"}}, "datePosted": "2020-11-02T13:31:47+0000", "description": "&lt;p&gt;The Quality, Clinical Governance and Health and Safety team functions are absolutely pivotal to ensuring we can have a high level of strategic oversight, recognition and understanding of clinical issues and priorities which will then enable the whole organisation to provide excellent care. Having an integrated, clinically focused quality, safety and governance resource, processes and systems will enable effective interfaces between the team, operational staff and other corporate functions. Ensuring that there is an objective and supportive structure for all staff with the ability to provide effective solutions and outcomes, with the involvement of people who use services at the centre of all we do.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide a comprehensive administration service for the department, including, for example, answering telephone, acting as the PALS reception; noting the details of the concerns/complaints and/or email enquiries, maintaining project documentation, preparing project status reports for the Quality and Safety Team, preparing formal correspondence, photocopying, arranging meetings/events/appointments and liaising with a range of clients, partners, colleagues and visitors. The role will provide project implementation support, coordinate project monitoring arrangements, and escalate project risks and issues. The post holder may provide reception/mail-handling services and/or meet and greet visitors, arranging appropriate hospitality. You may provide day to day supervision of others.&lt;/p&gt;\n&lt;p&gt;Please note – This team is currently home working due the Covid 19 guidance.&lt;/p&gt;\n&lt;p&gt;This post is for 15 hours a week for 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS1 3NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.46", "longitude": "-2.59169"}}, "title": "Quality &amp; Safety Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252252", "validThrough": "2020-11-15T23:59:59+0000"}