{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-22T16:15:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Two fantastic opportunities have arisen for staff looking to progress their career and become a Clinical Team Educator in the North South area of SCAS. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The full time vacancies are available across Reading and Newbury.&lt;/p&gt;\n&lt;p&gt;The Clinical Team Educator role is a pivotal position in the management of the area’s existing operational staff of all grades and visiting students, being responsible for their clinical supervision and professional development while liaising and working alongside the education department. You will form part of the area management team and the successful candidate will have a proven set of behaviours linked to the key values of: Team Working, Caring, Innovation and Professionalism.&lt;/p&gt;\n&lt;p&gt;Full details of the role can be found in the attached job description and person specification.&lt;/p&gt;\n&lt;p&gt;You will have a good health record and be able to work either full time or part time depending on which vacancy you apply for to fulfil the full range of operational shifts and duties. You will be qualified as a HCPC Registered Paramedic, working at Band 6 level, or NMC Nurse.&lt;/p&gt;\n&lt;p&gt;You must be a team player and can accept responsibility and make decisions. You must be interested in the development of newly trained staff and the maintenance of excellent standards. You will possess good interpersonal skills, communications skills (both written and oral) and competency in basic computing and IT. You will be capable of logical thinking, practical problem-solving, objective assessment skills and report writing. You must also be able to motivate and support others.&lt;/p&gt;\n&lt;p&gt;Commitment to ongoing personal and professional development is vital and will be evidenced by your record of continuing development. Successful applicants will need to demonstrate how their personal values reconcile against the Trust’s values.&lt;/p&gt;\n&lt;p&gt;All applicants for this position will be required to undergo a competitive selection process involving a clinical assessment followed by a panel interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessments will take place at the Education and Recruitment Centre in Bone Lane, Newbury, date to be confirmed. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates who successfully pass the assessments will then be invited for interview which dates are to be confirmed. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are unable to offer any alternative dates for the assessments or interviews.&lt;/p&gt;\n&lt;p&gt;Note: you will need to meet the essential criteria as a minimum in order for your application to be shortlisted. &lt;strong&gt;You must have completed your Consolidation of Learning Portfolio as part of the NQP programme and have demonstrable experience of working as a Paramedic.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contact: Ben Voller or Nicola Wright by e-mail&lt;/p&gt;\n&lt;p&gt;Ben.Voller@scas.nhs.uk&lt;/p&gt;\n&lt;p&gt;Nicola.Wright@scas.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that if you are an internal candidate already employed by SCAS and drive for the service we will be checking your internal licence in line with SCAS driving standards and the Trusts CPP V19 driving policy. We will accept up to and including 4 internal penalty points, if you have more than these specified points your application may be withdrawn. All checks will be completed after shortlisting but prior to an assessment or interview invite.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newbury and Reading", "postalCode": "RG14 1LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4073", "longitude": "-1.31823"}}, "title": "Clinical Team Educator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239289", "validThrough": "2020-11-08T23:59:59+0000"}