{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17347", "minValue": "17347", "unitText": "YEAR", "value": "£17,347"}}, "datePosted": "2020-10-23T15:09:05+0100", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistant – Brain Injury, Dementia and Huntington’s disease wards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based:  Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary from £17,347 + Enhancement  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week&lt;/strong&gt;- part time options also available&lt;/p&gt;\n&lt;p&gt;Our Neuropsychiatry Pathway offers unrivalled care, treatment and rehabilitation for adults and older adults with acquired brain injuries, dementia and Huntington’s disease who have complex needs and sometimes challenging behaviour. The Neuropsychiatry Division that these wards are part of is recognised for being at the forefront of innovative service developments, for its excellence in service delivery and rehabilitation practice, and for its ability to manage and reduce aggressive behaviour. &lt;/p&gt;\n&lt;p&gt;We have a number of great opportunities for Healthcare Assistants to work within some Brain Injury and Huntington’s disease wards and also in 2 of our new Dementia Village wards. As a Healthcare assistant you will be part of our wider nursing and clinical teams focusing on our Patients and their rehabilitation, daily activities and care. The role is really varied, and requires physical fitness as well as patience, accountability and people engagement skills. . Knowledge and experience of working with similar patient groups can be an advantage but is not a requirement.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from well-motivated individuals who are flexible with the hours they can work, including regular weekend shifts and some rotation between day and night shifts, and who are able to demonstrate high standards of care and empathy, and who possess good communication skills alongside good IT literacy.&lt;/p&gt;\n&lt;p&gt;We have a great ‘Learning through Work’ training programme, which will help people with or without experience in healthcare become true professionals within the Healthcare Assistant role.  Successful completion of the programme will enable access to further progression and development opportunities within the Charity.&lt;/p&gt;\n&lt;p&gt;At St Andrew’s you can enjoy a special sense of pride and belonging – by helping transform the lives of patients, while shaping the future you want for yourself.  We’re the UK’s leading mental healthcare charity with an excellent and well-deserved reputation as a provider of specialist mental healthcare.&lt;/p&gt;\n&lt;p&gt;Our commitment to holistic care, safety, recovery and innovative therapies and treatment makes St Andrew’s the perfect place to establish your career.  Join us and you’ll be part of a team with a shared focus on people not profits, with all surpluses re-invested to benefit our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Our excellent benefits package includes:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pension&lt;/li&gt;\n&lt;li&gt;Sickness policy on par with the NHS&lt;/li&gt;\n&lt;li&gt;35 days annual leave, increasing to 41 after 10 years&#39; service&lt;/li&gt;\n&lt;li&gt;Life cover&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Healthcare cash plan&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Paid DBS application&lt;/li&gt;\n&lt;li&gt;Access to Vocational Qualifications&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NORTHAMPTON", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Healthcare Assistant – Brain Injury, Dementia and Huntington’s disease", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241050", "validThrough": "2020-11-22T23:59:59+0000"}