{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38693", "minValue": "38693", "unitText": "YEAR", "value": "£38,693"}}, "datePosted": "2020-10-26T14:40:25+0000", "description": "&lt;p&gt;&lt;strong&gt;UHB has a highly successful Junior Specialist Doctor (JSD) training programme, introduced in 2008 and now invites applications for core training in medical specialities commencing on 3rd February 2021, for up to 24 months (shorter contracts are available on request).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following a highly acclaimed Emergency/Acute Medicine programme UHB have now launched our JSD Core Training Programme now in its 12th year. The programme is aimed at training junior doctors in the competencies required for the successful completion of core training in General Medicine or ACCS. The posts are for fixed term up to 2 years to include training in all the competencies required by the respective Royal College for either core medical training, ACCS training or core surgical training and includes rotational placements in key medical specialties as a rotational JSD Standard.&lt;/p&gt;\n&lt;p&gt;The posts are not HEE recognised training posts but will train doctors in a similar way and with the competencies required for future progression. There will also be opportunities to extend the contracts with support provided for talented and committed staff including progression to JSD (Higher) posts.&lt;/p&gt;\n&lt;p&gt;UHB is one of the countries leading hospitals and one of the most consistently high performing Trusts in the NHS. It has been rated ‘excellent’ for leadership and provides high quality of clinical and non-clinical services and excellent management.&lt;/p&gt;\n&lt;p&gt;Applicants must have a minimum of 2 years UK clinical experience or equivalent with at least 6 months relevant experience in a specialty area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The rotation will be based at either QEHB or Heartlands/Good Hope/Solihull hospitals. Please mention in your application which site would be preferred, or if you are flexible depending on where vacancies are to meet your career needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The terms and conditions of service are UHB terms for JSD’s, a summary of which can be found on the additional document attached to the NHS Jobs application form.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;UHB CORE TRAINING – CORE MEDICINE or ACCS&lt;/li&gt;\n&lt;li&gt;JUNIOR SPECIALIST DOCTORS (Standard) (Equivalent to Grade StR 1-2)&lt;/li&gt;\n&lt;li&gt;Up to 24 Month Contracts available&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please submit an online application, ensuring you attach a copy of your CV.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2WB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4498", "longitude": "-1.94214"}}, "title": "Junior Specialist Doctor - CMT/ACCS Programme for UHB sites (Feb 2021)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242932", "validThrough": "2020-11-09T23:59:59+0000"}