{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 p.a. inc. HCA"}}, "datePosted": "2020-11-04T09:46:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Assistant Category Director – Clinical Digital Solutions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS London Procurement Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to facilitate continued improvement in care by supporting clinical digital transformation across the NHS and wider public sector?&lt;/p&gt;\n&lt;p&gt;Would you like to join an ambitious procurement collaborative organisation to develop and implement ambitious category strategies in the Clinical Digital Solutions (CDS) category team?&lt;/p&gt;\n&lt;p&gt;The CDS category focusses on complex procurement and transformation projects pertaining to both Digital Health and IT Infrastructure. We facilitate better patient care through clinical transformation via digital enablement. We champion a service led approach to technology procurement workflows and processes. We take a holistic approach to care reform and use best in class procurement strategies as a means of accelerating this. This allows us to embed digital health/clinical system and IT infrastructure transformation support into our cradle to grave procurement services.&lt;/p&gt;\n&lt;p&gt;This role is key to driving savings and revenue generation activity, as the category strategies and plans will be instrumental in attracting new customers and maximising uptake to NHSLPP contracts and bespoke services both regionally and nationally.&lt;/p&gt;\n&lt;p&gt;The role will require an ability to work alongside both external operational teams as well as board level management on a regional and national basis to drive collaboration and provide strategic CDS procurement expertise and/or transformation programme management support.&lt;/p&gt;\n&lt;p&gt;Do you have either significant senior procurement experience in a procurement and supply chain role, that includes Clinical Digital Solutions / Technology, or significant Digital Health or IT Infrastructure programme/project management experience?&lt;/p&gt;\n&lt;p&gt;Are you able to demonstrate experience in category management, including production of best in class category strategies and/or corresponding business case development and digital transformation programme expertise?&lt;/p&gt;\n&lt;p&gt;Advanced supplier management and contract negotiation experience or along with proven board level stakeholder relationship management skills will also be key to success.&lt;/p&gt;\n&lt;p&gt;Interview date: 27th November 2020&lt;/p&gt;\n&lt;p&gt;Closing Date: Midnight 17&lt;span&gt;th&lt;/span&gt; November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Ursula Hardwick&lt;/p&gt;\n&lt;p&gt;Job title: Acting Director Clinical Digitial Solutions&lt;/p&gt;\n&lt;p&gt;Email address: ursula.hardwick@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;For further information on this exciting opportunity, please contact Ursula Hardwick (Acting Category Director); ursula.hardwick@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "200 Great Dover Street, London", "postalCode": "SE1 4YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5006", "longitude": "-.092475"}}, "title": "Assistant Director of CDS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255226", "validThrough": "2020-11-17T23:59:59+0000"}