{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-27T10:56:29+0000", "description": "&lt;p&gt;&lt;strong&gt;This is an opportunity for an enthusiastic individual to work as one of the Senior BMS’s in Haematology in a small but busy department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We provide a comprehensive range of diagnostic services for the acute Trust and to 23 GP practices across North Devon &amp; North Cornwall. We have an unprecedented relationship with our Primary care colleagues and the new Devon CCG. We are using Ordercomms to develop innovative means of syndrome-based requesting as well as optimising the service in other ways.&lt;/p&gt;\n&lt;p&gt;The department of Blood Sciences is UKAS accredited to ISO 15189, holds IBMS training approval until 2023 and is committed to maintaining this as part of a wider hospital network in the South West. The department uses Q-Pulse for quality management.&lt;/p&gt;\n&lt;p&gt;The department is well resourced with Horiba Yumizens, Stago StarMax2 and IBG analyser systems providing a comprehensive repertoire of tests.&lt;/p&gt;\n&lt;p&gt;We are looking for a member of staff with a positive outlook and strong leadership skills to have an integral part in the operational management of the Haematology. A specialist interest in coagulation would be desirable.&lt;/p&gt;\n&lt;p&gt;You must be currently registered with the Health Professions Council (HCPC) as a Biomedical Scientist and hold an MSc or equivalent qualification i.e. FIBMS. You will have previous experience working as a Senior BMS or be an experienced Band 6 with evidence of involvement in management and development of a laboratory.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to resolve staffing and technical issues within the department, ensuring the smooth flow of work through Haematology. As a small establishment you will be expected to deputise for the Blood Transfusion manager in their absence. There is also a requirement to participate in the well remunerated out of hour’s rota.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to lead and influence the development of a small but forward thinking laboratory.&lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to informally visit the department to talk with the team and experience what North Devon has to offer.&lt;/p&gt;\n&lt;p&gt;For more information or to arrange a visit please contact Sarah Hayes, Blood Sciences Manager, (01271) 370232 -sarah.hayes7@nhs.net or Senior BMS, Jennifer Hodgson (01271) 322329 - jenniferallin@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 29/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Senior Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244094", "validThrough": "2020-11-29T23:59:59+0000"}