{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:01:40+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;The General and Specialist Medicine Care Group is NOW Recruiting General and Specialist Registered Nurses .&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic, caring and passionate General and Specialist Nurses to join our amazing award winning teams offering full time and part time opportunities for Registered Nurses.&lt;/p&gt;\n&lt;p&gt;General and Specialty Medicine are able to offer exciting opportunities within; General Medicine, Cardiology, Renal, Dialysis, Endoscopy, Diabetes, Stroke, HCOOP/Frailty, Rheumatology, Gastroenterology, Respirator and Neurology.&lt;/p&gt;\n&lt;p&gt;We firmly believe that developing our staff is key to success; we have a dynamic and progressive training and development ethos, providing excellent opportunities to enhance your knowledge and competencies, nurturing your personal and professional development by encouraging and supporting you to reach your full potential. You will have plenty of opportunities to develop and grow here at East Kent Hospital University Foundation Trust, &lt;strong&gt;&lt;em&gt;you may have come for a job but you’ll stay for a career.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a supportive environment with an extensive induction programme. A range of rotational opportunities to enable development of skills across patient pathways, and access to development opportunities with our excellent links with Canterbury Christchurch University&lt;/p&gt;\n&lt;p&gt;Our Practice Development Nurse will support you with a bespoke induction package (working alongside Preceptorship if appropriate).&lt;/p&gt;\n&lt;p&gt;We believe that people are at their best when they love their job, so our ambition is to make our Trust a great place to work for everyone, every day and the team at Invicta Ward recently won ‘Outstanding Care Award’ at the Trust Award Ceremony. Don’t delay, join our award winning teams and work with people that are passionate about making a difference.&lt;/p&gt;\n&lt;p&gt;We are a leading Trust for the use of technology. We are currently introducing an electronic bed management system so will benefit from real-time reporting of up-to-date information for every patient, plus point of care testing. The Trust has 24/7 access to CT and stroke thrombolysis, and benefits from interventional radiology services in our sister hospital at Canterbury. William Harvey Hospital is the primary PCI hospital for Kent. It also provides acute Stroke services for the area and has trauma unit status. We have recently launched Harmonia Village an innovative project providing a new model of Dementia Care.&lt;/p&gt;\n&lt;p&gt;A medical school will be opening in east Kent in 2020 with 100 training places a year.We are proud that our dedicated and passionate employees from across East Kent Hospitals are featured in the biggest NHS recruitment drive in its 70 year history!&lt;/p&gt;\n&lt;p&gt;Filmed in William Harvey and Queen Elizabeth The Queen Mother hospitals, the &lt;strong&gt;&lt;em&gt;‘We are the NHS’&lt;/em&gt;&lt;/strong&gt; campaign highlights the extraordinary work that staff across EKHUFT do every single day. As one of the largest hospital trusts in England, with five hospitals and community clinics serving a population of over one million people, EKHUFT was perfectly placed to demonstrate the care, cutting-edge treatments, research, innovations and life-saving operations that the campaign needed.&lt;/p&gt;\n&lt;p&gt;Our mission is to provide &lt;strong&gt;&lt;em&gt;‘Great healthcare from great people’&lt;/em&gt;&lt;/strong&gt;, and our Trust Values form the foundation of the trusts organisational culture and how we deliver our services.&lt;/p&gt;\n&lt;p&gt;We are seeking applicants who embrace our Trust values and care so that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;cared&lt;/em&gt;&lt;/strong&gt; for as individuals&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;safe&lt;/em&gt;&lt;/strong&gt;, reassured and involved&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;teamwork&lt;/em&gt;&lt;/strong&gt;, trust and respect sit at the heart of everything we do&lt;/li&gt;\n&lt;li&gt;People feel confident we are &lt;strong&gt;&lt;em&gt;making a difference&lt;/em&gt;&lt;/strong&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At EKHUFT, we are not just &lt;strong&gt;&lt;em&gt;‘making a difference’&lt;/em&gt;&lt;/strong&gt; locally we also run The Healthcare Ethiopia Partnership (HEP) project to support healthcare workers to reduce maternal deaths and deaths in children under five years old in the region of Tigray in northern Ethiopia. The project has been running for eleven years, and HEP members visit twice each year to deliver training programmes to people across rural areas.&lt;/p&gt;\n&lt;p&gt;We really are committed to ensuring our Trust is a &lt;strong&gt;&lt;em&gt;Great Place to work!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;EKHUFT is a great choice for people who want to develop their career in an ambitious, safe, caring, dynamic, innovative and respected environment; we also offer an excellent benefits package which includes onsite childcare facilities&lt;strong&gt;&lt;em&gt;, ‘We Care’ &lt;/em&gt;&lt;/strong&gt;Benefits, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;If you would like to be a part of our dynamic EKHUFT team, don’t delay and apply today! We would love to welcome you to our team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Registered Nurse - General &amp; Specialist Medicine (Canterbury)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242123", "validThrough": "2020-11-09T23:59:59+0000"}