{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 gross per annum"}}, "datePosted": "2020-10-22T15:00:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Join us to help us shape our future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Norfolk and Suffolk NHS Foundation Trust is the main provider of specialist mental health services for the counties of Norfolk and Suffolk, serving a population of 1.6 million. We are in the midst of a transformation and this brings opportunities to influence how things are done.&lt;/p&gt;\n&lt;p&gt;Our inpatient team covers 5 adult mental health wards at Hellesdon Hospital in the city of Norwich. This vacancy is for the Consultant post on Rollesby Ward which is our 10 bed PICU ward.&lt;/p&gt;\n&lt;p&gt;The ward is a purpose built bespoke building with its own secluded garden. The team are very passionate and proactive and are focused on the ward being the best environment for recovery including the use of sensory therapies as alternatives to medication.&lt;/p&gt;\n&lt;p&gt;As Consultant you will provide clinical care and leadership. This role will provide you with the opportunity to play a key strategic role in service design and redevelopment. Not only are we striving to continually improve our model of care but we have been successful in securing the funding to build a new inpatient unit on site. With the support of the architects we are challenging ourselves to think differently about how we deliver services and would very much welcome the input of our teams into the design process.&lt;/p&gt;\n&lt;p&gt;We are looking for applications from highly motivated, enthusiastic psychiatrists who would welcome the opportunity to work in this beautiful part of the world. We encourage leadership roles for senior clinicians as part of the core job and in additional roles, where available, in medical education, management, research and teaching. We work closely with the University of East Anglia Medical School.&lt;/p&gt;\n&lt;p&gt;You must be registered with the GMC. The post holder must also have an entry on the GMC Specialist Register (CCST) in Adult Psychiatry (or within three months of completion of CCST). Applications from those wishing to work flexibly or those wishing to develop academic or special interest sessions are welcomed&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More than three quarters (77%) of people in Norwich say that they love their job &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Norwich is one of the few UK cities that can truly boast to having something for everyone. It has retained a strong local identity, and with that, a strong sense of community. Locals say hello to each other, baristas remember our coffee orders, and you’ll be among the first to know about interesting local projects.&lt;/p&gt;\n&lt;p&gt;This strong sense of community, along with excellent shopping, eating out, affordable house prices and excellent schooling, is why Norwich has been ranked by the Guardian as the UK’s best city to work in.&lt;/p&gt;\n&lt;p&gt;With its sandy beaches and beautiful surrounds, the Norfolk coastline is not to be missed. With 90 miles to explore and very few hills to block the view, you’ll soon learn why it has been designated an Area of Outstanding Natural Beauty. You’d never guess you were only two hours away from central London!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying. Interviews will be held remotely via Microsoft Teams.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanna Woodger&lt;/p&gt;\n&lt;p&gt;Joanna.Woodger2@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rollesby Ward, Hellesdon Hospital, Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Consultant - Psychiatric Intensive Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239033", "validThrough": "2020-11-15T23:59:59+0000"}