{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-06T13:31:17+0000", "description": "&lt;p&gt;The Neonatal Unit at LWNC has 6 intensive care cots, 8 high dependency cots and 20 special care cots with a total cot capacity of 34 cots. In addition there are 2 isolation cots. The Neonatal service provision at East Lancashire is a level 3 Unit catering for a delivery rate of 6500 per year 5000 births (medium-high risk) will occur on the Burnley hospital site. The remaining ~ 1500 deliveries are managed in the 3 birthing centres, 2 based in the community in Blackburn and Rossendale and a co-located birth centre in Burnley on the hospital site.&lt;/p&gt;\n&lt;p&gt;We are currently looking to employ a band 6 neonatal nurse with experience in Neonatal Community outreach/or senior Neonatal experience to join our amazing team her at the Lancashire women and new born centre in Burnley. Applicants will be required to have an up to date portfolio of NMC/ revalidation with evidence of continuing professional development.&lt;/p&gt;\n&lt;p&gt;Please refer to the job description and personal specification for further information and please do not hesitate to contact the recruitment manager for any queries with regard to the advert&lt;/p&gt;\n&lt;p&gt;General Duties / Duties will include:&lt;/p&gt;\n&lt;p&gt;Infants on the Neonatal unit may have a range of complex needs and possibly have received multiple therapies including Nitric oxide and cooling, from intensive to special care.&lt;/p&gt;\n&lt;p&gt;The community service is to Provide a seamless transition of ongoing care and support within the Neonatal unit making plans to progress to the community setting. This will incorporate discharge planning, safeguarding, and supporting with complex needs such as home oxygen/long term nasogastric feeding.&lt;/p&gt;\n&lt;p&gt;Type of candidate&gt;&lt;/p&gt;\n&lt;p&gt;Candidates will be experienced Neonatal Nurses with Qualified in speciality certificate/or significant neonatal experience. They will be able to demonstrate confidence within their field, and strong leadership/ education and development within their practice.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGaynor LovattJob titleManagerEmail addressgaynor.lovatt@elht.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Across East Lancashire Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Community Neonatal Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259929", "validThrough": "2020-11-16T23:59:59+0000"}