{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-05T09:45:47+0000", "description": "&lt;p&gt;If you are passionate about finding innovative ways to deliver flexible, agile contracts to meet the growing needs of the NHS and provide customers with commercial insight to latest market intelligence and analysis, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;This role will support business partnering across Technology and Workforce Directorates. Two areas of which the wider NHS is focussed, and for which there is growth and a need to provide innovative thinking to deliver the needs of the customers and wider stakeholders. You will be supporting the delivery of the whole commercial lifecycle of the technology, as well as maximising the contracted services and partaking in supplier partnership boards.&lt;/p&gt;\n&lt;p&gt;The NHS Business Services Authority plays a key role in delivering services to the wider healthcare system. The Technology and Workforce Directorates support the delivery of services that underpin the benefits of living and working for the NHS. We want to support all those who want to work for, do work and have worked for the NHS by providing the supporting services to the best of our abilities. This is to be achieved by having a broad mix of delivery models and strategies, bringing in latest market thinking and the best people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What you will do:&lt;/p&gt;\n&lt;p&gt;You will lead on the development of sourcing strategies, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Promoting and driving the benefits of using the market to deliver outcomes.&lt;/li&gt;\n&lt;li&gt;Analysing and driving insight from commercial data.&lt;/li&gt;\n&lt;li&gt;Understanding Customer strategies and delivering a customer focussed approach.&lt;/li&gt;\n&lt;li&gt;Supporting business planning and delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What do we need from you?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expertise in delivering good customer experience.&lt;/li&gt;\n&lt;li&gt;Ability to develop commercial strategies to meet business needs.&lt;/li&gt;\n&lt;li&gt;Advanced communication skills in order to establish good working relationships.&lt;/li&gt;\n&lt;li&gt;Experience of advising and influencing managers.&lt;/li&gt;\n&lt;li&gt;Ability to challenge existing thinking.&lt;/li&gt;\n&lt;li&gt;Experience of working with multiple teams to achieve the end goal.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a great role that will help build and influence our brand, enabling us to be the delivery partner of choice and a great place to work.&lt;/p&gt;\n&lt;p&gt;The Commercial team at the NHSBSA is part of the Finance, Commercial and Estates Directorate. The Commercial team has a shared vision of working together as one, providing agility and flexibility to delivering the customer outcomes. We strive to deliver best practice, ensuring processes are commercially sound whilst seeking to lean processes. We are committed to developing our staff and operate a variety of training and apprenticeship programmes, also looking to provide a varied experience across the NHSBSA.&lt;/p&gt;\n&lt;p&gt;If you would like to be part of this team and feel you have the skills, knowledge, and experience to succeed in this role, please take the time to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Jonathan Whitley - jonathan.whitley@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle Upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Commercial Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257097", "validThrough": "2020-11-19T23:59:59+0000"}