{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-10-29T15:16:27+0000", "description": "&lt;p&gt;Salford Royal became only the second NHS Trust in the country – and the first in the North of England – to be rated as Outstanding by the Care Quality Commission on two consecutive assessments in 2015 and 2018. We provide consistently high standards of safe, clean and personal care. We have received numerous accreditations and substantial investment to ensure that it remains at the top of its game.&lt;/p&gt;\n&lt;p&gt;Patients are always at the heart of everything we do and we want professionals with a like-minded approach to care to join us on our quest for continuous improvement.&lt;/p&gt;\n&lt;p&gt;An exciting leadership opportunity has become available for an experienced nurse leader to join the division of Manchester Centre for Clinical Neurosciences (MCCN) hosted in Salford care Organisation, a member of the Norther Care Alliance Group. As the Assistant Director of Nursing for MCCN you will be responsible for the Neurosurgical Specialities. This will include Neurosurgery and Spinal Surgery and the Major Trauma ward. You will also provide leadership for non ward based specialist nursing teams and services within the neurosurgical directorate.&lt;/p&gt;\n&lt;p&gt;You will join a multi professional team of highly skilled individuals whose sole purpose is to ensure that patients and their families are cared for in the best way for them.&lt;/p&gt;\n&lt;p&gt;You will provide managerial and professional leadership and be responsible and accountable for the delivery of a high quality, patient centred nursing service that meets the needs of the patient. You will also work closely with the Clinical Directors and Service Managers in the co-ordination and delivery of services in accordance with National and Trust Health Strategies&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison DwyerJob titleDIvisional Nurse DirectorEmail addressalison.dwyer@srft.nhs.ukTelephone number07730099984Additional contact information&lt;/p&gt;\n&lt;p&gt;Alison Dwyer&lt;/p&gt;\n&lt;p&gt;Divisional Director of Nursing, Manchester Center for Clinical Neurosciences&lt;/p&gt;\n&lt;p&gt;Telephone: 0161 206 2310&lt;/p&gt;\n&lt;p&gt;Email: alison.dwyer@srft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Assistant Director of Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248842", "validThrough": "2020-11-12T23:59:59+0000"}