{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47000", "minValue": "47000", "unitText": "YEAR", "value": "Up to £47,000 pro rata, depending on experience"}}, "datePosted": "2020-11-05T08:49:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Sonographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking to work in a community setting where you meet a broad range of people? Do you thrive working independently, albeit in a supportive environment? We are looking for Sonographers to join our team, delivering our ultrasound service across multiple clinic locations in Gloucestershire: Hadwen Medical Centre, Cleevelands Medical Centre, Stroud Hospital, Four Shires Medical Centre and Lydney District Hospital.&lt;/p&gt;\n&lt;p&gt;Occasional cover might be required in other areas such as Bristol, North Somerset and South Gloucestershire and our service also incorporates running clinics from HM Prison locations.&lt;/p&gt;\n&lt;p&gt;You must be registered with HCPC (Health and Care Professions Council), skilled in non obstetric ultrasound with additional gynaecology skills and able to report independently. Ability to scan Musculoskeletal, DVT (Bristol) and small parts are an added advantage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Sonographer to join our team in Gloucestershire. Full time and part time hours available. Clinics typically run between 8am and 6pm Monday to Friday in Gloucestershire and Monday to Saturday in Bristol.&lt;/p&gt;\n&lt;p&gt;You will possess excellent communication and interpersonal skills and be comfortable working in the community with a Healthcare Assistant to support you in clinics, with our broader clinical team supporting you remotely.&lt;/p&gt;\n&lt;p&gt;We schedule breaks to allow catch up time within our clinics and we do not double book in anticipation of patients not attending.&lt;/p&gt;\n&lt;p&gt;Travel to our community clinic locations will be required, therefore a current driving licence and access to a car is an essential requirement. Travel time is paid, as is mileage.&lt;/p&gt;\n&lt;p&gt;Benefits includes 30 days holiday plus bank holidays, pro rata if part time, together with a 14% non-contributory pension.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be contacted to attend an interview and if sucessful will then be asked to attend one of our clinics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a CQC accredited healthcare provider of community based healthcare services including diagnostics, outpatient and ancillary services to NHS and private patients, currently within Bristol, North Somerset, South Gloucestershire and Gloucestershire but looking to branch out further to new CCG areas across England. In addition we offer a variety of support services to our shareholder base of 100 practices which comprise over 650 GPs who look after approximately 1,000,000 patients. Our services are clinically led, developed to meet patient needs and provide cost and efficiency savings to the NHS.&lt;/p&gt;\n&lt;p&gt;GP Care&#39;s key patient values are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Services are always designed around the patient&lt;/strong&gt; - services that are well managed, efficient, convenient and accessible for patients are generally cost effective for commissioners;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We treat patients with kindness, dignity and respect &lt;/strong&gt;- as if we were talking to a friend or relative about an important matter;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We always talk to patients&lt;/strong&gt; - we don&#39;t make appointments without direct verbal contact and patients are provided with a telephone contact number for each service, all of which are answered personally and promptly. We don&#39;t like automated voice systems and we don&#39;t use them;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Keeping referring GPs informed&lt;/strong&gt; - all of our services provide GPs with discharge reports within 24 hours of an appointment as we believe this is critical to ensuring they are fully informed should a patient refer to them for continuing advice or support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;GP Care is committed to a policy of equality in all our employment practices and it is essential that all staff are willing to make a positive contribution to the promotion and implementation of this. Recruitment is done in line with safe recruitment practices.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service check (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "GP Care Uk Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130255"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucestershire", "postalCode": "GL4 4BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8415", "longitude": "-2.2043"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256954", "validThrough": "2020-11-19T23:59:59+0000"}