{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365.00 to 37,890.00"}}, "datePosted": "2020-10-29T08:48:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Continuing Healthcare Assessor&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Nurse (Adults)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to a vacancy within our team, we are able to offer the following opportunity for a motivated Registered Nurse (Adults) wishing to develop their career working within a Clinical Commissioning Group. The role is working in the Specialist Assessment and Placements Team based in Gravesend, Kent. You will be employed by NHS Kent and Medway CCG and primarily working across the Swale, Medway, Dartford, Gravesham and Swanley areas.&lt;/p&gt;\n&lt;p&gt;The Specialist Assessment and Placements Team is responsible for undertaking detailed clinical assessments, quality reviews and commissioning services and support for individuals subject to various NHS eligibility criteria, such as The National Framework for NHS Continuing Healthcare and NHS Funded Nursing Care, The Mental Health Act and Neurological Rehabilitation pathways.&lt;/p&gt;\n&lt;p&gt;We are seeking a Registered Nurse (Adults) with relevant patient experience and case management with excellent communication and assessment skills. You will be required to evidence a working knowledge of NHS Continuing Healthcare pathways and tools and have an interest in developing your skills further in this interesting field of practice. In return we can offer you the opportunity of flexible, varied and interesting work, excellent career progression and the support of a highly motivated, friendly, supportive team and organisation.&lt;/p&gt;\n&lt;p&gt;The hours are Monday to Friday 09.00 – 17.00 hours, though we can offer flexibility and part-time or full-time contracts.&lt;/p&gt;\n&lt;p&gt;It is important to note that you will need the ability to travel to a variety of locations to undertake this post.&lt;/p&gt;\n&lt;p&gt;We are based at the Civic Centre, Gravesend and if successful in your application you will be entitled to the 5% outer London Fringe Allowance.&lt;/p&gt;\n&lt;p&gt;Informal visits or discussions regarding the posts are warmly welcomed, please contact either:&lt;/p&gt;\n&lt;p&gt;Cathy Cackett, Senior Nurse Assessors on 03000 424999&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Kent and Medway Clinical Commissioning Group (formerly known as NHS Swale CCG)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend", "postalCode": "DA12 1AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.44", "longitude": ".368548"}}, "title": "Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247669", "validThrough": "2020-11-12T23:59:59+0000"}