{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38890 - £44503"}}, "datePosted": "2020-10-29T13:46:46+0000", "description": "&lt;p&gt;This is an exciting opportunity for an experienced person with proven leadership ability to join the cancer services team in our award winning chemotherapy day unit. Due to the success of the unit, we are expanding the activity and will eventually be providing services across 7 days of the week.&lt;/p&gt;\n&lt;p&gt;The operating hours of the unit are currently 8am to 8pm Monday to Friday, with a longer term aspiration to move to 7 day working. Due to the promotion of the current post holder we are looking for someone with motivation and vision to manage and lead the team.&lt;/p&gt;\n&lt;p&gt;The role involves prioritizing and managing the daily workload of the unit and provision of strong leadership to an expanding team. Practical elements of the role involve promoting awareness and education of oncology issues and supporting patients and their families during a critical time in their cancer care. You will be instrumental in the development of your staff to ensure that we continue to offer the best experience possible for patients and a rewarding career for the team in Oncology. In return you will receive excellent mentorship and support from the cancer services management team.&lt;/p&gt;\n&lt;p&gt;You will be very well supported by our Lead Systemic Anti-Cancer Therapies Nurse, Acute Oncology Lead Nurse a team of chemotherapy nurses, Health Care Assistants and administration staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Successful applicants will be subject to an Enhanced DBS (with barred list for vulnerable adults) check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews for this position will take place on Tuesday 8th December 2020. They will be competency based and applicants may be required to complete a seen or unseen presentation as part of this interview process. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post, please contact&lt;/p&gt;\n&lt;p&gt;Jessica Blandford, Cancer Operational Manager Jessica.blandford@sthk.nhs.uk&lt;/p&gt;\n&lt;p&gt;Pat Gillis, Cancer Manager 01744 646774&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St helens Hospital, St Helens", "postalCode": "WA9 3DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4405", "longitude": "-2.71946"}}, "title": "Lilac Centre Unit Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248558", "validThrough": "2020-11-20T23:59:59+0000"}