{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110693", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,693 pa"}}, "datePosted": "2020-10-29T15:00:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant Clinical Oncologist with an interest in Gynaecological Cancers 8.5PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston NHS Foundation Trust (UHBW) is looking to appoint an enthusiastic clinical oncology consultant to join an established multi-disciplinary team caring for patients with gynaecological cancers. The successful applicant will work alongside colleagues to supervise both radiotherapy and systemic treatments. Experience of brachytherapy is desirable. The post will also include an acute oncology session at North Bristol NHS Trust. The initial appointment is for a locum for up to 12 months prior to advertising a substantive post.&lt;/p&gt;\n&lt;p&gt;UHBW is one of the largest acute Trusts in the country and the major teaching and research centre for the South West. The trust was awarded ‘Outstanding’ status in both 2017 and 2019 by the Care Quality Commission. The successful candidates will join a team of over 40 (not all full time) consultants in oncology, haematology and palliative care. The Bristol Cancer Institute is part of the Bristol Haematology and Oncology Centre (BHOC), providing services to a catchment population of 2.2 million people. &lt;br /&gt;&lt;br /&gt;Significant new investment is ongoing in the Bristol Cancer Institute. The radiotherapy department offers IMRT, high dose rate brachytherapy, SABR and Gamma Knife stereotactic radiosurgery. Adult chemotherapy for Bristol, is delivered in our 30 bedded in-patient unit, 20 chair chemotherapy day unit our two community units and for Weston in the chemotherapy day unit in Weston General Hospital. The South West Teenage and Young Adult unit opened in 2014 providing specialist in- and out- patient facilities. There is an active clinical trials unit with close links to the University of Bristol and the University of the West of England. Over 100 clinical trials are currently open and the successful candidates will be encouraged to develop teaching and research opportunities. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Bristol has an exciting and diverse culture with excellent schools. It was voted by the Sunday Times in 2017 as the best city in Britain to live in. There is quick access to the South West of England, Wales and London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates must be on the Specialist Register of the GMC with a valid licence to practice in line with the introduction of revalidation on 16 November 2009. They will have completed Specialist Training (or equivalent) or have a CCT date in Clinical Oncology within six months of the date of interview. Applicants wishing to work as part of a job share or work more part time than outlined are encouraged to apply.&lt;br /&gt;&lt;br /&gt;The closing date for applications is 15 November 2020 with interviews scheduled for 24 November 2020.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJessica JenkinsAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Jessica Jenkins, Clinical Lead for oncology (jessica.jenkins@UHBW.nhs.uk), Dr Jeremy Braybrooke, Clinical Director, BHOC, &lt;br /&gt;(jeremy.braybrooke@UHBW.nhs.uk) or Sophie Baugh General Manager of BHOC (sophie.baugh@UHBW.nhs.uk), via the Management Office on 0117 342 6291&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Haematology and Oncology Centre, Bristol", "postalCode": "BS2 8ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4583", "longitude": "-2.59763"}}, "title": "Locum Consultant In Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248784", "validThrough": "2020-11-15T23:59:59+0000"}