{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-16T13:16:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 7 EPR Configuration Analyst&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust is an Academic Health Science Centre (AHSC) and the largest trust in the country. Our mission is to provide world class healthcare for our patients, through excellence in research, education and training.&lt;/p&gt;\n&lt;p&gt;The Trust is seeking to appoint one substantive EPR Configuration Analyst. The Trust has a Cerner Millennium EPR and a range of other clinical systems as well as an Information Exchange Portal for integrated working with primary and social care. The strategy is based upon the implementation and exploitation of the Cerner Millennium suite of software and extending its application into all aspects of patient care and care management. To support the clinically-led programme in order to maximise clinical benefits and also achieve significant operational process efficiencies and financial savings we are seeking one EPR Configuration Analyst Band 7.&lt;/p&gt;\n&lt;p&gt;Our EPR Configuration Analysts’ undertake the work of developing new clinical functionality within the Trust’s Cerner Millennium system, adapting workflows to meet clinical and operational needs and troubleshoot issues arising with the system, as part of a wider support team.&lt;/p&gt;\n&lt;p&gt;As an EPR Configuration Analyst you will have knowledge and experience of clinical and operational practice in NHS Acute Trusts. You must demonstrate an appreciation and vision as to how clinical and operational practice can be transformed and supported by electronic patient records and clinical systems. The objective of this will be to enhance patient safety and experience, reduce costs and improve process efficiency.&lt;/p&gt;\n&lt;p&gt;You will have strong analytic skills with an appreciation of process and workflow. It is important to be able to understand issues from the user perspective and not just as technical problems. Structured, systematic thinking to work to solutions is essential. You must also be able to articulate issues to and communicate with non technical clinical and operational system users.&lt;/p&gt;\n&lt;p&gt;Although we do not expect you to be a Project Manager you must be able to lead a team and coordinate activities towards a defined objective.&lt;/p&gt;\n&lt;p&gt;You will possibly have a high level of specialist training in Cerner Millennium but will be trained further as the scope of functionality of the Cerner Millennium system at Imperial increase.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust reserves the right to close this vacancy prior to the closing date should we receive 50 applications prior to the advertised closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Foysol Ahmed, Configuration Analyst Team Manager on 07768 790 100 or email foysol.ahmed@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital, London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 7 EPR Configuration Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230379", "validThrough": "2020-11-06T23:59:59+0000"}