{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-19T16:45:28+0100", "description": "&lt;p&gt;We are looking to recruit a motivated Locum Consultant Physician with an interest in Diabetes and Endocrinology.&lt;/p&gt;\n&lt;p&gt;The Trust has a strong multi-disciplinary diabetes team that works across the Worcestershire hospitals and the community. There is a longstanding reputation for delivering excellent structured education with both DAFNE and XPERT.   Our team was one of the pilot Think Glucose sites, and is recognised for its innovative and proactive approach to inpatient care.  A 2015 Peer Review of the service by the Society for Endocrinology was very positive.  Our bariatric service is provided by a full MDT that includes dedicated dieticians, three surgeons, a specialist nurse and support from a specialist clinical psychologist and radiologist.&lt;/p&gt;\n&lt;p&gt;The Trust has close links with the University of Birmingham and actively encourages participation in research.&lt;/p&gt;\n&lt;p&gt;You will contribute to the in-patient General (Internal) Medicine service and will participate in the on-call Consultant rota which is 1:12.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post provides an exciting opportunity to work in a vibrant and motivated department. Potential applicants who wish to find out more should contact Dr Irfan Babar, Consultant Endocrinologist on 01527 503030.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexandra Hospital, Redditch", "postalCode": "B98 7UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2798", "longitude": "-1.91212"}}, "title": "Locum Consultant in Diabetes &amp; Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233224", "validThrough": "2020-11-24T23:59:59+0000"}