{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-05T13:01:24+0000", "description": "&lt;p&gt;CPFT are offering an exciting opportunity to gain experience working internationally. We are working with a major provider of healthcare services in Qatar to support the development of their psychology service through an extended programme of training, practice development and system change. We are looking for a dynamic, enthusiastic and experienced psychologist to join our international services team. This role will involve travel to and work in Qatar for extended periods over several months, punctuated by time back in the UK.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced psychological professional (clinical/ counselling psychologist) who will join both our team based in the UK and the team in Qatar. They will be expected to, in collaboration with the UK team, provide clinical leadership and supervision, and develop and deliver a high-quality, evidence-based development programme for junior members of the psychology team from our partner organisation. The successful candidate will be working closely with other CPFT psychological professionals in Qatar and will be supported by Cambridge-based senior clinical psychologists with time dedicated to the project. We expect the post-holder to work closely with the Director of Psychological Services and the Project Team to develop a programme of development for our partner organisation.&lt;/p&gt;\n&lt;p&gt;Currently the programme is operating remotely meaning that the team have adopted working hours to account for the time difference. Currently the team are operating 8:00 - 16:00. Once the team are able to travel the working hours in the UK will be 09:00 - 17:00 but when travelling to Qatar the team will work Sunday- Thursday 07:00- 15:00 to reflect the local working week.&lt;/p&gt;\n&lt;p&gt;Applications are sought from experienced HCPC registered practitioner psychologists (clinical or counselling) with significant experience of NHS mental health or IAPT service provision. Our ideal candidate will have demonstrated interest and experience in developing services, will be flexible and adaptable, and will have experience in training and supporting other staff. Skills in the delivery of additional modes of psychological therapy, knowledge of the regional cultures, and the ability to speak Arabic will be highly desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jess Mackenzie-Denman, Project Co-ordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jess.Mackenzie-Denman@cpft.nhs.uk / 07901917681&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nick Oliver, Director of Psychological Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nick.Oliver@cpft.nhs.uk / 01223 219420 (Internal Ext: 19420)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Elizabeth House, Fulbourn", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "International Services - Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257758", "validThrough": "2020-11-19T23:59:59+0000"}