{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23080", "minValue": "22183", "unitText": "YEAR", "value": "£22,183 - £23,080 per annum pro rata"}}, "datePosted": "2020-10-29T16:19:50+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Reablement Assistant (34.5 hours)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is Redcar and Cleveland. We are an ambitious council keen to build on our strong track record of innovation and partnership working, ensuring that we create a flourishing future for the borough and all of its residents. Key to this is a committed workforce who always gives their best. Offering a fast paced, progressive working environment, Redcar and Cleveland Borough Council is a great career move.&lt;br /&gt;&lt;br /&gt;The Adults &amp; Communities Directorate, consists of three strands, Adult Social Care, Community Development, and Public Health. Our aims are to continue to provide essential and highly valued services and to build capacity to enable local communities to make lasting change, improve quality of life, prosperity and the environment. As a directorate we lead on developing a culture of co-operation and co-production, respecting and nurturing the skills and talents of local people and enabling them to fulfil their potential.&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for Senior Reablement Assistants to join the team at our new Intermediate Care centre. The centre will provide short term rehabilitation (for up to six weeks) which enables people to regain as much independence as possible in skills for daily living (personal care, meal prep, medication, mobility, use of equipment etc.).&lt;br /&gt;&lt;br /&gt;The successful candidate will: hold a level 3 Diploma in Health and Social Care or equivalent or commit to achieving this within 1 year of commencing employment; hold the HSC level 3 Medication Unit or have a commitment to achieve the unit; numeracy and literacy level two or equivalent; have extensive experience of working in a care/health setting; have an understanding of the ethos of Reablement.&lt;br /&gt;&lt;br /&gt;For further information contact Lisa Mussett on 07901 330045 or Mark Coates on 07881 518727.&lt;br /&gt;&lt;br /&gt;The authority is committed to safeguarding and promoting the welfare of children/young people and vulnerable adults. All staff and volunteers must share this commitment and a Disclosure and Barring clearance will be sought.&lt;br /&gt;&lt;br /&gt;The council holds ambassador status for the North East Better Health at Work Award.&lt;br /&gt;&lt;br /&gt;We offer very attractive terms and conditions of employment, including generous annual leave entitlement, flexible working hours (where appropriate), membership of the Local Government Pension Scheme and access to numerous other salary sacrifice schemes and staff benefits/discounts, including a lease car scheme.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Redcar and Cleveland Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130615"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Meadowgate, Eston", "postalCode": "TS6 9NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5616", "longitude": "-1.13154"}}, "title": "Senior Reablement Assistant (The Meadowgate Centre, Eston)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249059", "validThrough": "2020-11-06T23:59:59+0000"}