{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per Annum"}}, "datePosted": "2020-11-05T10:16:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and experienced Personal Assistant to join the Division of Surgery and Cancer. We are looking for a PA who has experience of working in a complex setting and will deliver a high quality PA service, administrative and secretarial support to the Divisional Directors of Operations, Medical, and Nursing and Governance. This role will be challenging and very busy and you will be expected to work on your own initiative to organise and prioritise your own workload to meet tight deadlines. You will take personal responsibility for ensuring the smooth running of the divisional director’s office and organising key meetings. This will include the timely production of minutes, agendas and action logs. Having a good working knowledge of Microsoft Office Packages, you will have experience of managing a number of diaries with competing priorities, as well as monitoring and prioritising incoming communications.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills and will have experience in dealing with people in a calm, friendly and professional manner.&lt;/p&gt;\n&lt;p&gt;The Trust is based on two sites, Queen Elizabeth Hospital, Woolwich and University Hospital Lewisham, and also has sites in the local community. This role will be based at Lewisham Hospital and you will be required to work across the Trust sites to support the division and the trust runs a shuttle bus throughout the working day for staff.&lt;/p&gt;\n&lt;p&gt;Whilst it is desirable that you have experience of working in the NHS, we welcome applications from candidates with PA experience from other business sectors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatalia NeiraJob titleDivisional General Manager - Business SupportEmail addressNatalia.neira@nhs.netTelephone number07795 850617&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lewisham Hospital, London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Divisional Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257179", "validThrough": "2020-11-15T23:59:59+0000"}