{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-11-04T17:45:33+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to manage the development of homecare services and promote the cost effective use of biologics, particularly in rheumatology and gastroenterology, throughout the Trust. Utilising your skills to help promote and utilise prior approval schemes such as Blueteq to ensure that patients are receiving treatments against nationally approved indications and within locally agreed pathways.&lt;br /&gt;&lt;br /&gt;We are looking for a Pharmacist with vision who can develop homecare services in line with the Department of Health’s strategy “Homecare medicines towards a vision of the future” &lt;br /&gt;&lt;br /&gt;Possessing an appropriate post-graduate qualification, you will have experience in hospital Pharmacy and an interest in current therapeutic practice and developments in rheumatology and gastroenterology. A good understanding of High Cost Drugs medicines managements is key to this role. Self-motivated with good communication and interpersonal skills, you will be persuasive and will contribute to the process of service development by your own initiative and enthusiasm.&lt;br /&gt;&lt;br /&gt;There will be a requirement to participate in extended working hours including late nights, weekends and bank holidays on a rotational basis.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christopher Astbury&lt;br /&gt;Lead Pharmacist, High Cost Drugs, Homecare and Third Party Business Solutions&lt;br /&gt;christopher.astbury@pat.nhs.uk&lt;br /&gt;0161 778 2647&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury &amp; Rochdale Care Organisation, Bury (Trust Wide)", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Highly Specialist Pharmacist - Homecare &amp; PbR excluded medications", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256840", "validThrough": "2020-11-18T23:59:59+0000"}