{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158-£76,751 Per Annum"}}, "datePosted": "2020-11-03T14:16:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in Oral &amp; Maxillofacial Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust have an exciting opportunity for an enthusiastic Specialty Doctor to work in our dynamic and Oral &amp; Maxillofacial department. Applications are welcome and the post is available as soon as an ideal candidate or candidates are found. Candidates for this role must have GDC Registration and recent experience within the NHS in Oral &amp; Maxillofacial Surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Department &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Specialty Doctor post will see the successful candidate join our Oral &amp; Maxillofacial team based in the Royal Shrewsbury &amp; Telford Hospital. The post commitments are split between both Hospitals with main inpatient wards at the Princess Royal Hospital Telford. This well-equipped Oral &amp; Maxillofacial Department provides services for over 500,000 patients spread over the county of Shropshire and Mid Wales.&lt;/p&gt;\n&lt;p&gt;You will be working alongside a friendly, expert and energetic team of Consultants, Staff Grade Doctor, Junior Doctors, Specialist Nurses and Technicians. The whole department is overseen by Mr Mr Brian Castling, Clinical Lead for OMFS/Consultant OMFS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Hospitals are located in Shrewsbury and Telford and are brimming with exemplary teams of hardworking individuals.&lt;/p&gt;\n&lt;p&gt;It is a particularly exciting time to join the Trust as we have recently started working collaboratively with the Virginia Mason Hospital in Seattle. We are one of only 5 UK hospitals to receive this support, from what is regarded as the safest hospital in the world. This collaboration means employees can benefit from the KPO (Kaizen Promotion Office) and value Stream work, gaining valuable help and guidance regardless of your level of expertise. It poses a unique opportunity to make a difference and we hope you will want to be a part of our journey. More about this can be found under further links.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shropshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Shropshire is a beautiful county located between the West Midlands and North Wales. Whilst rural and home to the Shropshire Hills it is anything but sleepy. The county is bustling with idyllic towns including Shrewsbury, Oswestry, Bridgnorth and Ludlow, with plenty to do regardless of your interests. More information can again be found under further links.&lt;/p&gt;\n&lt;p&gt;We are ideally located between the north and the south making travelling around the UK extremely easy. As well as being only a short distance from major cities and busy transport links including Birmingham airport, our county also borders with beautiful north Wales which is abundant in outdoor activities, brilliant beaches, and thrilling scenery.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Brian CastlingJob titleClinical Director for Oral &amp; Maxillofacial Surgery &amp; Consultant Oral &amp; Maxillofacial SurgeonEmail addressbrian.castling@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;We want you to find out more about the department and our hospitals, and we invite you to contact us with any questions you may have on 01743 261281, or even arrange a visit. Please also take the time to read any supporting documentation to really get to know us.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Shrewsbury and Telford Hospital NHS Trust, Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Specialty Doctor in Oral &amp; Maxillofacial Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254299", "validThrough": "2020-12-01T23:59:59+0000"}