{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 £45,780 - £51,393 pa inc hcas"}}, "datePosted": "2020-11-02T15:16:20+0000", "description": "&lt;p&gt;The Royal Marsden is a centre of excellence with an international reputation for ground-breaking research, complex major surgery and pioneering the very latest in cancer treatments and technologies.&lt;/p&gt;\n&lt;p&gt;At the Royal Marsden we have a distinct set of values that define what we are and how we behave. Our values encompass showing kindness and compassion and putting our patient care first, offering ideas for improving the quality and safety of services and supporting others in new ways of working, taking responsibility for personal and team performance and priorities and striving to ensure quality of services and make the best use of resources. We strive for excellence in all that we do and encourage professional development for all staff. &lt;br /&gt;We currently have a part-time vacancy for a dynamic, motivated Resuscitation Officer to join our Service. The post is suitable for an established resuscitation officer who has current experience in the planning and delivery of a resuscitation service and educational programme.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You must be a certified instructor in Adult Advanced Life Support course and demonstrate excellent clinical skills in resuscitation. Ideally you should have an acute or critical care background.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The role is key to the Trusts’ patient safety agenda through education, audit and quality improvement measures.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will join a multi-professional clinical education team and have the opportunity to develop their clinical and simulation educational skills; delivering Excellence in Education to the Trust and our Community partners.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Laura Parnis, Resuscitation Officer, laura.parnis@rmh.nhs.uk, 0207 352 8171&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Resuscitation Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252580", "validThrough": "2020-11-11T23:59:59+0000"}