{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-23T14:30:21+0100", "description": "&lt;p&gt;Birmingham Women’s and Children’s NHS Foundation Trust – An exciting opportunity has arisen within the R&amp;D department and we are looking for an enthusiastic , dedicated Research Nurse to join our friendly Paediatric Generic Research Nurse Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will have a primary role in supporting all aspects of research activity including recruitment, administering assessments and data collection for the research, audit and evaluation of studies being delivered by Birmingham Women and Children’s NHS Foundation Trust. This post is ideal for someone with an interest in delivering research across a wide range of specialities for children, young people and young adults.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be an excellent communicator, be on sub part one ( children ) of the nursing register and hae previous working experience and knowledge of audit, research design and delivery of research projects. You will need excellent interpersonal and team working skills; and be capable of working independently and flexibly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for maximising recruitment into research studies within the Trust. The post will be based in the R+D team at Birmingham Children’s site and duties will include study setup, protocol implementation, development of recruitment strategies and general data management for a variety of NIHR portfolio studies. The post holder will be responsible for the co-ordination and maintenance of accurate, comprehensive records for clinical trial files in order to support the Research and Clinical Teams in all aspects of recruitment, education and monitoring of patients entering clinical trials. They will support the development of the department by working alongside Research Teams in setting up and raising the profile of clinical trials.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In the event of an exceptionally high level of response, we reserve the right to close the post before the date stated in order to prevent the number of applications received being unmanageable. You are advised to submit your completed application as soon as possible to have the best chance of being considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Children&#39; Hospital", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240923", "validThrough": "2020-11-08T23:59:59+0000"}