{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (dependent on experience)"}}, "datePosted": "2020-10-28T13:15:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Pharmacy Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pharmacy Technician – Training and Dispensary Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:Band 5 - £24,907 - £30,615 pa (dependent on experience)&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hours:37.5 per week – permanent contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:Michael Carlisle Centre, Nether Edge, Sheffield S11 9BF&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Ref:457-20-030-MD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust’s Pharmacy Department is seeking to appoint an experienced and highly skilled registered Pharmacy Technician to lead the training and development of technicians and ATOs and lead the day to day operation of the dispensary. The post is interesting and varied and includes:&lt;/p&gt;\n&lt;p&gt;•participating in the technical support necessary for the safe and effective dispensing and distribution of medicines to the designated units of SHSC&lt;/p&gt;\n&lt;p&gt;•participating in the accuracy checking of prescriptions&lt;/p&gt;\n&lt;p&gt;•assist in the training, development and mentorship of apprentice ATOs and apprentice technicians&lt;/p&gt;\n&lt;p&gt;You will need to hold a recognised Pharmacy Technician qualification (BTEC in Pharmaceutical Sciences, NVQ level 3 or equivalent) and must be registered as a Pharmacy Technician with the GPhC. You must also be able to demonstrate a thorough understanding of the training and development needs of pharmacy technical staff. The role includes co-ordinating the training of end users of the electronic prescribing system across the Trust, so you should have experience of working with a wide variety of staff disciplines. A key part of the role will be deputising for the dispensary manager, so the ability to lead a team and assist them in prioritising and organising their workload, is essential.&lt;/p&gt;\n&lt;p&gt;Additionally the Trust provides services across Sheffield and although the post is based at the Michael Carlisle Centre it may necessitate some travel around the city to various units of the Trust.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S11 9BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3615", "longitude": "-1.49796"}}, "title": "Pharmacy Technician - Training and Dispensary Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246719", "validThrough": "2020-11-15T23:59:59+0000"}