{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-27T09:49:48+0000", "description": "&lt;p&gt;Due to promotion and new opportunities being taken by our team, we are looking to recruit to the specialist practitioner role within the CHC HUB team.&lt;/p&gt;\n&lt;p&gt;This is your invitation to join the CHC HUB team with the opportunity to further your professional skills at this exciting time of team expansion. We are a supportive and welcoming team and work together to meet the challenges facing us.&lt;/p&gt;\n&lt;p&gt;The HUB team take pride in supporting each other and during the lockdown period were able to welcome and support new members in our new virtual world.&lt;/p&gt;\n&lt;p&gt;Please see the advert below which outlines the HUB functions that you would be supported to learn and gain competency in and function as an effective member of the team.&lt;/p&gt;\n&lt;p&gt;West Hampshire CCG is responsible for planning and funding local health services for the 546,000 residents of west Hampshire. We are an ambitious organisation with big plans for the health of local people and are looking for equally ambitious people to join us. We are looking to recruit people to help us deliver our priorities and to support our new focus in our geographical localities, and in our role across the wider Hampshire health system.&lt;/p&gt;\n&lt;p&gt;This focus will help us to achieve a number of goals including being responsive to localised service user’s needs, being better able to respond to changes in the wider health sector and working closer with our partners to achieve the best quality services for our communities.&lt;/p&gt;\n&lt;p&gt;The role of specialist practitioner within the quality hub is central to provision of a quality service for our clients and their families. On a day to day basis we provide a quality review for NHS continuing healthcare applications and support of our colleagues within the acute and community sectors in ensuring all CHC applications are completed accurately and in a timely way. Our team also supports our internal decision making panels and the external NHS England panel process. We complete any appeals received following closure of applications and meet with families to discuss the outcomes.&lt;/p&gt;\n&lt;p&gt;We are seeking a healthcare professional who has skills in communication and would be confident in meeting with families. Previous experience with CHC framework would be desirable but not essential as we can provide a tailored induction and training programme for you. If you are committed to providing a quality service, are a great team player, flexible and motivated to learn each day then this could be your opportunity to join our team.&lt;/p&gt;\n&lt;p&gt;We are able to offer excellent benefits for our staff including generous leave arrangements, free car parking, childcare vouchers, an excellent pension scheme, opportunities for further training and development and a commitment to our own staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;If you are looking for a job that really does make a difference for people, want to help improve health services in this area and want to work with inspirational and professional people, then you should consider applying for this job.&lt;/p&gt;\n&lt;p&gt;More details are provided in the job description but if you would like further information contact&lt;/p&gt;\n&lt;p&gt;Jacqueline Robinson Clinical lead,&lt;/p&gt;\n&lt;p&gt;T:07585882774.&lt;/p&gt;\n&lt;p&gt;E: Jacqueline.robinson9@nhs.net&lt;/p&gt;\n&lt;p&gt;You should note that we generally appoint at the first pay point of the scale indicated in the advert, unless you are transferring from another NHS organisation when other arrangements apply.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to a six month probationary period.&lt;/p&gt;\n&lt;p&gt;Due to the COVID pandemic this role will be working from home initially. This position will be kept in review in line with CCG policy. Interviews for this post will take place virtually via Microsoft Teams&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS West Hampshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128558"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fareham", "postalCode": "PO16 7AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8541", "longitude": "-1.17547"}}, "title": "CHC Specialist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243886", "validThrough": "2020-11-12T23:59:59+0000"}