{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-27T20:30:20+0000", "description": "&lt;p&gt;&lt;strong&gt;“Specialist Liaison Practitioner working within&lt;/strong&gt;&lt;strong&gt; Hull Royal &amp; Castle Hill Hospitals”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Humber NHS Trust to join the Mental Health Liaison Service working within Hull Royal Infirmary and Castle Hill Hospitals.&lt;/p&gt;\n&lt;p&gt;The Mental Health Liaison Service delivers comprehensive mental health assessments, brief intervention, care planning and signposting/referrals for patients who present to the A&amp;E department or who have been admitted to hospital. The team works closely with many local services such as substance misuse services, Homeless Team, Frequent Attenders Service, Social Services and the local community Crisis Teams, (to name a few), in order to help collaboratively meet the needs of those with mental health difficulties. The team receives invaluable support from a Clinical Lead and two consultant psychiatrists based within the service.&lt;/p&gt;\n&lt;p&gt;We are an ageless service working to address the mental health needs of people presenting to and receiving care in the acute setting. Common presentations include suicidal ideation, deliberate self-harm, depression, dementia, alcohol misuse and psychosis. We assess people in the Emergency Department (ED) and from any ward across the hospitals. Due to the demands of acute care medicine, urgent care and ED pressures- the work is diverse, fast paced and clinically rich!&lt;/p&gt;\n&lt;p&gt;Post holders will enhance ED departments providing prompt response for assessments and assisting to treatment delivery within the ED 4-hour targets and NHS England response times. The liaison role is also to support the education and training of acute care staff around mental health issues and aim to reduce the stigma this patient group often face therefore improving the quality of care they receive when accessing care within the acute trust setting.&lt;/p&gt;\n&lt;p&gt;We are advertising for Band 6 Specialist Liaison Practitioner post to work long day shifts which include nights, twilights and weekends on a 24/7 roster.&lt;/p&gt;\n&lt;p&gt;The key attributes for applicants to this service are enthusiasm, adaptability, flexibility, a willingness to learn and a desire to provide excellent standards of care to the people who use our services.&lt;/p&gt;\n&lt;p&gt;We would welcome interest from Registered Nurses in Mental Health or Learning Disabilities and Social Workers, working at Band 6 level who have experience of working in liaison/front line and crisis services or those who have worked with patients with complex mental health difficulties. All successful applicants will receive robust supervision and be supported in their own professional development. Due to providing a service to two hospital sites the ability to commute within the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Team Leader Emma Thompson or Clinical Lead Emma Hooley on 01482 226226. Please do not ring this number for application packages.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Department Of Psychological Medicine, Hull", "postalCode": "HU32RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7433", "longitude": "-.362226"}}, "title": "Specialist Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245655", "validThrough": "2020-11-10T23:59:59+0000"}