{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T14:31:20+0100", "description": "&lt;p&gt;Are you a provisionally registered pharmacist starting your career or a qualified pharmacist looking to progress? Our band 6 rotation offers you the building blocks you need to develop a career in hospital pharmacy; with rotations through clinical pharmacy, medicines advice, dispensary and technical services units you will be provided a wide range of opportunities to build your foundation portfolio. We have 1 yea fixed term contract full time and permanent position full time.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;University Hospital Southampton NHS Foundation Trust (UHS) has one of the largest pharmacy departments in the country with over 300 staff and are nationally recognised for their innovation. The pharmacist team is made up of over 100 pharmacists; including over 50 qualified independent pharmacist prescribers and several consultant pharmacists and leading national experts.&lt;/p&gt;\n&lt;p&gt;As a department, each week we review over 16,000 medicines for their appropriateness, dispense over 8000 patient specific medicines, manage an expenditure of approximately £1.5 million on medicines and provide access to medicines, advice and e-prescribing support 24 hours a day, 7 days a week.&lt;/p&gt;\n&lt;p&gt;We are committed to training and ensure all junior pharmacists receive regular feedback and assessments within their rotations to support development. We have regular pharmacist teaching sessions within the department and more recently some dedicated band 6 and 7 development teaching sessions delivered on a variety of topics by some of our own specialist pharmacists.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;You will be joining a team of at least 12 other band 6 pharmacists and will work on 3 monthly rotations covering all areas of our pharmacy department; dispensary services, regional medicines advice service, clinical trials, aseptic services including oncology and TPN, and clinical pharmacy. You will have a regular ward commitment with each rotation covering a variety of different clinical specialties including medicine, surgery, cardiology, paediatrics, orthopaedics and mental health.&lt;/p&gt;\n&lt;p&gt;You will act as an advocate for pharmacy and ensure the optimum use of medicines to ensure safe and effective patient care. You will become an integral part of the team and, with supervision from senior colleagues, contribute professionally to the various sections of the department and provide a clinical pharmacy service to our wards.&lt;/p&gt;\n&lt;p&gt;We have created a dedicated development pathway to support newly qualified and junior pharmacists to help develop your knowledge and skills and start to build your foundation portfolio. We are currently using the national Interim Foundation Pharmacist Programme (IFPP) scheme and the University of Bath and Reading postgraduate clinical diplomas to support pharmacists through the first few years of their careers. Throughout these programmes you will have a dedicated in house mentor or tutor to support you.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;Someone who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Is passionate about patient care&lt;/li&gt;\n&lt;li&gt;Is able to apply good clinical knowledge&lt;/li&gt;\n&lt;li&gt;Has strong communication skills&lt;/li&gt;\n&lt;li&gt;Has a good understanding of hospital pharmacy&lt;/li&gt;\n&lt;li&gt;Has good problem solving and prioritisation skills&lt;/li&gt;\n&lt;li&gt;Is adaptable and resilient&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Wednesday, 11 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Ross&lt;/p&gt;\n&lt;p&gt;Lead Pharmacist Operation and Supply Services&lt;/p&gt;\n&lt;p&gt;Jennifer.ross@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381203090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Pharmacist (General Rotation)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240942", "validThrough": "2020-11-06T23:59:59+0000"}