{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-02T08:17:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Support Worker (HCSW) Opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who, like us, believe our values Together – Safe Kind Excellent are at the heart of patient care, defining the way all staff work and behave.&lt;/p&gt;\n&lt;p&gt;Whether you are an experienced Healthcare Support Worker or just starting out in care, if you are caring, compassionate and looking for a new challenge, then we will have a role for you to take the next steps in your healthcare career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Can you/are you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wanting to develop clinical skills to deliver excellent patient care?&lt;/li&gt;\n&lt;li&gt;Motivated and committed?&lt;/li&gt;\n&lt;li&gt;Able to communicate well with other people?&lt;/li&gt;\n&lt;li&gt;Able to recognise when a person is anxious, frightened, or generally feeling unsure?&lt;/li&gt;\n&lt;li&gt;A team player?&lt;/li&gt;\n&lt;li&gt;Able to make a difference to someone’s day and leave them with a smile on their face?&lt;/li&gt;\n&lt;li&gt;Able to respect a person’s dignity at all times?&lt;/li&gt;\n&lt;li&gt;Able to work on an often challenging and busy clinical environment?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have opportunities for Healthcare Support Workers (HCSW) to join our teams across the Trust via a number of routes. You will work alongside friendly and experienced staff committed to delivering a high standard of care to patients and their families in a hospital that is recognised as providing &#39;outstanding&#39; care to our patients by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Healthcare Support Worker (HCSW) you will work under the guidance of a qualified healthcare professional, usually a Nurse or Midwife, to ensure safe, kind and compassionate care for patients.&lt;/p&gt;\n&lt;p&gt;We are looking for staff who will be available to work a variety of shifts covering a 24 hour period, to be able to support our patients when needed. You will work as part of a multidisciplinary team assisting with patient care and other departmental related duties.&lt;/p&gt;\n&lt;p&gt;CUH offers a comprehensive two week clinical support staff induction programme and support to achieve the National Care Certificate. This will equip you to find your feet within the organisation and quickly feel like a valued member of the clinical team/s.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Support Worker- Staff Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have fantastic opportunities for Bank Healthcare Support Workers (HCSW) to work flexibly across the Trust via our Staff Bank. You will work under the guidance of a qualified healthcare professional, usually a Nurse and alongside friendly and experienced staff committed to delivering a high standard of care to patients and their families in a hospital that is recognised as providing &#39;outstanding&#39; care to our patients by the Care Quality Commissioner. You will work as part of a multidisciplinary team assisting with patient care and other departmental-related duties.&lt;/p&gt;\n&lt;p&gt;Registering with the Staff Bank offers you an opportunity to maintain a work-life balance through working flexibly, experiencing various areas and specialties across the organisation, and also provides a route into permanent positions within the Trust. If you wish to register with the Staff Bank you must be turning 18 by the time you are ready to start.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Support Worker- Nursing Apprenticeship&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For those interested in further development we are able to offer the Nursing Apprenticeship route:&lt;/p&gt;\n&lt;p&gt;You will work as a HCSW for part of your contracted hours and receive paid study time to attend university. The university course fees are paid by CUH. You can earn, learn and be free from university debt. If you have your English &amp; Maths qualifications at GCSE grade 4-9/Functional skills level 2, you can be considered for these routes. If you do not have these we also provide additional support during your employment with us to access the required entry level qualifications.&lt;/p&gt;\n&lt;p&gt;All applicants interested in the Nursing Apprenticeship must be fully flexible to cover a variety of shifts including early, late, long days and nights – as our services operate 24 hours, 365 days a year.&lt;/p&gt;\n&lt;p&gt;Please see the attached document for any further information regarding both HCSW and Nursing Apprenticeship roles.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome applications from the Armed Forces.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRecruitment ServicesEmail addressrecruitment@addenbrookes.nhs.ukTelephone number01223217038Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HCSW opportunities:&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital- Division A/B/C/D/E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Healthcare Support Worker Opportunities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251329", "validThrough": "2020-11-08T23:59:59+0000"}