{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365"}}, "datePosted": "2020-11-04T11:01:32+0000", "description": "&lt;p&gt;Blenheim ward is a 29 bedded General medical ward which specialises in Renal (Acute, Chronic and Dialysis) patients. We work closely with a range of multidisciplinary teams and work as advocates to ensure our patients have the best plan of care to ensure they have a positive journey throughout their hospital stay. It is a demanding ward with acute patients, transferred from AMU/AECU/A&amp;E/HDU and ITU, but we work closely as a team and deal with the day to day pressures with positivity and high levels of energy.&lt;/p&gt;\n&lt;p&gt;The role:&lt;br /&gt;You will need to be a motivated team orientated professional with a passion for delivering high standards of nursing care in an ever changing environment and work within a multi professional team; it is essential you communicate effectively within this environment and act in line with the wards philosophy.&lt;br /&gt;&lt;br /&gt;The successful candidate will have previous experience in a Senior Staff Nurse post. You be will be required to manage the ward in the absence of the Ward Manager and be able to communicate effectively to all levels. Key elements include; strong professional leadership qualities, which is critical to delivering the high standard of care our trust requires, passion to be able to motivate and increase staff morale and ability to change so to manage and encourage a learning environment.&lt;br /&gt;&lt;br /&gt;Main responsibilities to include:&lt;br /&gt;• To monitor the practice and effectiveness of nursing actions, ensuring these are carried out with full regard for the safety of the patient and staff involved.&lt;br /&gt;• To ensure that delegation of tasks is performed equitably, effectively, in accordance with the nurse’s individual skills, development needs and within clear parameters of responsibility.&lt;br /&gt;• To ensure effective communication within the team and externally throughout the 24 hour period.&lt;br /&gt;• To ensure feedback mechanisms are in place, directing and encouraging as appropriate.&lt;br /&gt;• To provide specialist nursing advice or nursing practice within the ward/department, and provide advice to other wards/departments within the Trust.&lt;br /&gt;• To evaluate the effects of nursing actions and plan improvements for the benefit of the service.&lt;br /&gt;• To identify opportunities for improvement in services and where appropriate implement change process.&lt;br /&gt;&lt;br /&gt;There is one full time permanent position and one 1 year secondment position of 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKelly MooreJob titleMatronEmail addresskelly.moore@southend.nhs.ukTelephone number01702 435555 ext 6220Additional contact information&lt;/p&gt;\n&lt;p&gt;Kelly Moore&lt;/p&gt;\n&lt;p&gt;Medical Matron&lt;/p&gt;\n&lt;p&gt;01702 435555 ext 6220&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend Univeristy Hospital NHS Foundation Trust, Southend", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Deputy Ward Manager - Blenheim Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255504", "validThrough": "2020-11-18T23:59:59+0000"}