{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-28T15:48:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Programme Manager: Primary Care Network Development – 1 post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locality Development and Primary Care Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucestershire Clinical Commissioning Group (GCCG)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full Time, 37.5 per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Sanger House, Brockworth, Gloucestershire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to develop your career in a fast-paced environment, supporting the development of primary care in Gloucestershire as a Programme Manager in the Locality Development &amp; Primary Care Directorate. Our team are responsible for supporting our 72 GP practices to deliver innovative, high-quality care for their patient population. Individual practices and Primary Care Networks (PCNs) are the foundation on which the Gloucestershire ICS is based. Sustainable primary care and mature PCNs will be vital to the ICS priority to deliver Place based integrated care through our whole system Integrated Locality Partnerships (ILP) and achieve the local and national ambitions of the Long Term Plan including the PCN Directed Enhanced Service (DES) and related seven specifications.&lt;/p&gt;\n&lt;p&gt;This post is responsible for supporting the Head of Locality and Primary Care Development with the overall PCN programme, along with individual responsibility for particular projects and operational roles within the programme. A key focus will be the continued development and maturity of our PCNs, meeting the PCN DES specification requirements, maximising the benefits available to our patients and our PCNs across the various schemes and funding streams, as well as supporting strategy development and key urgent responses across the Directorate.The team is required to link in with many senior GP leaders, CCG and NHS England &amp; Improvement colleagues and across theGloucestershire Integrated Care System, therefore communication and engagement skills are essential for this post. In 2019 we refreshed our local Primary Care Strategy which underpins all the work the team undertake and is a prominent foundation of the implementation of the NHS Long Term plan within Gloucestershire.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who is highly motivated, organised, possesses good budgetary management, financial and Microsoft office skills, fantastic interpersonal skills and is well-versed in working to tight timescales. They must be able to work autonomously and be able to lead meetings with senior managers and Clinical Directors.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 18/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will take place: 30/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128636.png", "name": "Gloucestershire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucestershire", "postalCode": "GL3 4FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8485", "longitude": "-2.17476"}}, "title": "Programme Manager: Primary Care Network Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247266", "validThrough": "2020-11-18T23:59:59+0000"}