{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 + 5% HCA pro rata"}}, "datePosted": "2020-10-23T15:48:52+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 6 - Radiographer for Community based X-Ray Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our staff have gained an excellent reputation for providing high quality services. We are looking for the best staff to help us develop our services and modernise healthcare for our local community.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit enthusiastic band 6 radiographer. You will work in our busy x-ray departments where you will be working on your own with a receptionist.  We work closely with the Walk In Centre’s, Outpatients Department, Inpatients and GP’s. You will have to be self-motivated and able to work on your own initiative.The x-ray departments undertake approximately 25,000 examinations per year. We across Woking and Walton Community Hospitals in Northwest Surrey with Siemens Ysios DR systems.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have either a DCR or a BSc qualification and have extensive knowledge and experience of radiographic procedures. A high standard of radiographic technique is essential with a patient centered approach to your work.&lt;/p&gt;\n&lt;p&gt;We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent and caring service to our patients. If you want to be part of a friendly department with a patient centered focus, then please apply.&lt;/p&gt;\n&lt;p&gt;If you are interested in meeting the staff and seeing the departments, please contact Carol Marsden (carolmarsden@nhs.net) or the Woking x-ray department on 01483 846315&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walton Community Hospital", "postalCode": "KT12 3LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.38", "longitude": "-.406021"}}, "title": "Band 6 - Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241176", "validThrough": "2020-11-06T23:59:59+0000"}