{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T16:45:57+0000", "description": "&lt;p&gt;Research is a rewarding and patient centred career!&lt;/p&gt;\n&lt;p&gt;The research conducted at UHS is focussed on the health and well-being of our patients and their families and significantly contributes to the future progress of healthcare for all patients.&lt;/p&gt;\n&lt;p&gt;We can truly make a difference to an individual’s care and experience within UHS. We strive to ensure that research is considered as a treatment option for all eligible patients and close working with clinical teams and within patients’ clinical pathways ensure that research opportunities and our research teams are expanding.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;We have a team of around 300 Research Nurses, AHPs, Midwives and Clinical Trials Assistants, working together across the Trust, within our award winning teams to bring exciting research opportunities to UHS for the benefit of our patients and for the future of healthcare. The Research team is composed of multidisciplinary researchers from hospital and university backgrounds, working in collaboration with clinical services, aiming to deliver a variety of studies to improve patient care and outcomes.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a Band 6 nurse to develop their career in clinical research. This unique role will enable you to develop both your research and clinical skills in the context of the high profile and very successful research department at University Hospital Southampton.&lt;/p&gt;\n&lt;p&gt;You will work with the cancer team to deliver a wide variety of studies from observational designs to complex interventional and drug trials. You will have the opportunity to be involved in all stages of study delivery from set-up and planning, recruitment, intervention delivery and data collection.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic nurse who is organized, self-motivated, and can work autonomously and aspires to further their career in clinical research. This role is patient facing and you may be required to work in areas where covid 19 patients are being cared for. You will ideally have experience of clinical research or cancer care experience. Full research training will be given; we have an excellent induction and ongoing education programme. You will be involved in all aspects of the research process from study start-up, recruitment and delivery, to study close and will manage a small portfolio of studies. Team-working skills, flexibility and drive will be required to ensure the success of this post. You will need to have an excellent level of written and verbal communication skill. Good IT skills are essential. You will work in collaboration with multidisciplinary teams, implementing studies to translate scientific discoveries into improved patient outcomes.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;We are proud that every member of our team receives a detailed induction and training package specific to their needs, experience and job role. Our dedicated education team and supportive leadership structure (led by Head of Nursing/ Professions - Research and three Research Matrons working across all facilities), ensures that our staff have the skills and knowledge to care for their patients and undertake research to the highest standards. We are able to develop fantastic relationships with our patients and their families. We are in a very fortunate position to be able to build trust and to support our patients with excellent follow-up and continuity of care.&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;We undertake a wide ranging portfolio of research studies from highly complex interventional, novel therapy, first in human studies to long term observational studies mapping disease progressions or safety data on medicines and devices.&lt;/p&gt;\n&lt;p&gt;Research enables us to gather in-depth information and data about diseases and health conditions, treatments and care pathways so that we may continually advance and improve understanding, treatment and management of these aspects of healthcare and wellbeing.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held remotely on Friday, 04 December 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;Unfortunately at this time we unable to offer informal visits, but If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Lynne Dando&lt;br /&gt;&lt;br /&gt;Senior Research Sister&lt;br /&gt;&lt;br /&gt;Lynne.dando@uhs.nhs.uk&lt;br /&gt;&lt;br /&gt;02381205480&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Research Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250983", "validThrough": "2020-11-13T23:59:59+0000"}