{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Pro rata"}}, "datePosted": "2020-10-26T14:01:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Neurodevelopmental Service- Adults&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8a Clinical/Counselling Psychologist- Neurodevelopmental Service for CWPT (Autism &amp; ADHD)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge? Are you looking to further your development?&lt;/p&gt;\n&lt;p&gt;We are looking for a Clinical or Counselling Psychologist with a working knowledge of neurodevelopmental disorders to join our team. You will be welcomed into a supportive dynamic multi-disciplinary team working with adults with Neurodevelopmental Disorders including Autistic Spectrum Disorder/Conditions, ADHD, Sensory processing difficulties and Dyspraxia. Psychologists are highly valued and there is an emphasis on interdisciplinary and interagency working and a drive to provide a thorough assessment with focus on post-diagnostic support and intervention. There will also be opportunities to be involved in research and service development. &lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to become part of a wider All Age Neurodevelopmental Service which also includes pre-school and school age teams. The team frequently review their performance to ensure a good high quality service is offered to service users using evidence-based practice and following national guidance. This is an exciting opportunity for you to be part of this development process in a service which has been recognised as being &#39;good&#39; by the CQC and champions co-production.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Ideally, we are looking for a clinical or counselling psychologist with training and experience in assessment, diagnosis and interventions for individuals with neurodevelopmental disorders. To support you in your continued development a strong emphasis is placed on CPD and clinicians are encouraged to participate in case discussions. You will also receive clinical supervision from an experienced psychologist and be linked with the wider psychology team. Furthermore, the service has close links with several regional Clinical Psychology Training Courses and there will be opportunities for training student and/ or trainee psychologists.&lt;/p&gt;\n&lt;p&gt;As travel is an integral part of this post, car owner/driver, or suitable alternative transport to enable you to undertake the job is essential (It is unlikely that public transport will meet this requirement.)&lt;/p&gt;\n&lt;p&gt;This post is subject to a Criminal Records Bureau Disclosure at ‘Enhanced’ level.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gemma Cartwright - Service Manager&lt;/p&gt;\n&lt;p&gt;gemma.cartwright@covwarkpt.nhs.uk &amp; 07795266064&lt;/p&gt;\n&lt;p&gt;or Yve Griffin&lt;/p&gt;\n&lt;p&gt;Principal Psychologist&lt;/p&gt;\n&lt;p&gt;yve.griffin@covwarkpt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "paybody, coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Adult Neurodevelopment Applied Psychologist - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242827", "validThrough": "2020-11-09T23:59:59+0000"}