{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-02T12:30:25+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Adult Safeguarding administrator&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the adult safeguarding team at Warrington and Halton Hospitals NHS Foundation Trust. We are seeking a part time band 4 safeguarding administrator to join our team. This is a fixed term post to cover maternity leave. &lt;/p&gt;\n&lt;p&gt;WHH recognises the importance of safeguarding provision and has invested further resource in expanding the safeguarding adult team.  In joining the WHH safeguarding team, you will be part of a dynamic and motivated group of people who are enthusiastic and take pride in what they do.&lt;/p&gt;\n&lt;p&gt;You will be working across two sites and provide specialist support within the Trust in line with local and national safeguarding guidelines. The safeguarding portfolio includes Mental Capacity Act, Deprivation of Liberties (moving to Liberty Protection Safeguards) Learning Disabilities, Prevent, Mental Health Act and domestic abuse. &lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to adopt a flexible can do approach to managing their workload and will be required to be a good team player, with excellent communication skills  and experience of working with multi-agency partners. &lt;/p&gt;\n&lt;p&gt;You will be part of a team that supports serious adult reviews and safeguarding investigations, the successful candidate will contribute to the completion of audit and assurance reports and will be able to minute meetings at board and committee level.  The successful candidate will be able to work well as part of a busy team, supporting the roles of the Lead Nurse and specialist nurses. &lt;/p&gt;\n&lt;p&gt;The adult and children’s teams work very closely in supporting the trust in discharging its statutory safeguarding duties and is led by managers and the senior management team who are passionate about safeguarding. We offer excellent opportunities for personal and professional development and provide regular safeguarding supervision.&lt;/p&gt;\n&lt;p&gt;We welcome individuals who pay attention to detail are enthusiastic and motivated and passionate about their work. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Safeguarding Adults Administrator Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252038", "validThrough": "2020-11-16T23:59:59+0000"}