{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "AfC Band 6: £31,365 rising to £37,890 pro rata"}}, "datePosted": "2020-10-28T15:15:57+0000", "description": "&lt;p&gt;&lt;strong&gt;The Lifetime Service is looking to recruit an experienced nurse in this clinical specialty who is an enthusiastic hard working person with significant experience of working with children with disabilities to join a very friendly and supportive team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lifetime Service is a Community Nursing and Psychology Service for Children and young people with non-malignant, life limiting and life threatening conditions.&lt;/p&gt;\n&lt;p&gt;The service is based in Warmley and currently provides a service across 4 CCG areas, supporting children aged 0-18 and their families in, Bristol, South Gloucestershire, North Somerset (BNSSG) and Somerset (Mendip area). In addition, the service has a Continuing Care Team (CCT) which supports children at home with complex health needs and children who are technology dependent.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced and enthusiastic community children&#39;s nurse to work within the core nursing team in the Lifetime Service. The post holder will work across the Bristol, South Gloucestershire and North Somerset area. The successful candidate will be a registered children’s nurse with a special interest in gaining experience in working as a Community Children’s Nurse. They will also have excellent communication skills with an ability to work in multi-disciplinary environments.&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate an ability to work autonomously but will receive appropriate levels of supervision through the preceptorship programme within Lifetime and the support structures available to all Lifetime staff.&lt;/p&gt;\n&lt;p&gt;The Service and the post holder will be delivering holistic nursing care to enable children with non-malignant life threatening/ life limiting conditions to be cared for safely in the community across a variety of settings.&lt;/p&gt;\n&lt;p&gt;The role is based at Corum One, Corum Office Park, Crown Way, Warmley, BS30 8FJ.&lt;/p&gt;\n&lt;p&gt;It is a 30 hour post approximately 9am – 5pm. The post holder will spend time both within an office environment and travelling between service users and other services within Bristol, North Somerset and South Gloucestershire CCG areas. Full driving license is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Corum Office Park, Crown Way, Warmley, Bristol", "postalCode": "BS30 8FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4577", "longitude": "-2.47598"}}, "title": "Community Children&#39;s Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247157", "validThrough": "2020-11-08T23:59:59+0000"}