{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "AfC Band 8a"}}, "datePosted": "2020-11-06T12:24:41+0000", "description": "\n&lt;p&gt;Devon’s new Edge of Care Service aims to brings together a range of disciplines to work intensively and flexibly (including weekends and evenings) to provide timely and creative support to meet the complex needs of young people and their families and to prevent care being needed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you an experienced clinician looking for a new challenge and opportunity to join a new and innovative service at a time of exciting change within Devon Children’s Services?&lt;/li&gt;\n&lt;li&gt;Can you work with children, young people and their parents/carers, providing evidence based intervention in the community at times of crisis?&lt;/li&gt;\n&lt;li&gt;Are you experienced and skilled in working with adolescents who are at risk of entering the care of the local authority?&lt;/li&gt;\n&lt;li&gt;Would you like to be a part of a new and innovative service within Devon Children’s Services to better respond to the needs of adolescents in order to prevent the need to enter care?&lt;/li&gt;\n&lt;li&gt;Would you like to experience life in one of the UK’s most beautiful areas, with exciting cities, charming countryside and magnificent coastlines?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychologist x 2 – Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for applicants who can bring skills, experience and enthusiasm to meet the needs of children and young people with complex emotional and mental health needs in the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will join our new and innovative Edge of Care Service, which is part of Devon’s Children’s Services, at an exciting time of change. In this important role you will use your extensive skills and experience as a mental health practitioner to deliver high quality care, developing and sustaining relationships across agencies and working as a core member of a multi-disciplinary team. Using both evidenced based practice and routine outcome measures, you will use a strength-based approach to work collaboratively with young people and families, in line with Devon Children’s Services key principles.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;Children in Care Council, 2016&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; “We need workers who think about how they treat us. This means&lt;/p&gt;\n&lt;p&gt;workers who treat us fairly and who show us they care. We don’t want&lt;/p&gt;\n&lt;p&gt;to be labelled and we should be treated like normal people; don’t look&lt;/p&gt;\n&lt;p&gt;down on us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Workers need excellent communication skills, this includes listening skills.  Our workers need to be able to listen to our views, ask how and what we are feeling and make sure they understand what we are saying by checking back with us. We expect our workers to demonstrate that they respect us and our experience in real ways by not taking phone calls during meetings, and by writing down what we say and talking in short simple language.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Finally, we expect our workers to work hard for us. This means doing what they say they will do, sticking to promises and not making excuses. We expect our workers to respond promptly to us and provide up to date contact details, especially for ‘out of hours’. It is important that workers build good relationships with us and are flexible and willing to change their view and always do what is best for us.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychologist – &lt;/strong&gt;You will be an experienced psychologist with post-graduate doctoral level training in Clinical Psychology with professional registration with Health Care Professions Council. You will be experienced in working with children, young people and their parents and carers and have direct experience of working with adults and children with trauma histories, attachment insecurity and emotional/ behavioural difficulties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be able to work alongside colleagues in a multi-disciplinary team and develop relationships across agencies to meet the needs of children and families. The ability to adapt communication and intervention style to meet individual need is important and you will have knowledge of child development and child protection procedures. Experience in working with adolescents and their families would be desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Managing risk and being able to assess mental health presentations in the community is a core part of this role, responding to both urgent and routine, planned and unplanned need. You will be required to work flexibly across a range of clinical, community and home-based settings to meet the needs of the child, which could include working across evenings and weekends and contributing to our Out of Hours Rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be responsible for providing therapeutic intervention that is strengths-focused, evidence-based and tailored to meet the needs of the child/young person and their family/carer. Supervision of more junior staff and trainees is expected to be part of your role as you share your skills and knowledge with those around you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Personally, we’re looking for an individual who is passionate about working with children/ young people in the community with the confidence to intervene to meet a range of mental health needs and a desire to work with others to continually improve what we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date is to be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Devon provides a unique, varied and beautiful environment. The coastal areas of North and South Devon and Torbay provide excellent opportunities for water sports. The National Parks, Dartmoor and Exmoor, are havens for country lovers. Exeter is a thriving University City offering culture and city life. There are excellent rail, road and air connections, with a regional airport in Exeter.&lt;/p&gt;\n\n&lt;p&gt;We are committed to safeguarding and promoting the welfare of children and vulnerable adults, and expect all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;This role requires a DBS disclosure.&lt;/p&gt;\n&lt;p&gt;This role requires the ability to fulfil all spoken aspects of the role with confidence and fluency in English.&lt;/p&gt;\n&lt;p&gt;Personal data we collect from you will be processed in accordance with the Applicant privacy notice.&lt;/p&gt;\n&lt;p&gt;For more information about Working for Devon please visit our Working for Devon page.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Devon County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Devon", "postalCode": "EX2 4QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7145", "longitude": "-3.5175"}}, "title": "Clinical Psychologists (2 posts)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259638", "validThrough": "2020-11-26T23:59:59+0000"}