{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T14:46:55+0000", "description": "&lt;p&gt;&lt;strong&gt;This post is for internal candidates to South Tees Trust only.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a B5 Admin Manager to join the Healthcare Records team at James Cook University Hospital.&lt;/p&gt;\n&lt;p&gt;The post holder will be working under the guidance of the Deputy Healthcare Records Manager and will take responsibility for designated elements of the Healthcare Records service.&lt;/p&gt;\n&lt;p&gt;The postholder will be required to manage a team of two team leaders and a circa 30 members of staff, and will be responsible for the coordination of duties across the teams. The postholder will be required to demonstrate excellent communication, organisational and supervisory skills, and be able to work as an effective member of a multidisciplinary team. They will be responsible for ensuring their teams deliver an effective and efficient service to service users including, clinicians, nurses and other key staff groups.&lt;/p&gt;\n&lt;p&gt;Applications are invited from people who are keen to develop into a second line management role and who have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An NVQ3 in Business and Administration, equivalent level qualification or equivalent level of administrative experience &lt;strong&gt;Plus&lt;/strong&gt; working knowledge of the functionality of Patient Administration Systems&lt;/li&gt;\n&lt;li&gt;Extensive use of Office and Outlook, including but not limited to word, excel and powerpoint, e-mail and internet&lt;/li&gt;\n&lt;li&gt;Knowledge of General Data Protection Regulations and patient confidentiality&lt;/li&gt;\n&lt;li&gt;Previous supervisory/management experience&lt;/li&gt;\n&lt;li&gt;Previous experience of working in a Healthcare Records Department (desirable but not essential)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison Hebden-BurkeAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you would like further information please contact: Alison Hebden-Burke, Deputy Healthcare Records Manager, Ext 53177 or Emma Dodsworth, Health Records Manager, Ext 54789&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Admin Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250652", "validThrough": "2020-11-06T23:59:59+0000"}