{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20903", "minValue": "19312", "unitText": "YEAR", "value": "£19,312 - £20,903"}}, "datePosted": "2020-11-04T09:57:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Care Worker (Multiple positions)&lt;br /&gt;&lt;strong&gt;Location: &lt;/strong&gt;Nevetts, Bowling Green Lane, Buntingford, Hertfordshire, SG9 9DF&lt;br /&gt;&lt;strong&gt;Salary Range: &lt;/strong&gt;£19,312-£20,903  depending on experience plus Market Forces Payment £1300 pro rata (non contractual)* subject to criteria&lt;br /&gt;&lt;strong&gt;Hours:&lt;/strong&gt; Full Time, Part Time and flexible hours available&lt;br /&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Initial 6 month Fixed Term contract or secondment&lt;/p&gt;\n&lt;p&gt;DOES A 2 DAY WEEK FOLLOWED BY A 3 DAY WEEK SOUND GOOD TO YOU? WORK YOUR FULL-TIME HOURS IN ONLY 5 LONG DAYS OVER THE COURSE OF A FORTNIGHT.&lt;/p&gt;\n&lt;p&gt;Nevetts care home was recently re-opened as a response to Covid-19 to help ease pressure on local NHS hospitals. On a typical day, we care for people that have tested positive for Covid-19, who are ready to leave hospital but not quite ready to return home. Every effort will be put in place to safeguard both staff and residents during this difficult time.  In return, we’ll give you all the training, support and development opportunities you need to make the most of this rewarding role and achieve your individual career goals, through our industry leading training and employee welfare programmes.&lt;/p&gt;\n&lt;p&gt;Nearest Bus Stop: Edwinstree C of E Middle School&lt;/p&gt;\n&lt;p&gt;- THIS POSITION WILL INCLUDE WEEKEND WORKING AND SHIFT WORK PATTERNS –&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the job:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide the care detailed in the residents individualised care plan using a person-centred approach&lt;/li&gt;\n&lt;li&gt;Supporting residents with all aspects of personal care whilst maintaining and promoting independence and ensuring privacy and respect.&lt;/li&gt;\n&lt;li&gt;To ensure that residents are dressed appropriately and in possession of their individual aids, i.e. dentures, hearing aids, walking frames etc.&lt;/li&gt;\n&lt;li&gt;Support and assist residents with their meals as required in a dignified and respectful manner ensuring that a pleasant and calm atmosphere is maintained.&lt;/li&gt;\n&lt;li&gt;To identify and meet the social, emotional and cultural needs of residents and participate in the organisation for social and recreational activities.&lt;/li&gt;\n&lt;li&gt;To undertake the role of the keyworker in relation to each individual care homes guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About you:  &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to reflect on your own experiences and practice to build professional relationships with service users, family carers and other agencies in order to understand the needs and rights of disabled adults.&lt;/li&gt;\n&lt;li&gt;Confident in the use of a computer to organise and record information clearly and accurately.&lt;/li&gt;\n&lt;li&gt;Always aware of risks and how they can be minimised ensuring the health and safety of colleagues and the people you support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A varied and stimulating range of work and the opportunity to join a highly regarded team committed to continuously improving and delivering exciting innovative opportunities.&lt;/li&gt;\n&lt;li&gt;We are committed to developing and offering ongoing support, including the opportunity to work towards your RQF qualifications.&lt;/li&gt;\n&lt;li&gt;Herts Rewards – giving you great shopping discounts and local offers (e.g. Asda, Sainsburys, New Look, M&amp;S).&lt;/li&gt;\n&lt;li&gt;Incredibly generous Local Government Pension Scheme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;To apply for this position please upload you most recent CV or feel free to call and discuss your suitability on 01438 844 435.&lt;/p&gt;\n&lt;p&gt;*This is a rolling advert and candidates will be contacted as and when they apply*&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Additional Information&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you:&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A varied and stimulating range of work and the opportunity to join a highly regarded team committed to continuously improving and delivering exciting innovative opportunities.&lt;/li&gt;\n&lt;li&gt;We are committed to developing and offering ongoing support, including the opportunity to work towards your RQF qualifications.&lt;/li&gt;\n&lt;li&gt;Herts Rewards – giving you great shopping discounts and local offers (e.g. Asda, Sainsburys, New Look, M&amp;S).&lt;/li&gt;\n&lt;li&gt;Salary Exchange for Additional Benefits&lt;/li&gt;\n&lt;li&gt;Excellent Pension Scheme with Employer Contributions&lt;/li&gt;\n&lt;li&gt;Support Groups &amp; Wellbeing Schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Safeguarding:&lt;/strong&gt;Safeguarding children and adults is of utmost importance to Hertfordshire County Council. The Council requires employees to abide by legislation and best practice to enable Hertfordshire to achieve this. This role has been identified as requiring a Disclosure &amp; Barring Service (DBS) check. For more information Click Here&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;English Fluency: &lt;/strong&gt;The ability to converse at ease with members of the public and provide advice in accurate spoken English is essential for the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disability Confident: &lt;/strong&gt;We are proud to be a Disability Confident employer and guarantee an interview to anyone disclosing a disability whose application meets the minimum criteria for the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Diversity:&lt;/strong&gt; We are an inclusive employer and value a diverse workforce&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Application Information&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Should you be successful after application:&lt;/strong&gt;&lt;br /&gt;You will be contacted for an interview Via Microsoft Teams&lt;br /&gt;You will need to give your availability and any locations you are able to cover&lt;br /&gt;You will need to send your ID documents prior to your interview&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Appointment Info:&lt;/strong&gt;&lt;br /&gt;We will be ‘fast tracking’ your appointment should you be successful&lt;br /&gt;Please ensure you check your emails (including junk/spam accounts) regularly and action any requests sent to you to enable us to pay you and ensure you are compliant&lt;br /&gt;All necessary training and personal protective equipment needed to conduct the role will be provided FOC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term and/or Secondment:&lt;/strong&gt;This is a Fixed Term or Secondment vacancy. If you work for HCC or any other Local Authority and would like to be considered as a Secondment contract, please ensure you complete the attached Secondment Form as part of your application. If you do not, your application will be considered as a Fixed Term Contract only.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Buntingford", "postalCode": "SG13 8DQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7914", "longitude": "-.081069"}}, "title": "Care Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255267", "validThrough": "2020-11-22T23:59:59+0000"}