{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-05T19:05:45+0000", "description": "&lt;p&gt;Doctors Direct are part of NHS Professionals and owned by the Department of Health and Social Care, which means that we are part of the NHS family and sets us apart from locum agencies. Saving money and providing only the highest quality locum cover to our partner Trusts is at the very heart of what we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Senior House Officer to work with us at&lt;/strong&gt; &lt;strong&gt;Salford Royal NHS Foundation Trust in General Medicine. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dedicated doctor ready to work at a hospital dedicated to the provision of pioneering treatments and services in Greater Manchester and beyond. The Trust operates in hospitals and clinics across the region, although its main site is Salford Royal Hospital (located just a few miles from the centres of Manchester and Salford). This role would be predominantly based at &lt;strong&gt;Salford Royal&lt;/strong&gt; with the opportunity to work extra shifts across the Trusts’ other sites and any of our partner Trusts.&lt;/p&gt;\n&lt;p&gt;Salford Royal NHS Foundation Trust is nationally recognised for its specialist care – people come from all over the UK for expert help with brain, kidney, bone, intestine or skin conditions. The safe, clean and personal care patients receive at Salford Royal NHS Foundation Trust has earned it consistently high ratings for quality service, as well as patient and staff satisfaction. But it’s always looking to expand and improve. As announced in January 2018, the Trust is currently building a £48 million major trauma centre. Its ambition is that 90% of all major trauma patients in the Greater Manchester area will be treated there once it’s completed in 2020.  &lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors Direct recruit to the highest of NHS standards and all applicants for this role should meet pre-screening requirements before applying.&lt;/p&gt;\n&lt;p&gt; Full GMC licence to practice&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum of 6 months experience in and NHS Trust within the last 2 years&lt;/li&gt;\n&lt;li&gt;Including on-calls&lt;/li&gt;\n&lt;li&gt;Immediate start for up to 3 months&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Choose Doctors Direct?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors Direct are part of the NHS and do not charge our partner Trusts the expensive fees associated with private locum agencies. That means every shift worked by one of our members helps save money for the Trust and the wider NHS. These vital saving can then be reinvested into what matters most, patient care and safety.&lt;/p&gt;\n&lt;p&gt;Not only do members of Doctors Direct help save money for the NHS, they receive fantastic benefits including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;li&gt;A dedicated account manager&lt;/li&gt;\n&lt;li&gt;Flexibility of work, with shifts that suit you&lt;/li&gt;\n&lt;li&gt;Book and review shifts online&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;Want to know more?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Find out more about how working locum shifts through Doctors Direct can work for you or visit our onsite teams. Find your nearest Trust here.&lt;/p&gt;\n&lt;p&gt;We have exciting career opportunities available for doctors across many grades and specialties. Once registered, you will be able to view and work in your chosen specialty and grade at any of our partner Trusts across England. If you would like to discuss career opportunities further, call us on 03330 143 652 or email doctors@nhsprofessionals.nhs.uk where our dedicated team can help you find your next opportunity.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121068.JPG", "name": "NHS Professionals - Doctors", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121068"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Senior House Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258786", "validThrough": "2020-11-30T23:59:59+0000"}