{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-26T14:31:08+0000", "description": "&lt;p&gt;The Estates Management Team of 40 directly employed staff forms part of the Estates and Facilities Directorate within Nottinghamshire Healthcare NHS Foundation Trust. The Team provides planned/reactive maintenance and emergency services 24/7, 365 days a year to 96 buildings across Nottinghamshire, Leicestershire, and Derbyshire&lt;em&gt;, &lt;/em&gt;and for any other sites that Nottinghamshire Healthcare NHS Foundation Trust cover under contracts.&lt;/p&gt;\n&lt;p&gt;Utilising mobile multi-skilled craftworkers, technicians and specialists across all building disciplines, we ensure that the Trust&#39;s buildings are fit for purpose and compliant with current legislation, this is achieved by assigning jobs via the Facilities Help Desk to our staff out in the field onto their iPad minis.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for Maintenance Assistant to join our Estates Maintenance Team. Operating as a mobile Maintenance Assistant across all trade disciplines, you will receive your work on a handheld device from the Estates and Facilities Help Desk. You will be expected to arrange your daily workload ensuring you complete the tasks in the given priority. You will be expected to provide planned preventative building and engineering maintenance such as the testing of fire alarms, emergency lighting, testing of water temperatures and the inspection of water tanks, drainage systems and portable appliance testing.&lt;/p&gt;\n&lt;p&gt;In addition to the planned preventative maintenance, you will be required to carry out reactive repairs across all building disciplines such as unblocking sinks, drains, toilets, patch plastering, gutter cleaning, tile repairs and lamp replacement working within your competencies.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals who are seeking a stimulating and challenging role who can function under pressure in a multitasking/multi-skilling environment. Applicants should ideally have previous experience of building services maintenance and should be able to work on own initiative with minimum supervision, be self-motivated and have the ability to work as part of a team.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE: Previous applicants need not apply&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard BriggsJob titleEstates OfficerTelephone number07814281462&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan Macmillan House, Nottinghamshire", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Maintenance Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242908", "validThrough": "2020-11-08T23:59:59+0000"}