{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-11-03T14:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Occupational Therapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wimbledon Recovery and Support Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to offer these excellent opportunities for experienced OTs to come and work with our highly regarded Wimbledon Recovery and Support Team. We provide a service to adults with the age 18 – 65 years with complex health and social care needs, using the Recovery model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a registered Occupational Therapist with a minimum of two years post registration experience, including experience in a community mental health setting, The candidate will be someone with a range of clinical skills and abilities in assessment, crisis intervention and care coordination.&lt;/p&gt;\n&lt;p&gt;The role involves the management of a caseload of patients diagnosed with a range of severe and enduring mental illness, providing care planning, recovery goal setting, regular CPA review, planning for various health and social care needs. You would also be expected to participate in the team’s Duty rota.&lt;/p&gt;\n&lt;p&gt;You will be committed to working creatively to provide a community service for people experiencing mental health problems. You will be well organized, able to work autonomously, have excellent communication skills, both written and oral, and be a team player.&lt;br /&gt;&lt;br /&gt;We offer a supportive working environment, with a visible and accessible management team. Supervision is prioritized and we have a demonstrable commitment to staff training and development.&lt;/p&gt;\n&lt;p&gt;We are committed to delivering exemplary service and have a strong culture of training and education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Wilson hospital can be accessed easily by bus, or by train with the closest station Mitcham Junction. The Wilson hospital also has ample space for car parking.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joyce Badmus&lt;/p&gt;\n&lt;p&gt;Email address joyce.badmus@swlstg-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 668 3154&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wilson Hospital, Mitcham", "postalCode": "CR4 4LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3985", "longitude": "-.164079"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254246", "validThrough": "2020-11-10T23:59:59+0000"}