{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T13:52:17+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for a suitably experienced Physiotherapist with excellent skills in neuro-assessment and rehabilitation to join the multi-award winning Stroke &amp; Neuro-Rehabilitation Team in North Devon on a 12 month fixed- term basis to cover maternity leave.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work within the broader Neuro-Outpatient Service alongside the Occupational Therapists, Physiotherapists, neuropsychologist, consultant neurologists and Specialist Nurses, and out-reaching to the community rehabilitation teams to support the management of patients with long-term neurological conditions. They will be involved in developing services and pathways for patients with neurological conditions.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work as part of a dynamic and supportive interdisciplinary team, that is committed to delivering high quality, person-centred, seamless pathways of care, through collaborative working with acute, community, social and third sector services. The team has a positive profile within the Trust and with service users, and the successful candidate will contribute to the continued development of the service and the team with the support of the Service Lead. In return you can expect to be supported in your professional development to enhance skills appropriate to the needs of the service and client group.&lt;/p&gt;\n&lt;p&gt;Applicants should be flexible, highly motivated and committed towards team working, with excellent communication, problem-solving and organisational skills. You will have proven experience and skills in stroke/neuro-rehabilitation, leadership and supervision.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Emma Cork, Service Lead (emma.cork@nhs.net/01271 322375).&lt;/p&gt;\n&lt;p&gt;For further information, please contact Catherine Sandbach (Service Lead): catherine.sandbach@nhs.net.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date 30/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**As this post is in a shortage occupation code it qualifies for the Trust’s Recommend a Friend Scheme, please find further information on the attached link**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 1GY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0838", "longitude": "-4.06196"}}, "title": "Advanced Practitioner Physiotherapy (Neuro-Outpatients)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254202", "validThrough": "2020-11-30T23:59:59+0000"}