{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-10-23T11:13:04+0100", "description": "&lt;p&gt;Are you committed to protecting children, young people and adults at risk, from harm or abuse? Dorset CCG are looking for a Deputy Head of Safeguarding with passion, drive and enthusiasm to join the CCG Safeguarding team to lead and develop safeguarding systems and to work in partnership with provider systems, the local authorities and police.&lt;/p&gt;\n&lt;p&gt;The role of the Deputy Head of Safeguarding is to provide support to the Head of Safeguarding, they will require significant safeguarding experience from any of the recognised fields in safeguarding (Health, Local Authority,Police). They will have experience and expertise to quality assure, monitor and innovate safeguarding practices through ithe identification of creative opportunities and strategies.&lt;/p&gt;\n&lt;p&gt;You will join our ambitious team within the Quality Directorate which is committed to improving health outcomes and safeguarding our children and adults within Dorset. You will be based in Dorchester, need to be prepared to work virtually and travel across the county and at times regionally when required. This is a full time permanent post, if you would like further information please email Liz Plastow Head of Safeguarding liz.plastow@dorsetccg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vespasian House", "postalCode": "DT1 1TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Deputy Head of Safeguarding", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240244", "validThrough": "2020-11-08T23:59:59+0000"}