{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-10-28T14:15:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Ward Clerk – Band 2 – Ward F7 – 20 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;F7 was a Short stay Unit and is currently a Covid 19 ward providing acute care to patients who have or are suspected of having Covid 19. We are able to offer our patients Non-Invasive Ventilation, for example CPAP.&lt;/p&gt;\n&lt;p&gt;Our team needs a highly motivated team member to join us as a Ward Clerk. &lt;/p&gt;\n&lt;p&gt;The successful candidate will have responsibility for administrative duties within the ward. The successful candidate will maintain responsibility for ensuring an optimum level of efficient administrative support to the nursing and medical staff in a timely and accurate manner. &lt;/p&gt;\n&lt;p&gt;The right candidate will have excellent interpersonal skills and be experienced in working with the public, as you will be communicating with; patients, relatives, carers and all levels of staff from varying disciplines, providing front of house services for the ward.  Experience of working within a healthcare environment is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;This role is essential for the efficient running of the ward from an administration and patient flow perspective.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further enquiries please contact Claire Starie, F7 Ward Manager on 01284 712681 or via the email attached.&lt;/strong&gt;”&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site.  The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital.  Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply.  Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to   complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Ward Clerk - Band 2 - Ward F7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246922", "validThrough": "2020-11-11T23:59:59+0000"}