{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19638", "minValue": "18333", "unitText": "YEAR", "value": "£18,333 to £19,638 pa"}}, "datePosted": "2020-10-29T16:00:49+0000", "description": "&lt;p&gt;Gloucestershire Managed Service (GMS) is a newly established private company, wholly owned by Gloucestershire Hospitals NHS Foundation Trust, which provides the Trust with estates, facilities, sterile services and materials management services for the Trust.&lt;/p&gt;\n&lt;p&gt;We provide services such as clinical equipment management, provision of facilities services such as catering, domestics, portering and linen, manage the construction and development of new and existing healthcare buildings and manage the building, engineering and grounds services.&lt;/p&gt;\n&lt;p&gt;GMS aims to provide a best value customer service which ensures a safe, compliant and sustainable environment, and that supports our customers to be efficient and effective in patient care&lt;/p&gt;\n&lt;p&gt;It employs around 900 staff and has the potential to increase the range of services that it provides to the Trust and other organisations. We are a new and ambitious company aiming to continue providing an excellent service, improving the wellbeing of everyone we serve through supporting and delivering services that match the best in the world.&lt;/p&gt;\n&lt;p&gt;GMS values and respects the diversity of its employees, and aims to recruit a workforce which reflects our diverse communities.&lt;/p&gt;\n&lt;p&gt;A great opportunity has arisen to join a dedicated workforce of around 100 staff in our professional teams at Gloucestershire Royal and Cheltenham General Hospitals. The role of the Catering Assistant is to provide patients, staff and visitors an efficient food and beverage service in a warm and courteous manner.&lt;/p&gt;\n&lt;p&gt;We want people who are passionate about food and as equally passionate about delivering excellent customer service.&lt;/p&gt;\n&lt;p&gt;It is essential for staff to be able to work well as part of a team and have good communication skills. Basic numeracy and IT skills are also required. Previous experience of working in a catering or retail environment would be advantageous, but not essential. All new staff will receive comprehensive in-house training.&lt;/p&gt;\n&lt;p&gt;Working Monday to Sunday as part of our bank team on a zero hours contract. Majority of shifts will be between 12.00-20.00&lt;/p&gt;\n&lt;p&gt;Salary Range £18,333 – 19,638&lt;/p&gt;\n&lt;p&gt;If you require any more information about the post, please contact Mark Lane, Site Catering Manager, by email mark.lane5@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Gloucestershire Managed Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135114"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8664", "longitude": "-2.23104"}}, "title": "Bank Catering Assistant (GMS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248976", "validThrough": "2020-11-16T23:59:59+0000"}