{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38390", "unitText": "YEAR", "value": "£38,390 - £44,503 pa"}}, "datePosted": "2020-10-27T14:45:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Financial Accountant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary:             Band 7 £38,890 - £44,50 per annum&lt;/p&gt;\n&lt;p&gt;Hours:             37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Base:               The National Academy, DY5 1LQ&lt;/p&gt;\n&lt;p&gt;West Midlands Ambulance Service University NHS Foundation Trust is looking to recruit a Senior Financial Accountant who will provide a professional accounting service to the Trust and support the Chief Financial Accountant in relation to all Financial Accounting issues, including the preparation of annual statutory accounts and detailed working papers. The post holder will be responsible for maintaining and developing financial systems and ensuring that regular controls are monitored and applied to all financial transactions. Deputise for the Chief Financial Accountant in the running of the financial services and accounts sections.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be CCAB fully qualified and have a minimum of 3 years’ accounting experience as well as previous NHS experience, including working within both financial and management accounting setting.&lt;/p&gt;\n&lt;p&gt;West Midlands Ambulance Service positively welcomes diversity and aims to be a truly inclusive place to work. We are looking for self-motivated, enthusiastic people from all backgrounds that care about making a difference.&lt;/p&gt;\n&lt;p&gt;We also support the ‘Disability Confident’ scheme and therefore guarantee to invite to assessment all applicants with a disability who meet the standards required for a job vacancy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Please ensure you check your NHS Jobs account regularly as this is how we will communicate with you.&lt;/li&gt;\n&lt;li&gt;Do not delete the job from your account until you are certain you have not been shortlisted as this will prevent you from accessing any messages or important documents you may need to download.&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are fully completed. Paying particular attention to referees details including their email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;If you are unable to apply online, please contact the Recruitment Team on 01384 215896 for a paper application form&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE READ THE ATTACHED DOCUMENT ENTITLED INFORMATION AND GUIDANCE FOR APPLICANTS. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;                                                                                                         &lt;/p&gt;\n&lt;p&gt;Closing date for return of applications: &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Monday 9th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note: Only fully completed application forms will be accepted&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Midlands Ambulance Service University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dudley", "postalCode": "DY5 1LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4854", "longitude": "-2.12026"}}, "title": "Senior Financial Accountant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245012", "validThrough": "2020-11-09T23:59:59+0000"}