{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc"}}, "datePosted": "2020-11-05T11:46:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 8a Clinical Lead Dietitian&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 WTE, 37.5 hours/wk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newham University Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced dietitian to lead our adult dietetic service at Newham University Hospital. Newham University Hospital, based east of the City of London is part of Barts Health NHS Trust and serves a diverse, multicultural community. If you are an HCPC registered Dietitian with extensive NHS clinical experience, looking for an opportunity to develop your leadership skills within a friendly and supportive team, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;This post offers a unique challenge for a highly motivated and experienced expert dietitian with proven line management experience, excellent communication skills and passion to support innovative service development at our hospital. This is a leadership role with operational responsibility over the adult inpatient and outpatient dietetic service at Newham University Hospital. Inpatient Specialities include: general medical, surgical, gastroenterology, older peoples services, stroke and ICU. The outpatient service receives referrals from both primary and secondary care and the clinical specialities covered include Diabetes (Type1 including insulin pump therapy, Type 2, ante natal diabetes/GDM), obesity, PCOS, Gastroenterology (IBD, IBS &amp; FODMAPs, Coeliac disease), cardiac patients, nutrition support and home enteral feeding patients.&lt;/p&gt;\n&lt;p&gt;Applicants should have experience working in an acute hospital environment and it is also desirable that applicants have experience of outpatient and/or community service provision.&lt;/p&gt;\n&lt;p&gt;As clinical lead, your job plan will include approximately 0.5WTE clinical caseload. This will be based around the successful applicant’s clinical expertise and will involve both outpatient and inpatient work.&lt;/p&gt;\n&lt;p&gt;The clinical lead role is supported by the Head of Therapy on site and via peer support from the network of Clinical Lead dietitians across Barts Health whom you will work closely with. You will have access to training and development opportunities from both a clinical and management perspective.&lt;/p&gt;\n&lt;p&gt;Our Adult Dietetic team at Newham is dynamic and proficient; offering expert care to our patients and dedication to the profession.&lt;/p&gt;\n&lt;p&gt;If you have any questions or are interested in applying and would like to discuss further please contact Tara Hughes, Deputy Head of Therapies, Newham University Hospital, via email tara.hughes4@nhs.net or 02073638585 (direct dial)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham University Hospital, London", "postalCode": "E13 8SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": ".035418"}}, "title": "Clinical Lead Dietitian (Adult Service)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257498", "validThrough": "2020-11-19T23:59:59+0000"}