{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 pa"}}, "datePosted": "2020-10-27T12:31:55+0000", "description": "&lt;p&gt;Do you want the privilege of caring for patients in their own homes to deliver increasingly complex, holistic care? If yes, community nursing may be the right career choice for you. We are able to offer part-time or full-time roles along with a full skills development and preceptorship programme.&lt;/p&gt;\n&lt;p&gt;All levels of experience are welcome in community nursing. Whether you are newly qualified or looking for a change in direction, we would welcome your application for this exciting opportunity to join the community nursing workforce. As a community nurse, you would be supported to develop into an autonomous practitioner; nursing patients with multiple complex health care needs in their own home.&lt;/p&gt;\n&lt;p&gt;Community nursing is a specialised area of practice. As a Community Staff Nurse, you will work within a locality team of District Nurse Team Leaders, Community Staff Nurses, Therapists, Assistant Practitioners and Healthcare Assistants, to meet the needs of the complex patient in the community and avoid admissions to acute settings. This includes medication administration, end of life care, managing the deteriorating patient, complex and simple wound care including negative pressure wound therapy and compression therapy, venepuncture, utilising advanced assessment skills and clinical nursing skills. We nurse people with a variety of conditions in a holistic manner in their own home and in residential care settings. Community nurses work in close partnership with social care and other primary health care professionals such as GP’s, Community Therapies and specialised services such as Tissue Viability, Diabetes and Heart Failure.&lt;/p&gt;\n&lt;p&gt;What will we give you? Once in post you will be on the road to develop and enhance your clinical skills. We offer each individual an induction in your team with a period of being supernumerary, which is usually up to 4 weeks. We will ensure you can attend the Trust induction programme; this encompasses all facets of Buckinghamshire Healthcare NHS Trust Health and the lived experience of what you will do, giving you an insight into the organisation.&lt;/p&gt;\n&lt;p&gt;At Buckinghamshire Healthcare we pride ourselves in supporting and developing our staff to achieve their potential and excel in their career.&lt;/p&gt;\n&lt;p&gt;For further information or informal visits please contact: Amanda Woods or Craig Larkin on: 01844 210868&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Woods/Craig Larkin Advanced Case Practitioner 01844210868&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thame Community, Thame", "postalCode": "OX9 3JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7452", "longitude": "-.972668"}}, "title": "Community Staff Nurse - Thame", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244515", "validThrough": "2020-11-10T23:59:59+0000"}