{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T08:16:21+0000", "description": "&lt;p&gt;CONSULTANT PSYCHIATRIST&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; GENERAL ADULT – &lt;/strong&gt;Inpatient Mary Seacole House 2&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt; FULL TIME 10 PAS • £82,096 - £110,683 PA (DEPENDENT&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; ON EXPERIENCE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the opportunity to work within the newly re-designed Crisis Resolution-Home Treatment Team/Acute Inpatient Service in Birmingham. The post holder will provide consultant leadership input to Mary Seacole Ward 2, which is a 14 bedded male unit. The post holder will also participate on the community urgent assessment rota; this will be up to a maximum of 2 sessions per week and will be mutually agreed through the job planning process.&lt;/p&gt;\n&lt;p&gt;You must be comfortable working as a member of a multidisciplinary team, be flexible in your approach to change and be able to exercise leadership in order to provide a comprehensive and accessible service to individuals in the acute phase of mental illness. We are seeking applicants with the enthusiasm necessary to serve the needs of a city enriched by cultural diversity.&lt;/p&gt;\n&lt;p&gt;The post is subject to the annual job planning process as agreed under the consultant contract. You will participate in an (approximately) 1 in 25 on call rota and you will be supported by an experienced multidisciplinary team, medical staff and secretary. The Trust is committed to continuing professional development and you will be encouraged to develop special interests, undertake research activities and forge links with appropriate academic centres. There is an active teaching programme within the Trust.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the GMC, MRCPsych or equivalent.&lt;/p&gt;\n&lt;p&gt;Section 12 (2) approval, approved clinician status and CCT accreditation in General Adult Psychiatry or within 6 months of obtaining CCT, with experience in Acute Psychiatry are essential.&lt;/p&gt;\n&lt;p&gt;If you enjoy being part of a team, are flexible, approachable and are looking for a stimulating role in mental health, we would be delighted to hear from you.&lt;/p&gt;\n&lt;p&gt;Please see the generic job description and individual job profiles for further details. For any enquiries please ring Kerry Webb, Clinical Director, on 0121 301 2318 or Dr Giles Berrisford, Deputy Medical Director, on 0121 301 2180 or contact Leonora Johnson, Medical Staffing Manager on 0121 301 1245&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kerry Webb Job title Clinical DirectorTelephone number 0121 301 2318 Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to COVID we are happy to facilitate any MS Teams calls to discuss further and could arrange a virtual visit if required with the Team Manager&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal inquiries are welcome as are those looking for flexible working or blended job plans&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mary Seacole, Birmingham", "postalCode": "B18 5SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.494", "longitude": "-1.9328"}}, "title": "Consultant Psychiatrist - Inpatient Mary Seacole House 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253136", "validThrough": "2020-11-23T23:59:59+0000"}