{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 - £50,000"}}, "datePosted": "2020-11-03T06:07:53+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Resourcing Business Partner (Temporary Staffing) to join a supportive and warm working culture at The London Clinic, where your contribution is valued, and you can help us provide the best, personalised healthcare, delivering our three core values of; Caring, Inspiring and Pioneering.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest private hospitals, with approx. 1300 employees across state-of-the-art facilities located on Harley Street. We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Job Profile&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a brand new role where the Resourcing Business Partner is responsible for ensuring the provision of a high quality, cost-effective, and proactive temporary staffing service that meets the needs of all directorates.&lt;/p&gt;\n&lt;p&gt;The temporary staffing service includes the provision of Bank and Temp workers across all staff groups such as; Nursing, Medical, Allied Health Professionals, Non-Clinical Support functions as well as Admin and Clerical staff.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Location:&lt;/strong&gt;This role is located at our head office in Central London, NW1 (Close to Regents Park tube station). The team are currently working flexibly from home with the ability to attend the office if needed during the current pandemic.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type:&lt;/strong&gt;This is a full-time, permanent position working 37.5 hours per week; Monday to Friday.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Salary:&lt;/strong&gt;The attractive salary range for this role is £40,000 - £50,000 (inclusive of London Weighting), and will be dependent upon skills and experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package:&lt;/strong&gt;We offer a comprehensive package which includes a contribution pension scheme, Private Medical Healthcare, 33 day’s annual leave (inclusive of bank holidays), season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Key Duties&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operational management of all aspects of the temporary staffing service, partnering effectively with all stakeholders to understand and anticipate temporary/bank workforce demands, ensuring better forecasting of our resourcing needs utilising the most cost effective options at all times.&lt;/li&gt;\n&lt;li&gt;Responsible for the management of the temporary staffing bookings coordinators, ensuring all bank/agency shifts are booked in a timely manner and that the bank pool is utilised effectively.&lt;/li&gt;\n&lt;li&gt;Proactively work in partnership with heads of service, managers, and resourcing business partners to identify staffing gaps in services/departments in order to develop, implement and deliver bank resource plans.&lt;/li&gt;\n&lt;li&gt;Manage the recruitment of the bank staff, attending interviews and running effective assessment and recruitment days, continually exploring ways to increase the use of bank over agency.&lt;/li&gt;\n&lt;li&gt;Ensure that the service meets/exceeds KPI targets including reduction of agency spend, reduced time to hire, increased numbers of bank workers, and driving more staff from bank to substantive contracts.&lt;/li&gt;\n&lt;li&gt;Build and maintain strong working relationships with all recruitment agencies on our frameworks, as well as producing reports to analyse temp staffing usage trends and spend to propose cost reduction initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience leading a temporary staffing function or staffing agency office.&lt;/li&gt;\n&lt;li&gt;Experience working within the NHS or a healthcare environment with a sound knowledge of the health sector labour market and temporary staffing market.&lt;/li&gt;\n&lt;li&gt;Educated to degree level, or equivalent.&lt;/li&gt;\n&lt;li&gt;Track record of resource planning and implementing recruitment strategies and campaigns in a fast-paced, complex environment.&lt;/li&gt;\n&lt;li&gt;Highly effective communicator with a collaborative approach, and experience of building effective and credible relationships with multiple stakeholders both internally and externally, and at all levels of seniority.&lt;/li&gt;\n&lt;li&gt;Proactive individual with strong commercial awareness and outstanding team building and leadership skills.&lt;/li&gt;\n&lt;li&gt;Excellent IT skills and highly proficient in the full range of Microsoft Office. Experience using an electronic rostering or temporary staff management IT system would be advantageous.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 4LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5242", "longitude": "-.148504"}}, "title": "Temporary Staffing Recruitment Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253094", "validThrough": "2020-11-17T23:59:59+0000"}