{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 (pro-rata) per annum excl HCAs"}}, "datePosted": "2020-11-02T18:00:23+0000", "description": "&lt;p&gt;Whittington Health Trust is a lively, forward-thinking organisation in a diverse and multi-cultural area of North London .We are working in partnership with a range of local organisations to support all ages of adults to remain independent at home and prevent hospital admissions.&lt;/p&gt;\n&lt;p&gt;As an Integrated Care Organisation (ICO) we are well placed to support your professional development and provide a stimulating and supportive working environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialist Community Occupational Therapist– BAND 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Whittington Health Haringey Integrated Community Therapy Team (ICTT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time 22.50 hours/week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Outer London High Cost allowance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Part time Band 6 Occupational Therapist with diverse clinical skills to join our Integrated Community Therapy Team (ICTT). We work closely with GP’s, Rapid Response, and MAC network, Reablement, Social Services, Palliative care and District nursing teams. ICTT provide a patient-centered approach to support falls prevention, safe living, enable independence and management of long term conditions and support improving quality of life of terminally ill patients.&lt;/p&gt;\n&lt;p&gt;This role will be covering the Community Rehab and Falls Services, with an opportunity to rotate into Bed Based Intermediate Care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an excellent communicator, competent in a wide range of clinical areas such as moving and handling and minor home adaptations. They will have experience working with adults and elderly patients with mental health and physical health conditions including palliative care. They will demonstrate flexible problem-solving skills whilst working autonomously or with colleagues/other community services. They will receive support from Band 7 OT. They will be expected to supervise junior staff, and take on university student placements when opportunities arise.&lt;/p&gt;\n&lt;p&gt;Our Trust has achieved CQC Excellence and aims to continue to provide high quality of service and care. The Occupational Therapy service is integral with delivering our statement of purpose: providing a person centred service enabling residents to achieve their health and wellbeing goals to their optimal level and ensuring safety as much as possible. This statement of purpose is delivered to our community. There are opportunities for joint working, sharing skills and knowledge with other services and continue to further develop your personal and professional skills in a supportive environment.&lt;/p&gt;\n&lt;p&gt;If you would like any more information or to discuss the role further please contact Laxmi Shrestha, Band 7 OT on 0203074 2903.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stuart crescent health Centre, Wood Green", "postalCode": "N22 5NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6004", "longitude": "-.110172"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253043", "validThrough": "2020-11-16T23:59:59+0000"}