{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-11-02T10:16:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Capital, Estates &amp; Facilities Department at Cardiff &amp; Vale University Health Board as a Carpenter.&lt;/p&gt;\n&lt;p&gt;The Capital, Estates &amp; Facilities Service Board are currently seeking experienced and enthusiastic individuals to support the Estates Teams at one of the largest Health Boards in Wales.&lt;/p&gt;\n&lt;p&gt;The department is going through an exciting time of Modernisation and Service Improvement to maximise support and enhance the patient experience whilst, ensuring the department is fit for the future. We are looking to recruit a number of people who will excel in providing a safe, organised and highly efficient service, a person who can be innovative in their thinking and have the ability to make decisions for themselves, someone who can develop and support change in the department and be an integral part of a modern, effective, flexible Estates Team and ready for the future challenges ahead.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced and enthusiastic individual to support the continual building maintenance service provision of one of the largest Health Boards in Wales.&lt;/p&gt;\n&lt;p&gt;The department is going through an exciting time of Modernisation and Service Improvement to increase the support and enhance the patient experience ensuring the department is fit for the future. We are looking to recruit individuals who will excel in providing a safe, organised and highly efficient service, a person who can be logical and innovative in their thinking and have the ability to make decisions for themselves, someone who can develop and support the modernisation of the department ensuring we are ready for future challenges.&lt;/p&gt;\n&lt;p&gt;The successful applicants will have to demonstrate experience in the operation and maintenance of building fabric and structures, showing their aptitude for effective planned and reactive maintenance support.&lt;/p&gt;\n&lt;p&gt;You will need to work in close partnership with your Capital, Estates and Facilities colleagues to ensure the smooth running of the service and Estates Operation, and you will be key to the success of the Estates Department through Modernisation.&lt;/p&gt;\n&lt;p&gt;There is a requirement to work across all sites in Wales’ largest Hospital and University Health Board.&lt;/p&gt;\n&lt;p&gt;You will be the front line staff for both reactive and planned maintenance related issues and will need to be able to cope with the competing priorities, distractions and on occasion, unpredictable work patterns caused by the operational nature of the role.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible, calm under pressure and have excellent communication skills to effectively support and continue to complete work and manage the expectations of staff from all areas of the UHB. Your success will show through the effectiveness of work undertaken and your primary focus will be to support the continual provision of all Estates services.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date - 16th November, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris Watts&lt;/p&gt;\n&lt;p&gt;Interim Deputy Estates Manager (South)&lt;/p&gt;\n&lt;p&gt;christopher.watts@wales.nhs.ukT&lt;/p&gt;\n&lt;p&gt;(029)21 825612/07966 175007&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Llandough, Cardiff", "postalCode": "CF64 2XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4496", "longitude": "-3.20264"}}, "title": "Carpenter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251534", "validThrough": "2020-11-16T23:59:59+0000"}