{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112 pa"}}, "datePosted": "2020-11-06T10:46:37+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;We&#39;re not currently recruiting overseas nurses - must have NMC Registration.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Come and join a Trust rated Outstanding by the CQC. South Warwickshire NHS Foundation have been rated as outstanding following our latest inspection by the CQC and we are recruiting new staff to come and help us improve even further.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 – Nurse – Medical Ward Areas&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South Warwickshire NHS Foundation Trust (SWFT) is looking to recruit enthusiastic compassionate and self-motivated nurses within the Medical Division at Warwick Hospital. We can provide fantastic opportunities for both experienced and newly qualified nurses to join a high performing trust to develop skills, knowledge and experience within your chosen area of expertise. Our nurses strive to give outstanding care and provide only the very best to our patients ensuring a positive experience delivered with enthusiasm and compassion enabling them to leave hospital again as soon as they are able.&lt;/p&gt;\n&lt;p&gt;All of our ward areas have dedicated friendly, supportive teams in place to support new recruits and to ensure they provide the best care possible and aspire to clinical excellence at all times. We encourage staff development and support a learning environment and our teams are passionate about new learning and progressing staff personally and professionally.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;See attached document for a list of all our ward areas in the emergency division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please specify which wards you are interested in when you complete your application. Informal visits to all wards are welcomed, please contact the ward manager to arrange.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates will aspire to our Trust values to provide safe, effective, compassionate care. If you possess these qualities then this is the place for you. You must be enthusiastic, driven, and adaptable, possess excellent communication skills and be a strong dependable team player. You must also be able to work under pressure, work under your own initiative with good time management skills and be able to manage your own workload flexibly to meet the demands of the service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of SWFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SWFT is recognised as an ‘employer of choice’ and is highly recommended as a place to work.&lt;/p&gt;\n&lt;p&gt;We are extremely proud to have recently been rated as ‘Outstanding’ by CQC which shows the commitment and dedication from our workforce. Our employees are as important to us as the care we give to our patients. This is also demonstrated in the national NHS Staff Survey results which shows SWFT as one of the best employers for staff retention, morale, staff engagement and health and well-being.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On-going learning and development, providing clearly structured career pathways in preparation towards specialist or managerial roles.&lt;/li&gt;\n&lt;li&gt;Staff Benefits Platform - Lease Car, Electronics Scheme, Holiday Scheme Childcare vouchers and many more&lt;/li&gt;\n&lt;li&gt;Health and well-being services&lt;/li&gt;\n&lt;li&gt;Flexible working - All working patterns will be considered, Roster patterns provided to support a healthy work/life balance&lt;/li&gt;\n&lt;li&gt;Mentorship and preceptor support, Link nurse roles&lt;/li&gt;\n&lt;li&gt;All NHS standardised benefits – annual leave, pension scheme ect.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Preceptorship&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For those Nurses due to qualify or recently qualified we have an outstanding preceptorship programme to ensure that you are well supported to get your career off to the best start and to enable you to achieve your potential. This will include supernumerary time and close work with an experienced member of staff to help you in your new position.&lt;/p&gt;\n&lt;p&gt;The preceptorship is a 12 month programme where you will be assigned a preceptor in each placement area. In the first 6 Months you can expect consolidation of pre-registration practice, the second will develop your clinical expertise and the final placement will concentrate on your personal career aspirations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To help us achieve our vision of providing the best possible healthcare, South Warwickshire NHS Foundation Trust run Assessment Centres to select its future employees. This will give opportunity for you get a feel for the culture and learning opportunities within South Warwickshire NHS Foundation Trust. Assessment will be based on a drug calculations test, an individual interview and a group exercise which will be undertaken against the core values and behaviours that our employees pride themselves with.&lt;/p&gt;\n&lt;p&gt;The assessment centre is scheduled for Friday &lt;strong&gt;3rd April 2020&lt;/strong&gt; so please ensure you are available on this date should your application be shortlisted.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We think South Warwickshire NHS Foundation Trust is a great place to work. We hope you will too!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire HawkinsJob titleSenior HR AdvisorEmail addressclaire.hawkins@swft.nhs.ukTelephone number07887628247Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information regarding Nurse vacancies at SWFT or for an informal chat please contact Claire Hawkins (Senior HR Advisor) on 01926 495321 ext 8437 / 07887628247&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Nurse - Medical Ward Areas", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259286", "validThrough": "2020-11-22T23:59:59+0000"}