{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-08T09:59:34+0100", "description": "&lt;p&gt;We are seeking a salaried General Practitioner to join our successful, friendly and well-respected practice based in Kirkham, a market town west of Preston. We cover a mixed urban and rural area on the Fylde Coast. Kirkham Health Centre is home to our extensive primary care team of five GPs, two Nurse Practitioners, four Practice Nurses and two HCAs. We accommodate the local district nursing team and community pharmacists. We pride ourselves on our excellent access to services through a well matured triage system. The practice is an active member of our innovative local CCG and a member of the WREN Primary Care Network.   &lt;/p&gt;\n&lt;p&gt;The practice area is formed by the two small towns of Kirkham and Wesham, together with the surrounding villages and countryside.&lt;/p&gt;\n&lt;p&gt;There are high levels of local employment, excellent schooling both private and state with easy access to larger local towns via the M55 (5 minutes from the surgery) and local railway station. There are several new retail and housing developments making the area an exciting prospect.&lt;/p&gt;\n&lt;p&gt;The partners are seeking an enthusiastic, motivated and dedicated GP to join our successful practice.&lt;/p&gt;\n&lt;p&gt;We are looking for a salaried GP to work between 4 and 6 clinical sessions per week. Working days and surgery times are flexible. Excellent salary which includes NHS Pension, Medical Defence fees paid by practice and  six weeks annual leave.&lt;/p&gt;\n&lt;p&gt;Lots of local opportunity to earn more through: OOH, Extended hours or CCG work.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;9300 patients, EMIS Web&lt;/li&gt;\n&lt;li&gt;Triage and book on day appointments run by the ANP and Specialist Nurses&lt;/li&gt;\n&lt;li&gt;Chronic Disease Management&lt;/li&gt;\n&lt;li&gt;High achieving QOF&lt;/li&gt;\n&lt;li&gt;Supportive CCG&lt;/li&gt;\n&lt;li&gt;Excellent retention of staff&lt;/li&gt;\n&lt;li&gt;Actively involved with local PCN and other community teams&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Salary: Dependent on experience&lt;/p&gt;\n&lt;p&gt;Start Date: Flexibility for the right candidate&lt;/p&gt;\n&lt;p&gt;Informal enquires and practice visits welcome. Contact Dr Nigel Cartmell Tel: 01772 683420 or email: dr.cartmell@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kirkham, Preston", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217744", "validThrough": "2021-01-29T23:59:59+0000"}