{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10430", "minValue": "9736", "unitText": "YEAR", "value": "£9,736 to £10,430 per annum"}}, "datePosted": "2020-10-27T10:45:16+0000", "description": "&lt;p&gt;Surgery and Outpatients division is looking to appointment Secretary an on a permanent basis to join the E level Upper GI team&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced secretary to work within the Upper GI department to provide comprehensive secretarial and administration support to the clinical team. We need a well organised individual who is highly motivated to join our busy team and who is committed to delivering a high quality service to our patients.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible in your approach to meeting deadlines and like interaction with a wide variety of staff within the hospital.&lt;/p&gt;\n&lt;p&gt;Experience of RSA 3 (or equivalent) in typing/ word processing and also audio typing is essential in this role. Medical secretarial experience, including support to a clinician and knowledge of medical terminology is also essential. You must be able to communicate effectively and have strong interpersonal skills to deal with all levels of hierarchies and disciplines.&lt;/p&gt;\n&lt;p&gt;This involves management of the Consultant&#39;s diaries to ensure the smooth running of the service, working in partnership with other hospital departments such as Anaesthetics, Theatres, Outpatients, General Practitioners, Patients, their relatives and other local Hospital Trusts.&lt;/p&gt;\n&lt;p&gt;Co-ordination of the department surgical teams to ensure appropriate cover at all times on wards/in theatres and Outpatients to ensure maximum utilisation of time. To liaise with the IP and OP Waiting List Managers to ensure out patient clinics are covered where.&lt;/p&gt;\n&lt;p&gt;The hours for this post are 18.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Closing Date 10/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Upper GI Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244057", "validThrough": "2020-11-10T23:59:59+0000"}