{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 to £103,806 pa"}}, "datePosted": "2020-10-26T11:01:15+0000", "description": "&lt;p&gt;Want to be part of a dynamic team delivering high quality Emergency Care, in an amazing part of the country?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, the Emergency Department at Glan Clwyd Hospital is offering a fantastic opportunity for enthusiastic and committed ED doctors to join, as consultants, a forward thinking and dynamic team, whilst enjoying a coastal, rural or mountain based lifestyle.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Glan Clwyd Hospital is located in an area of recognised natural beauty with Snowdonia, stunning pristine beaches and enchanting castles all nearby. The local area offers a wide variety of lifestyle and family options, and for those keen to maintain ties further afield, the area has excellent transport links including fast direct trains to London. The cities of Chester, Manchester, and Liverpool are within easy reach and offer international travel connections.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts arise as we look to strengthen and consolidate our existing consultant base, and grow our workforce to meet the future healthcare challenges of our local population. Following a comprehensive review we have increased funding to strengthen staffing at all tiers, building upon our stable base. We’re looking for high calibre candidates who can help us take our service to the next level. If you think this is you, then we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With approximately 58,000 attendances per year, including 14,000 paediatric cases our department has a workload to keep you interested and challenged. You will still have time to talk to your patients properly, and do the practical procedures that interest you as an Emergency Physician. We are supported by the full range of district hospital specialities, and we’re also fortunate to have an extended range of sub-regional services on site including a Primary PCI service, vascular surgery, maxillofacial surgery, and ophthalmology. We are also a Trauma Unit practicing ETC models of trauma care, and take an active role in our Trauma Network.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The department is staffed with a mixture of Consultants, SAS Doctors (24/7 middle grade rota in operation) and juniors. In addition, there is a strong nursing team including ENPs, extended scope physiotherapists and an evolving team of Advanced Nurse Practitioners. Our department is part of a new build Emergency Quadrant, completed just over 5 years ago, future proofed to deal with an annual attendance of 70,000. The Emergency Quadrant includes an acute medical unit, surgical assessment unit, and a co-located GP OOH unit. We last year enhanced our model of care through the development of a Same Day Emergency Care (SDEC) unit for ambulatory cases, which is now supported by a full-time acute physician. This joint medical and surgical unit was the first of its kind in Wales, and helped attract national attention for the innovative way in which we had joined these teams, and developed new pathways from ED. We are planning to augment our service with the addition of a frailty unit and a GP admissions area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With the acute units, the ED now operates as part of an integrated Emergency Care Directorate, which was established just over 12 months ago. This provides us with the opportunity to think differently about how we meet our challenges, and put in place our vision for the future. This is an exciting time to join the team, as we embark upon the development of long-term plans to transform and reconfigure the way in which emergency services are delivered, across the acute floor. You will have the opportunity to work across our directorate, and to develop areas of interest and expertise, to help shape these plans for the future. You will work with a forward-thinking leadership team who place people at the heart of what we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition, the hospital and health board has excellent academic links with The University of Bangor, Glyndwr University, as well as close links with medical schools in Cardiff, Swansea, Liverpool and Manchester. There is a very active programme of Medical and Dental Education at both Undergraduate and Postgraduate levels. The hospital works closely with Health Education and Improvement Wales to provide high quality education and training, meeting the requirements of these regulatory bodies while maintaining the Health Board’s high standards of patient care. There are excellent opportunities for the right candidate to support the further development of education, training, research and academic links for Emergency Medicine in this area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have a friend or colleague who also wants to join then we have the capacity to make additional appointments, as we incrementally expand our workforce in a sustainable way. We are open to accommodating individuals who may be interested in a dual post with another specialty such as ITU, Prehospital Care, or Paediatrics, as we appreciate the benefits from having clinicians with additional experience and skills outside ED. The posts are full time, but we are also happy to support less than full time working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will offer an attractive relocation package for the right candidate. Interview expenses will be paid from point of entry to the UK. You must either be on the GMC Specialist Register with a license to practice in Emergency Medicine or be within six months of obtaining your CCT award at the time of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you want to be a part of this exciting future, and would like to hear more, then please contact either&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Tom O’ Driscoll, ED Clinical Lead - Tom.O’Driscoll@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Dr Paul Spambo, ED Medical Workforce Lead. - Paul.Spambo@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01745 448785 ext 3684&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal Visits are welcomed and encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTom O&#39;DriscollJob titleConsultant in Emergency Medicine &amp; Clinical LeadEmail address&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glan Clwyd Hospital, Bodelwyddan", "postalCode": "LL18 5UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2718", "longitude": "-3.49635"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242104", "validThrough": "2020-11-30T23:59:59+0000"}