{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45468", "minValue": "37628", "unitText": "YEAR", "value": "£37,628 - £45,468 per annum inc HCA"}}, "datePosted": "2020-10-26T08:17:31+0000", "description": "&lt;p&gt;Band 6 Full Time&lt;/p&gt;\n&lt;p&gt;Team Leader (Interventional Radiology)&lt;/p&gt;\n&lt;p&gt;Department: Radiology Department&lt;/p&gt;\n&lt;p&gt;Hours: 37.5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in becoming a team leader within the Interventional Radiology Department at Kings College Hospital&lt;/strong&gt;? We are offering a fantastic career opportunity in an exciting, forward thinking environment!&lt;/p&gt;\n&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;br /&gt;&lt;br /&gt;Located in a busy area of London, Kings College Hospital Foundation Trust has one of the largest Imaging departments in the UK providing a wide range of clinical support services to all other Directorates. There is an emphasis on obtaining cutting edge equipment and the introduction of new clinical techniques giving Imaging at Kings a reputation of being at the forefront of innovative radiological interventions.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The nursing team is looking for an experienced, highly motivated and enthusiastic senior nurse to join the department. The applicant must be a registered nurse or ODP with significant experience as a nurse/ODP in any of the following clinical areas including interventional radiology, cardiac cathlab, theatre scrub and recovery nurse. The ideal candidate must demonstrate commitment to their own personal development and show a keen interest in the future development of the nursing /ODP profession within interventional radiology. The department will offer to expand your clinical expertise in following areas which include scrubbing and circulating role for patients undergoing vascular angio procedure, renal and liver interventional procedures including TACE treatment and CT guided RFA (Radio Frequency Ablation). This will also include recovering patients undergoing the above procedure under GA or sedation, and nursing support within other imaging areas including ultrasound and general xray. The radiology nursing team also has a very well established nurse led preassessment service for our day case patients which part of the senior nurse role. The department offers an out of hours on-call service which all nurses/ODP are required to be part of, additionally you will be expected to take on the role of shift coordinator on a day to day basis which is a key element of the senior nurse role and therefore the applicant must be in possession of good clinical leadership skills and is able to act as a role model who will provide direction and support to junior staff. Kings College Hospital has got an established close link with London Health Education Institutes including Kings College London and South Bank University which offer various options for post registration study. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Interview date: 4th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDominique ObadipeJob titlePractice Development Operating Department PractitionerEmail addressDominique.obadipe@nhs.netTelephone number02032993970Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;An informal visit is strongly advised, please contact the Practice Development ODP (Dominique.obadipe@nhs.net) to arrange an &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;informal visit or obtain further information contact &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Alberto Santin (Radiology Matron) on 02032993970 or email alberto.santin@nhs.net &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;during office hours. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Band 6 Team Leader (Interventional Radiology Specialist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241730", "validThrough": "2020-11-22T23:59:59+0000"}