{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-18T13:20:03+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you don’t think a Community Hospital is an exciting place to work, then think again! The Rutland Ward in Oakham offers challenge and a level of autonomy you won’t get in larger units. If this is something that appeals to you, then we should talk.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whilst a complete Job and Person specification is attached, the role will include (but not be limited to):&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsibility for assessing, planning, implementing and evaluating programmes of evidenced-based nursing care to a group of clients/service users.&lt;/li&gt;\n&lt;li&gt;Assisting and contributing in the management and organisation of a ward / clinical area.&lt;/li&gt;\n&lt;li&gt;Actively contribute to setting and maintaining high standards of quality nursing care.&lt;/li&gt;\n&lt;li&gt;Actively participate in the education, development and supervision of other staff members.&lt;/li&gt;\n&lt;li&gt;Act as a clinical and professional role model, assessing and supporting students and learners on placement within the clinical area.&lt;/li&gt;\n&lt;li&gt;Work collaboratively and co-operatively with others to meet the needs of clients/service users and their families.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Has created a highly supportive environment with a multi-disciplinary approach to patient management and care.&lt;/li&gt;\n&lt;li&gt;Family and MDT goal setting are an integral part of the registered nurse role in all our in-patient areas. You will have the opportunity to demonstrate and develop your professional accountability, innovative thinking and contribute to the clear vision for the in-patient nursing areas and receive the support you need to achieve this.&lt;/li&gt;\n&lt;li&gt;Our Learning and Development centre will ensure you have the knowledge and skills to meet patient needs and complete your CPD requirements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Unit is a 16 bedded medical stepdown, rehabilitation and palliative care ward. It is one of 12 wards which form the Trust’s Community Health Services Division. We would normally recommend and encourage you to visit one of our wards during the application process to give you an insight to the types of patients on our wards, our patient management process with the MDT, how we facilitate timely discharges and communicate this to our patients and their families. This is not currently permitted but we can speak to you by phone to give you an overview.&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours per week in a 24/7 environment, but part time hours are also available if desired. Staff will work long days or night shifts as the service requires. Additionally, we offer free parking on all our sites.&lt;/p&gt;\n&lt;p&gt;Please contact Emma Starsmore (Ward Sister), Sandy Sawyer or Carla Yaxley (Deputy Ward sisters) on 01572 772015 or email Emma.Starsmore@leicspart.nhs.uk for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakham", "postalCode": "LE15 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6708", "longitude": "-.737515"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231405", "validThrough": "2020-11-19T23:59:59+0000"}