{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a."}}, "datePosted": "2020-10-26T15:01:14+0000", "description": "&lt;p&gt;Are you a dedicated, passionate, dynamic and, motivated nurse?&lt;/p&gt;\n&lt;p&gt;An exciting and rewarding opportunity has arisen for a Band 7 Parkinson’s Disease Nurse Specialist, to join the wider Dorset Specialist Parkinson’s disease team. The post holder should have a good understanding of Parkinson’s and Frailty and experience working within the speciality would be advantageous.&lt;/p&gt;\n&lt;p&gt;You will need to be closely linked to the medical/Neurologist consultants at University Hospitals Dorset (the newly formed Trust merging Poole and Bournemouth Hospitals) as well as the existing Parkinson’s Nurse Specialist’s. The post holder will be required to work autonomously, undertaking Nurse Led Clinics, home visits and provide ward consultations in line with service specification&lt;/p&gt;\n&lt;p&gt;We are offering this opportunity for a nurse currently working at a Band 6/7 level in either primary or secondary care level with a special interest in progressive neurological disorders, specifically Parkinson’s disease.&lt;/p&gt;\n&lt;p&gt;The role will involve undertaking specialist assessments for service users while also liaising with other members of the multi-disciplinary team, to ensure continuity of treatment and care. You will have experience of working autonomously.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication and written skills that will enable you to provide information to support, promote and encourage independence and support decision-making relating to care and support needs.&lt;/p&gt;\n&lt;p&gt;You will act as an expert resource and provide advice, support and education for professionals within primary and secondary care and community services.&lt;/p&gt;\n&lt;p&gt;The successful applicant will provide specialist medication advice, monitoring, education and support to service users affected by Parkinson’s disease and related disorders, through the various stages of this condition.&lt;/p&gt;\n&lt;p&gt;You will work closely as part of a wider inter-disciplinary team, which includes specialist Consultants, Physiotherapists, Speech and Language Therapists, Occupational Therapists, Rehabilitation Support workers, Research Nurses and Administrators. You will also work in collaboration with other acute Trusts and community services, local PD UK group and outside agency, meeting national and local audits, and current NICE guidance&lt;/p&gt;\n&lt;p&gt;You will be based either at a Community site in Bournemouth or at Royal Bournemouth Hospital (TBC), working in various clinical locations, including service users’ homes, across East Dorset, Christchurch and Bournemouth areas. You will need a full UK driving licence and have access to an insured vehicle.&lt;/p&gt;\n&lt;p&gt;This is a full-time, 37.5 hours per week post.&lt;/p&gt;\n&lt;p&gt;You’ll have the option to join your clinical specialism, such as Parkinson’s Nurses Association and attending regular supervisors and meetings with the South West PD nurses forum, networking with professionals from across the country. We get together regularly, auditing and sharing standard methodology for innovation and service re-design. You will be a part of quality improvements, research and development activity. Here we recognise and celebrate clinical excellence and dedication.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;If you feel that you have the necessary qualities and commitment for this post, and you would like to discuss the role further, we would be delighted to hear from you, please contact:&lt;/p&gt;\n&lt;p&gt;Name:  Luisa Mellish&lt;/p&gt;\n&lt;p&gt;Job title:  Service Manager for Adult Community Stroke and Neuro Services&lt;/p&gt;\n&lt;p&gt;Email address:  luisa.mellish@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07786 275678&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;Sam Leonard, Head of Specialist Services&lt;/p&gt;\n&lt;p&gt;Sam.leonard3@nhs.net&lt;/p&gt;\n&lt;p&gt;07775 035227&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH17 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7402", "longitude": "-1.97751"}}, "title": "Parkinson&#39;s Disease Specialist Nurse, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243020", "validThrough": "2020-11-08T23:59:59+0000"}