{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-20T11:02:25+0100", "description": "&lt;p&gt;Are you a highly motivated and dynamic experienced senior nurse looking to make a real difference to patient and staff experience? Are you able to inspire and motivate teams? If you have a passion for providing high quality care and you are looking for an opportunity to lead nursing care within the Women and Children Division we would welcome your talents and skills.&lt;br /&gt;&lt;br /&gt;We are seeking an exceptional and inspirational Lead Nurse to lead our service which provides high quality, evidence based care within the Women and Children Division. Located in West Norfolk across a large rural area, on the Cambridgeshire and Lincolnshire boarders.&lt;/p&gt;\n&lt;p&gt;You will be focused on women and children services and committed to maintaining strong professional oversight and governance which is pivotal to the quality and safety of our services to support good clinical outcomes for women, children and staff.&lt;br /&gt;&lt;br /&gt;As the Lead Nurse, you will have uncompromising professional standards and be responsible for maintaining safety, quality and improving the care given to women and their families. Delivery of excellence in care, service improvement and workforce development are key priorities for this role, ensuring the continuous improvement of service user experience.&lt;br /&gt;&lt;br /&gt;You will be an important member of the Divisional Leadership Team within the Women and Children Division of the trust, providing leadership to a dedicated team of Matrons, nurses and support staff, working collaboratively with the Consultant team to implement changes in practice in line with national guidance.&lt;br /&gt;&lt;br /&gt;You will have excellent communication skills along with visible, dynamic and inspirational leadership enabling the workforce to deliver safe and high quality standards of care.&lt;br /&gt;&lt;br /&gt;We can promise you a challenging and diverse role that will both stretch and develop you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;April Brown Chief Nurse April.brown@qehkl.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Head of Nursing for Women and Children", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233998", "validThrough": "2020-11-10T23:59:59+0000"}