{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-05T13:46:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;An exciting opportunity has been identified within the Surgery in Children Operational Delivery Network for a surgical nurse lead role. The SIC ODN is being developed and we are looking for a nurse with surgical experience to support with the review of surgery in children within the East Of England. You will work closely with the Director and Clinical Lead for the ODN, and also with the Paediatric and Neonatal critical care networks. You will support with strategic planning and management of services across EOE and work with local trusts to develop pathways.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will need project management skills and experience and be able to work across many teams in the East of England but also have excellent time management skills. The post is a 12 months fixed term from commencement of the role. A secondment would be considered.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;The role requires you to travel to all units within the network. You will have excellent communication skills and be able to support education across many different settings. The network base is at Addenbrooke&#39;s Hospital where you will be expected to be on a regular basis to engage with the wider ODN team.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;The network is currently Hosted by Cambridge University Hospitals NHS Foundation Trust.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;Closing date: 1 December 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 11 December 2020&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:  Kelly Hart&lt;br /&gt;Job title:  ODN Administrator&lt;br /&gt;Email address:  kelly.hart5@nhs.net&lt;br /&gt;Telephone number:  01223 256949&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Lead Nurse - Surgery in Children ODN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257945", "validThrough": "2020-12-01T23:59:59+0000"}