{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum including high cost al"}}, "datePosted": "2020-11-04T14:46:01+0000", "description": "&lt;h1&gt;Senior Occupational Health Advisor&lt;/h1&gt;\n&lt;p&gt;Surrey and Sussex NHS Healthcare Trust is looking for a dedicated, motivated and innovative Occupational Health Advisor to work with the Occupational Health team in developing and delivering the Trust’s vision and strategy of providing a proactive and supportive OH Wellbeing service, with the focus on prevention, which is available to all staff.&lt;/p&gt;\n&lt;p&gt;We recognise that investment in employees’ health and wellbeing at work benefits staff and provides better patient care and overall organisational success. We aim to deliver excellent occupational health and wellbeing services for our workforce and create a culture which fosters a healthy and productive environment.&lt;/p&gt;\n&lt;p&gt;The Trust is currently working towards SEQOHS accreditation and will be going through the assessment process for this over the coming months&lt;/p&gt;\n&lt;p&gt;The ideal candidate must be registered on part 3 of the NMC register as a Specialist Practitioner in Occupational Health, having studied at degree level. Suitable applicants will also need to have Occupational Health nursing experience and be able to carry out a range of clinical skills as well as having excellent consultation skills for the band 7 role.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with our experienced and dynamic nursing team and health &amp; Safety team to facilitate how best to achieve quality client care whilst acting within policies, guidelines and procedures.&lt;/p&gt;\n&lt;p&gt;The Trust employs 4,800 staff across two main sites with a number of other external satellite sites. In addition to this the OH service has developed a portfolio of external clients which services some 1,500 staff. The Trust’s Occupational Health &amp; Wellbeing Department is situated at East Surrey Hospital in Redhill where this post will mainly be based. However, some local travel may be necessary. The successful candidate will join a team that includes a visiting OH Physician, substantive OH nurses, Health and Safety officers and admin staff.&lt;/p&gt;\n&lt;p&gt;To succeed you must be confident, have excellent communication skills, proficient IT skills, and a flexible pro-active approach and be able to manage a varied and demanding workload as well as supervise and develop others.&lt;/p&gt;\n&lt;p&gt;The appointment is substantive, on a full time basis (Monday to Friday). There are currently no out-of-hours associated with the role.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this role further, please contact Janette Barnes Associate Director- Occupational Health, Safety &amp; Wellbeing on 01737 231631 ext. 6148.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Senior Occupational Health Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256267", "validThrough": "2020-11-13T23:59:59+0000"}