{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-06T13:31:12+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM TUNTIL 31/03/22 DUE TO MEET THE NEEDS OF THE SERVICE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These posts are funded fixed term until March 2022, contract duration will be based on appointment date.&lt;/p&gt;\n&lt;p&gt;There are a number of vacancies across Programmes in the Directorate for Project Managers. Please see below details of examples. Candidates only need apply once and will be interviewed and considered for all vacancies.&lt;/p&gt;\n&lt;p&gt;--------------------------------------------------------------------------------------------------------------&lt;br /&gt;Are you interested in developing and modernising technical solutions to deliver the best possible care and support to everyone affected by Cancer and the Care Providers who support them?&lt;br /&gt;Cancer is one of the two biggest causes of premature death in Wales, with approximately 20,000 new cases of cancer being diagnosed amongst the resident population of Wales each year. With our ageing population, the demand for cancer care is increasing and over the coming years, around 1 in 2 people will be diagnosed with cancer before the age of 75.&lt;br /&gt;Excellent opportunities are now available for you to join NHS Wales Informatics Service (NWIS) and help us transform health and care through digital innovation. This will be an exciting time as we embark on the development and implementation of a new Cancer Informatics Solution for Wales. The solution will support service delivery and quality improvement across Wales by improving visibility and exchange of clinical information. The solution will contribute as a key enabler to reduce harm and support integrated working across complex pathways providing healthcare professionals with the information they need to provide better care across clinical disciplines, geographical and organisational boundaries by supporting informed decision making and therefore better outcomes for patients.&lt;br /&gt;We are looking to recruit highly motivated individuals that care about and are committed to delivering the technical solutions for NHS staff and patients in Wales. These roles will make a real difference providing access to a single record across care settings. Together we will improve access to cancer information and new ways of delivering cancer services and care; supported by modern information and digital technologies to ensure cancer services and outcomes for patients in Wales are the best in Europe.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more, please contact Rebecca McGrane (Rebecca.mcgrane@wales.nhs.uk)&lt;/span&gt;&lt;br /&gt;--------------------------------------------------------------------------------------------------------------&lt;br /&gt;Would you relish the opportunity to work on a flagship programme that is ground-breaking in the UK and internationally delivering a digital solution to support integrated health and social care across Wales?&lt;br /&gt;We’re looking for a Project Support Manager to take a lead role in supporting the Welsh Community Care Information System (WCCIS).WCCIS enables social care, mental health, community nursing and allied health professionals ensure that quality care and support for individuals, families and communities are more effectively planned, co-ordinated and delivered. WCCIS is a key digital initiative for Welsh Government and is set out in ‘A Healthier Wales’ plan.&lt;br /&gt;The national WCCIS programme team has been established to work with local authorities, health boards and regional partnership boards in Wales, in order to co-ordinate activities and deliverables across a number of workstreams to:&lt;br /&gt;· Ensure usability, quality &amp; safety of digital functionality for all services in scope&lt;br /&gt;· Support deployment, utilisation, business change and benefits realisation &lt;br /&gt;· In partnership with National professional leads and informatics services, lead and support development and implementation of information and reporting standard&lt;br /&gt;· Ensure delivery of the contracted service and future developments&lt;br /&gt;The role is based in the Engagement and Transformation Directorate of NWIS but you will be a key member of the WCCIS Programme Team, and you will work collaboratively with Health Boards and Local Authorities across Wales.&lt;br /&gt;The vision of WCCIS is ‘Connecting professionals to deliver better joined up care’ – this is your chance to support the implementation of this ground-breaking digital solution and make a real dif&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125015.jpg", "name": "NHS Wales Informatics Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125015"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TGA / Castlebridge, Cardiff, Cardiff", "postalCode": "CF11 9AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4812", "longitude": "-3.18872"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259925", "validThrough": "2020-11-22T23:59:59+0000"}