{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-29T08:45:39+0000", "description": "&lt;p&gt;A full time permanent opportunity has arisen for a self-motivated and enthusiastic Band 4 Tutor to join our friendly, award-winning Recovery College team in the Peterborough locality.&lt;/p&gt;\n&lt;p&gt;Recovery College East is a collaborative, educational learning environment, which aims to convey messages of hope, empowerment and opportunity to all. It aims to bring people together to realise and inspire individual and collective potential and enhance the development of recovery-orientated services within Cambridgeshire and Peterborough Foundation Trust. It celebrates strengths and successes rather than highlighting deficits or problems.&lt;/p&gt;\n&lt;p&gt;We are seeking a Tutor (full time 37.5 hours per week) to co-produce and deliver high quality and relevant courses alongside managing course administration. The post holder will establish a supportive and respectful relationship with all students of the recovery college and represent the recovery college and the wider recovery team at conferences and Trust events.&lt;/p&gt;\n&lt;p&gt;The post holder will be joining the college at a time of exciting new developments with many opportunities to support the college, through a co-production model working with all stakeholders, to expand the service through the development of new courses/workshops and initiatives.&lt;/p&gt;\n&lt;p&gt;We are looking for someone ambitious, creative and person-centred, to support our new and exciting developments. The post holder will hold a professional teaching qualification, lived experience of health challenges or experience of being in a carer’s role would also be beneficial but is not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Danny Bowyer, Training and Development Co-ordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;daniel.bowyer@cpft.nhs.uk / 01733 977426&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eco Innovation Centre, Peterborough", "postalCode": "PE1 1SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5742", "longitude": "-.239303"}}, "title": "Recovery College Tutor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247665", "validThrough": "2020-11-12T23:59:59+0000"}