{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 equivalent"}}, "datePosted": "2020-11-05T15:07:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Pre-Operative Assessment | Band 5/6 equivalent |Monday to Saturday – Full time hours|  Washington | Learning and advancement opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to expansion the Spire Washington Hospital is recruiting for an enthusiastic and committed Staff nurse. You will be based in our Pre-Assessment unit working alongside an experienced and dynamic team, covering a wide variety of specialisms. This unmissable opportunity will enable you to further develop your clinical skills in a modern and supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Washington is a 35 in-patient bedded hospital with 10 consultation and 2 treatment rooms based just off junction 63 of the A1 with great commuter links. Our Hospital offers a range of services and facilities including four operating theatres covering specialities including Orthopaedics and Gynaecology and a full Diagnostic suite.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will support in assessing patient’s health and well-being across a complex and changing caseload&lt;/li&gt;\n&lt;li&gt;Undertake electronic pre-operative assessment of patients&lt;/li&gt;\n&lt;li&gt;Identify and escalate patients of concern against the hospital&#39;s admission criteria to senior nursing staff&lt;/li&gt;\n&lt;li&gt;Ability to undertake a full patient health assessment and triage their pre-operative assessment requirements&lt;/li&gt;\n&lt;li&gt;Assist in the delivery of care to meet the individuals’ health and wellbeing needs&lt;/li&gt;\n&lt;li&gt;Provide and receive complex, sensitive or contentious information&lt;/li&gt;\n&lt;li&gt;Develop own knowledge and skills and that of others&lt;/li&gt;\n&lt;li&gt;Promote best practice in health and safety and security&lt;/li&gt;\n&lt;li&gt;Assist in maintaining and developing services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a Registered Nurse with no restrictions on practise&lt;/li&gt;\n&lt;li&gt;Be used to working in teams with minimum supervision&lt;/li&gt;\n&lt;li&gt;Experience of working in an acute environment&lt;/li&gt;\n&lt;li&gt;Competence across a range of skills, supported by professional and clinical knowledge acquired through state registration&lt;/li&gt;\n&lt;li&gt;A surgical background is desirable but we are happy to consider Nurses with an interest in developing their experience in this field&lt;/li&gt;\n&lt;li&gt;Advanced IT skills for electronic pre-operative assessment system&lt;/li&gt;\n&lt;li&gt;Phlebotomy, venepuncture and ECG skills desirable (or willing to be trained).&lt;/li&gt;\n&lt;li&gt;Outstanding communication skills&lt;/li&gt;\n&lt;li&gt;Pre-Operative Assessment Association course desirable (or willing to undertake this course within 12 months of employment)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sherine Lowers @ sherine.lowers@spirehealthcare.com &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Washington", "postalCode": "NE38 9JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8794", "longitude": "-1.55928"}}, "title": "Staff Nurse – Pre-Assessment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258262", "validThrough": "2020-12-05T23:59:59+0000"}