{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T15:31:00+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;1 Year Fixed Term Contract - Community Pain Management Service &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 Vacancy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy is for a full-time Band 7 Practitioner Psychologist, to join the Somerset Community Pain Management Service on a 1-year fixed-term contract (to cover maternity leave).&lt;/p&gt;\n&lt;p&gt;The Somerset Community Pain Management Service is based at Dene Barton Community Hospital in Taunton, but provides clinics throughout the county of Somerset. It comprises a small, friendly and supportive multidisciplinary team, consisting of Psychologists, Anaesthetists, Specialist Nurses, a Physiotherapist and administrators. The service is strongly biopsychosocial in orientation and aims to empower people with persistent pain to develop their understanding, skills and confidence to live a full and meaningful life.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic Psychologist to join our team and help cover some of the Psychology clinics that are currently being held largely remotely, but which are usually held in Taunton, Bridgwater, South Petherton and Wincanton. A major part of the role will involve providing specialist evidence-based psychological assessments and interventions for adults with complex psychological presentations. The post holder will also have the opportunity to work alongside multidisciplinary colleagues in co-facilitating the Pain Management Programme, Body Reprogramming Group and Mindfulness-Based Stress Reduction Programme and contributing to their ongoing evaluation and development.&lt;/p&gt;\n&lt;p&gt;Psychologists within the pain service have the opportunity to attend weekly team meetings and bi-annual team away days. They are encouraged to actively participate in Trust Clinical Health Psychology meetings and Practitioner Psychology Forums and attend other relevant CPD training opportunities and events. The Pain Service Psychologists provide consultation, training, education and support, to members of the multidisciplinary team and related primary and secondary healthcare professionals. They also take an active role in the ongoing development and evaluation of the pain and psychology services, whilst undertaking audits and assisting with research activity.&lt;/p&gt;\n&lt;p&gt;All Somerset NHS Foundation Trust staff are supported in developing a Job Plan and attending 6-monthly Professional Development Reviews. In addition, the post holder will also receive monthly supervision from a Clinical Psychologist and will be invited to attend a bi-monthly reflective supervision group with other members of the multidisciplinary team. The Somerset Community Pain Management Service has a good working relationship with local training courses and provides regular placements and research opportunities for Trainee Clinical Psychologists and MSc Health Psychology students. The Post holder will therefore take an active role in helping to supervise and support psychology students, where appropriate.&lt;/p&gt;\n&lt;p&gt;We would warmly encourage informal telephone and email enquiries Somerset Community Pain Management Service, where possible. This will enable candidates to meet with members of the team, discuss the post in greater detail and ask any questions they might have.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Amanda McDonaldJob titlePrincipal Clinical PsychologistEmail addressamanda.mcdonald@somersetft.nhs.ukTelephone number01823 344147&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dene Barton Community Hospital, Taunton", "postalCode": "TA4 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0376", "longitude": "-3.18224"}}, "title": "Practitioner Psychologist, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254557", "validThrough": "2020-11-24T23:59:59+0000"}