{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-27T16:01:34+0000", "description": "&lt;p&gt;Band 7&lt;/p&gt;\n&lt;p&gt;The Royal Wolverhampton Community Ambulatory Care Service is looking for a full time B7 Senior Sister/ charge Nurse&lt;/p&gt;\n&lt;p&gt;We are looking for an exceptional, advanced level nurse to provide clinical leadership within the Community Ambulatory Care service and Primary Care.&lt;/p&gt;\n&lt;p&gt;The post holder will need to demonstrate experience and expertise in tissue viability, be able to work autonomously with a complex caseload as well as providing clinical leadership to the Ambulatory Care and Primary Care teams.&lt;/p&gt;\n&lt;p&gt;You will be expected to promote safe and effective care for all patients who access clinic services as well as provide expert advice and guidance to the wider Adult Community and Primary Care services.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the team as we develop and implement service improvement initiatives as part of the transformation of community services.&lt;/p&gt;\n&lt;p&gt;This post will predominantly be working within the various clinic venues across the city, however there will be an expectation for the post holder to undertake home visits if and when required and to travel across the different venues. You must therefore have a full UK driving license and have access to a car for work purposes.&lt;/p&gt;\n&lt;p&gt;The role will also be working in conjunction with the Corporate Tissue Viability Service to ensure maintenance of clinical competency and knowledge, skills and implementation of the tissue viability pathways.&lt;/p&gt;\n&lt;p&gt;If you think you have what it takes and are looking for an exciting and challenging environment, with opportunities for further career development then ambulatory care services would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNisha kumari-DewatJob titleService Delivery ManagerEmail addressnisha.kumari@nhs.netTelephone number07786624826Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like an informal discussion about the position please contact either Nisha Kumari-Dewat or Kerry Walters via service secretary 01902 441944&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pendeford, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Senior Sister / Charge Nurse Community Ambulatory clinic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245309", "validThrough": "2020-11-10T23:59:59+0000"}