{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T15:01:16+0100", "description": "&lt;p&gt;East Kent Hospitals University NHS Foundation Trust is seeking a Consultant Paediatrician / Clinical Director for our newly formed Children’s Health Care Group, one of eight care groups across our Trust. You will join our clinically led organisation at an exciting time for the Trust and the County, taking a leading and influential role in delivering care for children and young people across a large organisation. We provide comprehensive acute clinical services for 750,000 people and specialised services to over a million, employ over 8000 staff and have a turnover of £700m.&lt;/p&gt;\n&lt;p&gt;This new chapter in our exciting story includes the opening of a new medical school for the county with the first students arriving in 2020. We are working closely with our University partners and other NHS bodies to support this crucial development for the ongoing provision of healthcare in our county. As part of the Kent Surrey and Sussex AHSN we have close research links there and also with the Universities. The emerging integrated care partnerships mean you will have a key role in working with the primary care networks in creating different ways of maximising our total NHS resource in the best interests of our citizens.&lt;/p&gt;\n&lt;p&gt;Our Values are fundamental to our aspirations for the way we provide healthcare: caring, safe, respect and making a difference. As one of our Clinical Directors you will be expected to embody these values and lead our medical staff to become exemplars of these values as well.&lt;/p&gt;\n&lt;p&gt;This is a great time to join us and be part of something unique. We have some outstanding examples of innovative care that are transforming our services and the experience for our patients. You will be expected to have experience in medical management and be able to demonstrate a track record of working with complexity whilst exhibiting dynamic and innovative leadership. You will work closely with the Executive Directors in supporting our long-term vision.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Martin&lt;/p&gt;\n&lt;p&gt;Chief Medical Officer&lt;/p&gt;\n&lt;p&gt;rebecca.martin27@nhs.net&lt;/p&gt;\n&lt;p&gt;01233 616043&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Ashford/Canterbury/Magate", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Clinical Director: Childrens and Young People Care Group", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237013", "validThrough": "2020-11-18T23:59:59+0000"}