{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum"}}, "datePosted": "2020-10-16T14:16:07+0100", "description": "&lt;p&gt;Consultant Psychiatrist- PICU&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivate consultant psychiatrist to provide clinical leadership as a substantive consultant for Jade Ward, a 9 bed male PICU based at Luton &amp; Central Bedfordshire Mental Health Unit.&lt;/p&gt;\n&lt;p&gt;At ELFT, and we are proud of our field leading Quality Improvement Programme and excellent leadership development support, which put improving care and developing staff at the core of what we do.&lt;/p&gt;\n&lt;p&gt;We work closely with the Institute of Health Improvement, and partner across the BLMK STP system to drive innovations in healthcare, and staff are actively encouraged to engage and lead transformation work.&lt;/p&gt;\n&lt;p&gt;Bedfordshire and Luton sit at the heart of the three counties in the rolling Chilterns, which have been designated an area of outstanding natural beauty. The area boasts a multitude of picturesque villages, and outstanding Ofsted rated state and independent schools, with St Albans, Hitchin and Berkhamsted, (Sunday Times Best Place to Live 2019), all a short distance away.&lt;/p&gt;\n&lt;p&gt;Bedfordshire and Luton are very well connected, with frequent direct trains to central London which can be reached in just over half an hour. The M1 and M25 are easily accessible, and Luton Airport enables direct links to cities across mainland Europe, and beyond. If you are looking to relocate when you join us, we can also offer you support with this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer support to new consultant though our budying scheme , enabling you access to practical and mentoring support when you need it.&lt;/p&gt;\n&lt;p&gt;We recognise the importance of work like balance and encourage flexible working. Talk to us about your needs and we can adjust your job plan to accommodate this.&lt;/p&gt;\n&lt;p&gt;ELFT is a teaching trust, with many opportunities to teach medical student from Cambridge University and supervise Core and Higher Trainees from East of England Deanery.&lt;/p&gt;\n&lt;p&gt;ELFT actively upport academic and clinical with close links with WHO affiliated research centre the Unit for Social and Community Psychiatry, part of Queen Mary and CLAHRC research network. Colleagues with an interest in research are actively encouraged and supported to engage with this.&lt;/p&gt;\n&lt;p&gt;If you have any questions or would like to discuss this vacancy further please don&#39;t hesitate to get in touch to arrange an informal conversation.&lt;/p&gt;\n&lt;p&gt;Clinical Director- Dr Guy Thompson; guy.thompson@nhs.net, mob 07968946060&lt;/p&gt;\n&lt;p&gt;EA- Makeda.crawlle-wright@nhs.net, 01525 638539&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Guy ThompsonEmail address guy.thompson@nhs.net Telephone number 07968946060&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jade Ward, Luton and Central Bedfordshire Mental Health Unit, LUTON", "postalCode": "LU4 0FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8974", "longitude": "-.474701"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230570", "validThrough": "2020-11-15T23:59:59+0000"}