{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 plus London Weighting"}}, "datePosted": "2020-10-20T09:15:32+0100", "description": "&lt;p&gt;This is a full time 10PA Consultant post in EIP team General Adult Psychiatry based at Mellmead House, 4 Orchard Close, Rodney Road, Wanstead E11 2DH. The employing organisation is North East London NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Redbridge EIP works with patients with first episode of psychosis under the Care Programme Approach (CPA). It covers an age range from 14 to 65 years and has working arrangements with CAMHS. Referrals to EIP mainly come from GPs, the Access Team, CAMHS, the inpatient unit and the home treatment team. The team has a 2-week Referral to Treatment Target (RTT) and takes part in physical health CQUINs. Team doctors are involved in assessing and providing advice about accepting referrals, allocating care coordinators, performing CPA reviews, medical reviews, home visits to patients, mental health act assessments, doing CTO tribunal reports, attending mental health review tribunals, professionals meetings and in making decisions about discharging patients from EIP. They regularly attend multidisciplinary team zoning meetings. The team caseload is about 145 to 150 patients approximately. All patients are on CPA.&lt;/p&gt;\n&lt;p&gt;You will work closely with the team consultant, team manager, the rest of the multidisciplinary team and with other teams across interfaces both in NELFT and externally. There is 1 wte Speciality Dr in post.&lt;/p&gt;\n&lt;p&gt;The Service operates a Risk Zoning Meeting with multidisciplinary input facilitating robust risk management and a &lt;em&gt;‘whole team’&lt;/em&gt; approach to team caseload management. Psychological treatments provided by EIP team psychologists include Cognitive Behaviour Therapy and Family intervention. Carer’s Support is also provided to carers who accept this intervention. A Social Group anda Social Netball Women’s group are part of the recovery-based activities that the team offers to patients. All patients in the Service have access to psychology input as required.&lt;/p&gt;\n&lt;p&gt;A personality disorder service providing dialectical behaviour therapy and mindfulness interventions are also available in the Trust and patients can be referred to this service as required.&lt;/p&gt;\n&lt;p&gt;There is a forensic liaison service from East London NHS Foundation Trust, which regularly visits Mellmead House and provides advice and support to teams in Mellmead House. Drug and Alcohol services are based within the borough and provided by East London NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post provides sound clinical experience in areas such as assessment and management of a broad range of mental health conditions, mental state examinations, risk assessments, medical treatments, multidisciplinary model of team working, interface with primary care, cross cultural psychiatry. In EIP the Team doctors are involved in providing advice about accepting referrals, assessing patients, performing CPA reviews, medical reviews, home visits to patients, mental health act assessments, mental health review tribunals and making decisions about discharging patients.&lt;/p&gt;\n&lt;p&gt;The post requires candidates to have Full GMC Registration with License to Practice in the UK, MRC Psych (or equivalent) and Section 12 Approval.&lt;/p&gt;\n&lt;p&gt;The post holder will support their peers and team leader and be an effective team member whilst working on their own initiative. They will supervise junior colleagues. They will have a commitment to collaborative working and actively supporting and liaising with other health and social professionals and agencies.&lt;/p&gt;\n&lt;p&gt;There is access to local academics, trust wide academics, a variety of free courses within the Trust and also to the monthly Bart’s academic programme. As several general adult mental health services are co located in Mellmead House, the post holder will work alongside several other consultants in an active learning atmosphere.&lt;/p&gt;\n&lt;p&gt;The post holder will have office desk at Mellmead House with access to a Laptop. He/she will work closely with the multidisciplinary team, and the other doctors in the team. There is dedicated secretarial support in the team. Wanstead High Street is close by and offers a wide variety of cafes, shops and good public transport links. Car parking is available in and around Mellmead House. Library facilities are available at Goodmayes Hospital.&lt;/p&gt;\n&lt;p&gt;There is an established ECG clinic and a borough wide Clozapine Clinic at Mellmead House run by dedicated nurses and which patients can benefit from.&lt;/p&gt;\n&lt;p&gt;There are also established monthly multidisciplinary teaching sessions at Mellmead House organised and run by Dr Henok Getachew, Consultant psychiatrist. All doctors in Mellmead House can participate in and contribute to this teaching.&lt;/p&gt;\n&lt;p&gt;There is a dedicated consultant monthly academic programme and weekly local academic programmes. There are opportunities for professional development, research and teaching of junior doctors. The post holder together with the consultant psychiatrist in the team will be closely involved in Clinical Governance Issues and is expected to play an active role in clinical audit and Quality Improvement.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;On call&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The out of hours on call rota is 1 in 50 offsite rotas. It covers the A&amp;E departments of Whips Cross Hospital, Queens Hospital Romford and King George Hospital in Goodmayes, Sunflower court and 136 Suite as 3rd on call with a CT as first on call and an ST second on call.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Basit HussainJob titleInterim Redbridge Associate Medical DirectorEmail addressbasit.hussain@nelft.nhs.ukTelephone number0300 555 1201 x 59175Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONTACT NAME FOR INFOMRAL ENQUIRIES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Basit Hussain&lt;/p&gt;\n&lt;p&gt;0300 555 1201 x 59175&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mellmead House, , Redbridge", "postalCode": "E11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5838", "longitude": ".028749"}}, "title": "Consultant Psychiatrist EIP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233540", "validThrough": "2020-11-22T23:59:59+0000"}