{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "165000", "minValue": "165000", "unitText": "YEAR", "value": "£165,000 per annum"}}, "datePosted": "2020-11-06T11:15:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Group Chief Financial Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£165,000 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Kettering General Hospital NHS Foundation Trust (KGH) and Northampton General Hospital NHS Trust (NGH), have recently announced plans to develop greater collaboration in the further delivery of high quality, patient focussed clinical services supported by integrated/pooled corporate resources that enable better outcomes for local people. This is being achieved by forming a Group Management Operating Model.&lt;/p&gt;\n&lt;p&gt;The county’s population, already diverse and widespread population at c750,000 people, is one of the most rapidly growing in England. Collectively, the two hospital Trusts have 1,440 beds, revenue budget of circa £650m and approximately 10,000 staff. Moving to a Group Management Model but retaining the existing boards, will enable KGH and NGH to integrate their clinical services whilst developing innovate approaches to streamlining pathways, with a clear focus on doing the right thing for patients every time. Working together, they will also design more effective ways in which corporate support services are provided, harmonising processes across the two organisations.&lt;/p&gt;\n&lt;p&gt;The Group has huge ambitions and with major capital investment approved by the Secretary of State they have begun reshaping their physical infrastructure, which will rival many of the most modern acute care facilities at a scale that can attract the best available talent in the market. Work has already begun on developing the new model; a Chair, Chief Executive and People Officer have been appointed.&lt;/p&gt;\n&lt;p&gt;The Group now seeks an exceptional Chief Financial Officer; a business/functional leader with a genuine desire to want to do things differently – to make their mark, as part of a unified team, in helping to shape the Group in the early days of its formation whilst building upon the foundations that have already been laid for closer group and systems collaboration. They will have accountability for strategic oversight, decision making and financial performance across the Group; and both individual Trusts. Driving Group transformation, the management of communications with external stakeholders and ensuring statutory responsibilities across both Trusts are fulfilled, will be key role objectives.&lt;/p&gt;\n&lt;p&gt;The NHS is committed to appointing diverse, talented and high-performing individuals and welcomes candidates irrespective of their background. Appointments are made in keeping with NHS’s commitment to value diversity and promote equality in that there should be equal opportunities for all and no discrimination on the grounds of age, disability, gender, race, religion or sexual orientation, providing individuals meet the required criteria.&lt;/p&gt;\n&lt;p&gt;For further information about this role, please contact one of the following:&lt;/p&gt;\n&lt;p&gt;Rupert Gibb, Partner&lt;/p&gt;\n&lt;p&gt;email: rgibb@warrenpartners.co.uk or 0845 261 0600 &lt;/p&gt;\n&lt;p&gt;Korinna Sjoholm, Partner&lt;/p&gt;\n&lt;p&gt;email: ksjoholm@warrenpartners.co.uk or 0845 261 0600 &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 12 noon on 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 15th December 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering and Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "KGH NGH Group Chief Financial Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259370", "validThrough": "2020-11-19T23:59:59+0000"}