{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £40,000"}}, "datePosted": "2020-11-06T06:50:14+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Senior Payroll &amp; Benefits Administrator to join our Finance team, based at Park Square West with a salary range on offer of £35,000 - £40,000. The London Clinic has a supportive and warm working culture where your contribution is valued, and you can help us provide the best, personalised healthcare, and deliver our three core values of; Caring, Inspiring and Pioneering.&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Description&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working with the Payroll Manager and the Payroll Department to provide a full Payroll and benefit service to the staff of the London Clinic.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Job Type: (Full Time, Permanent role working 37.5 hours per week)&lt;/li&gt;\n&lt;li&gt;Shifts: Monday to Friday between the hours of 8.30am to 5.30pm&lt;/li&gt;\n&lt;li&gt;Benefits package: We offer a comprehensive package including a contributory pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 33 days annual leave (inclusive), as well as a wide range of other benefits.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Duties &amp; Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be responsible for the accurate and timely production of monthly and weekly payrolls for approximately 1200 employees&lt;/li&gt;\n&lt;li&gt;To administer and advise on The Clinics full range of benefits &lt;/li&gt;\n&lt;li&gt;To be responsible for a full range of payroll tasks including but not limited to, SMP, SSP, Starters, Leavers and Changes.&lt;/li&gt;\n&lt;li&gt;To be familiar with Clinic policies and procedures and staff benefits and be able to provide general information to managers and staff regarding these&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 5 years experience of working in a payroll department including full payroll processes and procedures &lt;/li&gt;\n&lt;li&gt;Experience of using ITrent Payroll software is essential&lt;/li&gt;\n&lt;li&gt;Experience of Payroll software&lt;/li&gt;\n&lt;li&gt;Excellent verbal and written communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 4LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5242", "longitude": "-.148504"}}, "title": "Senior Payroll &amp; Benefits Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258841", "validThrough": "2020-11-20T23:59:59+0000"}