{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-04T15:35:46+0000", "description": "&lt;p&gt;The Assertive Outreach Team in Bridgwater are inviting Mental Health Nurses to apply to join our close knit multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for you to work in a growing Assertive Outreach Service with a shared caseload as a Band 6 Care Coordinator.&lt;/p&gt;\n&lt;p&gt;The team provides mental health support to individuals with complex, severe and enduring mental health difficulties in the Somerset Coast area. The team focuses on supporting individuals who historically have struggled to engage with standard care co-ordination processes and are at high risk of relapsing or admission into inpatient services.&lt;/p&gt;\n&lt;p&gt;You&#39;d be working as a senior clinical member and care co-ordinate individuals within a shared caseload with the support of the rest of the team. You will also have a key role in supporting other members of the team in the development and delivery of care in the community. There will also be the opportunity to take on the supervision of junior members of staff within the team under the direction of your line manager.&lt;/p&gt;\n&lt;p&gt;You&#39;ll receive support and guidance from the rest of the team and a clear supervision structure as well as a focus on your own personal and professional development through the Trust’s PDR process. We are closely aligned with the Dual Diagnosis Team so you&#39;ll have the opportunity to work collaboratively with and learn from these colleagues.&lt;/p&gt;\n&lt;p&gt;The team are committed to a recovery approach and have the ability to be flexible to support each other.&lt;/p&gt;\n&lt;p&gt;The hours are primarily 9am until 5pm but there is potential for flexibility.&lt;/p&gt;\n&lt;p&gt;The team has a very positive, supportive and dynamic culture that you will be able to contribute to and benefit from. We are keen to enhance the multi-disciplinary skill set within the team through the recruitment of this post.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Geraldine Amos, Assertive Outreach Service Manager on 07775 030742.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glanville House, Church Street, Bridgwater, Bridgwater", "postalCode": "TA6 5AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1309", "longitude": "-2.99812"}}, "title": "Community Mental Health Nurse AOT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256460", "validThrough": "2020-11-19T23:59:59+0000"}