{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa (based on full time hours)"}}, "datePosted": "2020-10-12T15:00:20+0100", "description": "&lt;p&gt;Part time position 0.5 wte, 18.75 hours per week&lt;/p&gt;\n&lt;p&gt;Are you passionate about older people and their mental health?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Band 7 Clinical Psychologist to work in the Southampton West OPMH CMHT.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be based at Western Community Hospital, Southampton SO16 4 XE. The service provides care to older people with mental health problems such as anxiety, depression, personality disorder and psychosis, as well as for people with dementia and their carers. A flexible approach to working practices is required to enable the service to meet the needs of the served population.&lt;/p&gt;\n&lt;p&gt;The responsibilities will include the provision of psychological assessment including neuropsychology and therapy to older people living in the community and to be a source of consultation, supervision and advice to the multi-disciplinary team and other mental health professionals on psychological issues. A prime aim is to enhance the psychological mindedness of the MDT and promote the delivery of evidenced based psychological practice.&lt;/p&gt;\n&lt;p&gt;This post is in the Southampton Division of Southern Health NHS Foundation Trust and there are currently 7 other Clinical Psychologists working with older people in the Trust. Regular clinical supervision will be provided and we also meet monthly as a group for neuropsychological supervision. There are close working relationships with Adult Mental Health Services and the University of Southampton, which is the base for the Doctorate in Clinical Psychology Course. There are opportunities to be involved in teaching Trainee Clinical Psychologists and for collaboration with other professionals and academic staff and participation in research.&lt;/p&gt;\n&lt;p&gt;Applicants will also be considered for other Clinical Psychologist vacancies within OPMH, Southern Health.&lt;/p&gt;\n&lt;p&gt;For further information, please do contact: Lauren Rooney Principal Clinical Psychologist on 07776151357 laurenrooney@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222856", "validThrough": "2020-11-11T23:59:59+0000"}