{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Equiv - NHS band 5/6"}}, "datePosted": "2020-10-26T10:05:49+0000", "description": "&lt;p&gt;We have an exciting opportunity for an Outpatients Nurse who is passionate about delivering excellent standards of care, to join our committed Outpatient/Pre Assessment Team at Rowley Hall Hospital and our new sister hospital Beacon Park.&lt;/p&gt;\n&lt;p&gt;This is a full-time position working 37.5 hours per week (including weekends) reporting to our Out Patients Manager.  Part time hours may be considered.&lt;br /&gt;Rowley Hall &amp; Beacon Park Hospital provides a high standard of care for elective surgical patients across a broad spectrum of specialties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will need to demonstrate:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An excellent high standard of clinical practice with excellent clinical outcomes&lt;br /&gt;An excellent ability to manage patients health and wellbeing across a complex pathway and changing caseload&lt;br /&gt;Develop excellent working relationships across the entire hospital&lt;br /&gt;Maintain excellent standards with infection control&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;It is essential that the applicant will have a:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Nurse qualification (NMC)&lt;/li&gt;\n&lt;li&gt;Comprehensive understanding of relevant and current clinical standards&lt;/li&gt;\n&lt;li&gt;Recent post qualification surgical experience&lt;/li&gt;\n&lt;li&gt;Knowledge in current national guidance around pre-optimizing patients prior to surgery&lt;/li&gt;\n&lt;li&gt;Experience of a team approach to care delivery&lt;/li&gt;\n&lt;li&gt;Proven ability to work effectively in a team environment and on own initiative as required.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills.&lt;/li&gt;\n&lt;li&gt;Demonstrable excellent customer service&lt;/li&gt;\n&lt;li&gt;Demonstrated computer skills.&lt;/li&gt;\n&lt;li&gt;Flexibility and adaptability to meet the changing needs of the service.&lt;/li&gt;\n&lt;li&gt;Proven organizational skills.&lt;/li&gt;\n&lt;li&gt;Confident and engaging telephone skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Technical Skills and Application:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Assessment of patients&lt;br /&gt;Assesses, plans, implements and evaluates nursing care in collaboration with patients and their careers using data collected from medical questionnaires, previous notes, telephone communications and face to face consultations.&lt;br /&gt;Identify individual patient requirements and plan an individualized care pathway&lt;br /&gt;Responsible for carrying out appropriate clinical interventions required to deliver comprehensive patient care&lt;br /&gt;Liaise with all departments to ensure pathway can be delivered&lt;br /&gt;Liaise with bookings team, consultants, anesthetists and theatre manager to ensure appropriate theatre allocation is applied&lt;br /&gt;Maintain accurate accounts of nursing treatment, care planning and delivery.&lt;br /&gt;Ensures Pre-admission statistics are correctly recorded for collection/evaluation/audit. &lt;br /&gt; Uses excellent communication skills to undertake pre and post-operative phone calls to ensure continuity for the patient&lt;br /&gt;Reports clinical concerns to relevant consultants and Out Patients Manager&lt;br /&gt;Liaises with GPs and health professionals for all patients which require a cancellation or postponement.&lt;br /&gt;Ability to empathize with patients and deal with difficult situations.&lt;br /&gt;Assisting Consultants to perform minor procedures within the Outpatients Department.&lt;br /&gt;Pre Assessment experience desirable but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt;If you are looking for your next move and want to join a friendly team with a real sense of community within the working environment, look no further. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return, we offer the successful candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days annual leave  plus 8 bank holidays (pro rata)&lt;/li&gt;\n&lt;li&gt;Private Healthcare&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Excellent Training and Development Opportunities&lt;/li&gt;\n&lt;li&gt;Subsidised Staff Restaurant at Rowley Hall&lt;/li&gt;\n&lt;li&gt;Free Off Site Parking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Hours: Full Time (37.5 hrs per week). Part time may be considered.&lt;br /&gt;Shifts: Variable to include early mornings, middle shifts, evenings and weekends&lt;br /&gt;Salary: Competitive. Dependent upon skills and experience. NHS pay scale Band 5/6&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke on Trent", "postalCode": "ST17 9AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.795", "longitude": "-2.12657"}}, "title": "Staff Nurse - Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241958", "validThrough": "2020-11-30T23:59:59+0000"}