{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum"}}, "datePosted": "2020-10-27T14:55:57+0000", "description": "&lt;p&gt;Consultant in Diabetes Endocrinology and General Internal Medicine&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will work 10 programmed activities for East Lancashire Hospitals NHS Trust. The job plan works on a 6 week cycle. Weeks 1 and 2 are wards and clinic and then weeks 3 to 6 are clinics only. There is a commitment to the emergency duties rota for general (internal) medicine including out of hours on call on a 1:21 rota.&lt;br /&gt;&lt;br /&gt;The department of Diabetes and Endocrinology provides a comprehensive service including a range of diabetes sub-specialty services on the two main hospital sites, two community hospital sites, and a number of other community sites. The service is supported by a team of 12 Diabetes Specialist Nurses along with Diabetes Specialist Dieticians and Podiatrists as well as a Diabetes Specialist Midwife. There is also a very active Clinical Trials Department supported by research nurses, admin and a medical team. Having been successful in our bid for national funding we are working to further expand the diabetes inpatient nursing and podiatry teams as well as increasing patient education in the community.&lt;br /&gt;&lt;br /&gt;We are a Teaching Hospital and also a Royal College of Physicians Future Hospital site. The Trust was established in 2003 and is a major acute Trust located in Lancashire, in the heart of the North West of England. The Trust employs 7,000 staff, some of whom are internationally renowned and have won awards for their work and achievements. We treat nearly three quarters of a million patients a year from the most serious of emergencies to planned operations and procedures using state-of-the-art facilities. &lt;br /&gt;&lt;br /&gt;Subsequent to a vision to improve clinical leadership and access to Consultant and Diabetes Specialist Nurse led services across the East Lancashire Health Economy we are developing a fully integrated diabetes service. Commitment to clinics off the main hospital sites will increase. The philosophy of the department is the prompt and effective implementation of evidence and national guidance into practice. The department is also recognised for its strength in clinical trials activities.&lt;br /&gt;&lt;br /&gt;The successful candidate would be encouraged to take on specific SPA roles as part of their 2.5 SPA per week.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Dr Raza Farheen - Consultant in Diabetes Farheen.Raza@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone - 01254 734633&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lancashire", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Consultant in Diabetes and Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245073", "validThrough": "2020-11-17T23:59:59+0000"}