{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc HCAS pro rata"}}, "datePosted": "2020-11-03T11:46:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Epilepsy Clinical Nurse Specialist– Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CNWL Hillingdon is looking for an enthusiastic and motivated individual to work within our Child Development Centre as an Epilepsy Nurse Specialist at Band 7. The epilepsy service is for children with additional needs between 0-19, referred for assessment, diagnosis and management of [suspected] epilepsy&lt;/p&gt;\n&lt;p&gt;This post will allow you to enhance your specialist nursing skills, knowledge and expertise in the care and management of children and young people with epilepsy.&lt;/p&gt;\n&lt;p&gt;As the successful post holder, you will work as part of the epilepsy team alongside consultant paediatricians who have extensive experience in the management of paediatric epilepsy.&lt;/p&gt;\n&lt;p&gt;You will participate in epilepsy clinics, which are run both within the Child Development Centre and also in three specialist schools in Hillingdon.&lt;/p&gt;\n&lt;p&gt;This post will also involve telephone triage / advice about epilepsy queries to our known patients, home visits, school visits, use of virtual platform and face to face interaction to provide education and training such as Buccal Midazolam training. You will also be involved in drafting personalised epilepsy care plans, supported by epilepsy practicing consultants. The aim is to ensure that children, young people and families are empowered for better management of their epilepsy and maximise quality of life.&lt;/p&gt;\n&lt;p&gt;You will have plenty of wonderful opportunities to vertically collaborate with Primary care service, Secondary care service in Hillingdon Hospital and Tertiary epilepsy services. The post holder will act as a specialist resource to advance knowledge and improve epilepsy care within the multi-disciplinary team and multi-agency team.&lt;/p&gt;\n&lt;p&gt;You will play a key role in embedding good evidence-based epilepsy practice in line with NICE guidelines by liaising locally and regionally.&lt;/p&gt;\n&lt;p&gt;Your role will be pivotal in facilitating new epilepsy patients’ data to the Trust and to the Epilepsy 12 national audit.&lt;/p&gt;\n&lt;p&gt;You will have opportunities to take part in the local and regional teaching platforms as a part of your continuous professional development.&lt;/p&gt;\n&lt;p&gt;The Trust is keen to support the personal development of staff and various training is provided to assist your career pathway, including undertaking all statutory and mandatory training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kate Barker&lt;/p&gt;\n&lt;p&gt;Job title CDC Team Lead&lt;/p&gt;\n&lt;p&gt;Email address kate.barker3@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01895 488788&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Child Development Centre, Woodlands Centre, Hillingdon Hospital, Hillingdon", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Paediatric Epilepsy Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253815", "validThrough": "2020-11-17T23:59:59+0000"}