{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17434", "minValue": "17434", "unitText": "YEAR", "value": "£17,434 pa (70% of band 5)"}}, "datePosted": "2020-11-03T10:44:22+0000", "description": "&lt;p&gt;The ICT Department of Mid Cheshire Hospitals NHS Trust is looking to recruit a Level 4 Apprentice Network Technician who will be the pivotal in the support, development and security of the Trust’s IT Infrastructure.  Particularly around the performance and security of our Cisco network.&lt;/p&gt;\n&lt;p&gt;Your attitude, presence and knowledge will make a difference to how IT is seen but more importantly how you get issues resolved quickly and effectively.&lt;/p&gt;\n&lt;p&gt;You will work with the Trust’s Network Manager to ensure the Trust’s network remains reliable and secure and will assist in rolling out and configuring the latest Cisco devices.  You will assist in the segmentation of the Trust’s network using Cisco Trustsec and ensuring network devices are regularly patched in agreed maintenance windows.&lt;/p&gt;\n&lt;p&gt;You must have the ability to quickly learn and assimilate information and be resilient when something unknown crops up. The ability to communicate and document processes is a key requirement.&lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a current driving license, be a car owner and live within reasonable traveling distance of Leighton Hospital. On successful completion of the Apprenticeship, the role will also contribute to the ICT Department’s on-call rota.&lt;/p&gt;\n&lt;p&gt;We do not save lives but are committed to supporting those that do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This vacancy is 37.5 hours per week, It is a Modern Apprentice - Level 4 where you will be paid 70% of band 5 salary. Full band 5 salary will be paid on completion of the Apprenticeship.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements/qualifications are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Level 3 NVQ Qualification&lt;/p&gt;\n&lt;p&gt;- A full UK Driving License&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Network Technician Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253508", "validThrough": "2020-12-16T23:59:59+0000"}