{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus"}}, "datePosted": "2020-11-05T10:46:04+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in Barking and Dagenham Children&#39;s Speech and Language therapy service for a fixed term highly specialist Speech and Language therapist to support school aged children across Language ARPs and mainstream school service to cover a maternity leave.&lt;/p&gt;\n&lt;p&gt;The post holder will independently manage a caseload of children referred with DLD and other speech, language and communication needs, and support a team of B4 B5 and B6s working in this Pathway.&lt;/p&gt;\n&lt;p&gt;The post holder will provide clinical supervision and second opinions to less experienced members of staff. The post holder will be responsible for ensuring outcome measures are embedded across the team and will contribute to service development. They may be required to deputise for the Clinical Lead in their absence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHadassah LevJob titleClinical Team LeadEmail addresshadassah.lev@nelft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Laura Vaccari&lt;/p&gt;\n&lt;p&gt;laura.vaccari@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Children and Family Centre, Barking", "postalCode": "IG11 7LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5356", "longitude": ".079367"}}, "title": "Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257304", "validThrough": "2020-11-19T23:59:59+0000"}