{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 excluding HCA"}}, "datePosted": "2020-10-30T10:50:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking to start a nursing career in General Practice? Would you like the opportunity to study for a General Practice Nursing qualification at a practice in Enfield?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Education England’s General Practice Nursing Academic Programme package offers:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tenure:&lt;/strong&gt;      &lt;/p&gt;\n&lt;p&gt;A 1 year fixed-term training contract as a General Practice Nurse with a view to on-going employment.&lt;/p&gt;\n&lt;p&gt;An academic award (BSc/Post graduate diploma) in General Practice Nursing&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Band 5 equivalent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Education England across London&lt;/strong&gt; in partnership with London Training Hubs (formerly CEPNs) and local General Practices are funding a General Practice Nursing (GPN) academic programme package across London.&lt;/p&gt;\n&lt;p&gt;The GPN academic programme package, starting January/February 2021 is ideal for newly qualified nurses looking to develop a career in General Practice nursing, or for experienced nurses looking to make a transition into General Practice.&lt;/p&gt;\n&lt;p&gt;The GPN programme offers you employment in General Practice with supervision and at the same time, the opportunity to study for a BSc or Post Graduate Diploma in General Practice Nursing at The University of Hertfordshire.&lt;/p&gt;\n&lt;p&gt;By the end of the programme, you will have acquired a comprehensive grounding in General Practice Nursing. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Course details:&lt;/strong&gt; Pg Dip/Msc Specialist Community Nursing – General Practice Nursing&lt;/p&gt;\n&lt;p&gt;We are looking for nurses who want to bring a strong nursing component to General Practice, working in partnership with patients, GP colleagues and the wider primary care team.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be self-starters, with enthusiasm and confidence to develop their role in the complex and rewarding context of General Practice.&lt;/p&gt;\n&lt;p&gt;The Training Hub that you apply to is responsible for the recruitment process. This includes shortlisting, interviews and the offer process including pre-employment checks&lt;/p&gt;\n&lt;p&gt;The practice you will be based at is the Nightingale House Surgery, Enfield.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "North Central London Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Enfield", "postalCode": "EN4 0DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6508", "longitude": "-.148133"}}, "title": "General Practice Nurse Training Scheme", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249816", "validThrough": "2020-11-13T23:59:59+0000"}