{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Remuneration Package"}}, "datePosted": "2020-11-06T10:00:26+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our Board of Directors here at South Tyneside &amp; Sunderland NHS Foundation Trust. Providing strong corporate and strategic leadership our new Director will drive our culture of innovation and productivity and will be critical to the delivery of our improvement plans, ensuring we have robust financial management systems and processes aligned to our clinical priorities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be an inspirational leader with vision, adaptability and excellent communication skills who will bring a proven track record of financial performance improvement and of engaging and empowering service leads in their accountability for budget control.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have demonstrable experience of working successfully at Board level, or with regular exposure to the Board as well as working with NHS regulatory bodies. You will thrive in a dynamic environment working with a committed Board and with key stakeholders to develop innovative, sustainable solutions to the challenges of a changing health economy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will act as the Senior Information Risk Owner on behalf of the organisation and will also be a Shareholder Representative on the board of CHoICE, our subsidiary company.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At STSFT we are passionate about attracting, developing and retaining an inclusiveand diverse workforce and recognise the importance of diversity, promoting equality and challenging discrimination. We welcome and encourage job applications from people of all backgrounds particularly those from disabled and Black, Asian and Minority Ethnic (BAME), Lesbian, Gay, Bisexual, Trans and non-binary candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to discuss the position in further detail with Ken Bremner, Chief Executive, please contact Vicky Hardy on 0191 565 6256 ext 42404 or by email to vicky.hardy@chsft.nhs.uk to arrange a convenient time.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will undertake a series of online psychometric tests. The selection process will be in two stages the first will take place on 25 November 2020 and for those candidates who progress to final interview these will be held on 01 December 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121061.jpg", "name": "South Tyneside and Sunderland NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121061"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sunderland", "postalCode": "SR4 7TP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9024", "longitude": "-1.41015"}}, "title": "Executive Director of Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259129", "validThrough": "2020-11-13T23:59:59+0000"}