{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-29T14:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Guideline Administrator – Women &amp; Children’s Care Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Band 3 (subject to A4C) Guidelines Administrator to join the Women &amp; Children’s Care Group at The Princess Royal Hospital in Telford. The post holder will support the Clinical Governance teams for Paediatrics, Gynaecology and Neonates. This newly-created, permanent post is for 11 hours to be worked over 2 days.&lt;/p&gt;\n&lt;p&gt;As first point of contact for staff dealing with Guidelines, Standard Operating Procedures, Patient information Leaflets and supporting documents for the Care Group, we are looking for an enthusiastic and motivated individual, who is committed to supporting the Guideline Leads and Authors in producing and developing Trust guidance by integrating them into local clinical practice.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to support the teams by attending their monthly Guideline and Clinical Governance meetings, where you will develop clear action plans and progress accurate systems to monitor the current status of guidance and other documents in line with the Trust’s standard. The successful candidate will be confident in verbally providing updates to the Governance and Guidelines teams during meetings.&lt;/p&gt;\n&lt;p&gt;The individual will also support the teams in formatting, archiving and recording documents, sending them for final ratification at Clinical Governance meetings. Acting as a ‘gatekeeper’ for all documents, the post holder will be responsible for uploading them to the Trust’s intranet using the Document Library and PUNCH systems.&lt;/p&gt;\n&lt;p&gt;The person we are looking for will have excellent communication skills, as you will be working within a diverse team and working collaboratively with Consultants and Nursing staff at all levels, liaising with other administrative staff as required,&lt;/p&gt;\n&lt;p&gt;The successful individual must also be able to demonstrate the ability to work independently, proactively and be highly organised, with proven experience at working under pressure, coping with frequent interruptions during periods of concentration. Experience of project work is desirable, but not essential. The post holder must be able to prioritise their own workload, ensuring they meet agreed deadlines alongside constant demands. It is essential that the candidate can work flexibly due to meeting dates sometimes changing at short notice.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Carol Binsley&lt;/p&gt;\n&lt;p&gt;Job title: Acting Administration Manager&lt;/p&gt;\n&lt;p&gt;Email address: carol.binsley@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01952 641222 Extn 5984&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Subject to Agenda for Change&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Guidelines Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248739", "validThrough": "2020-11-11T23:59:59+0000"}