{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T22:00:32+0000", "description": "&lt;p&gt;This is an exciting opportunity to further develop the provision of evidenced-based psychological therapies within a secondary care psychological therapies service that is integrated with the local CMHT, recently relocated to a newly refurbished building in Gillingham High Street. It is part of a Trust (rated Good overall by the CQC and Outstanding for care) that has 3,283 staff working in 66 buildings across 33 locations, covering an area of 1,450 square miles.&lt;/p&gt;\n&lt;p&gt;Intent on bringing innovative ideas into practice, this service is forward thinking and flexible in providing a high quality psychological therapy service to adults who experience severe and enduring mental health difficulties. The Trust is currently implementing its new clinical care pathways for people with Enduring Conditions (eg psychosis) and Personality Disorders in line with NICE Guidelines. This is supported with significant training funding from Health Education England and a key objective for a Trust that prides itself on innovation and research.&lt;/p&gt;\n&lt;p&gt;You would be part of a friendly team of 8 psychological therapists in secondary care, with practitioners in clinical and counselling psychology, psychotherapy, CBT and systemic therapy. You would be responsible for offering high quality interventions in both individual and group formats across a range of severe psychological difficulties. There will be plenty of scope and backing to develop your own practice, whilst providing a highly professional service within the context of community services. Consultation, supervision and teaching to staff in the multi-disciplinary team will be an important aspect of the post therefore experience of those roles would be advantageous but experience within secondary care itself is expected where complexity and higher levels of risk are the norm. A flexible and creative approach to psychological practice is important and being able to establish strong working relationships with other professionals is critical in what is a challenging environment.&lt;/p&gt;\n&lt;p&gt;The Psychological Therapy Service in Medway is committed to providing professional support and supervision in the development of its staff. The Service has good links with the Christchurch Canterbury University Doctoral Training Course in Clinical Psychology based at David Salomon’s House and regularly provides clinical placements to clinical psychologists in training. Similar training placement links are currently operating for example with IFT (Institute of Family Therapy) and the Tavistock Clinic for master’s level trainees.&lt;/p&gt;\n&lt;p&gt;More broadly there are exciting times ahead in 2020-21 when the Kent and Medway Medical School is set to open, increased collaboration between Canterbury Christ Church University and the University of Kent with KMPT one of the NHS partners, inspiring the next generation of medical professionals and allied professionals to provide ever increasing professional opportunities for psychological staff.&lt;/p&gt;\n&lt;p&gt;We are also at the forefront of partnership working, an integral part of the Sustainability and Transformation Partnership, looking at the way forward for sustainable health and social care.&lt;/p&gt;\n&lt;p&gt;If you are applying as a Counselling or Clinical psychologist you will have a doctorate-level or equivalent BPS approved qualification in Clinical or Counseling psychology, will hold HCPC registration and are likely to be chartered.&lt;/p&gt;\n&lt;p&gt;If applying as a psychotherapist you will need a post graduate training to Master’s Level in Psychoanalytic Psychotherapy and registered with UKCP (or equivalent) or in CBT and registered with BABCP.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Peter Holloway, Consultant Psychotherapist&lt;/p&gt;\n&lt;p&gt;Email: peter.holloway4@nhs.net, Telephone: 01795 418359&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Britton House, Britton Farm, Gillingham", "postalCode": "ME7 1AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3885", "longitude": ".544437"}}, "title": "Clinical or Counselling Psychologist or Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255015", "validThrough": "2020-11-18T23:59:59+0000"}