{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-28T11:15:31+0000", "description": "&lt;p&gt;Consultant in Emergency Medicine&lt;/p&gt;\n&lt;p&gt;West Suffolk Hospital NHS Foundation Trust is seeking Consultants to join the Emergency Department.&lt;/p&gt;\n&lt;p&gt;Are you interested? Do you have outstanding Core Emergency Medicine skills? Do you have additional skills (or the desire to develop them) which could benefit a specific cohort of patients or a specific aspect of our organisation? Do you have a special interest you’d like to be supported to develop?&lt;/p&gt;\n&lt;p&gt;We are looking for outstanding clinicians, and we’d also like people interested in anything from admission prevention to ultrasound, via clinical governance, medical leadership or teaching. If you are interested – so are we!&lt;/p&gt;\n&lt;p&gt;Applications are invited from motivated Consultants in Emergency Medicine or those within 6 months of CCST or equivalent to join our Emergency Medicine team.&lt;/p&gt;\n&lt;p&gt;We have an excellent teaching and research base. Our undergraduate and post-graduate medical education programmes delivered jointly with Cambridge University are popular and consistently achieve excellent results.&lt;/p&gt;\n&lt;p&gt;West Suffolk NHS Foundation Trust provides hospital and some community health care services, serving a predominantly rural geographical area of 600 square miles with a population of approximately 280,000 and employing over 2,900 staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Ravi Ayyamuthu, Associate Clinical Director, on 01284 713000 Ext: 2700&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Wednesday, 25th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Friday, 8th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome. However, Non-EEA candidates who require Tier 2 sponsorship may not be shortlisted or appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post, as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Border Agency requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill this post. For further information please visit the UK Border should be on or eligible for inclusion onto the GMC Specialist Register for Full and specialist registration (and with a license to practice) with the General Medical Council (GMC) in Anaesthesia, or be eligible for registration (within six months of interview).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246240", "validThrough": "2020-11-25T23:59:59+0000"}