{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267 pa"}}, "datePosted": "2020-10-29T16:16:04+0000", "description": "&lt;p&gt;Due to maternity leave an exciting opportunity has arisen for an experienced, dynamic, motivated nurse, who has an interest in Colorectal Nursing and Stoma Care . If you would like to gain Colorectal Cancer and Stoma knowledge, experience and exposure to this interesting speciality we have a maternity cover position. This is a full time position but part time would be considered.&lt;/p&gt;\n&lt;p&gt;We are a cohesive and dynamic colorectal nursing team dedicated to providing excellent cancer and stoma care across our hospital sites; Stoke Mandeville, High Wycombe, Amersham and Chalfont Hospital and the community.&lt;/p&gt;\n&lt;p&gt;If you are a team player, able to work independently, self- motivated, patient focused, amenable and flexible then you are just what we are looking for to join our team.&lt;br /&gt;&lt;br /&gt;As a key member of the specialist multidisciplinary team you will support patients through their diagnostic and treatment pathway responding to patient care and support patient needs using an holistic assessment framework, mostly in the hospital setting with occasional community input.&lt;br /&gt;&lt;br /&gt;As a colorectal/stoma nurse you will manage a caseload with support and leadership from your team leader. You will work collaboratively with colleagues and liaise with healthcare professionals both within the hospital and community setting.&lt;br /&gt;&lt;br /&gt;You will need to be a confident person with excellent communication and interpersonal skills and be able to demonstrate that you are highly motivated, professional with a willingness to continually provide a high standard of care to our colorectal cancer and stoma patients.&lt;br /&gt;Training and education will be provided to develop and build on your existing knowledge.&lt;/p&gt;\n&lt;p&gt;To gain insight into what the role entails an informal visit is highly recommended.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gail Varley - Colorectal/Stoma Nurse Special Team Leader&lt;br /&gt;Tel 01494 426235&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville, Stoke Mandeville", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Colorectal Stoma Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249048", "validThrough": "2020-11-12T23:59:59+0000"}