{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc HCA"}}, "datePosted": "2020-10-30T08:16:18+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in the Quality &amp; Assurance Directorate at Guys &amp; St Thomas NHS Foundation Trust. We are looking for an excellent, dynamic and driven Clinical Data Analyst to provide expert analysis and quality oversight for the Trust.&lt;/p&gt;\n&lt;p&gt;This post is based in the Risk and Assurance Department of the Quality and Assurance Directorate, currently located in the head offices at Great Dover Street near the Guy’s Hospital Site in London.&lt;/p&gt;\n&lt;p&gt;As part of the Medical Director&#39;s team the Directorate supports the Trust&#39;s delivery of Patient Safety, Quality Assurance, Clinical Governance and Risk Management to improve safety and quality of care for patients, visitors and staff.&lt;/p&gt;\n&lt;p&gt;The main work areas of the Quality and Assurance team include coordinating Trust wide accreditation, advising on legal and regulatory compliance, Care Quality Commission registration and assurance, quality improvement through identification of unwarranted variation, clinical governance and audit, aiding learning from complaints, claims and incidents, reducing clinical and non-clinical risk, complaints resolution, providing legal services and ensuring good staff health at work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are three main parts to this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead on analysis and reporting as per the Trust-wide quality and performance framework, specifically assurance reporting relating to all Quality &amp; Assurance work areas, covering patient safety, clinical governance and risk.&lt;/li&gt;\n&lt;li&gt;Lead in the design, development and testing of Business Intelligence dashboards to ensure continued oversight of internal and external quality performance metrics across the Trust.&lt;/li&gt;\n&lt;li&gt;Undertake bespoke quality improvement projects and analysis of both qualitative and quantitative data across all work areas to identify change in performance, adverse trends, or areas of improvement for the Trust.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A keen eye for detail and strong interpersonal skills are essential for this role. The post holder must have expert IT and data analysis skills. They will be required to work autonomously and with their own initiative to proactively analyse quality and safety data to continuously identify areas for improvement.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to have some knowledge of quality assurance on key areas of clinical governance and safety, and ideally have experience working with business intelligence tools as well as local risk management systems.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you if you meet these requirements and ready to join a dynamic, quality driven team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharles MartinJob titleHead of Risk &amp; Quality AssuranceEmail addressCharles.Martin@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guys &amp; St Thomas&#39; NHS Foundation Trust Offices, London", "postalCode": "SE1 4YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5006", "longitude": "-.092475"}}, "title": "Senior Clinical Data Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249338", "validThrough": "2020-11-09T23:59:59+0000"}