{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T10:49:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Equality, Diversity and Inclusion Lead - Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Edward Jenner Court / Invista (TBC)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £45,753 - £51,668&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 x Fixed Term contract opportunity for up to 12 months (reviewable)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Internal applicants who wish to be considered for a secondment opportunity should discuss with their line manager the suitability of a possible secondment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking to push the boundaries on equality, diversity and inclusion? This new role presents a great opportunity to make a positive difference within Gloucestershire.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reporting directly to the Director of HR &amp; Organisational Development you will work closely with other Board members, senior clinical/non-clinical leaders and the OD team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a great time to be joining us 12 months after the successful merger of two innovative and well-rated organisations whose values co-created by staff and stakeholders are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Working Together I Always Improving I Respectful and Kind I Making a Difference&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to building a truly diverse and inclusive workforce, with a second to none culture, alongside great networking and connectivity throughout our local community groups. While we’ve made some solid progress with this agenda we need to do better. Some of the key things we are doing on our improvement journey include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Rolling out a Valuing Difference Leadership strategy&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Working in partnership with the Leadership Academy to pilot an NHS staff Reciprocal Mentoring programme, which is now being extended across our local Integrated Care System (ICS)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Working with local community groups on a community-based and owned Reciprocal Mentoring scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Developing our Diversity Network, with its four-subgroup network – for women, BAME, LQBTQ+ and disabled colleagues&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Launching a new entrance, middle and senior management Leadership Development programme in early 2021 with inclusion as a core focus.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will bring your experience to assist our brilliant OD team with these and to help us develop other evidence-based approaches.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As our equality, diversity and inclusion lead, you will have the energy, passion and skills to positively drive change, challenge and influence behaviours, practices and culture, holding a critical role in the development of a diverse and inclusive workforce and culture. You will be a strong advocate for Just Culture and social justice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With a highly developed specialist knowledge of workforce issues, law and good practice relating to equality, diversity and inclusion, you will have either a masters in a relevant field, or equivalent experience, or through a degree and professional qualification in a relevant field plus additional training or equivalent experience. Your passion for continuing professional development – for yourself and others -- will be second to none&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For the full details of this new role please check out the details in the job description and person specification. We would be happy to consider secondments, job share and flexible working for this role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact the Director of HR and OD, &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Neil.Savage@ghc.nhs.uk&lt;/strong&gt;&lt;strong&gt; , or on 07966 130653&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are keen to develop a more representative diversity of our senior staff and particularly encourage applications from those individuals with protected characteristics - in particular from BAME, LGBTQ and disabled candidates.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 11th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need; therefore, we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff, the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL2 0LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8743", "longitude": "-2.20761"}}, "title": "Equality, Diversity and Inclusion Lead - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253562", "validThrough": "2020-11-29T23:59:59+0000"}