{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T12:46:16+0000", "description": "&lt;p&gt;We have an exciting opportunity to enhance your leadership and clinical skills as Sister/charge nurse at Oakwood Unit. The job holder will be able to provide decisive and effective clinical input and can demonstrate leadership qualities, effective communication skills, a flexible approach and an ability to work under pressure, both as part of a team and independently.&lt;/p&gt;\n&lt;p&gt;The post will be part of a Multi-Disciplinary Team which will offer assessment and treatment for patients in Oakwood Unit – a Community Hospital Ward within the Prospect Park Hospital site. The post holder will be expected to.&lt;/p&gt;\n&lt;p&gt;The post holder will provide clinical leadership and clinical advice for the ward team through supervision, education of students, nurses, Multi Therapy Assistants, Health Care assistant and other members of the interdisciplinary team.&lt;/p&gt;\n&lt;p&gt;You will be able to identify service development needs, contribute to the planning, development and evaluation of the service and have responsibility for defined projects.&lt;/p&gt;\n&lt;p&gt;In return we offer great career development opportunities, a fantastic team to work with, a very pleasant working environment and flexible approach to work to meet the need of work life balance, access to onsite Gym, onsite restaurant and also free car parking for staff.&lt;/p&gt;\n&lt;p&gt;For further information please contact Saijai Jankowski, Unit Manager on 01189 605933.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Ward Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257711", "validThrough": "2020-11-29T23:59:59+0000"}