{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62286", "minValue": "48859", "unitText": "YEAR", "value": "£48,859 - £62,286 per annum (pro rata)"}}, "datePosted": "2020-10-23T17:40:11+0100", "description": "&lt;p&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/p&gt;\n&lt;p&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website&lt;/p&gt;\n&lt;p&gt;We are currently seeking to expand the workforce in our Local Knowledge and Intelligence Service (LKIS) and Field Services (FS) teams, to support us in our response to the COVID-19 pandemic. We are looking for data analysts and scientists, epidemiology scientists, knowledge transfer specialists, knowledge and evidence specialists and project managers from a wide range of backgrounds to bring their knowledge, skills and expertise to our teams.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an executive agency of the Department of Health and Social Care, and a distinct organisation with operational autonomy. We provide government, local government, the NHS, Parliament, industry and the public with evidence-based professional, scientific expertise and support.&lt;/p&gt;\n&lt;p&gt;We are responsible for: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Improving the health of the whole population &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Protecting the nation from public health hazards &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Preparing for and responding to public health emergencies &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supporting local authorities and the NHS to plan and provide health and social care services such as immunisation and screening programmes &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Developing the public health system and its specialist workforce &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Researching, collecting and analysing data to improve our understanding of public health challenges and come up with answers to public health problems. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do this through world-leading science, knowledge and intelligence, advocacy, partnerships and providing specialist public health services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do LKIS and Field Service do?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PHE’s &lt;em&gt;Local Knowledge and Intelligence Service (LKIS)&lt;/em&gt;, part of the Health Improvement directorate in Public Health England (PHE), is a distributed national service with seven analytical teams working locally as part of an integrated function at PHE Region level.&lt;/p&gt;\n&lt;p&gt;The overall aim of the service is to support and advocate for effective local public health action, through the delivery ofhigh qualitytools and products, analysis, expert advice and training. The service is available to local authorities and other population health partners.&lt;/p&gt;\n&lt;p&gt;LKIS’ work is built around three core areas of practice:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;being an expert knowledge broker to local systems&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;working in partnership to develop local capacity and capability&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;developing innovative approaches to, and advocating for, the use of data and evidence for better local decision making&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;PHE’s Field Service &lt;/em&gt;is a national service comprising geographically dispersed, multi-disciplinary teams integrating expertise in Field Epidemiology, Real-time Syndromic Surveillance, Public Health Microbiology, and Food, Water and Environmental Microbiology to strengthen the surveillance, intelligence and response functions of PHE. The Field Service also leads and coordinates the Global Health work of PHE’s National Infection Service working with the Global Public Health Team and will lead and coordinate the national aspects of PHE’s port health functions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The posts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The expansion of LKIS and FS will enable us to meet our commitment to support local public health systems ensuring a rapid, responsive and flexible response to COVID-19 in their localities, by providing timely and granular data, intelligence, evidence and analysis to local partners.&lt;/p&gt;\n&lt;p&gt;Below there is a list of roles which are currently available. Please use the application questions to specify the role(s) for which you wish to be considered for, e.g. RoleA,B,C etc and indicate at the beginning of your personal statement your top three preferred regional bases. Successful candidates will, where possible, be allocated to one of our teams based on your preference, your skills and our needs.&lt;/p&gt;\n&lt;p&gt;Many of the LKIS and FS roles require common, or similar skillsets, so you may wish to apply for one orboth of the posts. Many of these roles are being offered in different regions around the country, see the table below.&lt;/p&gt;\n&lt;p&gt;To help you decide which roles you may wish to apply for, a summary of the roles is provided in the Candidate Information Pack that accompanies this advert. Please also refer to the attached Job Descriptions for the essential criteria.&lt;/p&gt;\n&lt;p&gt;Roles:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role A&lt;/strong&gt; - &lt;strong&gt;Principal Data Scientist (LKIS)&lt;/strong&gt; – &lt;strong&gt;Base&lt;/strong&gt;: Newcastle, York, Leeds, Liverpool, Manchester, Birmingham, Nottingham, Cambridge, Chilton, Fareham, Bristol, London &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role B&lt;/strong&gt; - &lt;strong&gt;Principal Public Health Intelligence Analyst (LKIS)&lt;/strong&gt; -  &lt;strong&gt;Base&lt;/strong&gt;: Newcastle, York, Leeds, Liverpool, Manchester, Birmingham, Nottingham, Cambridge, Chilton, Fareham, Bristol, London &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role C&lt;/strong&gt; - &lt;strong&gt;Principal Knowledge Transfer Specialist (LKIS)&lt;/strong&gt; – &lt;strong&gt;Base&lt;/strong&gt;: Newcastle, York, Leeds, Liverpool, Manchester, Birmingham, Nottingham, Cambridge, Chilton, Fareham, Bristol, London &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role D&lt;/strong&gt; - &lt;strong&gt;Senior Epidemiology Scientist (FS)&lt;/strong&gt; – &lt;strong&gt;Base&lt;/strong&gt;: Newcastle/Leeds, Nottingham/Birmingham, Bristol, Liverpool, London &lt;/p&gt;\n&lt;p&gt;Successful candidates not offered a post will be placed on the reserve list which will be held for 12 months. These further posting offers will also be made in strict merit order&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible, National", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Public Health England Recruitment to LKIS &amp; Field Service Teams (G7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241454", "validThrough": "2020-11-08T23:59:59+0000"}