{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-06T14:31:17+0000", "description": "&lt;p&gt;At The Dudley Group NHS Foundation Trust, our patients and staff are at the heart of all that we do to offer a high quality patient experience in a caring and supportive environment. This aligns with our vision of providing safe, caring and effective services because people matter.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, enthusiastic administration assistant to work within the Trust Secretary Team. This is an opportunity to join an NHS organisation that inspires its staff to innovate, with support and encouragement to continually develop. In return you will have the opportunity to inspire exemplary support for our patients.&lt;/p&gt;\n&lt;p&gt;We expect all of our staff to demonstrate the Trust values of Care, Respect and Responsibility.&lt;/p&gt;\n&lt;p&gt;We believe healthcare is better when provided by supported and dedicated staff, so if you are innovative, forward thinking and dedicated to high quality patient care come and join our amazing team.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, enthusiastic administration assistant to work within the Trust Secretary Team based at Russells Hall Hospital in Dudley. This is a part time post working 18.75 hours per week (Monday to Friday), with the option for flexible working.&lt;/p&gt;\n&lt;p&gt;You should have a sound knowledge of administration processes and able to provide a professional, competent secretarial/administrative service to the Board Secretary, Deputy Board Secretary and support the wider Board Secretary Team. You must have proven skills and the ability to work without direct supervision, be able to prioritise and manage workloads. You will be the first point of contact and communication from colleagues across the Trust, members of the public, the Council of Governors and outside agencies. NHS experience is not essential as full training would be given.&lt;/p&gt;\n&lt;p&gt;Our Trust gives its staff a voice and empowers its employees to be involved in service innovation and change as well as achieving their personal goals and aspirations. We want staff to always feel valued and respected and know they can make a difference to our patients.&lt;/p&gt;\n&lt;p&gt;As a responsible employer we strive to promote a healthy and safe environment and to ensure a positive experience for all. We work hard to create a culture of engagement and inclusivity where colleagues believe in and live by our values. We engage with our staff in an open and transparent way by listening, being honest and working together to achieve our aims. We firmly believe in the ability of our colleagues to help us shape our services so that our values are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;Be part of our journey of continuous improvement, come and join us at The Dudley Group.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Board - Deputy Trust Secretary&lt;/p&gt;\n&lt;p&gt;Email address: helen.board@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 321124&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Governance Administrative Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260140", "validThrough": "2020-11-20T23:59:59+0000"}