{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-02T16:54:49+0000", "description": "&lt;p&gt;Cardiology Staff Nurse - Bournemouth - Salary - £30k circa (Dependent on experience and skillset) – Full Time (Part-time hours can be considered).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you want to work in an environment where you have the time to dedicate time &amp; care to your patients? Do you want to work for the UKs not for profit healthcare provider? If so, Nuffield Health is looking for a Theatre Practitioner at our Nuffield Health Bournemouth Hospital. Get in touch or apply today! For a confidential chat please email daen.fox@nuffieldhealth.com where we can answer any questions or if of interest arrange an informal site visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Founded in 1957, Nuffield Hospital Bournemouth is an exceptionally caring environment with 41 beds, 3 theatres an endoscopy room and 4 treatment rooms. Our service provision is varied, covering everything from outpatients and minor procedures through to major surgical specialities. &lt;br /&gt; &lt;br /&gt;Nuffield Health Bournemouth opened a new Cardiac Catheter Lab in September 2015 and has done around 1500 procedures since opening. Our EP service began in 2017 expanding further the range of interventional procedures. We also have also a cardiac rehabilitation program in place and are working towards accreditation for our private patients.  &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The opportunity&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a staff nurse with Cardiology and/or Cath Lab or Interventional Radiology experience. If you are wanting to expand your skills, grow your career and rotate into all areas of the patient journey then this is the job for you.&lt;/p&gt;\n&lt;p&gt;As a Cardiology Staff Nurse duties include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a specialist private cardiac service to patients requiring diagnostic and interventional procedures involving angiography, angioplasty, electrophysiology and pacemakers.&lt;/li&gt;\n&lt;li&gt;Being involved in the whole patient journey from pre-assessment to discharge ensuring patients individual needs are met and planned accordingly. &lt;/li&gt;\n&lt;li&gt;Acting as scrub nurse to Consultant Cardiologists and promote and maintain a caring and highly professional standard of nursing, meeting the needs of the patients undergoing Cath Lab procedures. &lt;/li&gt;\n&lt;li&gt;Working with the cardiology ward/recovery staff ensuring patients are admitted and prepared for Cath Lab procedures ensuring appropriate investigations are done and accurately recording documentation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The person&lt;/p&gt;\n&lt;p&gt; To succeed as a Cardiology Staff Nurse, you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be an an RGN with post registration experience.&lt;/li&gt;\n&lt;li&gt;Experience of working in a Cardiac Catheter lab/Interventional Radiology or in a Cardiology environment.&lt;/li&gt;\n&lt;li&gt;Initiative to manage your own clinical workload within a small team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;Key information about the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Nuffield Cardiac Nurse, you’ll get to enjoy the real respect, rapport and effective working of a close-knit team in a brand new department, while benefiting from support and training opportunities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary – 30k circa&lt;br /&gt;Location – Bournemouth&lt;/p&gt;\n&lt;p&gt;Weekly Hours - 37.5 (between 8-6 Monday to Friday). On-call rate applies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH1 1RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7304", "longitude": "-1.87092"}}, "title": "Staff Nurse - Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252941", "validThrough": "2020-11-30T23:59:59+0000"}