{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-16T11:31:16+0100", "description": "&lt;h2&gt;&lt;span&gt;Clinical Practice Lead – First Response Service&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Are you someone looking to start a career in one of the UK’s most respected mental health trusts?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you an experienced senior mental health clinician looking for a new challenge and opportunity to join an exciting newly commissioned service?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Can you work with people experiencing a mental health crisis, their families and carers, providing evidence-based interventions?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Would you like to experience life in one of the UK’s most beautiful areas, with exciting cities, charming countryside and magnificent coastlines?&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Clinical Practice Lead to join the First Response Service team based in Exeter. We are seeking to recruit a number of experienced, visionary and motivated individuals to join our mental health First Response Service, an exciting newly commissioned service based in Exeter. The team promotes a dynamic and innovative way of working, triaging and responding to crisis referrals. The role encompasses the NHS principle; right care, right time and right place. The First Response Service triages mental health crisis calls and referrals, providing tele-coaching psychological interventions, support, guidance and signposting. The service further delivers timely and responsive face to face assessments where indicated.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is an excellent opportunity for the right candidate to further develop a solid and rewarding career within an accolade winning mental health trust. The First Response Service is growing and evolving, delivering a high quality mental health service to many people. Clinically leading front line staff will make a difference to people’s lives from the moment you join us.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will support you to learn the skills you need to thrive in the role, offering you the training and developmental support you need to begin a fulfilling career.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Devon Partnership NHS Trust is growing as we establish ourselves as one of the leading providers of mental health services in the country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;£38,890 - £44,503 per annum pro rata (band 7)&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About you &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;This is an ideal post for either an experienced Senior Mental Health Practitioner wanting to professionally develop or a current clinical lead who is seeking a change of direction. In this important role you will use your extensive clinical skills and experience as a mental health practitioner to lead on high quality care, developing and sustaining compassionate leadership. Using evidence based practice and routine outcome measures you will use a strength-based approach to work collaboratively with all stakeholders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leading on assessing and managing risk is a core part of this role, responding to urgent need. You will be required to work a 24/7 shift pattern to meet the needs of the service. Supervision of more junior staff and trainees is expected to be part of your role as you share your skills and knowledge with those around you. We will support you to develop the skills required to thrive in this role and provide training with developmental support to pursue a fulfilling career.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;The location&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Exeter&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About us&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be part of a team that is compassionate, supportive and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;span&gt;Our offer to you&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. If you are looking to relocate tothefabulous county of Devon we have a relocation package that may be suitable for you.&lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;br /&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to flexible working&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Individual personal development plans and a commitment to ongoing training - including opportunities to work in different services to build your experience and skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good maternity, paternity and adoption benefits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Childcare voucher scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health service discounts and online benefits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Incremental pay progression&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Free confidential employee assistance programme 24/7&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our LGBTI+ network&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health and wellbeing opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to Work Scheme and reduced public transport rates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Structured learning and development opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span&gt;Living here&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;The First Response Service team is located in Exeter&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;em&gt;&lt;span&gt;Great place to work. Great place to live&lt;/span&gt;&lt;/em&gt;&lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Clinical Practice Lead - First Response Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229914", "validThrough": "2020-11-06T23:59:59+0000"}