{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 4 dependent on experience"}}, "datePosted": "2020-11-02T16:41:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Pharmacy Technician | Pharmacy | Band 4 dependent on experience | Bristol | Full Time, No Nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Bristol has an exciting opportunity for a Pharmacy Technician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With 76 beds and 5 operating theatres and the only private hospital in the South West with an Intensive Care Unit, Spire Bristol Hospital has been providing excellent care, expertise and knowledge in a supportive and progressive environment for over 32 years&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working as part of this close-knit department, you will provide an exemplary specialist technical service to support the pharmacy department and other areas of the hospital that stock medicines. Other duties will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribute to the safe and effective use of medicines, ensuring cost efficiency&lt;/li&gt;\n&lt;li&gt;Assist in assessing people’s health and well-being within the context of their medicines.&lt;/li&gt;\n&lt;li&gt;Movement and management of medicines.&lt;/li&gt;\n&lt;li&gt;Modify and structure data, information, computer records and stock management documents.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be GPHC registered - your registration should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 12 months pharmacy technician experience.&lt;/li&gt;\n&lt;li&gt;Desirable would be ACT qualification, medicine management qualification&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care, strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 8 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 or email carly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252903", "validThrough": "2020-12-02T23:59:59+0000"}