{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive"}}, "datePosted": "2020-10-29T13:30:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Orthopaedic and Spinal Nursing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Great Ormond Street Hospital GOSH) every patient is special, which means every nurse who cares for them must be special too. Many of our patients are on long journeys to recovery, and so our nurses build strong relationships with them and their families.&lt;/p&gt;\n&lt;p&gt;This is a chance to specialise in orthopaedic and spinal nursing as part of a dedicated world-class team of consultants, physiotherapists, occupational therapists, mental health nurses, learning disabilities nurses and play specialists.&lt;/p&gt;\n&lt;p&gt;You&#39;ll be joining Sky Ward, which focuses on orthopaedics and spinal surgery for children and young people from birth to 16 +. It has 18 beds, including a four-bed high-dependency unit (HDU) where we are able to care for patients following complex surgery.&lt;/p&gt;\n&lt;p&gt;While experience in orthopaedic and spinal nursing is welcome, our patients have a variety of underlying medical conditions, including learning disabilities, so we welcome qualified nurses from diverse disciplines. We&#39;ll build on your professional development to date with high-quality training, including high-dependency nursing skills.&lt;/p&gt;\n&lt;p&gt;Our focus on further education and professional development will accelerate your progress, providing you with key managerial skills and perspective, whilst our international reputation for the care of children and young people will help to build your prospects. Working at Great Ormond Street Hospital (GOSH) is a great investment in your future.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Woodcraft - Ward Sister - Sky Ward&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Staff Nurse - Sky Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248514", "validThrough": "2020-11-12T23:59:59+0000"}