{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 to £42,712 pa incl HCAS (Salary is dependa"}}, "datePosted": "2020-10-23T13:30:54+0100", "description": "&lt;p&gt;Sutton Health and Care’s speech and language therapy team is a small and friendly team looking for a dynamic, self-motivated Speech and Language Therapist. The successful candidate will have demonstrable experience working with children with speech, language and communication difficulties. Experience or an interest in supporting children and young people with eating and drinking difficulties would be desirable. This role would be an opportunity to extend and develop skills in these areas.&lt;/p&gt;\n&lt;p&gt;The role includes working with a range of paediatric client groups in clinics, homes and preschool settings across Sutton. The majority of the caseload consists of children from preschool age to the end of Year 3. The children on the caseload present with a range of complex speech language and communication difficulties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your duties will include carrying out assessments, individual and group therapy, writing reports and targets and training others. There will be opportunities for multidisciplinary work with health colleagues.&lt;/p&gt;\n&lt;p&gt;You will be working alongside the team and service leads to develop and promote the service with opportunities to take the lead in some projects.&lt;/p&gt;\n&lt;p&gt;We offer clinical supervision, training to extend your clinical skills and knowledge and support as you develop as a therapist. Applicants should have a demonstrable interest in these client-groups and a desire to work as part of a team.&lt;/p&gt;\n&lt;p&gt;We are committed to professional development, offering regular in-service training and peer group / one to one supervision and support attendance at CENs. Internal and external courses are supported and there will be opportunities to develop the skills required for this post&lt;span&gt;.&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates will have demonstrable skills working with different client groups. You should be flexible, organised and creative with good IT skills, and enjoy working with children, their families and other team members. You should also have excellent written and verbal communication skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah O’Toole, SLT Team Leader 0208 296 4140&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Name: Sian Owen&lt;/p&gt;\n&lt;p&gt;Job title: Team Leader for Children&#39;s Speech and Language Therapy&lt;/p&gt;\n&lt;p&gt;Email address: sian.owen@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 8296 4140&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Green Wrythe Lane Clinic, Sutton", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Specialist Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240720", "validThrough": "2020-11-06T23:59:59+0000"}