{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-03T15:16:07+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, dynamic and forward-thinking Specialist Speech and Language Therapist with excellent clinical, supervisory and organisational skills to join the acute inpatient Speech and Language Therapy (SLT) Team at Manchester Royal Infirmary (MRI) for a full-time post.&lt;/p&gt;\n&lt;p&gt;The postholder will be part of a team managing a complex dysphagia caseload, including tracheostomised and ventilated patients. You should have evidence of post graduate dysphagia competencies and experience of managing complex dysphagia patients. Established competencies in Videofluoroscopy is essential and Fibreoptic Endoscopic Evaluation of Swallow (FEES) are required.&lt;/p&gt;\n&lt;p&gt;You should be able to demonstrate excellent communication and organisational skills and work effectively as part of a multi-disciplinary team. The post holder will lead on service evaluation and development of this service; experience in clinical governance activities including clinical audit, service evaluation and development of evidence-based resources is also desirable. This post is the ideal opportunity for anyone wishing to develop both their clinical and leadership skills whilst being able to contribute to clinical effectiveness within the Trust.&lt;/p&gt;\n&lt;p&gt;You will be a key member of the multidisciplinary team participating in training, service development, academic and clinical meetings. A flexible proactive approach with excellent interpersonal and team working skills are vital in this post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAisling KillenJob titleClinical Lead, Acute Speech and Language TherapyEmail addressaisling.killen@mft.nhs.ukTelephone number0161 276 4131&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Senior Specialist Speech and Language Therapist (Adults)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254509", "validThrough": "2020-11-15T23:59:59+0000"}