{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42109", "minValue": "26324", "unitText": "YEAR", "value": "£15.66 - £25.05"}}, "datePosted": "2020-11-02T12:16:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Staff Nurse – Acute Hospital Band 5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: Worcestershire Acute Hospitals NHS Trust – Worcester Royal Hospital, Alexandra Hospital Redditch &amp; Kidderminster Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; &lt;strong&gt;General Acute Wards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £15.66 Saturdays/Nights: £20.35 Sunday/Bank Hols: £25.05&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Winter Incentive Now Available (Only available for shifts worked at Worcester Acute NHS Trust)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work in an environment where there is a real supportive and inclusive ethos and sense of community?&lt;/p&gt;\n&lt;p&gt;Would you like to work as a team where all team members are compassionate and committed to delivering high standard care and services to patients?&lt;/p&gt;\n&lt;p&gt;Would you like your work to be flexible to fit your lifestyle and circumstances?&lt;/p&gt;\n&lt;p&gt;Would you like to have the flexibility of working in different locations, giving you the opportunity to expand your experience and knowledge?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have flexible Bank shifts and long-term placement opportunities available for Staff Nurse – Band 5 available at Worcestershire Acute Hospital Trust.&lt;/p&gt;\n&lt;p&gt;We also run enhanced rates during certain periods throughout the year.&lt;/p&gt;\n&lt;p&gt;Worcestershire Acute Trust has a rich tradition of developing Nursing and Midwifery practice, and of delivering excellence in patient care.&lt;/p&gt;\n&lt;p&gt;Whilst proud of their heritage, their focus is the future, and central to this vision is providing evidence and value-based individualised care to the people supported.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean their location is commutable from Birmingham and surrounding areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 level in a similar role in a hospital environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of shifts at your Trust – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;Flexible working to suit your lifestyle– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;Build holiday allowance for every shift you work&lt;/li&gt;\n&lt;li&gt;Book and manage your shifts on the go – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days – Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester Royal Hospital and Alexandra Hospital Redditch", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Registered Nurse- General Acute", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252016", "validThrough": "2020-11-23T23:59:59+0000"}