{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "33176", "unitText": "YEAR", "value": "33,176.00 - 38,890.00"}}, "datePosted": "2020-11-05T14:07:26+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Paramedic/ Nurse Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6 without V300 / Band 7 with V300&lt;br /&gt;West Lancashire (Ormskirk and Skelmersdale)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full or Part Time available&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a confident and self-aware Paramedic Practitioner based in the West Lancashire area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Are you looking to be part of a team that has recently achieved ‘Good’ status at both its Urgent Care locations?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Paramedic Practitioner you’ll be working as part of the NHS system in Ormskirk/Skelmersdale where we deliver services for patients across West Lancashire&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We‘ll offer you:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         AfC 20/21 salary and terms and conditions – including an NHS pension&lt;/span&gt;&lt;br /&gt;&lt;span&gt;·         &lt;/span&gt;&lt;span&gt;Flexible working to provide you with that true work / life balance&lt;/span&gt;&lt;br /&gt;&lt;span&gt;·         &lt;/span&gt;&lt;span&gt;We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses. &lt;em&gt; &lt;/em&gt;&lt;/span&gt;&lt;br /&gt;&lt;span&gt;·         &lt;/span&gt;&lt;span&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/span&gt;&lt;br /&gt;&lt;span&gt;·         Virgin Tribe - this grants you access to premier offers and discounts on Virgin Products such as holidays&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;With our Urgent Care team, you’ll be joining a team who care about delivering the best standards of care to service users. We are constantly looking at striving for the best quality standards and we prioritise colleague development and training. Both our sites recently achieved ‘Good’ status from the CQC inspections.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Paramedic Practitioner you will&lt;em&gt;:&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Work with a multi-disciplinary team using your experience to practice autonomously and flexibly&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Undertake accurate assessment and management of patients with undifferentiated needs in accordance with evidence based clinical guidelines&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Assess the needs of patients presenting with minor illness and injury in both adult and peadiatric patients&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Prioritise cases and intervene appropriately in urgent or emergency situations&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Refer and liaise with other agencies as required&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have a Professional HCPC/ Paramedic Registration ideally working towards a masters or equivalent level qualification in a relevant subject. You will have a minimum of 3 years’ experience working in a Primary or Urgent Care setting with evidence of continuous professional development. You will possess excellent communication skills with the ability to work autonomously or as part of a team.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Nicola Doody via email: &lt;em&gt;Nicola.Doody@virgincare.co.uk&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Virgin Care&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Lancashire Health Centre", "postalCode": "L39 2AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5645", "longitude": "-2.87161"}}, "title": "Paramedic/ Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258040", "validThrough": "2020-11-19T23:59:59+0000"}