{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-21T09:45:22+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Locala’s Adult Therapy Service provides community rehabilitation support to patients across Kirklees. The service provides high quality care to patients in their own homes, community rehabilitation facilities and care homes.An excellent opportunity has arisen for a qualified Speech and Language Therapist to join the team, as a Team Leader, supporting the Speech and Language Therapy and Dietetic services. You will also maintain a clinical caseload working within the areas of dysphagia and communication.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role requires a motivated and dynamic person to lead a forward thinking and proactive team of Speech and Language therapists and Dieticians. You will oversee the HR aspects of the service in addition to supporting and leading the teams with regards performance and service development. Leadership experience is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Clinically, you will be dysphagia trained and will manage a complex caseload of patients requiring both dysphagia and communication support. Experience of treating patients that have had a stroke or with other neurological conditions is essential. Good communication skills and flexibility are essential qualities.&lt;/p&gt;\n&lt;p&gt;You will be based at Eddercliffe Health Centre in Cleckheaton with the expectation to be flexible and work Kirklees wide, as is required.&lt;/p&gt;\n&lt;p&gt;You will be well supported by team leader colleagues, senior clinicians in SLT and dietetics and the Operational Manager.&lt;/p&gt;\n&lt;p&gt;A comprehensive induction, annual appraisal, regular supervision, training and professional development will be available to the successful applicant.&lt;/p&gt;\n&lt;p&gt;Locala is committed to helping employees achieve a positive work- life balance and promotes mobile working. Staff are provided with mobile technology.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is subject to a probation period and a DBS check and you must be able to fulfil the travel requirements of the post.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal chat about this opportunity, please contact Tracy Biddle (Operational Manager) at &lt;/span&gt;&lt;span&gt;tracy.biddle@locala.org.uk&lt;/span&gt;&lt;span&gt; or on 07771 333328.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liversedge", "postalCode": "WF15 6LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7162", "longitude": "-1.69671"}}, "title": "Team Leader/Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235702", "validThrough": "2020-11-08T23:59:59+0000"}