{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pro rata"}}, "datePosted": "2020-10-27T14:00:14+0000", "description": "&lt;p&gt;We are looking to recruit a highly motivated and organised specialist child clinical psychologist to join our community Child and Adolescent Mental Health Service (LPFT CAMHS).&lt;/p&gt;\n&lt;p&gt;The successful applicant will offer specialist clinical psychology input to 1 our 4 core CAMHS hubs - Lincoln - and will need to be able to travel between sites within this large rural county.&lt;/p&gt;\n&lt;p&gt;LPFT CAMHS is a specialist multi disciplinary service which offers assessment and therapeutic interventions to children and young people who present with complex mental health problems as well as to children and young people who have been victims of trauma; who present with sexually concerning behaviours; who present with attachment difficulties. The service is very well established and is staffed with clinical psychologists, child psychiatrists, mental health practitioners (qualified nurses, social workers and occupational therapists); specialist therapists including CBT therapists; systemic psychotherapists, and art therapist; assistant practitioners and assistant psychologists; Peer Support Workers.&lt;/p&gt;\n&lt;p&gt;LPFT’s Community Core CAMHS has achieved an “Outstanding” rating from the CQC for 2 years in a row and it is actively involved in Future in Mind service developments which include following CYP IAPT principles and operating flexible opening times; provision of a 24 hours, 7 days a week CAMHS Crisis and Enhanced Treatment Service; provision of a Specialist Eating Disorder Service for Children and Young People.&lt;/p&gt;\n&lt;p&gt;The LPFT core community CAMHS follows evidence based assessment and treatment pathways for a range of mental health and behavioural presentations and the Specialist Child Clinical Psychologist will be expected to provide some of the therapies indicated on these pathways (eg CBT; systemic therapy; trauma based therapy; attachment based therapy) and be able to provide these interventions to service users on an individual basis as well as within a group format. The successful applicant will also be expected to provide supervision and consultation to other staff as appropriate.&lt;br /&gt;The provision of detailed specialist clinical psychology assessments and formulations is an intrinsic part of the clinical psychology role within core CAMHS.&lt;/p&gt;\n&lt;p&gt;Professional and clinical supervision for the post holder will be provided by a more experienced clinical psychologist within CAMHS and line management supervision will be provided by the Lincoln CAMHS team coordinator.&lt;/p&gt;\n&lt;p&gt;There are good links between all the community based CAMHS hubs, and specialist supervision is available at different sites for family work; EMDR; CBT; IPT-A; ACT; complex cases; cases presenting with sexually concerning behaviours.&lt;br /&gt;LPFT CAMHS has an on going training programme to ensure all CAMHS staff are able to provide evidence based therapies.&lt;br /&gt; . &lt;br /&gt;All the clinical psychologists within LPFT CAMHS work closely with the Mid Trent Doctorate Course for Clinical Psychology, (based at Nottingham and Lincoln Universities), and the Specialist Child Clinical Psychologist will be expected to provide regular placements and teaching input to trainees attending this course as agreed.&lt;/p&gt;\n&lt;p&gt;For informal queries about this post and/or to arrange a visit please contact&lt;br /&gt;Liz Elliott, Head of Child Psychological Therapies or one of the Clinical Psychologists who work in the Lincoln Core CAMHS team Tel: 01522 535189&lt;br /&gt;lizelliott@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Horizon Centre, Monson Street, Lincoln", "postalCode": "LN5 7RZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2226", "longitude": "-.541958"}}, "title": "Specialist Child Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244826", "validThrough": "2020-11-23T23:59:59+0000"}