{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata if part time"}}, "datePosted": "2020-10-26T16:31:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Speech &amp; Language Therapist in Stroke &amp; Acquired Neurological Disorders&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;Based at Salisbury District Hospital&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 6, salary range £31,365 to £37,890 pro rata.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Temporary post from &lt;/strong&gt;&lt;strong&gt;January 2021 &lt;/strong&gt;&lt;strong&gt;for a year &lt;/strong&gt;&lt;strong&gt;to cover maternity leave.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Hours of work = full time (37.5 hpw) or 2 part time posts (up to total of 1.2 wte).&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;The vacant post(s) are to cover a maternity leave, up to a total of 1.2 wte by either a full time SLT (37.5 hpw), or by 2 part time SLTs (up to a total of 1.2 wte = 45 hpw).&lt;/p&gt;\n&lt;p&gt;This is a wonderful opportunity to develop and use specialist skills in the assessment, diagnosis and intensive treatment of communication and swallowing disorders, including some instrumental dysphagia rehabilitation. The post(s) would cover in-patients on our Stroke Unit, and also community/out-patients in our Salisbury health area. This is within an integrated acute and community SLT service where all staff are based together in the purpose-built SLT department in Salisbury District Hospital. We have recently expanded our stroke SLT service to improve patient care by increased frequency of therapy and use of a range of new technology and instrumental treatments.&lt;br /&gt; &lt;br /&gt;For the Stroke Unit sessions (0.8 wte), this post holder will join our Stroke SLT team (of at least 3.0 wte qualified SLT’s) working on our 30 bed Stroke Unit in Salisbury District Hospital, covering the hyper-acute, acute and rehabilitation phases of stroke care for in-patients. On the Stroke Unit we work closely with our MDT colleagues to deliver well-coordinated intensive treatment and care to in-patients, and we have good links with the Stroke Association, the ESD team, and the community teams for stroke.&lt;/p&gt;\n&lt;p&gt;For the community/out-patient sessions (0.4 wte), the post holder will be involved with SLT colleagues working mainly with patients with stroke or progressive disorders, in a variety of settings, such as the SLT department for remote treatment during Covid-19, plus occasional Nursing Home or patients’ home visits. There would be the opportunity to see patients with other disorders, such as voice, if appropriate.&lt;/p&gt;\n&lt;p&gt;During the Covid-19 pandemic, we have excellent access to full and appropriate PPE in whichever setting we see patients, and we have good support for patient contacts using video consultations.&lt;br /&gt; &lt;br /&gt;Your patients will have access to our twice-weekly videofluoroscopy clinic (and to our new FEES service when this resumes) to support diagnosis and treatment planning in dysphagia. We have a variety of instrumental technology and computer based therapy programmes (such as Ampcare, IOPI, EMST, sEMG, Step by Step) to support and enhance your treatments to stroke patients with communication and swallowing disorders. We also have access to a complete range of AAC as required by patients.&lt;br /&gt; &lt;br /&gt;The post holder would be part of a supportive and flexible Adult SLT team where all SLT staff are based in the Speech &amp; Language Therapy Department at Salisbury District Hospital, adjacent to the stroke unit. This ensures excellent and seamless transfer of patient care between hospital and community settings, as well as opportunity for immediate case discussions, plus administrative support from our dedicated SLT secretarial team.&lt;br /&gt; &lt;br /&gt;Qualifications required include a degree in Speech &amp; Language Therapy, and postgraduate qualification in adult dysphagia, , as well as membership of Royal College of Speech &amp; Language Therapists, and being registered with the Health &amp; Care Professions Council.&lt;br /&gt; &lt;br /&gt;Postgraduate experience required includes autonomous assessment, diagnosis and treatment of adults with communication and swallowing impairments from stroke and other neurological conditions. Ideally the applicant would have experience of working in a stroke unit, although this is not essential.&lt;br /&gt; &lt;br /&gt;There would be opportunities for the post holder(s) to gain experience through shadowing in other areas of the Adult SLT service. The Adult SLT team covers all aspects of an adult acquired service, including general medical and specialist wards (e.g. Spinal Unit, Hospice, Burns Unit etc.), videofluoroscopy &amp; FEES swallowing and voice clinics, out-patients and community hospitals. The Salisbury SLT service covers in-patients and out-patients, and also domiciliary visits in the community areas of South Wiltshire and South West Hampshire part of the Salisbury health area. &lt;br /&gt; &lt;br /&gt;We are looking for an enthusiastic, competent and resourceful SLT who can treat a range of adult acquired communication and swallowing disorders independently, and manage problems and situations as they arise, seeking support appropriately. Experience in planning and delivering training courses to other professionals, group therapy, and computer-based therapy would be helpful. &lt;br /&gt; &lt;br /&gt;The applicants must be able to use initiative well, and have efficient and effective caseload management, and good clinical decision making skills. Some understanding of managing demand would be beneficial (e.g. the Malcomess Care Aims philosophy, Solution Focused Brief Therapy).&lt;br /&gt; &lt;br /&gt;The post-holder will be also be based in the SLT department at Salisbury District Hospital with all the other SLT teams, and will benefit from being part of a larger service for clinical supervision, clinical governance, in-service training and on-going professional development. &lt;br /&gt; &lt;br /&gt;The interview date would be set at a mutually convenient date and time.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Hirst Head of Service, Speech &amp; Language Therapy&lt;/p&gt;\n&lt;p&gt;lisa.hirst@nhs.net 01722 345571&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury District Hospital, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Band 6 Speech &amp; Langauge Therapist in Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243426", "validThrough": "2020-11-26T23:59:59+0000"}