{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "19337", "unitText": "YEAR", "value": "up to £19,337.00 per annum"}}, "datePosted": "2020-10-29T13:55:44+0000", "description": "&lt;h1&gt;&lt;strong&gt;Mountbatten Carer - Bank&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Salary up to £19,337 per annum, equivalent to Adgenda for Change Band 2&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week to be worked flexibly in accordance with the needs of the service to include, weekends, nights and bank holidays&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Mountbatten Hampshire as we extend our Care at Home services to reach more patients and their families throughout Hampshire and the surrounding areas. Our patients and their families are at the heart of everything we do. Our Hospice provides a wide range of multi-disciplinary services, created and designed to support individuals’ needs, which include a 25 bedded inpatient unit, therapies, community nursing team and a bereavement and psychology service.&lt;/p&gt;\n&lt;p&gt;To continue to provide our outstanding care services we need talented and committed people to join us. So, if you are passionate about palliative and end of life care, we want to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of the Mountbatten Care at Home Team responsible for providing care and support to our patients with life limiting conditions, their families, and carers. You will work flexibly across all care services provided by Mountbatten which will involve working in patients’ own homes or other places of care. As a Mountbatten Carer you will be required to work unsocial hours as required, including weekends/nights and bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;You will ideally be qualified to Level 2 Health and Social Care Certificate and have previous care experience. You will enjoy working as part of a dedicated team of professionals, but also be able to work under your own initiative to ensure the highest standard of care to your patients. You will have a can-do attitude and be flexible in your working hours.&lt;/p&gt;\n&lt;p&gt;You will have strong communication skills and will be an organised individual who has good IT skills, including outlook, word and excel.&lt;/p&gt;\n&lt;p&gt;You will have a full current driving licence and use of a vehicle for business purposes as you may be required to visit, patients, their families, and carers together with other professionals outside of the Hospice location.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mountbatten is a NHS Partner and pleased to support Agenda for Change, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribution to your NHS Pension Scheme, subject to meeting qualification conditions&lt;/li&gt;\n&lt;li&gt;Incremental Progression&lt;/li&gt;\n&lt;li&gt;Enhanced Holiday Provisions&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We offer a wide range of benefits to our employees, including access to education and comprehensive induction programs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion and visit about this opportunity please contact Suzi Graves Consultant Nurse, Head of Community Services on &lt;/strong&gt;&lt;strong&gt;07971383407.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post is subject to an Enhanced DBS check the cost of which is covered by the Hospice. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held 01/12/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135075.png", "name": "Countess Mountbatten Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Mountbatten Carer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248589", "validThrough": "2020-11-15T23:59:59+0000"}