{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-30T11:15:59+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for a dynamic and motivated principal applied psychologist to join Tees Child and Adolescent Mental Health Services. As part of the predicted increase in service demand in response to Covid, alongside wider service restructure within Tees CAMHS we are developing a new post for a Principle Applied Psychologist specialising in neuropsychology to help bring specialist knowledge and skills to enhance the development and delivery of the new service model and pathway developments across Tees CAMHS.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced Psychologist who has ideally also post-doctoral training in Clinical Neuropsychology. We would consider applications from Psychologists with extensive CAMHS experience who have an interest in neuropsychology and who would be willing to work towards this qualification. Candidates should be significantly experienced clinicians with excellent interdisciplinary working skills and interested in developing and delivering innovative services and pathways. A proven track record of consultancy, clinical leadership and supervisory experience in the field of neuropsychology and child and adolescent mental health is essential.&lt;/p&gt;\n&lt;p&gt;This position offers the post holder the opportunity to develop both their clinical and leadership skills and be an integral member of the leadership team. You will be expected to have the necessary skills and experience to undertake direct clinical work with children and families, consult on highly complex cases, offer multidisciplinary supervision, lead on service evaluation, as well as manage the demands of service development and change. The post holder will work closely with senior clinical and operational staff in Tees CAMHS as part of the ongoing service model redesign work, as well as linking with the wider Psychology workforce across Tees CAMHS to provide clinical leadership around neuropsychology.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Sarah Price, Locality Lead CYPS Psychology Teesside&lt;/p&gt;\n&lt;p&gt;sarah.price17@nhs.net&lt;/p&gt;\n&lt;p&gt;07733314147&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Lane Hospital Site, Middlesbrough", "postalCode": "TS5 4EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5615", "longitude": "-1.2581"}}, "title": "Principal Applied Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249902", "validThrough": "2020-11-08T23:59:59+0000"}