{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc. HCAS"}}, "datePosted": "2020-11-03T15:01:03+0000", "description": "&lt;p&gt;&lt;span&gt;Is providing excellent nursing care and getting the basics right one of your key drivers? Do you love developing others to become excellent at what they do? Is making a difference and doing the right thing fundamental to you? &lt;br /&gt;If your answer to these questions is yes, the Senior Sister/Charge Nurse role on our Oncology ward might just be for you. We are looking for an enthusiastic and motivated person to join the team on Trevor Howell, which is a 19 bedded Oncology ward caring for patients with a range of solid tumours and Lymphoma. The ward cares for patients in all stages of their cancer journey, from diagnosis, throughout treatment and discharge, to providing end of life care with strong support from the hospitals dedicated palliative care team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You have to be a compassionate, enthusiastic, motivated and caring leader who has previous experience within the specialty. You will need to be able to demonstrate recent management experience, hold excellent communication skills and be a forward thinking individual.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;We aim to provide a service which is tailored to individuals needs’ as well as ensuring our staff are supported through regular clinical supervision time, education programme and on-going professional development. Both our patient and education services are linked to the Royal Marsden Foundation Trust Hospitals located in Sutton and Chelsea.&lt;br /&gt;&lt;br /&gt;We are committed at providing the opportunities to pursue further education pathways including BSc and MSc in Oncology/Haematology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie PaskaJob titleMatron for Haematology/OncologyEmail addressjulie.paska@stgeorges.nhs.ukTelephone number02087255594/3973 or 02086721255 bleep 7535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tooting", "postalCode": "SW170QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Senior Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254462", "validThrough": "2020-11-17T23:59:59+0000"}