{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T09:31:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Clinical or Counselling Psychologist (Full time, Permanent Post) – High Weald, Lewes &amp; Havens Community Mental Health Services, Newhaven, East Sussex.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join East Sussex adult community mental health services at time of significant change and innovation. We are looking for a creative and enthusiastic qualified, HCPC-registered Clinical or Counselling Psychologist to fill a permanent full time Band 7 post. You will be working as part of the High Weald, Lewes &amp; Havens Assessment &amp; Treatment Service (HWLH ATS) based at Hillrise in Newhaven.&lt;/p&gt;\n&lt;p&gt;Hill Rise is just a short car ride from Brighton or a 40 minute cycle ride along the beautiful costal road.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a friendly, highly-skilled and enthusiastic community of psychologists and psychological therapists working as part of the Assessment and Treatment Service for adults of all ages. The service is multi-professional and commissioned to work with service users with complex mental health needs, their families and carers. HWLH ATS is based across two sites – Hill Rise in Newhaven and Millwood in Uckfield. The post holder will be based at Hill Rise but may be required to travel between both sites at times. At present , as a result of the pandemic, we are offering many of our interventions online and this role can therefore currently involve time working from home if desired although this may change in the future.&lt;/p&gt;\n&lt;p&gt;Psychologists and psychological therapists are valued members of the service and offer specialist assessment; evidence based interventions; psychological formulation and team consultation. The successful candidate will have skills in offering neuropsychological as well as formulation based assessment to help develop a comprehensive understanding of a client&#39;s needs and guide care planning. We have been adapting interventions in the context of the ongoing pandemic and there are opportunities to lead on innovative practice for clients and their wider support network.&lt;/p&gt;\n&lt;p&gt;You will be supported to develop specialist interests and skills in line with the local service priorities for people with complex mental health problems, their families and carers. This could include working with clients with psychosis, trauma, managing complex emotions, mood and anxiety difficulties. We recognise the importance of offering evidence based psychological therapy and experience in offering Cognitive Behavioural Therapy within adult mental health services is essential. We also have local interests in third wave approaches within psychological therapy including Compassion Focused therapy, EMDR, and ACT and support the wider team to offer family interventions for psychosis. We would welcome the successful candidate to bring their own interests and experiences to this post and help us to continue to develop our psychological therapy provision.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership NHS Foundation Trust aims to realise the potential of everyone who uses its services and to enable staff to do a great job. It has teaching status and is developing into one of the country’s leading teaching mental health trusts. Working here offers continued training and development, variety and a rewarding challenge, plus all the benefits of living in Sussex. We have close links with Sussex and Surrey universities and have been national innovators for psychological work with trauma, voice hearing, MBCT and Family interventions for Psychosis to name a few.&lt;/p&gt;\n&lt;p&gt;For informal enquiries you are very welcome to contact Dr Sarah Mansfield (Principal Clinical Psychologist) to learn more about the post on 07471 031493 (Mon-Wed). Alternatively you can email: sarah.mansfield@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;You can also contact the Team Lead, Joy Makotore on 07391402634 to find out more about the Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hill Rise, Newhaven", "postalCode": "BN9 9HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7903", "longitude": ".041381"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243826", "validThrough": "2020-11-10T23:59:59+0000"}