{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 pro rata, inc HCA"}}, "datePosted": "2020-10-23T16:45:52+0100", "description": "&lt;p&gt;&lt;span&gt;King&#39;s College Hospital are excited to invite applications for the post of Consultant Clinical Psychologist within the expanding Paediatric Psychology Service. The post will lead the existing provision of paediatric psychology within the hospital, as well as service development, with the aim of ensuring systematic provision across the hospital.&lt;br /&gt; &lt;br /&gt;The purpose of this post is to provide leadership and coordination of Paediatric Psychology Services within Variety Children’s Hospital at King’s College Hospital, Denmark Hill. Following a review of services, the Trust are working to ensure children and families seen in the hospital receive an excellent holistic package of care: attending to their physical and psychological wellbeing. This process led to the development of this exciting new post. The post holder will be responsible for driving forward this service development, working closely with stakeholders, the Senior Management Team, clinicians and families to operationalise and implement high quality, evidence based Psychological Services across the Children’s Hospital. The post holder will be involved in service evaluation, balancing how services can be delivered in a cost-effective manner, and meeting the needs of families seen in the hospital.&lt;br /&gt; &lt;br /&gt;The post holder will be responsible for providing managerial and supervisory support for qualified Practitioner Psychologists employed by the Trust, including recruitment. &lt;br /&gt; &lt;br /&gt;The post holder will provide excellent, evidence based, clinical input to medical specialties, and families across the hospital, dependent upon service requirements. They will manage a clinical caseload as part of their role within the team. &lt;br /&gt; &lt;br /&gt;King’s College Hospital NHS Trust &amp; The Variety Children’s Hospital&lt;br /&gt;We are one of London&#39;s largest and busiest teaching hospitals, with a strong profile of local services primarily serving the boroughs of Lambeth, Southwark, Lewisham and Bromley. The Variety Children’s Hospital offers around 62,000 episodes of care for 0-16 year olds per year, and around 16,000 inpatient admissions.&lt;br /&gt; &lt;br /&gt;Children’s Health Services include liver transplant, gastroenterology, haematology &amp; oncology, respiratory &amp; Cystic Fibrosis, sickle cell, allergy, diabetes and bariatric services, rheumatology and general paediatrics, amongst others. We provide community care, as well as National and Specialised services.&lt;br /&gt; &lt;br /&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;br /&gt; &lt;br /&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;br /&gt; &lt;br /&gt;King’s College Hospital has a well-established national and international reputation for clinical excellence, research and teaching. There will be ample opportunities to link with a broad and strong local network of psychologists working in physical health settings across the King’s Health Partners Academic Health Sciences Centre.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Lisa Barkley&lt;/p&gt;\n&lt;p&gt;Job title Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address Lisa.Barkley1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Consultant Practitioner Psychologist in Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241349", "validThrough": "2020-11-22T23:59:59+0000"}