{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-29T17:05:14+0000", "description": "&lt;p&gt;Staff Nurse – Outpatients&lt;/p&gt;\n&lt;p&gt;Right now we have an opportunity for a Staff Nurse to join our team in our team at North Downs Hospital Outpatients department.&lt;/p&gt;\n&lt;p&gt;The Role:&lt;/p&gt;\n&lt;p&gt;Working as part of the Outpatients team to provide a high standard of efficient, individualised patient care. A strong communicator with exceptional standards of customer service. Adhering to all of Ramsay’s policies and procedures to ensure the best possible clinical outcomes for patients. A strong advocate of the Ramsay Way and People Caring for People.&lt;/p&gt;\n&lt;p&gt;What you’ll bring with you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered with the NMC&lt;/li&gt;\n&lt;li&gt;High standards of clinical competence&lt;/li&gt;\n&lt;li&gt;Sound written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Venepunture skills preferred&lt;/li&gt;\n&lt;li&gt;Strong organisation skills and attention to detail&lt;/li&gt;\n&lt;li&gt;Flexibility and adaptability to meet the changing needs of the business&lt;/li&gt;\n&lt;li&gt;A passion for delivering an excellent patient-focus service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Salary plus enhancements at 50% where eligible&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Subsidised restaurant&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;li&gt;Wellbeing centre and access to 24/7 employee assistance line for free advice&lt;/li&gt;\n&lt;li&gt;Free Uniform &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;North Downs Hospital is one of Surrey&#39;s leading private hospitals with an excellent reputation for delivering high quality healthcare treatments and services. Located within the M25, close to the centre of Caterham, the hospital opened in 1974 and currently has 15 bedrooms, all with en suite facilities and a daycase suite.&lt;/p&gt;\n&lt;p&gt;By investing in advanced medical technology, the hospital offers a wide range of treatments and services. The fully equipped ultra clean air theatre is particularly suitable for orthopaedic procedures offered such as arthroscopy, hip and knee replacements. The day unit is suitable for minor operations and endoscopy.&lt;/p&gt;\n&lt;p&gt;Treatments at the hospital also include cataract removal, ENT procedures, hernia repair, varicose vein surgery, hysterectomy, prostate surgery and urological procedures.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“The Ramsay Way” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success. Click here to find out more.&lt;/p&gt;\n&lt;p&gt;All offers of employment in respect of this appointment will be subject to receipt of a satisfactory Enhanced Disclosure Certificate from the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;Committed to quality, equality and opportunity for all.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Caterham", "postalCode": "CR3 6DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2735", "longitude": "-.079141"}}, "title": "Staff Nurse - Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249204", "validThrough": "2020-11-30T23:59:59+0000"}