{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum, inc HCA"}}, "datePosted": "2020-11-02T16:46:07+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust is the regional Neurosciences Centre for South East London and Kent. Our Neurology Department serves this catchment with a range of specialisms and professionals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Neurology Medical Secretarial team support over 40 neurologists and clinical nurse specialists to deliver a high standard of patient care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In this role you will provide comprehensive secretarial and administrative support to departmental medical staff as part of a busy team. They must be IT literate with good working knowledge of Microsoft Office and email. The post holder will ideally have experience of NHS systems such as PIMS and ERS and have had medical secretary or equivalent experience. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic, motivated and conscientious individual to join our team of Medical Secretaries. The post holder will be required to work flexibly to respond quickly and effectively to the needs of the service. They will also be a strong team player who is willing to support and cover their secretarial colleagues when required so as to ensure continuity and equity of support for the department as a whole. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post holder must place the NHS values at the heart of everything they do and be motivated to deliver the best service for the patients that we serve. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We look forward to receiving your applications.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Lai Tsang&lt;/p&gt;\n&lt;p&gt;Job title Team Leader&lt;/p&gt;\n&lt;p&gt;Email address laitsang@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252923", "validThrough": "2020-11-09T23:59:59+0000"}