{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-10-26T08:16:50+0000", "description": "&lt;p&gt;&lt;span&gt;Part Time - 30 Hours per week&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity is available for a motivated and innovative AMHP Specialist Social Worker to work within our busy Assertive Outreach Team in a culturally diverse area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We work with adults 25 years plus and support people who have historically avoided contact with mental health services and do this using a flexible and creative approach to engagement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be expected to work within a multi disciplinary team, care coordinating a caseload supporting the recovery ethos from a social care perspective. You will be able to evidence an in depth knowledge of a range of legislation, including but not limited to - The Care Act, The Mental Capacity Act, The Mental Health Act and the Equalities Act.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be able to communicate effectively at all levels, demonstrate competent risk assessment and risk management skills and have a genuine interest in working with service users with severe and enduring mental health issues, and their carers’.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to demonstrate a commitment to achieving the highest standards of care whilst utilising the care program approach framework and displaying your ability to work autonomously as well as being an effective member of the multi-disciplinary team. The post involves working within a multi-disciplinary team, focusing on the recovery model and interfacing with partner services and stakeholders, within a team focus.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Assertive Outreach service operates over 7 days per week, 365 days per year. The team work a shift pattern consisting of day shifts (9:00am - 5:00pm), late shifts (12:00pm - 8:00pm) and weekends (9:00am - 5:00pm), as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return we can offer a friendly and supportive multi disciplinary environment in which to develop through training opportunities, regular individual and group supervision and a supportive team ethos.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability and willingness to travel across the Birmingham &amp; Solihull area for work purposes is required for this role&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJenny TaskerJob titleTeam Manager North AOTEmail addressjennytasker@nhs.netTelephone number07985882954&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North AOT Northcroft, Birmingham", "postalCode": "B23 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5233", "longitude": "-1.85513"}}, "title": "Band 7 Social Work Approved Mental Health Practitioner - North AOT No", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241705", "validThrough": "2020-11-06T23:59:59+0000"}