{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-26T16:14:28+0000", "description": "&lt;p&gt;Zero hours, as and when required. We are looking for enthusiastic and motivated Nursery Assistants to join our staff bank to support the team in our busy on-site nursery.&lt;/p&gt;\n&lt;p&gt;First Steps and Little Steps Nurseries are based at the RD&amp;E Hospital, Wonford site and provide care for the children of NHS staff.&lt;/p&gt;\n&lt;p&gt;Our expanding childcare service needs people passionate about childcare, professional in outlook and committed.&lt;/p&gt;\n&lt;p&gt;As a Bank Nursery Assistant, you will be requested to work during periods of staff annual leave, sickness and high demand, undertaking the basic nursery assistant role for the children that attend our nurseries. Under direction and supervision, you will participate in the implementation of activities to help children’s learning and development and contribute to maintaining the high standards of childcare we insist on.&lt;/p&gt;\n&lt;p&gt;Ideally qualified to minimum NVQ 2 or equivalent with childcare experience we are particularly looking for people who can be flexible and available with short notice.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Bank Nursery Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243335", "validThrough": "2020-11-23T23:59:59+0000"}