{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19768", "minValue": "19768", "unitText": "YEAR", "value": "£11.76ph"}}, "datePosted": "2020-10-23T15:44:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you the Employee Relations Administrator we are looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone to help provide the support for the staff at the Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospital Trust West Hertfordshire Hospitals NHS Trust provides acute healthcare services to a core catchment population of approximately half a million people living in west Hertfordshire and the surrounding area. They have four aims as part of their vision; To deliver the best quality of care to their patients, to be a great place to work and learn, to improve their financial sustainability and to develop a strategy for the future.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, West Hertfordshire Hospital Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We are looking for an &lt;strong&gt;Employee Relations Administrator&lt;/strong&gt; based at &lt;strong&gt;Watford General Hospital, WD&lt;/strong&gt;&lt;strong&gt;18 0HB&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a &lt;strong&gt;full-time position&lt;/strong&gt; working Monday-Friday 8.30am-4.30pm. The hourly rate is £11.76ph&lt;/p&gt;\n&lt;p&gt;Responsibilities will cover a number of areas such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a timely response to all queries whether received by email, letters or telephone&lt;/li&gt;\n&lt;li&gt;To attend sensitive and challenging meetings and hearings in order to make a formal written record of the proceedings.  Such notes will then be typed as formal minutes and may be submitted as evidence in cases should they progress to an appeal stage, employment tribunal and / or formal hearing of a professional body such as NMC, HPC, or GMC.&lt;/li&gt;\n&lt;li&gt;To draft letters on the behalf of senior colleagues using agreed templates or analysing or responding to requests for data input and interpretation&lt;/li&gt;\n&lt;li&gt;Participate in job matching panels, which requires assessing job descriptions against nationally set profiles as and when required&lt;/li&gt;\n&lt;li&gt;Analysis of Workforce reports to identify employee’s who have met the sickness triggers and take appropriate action in conjunction with the relevant ER Adviser&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To act as the first point of contact for all enquiries coming into the ER Team from internal and external stakeholders making decisions on behalf of the ER Managers as appropriate&lt;/li&gt;\n&lt;li&gt;To provide advice on A4C terms and conditions and specifically to assist employees in the calculation of annual leave, confirmation of notice requirements, details of sickness absence triggers, maternity leave entitlements.  Providing clarification and escalating to appropriate senior ER colleagues for enquiries requiring advice on policies and procedures&lt;/li&gt;\n&lt;li&gt;To ensure that messages are taken and submitted to senior ER colleagues ensuring these provide sufficient detail and content and are passed across in a timely manner.&lt;/li&gt;\n&lt;li&gt;Communicate with staff at all levels throughout the organisation on employee relations issues  &lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To contact managers on a monthly basis to establish the status of all staff recorded as being on long term sick leave and provide the updates to the workforce team&lt;/li&gt;\n&lt;li&gt;To contact managers for outstanding sickness documentation as directed by the Employee Relations Team&lt;/li&gt;\n&lt;li&gt;To maintain confidentiality at all times whilst dealing with complex, contentious and sensitive information&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To organise hearings / appeals, contacting panel members along with management and staff side representative to agree a mutually convenient date and time for the hearing&lt;/li&gt;\n&lt;li&gt;To manage the administration of the maternity process including maintaining a database of maternity leavers, updating ESR, producing letters to confirm entitlement, scheduling meetings with employees&lt;/li&gt;\n&lt;li&gt;Access and coordinate calendars on behalf of ER Advisers / ER Managers / HRBP’s to ensure that meetings are entered appropriately&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To organise consultation meetings on behalf of the HR Business Partners and send out any associated letters / paperwork&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To support with organising and co-ordination of staff engagement activities including the Staff Friends and Family survey and the National Staff Survey &lt;/li&gt;\n&lt;li&gt;To ensure post is collected  / delivered to the post room on a daily basis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you have the following skills or Experience …?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ability to act on own initiative, self-motivate and prioritise workload.&lt;/li&gt;\n&lt;li&gt;High level of attention to detail and accuracy.&lt;/li&gt;\n&lt;li&gt;Good communication skills written and oral.&lt;/li&gt;\n&lt;li&gt;Excellent organisation skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Employee Relations Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241151", "validThrough": "2020-11-06T23:59:59+0000"}