{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Pro Rata"}}, "datePosted": "2020-11-02T17:17:17+0000", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated Band 5 Practice Nurse to join the Defence Primary Healthcare (DPHC) Team located at RAF Cranwell.&lt;/p&gt;\n&lt;p&gt;This is a Part TIme post for 32.5 hours per week.&lt;/p&gt;\n&lt;p&gt;DPHC is a vibrant and fast-moving organisation that aims to provide the very best primary healthcare to Defence personnel and in some locations, their families and dependants. In addition to General Practice, DPHC provides rehabilitation services, occupational health advice and community mental health support. The patient population is generally young and healthy and much of the work relates to occupational health, minor injuries and sports medicine.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be required to provide appropriate Primary Health Care (PHC) nursing to the medical facility population at risk in conjunction with the Multi-disciplinary Primary Healthcare Team. You will be responsible for the delivery of appropriate assessment, planning, implementation and evaluation of care needs, medical screening and advice to patients within your professional competence in line with current policy, guidelines and utilising agreed evidence-based practice. Occupational health is a significant part of the role to ensure that the defence staff are fit for their diverse roles within the services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications and Memberships&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate must have professional/clinical knowledge acquired through training to degree/diploma level and must be registered with Nursing and Midwifery Council.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The sift for this vacancy will be CV based. Interviews will be competency based. The following NHS competencies will be tested:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHSC1 - Communication&lt;/li&gt;\n&lt;li&gt;NHSC2 - Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHSC4 - Service Improvement&lt;/li&gt;\n&lt;li&gt;HWB2 - Assessment and Care Planning&lt;/li&gt;\n&lt;li&gt;HWB5 - Provision of Care&lt;/li&gt;\n&lt;li&gt;NHSIK1 - Information Processing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RAF Cranwell, Sleaford, Lincolnshire", "postalCode": "NG34 8HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0339", "longitude": "-.506418"}}, "title": "Band 5 Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253020", "validThrough": "2020-11-29T23:59:59+0000"}