{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-19T14:46:22+0100", "description": "&lt;p&gt;Have you reached the point in your career where you are looking for a new challenge which also brings opportunities? Then this post may be for you. We are looking to recruit 2 Band 7 Clinical Leads for our Community Mental Health Team based in Crewe. Both posts are a full time fixed term post for 6 months.&lt;/p&gt;\n&lt;p&gt;We want extraordinary people to work with us who share our dedication and put high quality patient care at the centre of everything we do. The ideal candidate will show that they can work towards our 6 C values and display Care, Compassion, Commitment, Courage, Communication and Competence in everything they do.&lt;/p&gt;\n&lt;p&gt;Cheshire and Wirral Partnership is a wonderful organisation to work for and our staff prides themselves on compassion, team work and resilience. Here at CWP, we’re on an incredible journey of innovation and need enthusiastic and caring individuals to join our Community Mental Health Team based in Crewe – Cheshire. Our Community Mental Health Services are currently under review and following an exciting redesign of our Mental Health Services the community teams are moving towards working more closely with Care communities, thus providing a more coordinated and stepped approach to service users within their community.&lt;/p&gt;\n&lt;p&gt;As a clinical lead you will be expected to contribute and participate in the service changes needed to meet the challenges ahead. You will be required to hold a suitable qualification and be registered with the appropriate body and have significant experience in mental health. You will work as part of a multidisciplinary and multi-agency team to take an active lead role. Recovery principles and person centred care underline our practice and engagement with services users. The successful candidates will want to make a difference to patients’ lives and will be pivotal in ensuring their care is person centred and recovery focussed&lt;/p&gt;\n&lt;p&gt;The community team currently works 9-5 five days a week.&lt;br /&gt;CWP offers Continuing Professional Development (CPD) which is tailored to meet the professional development of individual nurses and encourage you to excel within your nursing role; individual CPD advice is available from our Practice Education Team, or externally through a range of colleges and universities we are associated with. &lt;br /&gt;&lt;br /&gt;We also offer a comprehensive benefits package which includes an excellent pension scheme, 35 days annual leave on commencement (pro rata) inclusive of bank holidays which rises with continued years of service. CWP also offer a competitive salary based upon agenda for change which is part of the incremental pay progression. There are also regular opportunities for career progression throughout the organisation.&lt;/p&gt;\n&lt;p&gt;If you are the sort of person who likes a challenge and works at a high level what are you waiting for? Come and join us on this thrilling journey and help reshape the future of Mental Health Services within Cheshire East.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Fiona Johnson Team Manager Email address fiona.johnson17@nhs.net Telephone number 01270 655206&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "delamere resource centre, Crewe", "postalCode": "CW1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0975", "longitude": "-2.44598"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232744", "validThrough": "2020-11-09T23:59:59+0000"}