{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-10-30T16:38:04+0000", "description": "&lt;p&gt;&lt;strong&gt;2 posts &lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not re-apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;&lt;span&gt;North Lincolnshire Clinical Commissioning Group (NLCCG) covers a population of 167,000, based around the Scunthorpe urban area with a large rural area stretching from Epworth and Crowle in the West, to Barton upon Humber and Immingham in the east. There are 19 GP practices within its boundaries all of whom are members of a developing provider federation. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Continuing healthcare team delivers a service to the population of North Lincolnshire. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to a vacancy within our team, we are able to offer an opportunity for a motivated Registered Nurse (Adults) wishing to develop their career working within a Clinical Commissioning Group.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are responsible for the assessment, management and support of individuals who require a package of care funded by the NHS and we are looking for a Band 6 registered nurse to join our team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will develop strong links with health and social care colleagues to ensure multi-disciplinary working across health and social care boundaries to obtain robust evidence to support NHS CHC eligibility.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will enjoy meeting patients, their relatives and other healthcare professionals to assess their clinical needs. You will be skilled at effective case management to ensure that patients&#39; ongoing needs are identified and met. You will be part of a team of professional nurse assessors ensuring that reviews are carried out in a timely way in accordance with the National Framework for NHS Continuing Healthcare &amp; NHS Funded Nursing Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ideal candidate will have excellent communication and assessment skills. They will be able to show an excellent approach to problem solving and the ability to prioritise their own workload. The successful candidate will need to have a flexible approach and be a keen team player who enjoys working within a busy environment. If you wish to join our friendly team, we would welcome your application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Patrick Bowen 01652 251 021&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Lincolnshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129095"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brigg", "postalCode": "DN20 8GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5528", "longitude": "-.485954"}}, "title": "Continuing Healthcare Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250963", "validThrough": "2020-11-18T23:59:59+0000"}