{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T18:30:35+0100", "description": "&lt;p&gt;North East London Foundation Trust Consultant Psychiatrist 10PAs North East London NHS Foundation Trust (NELFT) provides NHS mental health services for almost 1million people living in Waltham Forest, Redbridge, Barking &amp; Dagenham and Havering. A vacancy has arisen following a consultant moving within the Acute and Rehabilitation Directorate. NELFT operates a nationally recognised model of minimising bed usage through close collaboration between the Home treatment Team and acute wards. The post is based in Goodmayes Hospital and collocated with three HTTs providing care to other NELFT boroughs. This posts will attract 10 Programmed Activities per week – 7.5 Pas for direct clinical care and up to 2.5 PAs for supporting professional activity. There may be opportunity to contribute to the senior on-call rota which is remunerated at 3%. The post offers excellent CPD and study leave arrangements as well as good research and service development opportunities. Staff in NELFT work within a supportive environment that strives to strike an excellent work/life balance and job satisfaction, which creates an atmosphere to provide high quality care. In addition, staff also enjoys other benefits including a car lease scheme, flexible working arrangements, Childcare voucher scheme, the NHS Pension Scheme and ongoing opportunities for career development. NELFT has excellent relationships with all stakeholders, robust governance structures and excellent systems of data collection and performance monitoring. As a Foundation Trust, NELFT retains any surplus generated for investment in services. NELFT is committed to safeguarding and promoting the welfare of children and to protecting them from the risk of harm. NELFT recognizes its responsibility to ensure that safe working systems are in place for staff working with children and families and staff working with children and adults in their care. We are looking for enthusiastic and flexible candidates who demonstrate leadership abilities and are committed to working in a multidisciplinary setting. Applicants should be on the Specialist Register or be within six months of obtaining their CCT. The candidate should be suitably qualified, including eligibility for Section 12 approval and Approved Clinician status.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Emmanuel Okoro, Associate Medical Director&lt;/p&gt;\n&lt;p&gt;0300 555 1201 x67961&lt;/p&gt;\n&lt;p&gt;Emmanuel.okoro@nelft.nhs.uk;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Goodmayes Hospital, Goodmayes", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Consultant Psychiatrist, Kahlo Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237493", "validThrough": "2020-11-22T23:59:59+0000"}