{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-05T14:30:39+0000", "description": "&lt;p&gt;Would you like to be part of an Integrated Discharge Team?&lt;/p&gt;\n&lt;p&gt;Are you an entusisastic, pro active Occupational Therapist (OT) that is looking for an exciting opportunity to work within this specialist area? This post is for 12 months to cover a maternity leave.&lt;/p&gt;\n&lt;p&gt;The Discharge Team consist of a team of Nurses, OTs and discharge assistant practitioners who screen new admissions to University Hospital Coventry &amp; Warwickshire and start the discharge planning process to ensure patients are discharged in a safe, timely manner with the appropriate level of support.&lt;/p&gt;\n&lt;p&gt;The team work collaboratively with specialist services both within the hospital and in the community to ensure the patients&#39; needs are met within the most appropriate environment across 7 days.&lt;/p&gt;\n&lt;p&gt;You will need excellent communication and interpersonal skills, have the ability to work under pressure and case manage complex patients, whilst supporting junior staff. You will develop your knowledge and skills across multiple professions and complete assessments on behalf of community services. If you would like to be a key team player and are committed to promoting a seamless service, do not hesitate to contact us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All correspondence will be sent by email; please check your account regularly including your Junk/SPAM folders&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are invited to attend interview you will be asked to set up an account with the Trac recruitment system in order to confirm your interview time&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;*****&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: Please be advised that this job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerrie ManningJob titleIDT ManagerEmail addresskerrie.manning@uhcw.nhs.ukTelephone number02476965572Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact: &lt;br /&gt;&lt;br /&gt;Kerrie Manning - Co-ordinator, Bleep 4221, at University Hospitals Coventry and Warwickshire, NHS Trust, Walsgrave Hospital&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Coventry and Warwickshire, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Discharge Facilitator Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258121", "validThrough": "2020-11-19T23:59:59+0000"}