{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25506", "minValue": "18278", "unitText": "YEAR", "value": "£18,278 - £25,506"}}, "datePosted": "2020-10-29T08:41:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Support Worker - Complex Care - Canterbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Canterbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract type:full time 37 or 45 hours per week / Part time / bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £9.50 P/H increasing to £10 per hour, following successful probationary period. Salary increases to £10.45 P/H and £10.90 P/H after 1 and 2 years service. Starting Salary of £10 P/H or £10.45-£10.90 P/H will be offered to candidates with exceptional experience in complex care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a small and highly specialised service which is committed to supporting me in the community?&lt;/p&gt;\n&lt;p&gt;Would you like to involve people and support them to be part of the local community?&lt;/p&gt;\n&lt;p&gt;Would you like to be well trained, well supported, well paid and know that you are making a positive difference every time you go to work?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Me:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;I am looking for people to support me in Canterbury both at home and in my local community.&lt;/p&gt;\n&lt;p&gt;I enjoy spending time with animals, gaming, reading, doing quizzes and watching programs such as master mind. My family is important to me and I need to feel safe in my home.&lt;/p&gt;\n&lt;p&gt;I will need people to support me all day in my home and the community with developing community awareness, independent living skills, staying safe, maintaining a healthy lifestyle, managing anxiety and challenges specific to me.&lt;/p&gt;\n&lt;p&gt;I am starting on a new journey in life which is exciting and scary, I will need support to achieve the best life can be for me, from people who are excited to take this journey with me.&lt;/p&gt;\n&lt;p&gt;Role Responsibility&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;I need my support workers to be patient and understanding.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;My support workers need to be mindful of the language they use when communicating with me.&lt;/li&gt;\n&lt;li&gt;The role will include supporting me in my own home and in the community.&lt;/li&gt;\n&lt;li&gt;The role will include supporting me in difficult times and good.&lt;/li&gt;\n&lt;li&gt;You will be required to work alongside specialists in multi-disciplinary teams. this may include Phycologists, probation officers, Occupational Therapists, Social Workers and more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Ideal Candidate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You should be&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experienced in supporting people with Autism and Mental Health diagnosis.&lt;/li&gt;\n&lt;li&gt;Knowledgeable in substance misuse but this is not essential.&lt;/li&gt;\n&lt;li&gt;Be resilient, patient and understanding. It will take a while to be able to develop a strong bond with me.&lt;/li&gt;\n&lt;li&gt;Be consistent in your support approach.&lt;/li&gt;\n&lt;li&gt;Be able to use language effectively to enable me to widen my opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right attitude!&lt;/li&gt;\n&lt;li&gt;A good attendance record.&lt;/li&gt;\n&lt;li&gt;The ability to work well as part of a team and independently, and with other professionals involved in my support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a specialist supported living support service in Canterbury and we have high expectations for our staff. You will receive all the necessary training prior to supporting the person and this will take place locally. Please call the number below for an informal discussion - if you would like to know more.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Turning Point employees receive:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited.&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays.&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans.&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme.&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support.&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance.&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We take pride in the services that we provide. There is one vision that everyone at Turning Point shares, which is held together by our values. These include believing in potential, communicating in a confident way, embracing change and treating each other as individuals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Running services on a not-for-profit basis, we invest every penny back into our services - and, our people. So, if you are enthusiastic, motivated and committed to support people with Learning Disabilities to live fulfilling lives - here at Turning Point, we don&#39;t just offer you a job: we offer you a career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury", "postalCode": "CT1"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2783", "longitude": "1.08095"}}, "title": "Support Worker - Learning Disabilities - Complex Care - Canterbury", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247654", "validThrough": "2020-11-29T23:59:59+0000"}