{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "£36500.00 Per Annum Free DBS check, Flu vaccinatio"}}, "datePosted": "2020-10-30T16:31:09+0000", "description": "&lt;p&gt;Salary: Circa £36,500&lt;/p&gt;\n&lt;p&gt;Requirements:RNMH / RNLD / Diploma / Degree &amp; NMC registration. Be able to demonstrate continuous professional development.We would welcome applications for preceptorship.&lt;/p&gt;\n&lt;p&gt;Hours of Work:Night shifts&lt;/p&gt;\n&lt;p&gt;Contract Type:Permanent&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided&lt;/li&gt;\n&lt;li&gt;On-site parking available&lt;/li&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package&lt;/li&gt;\n&lt;li&gt;Progression Opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits:MHC benefits also include; free DBS check, flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;About the role: We have a Night Staff Nurse Positionavailable to work in a high performing Hospital supported by a very experienced Nursing / MDT and Management team.The successfully appointed Night Staff Nurse will be required to work permanent nights and will receive enhancements for their shifts. Applicants must hold appropriate Nursing qualifications as the roles foundations are on individualised patient care.&lt;/p&gt;\n&lt;p&gt;A key aspect of the role is supporting the patient&#39;s journey and progression through the hospitals care pathway. Provide clinical leadership to both staff and patients. Act as a role model for the delivery of care and ensure that all staff are performing to required standards. Ensure effective and adequate individual assessment, planning, implementation, and evaluation of patient care and oversee the named nurse role for your identified patients.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop your skills, share your experiences and really make a difference to the lives of those we support. It may be that you want a change, fresh start or just want to bring your skills toNewton House, where at the same time you can benefit from support and guidance from the senior nurses, MDT and senior management team. There will be an opportunity for you to access our bespoke training package and internal training offered in the hospital.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post will have experience in mental health issues, possess experience in being a named nurse, writing care plans and risk management plans and for preceptorship nurses willing to undertake the preceptorship package offered atNewton House. Within this role you will need an understanding of recovery, patient centred care, team working, personal development, medication procedures, safeguarding policies and procedures, motivation skills, be self-motivated, flexible and organised.&lt;/p&gt;\n&lt;p&gt;About the Service:Situated a mile from the seaside town of Blackpool, Newton House Independent Hospital provides locked rehabilitation, habitation and treatment to up to 21 men living with complex and enduring mental health conditions.&lt;/p&gt;\n&lt;p&gt;About MHC:We are committed to delivering the very best care within our health/social care services across England and North Wales. We provide a culture that empowers the people we work with - both individuals and colleagues - to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;By working together, we develop pathways for individuals and colleagues that enable them to achieve positive outcomes. Likewise, we work together with families and carers too, so they are always fully involved in their loved one&#39;s care while they are with us.&lt;/p&gt;\n&lt;p&gt;Skills:Able to communicate highly complex and sensitive information&lt;/p&gt;\n&lt;p&gt;Equal Opportunities:MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply:Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572020&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool", "postalCode": "FY3 8NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8243", "longitude": "-3.01493"}}, "title": "NIGHT STAFF NURSE RNLD/RNMH - NEWTON HOUSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250957", "validThrough": "2020-11-29T23:59:59+0000"}