{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 Per Annum Inclusive"}}, "datePosted": "2020-10-23T14:46:21+0100", "description": "&lt;p&gt;An exciting opportunity has arisen within the Clinical IT Systems team to recruit an outstanding, dynamic and focused individual to join a committed team responsible for the management of clinical Applications. The Post holder will support the Head of Clinical IT Systems in delivering World class suite of clinical IT systems. As our ICT environment continues to evolve, our cutting edge technology requires state of the art IT support. The Clinical IT Systems team is responsible for the implementation, maintenance and support of clinical and non-clinical Applications. This includes trouble-shooting, problem-solving, new installations and enhancements to Applications, in addition to participation in a healthy mix of deployment projects.&lt;br /&gt;&lt;br /&gt;The post holder will manage a defined portfolio of clinical Applications for a defined business unit providing Business partner leadership, Subject Matter expertise and operational support to staff within Information Management &amp; Technology and the assigned Business unit.&lt;br /&gt;The post holder will work with managers of the assigned unit to support the wider strategic technology development of the defined business unit by providing both operational business support in the development and implementation of the unit’s strategic technology objectives.&lt;br /&gt;As a service delivery manager reporting to theClinical EPR Transformation manager,your responsibilities will include:&lt;br /&gt;• Undertaking strategic planning in relation to application system upgrades, new releases and migration to new systems both local and national&lt;br /&gt;• Providing SME support for all clinical applications in use within the Trust&lt;br /&gt;• Definition of Service Level Agreements (SLA’s) related contracted services&lt;br /&gt;• Ensuring a responsive service is provided to meet SLA’s including the management of resources and prioritisation of workload&lt;br /&gt;• To build services relationships with BHRUT Managers, Services Leads, Clinicians and Technical teams.&lt;br /&gt;• Ensure quality services are delivered and performed to the agreed SLA’s ensuring expectations are achieved or exceeded.&lt;br /&gt;• To ensure that systems, processes and methodologies, as specified are followed to ensure effective monitoring, control and support of service delivery&lt;br /&gt;• Attend directorate and service review meetings; areas covered will include performance reports, service improvements, quality and processes&lt;br /&gt;The post holder will also play a pivotal role in appraising new technologies and facilitate their adoption by the Trust in accordance with national and local strategies. You will make significant contributions to the development and implementation of the Trust’s IM&amp;T strategy.&lt;br /&gt;&lt;br /&gt; • All new staff appointed to posts at the Trust will be subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers - Recruitment Advisor, on 01708 435000 ext. 3861. Further details regarding the post may be obtained by contacting the manager as per the contact details above.&lt;br /&gt;&lt;br /&gt;PEOPLE are at the HEART of everything we do&lt;br /&gt;&lt;br /&gt;We believe that providing the highest quality of care, is about having the best people, inspired and supported by the best leaders, and backed by the best training and career development opportunities.&lt;br /&gt;&lt;br /&gt;Barking Havering and Redbridge University Hospital NHS Trust is committed to Safeguarding Children and Adults at Risk and expects all staff and volunteers to share this commitment.&lt;br /&gt;&lt;br /&gt;All salaries are inclusive of standard allowances e.g. High Cost Area for staff on Agenda for Change contracts.&lt;br /&gt;&lt;br /&gt;Part-time hours and flexible working may be considered if the service is able to accommodate.&lt;br /&gt;&lt;br /&gt;All correspondence regarding this application will be by e-mail.&lt;br /&gt;&lt;br /&gt;Please ensure that the references are from your most recent employer and one of these must be your direct Line Manager or Supervisor. Additionally, ensure that any gaps in your employment history are clearly indicated.&lt;br /&gt;&lt;br /&gt;In order to streamline recruitment with our Trust some of our vacancies may expire prior to the advertised closing date. &lt;br /&gt;&lt;br /&gt;Unfortunately due to the large number of applications that the Trust receives for some posts, it is not possible to reply to every unsuccessful application.&lt;br /&gt;&lt;br /&gt;If you have not received a response within 3 weeks of the closing date of an advert, please assume that your application has been unsuccessful.&lt;br /&gt;&lt;br /&gt;Trust buildings and grounds became fully Smoke Free on National No Smoking Day 11th March 2015. The Trust expects all staff to promote healthy living and to set good examples in their own behaviour. Those not ready to quit smoking must remain smoke free during working hours, and will not be able to smoke in Trust uniform, in Trust grounds including car parks, while driving on Trust business or take smoking breaks. Second hand smoke causes heart and lung disease, and is harmful to young children. However, disposable or rechargeable e-cigarettes (“vaping”) may be used outside hospital buildings.&lt;br /&gt;&lt;br /&gt;We are an equal opportunity employer welcoming applications from all sections of the community and welcomes applications from people wishing to job-share, either with or without a partner. Applicants who consider themselves to have a disability (as defined by the Equality Act 2010) will be shortlisted for interview if they meet the essential criteria. We also operate strict screening procedures for posts with access to vulnerable adults and children.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the trust will be subject to a 6 month probationary period. This will give the staff member an opportunity to become familiar with the culture and working environment.&lt;/p&gt;\n&lt;p&gt;Applications should be&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Site, Romford/Ilford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 8a Senior Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241001", "validThrough": "2020-11-06T23:59:59+0000"}