{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T11:04:05+0000", "description": "&lt;p&gt;Lincolnshire Partnership Foundation NHS Trust (LPFT) is an Improving Access to Psychological Therapies site (IAPT). The opportunity has arisen for a permanent position for a Psychological Wellbeing Practitioner based in Spalding and Stamford. The Service provides evidence based interventions within a stepped care model, for the treatment of people with mild to moderate common mental health problems. This is an exciting opportunity to be part of a major national initiative, which has fundamentally changed the way in which psychological treatments are provided.&lt;/p&gt;\n&lt;p&gt;Post holders will be expected to work at least one evening session a week and possibly Saturdays in the future. There is also the flexibility of some home working.&lt;/p&gt;\n&lt;p&gt;The Psychological Wellbeing Practitioner will work as part of a multi-disciplinary team to provide, assessment and treatment of common mental health problems based on the NICE guidance. These include computerised cognitive behavioural therapy, psycho-educational groups and guided self-help; the majority of interventions will be based on a cognitive behavioural therapy (CBT) approach. Interventions may be delivered as group work or individual work through telephone contact, computer messaging, email or face-to-face. Regular case management and clinical skills supervision will be provided by qualified supervisors. The service has a strong commitment towards Continuing Professional Development (CPD), staff wellbeing and providing quality services.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated individual who is qualified and hold the accreditation for the IAPT LI training course certificate in psychological therapies.&lt;/p&gt;\n&lt;p&gt;For further information regarding this opportunity please contact Barbara Keogh (Team Manager Spalding &amp; Stamford) Barbara.Keogh1@nhs.net or 01775 761855.&lt;/p&gt;\n&lt;p&gt;Closing date: 31st October 2020&lt;/p&gt;\n&lt;p&gt;Interview date: To be confirmed&lt;br /&gt;&lt;br /&gt;Please refer to the job description and person specification for additional information about this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Spalding and Stamford", "postalCode": "PE11 2XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7848", "longitude": "-.155841"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251709", "validThrough": "2020-11-27T23:59:59+0000"}