{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc"}}, "datePosted": "2020-10-29T09:45:56+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The R&amp;D department at SWLTG is looking to recruit an enthusiastic R&amp;D Governance &amp; Clinical Trials Manager to provide support the Director of Research and Development in matters pertaining to R&amp;D. This is a great opportunity for an experienced manager looking to lead on the development of a modern and effective R&amp;D department for the Trust. During the last few years, SWLSTG R&amp;D department and research portfolio have grown stronger, with increased activity and profile.&lt;/p&gt;\n&lt;p&gt;The postholder will lead R&amp;D governance in the Trust, manage the R&amp;D Office and the Clinical Research Unit, leading on the development of strategy, comprehensive research work-plans and business cases. They will manage portfolio, non-portfolio and commercial and industry sponsored drug trial work plans, and network by liaising extensively with the CRN: South London, academic partners, external sponsors and research teams. The postholder will manage governance and contractual requirements in the set-up and initiation of clinical research trials across the various locations within the Trust’s 5-borough catchment area, and if required carry out research activities under the supervision of the AMD R&amp;D. The postholder will complete reports, monitor and prepare budget projections, and work closely with finance. The postholder will lead on the dissemination of information, and R&amp;D training and education for SWLSTG.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Robert M Lawrence, AMD/Director of Research &amp; Development&lt;/p&gt;\n&lt;p&gt;Email address robert.lawrence@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "R&amp;D Governance &amp; Clinical Trials Manager - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247761", "validThrough": "2020-11-12T23:59:59+0000"}