{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 - £31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T09:15:58+0000", "description": "&lt;p&gt;This is an exciting opportunity for a permanent band 6 Eating Disorder Practitioner to join a Sussex wide specialised Family Eating Disorder Service. We are currently seeking one full time clinician, but can be flexible with regard to job sharing.&lt;/p&gt;\n&lt;p&gt;This role will be based at Chalkhill, Haywards Heath but does require some travel across Sussex.&lt;/p&gt;\n&lt;p&gt;Sussex FEDS is a multi disciplinary service working with young people presenting with eating disorders. In this post you will conduct assessments of young people referred to FEDS, as well as support existing patients and their families with completing meals at home according to their treatment plan. A primary goal of the role is to support treatment in the community and prevent hospital admissions. In doing so, you will be a key player in liaising with family, school, medical staff and all professionals involved in the young person&#39;s recovery.&lt;/p&gt;\n&lt;p&gt;You will be part of a strong multidisciplinary team, receiving high standards of clinical supervision. You will have great opportunities for training and collaboration in the treatment and safe management of young people with eating disorders.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Do you want a career in a trust with a 2020 vision of achieving outstanding care and treatment you can be confident in? With a vision that includes becoming the employer of choice? Where our values guide how we do this?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest providers of children and young people&#39;s mental health, our Care Delivery Service (CDS) provides care across Sussex and Hampshire. Supported by our Clinical Academic Group (CAG) we work to put research, innovation and learning into practice.&lt;/p&gt;\n&lt;p&gt;Our services build on our CYP-IAPT learning and &#39;deliver with and deliver well&#39; and we have built the infrastructure to sustain this with our collaborative work with our service users who help shape our transformation with their lived experience. Our psychology and intern infrastructure support the meaningful use of the service wide outcome measures framework.&lt;/p&gt;\n&lt;p&gt;Our offer is for a career not just a job, in a team and a trust committed to delivering the best care possible to the community whilst being committed to the wellbeing of its staff - and endeavoring to show this by how we do, what we do - that our staff are our greatest asset and that staff wellbeing is a key priority.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Kamala Persaud&lt;/p&gt;\n&lt;p&gt;Lead Clinician&lt;/p&gt;\n&lt;p&gt;01444 472670&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chalkhill, Haywards Heath", "postalCode": "RH16 4NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9911", "longitude": "-.093574"}}, "title": "CAMHS Eating Disorder Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257028", "validThrough": "2020-11-19T23:59:59+0000"}