{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22643", "minValue": "22643", "unitText": "YEAR", "value": "£13.47 per hour"}}, "datePosted": "2020-10-30T12:17:02+0000", "description": "&lt;p&gt;Nottinghamshire Healthcare’s Children &amp; Adolescent Mental Health Service is currently recruiting bank workers.&lt;/p&gt;\n&lt;p&gt;We are currently looking for enthusiastic, reliable and adaptable Registered Mental Health Nurses (RMN/RNLD) to join the Trust Bank in supporting CAMHS in providing support to wards and patients in both CAMHS and elsewhere in the organisation. This is an exciting opportunity to be a part of the CAMHS team, while working flexibly at times that suit you and accessing shifts in other disciplines throughout Notts Healthcare.&lt;/p&gt;\n&lt;p&gt;CAMHS services are based at the new Hopewood facility in Sherwood, providing 32 beds and the first dedicated specialist eating disorders inpatient service and first psychiatric intensive care unit for young people in the East Midlands, making this an excellent opportunity to gain experience working with innovative new services. Bank workers will receive supervision, induction, training and support from the CAMHS teams, in addition to specialist bank support from the Trust’s Clinical Nurse Advisors.&lt;/p&gt;\n&lt;p&gt;In addition to CAMHS and Hopewood, we have a range of assignments available with Adult Mental Health Services, Child and Adolescent, and Mental Health for Older People services. The areas include Highbury Hospital, Mapperley, Rehabilitation Units both at Mapperley and Mansfield, Millbrook Mental Health Unit, Sutton in Ashfield and Bassetlaw Hospital, Worksop.&lt;/p&gt;\n&lt;p&gt;Candidates require at least 6 months of nursing experience in mental health care settings within the past 2 years and be able to demonstrate continuous professional development. The role requires a clinician with specialist skills to assess patient’s needs, analyse and develop treatment plans within a multidisciplinary framework. Existing experience and/or passion for working with children and young people is ideal.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, patient-focused service we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive pay&lt;/li&gt;\n&lt;li&gt;Flexible work that can fit around your other commitments&lt;/li&gt;\n&lt;li&gt;Access to NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Access to essential training and development opportunities&lt;/li&gt;\n&lt;li&gt;Support from an in house Clinical Nurse Advisor&lt;/li&gt;\n&lt;li&gt;Experience gained by working in a variety of environments&lt;/li&gt;\n&lt;li&gt;Flexible hours of work and freedom to choose shifts depending on your availability and the requirements of the ward/unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that the closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to avoid disappointment.&lt;/p&gt;\n&lt;p&gt;Please email staffbankrecruitment@nottshc.nhs.uk with any queries in the first instance to be forwarded on to relevant parties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmily ShipmanJob titleActing Service Manager (CAMHS Inpatient)Email addressemily.shipman@nottshc.nhs.ukTelephone number0115 9691300 x 10156Additional contact information&lt;/p&gt;\n&lt;p&gt;Nathan Turner (Clinical Nurse Advisor) nathan.turner@nottshc.nhs.uk 0115 9691300 x 13890&lt;/p&gt;\n&lt;p&gt;Amanda Stones (Clinical Nurse Advisor) amanda.stones@nottshc.nhs.uk 0115 9691300 x 14590&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Inpatient Units, Nottinghamshire", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Bank Registered Mental Health Nurse (Children &amp; Adolescent Mental Hea", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250141", "validThrough": "2020-11-09T23:59:59+0000"}