{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "Pro Rata £38,890 Per Annum"}}, "datePosted": "2020-10-16T17:05:40+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About our service&lt;/span&gt; Mountain Healthcare is a leading provider of clinical based services who have a genuine concern for our clients, a sincere appreciation for our employees, and we want to do good things for other people. Mountain is built on core principals and commitments including quality, integrity, respect, kindness, courage, innovation and enjoyment. These values drive the understanding we care for our customers with and have helped us grow into the passionate company we are today. We are currently seeking Registered Mental Health Nurse for a Secure Children’s Centre. This modern, safe and secure bedded unit caters for boys and girls aged between 10 and 17. It is inspected by Ofsted and approved and licensed by the Department for Children, Schools and Families. The centre comes under Sheffield City Council Children and Young People’s Directorate and has been rated Outstanding / Good in Ofsted inspections with the Youth Justice Board consistently rating as performing at the highest level. The purpose of the centre is to serve both local and national communities by looking after those children and young people who need a safe and controlled yet child centred secure residential environment in order to prevent harm to themselves or to others.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Position Summary&lt;/span&gt; Healthcare Manager and Registered Mental Health Nurse with CAMBS experience. The Healthcare Manager will ensure smooth running and co-ordinating all aspects of the Healthcare element in the secure Home for Children and Young people while demonstrating Key Performance Indicators including Quality Schedule and CQC standards being met to MHL Directors and NHSE Commissioners. The RMN duties will include supporting our child &amp; young people (CYP) in maintaining their physical health, mental health, safety and overall wellbeing through monitoring, recording and reporting observations in these areas. The successful candidate will be expected to attend appointments in the community, LAC reviews, child protection and child in need meetings inclusive of core groups, CPAs, professionals’ meetings and to liaise with the educational team within the centre. The centre offers therapy and education on site and the overall focus is to achieve positive outcomes for CYP, we do this through multi agency working, personalised care planning and creating positive attachments.&lt;/p&gt;\n&lt;p&gt;Working Pattern: WTE 0.8, Flexible 32 hours per week, applicant must be able to work every Wednesday.&lt;/p&gt;\n&lt;p&gt;Candidates must be available to start the position on 1st February 2021.&lt;/p&gt;\n&lt;p&gt;Education:Degree in Mental Health Nursing required &amp; full NMC PIN&lt;/p&gt;\n&lt;p&gt;Experience:Minimum 3 years clinical experience in direct patient care as a Registered Mental Health Nurse -Essential&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful candidates will be subject to pre-employment checks including; an Enhanced DBS check and 2 satisfactory references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S17 3ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3344", "longitude": "-1.53764"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231222", "validThrough": "2020-11-15T23:59:59+0000"}