{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 Per annum"}}, "datePosted": "2020-11-03T12:16:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Medicine &amp; Emergency Care - Band 5/6 Virtual Nursing Recruitment Campaign &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Sandwell and West Birmingham NHS Trust if you have ambitions we want to help you achieve them.&lt;/p&gt;\n&lt;p&gt;Are you looking to be part of a dynamic organisation with an overall aim to deliver outstanding patient care? Do you have excellent clinical skills and a desire to further develop your knowledge and skill base?&lt;/p&gt;\n&lt;p&gt;SWB is hosting a virtual recruitment event for Band 5/6 registered nurses of all experiences and backgrounds. During the month you will have opportunity to book ‘virtual coffee’ chats with leads, PDNs and HR to provide you with a flavor of what working for the Trust will be like. You will also be able to book virtual interview slots throughout October 19th and November 20th in order to accommodate times which suit you and safeguard all parties by maintaining social distancing.&lt;/p&gt;\n&lt;p&gt;During the event candidates will be able to learn about the opportunities within the medical and emergency departments and the family-friendly flexible working hours we offer, which include permanent nights and weekend shifts as well as 7.5 hour shifts.&lt;/p&gt;\n&lt;p&gt;Medicine is a diverse and expanding service at SWB. Over the last twelve months the Trust has made significant investment across our wards and services. The medical service is an innovative and progressive group of the Trust, which will support you in expanding and growing your career pathways. If you desire opportunities to grow in your clinical practice, leadership skills or management portfolio we will help you get them.&lt;/p&gt;\n&lt;p&gt;The services we are recruiting to across City and Sandwell sites include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Emergency Care&lt;/li&gt;\n&lt;li&gt;Elderly Care&lt;/li&gt;\n&lt;li&gt;Stroke &amp; Rehabilitation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are seeking experienced and newly qualified registered nurses who are passionate about delivering person centred care, enhancing patient experience and outcomes.&lt;/p&gt;\n&lt;p&gt;This is a really exciting time for the Trust with the opening of the brand new Midland Metropolitan University Hospital (MMUH). Opening in 2022 MMUH will house one of the largest A&amp;E departments in Europe; bringing together teams provide acute and emergency care. The new hospital will offer maternity, children’s and inpatient adult services to half a million people with state of the art medical equipment and facilities.&lt;/p&gt;\n&lt;p&gt;We promise to provide you with exciting opportunities across the patient journey. We have dedicated practice development nursing teams who will support you through your nursing career. As a band 5 recruit you will be working in a supernumerary capacity for the first 6 weeks of commencement within the role with a bespoke induction package to ensure that you are fully trained and supported into the #SWBfamily. We can offer a range of flexible working times to provide a commitment to you in regard to work life balance and wellbeing.&lt;/p&gt;\n&lt;p&gt;We recognise that outstanding nursing is fundamental and we drive to deliver the safest and highest quality patient care. Therefore your commitment to us will be nurtured and reflected through your career journey at the Trust.&lt;/p&gt;\n&lt;p&gt;Staff benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Onsite free gym on both hospital sites&lt;/li&gt;\n&lt;li&gt;Childcare facilities&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Savings with local supermarkets / national and local discounts&lt;/li&gt;\n&lt;li&gt;Financial Wellbeing Hub through Neyber&lt;/li&gt;\n&lt;li&gt;Subsidised purchase schemes for new technology&lt;/li&gt;\n&lt;li&gt;And much more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To ensure a smooth and swift transition into your new role, once you have been interviewed, the recruitment will be on hand to begin your virtual pre-employment checks. In order for us to do this, please ensure you have the following documents to hand so that we can begin processing these necessary checks.&lt;/p&gt;\n&lt;p&gt;We will need to see the following (original and valid) documents:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passport or relevant Right to Work documentation&lt;/li&gt;\n&lt;li&gt;Driving licence&lt;/li&gt;\n&lt;li&gt;Proof of your current address in the form of a recent utility bill or bank statement&lt;/li&gt;\n&lt;li&gt;Proof of your National Insurance number&lt;/li&gt;\n&lt;li&gt;Proof of any changes of name if applicable&lt;/li&gt;\n&lt;li&gt;Qualification certificates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please contact the SWB Recruitment Department on 0121 507 5070 for any queries relating to these checks.&lt;/p&gt;\n&lt;p&gt;For more information about the roles on offer, or to arrange an interview or virtual chat please email swbh.Medicine_ec_nursevacancyenquiry@nhs.net, providing your contact details along with details of the speciality you are interested in and availability to arrange help us arrange a time suitable to you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressswbh.medicine_ec_nursevacancyenquiry@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmimgham, Sandwell and West Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Staff Nurse - Medicine and Emergency Care Open Day", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253931", "validThrough": "2020-11-08T23:59:59+0000"}