{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa pr"}}, "datePosted": "2020-11-05T16:48:14+0000", "description": "&lt;p&gt;COMMUNITY NURSING – Planned care&lt;/p&gt;\n&lt;p&gt;1 x 37.5hrs&lt;/p&gt;\n&lt;p&gt;1 x 30hrs&lt;/p&gt;\n&lt;p&gt;Post: Band 6 Community Nursing Sister / Charge Nurse&lt;/p&gt;\n&lt;p&gt;Full time Post based within the planned community nursing teams&lt;/p&gt;\n&lt;p&gt;The Planned community nursing team operates 7 days per week between the hours of 8.30 and 17.00 whilst Unplanned offer a 24 hour service&lt;/p&gt;\n&lt;p&gt;RDaSH is a diverse Organisation, operating services in 200 locations across Rotherham, Doncaster, North Lincolnshire and North-East Lincolnshire.&lt;/p&gt;\n&lt;p&gt;The community nursing service is located in the Doncaster Care Group, with an integrated Physical and Mental health model developing through the community services, across four localities. The service is part of a forward thinking Organisation, which supports development and innovation at all levels to enhance the quality of patient care and service development.&lt;/p&gt;\n&lt;p&gt;Applications are invited from forward thinking, highly motivated clinicians who are able to demonstrate clinical knowledge and skills with evidence of leadership experience.&lt;/p&gt;\n&lt;p&gt;As the District Nurse Sister / Charge Nurse for your team you will be responsible for the Management of your team and your caseload. You will holistically manage the patient care on your caseload through a Case Management approach the aim of which is to support patients to remain in their own homes, promoting self-care and independence.&lt;/p&gt;\n&lt;p&gt;You will need excellent interpersonal and communication skills, the ability to negotiate, priorities, manage time effectively, work on own initiative and the ability to work under pressure in a rapidly changing environment.&lt;/p&gt;\n&lt;p&gt;You will contribute towards the ongoing improvement of community services in Doncaster through participation in audit and the development of best practice.&lt;/p&gt;\n&lt;p&gt;Furthermore you would have a key role in continuing education through staff appraisals and training and will contribute to the creation of a clinical area that encourages practice development, positive learning and disseminate information on developments.&lt;/p&gt;\n&lt;p&gt;Post holders must be able to demonstrate competence and confidence in a wide range of relevant clinical skills and knowledge.&lt;/p&gt;\n&lt;p&gt;We welcome applications from those candidates who are currently undertaking the Community specialist Practitioner course. Those successful at interview will only be offered a post on completion of the course and qualification attained&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Sharon Cooper 01302 566853&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Essential Criteria &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse with Community specialist practitioner qualification – District Nursing Experience of leading a team and managing a caseload&lt;/li&gt;\n&lt;li&gt;Effective IT Skills&lt;/li&gt;\n&lt;li&gt;Awareness of national strategic professional nursing issues and key NHS policy drivers&lt;/li&gt;\n&lt;li&gt;Critical reflection on own experience and professional practice&lt;/li&gt;\n&lt;li&gt;High levels of judgement, discretion and decision making&lt;/li&gt;\n&lt;li&gt;Car driver or able to be independently mobile in a suitable vehicle with all essential equipment. A car driver or the ability to be independently mobile in a suitable vehicle.&lt;/li&gt;\n&lt;li&gt;Community experience&lt;/li&gt;\n&lt;li&gt;Mentor qualification.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Desirable Criteria&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN5 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5561", "longitude": "-1.1498"}}, "title": "Community Specialist Practitioner - DN Sister/Charge Nurse (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258638", "validThrough": "2020-11-26T23:59:59+0000"}