{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-11-06T15:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Medicine, Cancer and Emergency Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gynaecology Multi-Disciplinary Team Co-Ordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS Cancer Plan sets out a number of commitments and targets relating to waiting times for treatment. Each tumour site specific Multi-Disciplinary Team (MDT) is responsible for the discussion and agreement of individual patient’s diagnosis and treatment plans. This is an essential element of the services provided for each tumour site and the MDT Co-ordinator is responsible for ensuring that all cancer patients are discussed. The recording of information relating to the meetings and to the individual patients discussed is a major function of this role, in particular accurate and timely monitoring information in respect of the waiting times targets must be collected, validated and reported. MDT Co-ordinators must work together as part of the Cancer Services Team and to ensure cross cover and continuity of service across all site-specific tumour MDT’s.&lt;/p&gt;\n&lt;p&gt;MDT Co-ordinators must have a knowledge and understanding of patient pathways and be responsible and proactive in the monitoring of cancer targets – particularly in the identification of potential breaches. To do this they must have excellent communication skills and be able to work effectively as part of a team and to be confident and able to liaise with staff at all levels. This role is to cover MDT Co-Ordinators for periods of leave and you will also be responsible for inputting data for patients on a cancer pathway and helping the MDT Co-Ordinators manage their tracking lists when not covering an MDT.&lt;/p&gt;\n&lt;p&gt;If you are interested and would like to discuss this vacancy in more detail please contact either Sharon Willoughby Ext 4964 or Michelle McCann Operational Manager for Cancer &amp; Haematology on 01322 428376&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle McCannJob titleOperational Manager for Cancer and HaematologyEmail addressmichelle.mccann1@nhs.netTelephone number01322428376&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darenth Valley Hospital, Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Gynaecology Multi-Disciplinary Team Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260325", "validThrough": "2020-11-15T23:59:59+0000"}