{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T12:31:13+0000", "description": "&lt;p&gt;We are seeking an innovative enthusiastic Nurse, Occupational Therapist or Physiotherapist, with an understanding of the services in the community who support acutely unwell patients in their own home . This exciting initiative will aim to identify patients and facilitate their discharge from A&amp;E safely home. The post holder will work closely with A&amp;E colleagues to identify patients for discharge home. The Rapid Response service supports the Trust’s Unscheduled Care Agenda providing an alternative pathway that will treat people at home in order to reduce unnecessary hospital admissions and facilitate early safe discharge. &lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to further develop your clinical assessment and negotiation skills&lt;br /&gt;&lt;br /&gt;The post holder will work as a member of the multi-disciplinary team Rapid Response’s aim is to preventing hospital admission or facilitating early discharge from hospital by providing intensive packages of care to manage acutely and chronically ill patients at home. &lt;br /&gt;&lt;br /&gt;Rapid Response is a multi-disciplinary team with support workers, physiotherapists, occupational therapists, social workers and Nurses providing integrated skills and sharing knowledge.&lt;/p&gt;\n&lt;p&gt;The post holder will work collaboratively with others to identify appropriate patients for discharge. &lt;br /&gt;&lt;br /&gt;You will have experience of working collaboratively within a community or acute setting. The post-holder will have excellent assessment, and intervention skills. You will be able to carry out comprehensive assessments and make autonomous decisions based on the data obtained. &lt;br /&gt;&lt;br /&gt;The role requires good communication skills and the ability to work as an effective member of a multi-disciplinary nurse led team as well as with other external agencies.&lt;/p&gt;\n&lt;p&gt;The service will operate 7 days a week. You will be required to undertake some Bank Holiday evening and weekend work. Initial fixed term until March 2021.&lt;/p&gt;\n&lt;p&gt;Part time job share full time considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSue TownsonJob titleTeam leaderEmail addresss.townson@nhs.netTelephone number01253 951068Additional contact information&lt;/p&gt;\n&lt;p&gt;Sue Townson&lt;br /&gt;Team Leader &lt;br /&gt;01253 951068&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Football Stadium, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Senior Assessor Rapid Response South", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252052", "validThrough": "2020-11-16T23:59:59+0000"}