{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 Per Annum"}}, "datePosted": "2020-11-03T12:15:33+0000", "description": "&lt;p&gt;&lt;span&gt;With increasing degree of sub-specialisation in colorectal surgery there has been a growing demand for advanced training in rectal cancer surgery. The colorectal unit at Portsmouth Hospitals University (PHU) has hosted the Robotic TME fellowship for over 6 years. The fellowship is offered for 6 or 12 months and is aimed at peri-CCT trainee or early year consultant. This job offers an excellent opportunity to acquire advanced skills needed for Robotic TME surgery. PHU is a high-volume unit with the largest experience in the UK for robotic colorectal surgery. Exposure to robotic CME surgery, multi-visceral resections, lateral pelvic lymph node dissection is also offered on a dual console system. The fellowship is accredited and approved by the Royal College of the Surgeons of England. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The unit has the largest experience of minimal access rectal cancer surgery within the UK with &gt;1000 Lap/ Robotic TME cases. We operate on 300 colorectal cancers per year which includes around 100 rectal cancers. Over 92% of colorectal resections are performed laparoscopically or robotically. Exposure in a high-volume centre with hands-on training provides invaluable training with ample opportunities for research and publications. There is also an opportunity to become part of multicentre trials. This post is available from April 2021 and will be for a period of 6-12 months. We may appoint two or three applicants for 6 months each, in succession.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;During this placement the trainee will be exposed to a large volume of elective and emergency laparoscopic &amp; robotic colorectal work. Main areas of interest will include rectal cancer surgery, Lap TME, Robotic TME, pouch surgery, TEMS and APER. Primary clinical focus of the job will be operative exposure in theatre, postoperative care of inpatients, outpatients’ clinics with one stop flexible sigmoidoscopy service, and day case surgery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested candidates are invited to contact Mr Jim Khan (&lt;/span&gt;&lt;span&gt;jim.khan@porthosp.nhs.uk&lt;/span&gt;&lt;span&gt;) for informal discussion.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date 25/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date 07/12/2020&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Clinical Fellow - Colorectal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253891", "validThrough": "2020-11-25T23:59:59+0000"}