{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23761", "minValue": "21089", "unitText": "YEAR", "value": "£21,089 - £23,761 per annum"}}, "datePosted": "2020-10-30T10:46:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Closing date: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that NPC is a wholly owned subsidiary of Northumbria Healthcare NHS Foundation Trust. The successful applicant will be an employee of the subsidiary &lt;strong&gt;and not &lt;/strong&gt;the NHS. Please note the terms and conditions are closely aligned to that of the NHS&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Northumbria Primary Care for a Band 4 Registered Pharmacy Technicians to join the team, supporting a group of GP practices within the Whitley Bay Primary Care Network. The successful candidate will work closely with clinical and administrative colleagues to process a wide range of medication related tasks.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Technician role is a new development within NPC and we expect the successful candidate to contribute to the delivery of a comprehensive primary care medicines management system acting on current best practice / service change requests from our Clinical Commissioning Group (CCG). The Pharmacy Technician will be required to undertake activities predominantly at a practice level, but will need to be flexible to work to the wider demands of the network. You will be enrolled and supported through the CPPE Primary Care Pharmacy Education Pathway (PCCPEP) which will give you an excellent education in Primary Care and assist you in developing your career.&lt;/p&gt;\n&lt;p&gt;The role will contribute to the efficient and effective delivery of medicines to patients e.g. medicines supply, drug administration, actioning of discharge summary medication changes, liaising with care homes re prescription queries and supporting the organisation move towards online prescription services. Completing audits and quality improvement tasks for practices. An understanding of primary care operations and use of SystmOne or Emis Web would be an advantage but is not essential.&lt;/p&gt;\n&lt;p&gt;Our Clinical Support Unit team includes Medicines Technicians, Pharmacy Technicians and Pharmacists and this support has proven to be a valuable addition to NPC, the role has released a significant amount of GP time to be invested in patient facing appointments. We have also seen the quality of our prescribing improve as a result. This role is required due to the incredibly positive feedback received within the organisation and further practices wishing to access this model of delivery. We foresee the team growing further in the near future, why not take this opportunity to join NPC at this exciting time.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jayne Blackburn - Operational Development Manager&lt;/p&gt;\n&lt;p&gt;jayne.blackburn2@nhs.net&lt;/p&gt;\n&lt;p&gt;07876845914&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitley Bay Primary Care Network, Ponteland", "postalCode": "NE20 9SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0518", "longitude": "-1.7497"}}, "title": "Pharmacy Technician (Primary Care)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249790", "validThrough": "2020-11-15T23:59:59+0000"}