{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615 per annum"}}, "datePosted": "2020-10-12T17:00:58+0100", "description": "&lt;p&gt;The Endoscopy Unit at Southend Hospital is going through a major transition with aspirations of obtaining JAG accreditation. We are looking for nurses who aspire to working in a busy dynamic environment. Southend Hospital has a deserved reputation for patient outcomes and experience which is a reflection of our workforce and its high standards. Working here is a genuine team working experience where staff are valued and actively supported to further develop skills and knowledge. An opportunity has arisen for committed Band 5 nurses to join our highly motivated and vibrant Endoscopy team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Endoscopy unit currently operates a 5 day service, Monday to Friday, 8am until 6pm.At present we do NOT work night shifts, weekends or bank holidays. We also have an out of hour’s emergency service which is covered by all the nurses. You will be expected to be part of the on call bleed rota&lt;/p&gt;\n&lt;p&gt;The unit currently has 3 procedure rooms and an 8 bay endoscopy recovery area. Patients have various Endoscopy procedures including, colonoscopies, gastroscopies, and PEG insertions, E.R.C.P’s, EBUS and Bronchoscopy’s.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic nurses who have consolidated their learning with post-registration experience at band 5 level in an acute setting and who show a commitment to personal and professional development.&lt;/p&gt;\n&lt;p&gt;Experience in Endoscopy is desirable, however, training and supervision will be given to the successful applicant enabling them to gain skills in both diagnostic and therapeutic Endoscopy and the assessment of patients prior to, during and post procedures.&lt;/p&gt;\n&lt;p&gt;We offer a comprehensive induction programme, and actively encourage staff to attend a variety of study day based training. We have a dedicated Clinical Practice Facilitator who will help oversee your professional development.&lt;/p&gt;\n&lt;p&gt;Our focus is always to provide the best possible patient care and our team values reflect those of the Trust: Safety, Kindness, Teamwork and Improving.&lt;/p&gt;\n&lt;p&gt;If you are as passionate about patient care as we are, we want to hear from you. If you don’t like working nights, weekends and Bank Holidays then don’t miss this wonderful opportunity to work on our unit to become an expert in the field of Endoscopy and Gastroenterology nursing!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDonna KellyAdditional contact information&lt;/p&gt;\n&lt;p&gt;Emma.Matthews@southend.nhs.uk&lt;br /&gt;Endoscopy&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital NHS Trust, Southend on Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Endoscopy Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223286", "validThrough": "2020-11-09T23:59:59+0000"}