{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "From £31,365 per annum"}}, "datePosted": "2020-11-03T16:30:50+0000", "description": "&lt;p&gt;This is a fixed-term/secondment for 6 months. If you are an internal candidate on a substantive contract you may only apply for a secondment. Please ensure you have the support of your current line manager before applying. At the end of your secondment you will return to your current post at your current grade.&lt;/p&gt;\n&lt;p&gt;THIS POST IS AVAILABLE TO ALL APPLICANTS WHO CAN DEMONSTRATE RELEVANT PROFESSIONAL REGISTRATION&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a suitably qualified practitioner (Social Worker / Occupational Therapist / Mental Health Nurse) to progress their career pathway within the BANES Recovery Team.&lt;/p&gt;\n&lt;p&gt;The team provides care, treatment and support to service users aged 18-65 with secondary mental health needs. There are a variety of referral routes. The team is an integrated health and social care team and as such also performs delegated functions on behalf of the local authority. The service users accessing support from the team do not have to undergo separate referrals, rather we work with the person holistically and are able to support them with both their health and social care needs. This is an excellent opportunity to develop or maintain varied skills, and to work in the person centred and strengths focused way that fits so well with the role of a CPN.&lt;/p&gt;\n&lt;p&gt;As a care coordinator, your focus will be on high quality formulation and delivery of recovery focused interventions. You will carry a caseload and contribute toward assessment, planning, implementation and review of care. Your unique skills will be valued and utilised. The team also works closely with primary care and other health and social care agencies, in addition to other local mental health teams, such as the Intensive Service, Primary Care Liaison Service, and inpatient services.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with a passion for mental health, and with strong assessment, care planning, risk management and intervention skills. You can expect to receive excellent supervision and to be able to engage with support from a range of highly skilled practitioners within the senior team to support you in your role. The work can be demanding, but within a supportive and skilled team. We are looking for someone who is committed to providing high quality support to our service users and those who care for them. If this sounds like a good fit, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We would invite anyone interested in applying for this role to contact us for a further chat or to facilitate a visit to the team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Charlotte Kitama-Brown, Team Manager on 01225 731 631 or charlotte.kitama-brown@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath NHS House, Bath", "postalCode": "BA1 3QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3886", "longitude": "-2.39231"}}, "title": "Band 6 Specialist Recovery Practitioner - Bath NHS House", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254794", "validThrough": "2020-11-17T23:59:59+0000"}