{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per Annum"}}, "datePosted": "2020-10-30T14:16:32+0000", "description": "&lt;p&gt;Would you like to join a growing team and be part of transforming services for those who have a diagnosis of personality disorder and complex emotional needs?&lt;/p&gt;\n&lt;p&gt;As a result of the extra investment that is coming into Mental health services as part of the NHS Long term Plan, we are excited to be able to expand and transform what we offer to this service user group and their families. We are in the process of recruiting a senior MDT that will shape and drive these changes. This investment will allow us to strengthen our teams across Nottinghamshire and Bassetlaw and forms the first part of a larger expansion across all elements of our developing stepped care integrated model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a Clinical Nurse Specialist for Personality Disorder services working as part of a senior MDT providing direct clinical work, managerial and clinical supervision, training and supporting service development. You will be a visible point of contact to staff requiring guidance, expertise and support in the delivery of high quality, person-centred care, compassionate care across the Personality Disorder Pathway. You will require excellent clinical and leadership skills and demonstrate core values that place individuals at the heart of their care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a qualified nurse and be registered with the NMC. You will be educated to Master’s level or equivalent. Experience and expertise in working with those with personality disorder is essential. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of a senior team that will oversee the development of and support to personality disorder services in line with National guidance. You will be part of AMH services and contribute to the implementation of the NHS LTP to improve outcomes for the local population. You will report to the Clinical Strategic Lead for Personality Disorder and join a strong senior team delivering this transformation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to have an informal conversation, please contact Andrea Cockram, Nurse Consultant AMH on either andrea.cockram@nottshc.nhs.uk or 0115 9691300 ext. 12663&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highbury Hospital, Bulwell, Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Clinical Nurse Specialist – Personality Disorder", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250510", "validThrough": "2020-11-15T23:59:59+0000"}