{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-03T09:25:08+0000", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking to start a career in one of the UK’s most respected mental health trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to those with mental health problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; This is an exciting opportunity to join the FIND (Forensic Service for People with Intellectual and Neurodevelopmental Disorders) team at one of the country’s most respected providers of secure mental health services.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;An opportunity has arisen to be part of this inspiring team as an administrator. The post holder will provide comprehensive administrative support to the team. There will be an expectation for the post holder to be highly motivated, flexible and multi-skilled with excellent organisational skills. The post holder will have high standard of skills using Microsoft Office packages and experience of using bespoke IT systems.&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Your base will be at Langdon Hospital in Dawlish, however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions. &lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;The FIND service works with people who have neurodevelopmental disorders, including learning disability, autistic spectrum condition and acquired brain injury, with forensic needs (in low and medium security) who are showing high levels of distress that could present risks to other people. The aim is to support service users through the secure care pathway back to the community. The service aims to reduce length of stay for secure care patients and also help reduce the use of out of area or specialist beds, and to support/facilitate the use of South West Network beds for these patients where possible.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. If you are looking to relocate to the fabulous county of Devon we have a relocation package that may be suitable for you.&lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training - including opportunities to work in different services to build your experience and skills&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Living in Devon offers you a fantastic lifestyle and a beautiful place to live and work and particularly if you work at Langdon Hospital – even your commute to work can lead you alongside the coast or over the moors. Throughout the county there are exceptional schools, and you’ll never be short of activities to fill your evenings and weekends – from cycling, walking and water sports to city shopping trips, theatre trips, bustling nightlife and great restaurants.&lt;/p&gt;\n&lt;p&gt;If you’re looking for an innovative and rewarding place to work, plus a beautiful place to live, then joining Devon Partnership NHS Trust is the right place for you&lt;/p&gt;\n&lt;h1&gt;&lt;em&gt;Great place to work. Great place to live&lt;/em&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Business Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253265", "validThrough": "2020-11-17T23:59:59+0000"}