{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806 per annum"}}, "datePosted": "2020-11-05T21:15:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Internal to NHS Wales Employees only - Secondment until 31st March 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Public Health Wales is the National Public Health Institute in Wales and our purpose is &lt;strong&gt;&lt;em&gt;Working to achieve a healthier future for Wales&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;This is an extremely exciting time in such a pivotal national leadership role.&lt;/p&gt;\n&lt;p&gt;We have recently created our ambitious new Long Term Strategy, 2018 – 2030, which will enable us to focus on how we can best work with our partners and the public to have maximum impact in transforming health and wellbeing and reducing health inequalities in Wales.&lt;/p&gt;\n&lt;p&gt;The COVID-19 pandemic has required all organisations to refocus their strategic and operational priorities. Working with our partners, Public Health Wales has a key system leadership role in our pandemic response. This includes in providing specialist advice to Welsh Government, working with our partners and the public, to take actions to suppress and control the virus, and promoting a wider public health approach to population health and well-being to address inequalities in health. Our new Operational Plan describes how we are approaching this; including re-mobilising our workforce and ensuring key services are reactivated.&lt;/p&gt;\n&lt;p&gt;The Public Health Services Directorate is responsible for a portfolio of Health Protection, Microbiology and Screening services. In responding to and learning lessons from the challenges of COVID-19, we continue to transform our services to deliver a world-class service for the prevention, management and control of health protection threats as well as our many screening services.&lt;/p&gt;\n&lt;p&gt;With the imminent retirement of the Executive Director of Public Health Services, we are now looking to second an Interim Deputy Director of Public Health Services to support the Acting Executive Director over the next period.&lt;/p&gt;\n&lt;p&gt;This is a national leadership role in Wales with responsibility for supporting the Acting Executive Director and, on their behalf, leading the development and delivery of an agreed portfolio of responsibilities. In addition to offering experience in directorate leadership and management, this is a particularly focused role during the COVID-19 pandemic, with a strong element on senior stakeholder relationship management as appropriate including with the Welsh Government, the NHS, local authorities, emergency response partners and the local resilience forums and public health bodies in the wider United Kingdom (UK).&lt;/p&gt;\n&lt;p&gt;For a confidential discussion please contact Andrew Jones&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew JonesJob titleInterim Director of PHSEmail addressandrew.jones10@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124752.jpg", "name": "Public Health Wales NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124752"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Capital Quarter 2, Cardiff", "postalCode": "CF10 4BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.476", "longitude": "-3.17017"}}, "title": "Interim Deputy Director of Public Health Services (Internal to NHS Wa", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258814", "validThrough": "2020-11-12T23:59:59+0000"}