{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (plus HCAS)"}}, "datePosted": "2020-10-28T10:16:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Health and Social Care Service (CHSCS) - Redbridge&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Permanent Community Nurse Band 5 - Community Health and Social Care Fairlop Locality&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Are you looking for a fresh challenge, are you committed to the delivery of high quality patient care and keen to be part of a team where your ideas and opinions are valued then look no further.&lt;br /&gt;&lt;br /&gt;NELFT are seeking enthusiastic and highly motivated Registered Nurses to complement our skill mix within the CHSCS across Redbridge. The Community Nurse will support with the provision of holistic health care as delegated within own level of agreed competency, to patients, families/Carers in their own homes, to include residential care homes and in nurse led clinics.&lt;br /&gt;&lt;br /&gt;The role encompasses treatment, advice and teaching within the professional competence of the post holder and applicants need to demonstrate a commitment to the provision of high quality evidence based care. &lt;br /&gt;&lt;br /&gt;The ideal candidate must be a registered nurse (Part 1) and will work as a member of the integrated community health care team, working within and across professional and organisational boundaries. Liaising with GPs, other professionals and statutory and voluntary agencies he/she will deliver individualised care to patients under the supervision of the District Nurse.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Essential criteria for this post include:&lt;br /&gt;•The ability to work as an effective member of a multi-disciplinary Primary Health Care Team, &lt;br /&gt;•Ability to demonstrate knowledge of key issues in Primary Care Services&lt;br /&gt;•Excellent verbal and written communication skills.&lt;/p&gt;\n&lt;p&gt;Full UK Driving Licence and access to a car for work purposes&lt;br /&gt;&lt;br /&gt;The post holder will demonstrate an awareness of current evidence based approaches to patient care and be actively involved in the development of local strategies and contribute to Service improvement and redesign&lt;br /&gt;&lt;br /&gt;NELFT has a multi-cultural and ethnically diverse population which offers a wide spectrum of healthcare challenges which can be both complex and rewarding. As part of our Community Health Service commitment to improve the working lives of our staff we offer flexible working arrangements, childcare vouchers, family-friendly policies and staff benefits including an excellent pension scheme.&lt;/p&gt;\n&lt;p&gt;We are committed to providing a culture of continuous learning, which actively supports the professional and personal development of our staff.&lt;br /&gt;&lt;br /&gt;Applicants will have NMC Registration and demonstrate the ability to innovate and motivate. Applicants are required to evidence a full UK driving licence and the ability to travel to a variety of sites (This criteria will be reasonably adjusted to meet the requirements of a disabled applicant). This position involves working weekends &amp; some bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is eligible for the Trust &#39;Welcome to NELFT&#39; Payment, a lump sum of 10% of agreed basic salary excluding HCAS and is open to all &lt;strong&gt;&lt;span&gt;new&lt;/span&gt;&lt;/strong&gt; applicants who are successfully appointed. Payment of the incentive is 50% of the lump sum at the end of the probationary period (typically six months) and then 50% at the end of year two. This welcome package is applicable to &lt;strong&gt;&lt;span&gt;external&lt;/span&gt;&lt;/strong&gt; candidates only.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameValerie MurrayJob titleClinical Nurse LeadEmail addressvalerie.murray@nelft.nhs.ukTelephone number07939193313Additional contact information&lt;/p&gt;\n&lt;p&gt;Valerie Murray&lt;/p&gt;\n&lt;p&gt;Clinical Nurse Lead&lt;br /&gt;valerie.murray@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Health &amp; Social Care Fairlop Locality, Redbridge", "postalCode": "IG6 1HZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5873", "longitude": ".081483"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246021", "validThrough": "2020-11-11T23:59:59+0000"}