{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-26T16:00:32+0000", "description": "&lt;p&gt;We are looking for an experienced mental health nurse to join our inpatient team within the Unity Centre.  There are a number of vacancies across The Unity Centre, which provides care to services users of a Working Age.&lt;/p&gt;\n&lt;p&gt;You will be working within acute inpatient services, in an environment where excellent communication skills are essential in gaining a clear understanding of our service users’ particular needs, so to work collaboratively with them to support them in their recovery and care pathway. You will be friendly, approachable and professional with a confident and capable approach that will instil confidence in others. You will have a solution focused approach and a can do attitude and the ability to develop helpful and respectful relationships with service users, peers and MDT colleagues that foster teamwork and positive attitudes.&lt;/p&gt;\n&lt;p&gt;As a Deputy Ward Manager/Senior Clinical Practitioner on a busy inpatient unit, you will support the Ward Manager in the provision of high quality care for adults with a wide range of mental health problems.  You will be confident, have good people skills and able to challenge tactfully and constructively and able to gain the respect and confidence of nursing, medical and MDT staff.   You will act as a source of expertise to the nursing team, service users’, and their carers and the MDT.  You will have ample opportunity to build your skills in leadership, management and development of staff, acting as a positive role model and facilitating preceptorship with newly registered nurses.  We would like you to have a mentorship qualification or be working towards this.   &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work a 24hr shift system so to ensure clinical leadership is provided across the day and night.  You will also be supported to gain invaluable experience and grow in confidence as part in our duty senior nurse rota, taking lead on site responsibility for the two acute wards, Older peoples ward, 136 and PICU out of hours.&lt;/p&gt;\n&lt;p&gt;Please note the working pattern for this position is 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to contact Laura Garfoot (Walton Ward Manager) on 01924 316084.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Deputy Ward Manager / Senior Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243273", "validThrough": "2020-11-10T23:59:59+0000"}