{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum + Outer HCAS"}}, "datePosted": "2020-11-03T16:46:04+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Senior Occupational Therapist&lt;/span&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Enfield Rapid Access Service (ERAS) provides two clinical pathways to the residents of the London Borough of Enfield, is expanding and we are looking for a dynamic and motivated Band 7 Senior Occupational therapist to join our multidisciplinary team. ERAS provides Nursing, Occupational Therapy and Physiotherapy services which can include specialist assessment, equipment and short-term packages of care.&lt;/p&gt;\n&lt;p&gt;ERAS is an innovative service that aims to:&lt;/p&gt;\n&lt;p&gt;• The discharge to assess pathway is a therapy led service whose is to facilitate timely discharges from hospital by providing a therapy assessment and intervention to re-enable patients in their own homes to promote their independence and wellbeing.&lt;/p&gt;\n&lt;p&gt;• The rapid response pathway is a nurse led service whose aim is to prevent hospital admissions by working closely with the London Ambulance Service, General Practitioners and the Emergency Department by providing a rapid response service within the patient’s home.&lt;/p&gt;\n&lt;p&gt;We provide a comprehensive service to enable safe, timely early supported discharge from the acute hospital, thereby, reducing the length of hospital stay by continuing patient care at home.&lt;/p&gt;\n&lt;p&gt;In collaboration with the London Ambulance Service, General Practitioners and the Emergency Department we provide a fast-paced urgent response service, aimed at allowing patients to be cared for in their own home during times of medical crisis and prevent unnecessary admissions to an acute hospital.&lt;/p&gt;\n&lt;p&gt;The team is operational 7 days a week between the hours of 08:00 and 20:00. For this post, the following are essential:&lt;/p&gt;\n&lt;p&gt;• HCPC Registration&lt;/p&gt;\n&lt;p&gt;• Broad Range of Experience and excellent communication skills&lt;/p&gt;\n&lt;p&gt;• Car Driver with access to own car&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTanya PughJob titleLead TherapistTelephone number020 8702 5343&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Enfield", "postalCode": "EN2 0JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6619", "longitude": "-.083698"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254843", "validThrough": "2020-11-17T23:59:59+0000"}