{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T10:16:10+0000", "description": "&lt;p&gt;We are seeking highly motivated, enthusiastic nurses to join our award winning stroke unit.&lt;/p&gt;\n&lt;p&gt;We are amongst the best performing stroke units in the Midlands, boasting a nurse led service at the cutting edge of nursing developments. Our stroke service has been given the top classification &#39;A&#39; status for performance from SSNAP data collection.&lt;/p&gt;\n&lt;p&gt;Our 44 bedded unit comprises of hyper acute (HASU), acute (ASU) and stroke rehabilitation. We offer a 24/7 service working closely with the emergency department and ambulance service to provide thrombolysis treatment, get patients on the stroke pathway and also commence appropriate patients onto the thrombectomy pathway through close liaison with our tertiary centres.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for new and experienced nurses to further develop your nursing careers. We offer extensive specialised stroke training, supported by the ward based Clinical Nurse Specialists where you will work through stroke competencies and have the opportunity to become an advanced stroke specialist nurse.&lt;/p&gt;\n&lt;p&gt;We support and encourage proactive nurses and are very proud of our nurse led service. We provide continued support with professional development as we recognise that nurses develop with education and training.&lt;/p&gt;\n&lt;p&gt;The stroke unit actively participates in research and we welcome new initiatives to improve the service we deliver. We also conduct high risk TIA appointments on the unit to ensure patients at greater risk are seen as a priority.&lt;/p&gt;\n&lt;p&gt;Come and join our dedicated, proactive and dynamic team and help us to lead the way in providing the highest quality stroke care for our patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Perrin, Ward C8, Russells Hall Hospital, Telephone: 01384 456111 Ext 1139&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Staff Nurse - Ward C8 Stroke RA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257180", "validThrough": "2020-11-19T23:59:59+0000"}