{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive pro rata"}}, "datePosted": "2020-10-27T16:46:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Nurse Specialist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Leukaemia&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7. Permanent Position 0.8WTE/ 30 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We seek a nurse with strong or developing clinical, communication and leadership abilities to join the leukaemia CNS team. We care for patients with acute and chronic leukaemia, bone marrow failure and myeloproliferative neoplasm diagnoses. The leukaemia CNS team includes 7 CNS and sits within a wider team of haematology and BMT clinical nurse specialists and the respective multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;We have an office base and work with patients in various clinical areas and sites including inpatient wards, ambulatory care, outpatient clinics and cancer daycare. At the end of the year we will be moving inpatient services into a new state of the art ‘Haematology Hospital’ comprising 6 wards and a dedicated haematology intensive care unit.&lt;/p&gt;\n&lt;p&gt;The CNS role is an advanced practitioner who is a first point of contact for patients on complex treatment cancer pathways. You may already be an experienced CNS. Or, with appropriate education and training you would expect to counsel patients with a new diagnosis or at disease progression, helping explain treatment options, assessing information needs and suitability for therapies within nurse led and multi professional clinics. A significant part of the workload is by telephone, assessing patients who are often unwell and intervening to prevent deterioration and readmission.&lt;/p&gt;\n&lt;p&gt;You could already be a CNS or an experienced cancer nurse working in inpatients or cancer daycare. We are a nursing service that prides itself on having a highly skilled and caring workforce and consequently, excellent clinical outcomes, and patient experience. Within the team you will receive friendly peer support working alongside a number of haematology CNS’s and Consultant Haematologists. We recognise such roles require educational and training support and provide numerous professional development opportunities, both in-house and through post graduate pathways, as well as opportunity to attend national and international conferences.&lt;/p&gt;\n&lt;p&gt;We also understand the need to ensure CNS’s are well supported by pre-ceptorship, mentoring and team meetings, plus a regular forum for cancer clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal visits are encouraged and we look forward to hearing from you. For more information please contact Claire Nicholas, Lead CNS Tel 07507598856 or email claire.nicholas3@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245485", "validThrough": "2020-11-08T23:59:59+0000"}