{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 Pa inc HCAS"}}, "datePosted": "2020-10-30T11:01:09+0000", "description": "&lt;p&gt;St George&#39;s University Hospitals NHS Foundation Trust is one of the country&#39;s leading teaching hospitals with an international reputation for patient care, education and research. &lt;br /&gt;&lt;br /&gt;James Hope Ward is a dynamic unit that is changing with increasing demands on the St George’s Cardiology service, a regional tertiary centre delivering high quality care. We have a vacancy in day case and overnight stay elective unit.&lt;br /&gt;&lt;br /&gt;James Hope Ward is a day Case unit with 3 bays of 3 day case trolley chairs that operates Monday to Friday. Charles Pumphrey Unit has 7 overnight elective beds in a new purpose built unit. &lt;br /&gt;&lt;br /&gt;You will be expected to work independently and as an excellent role model as you develop your clinical and leadership skills providing excellent patient care. You will be part of multi-disciplinary team on this Nurse Led Unit working closely with Catheter Labs and Nurse Practitioners. &lt;br /&gt;&lt;br /&gt;Ideally you will need to have at least 1 year post registration experience. If you are a student nurse applying, you must be qualifying within the next 4 months.&lt;br /&gt;&lt;br /&gt;We are looking for people to join the team with an interest in Cardiology. If you are ambitious and want to develop your nursing and cardiology skills and make a real difference for caring for cardiology patients, this is the opportunity for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Almira Pagco, Senior Sister&lt;br /&gt;James Hope ward&lt;br /&gt;Telephone 020 8725 1170/1180&lt;br /&gt;Almira.Pagco@stgeorges.nhs.uk&lt;br /&gt;&lt;br /&gt;David Robinson, Matron, &lt;br /&gt;Cardiology&lt;br /&gt;Telephone 020 8725 3543&lt;br /&gt;Email: David.Robinson@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George’s University Hospitals NHS Foundation Trust, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249860", "validThrough": "2020-11-13T23:59:59+0000"}