{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 pa, pro rota"}}, "datePosted": "2020-11-02T13:53:27+0000", "description": "&lt;p&gt;We have exciting opportunity a for highly motivated, enthusiastic, Band 6 Nurse to join the Clinical Navigation Team to work as a Clinical Navigator and Responder for Derbyshire Community Health Services in the Amber Valley Locality.&lt;/p&gt;\n&lt;p&gt;The post is primarily based within the Rapid Response Therapy team, working over 7 days to provide some weekend cover.&lt;/p&gt;\n&lt;p&gt;The role of the Clinical Navigator is to identify the most appropriate place and service to meet the needs of the patient and facilitate timely transfer of care for patients on a D2A pathway from the acute setting into community services once they no longer have a need for acute hospital care. Therefore, it is essential that you have a keen interest and experience in this field.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also have recent experience of working in a community setting with an ability to identify how a patient’s needs can best be met within Community Services.&lt;/p&gt;\n&lt;p&gt;The post holder will need to work as part of a multi-agency team to network with outside agencies to support personalised patient care.&lt;/p&gt;\n&lt;p&gt;The post holder will also be required to complete comprehensive assessments in the patients own home, including those patients in crisis and provide a responsive service to support the patient to remain at home and avoid any unnecessary hospital admissions.&lt;/p&gt;\n&lt;p&gt;If you can demonstrate good communication skills, have the ability to plan and organise your own work load, are able to make decisions under pressure and work flexibly as part of a multi-agency team we want to hear from you.&lt;/p&gt;\n&lt;p&gt;As a clinical employee it will be your responsibility to ensure that your behaviour and values reflect those set out in the DCHS Way.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Becky Williams, ICTL, 07788 388478&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124692.jpg", "name": "Derbyshire Community Health Services NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Babington Hospital, Belper", "postalCode": "DE56 1WH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.019", "longitude": "-1.48617"}}, "title": "Clinical Navigator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252283", "validThrough": "2020-11-15T23:59:59+0000"}