{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T14:46:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Central Manchester COPD Team. We are a multidisciplinary team of nurses and physiotherapists delivering a range of services for people with COPD in the community and at Manchester Royal Infirmary across 7 days. We also recently provide clinics and ward reviews at Trafford General hospital. &lt;br /&gt;&lt;br /&gt;Manchester Foundation Trust is a leading integrated health, teaching, research and innovation campus in the thriving city region of Manchester. We offer a unique range of services to the North West, treating and managing the simplest to the most complex conditions and diseases. Indeed, we treat more than a million patients every year and we are home to hundreds of world-class staff, each committed to being the very best at what we do. As one of the largest NHS Trusts in the North West, recruiting the best talent to fulfill the wide range of our varied and specialist roles is really important to us. &lt;br /&gt;&lt;br /&gt;You will be involved in the delivery of the an early discharge service, admission avoidance from the community, the provision of a home oxygen service, pulmonary rehabilitation in the community, community COPD clinics and outpatient clinics. In more recent times we have our service to also support COVID 19 discharges from the hospital and outpatient reviews.&lt;br /&gt;&lt;br /&gt;We are a progressive team always looking to develop the way we work to improve patient care. With the variety of work that we do it offers a great chance for learning new skills and developing as a nurse or physiotherapist. We are looking for someone who is enthusiastic, flexible and wanting to specialise in respiratory medicine. Full time and part time applications are welcome.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMita BegumJob titleCOPD Nurse SpecialistEmail addressmita.begum@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Specialist COPD Nurse or Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250648", "validThrough": "2020-11-12T23:59:59+0000"}