{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-11-05T09:15:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Lead Business Intelligence Developer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS is the biggest employer in Europe. It’s a world-renowned institution and an exciting place to work, full of challenges and opportunities.&lt;/p&gt;\n&lt;p&gt;NHS Midlands and Lancashire Commissioning Support Unit is one of the biggest and best-performing commissioning support units in the country, with among the highest levels of staff and customer satisfaction. We work together as a team of over 1,600 expert staff based across the Midlands and North West to make a difference – for our customers, patients and communities.&lt;/p&gt;\n&lt;p&gt;Offering a full range of professional services to clinical commissioning groups (CCGs), hospital trusts, local authorities, integrated care systems (ICSs) and other public bodies across the country, our NHS values underpin everything we do.&lt;/p&gt;\n&lt;p&gt;Our highly skilled Business Intelligence team delivers services to thousands of users across multiple organisations and has staff based in Leyland near Preston, Stoke-on-Trent, Liverpool, Chester, Leicester and West Bromwich.&lt;/p&gt;\n&lt;p&gt;Who we’re looking for&lt;/p&gt;\n&lt;p&gt;Midlands and Lancashire Commissioning Support Unit (MLCSU) are looking to appoint an experienced Business Intelligence Lead Developer to join their team. Flexibility can be offered with regards to location.&lt;/p&gt;\n&lt;p&gt;The post-holder will take a lead developer role in the creation of complex data structures &amp; data models to support the CSU’s Business Intelligence reporting systems.&lt;/p&gt;\n&lt;p&gt;The post holder will act as a lead designer and developer within the Business Intelligence Development Team and will be responsible for the delivery of well designed, high performance products.&lt;/p&gt;\n&lt;p&gt;What we offer&lt;/p&gt;\n&lt;p&gt;In return, we provide a supportive environment in which to learn and develop, with the opportunity to further your skills and career within an exciting and evolving environment.&lt;/p&gt;\n&lt;p&gt;Joining our inclusive and innovative team comes with a range of benefits including flexible working arrangements, pension scheme and generous annual leave allowance.&lt;/p&gt;\n&lt;p&gt;With our training schemes and support networks, you will be empowered to play a leading role in the future of healthcare, whatever your specialism or interest. And as a member of NHS staff you will receive plenty of discounts from a host of restaurants and high-street stores too.&lt;br /&gt;&lt;br /&gt;12 months fixed term contract with the potential to extend&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNick LewisJob titleBI Integration ManagerEmail addressnick.lewis2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland, Preston", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "Lead Business Intelligence Developer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257020", "validThrough": "2020-11-12T23:59:59+0000"}