{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T14:15:59+0000", "description": "&lt;p&gt;Do you want to be part of the move towards a Healthier Wales in which social services, healthcare staff and the third sector work together to help people to remain active and independent in their own homes and their own communities? If so, come and talk to us in the Cardiff Community Resource Team, based in the friendly, busy and vibrant city of Cardiff, capital city of Wales.&lt;/p&gt;\n&lt;p&gt;We are looking for a talented, motivated and experienced Speech and Language Therapist to join our highly skilled, integrated and co-located health, social services and third sector Community Resource Teams. You will join an existing team of B7, B6 and B3 Speech and Language Therapy staff within the Cardiff Community Resource Team. You must have independent skills in the assessment and management of dysphagia and sound clinical skills in the assessment and management of aphasia, dysarthria and dyspraxia. Our client groups are varied and include MND, Dementia, MS, PD, HD and Stroke. We also have close links with the acute Speech and Language Therapy Service and are able to access the Videofluoroscopy clinics and the National Centre for Electronic Assistive Technology.&lt;/p&gt;\n&lt;p&gt;Our health team includes Consultant Geriatricians, Nurses, Physiotherapists, Occupational Therapists, Dietitians, Administrative staff and a large team of profession specific and generic Technicians and Assistants. In addition we are co-located with a Social Care Team of Carers, Managers, Co-ordinators and Administrators as well as Age Connects Home First Support Officers and Brokers.&lt;/p&gt;\n&lt;p&gt;In return for your skills and experience we can offer you:&lt;/p&gt;\n&lt;p&gt;- Expert professional 1:1 support and supervision plus regular team meetings and in-service training&lt;/p&gt;\n&lt;p&gt;- Continuing professional development opportunities&lt;/p&gt;\n&lt;p&gt;- Opportunities for contribution to a range of new and exciting projects and service developments, audit, research and projects relevant to your clinical work and specialist skills&lt;/p&gt;\n&lt;p&gt;- Access to a varied caseload that makes every day interesting&lt;/p&gt;\n&lt;p&gt;- Opportunities to develop your own clinical supervision and leadership skills&lt;/p&gt;\n&lt;p&gt;- A friendly, enthusiastic and supportive multi-disciplinary environment&lt;/p&gt;\n&lt;p&gt;- Access to the CRT staff wellbeing programme and regular social activities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ring Natalie Lennard on 029 21832501 if you would like to find out more.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18/11/20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie Lennard &lt;br /&gt;Tel: 029 21832501&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NW Community Resource Team &amp; SE Community Resource Team, Whitchurch, Cardiff", "postalCode": "CF14 7XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5172", "longitude": "-3.23176"}}, "title": "Specialist Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256184", "validThrough": "2020-11-18T23:59:59+0000"}