{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-28T17:15:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for general anaesthetists working at a consultant level work on a locum basis across Manchester Foundation Trust. The Directorate of Anaesthesia currently has opportunities to be part of the Oxford Road site team.&lt;/p&gt;\n&lt;p&gt;The Division of Anaesthesia, Critical Care and Preoperative Medicine consists of nearly 170 consultants and the scale of the service across a number of hospital sites provides significant subspecialisation and the opportunity to develop within a particular area of interest.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is one of the largest acute Trusts in the UK, employing over 20,000 staff and responsible for running a family of nine hospitals across six separate sites. The Trust provides a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;The Trust is the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;The posts will be mainly based at either Oxford Road and Wythenshawe Hospital sites, with expectation to deliver work across other sites.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEve BurkeJob titlePersonal Assistant to Clinical Head of DivisionEmail addresseve.burke@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Steve Gold (Oxford Road) on 0161 276 4551&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Multiple Sites, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Locum Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247482", "validThrough": "2020-11-18T23:59:59+0000"}