{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T16:15:54+0000", "description": "&lt;p&gt;Are you looking for a challenging, creative, rewarding and fast paced work environment? Do you want the opportunity to be part of a nurse-led service utilising all of your clinical and interpersonal skills?&lt;/p&gt;\n&lt;p&gt;Medway Community Healthcare (MCH) is seeking an experienced Clinical ADHD Non-Medical Prescriber to appoint to a permanent full-time post. The Children’s ADHD Service operates across Medway in Kent and contributes to multi-disciplinary, comprehensive diagnostic assessments and needs-based interventions for children and young people with ADHD. The postholder must have excellent clinical skills in assessments, diagnostic, medication management and knowledge in the area of ADHD&lt;/p&gt;\n&lt;p&gt;MCH provides a fully integrated children’s community health service consisting of public health nursing, therapists, doctors and community nurses. The ADHD service forms part of the diagnostic service for a full range of neurodevelopmental conditions for under 11-year olds and all interventions are based on NICE compliant guidance working within the 18 weeks waiting times. MCH offer a hub and spoke model of care with our new Snapdragons child development centre central to care.&lt;/p&gt;\n&lt;p&gt;The post holder will have good assessment and diagnostic skills, good interpersonal skills and an ability to lead a team. The applicant will contribute to pre-diagnostic assessments for children under the age of eleven years living within Medway who may have a neuro-developmental condition, post diagnosis medication support, on-going medication management including assessment and internal referrals for behavioural management strategies. The team is also supported by an experienced Advance Clinical Practitioner ADHD Lead non medical prescriber.&lt;/p&gt;\n&lt;p&gt;The successful candidate will benefit from being part of a supportive group of clinicians working across a wide range of specialities. The team includes input from a lead consultant community paediatrician and working closely with the behaviour specialist, school nurses and ASD service as part of an integrated pathway. The postholder will be expected to take an active role in the further development of the service working with the wider multiagency team such as CAHMS , Early Help and educational psychologists .&lt;/p&gt;\n&lt;p&gt;There is a strong emphasis on the development and maintenance of relationships with schools and voluntary agencies working with young people in Medway. Our service has an active social prescribing programme helping children join community activities which forms part of our transformational change into a social medical model of care.&lt;/p&gt;\n&lt;p&gt;This post offers opportunity to be part of a transformational change to the delivery of children’s community health services. For further information and opportunity for an informal visit please contact;&lt;/p&gt;\n&lt;p&gt;Hannah Van Der Puije on Mobile: 07946157597&lt;/p&gt;\n&lt;p&gt;Email: hvanderpuije@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHannah Van Der PuijeJob titleHead of children&#39;s specialist health serviceEmail addresshvanderpuije@nhs.netTelephone number07946157597&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125974.png", "name": "Medway Community Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Snapdragons, Rochester", "postalCode": "ME2 3FF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4077", "longitude": ".492208"}}, "title": "Clinical Nurse ADHD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247337", "validThrough": "2020-11-11T23:59:59+0000"}