{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pro rata"}}, "datePosted": "2020-11-02T10:31:34+0000", "description": "&lt;p&gt;&lt;span&gt;Haringey Inpatient Services are in the process of a major improvement drive. From August 2020, our wards moved into a brand new, purpose built accommodation, Blossom Court. Our new wards are Sunflower ward, Daisy ward and Tulip ward. We will be using the move into our new wards as an opportunity to re-design and modernise our treatment pathway. As part of our new clinical model we are reconfiguring our staffing and skill mix on the wards in order to provide high quality services, focused on delivering care centred around our service users&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our inpatient wards aim to offer a safe and secure therapeutic environment to Haringey residents who require treatment in an acute mental health inpatient setting. Our service users come from diverse backgrounds, and we recognise that an admission is an opportunity for growth and recovery. We use a variety of clinical models on our wards and seek to empower our doctors and other staff to offer high quality, evidence based interventions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Consultant will be part of the MDT comprising of peer support workers, social workers, family therapists, nurses, and other allied health professionals. They will be expected to lead the ward on a day to day basis and provide guidance to junior members of staff, whilst being a role model in demonstrating our trust values.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates will have the ability to manage a high pressured ward environment and work with acutely unwell service users. They will have highly developed clinical skills, alongside knowledge of a full range of therapeutic skills and approaches across physical and mental health.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is based at Sunflower Ward, St Ann’s Hospital, St Ann’s Road, N15 3TH.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;*Strictly no agencies please&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Katrin EdelmanJob titleClinical Director, Haringey ServicesEmail addresskatrin.edelman@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Consultant in General Adult Psychiatry, Sunflower Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251572", "validThrough": "2020-11-22T23:59:59+0000"}