{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-20T15:39:46+0100", "description": "&lt;p&gt;We are looking for a dynamic and motivated Consultant in Haematology to join our friendly and enthusiastic team at the North Cumbria Integrated Care NHS Foundation Trust (NCIC). An enthusiastic and forward-thinking consultant will work within a supportive team covering North Cumbria.&lt;/p&gt;\n&lt;p&gt;The post will be based at the Cumberland Infirmary but working as an integrated service with colleagues at West Cumberland Hospital. The successful applicant will complement our team of existing haematologists and nurses, together providing level 2A clinical haematology care for NCIC patients.&lt;/p&gt;\n&lt;p&gt;The Haematology Team The successful candidate(s) will join a team currently consisting of three Consultant Haematologists based at the Cumberland Infirmary,Carlisle. We also have a specialty doctor based at West Cumberland Hospital 2 days per week. A strong nursing and administrative team supports the medical team. There is a haematology laboratory on both the Cumberland Infirmary and West Cumberland Hospital sites. Both are part of an integrated blood science structure in a hub and spoke arrangement.&lt;/p&gt;\n&lt;p&gt;Clinical leadership is provided Dr Roderick Oakes. The Clinical Director of Pathology is Dr Fergus Young, Consultant Histopathologist.&lt;/p&gt;\n&lt;p&gt;Outpatient, chemotherapy day case and inpatient care are provided at both the Cumberland Infirmary and West Cumberland Hospital. Nurse-led clinics run alongside many of the consultant clinics.&lt;/p&gt;\n&lt;p&gt;The laboratory is ISO:15189 accredited.&lt;/p&gt;\n&lt;p&gt;Any applicant who is unable for personal reasons to work full time will be eligible to be considered for this post on a part-time basis. Visits can be arranged for candidates and their families in order to appreciate the quality of life our Hospitals and the surrounding area can offer. Applicants must hold valid registration with the GMC, and have possession of, or be within six months of gaining a CCT in Haematology and be eligible for inclusion on the specialist register of the GMC. NHS locum consultants will be considered who are not on the specialist register.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post currently attracts a discretionary recruitment premium of up to 10% (based on basic salary) per annum. &lt;/strong&gt;This is payable for up to four years and is reviewed by the Trust on an annual basis. Candidates interested in relocating to the region are able to apply for a generous relocation package of up to £8,000 and NCIC NHS Trust will provide support and assistance to help successful applicants move to the area.&lt;/p&gt;\n&lt;p&gt;Informal enquiries can be made by contacting: Jayne Harkness, Deputy Service Manager, Tel: 078 9039 0074&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235078", "validThrough": "2020-11-17T23:59:59+0000"}