{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-13T08:53:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Cancer Services | Management |Band 7- equivalent| Full time| Macmillan quality environment award| Boutique style CQC Outstanding rated Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Senior Chemotherapy Nurse looking to move into management or you are already working in a similar capacity and are looking for your next career move? If so, how would you like the opportunity to work in a boutique style hospital which boasts full diagnostic facilities. Where you will work with cancer patients at all aspects of their journey. Ifthis is the case, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;Here at The Montefiore we pride ourselves on the highest standards of care for our patients and the ability to dedicate time to ensure all aspects of care are supported by our enthusiastic, committed team. We work closely and flexibly with 7 dynamic oncologists and haematologists in delivering a range of treatments to patients with breast, colorectal, prostate and haematological cancers. We also work closely with external organisations such as the Acute Trusts, Hospices and charities as well as internally with our other colleagues in pharmacy, radiology, outpatients, theatre and the ward.&lt;/p&gt;\n&lt;p&gt;Over the last 3 years we have experienced significant growth in our service and further development is planned. The senior management team actively support the development of oncology services within our hospital and oncology development is part of our 5-year plan.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Montefiore Hospital is rated “O&lt;strong&gt;utstanding” by the Care Quality Commission (CQC). We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, cardiology and general surgery all delivered through our expert and caring clinical team.&lt;/strong&gt;The hospital is well positioned to maximise the excellent local public transport. There are buses that stop in the vicinity and is also walking distance of both Hove and Brighton train station&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Overseeing all cancer care from diagnosis through to End of Life care and Survivorship in a unit designed by patients&lt;/li&gt;\n&lt;li&gt;Being the Lead Specialist in SACT and to provide specialist education and support&lt;/li&gt;\n&lt;li&gt;Ensuring the wider cancer team deliver effective quality care and adherence to safety compliance for patients with cancer by providing excellent clinical and managerial leadership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration&lt;/li&gt;\n&lt;li&gt;Recognised Chemotherapy SACT qualification&lt;/li&gt;\n&lt;li&gt;Experience of managing a team&lt;/li&gt;\n&lt;li&gt;Working towards MSc in Oncology Practice (desirable)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please email Sherine Lowers @sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN3 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8318", "longitude": "-.154902"}}, "title": "Cancer Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223519", "validThrough": "2020-11-13T23:59:59+0000"}