{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-05T13:31:48+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an experienced and dedicated individual to join Maidstone and Tunbridge Wells NHS Trust as a Business Manager to our Executive Director of Strategy, Planning and Partnerships.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Business Manager will provide comprehensive and high-level support in managing and developing the office of the Executive Director and his team.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Highly motivated and resourceful, with a proactive and flexible approach to work&lt;/li&gt;\n&lt;li&gt;Seeking a new role that will provide the opportunity to learn and develop outstanding business management skills&lt;/li&gt;\n&lt;li&gt;Fully experienced as an Executive Assistant/Office Manager&lt;/li&gt;\n&lt;li&gt;Able to work at pace, with exceptional communication and IT skills&lt;/li&gt;\n&lt;li&gt;Able to multitask, pushing forward everything from diary/office management to high level project management support&lt;/li&gt;\n&lt;li&gt;Capable of using their initiative and taking ownership of key issues&lt;/li&gt;\n&lt;li&gt;A natural team player, able to develop excellent working relationships with their peers both inside and outside the organisation, and with key stakeholders across the area&lt;/li&gt;\n&lt;li&gt;Able to write high-level reports for numerous purposes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will work within the Strategy, Planning and Partnerships Directorate and will act as a role model for the team, ensuring the highest professional standards at all times.&lt;/p&gt;\n&lt;p&gt;Applicants should be able to demonstrate that they have the relevant Executive Assistant and Office Management experience. They must also have successfully managed tasks, and have a track record of working successfully with other people to ensure objectives and deadlines are met and quality is maintained.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills both verbal and written are a must.&lt;/p&gt;\n&lt;p&gt;For further information about the role, please contact Teresa Jarrett via email - teresa.jarrett@nhs.net&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;standard level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Monday 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: To be confirmed &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Teresa Jarrett, EA to Chief Executive/Chair, teresa.jarrett@nhs.net, 01622 226412&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Business Manager to Director of Strategy - Planning and Partnerships", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257900", "validThrough": "2020-11-09T23:59:59+0000"}