{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615 pro rata"}}, "datePosted": "2020-10-07T16:01:18+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 5 REGISTERED NURSE (ADULT - QUALIFIED) OPPORTUNITIES &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We believe that all qualified nurses have something extra to offer our patients beyond their training and professional registration, from a kind word or a helping hand to providing a positive outlook or going the extra mile. So, at our Trust, we want to work with people who really share our values in continuously improving our patient journey.&lt;/p&gt;\n&lt;p&gt;We are looking for exceptional and committed Band 5 Nurses who will provide outstanding care to our patients. If you an experienced Band 5 Nurse looking for your next challenge and feel passionate about patient care and would relish a new challenge, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We have opportunities in a range of specialities, across medicine, surgery and cancer services across our five sites which include: Royal Derby Hospital, London Road Community Hospital, Queens Hospital, Samuel Johnson Community Hospital and Sir Robert Peel Community Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have already applied for one of our specific Registered Nurse adverts, we advise you not to apply to this generic advert.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When completing your application please specify from the paragraph above which site and clinical area you would prefer to work&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A variety of flexible working options&lt;/li&gt;\n&lt;li&gt;The opportunity to work across disciplines and rotations&lt;/li&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on your specialty.&lt;/li&gt;\n&lt;li&gt;Ongoing support through every step of the way from recruitment to when you join our team and beyond.&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues.&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma and Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;On average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;25 babies are born each day in our maternity units&lt;/li&gt;\n&lt;li&gt;We employ 13,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;Annual turnover of £750 million&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In terms of location, Derby and Burton offer the best of both worlds – city life on the doorstep of a stunning rural environment. We border the National Forest and we are in easy reach of the Peak District, offering outstanding natural beauty. Centrally located, we have excellent transport links to the rest of the country including major cities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Advert Closing Date: 10th November 2020&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please contact our Recruitment Managers:&lt;/p&gt;\n&lt;p&gt;For vacancies at Royal Derby Hospital and London Road Community Hospitals contact Kreena Hemraj on 01332 788981 or email kreena.hemraj@nhs.net&lt;/p&gt;\n&lt;p&gt;For vacancies at Queens Hospital, Samuel Johnson Community Hospital and Sir Robert Peel Hospital contact Pippa Gardiner on 01283 511511 EXT 2979 or email philippa.gardiner@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby, Burton, Lichfield and Tamworth", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Registered Nurse (Qualified)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217210", "validThrough": "2020-11-10T23:59:59+0000"}