{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-11-01T09:45:15+0000", "description": "&lt;p&gt;Cumbria, Northumberland Tyne and Wear NHS Trust has been rated as an Outstanding Trust by the Care Quality Commission. First Step provides a high quality and effective service to patients within North Cumbria and is continuously improving and developing. We are proud of our clinical outcomes which are reflected in our recovery rates.&lt;/p&gt;\n&lt;p&gt;The service is clinically led by Dr Richard Thwaites who is well known for his CBT research into self-reflection/self -practice. Richard takes an active role in the service alongside his other commitments with the regional IAPT Team and as Editor-in-Chief of the Cognitive Behaviour Therapist journal.&lt;/p&gt;\n&lt;p&gt;As a service, we have a highly skilled and dedicated team, which strives to maintain fidelity to the IAPT model and provide psychological therapies in line with NICE guidance and according to the IPAT manual e.g.:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supervision is highly valued within the service, and High Intensity Practitioners receive weekly supervision.&lt;/li&gt;\n&lt;li&gt;There is a highly valued integrated Employment Advisor service working alongside clinicians.&lt;/li&gt;\n&lt;li&gt;As a service we regularly participate in relevant research programmes and staff are encouraged to be part of this (staff burnout, Self-Practice Self-Reflection).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Key service decisions are made at monthly Clinical Governance meetings which involve staff from all different areas of the team as well as patient experience representation.&lt;/p&gt;\n&lt;p&gt;Staff are invited to take on “champions” roles in key areas within the service e.g. Equality and Diversity; Risk; Older Adults; LD.&lt;/p&gt;\n&lt;p&gt;Training has been available for staff to develop skills in additional modalities e.g. EMDR; IPT; Counselling for Depression.&lt;/p&gt;\n&lt;p&gt;The service works hard to understand the diversity within the local population and has embarked on several initiatives to ensure equity for staff and population&lt;/p&gt;\n&lt;p&gt;Patient experience feedback is routinely sought and influences decision making around service development. Of those patients who have completed treatment within our service, and have responded to the patient experience feedback questionnaire, over 96% provide highly positive feedback on their experience of the service.&lt;/p&gt;\n&lt;p&gt;Cumbria is England’s most North Westerly county and home to some of England’s most striking landscapes, from high peaks to rugged coastline. It is an area of outstanding natural beauty and contains 2 UNESCO heritage sites (The Lake District and Hadrian’s Wall). Cumbria is rapidly increasing in popularity as an area for relocation in order to achieve the lifestyle that many people desire. An active lifestyle is easily accessible including fell walking, road cycling and mountain biking, mountaineering, wild swimming, sailing and water sports. It is also an ideal location for hobbies involving photography and wildlife. The county has a rural nature; however town centres tend to have a good mix of local and national shops, complemented by regular farmers markets.&lt;/p&gt;\n&lt;p&gt;As a service we are currently offering a combination of face-to-face and remote working (telephone consultation and video consultation delivered either from one of our office bases or via home working), which offers an opportunity for improved work / life balance. We anticipate that this will be the case in the future.&lt;/p&gt;\n&lt;p&gt;We are one of the few IAPT services that provides our patients the opportunity to access evidence-based treatment in three streams: HI, PWP, Counselling.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would consider suggestions of any reasonable working plan to balance service requirements and individual preference&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful applicants may be eligible for Relocation expenses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The service is commissioned to provide therapy between 8am and 8pm 7 days per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Karen Goldie Team Leader West Cumbria on 07870 366850 or Vicky Rooney Team Leader East Cumbria 07795 343627&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The following people would be available if your query is around the topics below:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinical leadership:&lt;/p&gt;\n&lt;p&gt;Dr Richard Thwaites, Consultant Clinical Psychologist &amp; Accredited CBT Psychotherapist - richard.thwaites@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Briony Guy, Senior Psychotherapist – briony.guy@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Moving to Cumbria to work as a High Intensity Practitioner:&lt;/p&gt;\n&lt;p&gt;Tracie Longstaff, High Intensity Therapist - tracie.longstaff@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Carla Quan-Soon, High Intensity Therapist East Cumbria Carla.quan-soon@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Chris Whitby, High Intensity Therapist West Cumbria chris.whitby@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Emma Turnbull, High Intensity Therapist West Cumbria - emma.turnbull1@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working flexibly - Combination of working remotely and in base:&lt;/p&gt;\n&lt;p&gt;Claire Sowerby, Team Leader First Step West Cumbria – Claire.Sowerby@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janine Carr - Team Manager&lt;/p&gt;\n&lt;p&gt;Email: Janine.Carr@cntw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "13-14 Portland Sqaure, Carlisle, Carlisle", "postalCode": "CA1 1PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8925", "longitude": "-2.92727"}}, "title": "IAPT High Intensity Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251171", "validThrough": "2020-11-15T23:59:59+0000"}