{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary"}}, "datePosted": "2020-10-16T16:38:51+0100", "description": "&lt;h1&gt;Vacancy for Head of Medicines Management&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full-time (37.5 hours per week)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;This role is national but will be based at one of our key locations&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Totally plc addresses the challenges of increased demand on healthcare services by delivering high-quality planned, urgent and insourcing healthcare across the UK and Ireland. Totally plc provides a full range of Urgent Care Services through its subsidiary businesses across England.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Totally plc is seeking a Medicines Management Pharmacist to support the development and implementation of a medicines management strategy which will continue to improve our systems and processes for the management of medicines across Totally&#39;s Urgent Care Division (UCD).&lt;/p&gt;\n&lt;p&gt;Working predominantly within the Urgent Care Division, the successful post holder will support the Head of Medicines Management for Totally in achieving value for money for medicines, clinical supplies and equipment. You will act as line manager to Pharmacy Technicians to deliver good control and supply of medicines across the Totally Group. The post holder will provide expert advice and support to the Medicines Management team and the UCD medical and clinical teams. You will contribute to the development, implementation and review of Patient Group (PGDs), Patient Specific Directives (PSDs) and Drug Administration Policies (DAPs) across the division.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The ideal candidate should be a Registered Pharmacist, with a minimum Certificate in Clinical Pharmacy Practice (or equivalent); an Independent Prescribing Qualification and Post-Graduate Management Qualification are desirable.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to demonstrate success in governance matters relating to medicines including experience of incident investigations. You will be an experienced Pharmacist with acute NHS trust, community trust or primary care experience.&lt;/p&gt;\n&lt;p&gt;This role is National and will be based at one of our key locations&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;em&gt;How to apply:&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To apply, please click on &quot;apply for this job&quot; on the right hand side of the screen and complete the application form. Make sure to use the attached job description to support you in writing your application.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Vocare Group recognise the diversity of the communities in which we operate and demonstrate this through the service we provide when dealing with patients, their family and carers.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;em&gt;Closing date for all applications is 8th November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We encourage you to apply as soon as possible, as once sufficient applications have been received we may decide to close the advert early&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Please note the salary ranges above are based on a 37.5 hour week.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Please note the following shortlisting approach will be applied:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Round 1 - Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/p&gt;\n&lt;p&gt;Round 2 - If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/p&gt;\n&lt;p&gt;Round 3 - If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All successful applicants will be subject to a Disclosure &amp; Barring Service check.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;em&gt;Totally plc group recognise the diversity of the communities in which we operate and demonstrate this through the service we provide when dealing with patients, their family and carers.&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Totally PLC Office", "postalCode": "DE1 3QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9256", "longitude": "-1.46833"}}, "title": "Medicines Management Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231143", "validThrough": "2020-11-08T23:59:59+0000"}