{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T11:01:10+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a band 6 Occupational Therapist, within our Older Adult Community Rapid Intervention &amp; Treatment Team) working across the Fylde coast. We are looking for a therapist who has experience of working with older adults in a community mental health setting and has a genuine interest in this client group. We need an enthusiastic, resourceful and forward thinking, resilient therapist to join this multi-disciplinary service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be aware of current guidance around service delivery and developments in older adult mental health services and be able to evidence sound knowledge of the role of Occupational Therapy in this setting. You will demonstrate excellent assessment skills and be confident in the management of clinical risk.&lt;/p&gt;\n&lt;p&gt;The post holder will provide a variety of assessment and interventions, to clients referred. You may be required to care co-ordinate a number of clients whose needs are predominantly met by Occupational therapy, whilst providing a specialist Occupational Therapy service to clients care co-ordinated by other members of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Occupational Therapy is well recognised within the team .There is regular access to training opportunities, personal development reviews and continuing professional development are also well established. There is on-line peer support, best practice groups, an AHP Innovation &amp; Research Forum and opportunity to network with OT’s across the LSCFT footprint via 6 monthly OT Experience and AHP events.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to supervise junior staff (MDT) and Technical Instructor staff and should have some experience in clinical supervision skills. You will receive both operational and professional supervision and support from the Clinical Specialist Occupational Therapist within the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStacey BowdellJob titleTeam ManagerTelephone number01253 957581&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lytham Hospital, Lytham St. Annes", "postalCode": "FY8 5EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7384", "longitude": "-2.94732"}}, "title": "Occupational Therapy Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259342", "validThrough": "2020-11-22T23:59:59+0000"}