{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 inc HCAS plus on call"}}, "datePosted": "2020-10-23T12:45:56+0100", "description": "&lt;p&gt;&lt;strong&gt;HEAD OF NURSING- SURGERY  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an exceptional nursing leader to join our senior leadership team in the division of planned care. You will work closely and collaboratively to ensure an effective and highly visible leadership presence, this will involve cross cover across the division as required. You will be joining the division at a challenging but exciting time, as we work through our ambitious plans to shape the future of the division in context of the COVID recovery process.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the Divisional Director of Nursing for planned care, to drive high standards of care and patient safety, leading on the provision of nursing excellence, care delivery and improving the patient experience, clinical outcomes, effectiveness and efficiency. Your leadership skills will empower teams to achieve above and beyond expectations and you will support and foster a culture of respect and compassion in a safe and supportive environment.&lt;/p&gt;\n&lt;p&gt;A mature leadership style, a respect for colleagues in all disciplines and evidence of advanced team building skills are essential to ensure that the nursing workforce has the capability and the capacity to respond to the current NHS challenges, whilst continuing to deliver compassionate, effective and efficient clinical care.&lt;/p&gt;\n&lt;p&gt;Applicants should be able to demonstrate success in delivering effective, safe and cost efficient services in a complex healthcare environment, including staff management, financial, risk and change management.&lt;/p&gt;\n&lt;p&gt;We welcome and encourage informal discussions about the post.&lt;/p&gt;\n&lt;p&gt;On call is required&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Langfield&lt;/p&gt;\n&lt;p&gt;Director of Nursing  slangfield@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Epsom/Carshalton", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Head of Nursing for Elective Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240571", "validThrough": "2020-11-06T23:59:59+0000"}