{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-10-26T10:47:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Early Intervention in Psychosis Team - Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Swanswell Point, Stoney Stanton Road.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a rare opportunity for a band 6 Occupational Therapist to work in our well established Early Intervention in Psychosis service. EI work with individuals who are experiencing the first onset of mental health problems, specifically psychosis. The role involves a detailed initial assessment incorporating the CAARM’s assessment to identify at risk mental states (ARMS) or first episode psychosis (FEP). This is incorporated into a formulation to plan the clients care over the next 3 years.&lt;/p&gt;\n&lt;p&gt;The OT will offer assessment, guidance and interventions to the overall caseload. The successful applicant will work closely with other members of the MDT to support them in delivering planned pieces of work. An understanding and ability to apply standardised Occupational Therapy Assessments used within this speciality is essential. The successful candidate will be working as the sole OT within EIT so will need to be organised and manage their time effectively, supervision from the lead OT and team leader supports this role.&lt;/p&gt;\n&lt;p&gt;The team uses a Recovery philosophy to collaboratively identify the individual’s goals and needs and to support them towards achieving these. Many of our clients experience difficulties with housing, finances, vocational activities and social inclusion and the successful applicant will be expected to work creatively, both with other team members and independently to support the client achieve their goals. We aim to support people to independence so they no longer need input from Mental Health Services.&lt;/p&gt;\n&lt;p&gt;The commencement of several national EI targets in April 2016 has led to significant development within the team. We are undertaking specific skills training with the clinicians to support both the clients’ recovery and the achievement of these targets.&lt;/p&gt;\n&lt;p&gt;Personal qualities will need to include; significant experience in occupational therapy work, an interest in promoting holistic health and well being, be positive and enthusiastic in what can be a very demanding role, ability to work independently and as part of the team and the ability to structure your own work load and diary utilising a range of interventions tailored to the clients’ needs. You will also be expected to carry out the OT role as per the job description. This role requires the successful applicant to be a car driver with access to a vehicle for business use.&lt;/p&gt;\n&lt;p&gt;Part-time hours will be considered&lt;/p&gt;\n&lt;p&gt;Conversations around the role are encouraged, please contact:&lt;/p&gt;\n&lt;p&gt;Georgia Wedgbury – EI Team Manager on Georgia.Wedgbury@covwarkpt.nhs.uk or 02476 961150&lt;/p&gt;\n&lt;p&gt;Julie Hardy – EI Occupational Therapist on Julie.Hardy@covwarkpt.nhs.uk or 01926 409 074&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanswell Point, Coventry", "postalCode": "CV1 4FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.414", "longitude": "-1.50785"}}, "title": "Occupational Therapist Early Intervention in Psychosis - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242066", "validThrough": "2020-11-15T23:59:59+0000"}