{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T09:31:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Older Adult and General Adult Mental Health Liaison&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership University NHS Foundation Trust (HPFT) is at the forefront of providing integrated health and social care. The Trust specialises in providing services for people with mental health problems and people with a learning disability including those who require specialist or forensic health care.&lt;/p&gt;\n&lt;p&gt;HPFT is one of a handful of mental health trusts in the country to receive a CQC rating of &lt;strong&gt;‘Outstanding’&lt;/strong&gt;. The Trust aims “to become the leading provider of Mental Health and Specialist Learning Disability services in the country”.&lt;/p&gt;\n&lt;p&gt;This is an existing Consultant Liaison Psychiatrist post which has been altered to adapt to the needs of a changing caseload. The post holder will work in a well-established multidisciplinary Liaison Psychiatry Team at Watford General Hospital in Watford; the rationale for the development of this post is to continue to provide consultant specialism to older adults as well as manage the increasing number of working age adult referrals, sustaining and improving the quality of care provided to both older adult and working age adults with mental health problems in the general hospital setting, and supporting clinicians in the general hospital to provide effective care to patients facilitating discharge where appropriate. A key element of the service is providing training to both junior and senior acute trust staff. The team is also a gate-keeping service to mental health beds within HPFT with consultants playing a key role in this process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder must ensure the relevant professional registration is maintained, including Section 12, Approved Clinician, and Responsible Clinician status. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;References:&lt;/strong&gt; Any offer of appointment will be subject to the receipt of (three) satisfactory references.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Occupational Health &amp; Disclosure Barring Service Checks&lt;/strong&gt;: The appointment will be subject to clearance from the Occupational Health Department and the DBS.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Joanne Farrow&lt;br /&gt;Job title: Clinical Director for West SBU and Consultant Psychiatrist&lt;br /&gt;Telephone number: 07833 234379&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Sridhar Shanmugham&lt;/strong&gt;, Consultant Psychiatrist and Medical Lead&lt;/p&gt;\n&lt;p&gt;Tel: 07983 517908&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Consultant Psychiatrist in Older Adult and General Adult Liaison", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243831", "validThrough": "2020-11-10T23:59:59+0000"}