{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-20T08:47:06+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking for a career in one of the UK’s most respected mental health and learning disability trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping those with mental health &amp; learning disability problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; An exciting opportunity has arisen for an enthusiastic nurse with an interest in clinical research to join Devon Partnership NHS Trust. The post holder will support the day to day running of a range of National Institute of Health Research (NIHR) portfolio clinical research studies, principally in COVID research but in other mental health specialties too. They will support the implementation of research protocols and the recruitment of participants into portfolio studies, and any resultant data collection and follow-up requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post involves the recruitment, education and monitoring of trial participants and the collection and documentation of accurate data, including collection and management of biological samples. It will involve working collaboratively with the clinical trials team and the wider multi-disciplinary team in the management of a caseload of clinical trial participants.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;£24,907 - £30,615 per annum pro rata (Band 5) - This is a fixed term post for 12 months.&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;The successful candidate will need to meet the challenge of working autonomously and within a team, and be self-motivated. The post would be based in Wonford House, Exeter but working across the county of Devon. In particular the COVID research will involve regular travel to our clinics across Exeter and the South Devon area. As study visits take place across multiple sites and in participants’ homes, the successful candidate will need a full driving license and access to a car.&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Your base will be Wonford House in Exeter but working across the county of Devon, however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;li&gt;Refer a friend scheme applies – both earn up to £500 See attached t&amp;c’s&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter / Devon", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233497", "validThrough": "2020-11-09T23:59:59+0000"}