{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 to £43,772 per annum"}}, "datePosted": "2020-10-21T12:57:13+0100", "description": "&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;We are looking to appoint a Band 7 Highly Specialist Clinical Engineer to work at Portsmouth Hospitals, one of the largest acute trusts in the country.&lt;/p&gt;\n&lt;p&gt;This is an exciting position within the Trust and carries a high degree of responsibility and dedication.&lt;/p&gt;\n&lt;p&gt;The Clinical Engineering Team based in Queen Alexandra Hospital manages medical equipment for Portsmouth Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;The post is for a vacancy in the Radiotherapy and Imaging team based at QAH.&lt;/p&gt;\n&lt;p&gt;This team provides full support for Radiotherapy &amp; Imaging areas including Ultrasound.&lt;/p&gt;\n&lt;p&gt;You will require an excellent level of electronic understanding, able to read schematic diagrams, have good mechanical skills and dexterity, possess knowledge of pneumatic hydraulic systems, able to interrogate software and diagnose system faults and calibrations.&lt;/p&gt;\n&lt;p&gt;You will be working on high voltage equipment, be required to provide immediate first line support and be able to prioritise your workload.&lt;/p&gt;\n&lt;p&gt;You must be able to communicate clearly and precisely to manufacturers, Radiotherapy, Radiotherapy Physics and fellow engineers and be able to use bespoke software. The ability to remain composed and work effectively under pressure is essential.&lt;/p&gt;\n&lt;p&gt;There will possibly be a requirement to work outside of core hours (0800-1630Hrs) including some Saturday and Bank Holidays. With a possibility of shift work in the future.&lt;/p&gt;\n&lt;p&gt;Familiarity with IRMER &amp; IRR99 regulations will be an advantage.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be working on the most cutting edge technology in Radiotherapy treatment, ultrasound and some general medical equipment.&lt;/p&gt;\n&lt;p&gt;This is an exciting position within the Trust and carries an extremely high degree of responsibility and dedication.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to work on equipment to ensure patients are treated with precision and accuracy. The post involves working with other healthcare professionals, often in clinical areas.&lt;/p&gt;\n&lt;p&gt;The successful candidates will support the Trusts medical equipment throughout its life cycle and will be involved in equipment evaluations, selection and procurement, acceptance processes, scheduled preventative maintenance, servicing, calibration and repair.&lt;/p&gt;\n&lt;p&gt;You will be expected to keep detailed and accurate records of your work in a methodical method.&lt;/p&gt;\n&lt;p&gt;You will be required to show initiative and possess judgement and fault finding skills in order to facilitate effective repairs to medical devices. Being self-motivated you will also show an ability to plan your own workload, liaise with manufacturers, monitor stock levels and order spare parts.&lt;/p&gt;\n&lt;p&gt;Previous experience is essential.&lt;/p&gt;\n&lt;p&gt;Minimum qualification is HND in an engineering discipline or equivalent level of knowledge, skills and experience.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th Novemeber 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Highly Specialist Clinical Engineering Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236504", "validThrough": "2020-11-18T23:59:59+0000"}