{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa exc HCA"}}, "datePosted": "2020-10-22T13:46:12+0100", "description": "&lt;p&gt;City &amp; Hackney, 10 PA 12 month fixed term consultant psychiatrist community post covering the Crisis and Home treatment Team (including Health Based Place of Safety) working with working age adults. The post has come about due to retirement start date is negotiable.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic consultant psychiatrist for our well established CRHT in City &amp; Hackney. The team is well resourced and recruited as you would expect from a CQC Outstanding rated NHS Mental Health and Community Trust. We are proud of our services and we view this post as a key part of our community services. The post-holder will be expected to provide senior clinical leadership to the multi-disciplinary team working as a part of the team and take an active role in service development and quality improvement. The service has close links with our excellent inpatient wards, community teams and personality disorder services. It is an exciting time for us and we have already made a number of innovative Crisis Pathway changes such as Crisis Caf and Service User Network groups and a new Health Based Place of Safety.&lt;/p&gt;\n&lt;p&gt;Our Trust is a financially stable progressive mental health and community services organisation with very strong clinical leadership at all levels. We have a focus on improving the experience of patients, carers and our staff. In recent years, we have been developing a quality improvement programme that provides our clinical staff, patients and carers with skills to transform our services. We believe that our staff are our greatest asset - and our best agents for change.&lt;/p&gt;\n&lt;p&gt;Applications will be welcomed from candidates included in or eligible for the Specialist Register.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Peter Macrae, 07971477212, Peter.macrae@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Peter MacraeEmail addressPeter.macrae@nhs.netTelephone number07971477212&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "C&amp;H Mental Health Medical Adult, LONDON", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Locum Consultant Psychiatrist Crisis &amp; Home Treatment Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238741", "validThrough": "2020-11-15T23:59:59+0000"}