{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-28T12:17:29+0000", "description": "&lt;p&gt;Here at Cambridgeshire and Peterborough NHS Foundation Trust (CPFT), we strive to improve the health and well-being of the people we care for, our staff and members, to support and empower them to lead a fulfilling life. We are dedicated to providing high quality care with compassion. We deliver many of the NHS services that are provided outside of hospital and in the community such as physical, mental health and specialist services. We provide integrated physical and mental health services for adults and older people; specialist mental health and learning disability services; children and young people’s mental health services; children’s community services (Peterborough); social care; and ground-breaking research.&lt;/p&gt;\n&lt;p&gt;A new opportunity has arisen at CPFT as an Inquest Manager. To successfully fill this role, we are looking for an individual who has experience in preparing and presenting evidence before the Coroner and is also familiar with dealing with clinicians and other stakeholders when preparing for an inquest. The successful applicant will be a strong communicator and able to think clearly and quickly under pressure.&lt;/p&gt;\n&lt;p&gt;In addition, we are looking for someone who understands the importance of ensuring that the Trust learns lessons from inquests and feeds this information back to the relevant departments within the Trust when things have gone wrong.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who have experience in working in highly sensitive environments and are a strong team player, willing and able to flex according to department needs, for example on occasion the post holder will be asked to assist in covering claims or other issues arising in the department. Any successful applicant will need to demonstrate and embody the values of the NHS.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Marion Owen, Claims &amp; Inquest Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;marion.owen@cpft.nhs.uk / 07790981087 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rachel Stevens, Associate Director of Legal Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;rachel.stevens@cpft.nhs.uk / 07718186471&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingfisher House, Huntingdon", "postalCode": "PE29 6FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3375", "longitude": "-.209154"}}, "title": "Inquests &amp; Claims Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246558", "validThrough": "2020-11-11T23:59:59+0000"}