{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-03T12:16:43+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;**Internal Bradford District &amp; Craven CCG Applicants Only**&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This role is a 2 year fixed term secondment opportunity and is to replace the existing post holder whilst they have been seconded to another role in keeping well domain part of SCD. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We need someone who can pick up the ageing well and care at home portfolio and run with it.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You need to be an energetic, self-motivated individual to lead, co-ordinate and develop a wide range of initiatives designed to support people with escalating, complex needs to be safely cared for as close to home as possible during the Covid-19 pandemic and beyond. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;With proven experience of working closely with primary care and acute care clinicians alongside a track record of collaborative engagement alongside social care, the independent sector and voluntary organisations, the post holder will lead a flexible and dynamic team to achieve objectives within an ethos of integrated service delivery and making best use of existing resources. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The ability to produce reports and plans within short timescales is essential, as are proven skills in communication and presentation to senior leaders. Working across a range of virtual teams, the post holder will employ innovative ideas and transformation approaches to bring together disparate services to reduce duplication and improve our co-ordinated response to escalating need, whilst also contributing to the smooth flow of people through our system by removing blocks to timely hospital discharge. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will use business intelligence skills to gather and present data to underpin business plans and proposals for change. Excellent skills of persuasion and influence are needed to engage with stakeholders and to promote the CCGs objectives around population health management and reducing health inequalities. An ability to challenge assertively amongst both peers and senior leaders is required to promote the care at home vision – improving care for residents and staff in care homes, and frail people with complex, escalating needs living at home.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Leach&lt;br /&gt;Karren.leach@bradford.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128155.png", "name": "Bradford District & Craven CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128155"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scorex House, Bradford", "postalCode": "BD1 4AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7963", "longitude": "-1.7494"}}, "title": "Senior Head of Strategy Change Delivery (Internal Applicants Only)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253937", "validThrough": "2020-11-09T23:59:59+0000"}