{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16725", "minValue": "16221", "unitText": "YEAR", "value": "£9.65 - £9.95 per hour"}}, "datePosted": "2020-11-02T11:11:26+0000", "description": "&lt;p&gt;We are currently seeking&lt;strong&gt;Health care Assistants (Support Workers)&lt;/strong&gt;&lt;strong&gt; (Mental Health)&lt;/strong&gt; to join our &lt;strong&gt;&lt;strong&gt;Adult Mental Health, &lt;/strong&gt; &lt;/strong&gt;at&lt;strong&gt; &lt;strong&gt;The Huntercombe Hospital, Eldertree Lodge &lt;/strong&gt;,&lt;/strong&gt; located approximately 6 miles from &lt;strong&gt;&lt;strong&gt;Market Drayton&lt;/strong&gt; &lt;/strong&gt;and just 11 miles from &lt;strong&gt;&lt;strong&gt;Stoke-on-Trent&lt;/strong&gt;&lt;/strong&gt; and within one mile from the&lt;strong&gt;&lt;strong&gt; A53&lt;/strong&gt;&lt;strong&gt;.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Group&lt;/strong&gt; is one of the leading specialist care providers in the UK, providing treatment in the areas of &lt;strong&gt;Mental Health and Addictions, Brain Injury&lt;/strong&gt; &lt;strong&gt;Rehabilitation, Adolescent Mental Health (CAMHS), Learning Disabilities and Children Specialist Services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have gained a reputation for innovation and creating the right treatment solutions for patients with particularly challenging and complex needs. Our philosophy is to ensure that every individual admitted to our services has the potential to enhance their prospects for a more fulfilling life.&lt;/p&gt;\n&lt;p&gt;Eldertree Lodge is a &lt;strong&gt;low secure mental health hospital&lt;/strong&gt; that provides specialist assessments, treatments and rehabilitation for adults with intellectual disabilities, mental health needs, autistic spectrum disorders, including those with varying degrees of challenging behaviours and forensic histories. The Hospital has 46 beds spread across six wards.&lt;/p&gt;\n&lt;p&gt;The hospital is located in &lt;strong&gt;Market Drayton&lt;/strong&gt;, just &lt;strong&gt;10 miles from Stoke-on-Trent&lt;/strong&gt; and &lt;strong&gt;within one mile from the A53.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for &lt;strong&gt;Full and Part Time&lt;/strong&gt; caring and committed individuals who want to work with a company that understands how important &lt;strong&gt;Health care Assistants (Support Workers) &lt;/strong&gt;are to our patients/ residents recovery.&lt;/p&gt;\n&lt;p&gt;Many of our patients arrive with complex and challenging needs. At Huntercombe Support Workers work in small teams with nurses, doctors, therapists and other experts, and together they make a world of difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing an excellent caring service in conjunction with the qualified nursing team&lt;/li&gt;\n&lt;li&gt;Being actively involved in patient care&lt;/li&gt;\n&lt;li&gt;maintaining and developing high standards of care for our patients while being aware of their individual needs and care programmes&lt;/li&gt;\n&lt;li&gt;Contributing towards effective communication, by reporting to nurse in charge any information given by patient/relative, incident or observation which may affect patients&#39; physical/mental well-being&lt;/li&gt;\n&lt;li&gt;Contributing to the maintenance of safe and comfortable ward environment in accordance with health and safety standards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To join the Huntercombe Group as a &lt;strong&gt;Health care Assistants (Support Workers)&lt;/strong&gt;you will be:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate about forming therapeutic relationships with people&lt;/li&gt;\n&lt;li&gt;Committed to a person-centred approach to recovery&lt;/li&gt;\n&lt;li&gt;Enthusiastic about working as part of a dedicated team&lt;/li&gt;\n&lt;li&gt;Resilient and able to work under pressure&lt;/li&gt;\n&lt;li&gt;Previous experience working in care or the health sector would be an advantage but not essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Opportunity to train to become a nurse through our ‘grow our own’ nurses programme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;Social Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashley, Stoke on Trent", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "health care assistant (support worker) (Mental Health)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251727", "validThrough": "2020-12-01T23:59:59+0000"}