{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "37241", "unitText": "YEAR", "value": "£37,241 - £49,036"}}, "datePosted": "2020-11-03T16:17:03+0000", "description": "&lt;p&gt;The Thoracic Surgery Team at NUH are looking for a Clinical Fellow/ST3 in Thoracic Surgery to join their integrated and forward thinking service. We are regional centre for Thoracic surgery&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals NHS Trust is one of the largest in the UK with an annual turnover of approximately £1 billion. It was formed on 1 April 2006, when two top-rated trusts Queen’s Medical Centre and Nottingham City Hospital merged in order to develop a range of high-quality, sustainable patient services across the two campuses. The Thoracic Team is based at City Campus.&lt;/p&gt;\n&lt;p&gt;There are five consultant Thoracic Surgeons who provide the full range of adult thoracic surgery to Nottingham shire neighbouring area as it is regional centre for Thoracic. The tertiary catchment covers Nottingham and surrounding districts, North Nottinghamshire, and parts of Lincolnshire and Derbyshire (population approximately 2.2 million).&lt;/p&gt;\n&lt;p&gt;The successful candidate will join the Team. The department does more than 1000 thoracic surgery procedures per year of which more than 250 are anatomical lung resections. More than 80% of these are minimally invasive operations. Recently the department has also started its robotic thoracic surgery programme.&lt;/p&gt;\n&lt;p&gt;This role offers opportunities to participate in undergraduate and postgraduate teaching, educational supervision, research and leadership roles within the specialty.&lt;/p&gt;\n&lt;p&gt;It is a requirement for successful candidates to hold or be eligible for Full Registration with a license to practice with the General Medical Council, MBBS or equivalent MRCS or equivalent. Completion of ST1-2 years or equivalent with experience of at least 2 years in Cardiothoracic Surgery is essential.&lt;/p&gt;\n&lt;p&gt;For informal discussion, further details or to arrange a visit please contact&lt;/p&gt;\n&lt;p&gt;Mr Mohammad Hawari Mohammad.Hawari@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0115 969 1169 Ext 77602&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Clinical Fellow (ST3+) in Thoracic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254774", "validThrough": "2020-11-10T23:59:59+0000"}