{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-23T13:15:55+0100", "description": "&lt;p&gt;&lt;strong&gt;Head of Information Governance and Data Protection Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;York or Scarborough based (potential for some home working)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At York Teaching Hospital NHS Foundation Trust, we provide a comprehensive range of acute hospital, specialist healthcare and community-based services for approximately 800,000 people living in and around York, North Yorkshire, North East Yorkshire and Ryedale; an area covering 3,400 square miles. Employing 9,000 staff across multiple sites, our dispersed workforce provides a complex array of services which are shaped both by what we know about the people we serve and our evolving sector. These include demographic changes, deprivation in some of our communities, the national move towards integrated care systems and a commitment to avoiding unnecessary hospital admissions/longer stays.&lt;/p&gt;\n&lt;p&gt;Further to the appointment of our new Chief Digital Information Officer, we are now looking to strengthen our &lt;strong&gt;Digital Information Services team&lt;/strong&gt; to ensure that we are well placed to support the delivery of our new patient centred clinical strategy.&lt;/p&gt;\n&lt;p&gt;As our new &lt;strong&gt;Head of Information Governance&lt;/strong&gt; (and Data Protection Officer for the Trust), you will play an important and highly visible role, responsible for all aspects of information governance, Freedom of Information and data protection during a period of significant business transformation. To this end, you will be required to set and secure support for a future focused strategy and plan that will support innovation and partnership working, shaping and developing a high performing, supportive and enabling team who are able to maintain pace with business and technology change.&lt;/p&gt;\n&lt;p&gt;Currently performing a similar role elsewhere, you will have worked in a dispersed, consumer/patient focused environment, ideally in the Health and Care sector. To this end, you will be familiar with relevant policies, statutory requirements and approaches to information management and governance and will be credible at all levels, able to inspire confidence and secure cooperation for excellence in information governance, from Ward to Board.&lt;/p&gt;\n&lt;p&gt;An accomplished and developmental leader, you’ll bring the experience to establish a patient centred culture, empowering others and promoting personal accountability to maximise both business assurance and agility. This is a change role in which you will be empowered to challenge legacy attitudes and ways of working to enable us to do more for our patients.&lt;/p&gt;\n&lt;p&gt;If it sounds like the role for you, call us to find out more contact either&lt;/p&gt;\n&lt;p&gt;Dylan Roberts: Chief Digital Information Officer 01904 725888&lt;/p&gt;\n&lt;p&gt;Fiona Jamieson: Deputy Director of Healthcare Governance 01904 725045&lt;/p&gt;\n&lt;p&gt;Interviews are expected to take place virtually on 27th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Fiona Jamieson&lt;/p&gt;\n&lt;p&gt;Deputy Director of Healthcare Governance&lt;/p&gt;\n&lt;p&gt;fiona.c.jamieson@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;01904 725045&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dylan Roberts: Chief Digital Information Officer 01904 725888&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York or Scarborough", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Head of Information Governance &amp; Data Protection Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240662", "validThrough": "2020-11-08T23:59:59+0000"}