{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T11:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist Posts - AfC Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Department of Clinical &amp; Health Psychology&lt;/p&gt;\n&lt;p&gt;Leeds Teaching Hospitals NHS Trust&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a number of exciting vacancies that have arisen for newly qualified or early career clinical psychologists within the Department of Clinical and Health Psychology (DCHP). These positions are in the following clinical areas:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Permanent posts&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Gastroenterology (0.6 - 1 WTE)&lt;/li&gt;\n&lt;li&gt;Staff support (0.6 - 1WTE)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Maternity Cover&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cystic fibrosis (0.5 WTE)&lt;/li&gt;\n&lt;li&gt;Neuropsychology Outpatients - medically unexplained symptoms (up to 1 WTE)&lt;/li&gt;\n&lt;li&gt;Inpatient neurorehabilitation (up to 1 WTE)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The out-patient posts will cover a number of areas, providing outpatient clinical psychology and neuropsychology services to adult patients. The posts will involve a combination of psychological assessment and therapeutic/interventional work with patients who have long-term conditions as well as working with medical and nursing teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The staff support post is part of a new development which emerged from DCHP’s contribution to supporting staff across the organisation during the early phases of the coronavirus pandemic. You will be joining a growing team of clinicians specialising in the field of staff support across the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The inpatient neurorehabilitation post will be working into the regional neurorehabilitation unit at Chapel Allerton Hospital. This post will involves working within an MDT to deliver specialised rehabilitation to a adults with a broad range of neurological injuries and illnesses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whilst the initial clinical specialities covered by these roles are listed above, we have posts offer the opportunity for to rotate within different specialities, depending on the needs of the service and the candidate’s interests. The posts are therefore ideal for an early career psychologist who would like to gain experience in clinical health psychology but are not yet ready to specialise into a particular area of health. They provide an excellent opportunity to develop a thorough understanding of the range of aspects of clinical and health psychology.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Teaching Hospitals Trust provides a variety of high profile and expert clinical services that it may be possible to work into at a later date as you rotate (including pain, renal, cardiology, oncology, HIV and neuropsychology). Our priority is to train and retain your skills and create opportunities for you to progress into Senior or Principal roles, without having to look to other employers to progress. We all have annual job plan reviews which align with our own appraisals and ambitions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We know that often after qualifying, clinical psychologists have a range of professional and development needs.  Supervision, CPD and training will be built into your job as our priority is to train and retain your skills and create opportunities for you to progress into Senior or Principal roles, without having to look to other employers to progress. We all have annual job plan reviews which align with our own appraisals and ambitions.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department of Clinical and Health Psychology has flourished over the past decade and now has over 50 clinicians organised into three sectors (Medicine, Neuropsychology and Surgery &amp; Rehabilitation). We have several special interest groups that are accessible for clinicians wanting to develop therapeutic skills in areas such as Acceptance and Commitment Therapy and Compassion Focused Therapy, as well as a focus on regular supervision.  During the coronavirus pandemic our significant contribution to support staff across the trust has been recognised and valued by the Executive Team here at LTHT.  We have embraced new ways of working during the pandemic and for some time, this role is likely to continue with providing telephone and video consultation and some of the current roles are likely to involve home working. The Trust has a range of excellent staff benefits and salary sacrifice schemes (including car leasing and cycle-to-work schemes) and on-site facilities (e.g., nurseries and gyms).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;There are very close links with the Clinical Psychology Doctoral Training Programme at the School of Medicine, Leeds University. The successful post-holders would also be encouraged to complete supervisor training and contribute to offering placements to trainee clinical psychologists from this and other local training courses. We encourage ring-fenced academic time in our job plans as scholarly activity plays an important part of what we do. There are opportunities for research, service-evaluation, audit, teaching and delivering supervision.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in joining us, we’d love to hear from you. For more information or informal enquiries please contact Dr Penny Morris, Lead Consultant Clinical Psychologist and Head of Adult Medical Psychological Services (Multi-specialty), and/or Dr Janette Moran, Lead Consultant Clinical Psychologist and/or Dr Catherine Derbyshire, Head of Neuropsychology, on 0113 20 65897.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These posts have been banded at 7 under Agenda for Change.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122915.jpg", "name": "Adult Therapies", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122915"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Clinical Psychologist (XR07)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244221", "validThrough": "2020-11-10T23:59:59+0000"}