{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum"}}, "datePosted": "2020-10-29T15:16:41+0000", "description": "\n \n\n&lt;p&gt;Tower Hamlets CAMHS in partnership with London Borough of Tower Hamlets (LBTH) are looking to recruit a 12 month fixed term band 8a Clinical Psychologist to join the Edge of Care Service (EofC).&lt;/p&gt;\n&lt;p&gt;The EofC Service is based within Childrens Social Care and works with children aged between 11- 17 who are deemed to be on the edge of care. The EofC service consists of two team managers, two social workers and four support workers. The service utilises a number of approaches to keep children within their families and return children home from care. It is a vibrant team which adopts a systemic culture and there is always room for creativity and innovation!&lt;/p&gt;\n&lt;p&gt;The post holder will have experience of working within CAMHS and ideally have experience of multi agency working (preferably within social care). The role of the post holder will be to provide evidence based interventions for children with mental health or emotional well-being difficulties that might be impacting on family life. The post holder will also help to develop the psychological understanding of why children might at risk of being removed from their family, and what can help families to stay together through the process of joint work with colleagues and consultation.&lt;/p&gt;\n&lt;p&gt;As the EofC service is evolving there is the exciting opportunity to help shape the service offer by contributing to regular reports and audit to understand how the service is being used. There is also the opportunity to provide teaching/training to the team around psychological approaches as well as helping to embed practice using the newly introduced models to the team (Tree of Life and NSPCC Reunification Framework).&lt;/p&gt;\n&lt;p&gt;The successful candidate will have close links with other CAMHS in Social Care Services as well as wider CAMHS where there are opportunities for Continuing Professional Development. The post holder will be well supported by regular clinical supervision from a Senior Clinical Psychologist within social care as well line management from the CAMHS in Social Care Team Lead. The post holder will also meet with the Social Care Group manager on a regular basis.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to work is dynamic service encompassing a wide variety of activities as a clinical psychologist.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E1 8DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5135", "longitude": "-.072681"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248851", "validThrough": "2020-11-15T23:59:59+0000"}