{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum"}}, "datePosted": "2020-10-29T12:30:19+0000", "description": "&lt;p&gt;Interested about working within a forensic care environment?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Francis Willis Unit is recruiting for a band 3 Senior Healthcare Support Worker to work within our Low secure unit in Lincoln. We are seeking a highly motivated and dynamic individual that wishes to be part of a strong clinical team and provide quality care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Francis Willis Unit is a 15 bed, male only forensic unit that has been established for over 20 years. It provides care for patients who are detained under the mental health act &amp; with restrictions from the Ministry of justice.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will be offered the opportunity to be part of an excellent team that holds the highest possible values and work ethic. As part of the benefits for working within the team we offer:&lt;br /&gt;•Local induction plans/programs which aims to support transitions into a forensic environment either as a newly qualified practitioner or for an individual with no previous knowledge of forensic care.&lt;br /&gt;•An excellent career development program working closely with the University of Lincoln&lt;br /&gt;•Weekly protected clinical group supervision/reflective practice facilitated by our Clinical Psychologist.&lt;br /&gt;•Regular management/clinical supervision and annual appraisal.&lt;br /&gt;•Free onsite parking.&lt;br /&gt;•Childcare vouchers, cycle to work schemes&lt;br /&gt;•Early access to our staff wellbeing service, psychology therapies and occupational therapy services such as physio.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a large county which can offer you whatever you are looking for, in both your personal or your professional life. The county has vibrant towns and the City of Lincoln at its core, as well as idyllic rural villages, offering a high quality of life with affordable living, excellent education and social life facilities – sound interesting?&lt;/p&gt;\n&lt;p&gt;LPFT offers an excellent benefits package, including up to £8k relocation, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Francis Willis Unit, Greetwell Road, Lincoln, Lincolnshire", "postalCode": "LN2 5UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2324", "longitude": "-.516409"}}, "title": "Senior Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248310", "validThrough": "2020-11-12T23:59:59+0000"}