{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-03T13:31:01+0000", "description": "&lt;p&gt;Northumbria Healthcare Facilities Management Limited (NHFML) was established in 2012 and provides specialist project management services for large and small capital developments, estates maintenance and a full range of facilities services.&lt;/p&gt;\n&lt;p&gt;Please note that NHFML is a wholly owned subsidiary of Northumbria Healthcare NHS Foundation Trust. The successful applicant will be an employee of the subsidiary &lt;strong&gt;and not &lt;/strong&gt;the NHS. Please note the terms and conditions are closely aligned to that of the NHS.&lt;/p&gt;\n&lt;p&gt;Please note that it is a requirement of NHFML that all successful applicants pay for their own DBS certificate if a DBS check is required for the post. The method of payment is a salary deduction from your first monthly pay&lt;/p&gt;\n&lt;p&gt;Northumbria Healthcare Facilities Management Ltd is seeking to recruit a Building Craftsperson (Painter) for its North Tyneside General Hospital and other sites across Northumberland and North Tyneside.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be part of the Estates team responsible to the Estates Officer for all building services within North Tyneside General Hospital and Trust wide. Applications are invited for the post of Building Craftsperson within the Estates Operational Maintenance team.&lt;/p&gt;\n&lt;p&gt;The Craftsperson will be part of a team of building craftsmen ensuring that buildings are maintained to an appropriate standard to support clinical service departments in their prime task of treating patients and maintaining environment for patients, visitors and colleagues.&lt;/p&gt;\n&lt;p&gt;The appointed individual will support the site operational Building management staff with the day to day operational building maintenance, which will include, effectively diagnose and repair faults in building structure, fabric and finishes to deal with new situations as they arise and to pass on knowledge to others. To set out new work or set up new production appropriate to his/her trade using relevant instruments without supervision. To manufacture, assemble, erect and install new work.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to participate in an on call rota which could necessitate them being asked to return to work to deal with emergency situations which could arise out of working hours.. The post-holder will be an integral part of a strong site based locality team structure. As an experienced individual who will be the first line Building services crafts person for all day to day breakdowns, repairs and planned preventative maintenance works, principally undertaken by yourself as a directly employed craftsmen and sub-contractors. You will be versatile and able to handle conflicting priorities within this dynamic hospital environment, possessing great interpersonal skills that will allow you to effectively communicate with technical and non-technical customers. You will already have significant building services experience and have the ability to work under pressure.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note Northumbria Healthcare Facilities Management Limited (NHFML) is a subsidiary company of Northumbria Healthcare NHS Foundation Trust and operates as private company. Therefore the successful applicant will not become an NHS employee.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Neil Lennon&lt;/p&gt;\n&lt;p&gt;Job title: Estates Officer&lt;/p&gt;\n&lt;p&gt;Email address: neil.lennon@nhct.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0191 2934020&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Neil Lennon - 0191 2934020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Tyneside General Hospital, North Shields", "postalCode": "NE29 8NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0257", "longitude": "-1.46636"}}, "title": "Building Craftsperson", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254150", "validThrough": "2020-11-17T23:59:59+0000"}