{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inclusive HCA"}}, "datePosted": "2020-10-15T10:46:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Mental Health Worker&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Youth Offending Service/CAMHS&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Clinical Psychlologist, Psychiatric Nurse, Child Psychotherapist, Family Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;We are looking for an enthusiastic, experienced and motivated Specialist Mental Health Worker with a passion for working with young people within the Youth Justice System. You will be joining a busy and dynamic Youth Offending Service which works in partnership with the borough’s CAMHS, located a 10 minute walk away. These teams have a well-established and effective partnership which facilitates opportunities for joint working and co delivery of community based interventions.&lt;/p&gt;\n&lt;p&gt;Newham CAMHS is a multi-disciplinary team which a Care Pathway model of service delivery.  The team consists of Child &amp; Adolescent psychiatrists, clinical psychologists, specialist mental health nurses, Child &amp; Adolescent psychotherapists, family therapists and administrative staff who are committed to developing innovative and effective ways of working. This is a busy, interesting, and varied job working with children and their families across treatment pathways.&lt;/p&gt;\n&lt;p&gt;Your remit will be to provide a first class input to the Youth Offending Service, providing good quality, comprehensive assessments, evidence based interventions and treatment packages to young people who present with particular difficulties within the youth Justice System. This will include individual work, parent and family work, group work, consultation and other evidence based interventions.&lt;/p&gt;\n&lt;p&gt;You will call upon a broad range of skill and experience to work with a wide array of children, young people and their families with mental health issues.  We will provide an interesting and supportive work environment, with good training and supervision provided through the CAMHS Adolescent Mental Health Team within Newham CAMHS.&lt;/p&gt;\n&lt;p&gt;The community served is multi-ethnic and culturally diverse and we welcome applicants who are skilled at working with the richness and complexity of this multicultural context.  The Child and Adolescent Mental health Service is part of the Specialist Services Directorate in the East London NHS Foundation Trust, rated an Outstanding Trust by the Care Quality Commission.  There are good links with Education, Children’s Social Care and voluntary sector organisations locally.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham CAMHS, LONDON", "postalCode": "E13 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5236", "longitude": ".024862"}}, "title": "Specialist CAMHS Practitioner - Youth Offending Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227787", "validThrough": "2020-11-14T23:59:59+0000"}