{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annumplus HCA"}}, "datePosted": "2020-10-27T12:17:20+0000", "description": "&lt;h1&gt;Previous Applicants need not apply&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Specialist Community Physiotherapist (Band 6)&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Full time&lt;/p&gt;\n&lt;p&gt;We are offering an exciting career opportunity for an experienced physiotherapist to join our Community Physiotherapy Team. We are currently transforming community therapy services so you will have the opportunity to work in a number of specialties, including D2A and home based rehabilitation, community physiotherapy, stroke and neurology (LTC).&lt;/p&gt;\n&lt;p&gt;You will join our forward thinking multidisciplinary teams to deliver high quality patient care, tailored to meet the patient’s needs in a variety of settings. You will be assessing and treating patients with a diverse range of conditions and multi-pathologies in a number of clinical settings. You may see people only once following surgery through to patients living with complex and long term conditions, including the frail elderly. You will be asked to provide expert opinion whether a patient can remain within their home with additional support or require hospital admission. As your caseload will be varied, experience in all core rotations with evidence of working with older people and the multidisciplinary team is essential.&lt;/p&gt;\n&lt;p&gt;You will be required to assess the patient’s physical, social and psychological needs in discussion with the patient, carers and the multidisciplinary team. You will formulate and implement treatment plans and delegate tasks to the rehabilitation assistants as appropriate. Good IT, written and verbal communication skills are important to liaise with a wide range of healthcare professions, the patients and their carers. You will need to be flexible, able to work alone and as part of a team and will be required to travel across the borough. Community experience is desired but not essential.&lt;/p&gt;\n&lt;p&gt;You will be expected to take part in the weekend rota in the Community Discharge Service team (D2A). You have the opportunity to contribute to the respiratory and rehabilitation weekend rota at Lewisham Hospital and will receive further training to cover any outstanding learning needs as identified in your induction.&lt;/p&gt;\n&lt;p&gt;Continuing Professional Development is encouraged through the online appraisal system. Senior and peer support is available at all times and you are encouraged to take part in the regular in-service education programme organised by your community and acute therapy colleagues. We encourage our staff to be innovative and forward-thinking and willing to contribute to Service development. The team took part in research projects on Self-efficacy and consequently has benefited from the associated training.&lt;/p&gt;\n&lt;p&gt;We praise ourselves as being a very open and friendly MDT. Current rotational staff have expressed how much they have enjoyed their rotations in the community setting as it provided the opportunity to place the patients at the heart of their intervention and required a much more holistic therapy and management approach. Staff are using mobile working for more flexible working. &lt;br /&gt;We wear PPE for all patient’s visits and follow rules of social distancing the office.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicant requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You must have appropriate UK professional registration.&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Iris Lobemeier (Irislobemeier@nhs.net), Community Clinical Lead Physiotherapist on 020 3049 4492.&lt;/p&gt;\n&lt;h1&gt;Previous Applicants need not apply&lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Lewisham - Honor Oak Health Centre, London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Community Physiotherapist- Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244462", "validThrough": "2020-11-17T23:59:59+0000"}