{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa"}}, "datePosted": "2020-10-27T15:31:32+0000", "description": "&lt;p&gt;Applications are invited for a new post as Consultant in Rheumatology at Blackpool Teaching Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic, enthusiastic consultant who will contribute to the provision and development of high quality rheumatological care for the Fylde coast population. Sessional commitments will include outpatient clinics, review of inpatients at the request of consultant colleagues and multidisciplinary clinical meetings. This is a new post to help support some innovative service developments, including telephone advice and guidance and the development of virtual clinics. The appointee will join 4 Consultant colleagues. The contract is for 10 Programmed Activities, additional programmed activities may be available subject to negotiation with the Clinical Director. There is no on-call commitment for this post.&lt;br /&gt;&lt;br /&gt;Applicants will be expected to have MRCP and be on the Specialist Register or within 6 months of achieving CCT from date of interview.&lt;br /&gt;&lt;br /&gt;The Trust is highly active in clinical research. We are the highest recruiting centre for many clinical trials for commercial and non-commercial sponsors; and have recruited the first global, European and UK patients across a number of specialties. The Clinical Research Centre is the dedicated facility for use by researchers, where patients can participate in research. We have high calibre staff with long track records of being research active, staff who are enthusiastic to get involved in research for the first time and staff who support research through their role. &lt;br /&gt;&lt;br /&gt;“Our unit is active in clinical research. We are recruiting patients to non-commercial studies including biologic registers and studies looking at intensive management of RA. Ideally the applicant would play an active role in clinical research.”&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr JonesEmail addressdr.jones@nhs.netTelephone number012530956833 or 01253 953855;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust / Clifton Hospital, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245210", "validThrough": "2020-11-17T23:59:59+0000"}