{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T12:45:51+0000", "description": "&lt;p&gt;The Durham and Darlington Crisis Resolution and Intensive Home Treatment Team are seeking skilled, qualified clinicians to join our team.&lt;/p&gt;\n&lt;p&gt;You will be part of a resilient, welcoming and professional team. The team takes a recovery orientated, formulation driven approach which values shared decision making.&lt;/p&gt;\n&lt;p&gt;The team operates over 24 hours, 7 day a week with a flexible working pattern.&lt;/p&gt;\n&lt;p&gt;This is a band 6 post open to registered nurses, occupational therapists and social workers with current relevant registration with the NMC, HPC or GSCC.&lt;/p&gt;\n&lt;p&gt;You will be a member of a multi-disciplinary team and there is ample opportunity to develop and enhance your existing clinical skills. You will receive regular supervision and there are good training opportunities.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will provide a service to those individuals who present with a mental health crisis who may require a period of crisis intervention as an alternative to admission. Applicants should be highly motivated, have the ability to act on own initiative and have sound assessment and written skills.&lt;/p&gt;\n&lt;p&gt;The post holders will be responsible for the clinical leadership of more junior members of the team, prioritising workload and utilising resources appropriately to ensure that service user needs are met. The team is also responsible for gate keeping admissions to the acute admission ward as well as bed management.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes. If necessary, adjustments can be considered in accordance with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Telephone number01388 452916Additional contact information&lt;/p&gt;\n&lt;p&gt;Joanna Kegney, Crisis Team Manager - 01388 452916&lt;/p&gt;\n&lt;p&gt;Gemma Hunter, Advanced Practitioner&lt;/p&gt;\n&lt;p&gt;Andy Pallas, Advanced Practitioner&lt;/p&gt;\n&lt;p&gt;Clair Hewitt, Advanced Practitioner&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Auckland Park Hospital, Bishop Auckland, Bishop Auckland", "postalCode": "DL14 6AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6548", "longitude": "-1.68087"}}, "title": "Crisis Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255897", "validThrough": "2020-11-18T23:59:59+0000"}