{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 per annum"}}, "datePosted": "2020-10-30T16:45:59+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Clinical Fellow Neurosurgery&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As part of our drive to develop Neurosurgery in our role as a Tertiary Specialist Neurosciences Centre, we have an exciting opportunity for a Trust Basic Grade to join the Neurosurgery team based at Queens Hospital .this Post has Banding Applicants must have full GMC registration.&lt;/p&gt;\n&lt;p&gt;BHRUT is one of the largest Associate Teaching Hospitals, providing acute care for over 700,000 people from across 2 main sites – Queens and King George Hospitals, as well as peripheral sites at Barking, Dagenham and Brentwood. We have a strong commitment to teaching trainees. We are a major Neurosciences centre, and are undergoing significant further development as a tertiary referral centre for North East London and Essex, including additional critical care capacity.&lt;/p&gt;\n&lt;p&gt;The Trust is in an excellent location, close to Central London and well situated in the South East. As well as all the advantages of being close to the city, the Trust has on-site nursery facilities at Queen’s and King George Hospital sites.&lt;/p&gt;\n&lt;p&gt;In accordance with recent Home Office guidelines, doctors who require a work permit will only be appointed to posts which cannot be filled by UK/EEA applicants or doctors who do not require work permits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. However, non-EEA candidates may not be appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Visas and Immigration department requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill the post. For further information please visit the UK Visas and Immigration website.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact: Dawn Harrington&lt;/p&gt;\n&lt;p&gt;Job Title: Neuroscience Service Support&lt;/p&gt;\n&lt;p&gt;Contact No: 01708435000 ext 2978&lt;/p&gt;\n&lt;p&gt;Email: dawn.harrington3@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neurosurgery Medical Staff, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Clinical Fellow Neurosurgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250984", "validThrough": "2020-11-09T23:59:59+0000"}