{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa pro rata"}}, "datePosted": "2020-11-02T09:31:03+0000", "description": "&lt;p&gt;Are you a Pharmacy SATO or an ATO with an NVQ in pharmacy services looking to be part of a clinical Pharmacy team committed to providing the highest quality service to its patients? Are you looking for part time work to work around other life commitments? Then please read on…&lt;/p&gt;\n&lt;p&gt;Due to a member of our SATO team recently starting her technician training apprenticeship, we are looking for a part time band 3 senior assistant technical officer (SATO), to join the dynamic St Michaels Pharmacy Team. The role of SATO at St Michaels encompasses many differing areas such as topping up wards, controlling stock and dispensing for inpatient prescriptions.&lt;/p&gt;\n&lt;p&gt;This is a part time role of 22.5hours which is currently funded on a 1 year fixed term basis although would have the scope to be extended to a second year if the seconding SATO continues into the second year of her course. Spread of hours during the week is negotiable on interview however cover for a minimum of 5 hours would be required on Tuesdays to cover college time for the trainee technician. Pharmacy opening hours are 8.30-5pm Monday to Friday with morning being our busiest time for toping up stock.&lt;/p&gt;\n&lt;p&gt;Applications are invited from enthusiastic and motivated individuals with literacy and numeracy skills ideally GCSE level 4 (C) or above. Experience of NVQ level 2 in Pharmacy Services is also required. Good communication and interpersonal skills are an essential requirement for the role. The successful candidate will also have an aptitude for practical work along with excellent attention to detail and the ability to follow instructions and procedures methodically and accurately.&lt;/p&gt;\n&lt;p&gt;St Michaels hospital (which houses specialities such as obstetrics gynecology, ENT outpatients and Neonatology) is one of the group of hospitals making up the wider University Hospitals Bristol NHS Trust and provides the benefit of working in a smaller day to day team whilst also tapping into the wider pharmacy team in the Trust. The St Michaels Pharmacy team Consists of 1x 8a NICU pharmacist, 1.8 x Band 7 Pharmacists, a part time band 6 rotational pharmacist, 1x checking technician and 2 x Senior assistant technical officers (SATO’s) providing a great team which you could be a part of.&lt;/p&gt;\n&lt;p&gt;If you would like further information then please feel free to look our department’s recruitment video&lt;/p&gt;\n&lt;p&gt;Staff are required to work Saturdays, Sundays and bank holidays as part of a weekend and bank holiday rostering system.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abigail Mee, Paediatric Chief Pharmacist abigail.mee@uhbw.nhs.uk 01173427039&lt;/p&gt;\n&lt;p&gt;Vanessa Mclelland Assistant team leader vanessa.mclelland@uhbw.nhs.uk 01173428122&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Michael&#39;s Hospital, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Senior Assistant Technical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251408", "validThrough": "2020-11-15T23:59:59+0000"}