{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-29T18:00:14+0000", "description": "&lt;p&gt;&lt;span&gt;Trinity Ward is a 25-bed Nurse Led Community Hospital ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Trinity Ward is mainly an Elderly Care ward providing rehabilitation beds following trauma/surgery and non-acute medical/ minor illnesses. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We also provide palliative care beds for those reaching the end of life. We provide dignified holistic care for the patient and their families in a calm and caring environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We promote patient involvement and empower patients and family members to provide input into their clinical care and decisions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We respect that each individual has the right to autonomy and independence and endeavour to promote that independence as able. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An excellent opportunity has arisen for a motivated, dedicated individual to join this established and hardworking team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the delivery of the highest quality of care to a diverse client group predominantly managed within a nurse led facility. They will utilise highly developed clinical skills including diagnostic skills, alongside experience of long term condition management and elderly care.  &lt;/p&gt;\n&lt;p&gt;The role requires you to be able to communicate well and have the required leadership skills to deal with a MDT team and assist in case managing a group of patients from admission to discharge.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Sue Stratton on 01255 201223.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions,    cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;ACE is commissioned to provide a number of services including Community based health services (Care Closer to Home). We have been advised by North East Essex Clinical Commissioning Group that this contract will be provided by another organisation after 30&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; June 2021. This is not as a reflection of ACE but due to the Commissioner wanting to make changes to the way the service is delivered. At the present time we don’t know who the new provider will be but the CCG is working to determine this by the end of 2020. This change does not affect our ability to recruit and should you be employed at the end of June 2021 you will transfer to the new provider on the same terms and conditions  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For external applicants this post attracts an additional payment of £1,000, to be paid in 2 installments:&lt;br /&gt; • £500 to be paid on completion of probation &lt;br /&gt; • £500 on completion of 12 months employment&lt;/p&gt;\n&lt;p&gt;Working for ACE puts you right at the heart of all North Essex has to offer. If you are looking to re-locate to the area then we may be able to help with your moving costs. Further information can be found in the Relocation policy.&lt;/p&gt;\n&lt;p&gt;Within Tendring you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK!  Within a stone’s throw of Tendring is Colchester – Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after locations. In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harwich", "postalCode": "CO12 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9334", "longitude": "1.26072"}}, "title": "Staff Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249248", "validThrough": "2020-11-12T23:59:59+0000"}