{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-05T16:31:16+0000", "description": "&lt;p&gt;A new and exciting opportunity is available for the right individual to join Digital Services at Nottingham University Hospitals NHS Trust. We are seeking an exceptional candidate for the role of Cyber Security Manager within our Technical Services Team. We are looking for a strong leader, an expert in Cyber Security and with proactive technical experience of a large, complex and busy enterprise IT environment.&lt;/p&gt;\n&lt;p&gt;The role focuses on establishing and managing a team of multi-disciplinary Cyber Security specialists in order to keep the Trust’s Network, server infrastructure and end-user compute platforms safe from constantly evolving Cyber threats.&lt;/p&gt;\n&lt;p&gt;The individual will need to be a self-starter and be able to work at a very senior level within the organisation. They will need to engage with all stakeholders when developing proactive and reactive measures to protect the organisation and wider NHS from Cyber Threats.&lt;/p&gt;\n&lt;p&gt;The key features of this role are the ability to think conceptually, be the subject matter expert in Cyber Security matters for the Trust. React to fast-changing and complicated situations, solve problems and describe risks and solutions clearly and simply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To act as the designated expert on Information &amp; Cyber Security for the Trust to provide expert specialist advice in accordance with national and local security standards and best practice and to be accountable for the line management of Cyber Security Operations Centre (CSOC) ensuring staff are supported and developed.&lt;/p&gt;\n&lt;p&gt;Working alongside the Head of Technical Services and Chief Technical officer, to act as the expert on matters of Information and Cyber Security in-line with the Trust’s Digital Strategy and to define and recommend technologies, infrastructure and systems that will assist with mitigating threats, vulnerabilities, and risks.&lt;/p&gt;\n&lt;p&gt;Develop action plans to address key risks arising from assessments and to develop the investment cases to obtain the necessary funding to implement these action plans to improve the Trusts security posture.&lt;/p&gt;\n&lt;p&gt;To work closely with Counter Fraud Service (CFS), the Police and other external organisations when investigating incidents.&lt;/p&gt;\n&lt;p&gt;To represent our Trust at the Local Resilience Forum (LRF) making sure we have a collaborative approach on Cyber and to be aligned with the NCSS (National Cyber Security Strategy) where possible. Utilising information, guidance and training provided to us by the National Cyber Security Programme (NCSP)&lt;/p&gt;\n&lt;p&gt;To be a contributing member of the Information Governance and Records Committee to provide expertise and support for the information security improvement plans identified through the Data Security Protection Toolkit (DSPT).&lt;/p&gt;\n&lt;p&gt;To be the tactical advisor to the Gold Commander in any Cyber Incident and to deputise for the Head of Technical Services as required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Howden&lt;/p&gt;\n&lt;p&gt;Head of Technical Services&lt;/p&gt;\n&lt;p&gt;amanda.howden@nuh.nhs.uk / 07872 595770&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham University Hospitals NHS Trust, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Cyber Security Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258578", "validThrough": "2020-11-23T23:59:59+0000"}