{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 7 / 8a depending on experience"}}, "datePosted": "2020-10-16T13:00:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical / Forensic Psychologist – Band 7 / 8a (depending on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mersey Care NHS Trust is the health provider for the delivery of an innovative prison-based assessment and treatment service for male prisoners with personality disorder diagnoses. This service is based within HMP Garth which is a category B men’s adult prison based in Leyland, Lancashire. The service is part of the National Offender Personality Disorder Strategy and is delivered as a partnership between HMP Garth and Mersey Care NHS Trust. The service provides 1:1 and group based interventions based on Professor John Livesley’s framework and model of interventions for individuals with personality related needs. These structured interventions are provided as part of a therapeutic milieu which involves a focus on attachment, trauma and systemic approaches, alongside comprehensive risk assessment and management. Core aims of the service are consistent with those of the Offender Personality Disorder Pathway in improving psychological wellbeing, reducing risk, improving staff skills and competencies and pathway focussed intervention.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will contribute to the systematic provision of highly specialised psychological services to prisoners within the Beacon. Applicants should have doctoral level training in clinical psychology or equivalent or will be a qualified chartered forensic psychologist. You should have considerable experience of working with individuals with complex clinical and risk presentations including within institutional settings and as part of a multi-disciplinary team. This should include work with clients whose needs may meet criteria for a diagnosis of personality disorder and who may find it difficult to engage with services. Experience of working in complex service and organisational settings is required alongside an ability to constructively manage the personal, professional and ethical opportunities and challenges such work can involve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will be joining a dedicated team of clinical and prison officer staff from a range of backgrounds and experiences. Team members have high levels of skill, passion, enthusiasm (and humour!) and are committed to ensuring the on-going successful development of the service and the opportunities it provides for our population.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newly qualified applicants will be appointed to Band 7 with a guaranteed interview 12 months later where they will be interviewed against the 8a job description and person specification. Those with suitable qualification, knowledge, skills and experience will be appointed directly to the 8a position&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 9th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon CrowtherJob titleClinical LeadEmail addressSimon.Crowther@merseycare.nhs.ukTelephone number01772 443422Additional contact information&lt;/p&gt;\n&lt;p&gt;Debbie Brennand Debbie.brennand@merseycare.nhs.uk 01772443394&lt;/p&gt;\n&lt;p&gt;Tony Carradice tony.carradice@merseycare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Garth, Leyland", "postalCode": "PR26 8NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6796", "longitude": "-2.75636"}}, "title": "Clinical / Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230292", "validThrough": "2020-11-08T23:59:59+0000"}