{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22734", "minValue": "18819", "unitText": "YEAR", "value": "£18,819 - £22,734 p.a."}}, "datePosted": "2020-10-28T11:31:16+0000", "description": "&lt;p&gt;&lt;span&gt;This is an exciting opportunity for a Band 6 Occupational Therapist to join the multidisciplinary Purbeck Integrated Community Rehabilitation Team. This vacancy is for 22.5 hours per week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; The post will involve assessment and treatment of patients in both a community and inpatient setting (Purbeck area and Swanage Community Hospital) to prevent hospital admissions, promote earlier hospital discharges and rehabilitate a wide variety of conditions. The hospital caseload comprises of a mix of complex medical problems including orthopaedic, neurology, respiratory and elderly care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The community caseload offers a wide variety of pathologies and conditions to treat and rehabilitate. Support for complex admission avoidance patients is provided by our integrated advanced practitioner and GP cover. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post would suit a therapist with a commitment to integrated working with a passion for promoting rehabilitation, occupation and function as part of a multidisciplinary rehabilitation pathway. Training can be provided to develop any areas of specific clinical interest. Professional support and access to the Trust’s clinical supervision, in-service training and other developmental opportunities are just some of the benefits of working as part of this team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The other benefits involve working in a beautiful area of Dorset as part of a busy, friendly team, who are co-located with social services and community matrons which offers further scope for training and development. The hours of work are flexible and would include being part of a rota at weekends and bank holidays.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jackie Lidgard&lt;/p&gt;\n&lt;p&gt;Job title: Team Leader&lt;/p&gt;\n&lt;p&gt;Telephone number: 01929 408073&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Purbeck Local Office, Wareham", "postalCode": "BH20 7NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7493", "longitude": "-2.21871"}}, "title": "Occupational Therapist, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246350", "validThrough": "2020-11-11T23:59:59+0000"}