{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "To be confirmed"}}, "datePosted": "2020-11-05T10:09:38+0000", "description": "&lt;p&gt;Medical Receptionist needed to cover long term absense -  minimum of 25 hours per week but possibly up to full time. Days and hours to be confirmed. 6 months initial fixed term contract with a review and possible extension for a further 6 months.&lt;/p&gt;\n&lt;p&gt;As part of the reception team the post holder will be expected to provide a professional service to patents and the wider practice team, maintaining a courteous manner at all times and assist with all routine administrative duties of the practice. &lt;/p&gt;\n&lt;p&gt;The role includes booking patient appointments, welcoming and booking in patients to the practice, carrying out a variety of GP tasks and dealing with queries. There will be a requirement to maintain patient medical records and therefore some experience of working within a similar environment and using EMIS web clinical system (or similar) is desirable.&lt;/p&gt;\n&lt;p&gt;You will be required to work at both premises - Hume Street Medical Centre and Cookley Medical Centre (our dispensing branch surgery).&lt;/p&gt;\n&lt;p&gt;This is a busy and demanding role that will require excellent communication skills, flexibility and IT skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To greet patients arriving and deal with any queries and questions they may have.&lt;/li&gt;\n&lt;li&gt;To assist the doctors in all aspects of administrative duties in connection with the smooth running of the reception and doctors’ areas of the Practice.&lt;/li&gt;\n&lt;li&gt;To investigate and appropriately deal with any non-medical problems from patients and report to doctors where necessary.&lt;/li&gt;\n&lt;li&gt;To answer all incoming telephone calls and take the appropriate action thereon.&lt;/li&gt;\n&lt;li&gt;To use the computer system to make and amend appointments as necessary.&lt;/li&gt;\n&lt;li&gt;To ensure that requests for visits and messages are accurately recorded in the correct place within the EMIS clinical system and that Practice protocols are adhered to.&lt;/li&gt;\n&lt;li&gt;To control the keeping of records, filing and retrieval of information and all routine activities connected with the reception area.&lt;/li&gt;\n&lt;li&gt;To accurately scan into EMIS patient records incoming post and relevant test results, etc.&lt;/li&gt;\n&lt;li&gt;Make bookings for ambulances, etc. as requested.&lt;/li&gt;\n&lt;li&gt;To open the premises on arrival and close down the premises on departure in an organised and methodical way to ensure the building and its contents are safe and secure.&lt;/li&gt;\n&lt;li&gt;To observe the Practice Health and Safety Policy and to consider safety at all times.&lt;/li&gt;\n&lt;li&gt;To make drinks for doctors and colleagues as necessary and to keep the working areas as neat and tidy as possible.&lt;/li&gt;\n&lt;li&gt;To record all monies received according to Practice procedures.&lt;/li&gt;\n&lt;li&gt;To complete all necessary forms accurately, and ensure adequate stock levels of these forms.&lt;/li&gt;\n&lt;li&gt;To attend meetings and training courses as appropriate.&lt;/li&gt;\n&lt;li&gt;To operate the repeat prescription system according to Practice protocols.&lt;/li&gt;\n&lt;li&gt;To ensure patient confidentiality is maintained at all times.&lt;/li&gt;\n&lt;li&gt;To be prepared to assist in any duty that may be necessary to ensure the smooth running of the surgery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please apply with CV and covering letter to lisa.benton@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE THAT IN THE EVENT OF A LARGE NUMBER OF APPLICATIONS, ONLY SUITABLE CANDIDATES WILL BE SHORTLISTED. IF YOU HAVE NOT HEARD FROM US WITHIN 1 WEEK OF THE CLOSING DATE THEN PLEASE ASSUME THAT YOUR APPLICATION HAS ON THIS OCCASION BEEN UNSUCCESSFUL.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kidderminster", "postalCode": "DY11 6SF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.383", "longitude": "-2.25211"}}, "title": "Medical Receptionist - Temporary Position 6 months contract", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257169", "validThrough": "2020-11-12T23:59:59+0000"}