{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T12:00:40+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a practitioner with skills and interest in working with people with learning disabilities and additional mental health needs to join our existing Learning Disability Community Treatment Team in Northumberland.&lt;/p&gt;\n&lt;p&gt;The role of the RNLD/RMN is to work alongside our Specialist Nurses, Psychologists, Psychiatry, Clinical Pharmacy and Positive Behavioural Support practitioners to assist in a multifaceted heath assessment and treatment function to support those who, in addition to having a learning disability, may experience complex mental health issues and challenging behaviour.&lt;/p&gt;\n&lt;p&gt;Within the MDT framework the post holder will be required to assist with and /or lead mental health assessments to determine if mental health distress or disorder is contributing to challenging or high risk behaviour. This assessment and review of mental health symptoms will help influence and underpin the wellness recovery action and treatment plans developed by the team.&lt;/p&gt;\n&lt;p&gt;The post holder will also review and support the mental health elements while also being proactive in our outpatient psychiatry and Specialist Nurse/ Non-Medical practitioner /Pharmacist led clinics.&lt;/p&gt;\n&lt;p&gt;In partnership with Northumberland Health Care Trust (NHCT), who host the Care Program Approach (CPA) for this client group, the post holder will demonstrate a robust understanding of this methodology of care delivery assisting all parts of the MDT with this approach and risk management component.&lt;/p&gt;\n&lt;p&gt;Identified as a CPA contact within the CNTW service the post holder will attend and support CPA reviews and planning meetings as identified by the leadership team and MDT. The shared care and risk management recording protocols relating to complex mental health will be a major facet of the RNLD/RMN role within the wider team. Sound IT and system recording skills will be a fundamental prerequisite of the role.&lt;/p&gt;\n&lt;p&gt;For those with less direct experience of working with people with Learning Disabilities, awareness training and support will be available as required from the MDT expertise within the team. The community practitioner will be required to support or deliver elements of psycho social interventions (PSI) within the pathway. The associated use of Cognitive Behavioural Approaches (CBT) or other models alongside the team’s psychology expertise would be an expected approach moving forward. Therefore experience or skills of PSI or one of more psychological models would be desirable such as CAT/DBT systemic models would be advantageous. Experience and awareness of wider mental health services or pathways such as eating disorders, neuro- disability, personality disorder, early intervention and autism would also be welcomed.&lt;/p&gt;\n&lt;p&gt;Non-medical prescribing roles within the team are to be expanded in the short term. A second nurse prescriber role is planned to supplement the pharmacy prescriber and the specialist nurse who is in training at this time. NMP status would be a major advantage for the role as would the ability to demonstrate academic ability for this training in the immediate future.&lt;/p&gt;\n&lt;p&gt;The post currently sits within the enhanced part of the learning disability pathway provided by CNTW. Close partnership working and liaison with Community Learning Disability Nurses and other partners connected to the pathway will be another key component of the role.&lt;/p&gt;\n&lt;p&gt;The enhanced part of the pathway is a county wide service based at Greenacres, Ashington and delivers a range of specialist assessments and interventions. The team has expanded over recent years and currently comprises of a range of clinicians including Positive Behaviour Support Practitioners, clinical psychologists, clinical support worker and psychiatrist, and clinical pharmacist.&lt;/p&gt;\n&lt;p&gt;You must be a qualified RNLD or RMN with clinical experience or insight and awareness of people with a learning disability needs found across a range of community settings. Ideally you will have additional training or an interest in training to develop further competencies in PSI / psychological approaches. Good communication and organisational skills are essential as is confidence and the ability to remain calm and resilient in challenging community situations. Some occasional pre planned out of hours and weekend work may be required so you will need to be a flexible and responsive practitioner within the immediate team and be comfortable working across organisational boundaries. In turn you will join a dynamic and forward looking team where you will be offered excellent support and training and supervision opportunities to develop your skills further.&lt;/p&gt;\n&lt;p&gt;You must have a strong commitment to the delivery of high quality, safe, patient care and be a good role model in reflecting the Trusts core Values. You will be provided with training opportunities to develop your knowledge and skills.&lt;/p&gt;\n&lt;p&gt;If you require any further information or wish to have an informal discussion about what we have to offer please see details below directing you to the leadership group. We are an ambitious organization aiming to improve the wellbeing of everyone we serve through delivering services that match the best in the world.&lt;/p&gt;\n&lt;p&gt;CNTW values and respects the diversity of its employees, and aims to recruit a workforce which reflects our diverse communities. We welcome applications irrespective of people&#39;s age, disability, gender, race or ethnicity, religion or belief (With the exception of Chaplaincy Posts), Sexual orientation or other personal circumstances.&lt;/p&gt;\n&lt;p&gt;We are committed to the Health and Wellbeing of our staff; we have Continuing Excellence level in the Better Health at Work award and also achieved the Investors in People Health and Wellbeing Award.&lt;/p&gt;\n&lt;p&gt;Cumbria, Northumberland Tyne and Wear NHS Foundation Trust (NTW) is one of the largest healthcare Trusts in the country – serving a population of 1.4 million, with a budget of cir&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashington", "postalCode": "NE63 8BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1776", "longitude": "-1.57221"}}, "title": "Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246456", "validThrough": "2020-11-11T23:59:59+0000"}