{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T13:16:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Outstanding … Our Journey continues&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like the opportunity to use your Applied Psychologist skills with an Outstanding Trust … one of only two Specialist Mental Health Trusts in England rated as Outstanding by the CQC?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking a Specialist Psychologist to join our team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity for a motivated and enthusiastic Clinical Psychologist to join a well-established and highly valued multi-disciplinary service - providing clinical input and nurturing the psychological mindedness of the team. You will have the opportunity to receive excellent supervision and CPD opportunities and, for the right candidate, we are willing to offer support to develop your skills either clinically, or as an aspirant leader.&lt;/p&gt;\n&lt;p&gt;You will be working with a varied case load - supporting children and families with a wide range of presenting difficulties including autistic spectrum disorder, trauma, loss, depression, anxiety, and challenging behaviour - in line with the post holder’s experience and competencies. You will work as a key member of the multi-disciplinary team, embedding psychologically informed ways of working through collaborative working, consultation and training.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our service users are looking for someone who is &#39;friendly, kind, caring and helpful&#39;. ‘Can connect to us’, has ‘Good communication’ and ‘someone willing to work with me’&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Community Learning Disability Team supports children aged 0-18 years who have a significant learning disability – many of our service users also have additional complex health needs. Our aim is to help children and their families better understand and manage the difficulties they are experiencing by providing highly specialist assessments, education, collaborative formulation and intervention in a variety of settings. The team is highly respected and has good relationships with other services and agencies including primary care, education, social care and the third sector. The team is continuing to develop a number of clinical pathways to support families and is keen to promote a preventative and early intervention approach to build psychological wellbeing and encourage independence. We regularly have students and trainees on placement in the team and have strong links to the local Clinical Psychology Training Course at Staffordshire University.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;North Staffordshire Combined Healthcare NHS Trust was established in 1994 and provides mental health and learning disability care to people predominantly living in the city of Stoke-on-Trent and in North Staffordshire. The Trust is one of the main providers of mental health, social care and learning disability services in the West Midlands.&lt;/p&gt;\n&lt;p&gt;We currently work from both hospital and community-based premises, operating from approximately 30 sites to approximately 464,000 people of all ages and diverse backgrounds in Stoke-on-Trent and across North Staffordshire. Our main site is Harplands Hospital, which opened in 2001 and provides the setting for most of our inpatient units.&lt;/p&gt;\n&lt;p&gt;We provide services to people with a wide range of mental health and learning disability needs. Sometimes our service users need to spend time in hospital, but much more often we are able to provide care in community settings and in people’s own homes.&lt;/p&gt;\n&lt;p&gt;We also provide specialist mental health services such as child and adolescent mental health services (CAMHS), substance misuse services and psychological therapies, plus a range of clinical and non-clinical services to support University Hospitals of North Midlands NHS Trust (UHNM).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why North Staffordshire Combined Health Care:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1 of only 2 specialist mental health Trusts in England with an overall ‘Outstanding’ rating from the Care Quality Commission&lt;/li&gt;\n&lt;li&gt;20th consecutive year of achieving financial surplus making us one of the top financial performers in the region&lt;/li&gt;\n&lt;li&gt;Best performing mental health Trust in the NHS Staff Survey&lt;/li&gt;\n&lt;li&gt;Wellbeing Academy offering a wide range of courses, workshops and activities to support people to discover interests and develop their skills on their mental health recovery journey&lt;/li&gt;\n&lt;li&gt;Praised by our service users for our commitment to partnership in involving them in deciding our priorities and making our appointments&lt;/li&gt;\n&lt;li&gt;Highest score in the country for creating a safe environment free from bullying and harassment&lt;/li&gt;\n&lt;li&gt;Fantastic record of winning awards, nominations and accolades throughout the year from health, care and research publications and organisations&lt;/li&gt;\n&lt;li&gt;Helping drive a new alliance of health and care providers to lead and transform NHS and council-led care services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Local Area: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stoke-on-Trent&lt;/strong&gt; is a unique city in England. It is made up of six distinct towns – affectionately known as &quot;THE POTTERIES&quot;. It has excellent commuter links but benefits from being within easy reach of beautiful countryside.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Next Steps: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To apply for this role please follow the link. If you would like further information or an informal discussion contact Cath Todd-Jones (Team Leader) or Dr Matt Johnson (Consultant Clinical Psychologist) on 0300 123 1153.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cath Todd-Jones (Team Leader) or Dr Matt Johnson (Consultant Clinical Psychologist) on 0300 123 1153.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dragon Square, Stoke-on-Trent", "postalCode": "ST5 7HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0439", "longitude": "-2.2517"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244689", "validThrough": "2020-11-10T23:59:59+0000"}