{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-05T09:01:16+0000", "description": "&lt;p&gt;Somerset NHS Foundation Trust are looking for a Band 7 Senior Mental Health Liaison Worker.&lt;/p&gt;\n&lt;p&gt;In collaboration with the Somerset Clinical Commissioning Group (SCCG), Local Authority and the Voluntary Sector, Somerset NHS are transforming mental health services across Somerset&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be at the forefront in the establishment of this service transformation across the county delivering enhanced high-quality mental health care to all adults.&lt;/p&gt;\n&lt;p&gt;The proposal is to have specialist MH workers within a particular locality for the provision of a high-quality service for individuals with mental health difficulties; the specialist MH workers will support the GP practices and the locality village agents.&lt;/p&gt;\n&lt;p&gt;The post holder will be registered as an independent non-medical prescriber with their respective professional regulating body and support the GP practices and the patient population prescribing medicines for patients as either Independent or Supplementary Prescriber, within their scope of practice.&lt;/p&gt;\n&lt;p&gt;The post holder will carry a small caseload and provide structured guidance, supervision and advice to other mental health staff and village agents in relation to their working practice with this service user group; promote awareness and best practice concerning mild to moderate mental health and emotional health and wellbeing as well as patients with severe mental illness stepping down from secondary care, actively supporting positive attitudes and a consistent approach towards assessment and treatment of this service user group.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join us as we build on investments to transform Community Mental Health Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact Tom Clifford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07717 701453&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil, Yeovil", "postalCode": "BA20 2BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9467", "longitude": "-2.64803"}}, "title": "Senior Mental Health Liaison Worker, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256987", "validThrough": "2020-11-19T23:59:59+0000"}