{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-10-29T09:15:44+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust is situated in SE London and provides comprehensive healthcare and emergency services to a diverse local community. A major teaching hospital in the forefront of academic and nursing excellence, we offer a wide range of general and specialist services, providing an environment that is both challenging and rewarding.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Neurosciences at Kings College Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse Post (across all Neuroscience wards)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the drive and commitment to make a difference towards patient care and would like to develop further in your career within the specialty of Neuroscience?&lt;/p&gt;\n&lt;p&gt;If you do, we have a wonderful opportunity for a Band 5 Staff Nurse to join our dynamic specialist nursing team in a modern working environment, with strong peer support. You will be providing care to a diverse range of patients with neurological/neurosurgical conditions with complex diagnoses and needs that will challenge you and enable you to develop within the specialty and your career in general.&lt;/p&gt;\n&lt;p&gt;These positions would suit experienced nurses or newly qualified nurses looking to start their nursing careers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for caring and committed nurses who&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are proud to be part of our evolving profession and have the desire to develop their skills and knowledge in Neuroscience Nursing.&lt;/li&gt;\n&lt;li&gt;Offer a high level of person-centered nursing care to patients and their families&lt;/li&gt;\n&lt;li&gt;Acknowledge that effective Multi-disciplinary teamwork enhances the quality of care we provide our patients and their families.&lt;/li&gt;\n&lt;li&gt;Are kind and thrive on helping others and see our neuroscience unit as ‘one team’&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will provide you with opportunities for continuing professional development and work with you to develop your desired career pathway. You will be supported and guided by the ward manager, the current band 6 team and your band 5 peers.&lt;/p&gt;\n&lt;p&gt;There will be an opportunity to undertake an in house foundation course in neuroscience nursing which will provide the basic specialist understanding of how to look after patients with a wide range of neurosciences conditions and diagnoses. The Neuroscience Foundation Course was created as part of an initiative for the department to develop staff as well as to ensure safe and specialised practice is maintained. The course is made up of 3 key components which are: theory (taught across 6 study days); a rotation programme within 6 months covering the different areas of specialised practice within neuro (linked with a competency assessment document); and an academic component (enrolled at KCL - Work Based Learning module with 30 credits either at level 6 or 7).&#39;&#39;&lt;/p&gt;\n&lt;p&gt;Newly qualified staff could be considered for the course after completion of their preceptorship year while other staff such as IENs and those without neuro background can get into the course after a minimum of 3 months, which allows them to get their statutory and mandatory training completed as well as get their medicines management and administration competencies signed off.&lt;/p&gt;\n&lt;p&gt;Further training and courses will be available depending on your chosen career development pathway. This include access to excellent educational opportunities, from both in-house to university based degree and masters programmes.&lt;/p&gt;\n&lt;p&gt;The regional Neuroscience service at King’s serves a population of 3.8 million and has an international reputation for providing a wide range of expert clinical services for both regional and local patients. Our neuroscience service is continually evolving and offers new and exciting career options for our nursing team. This strong clinical specialty, combined with a nursing team committed to high clinical standards and a supportive environment, makes us a compelling career option for ambitious neuroscience nurses.&lt;/p&gt;\n&lt;p&gt;We provide services across two sites:&lt;/p&gt;\n&lt;p&gt;Kings College Hospital, Denmark Hill:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1 neurosurgical Ward with an integrated high dependency unit - Kinnear Wilson Ward&lt;/li&gt;\n&lt;li&gt;Urgent &amp; emergency neurosurgery – David Marsden&lt;/li&gt;\n&lt;li&gt;Elective Neurosurgery &amp; Telemetry – Murray Falconer Ward&lt;/li&gt;\n&lt;li&gt;Neurology and Traumatic Brain Injury Ward - Charles Polkey Ward&lt;/li&gt;\n&lt;li&gt;12 bedded HASU with 17 stroke rehabilitation beds - Friends Stroke Unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Orpington Hospital:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Neuro rehabilitation wards (Frank Cooksey and Ontario Wards)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Online Interviews will be held w/c 2nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information please contact:&lt;/p&gt;\n&lt;p&gt;Helena Varley hvarley@nhs.net and Ciara Nugent ciaranugent@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Band 5 Staff Nurse - Neurosciences", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247702", "validThrough": "2020-11-12T23:59:59+0000"}