{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-05T09:34:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and highly motivated individual to undertake the role of an Assistant Patient Services Coordinator in theGastroenterology Patient Administration team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with the Gastroenterology Management Team, to deliver performance targets and service improvement and will be responsible for the day to day management of our administration team including, secretaries, admin and clerical officers.&lt;/p&gt;\n&lt;p&gt;It is essential that applicants have experience of patient administration processes, referral to treatment pathways and staff management. Applicants should have the ability to think calmly and logically under pressure ensuring deadlines are met, whilst maintaining high standards.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to be an effective team player, with the ability to work flexibly in a diverse and demanding environment to meet the evolving needs of the service. Excellent interpersonal and communication skills are essential as the post holder will be expected to be able to communicate effectively and sensitively with a wide range of people.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Potential applicants are welcome to contact Theo Kenese, Patient Services Coordinator or Kate Gwardiak, Business Manager for further information and informal queries on 0113 2068158 or email theogene.kenese@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122472.jpg", "name": "Abdominal Medicine and Surgery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Assistant Patient Services Co-ordinator (XN04)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257078", "validThrough": "2020-11-19T23:59:59+0000"}