{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-29T08:45:36+0000", "description": "&lt;p&gt;An opportunity has arisen for an innovative and passionate HR professional to join our workforce directorate in the role of HR Advisor working within Secure and Specialist Learning Disabilities Division with a requirement to travel to Whalley, Lancashire part of the working week to support Specialist Learning Disabilities services based at the Whalley site. This post is on a Fixed Term or secondment basis, initially until 31st March 2021.&lt;/p&gt;\n&lt;p&gt;This role provides a fantastic opportunity to support our managers’ requirements to deliver perfect care. The postholder will be responsible for providing effective, proactive HR support and advice related to the operational management of services within the division and also support across the wider HR function as required.&lt;/p&gt;\n&lt;p&gt;Key responsibilities will include provision of first line advice on Agenda for Change Terms and Conditions and HR Policies and Procedures, together with supporting managers through a range of employee relations processes including management of attendance, disciplinary and informal resolution and will involve supporting review meetings, investigations and hearings.&lt;/p&gt;\n&lt;p&gt;In order to fulfil this ambitious role you will be CIPD qualified (or working towards) with the understanding of delivering a varied HR portfolio, in particular employee relations activity, ideally in a unionised environment, preferably in the NHS. A self-starter, with a keen values-driven commitment to the NHS, you will need to demonstrate an ability to work flexibly and deliver outcomes that meet the needs of the business. Confident in your ability to deal with people in all situations and negotiate and influence to reach agreement whist demonstrating empathy, you’ll also need to be comfortable working in a timely manner and meeting deadlines when managing employee relations workload.&lt;/p&gt;\n&lt;p&gt;If this opportunity excites you and you want to be part of a team who are committed to showing the difference excellent people management and development can make to front line care services, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Shortlisting will take place 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for week commencing 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameShona McCarthyJob titleHR ManagerEmail addressshona.mccarthy@merseycare.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Patricia Birkett&lt;/p&gt;\n&lt;p&gt;patricia.birkett@merseycare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whalley, Whalley", "postalCode": "BB7 9PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8297", "longitude": "-2.4237"}}, "title": "Human Resources Advisor - Secure and Specialist LD Division", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247663", "validThrough": "2020-11-11T23:59:59+0000"}