{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Based on UHNM Apprenticeship rates of pay, in line"}}, "datePosted": "2020-11-02T12:02:26+0000", "description": "&lt;p&gt;&lt;strong&gt;The People and Organisational Development Team is looking for an enthusiastic and motivated Apprentice Administrator &lt;/strong&gt;who will efficiently carry out a full range of administrative duties and provide excellent customer service to all members of the organisation. The role will involve handling staff enquiries, course/event preparation, data entry and a range of clerical duties intended to ensure the smooth and efficient operation of the department. You will be responsible for maintaining high standards of professionalism and providing services in accordance with the Trust’s values and behaviours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working in the People &amp; Organisational Development Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of a dedicated People &amp; OD Team that provides support, direction and commitment to the development of our most valued asset our people – and who are proud to live the Trust Values. Our service is dedicated to developing individuals, teams and the wider organisation. We are focused on delivering leading-edge interventions around the key areas of internal consultancy, culture development, management and leadership development, team effectiveness, developing behaviours and capabilities in our people, staff engagement and employee wellbeing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role you &lt;/strong&gt;&lt;strong&gt;must: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;have excellent communication and interpersonal skills;&lt;/li&gt;\n&lt;li&gt;be able to handle customers in a professional manner;&lt;/li&gt;\n&lt;li&gt;have an organised, systematic approach;&lt;/li&gt;\n&lt;li&gt;have the ability to produce accurate work in a busy environment.&lt;/li&gt;\n&lt;li&gt;have the ability to work both independently and as part of a team;&lt;/li&gt;\n&lt;li&gt;have a positive can-do attitude.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post’s main base is Royal Stoke University Hospital; however there may be a requirement to travel to the County Hospital (transport is available via the hospital link bus).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apprenticeship &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a Level 3 Business Administration Apprenticeship and as part of the role you will attend regular meetings with your supervisor and assessor, and attend training sessions leading to an Apprentice Certificate in Business Administration. This consists of a National Vocational Qualification, a technical certificate and key skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Corbett&lt;/p&gt;\n&lt;p&gt;People &amp; Organisational Development Officer&lt;/p&gt;\n&lt;p&gt;lucy.corbett@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt;01782 672272&lt;/p&gt;\n&lt;p&gt;Due to COVID I am only available via phone on Mondays and Tuesdays during usual office hours (09:00-17:00), however I&#39;m available via email Monday to Friday.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke University Hospital, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "People &amp; Organisational Development Apprentice Administrator (Level 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251972", "validThrough": "2020-11-08T23:59:59+0000"}