{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-10-23T11:02:22+0100", "description": "&lt;p&gt;&lt;br /&gt;&lt;br /&gt;East Sussex Healthcare NHS Trust is looking to appoint a specialty doctor to join an enthusiastic forward-looking Respiratory Unit at the Conquest Hospital site. An interest in a career in Respiratory Medicine is desirable, but not essential. &lt;br /&gt;&lt;br /&gt;We have 2 acute sites: Conquest Hospital in Hastings and Eastbourne District General Hospital and additional Outpatient Services provided at Bexhill and Rye hospitals. We provide around 750 beds and almost 100,000 people are inpatients each year.&lt;/p&gt;\n&lt;p&gt;Over 100,000 patients use our emergency departments. There are over 380,000 outpatient attendances annually.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our department operates a fully integrated respiratory service with the facilities for flexible bronchoscopy and full lung function exists at both acute sites; all interventional endoscopy and pleural procedures are performed at Eastbourne DGH. The sleep service is based at Conquest Hospital. The RESPS team provide pulmonary rehabilitation, oxygen assessment and review service, chronic disease management and early supported discharge and admission avoidance for patients with COPD. &lt;br /&gt;&lt;br /&gt;The post holder will work alongside 1 other SpR, 2 core trainees and 2 FY1’s. You will have 2 outpatient clinics per week and participate in the GIM acute on call rota 1:10 equivalent.&lt;br /&gt;&lt;br /&gt;We pride ourselves on the quality of experience, supervision and education you will receive. There are daily Consultant led teaching rounds, with opportunity to perform a variety of clinical procedures and Ultrasound training. You will be involved in the active Pleural Service with an opportunity for training and experience in interventional respiratory procedures such as Bronchoscopy, Endobronchial ultrasound, Thoracoscopy and Bronchial Stenting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We have a weekly cross site lung MDM with a satellite telecommunication with the thoracic surgeon from Guy’s and the presence on site of all the other lung MDM core members.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There is an departmental teaching programme on a weekly basis. The postholder would have an opportunity to participate in on-going audit and will be encouraged to assist in the development of ambulatory care pathways and other service developments.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The unit currently has 6 consultants supported by 3 middle grade doctors, nurse specialists and 8 FY1’s and CTU on the ACCT rotation, which the post holders would work alongside. &lt;br /&gt;&lt;br /&gt;The Candidate must hold full GMC registration and MRCP.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For additional information please contact:&lt;/p&gt;\n&lt;p&gt;Dr Thereza Christopherson - Respiratory Consultant theresa.christopherson1@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Osei Kankam - Respiratory Consultant o.kankam@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest, Hastings", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "Specialty Doctor Respiratory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240214", "validThrough": "2020-11-08T23:59:59+0000"}