{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32118", "minValue": "26171", "unitText": "YEAR", "value": "£26,171 to £32,118 (Depending upon experience)"}}, "datePosted": "2020-10-28T09:56:35+0000", "description": "&lt;ul&gt;\n&lt;li&gt;Are you a Junior Pharmacist, experienced in Primary Care?&lt;/li&gt;\n&lt;li&gt;Do you have a good knowledge of QOF, QIPPP?&lt;/li&gt;\n&lt;li&gt;Do you have excellent IT skills and communication skills?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are thinking yes, then DMC Healthcare would love to hear from you. DMC Healthcare has been a trusted provider of services to the NHS for over 50 years.&lt;/p&gt;\n&lt;p&gt;As Junior Pharmacist you will be working within a multi-disciplinary team under the supervision of a GP Clinical Lead and Senior Primary Care Pharmacists who will be responsible for your personal development within this role. This role is pivotal in improving the quality of care and operational efficiencies of a large, modern, GP training practice, and requires a passion to deliver excellent service.&lt;/p&gt;\n&lt;p&gt;The position is fulltime, 37.5 hours based across are 2 practice’s in Kent&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Church View Practice, Rainham, Kent, ME8 8AA&lt;/li&gt;\n&lt;li&gt;Iwade Health Centre, Sittingbourne, Kent, ME9 8TY&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;DMC Healthcare Group is a leading provider of Primary Care Services operating GP surgeries, walk-in centres and mobile medical units across London and the South East. We offer patients a full range of NHS primary and urgent care services, including extended opening hours and support.&lt;/p&gt;\n&lt;p&gt;At DMC we believe in working together to deliver healthier outcomes for our patients and our own teams.&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will have excellent IT skills and communication skills. You will maintain a good knowledge of QOF, QIPPP and other developments in relation to Primary Medical Services Contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role - Clinical Services&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To agree a Medication Review policy with practices for implementation of changes to prescribed drugs that can be made by the pharmacist for individual patients&lt;/li&gt;\n&lt;li&gt;To identify target patient groups in order to perform patient medication reviews&lt;/li&gt;\n&lt;li&gt;To provide pharmaceutical medication review and health education advice to patients at GP surgeries through home visits, by telephone or by notes-based review as agreed with the practice&lt;/li&gt;\n&lt;li&gt;To provide pharmaceutical input to chronic disease management clinics as appropriate&lt;/li&gt;\n&lt;li&gt;To follow up other prescribing issues identified through medication reviews and facilitate implementation of changes by GPs and appropriate follow-up monitoring&lt;/li&gt;\n&lt;li&gt;To monitor the effects of medications by checking clinical signs and symptoms, including blood pressure and pulse monitoring and spirometry, following appropriate training&lt;/li&gt;\n&lt;li&gt;To contribute to public health campaigns, including flu vaccinations, and childhood immunisations programmes, adult immunisation programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The role - Medicines Management&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure practices have a repeat prescribing policy and system in place and monitor that system to achieve a high level of efficiency, in order to promote repeat dispensing by Community Pharmacists and Electronic Prescription Services&lt;/li&gt;\n&lt;li&gt;Ensure all repeat medications are synchronised on the clinical system (EMIS Web, SystmOne)&lt;/li&gt;\n&lt;li&gt;Implement and monitor adherence to repeat prescribing policy ensuring repeat medication reviews are conducted at appropriate intervals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The role - Community Pharmacists&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To develop a working relationship with Community Pharmacists and to help facilitate the successful implementation of CCG commissioned services&lt;/li&gt;\n&lt;li&gt;To facilitate good working relationships between the practice and local community pharmacists&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have previous experience in a similar pharmacist role&lt;/li&gt;\n&lt;li&gt;You will be experienced in working in a Primary Care setting&lt;/li&gt;\n&lt;li&gt;You will be looking for an opportunity for self-development and improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Ability to prioritise and manage workload&lt;/li&gt;\n&lt;li&gt;Be motivated by delivering exceptional patient&lt;/li&gt;\n&lt;li&gt;A willingness to work with others and respect their views&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in this position then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent", "postalCode": "ME9 8TY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3732", "longitude": ".728026"}}, "title": "Junior Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245925", "validThrough": "2020-11-11T23:59:59+0000"}