{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-10-26T11:31:16+0000", "description": "&lt;p&gt;&lt;span&gt;Following the promotion of the existing post holder, we are looking for a dynamic and highly skilled clinician experienced in all aspects of management of lower limb musculoskeletal disorders. A forward thinking clinician with the skills to combine highly specialist clinical practice with innovation you will be committed to following best practice and the development and promotion of high quality physiotherapy services. As a clinical lead within the team you will have demonstrable leadership qualities and excellent communication and time management skills with proven abilities to build networks across sites and disciplines.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ABUHB physiotherapy musculoskeletal service is entering an exciting period of redesign and development of MSK services aligned to our priorities within the ABUHB Clinical Futures programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will encompass assisting in the strategic development of musculoskeletal services for lower limb physiotherapy services across all sites within the Health Board and across the spectrum from primary care to secondary care. You will be responsible for working with medical and surgical colleagues to identify and implement new models of care that enhance the ability of the physiotherapy service to support the Health Board to deliver high quality, evidence based care and contribute to service sustainability. You will be expected to work with and advise the Consultant Physiotherapist, MSK Senior Physiotherapy Manager and the Management team to inform future service development and will jointly ensure all physiotherapy musculoskeletal services delivered across the Health Board comply with the requirements of clinical governance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will be based within one of our mainstream physiotherapy departments. There will be an expectation to travel between sites and move base to ensure appropriate support to physiotherapy teams across ABUHB. Here you will be supported by an excellent network of Clinical Specialist Physiotherapists, Team Leads, Operational Managers and fellow Clinical Lead Physiotherapists in Spinal and Upper Limb conditions. The post holder will be expected to work across a variety of clinical teams, providing direct treatment for patients with complex presentations within mainstream physiotherapy services as well as support to specialist MSK therapy and/or Consultant Orthopaedic outpatient clinics as required by the Health Board.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is expected that 60% of the role will be clinical and 40% will be designated to the planning, teaching and research aspects of this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Physiotherapy Service encourages staff development through internal and external training programmes, including speciality forums, clinical audit and research and clinical supervision and mentoring. We have a structured personal appraisal system in place with annual reviews underpinned by the Knowledge and Skills Framework.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing Date: 16th November 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: - &lt;span&gt;We would welcome correspondence from anyone interested in the post. If you would like any further information or to organise a visit to the Health Board, please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sam Haworth-Booth, Senior Physiotherapy Manager (01633) 431630 sam.haworthbooth@wales.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mark Knight-Davis, Consultant Physiotherapist, MSK Services, &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;mark.knight-davies@wales.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The post will be rotational across ABUHB Physiotherapy sites, To be confirmed", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "MSK Clinical Lead Physiotherapist - Lower Limb", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242223", "validThrough": "2020-11-16T23:59:59+0000"}