{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 £18,005 - £19,337 per annum excl"}}, "datePosted": "2020-10-30T14:31:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Phlebotomist - Islington South West, Band 2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whittington Health delivers District Nursing Services across the boroughs of Islington and Haringey. Both boroughs are diverse, vibrant and exciting places to work with excellent transport links and fantastic opportunities to develop your skills. Our District Nursing Service is forward thinking, hardworking and dynamic which we pride ourselves on. We are committed to making a difference for our patients and providing good quality care. Thus, our integrated care organisation is an ideal place to do this.&lt;/p&gt;\n&lt;p&gt;District nurses visit people who are housebound of all ages 18+ in their own homes or residential homes, enabling them to self-manage where possible and implementing appropriate treatments and care pathways. Many patients are elderly, others may have disabilities, be recovering after a hospital stay, or have a terminal illness. Working with a District Nursing team is a rewarding role as you can work one-to-one with patients on an ongoing basis, which enables you to develop a trusting relationship while you improve their quality of life.&lt;/p&gt;\n&lt;p&gt;Whittington Health is looking for a phlebotomist to join the District Nursing Teams. The successful candidates will have skills which reflect NVQ Care 2 (or equivalent) competencies. The phlebotomist is accountable to the registered nurses in the team for carrying out phlebotomy for individual patients without direct supervision. An essential component of this post is excellent written and verbal communication skills.&lt;/p&gt;\n&lt;p&gt;We are a service committed to really making a difference for our patients and providing good quality evidence based care. This is an excellent opportunity for newly qualified nurses and those who would like to make the move to the community setting who are self-motivated, excellent communicators and team players. All successful candidates will have the opportunity to access a wide range of training opportunities, regular clinical supervision, preceptorship and support from within the team and from our District Nursing Professional Development team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post further please contact our District Nursing recruitment line on 0203 0742506 or email whh-tr.dnrecruitment@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Road, Islington", "postalCode": "EC1V 2QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5279", "longitude": "-.09109"}}, "title": "Phlebotomist - Islington South West", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250595", "validThrough": "2020-11-15T23:59:59+0000"}