{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18827", "minValue": "18827", "unitText": "YEAR", "value": "£11.20 Per Hour"}}, "datePosted": "2020-10-21T14:22:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;&lt;strong&gt;Personal Assistant &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Nottingham University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;1 post at Nottingham City Hospital, Hucknall Road, Nottingham, NG5 1PB, 1 post at Queens Medical Centre, Derby Road, Nottingham, NH7 2UH&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift pattern: &lt;/strong&gt;37.5 Hours per week, Monday – Friday 8.00am – 16.00pm &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration&lt;/strong&gt;: 2 Months&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rate per hour: £11.20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Nottingham University Hospitals NHS trust was Rated ‘Outstanding’ in ‘Well Led’ by the CQC and is home to some of the world’s leading clinicians and experts&lt;/p&gt;\n&lt;p&gt;Are you a person passionate about health care and want to make a difference?&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a Personal Assistant at Nottingham University NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide personal administrative support to the Reproductive Health Leadership Team.&lt;/li&gt;\n&lt;li&gt;To be responsible for managing and organising diaries. This will involve prioritising appointments, taking the initiative where appropriate to arrange meetings to ensure the best use of time and raising instances where priorities conflict. The post holder will ensure that the purpose of meetings and other appointments are always clearly stated.&lt;/li&gt;\n&lt;li&gt;To organise meetings which may involve co-ordinating diaries of a number of senior staff from within &amp; outside the Trust. This will include booking suitable venues, ordering refreshments, presentation aids etc.&lt;/li&gt;\n&lt;li&gt;To sort and distribute mail, ensuring all correspondence is directed as appropriate, actioning where possible and prioritising the remainder for action by the management team. Also to maintain an awareness of issues that need to be brought to the attention of the team.&lt;/li&gt;\n&lt;li&gt;To operate an effective ‘bring forward system’ to ensure that issues can be followed up on time and are not overlooked.&lt;/li&gt;\n&lt;li&gt;To assist in preparation of presentations for the Division.&lt;/li&gt;\n&lt;li&gt;To maintain an efficient filing system, both paper based and electronic, ensuring that shared drives are well organised.&lt;/li&gt;\n&lt;li&gt;To ensure all necessary files and paperwork are available for meetings and other appointments. The post holder will need to maintain an awareness of ongoing issues and events in order to link appropriate papers and to ensure that outstanding actions are notified to the Divisional Team prior to meetings.&lt;/li&gt;\n&lt;li&gt;To maintain information systems to support the Leadership Team, such as circulation lists, regular meeting dates and venues, annual leave records.&lt;/li&gt;\n&lt;li&gt;To type correspondence, reports, agendas and minutes, ensuring confidentiality at all times.&lt;/li&gt;\n&lt;li&gt;To take notes and minutes at meetings as required picking out key points from the discussions. To develop a good understanding of management/division processes in order to minute effectively.&lt;/li&gt;\n&lt;li&gt;To be the central contact point for administrative processes that the Division is required to manage.&lt;/li&gt;\n&lt;li&gt;To set up equipment for meetings and deal with any minor technical issues.&lt;/li&gt;\n&lt;li&gt;To act as the focal point for service enquiries from staff, patients, and visitors. To respond promptly and appropriately to enquiries and requests for information and advice made either in person by correspondence or over the telephone.&lt;/li&gt;\n&lt;li&gt;To support the Reproductive Health Leadership Team in all elements of administrative procedures, which will require flexibility in the work routine and working to targets and deadlines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236822", "validThrough": "2020-11-06T23:59:59+0000"}