{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "5043", "minValue": "5043", "unitText": "YEAR", "value": "£38,694 MT03"}}, "datePosted": "2020-10-26T15:16:22+0000", "description": "&lt;p&gt;Hampshire Hospitals NHS Foundation Trust has a vacancy for a Junior Clinical Fellow in Surgery at the Basingstoke and North Hampshire Hospital site to commence as soon as possible for an initial period of 12 months. These posts are designed to support both emergency and elective services and will be modular in nature, with time spent in Emergency Surgery, Elective Surgery / Endoscopy and in the Surgical Critical Care Unit. The elective components of the post are flexible and can be tailored to fit the needs of candidates to support their own interests within the full spectrum of general surgery or urology, and will contain dedicated training lists. In addition to clinical duties, protected time for audit / research is provided and each appointee will be allocated an academic project and supervisor for the duration of the post. Projects may be undertaken in any area of elective / emergency care, urology or critical care.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be part of a busy surgical unit which includes tertiary services for liver resection and peritoneal malignancy. The post will suit SHO level doctors either prior to, or following a formal core training scheme, who wish to gain comprehensive exposure to acute and elective surgery as well as aspects of surgical critical care. The operative exposure is flexible and can be tailored to the experience and abilities of individual trainees. The posts are designed to provide clinical and academic exposure to assist with either applications to higher specialty training or success in the intercollegiate MRCS examination.&lt;/p&gt;\n&lt;p&gt;Some shifts will require out of hours cover for surgical admissions (to 10pm), however there are no night shifts involved.&lt;/p&gt;\n&lt;p&gt;Although not recognised for training by the Royal College of Surgeons, the post offers an excellent opportunity for the successful candidate to build on existing knowledge and skills in order to strengthen and enhance their portfolio. All of the previous incumbents have been successful in gaining recognised training placements in their chosen schemes.&lt;br /&gt;&lt;br /&gt;Only short-listed candidates will be contacted.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Alex TzivanakisJob titleConsultantEmail addressAlexios.Tzivanakis@hhft.nhs.ukTelephone number01256 473202Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Faheez Mohamed - Clinical Director, Surgical Services&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hospital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Junior Clinical Fellow - General Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243100", "validThrough": "2020-11-08T23:59:59+0000"}