{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T11:31:23+0100", "description": "&lt;p&gt;Do you want to make a difference? Are you looking for a new and different career pathway whilst developing clinical skills? We have unique opportunities for enthusiastic Band 5 nurses to come and join our teams working jointly within research and the clinical areas. Successful applicants can expect an excellent friendly working environment, professional support and development opportunities.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAMS&lt;/p&gt;\n&lt;p&gt;Research is a rewarding and patient centred career!&lt;/p&gt;\n&lt;p&gt;The research conducted at UHS is focussed on the health and well-being of our patients and their families and significantly contributes to the future progress of healthcare for all patients. We can truly make a difference to an individual’s care and experience within UHS. We strive to ensure that research is considered as a treatment option for all eligible patients and close working with clinical teams and within patients’ clinical pathways ensure that research opportunities and our research teams are expanding.&lt;/p&gt;\n&lt;p&gt;We have a team of around 300 Research Nurses, AHPs, Midwives and Clinical Trials Assistants, working together across the Trust, within our award winning teams to bring exciting research opportunities to UHS for the benefit of our patients and for the future of healthcare. The Research team is composed of multidisciplinary researchers from hospital and university backgrounds, working in collaboration with clinical services, aiming to deliver a variety of studies to improve patient care and outcomes.&lt;/p&gt;\n&lt;p&gt;Neurosciences&lt;/p&gt;\n&lt;p&gt;The Wessex neurological centre (WNC) provides a dedicated, integrated 24-hour acute neurosurgical, neurological, spinal and stroke assessment, investigation and treatment service. Sitting within a large teaching hospital, it has clear priorities for maintaining high standards of care and developing specialist services for the community and purchasers of the former Wessex region, West Sussex and the Channel Islands.&lt;/p&gt;\n&lt;p&gt;We support our staff, offering a variety of opportunities for career progression. When it comes to careers we are committed to developing yours. We support both professional and personal development, recognising its importance in delivering a quality service.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;These posts represent an excellent training opportunity. You will work jointly with the research team and the clinical team within Neurosciences with approximately 50% of your time working clinically within the speciality area and the remaining time will be clinical research activity. You will be trained in research study delivery and clinical assessments, treatments and care within the clinical department. Currently we are running a portfolio of Urgent Public Health (COVID-19) studies, so there will be the expectation that the successful candidates will work on these studies and potentially “face-to-face” with COVID-19 positive patients.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a Band 5 nurse or AHP to start to develop their career in clinical research. This unique role will enable you to develop both your research and clinical skills in the context of the high profile and very successful research department at University Hospital Southampton.&lt;/p&gt;\n&lt;p&gt;You will work with the team to deliver a wide variety of studies from observational designs to complex interventional and drug trials. You will have the opportunity to be involved in all stages of study delivery from set-up and planning, recruitment, intervention delivery and data collection.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic nurse or AHP who is organized, self-motivated and aspires to further their career in clinical research. You will ideally have experience of clinical research, though this is not essential for the role. Full research training will be given; we have an excellent induction and ongoing education programme. You will be involved in all aspects of the research process from study start-up, recruitment and delivery, to study close. Team-working skills, flexibility and drive will be required to ensure the success of this post. You will need to have an excellent level of written and verbal communication skill. IT skills would also be advantageous. You will work in collaboration with multidisciplinary teams, implementing studies to translate scientific discoveries into improved patient outcomes.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;We are proud that every member of our team receives a detailed induction and training package specific to their needs, experience and job role. Our dedicated education team and supportive leadership structure (led by Head of Nursing/ Professions - Research and three Research Matrons working across all facilities), ensures that our staff have the skills and knowledge to care for their patients and undertake research to the highest standards. More information on the benefits of joining our UHS Clinical Research Team can be seen in the video link at the bottom of the advert. We are able to develop fantastic relationships with our patients and their families. We are in a very fortunate position to be able to build trust and to support our patients with excellent follow-up and continuity of care.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Friday, 27 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;Unfortunately at this time we unable to offer informal visits, but If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jisha Jacob&lt;/p&gt;\n&lt;p&gt;Divisional Senior Research Sister&lt;/p&gt;\n&lt;p&gt;jisha.jacob@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381203555&lt;/p&gt;\n&lt;p&gt;Ryan Bird Matron&lt;/p&gt;\n&lt;p&gt;ryan.bird@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381206878&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Research / Neuroscience Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240333", "validThrough": "2020-11-16T23:59:59+0000"}