{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751"}}, "datePosted": "2020-11-02T13:01:41+0000", "description": "&lt;p&gt;Applications are invited for the post of permanent Specialty Doctor in Breast Surgery at London North West University Trust. You will become part of a highly experienced and dedicated team of 5 Consultants, 2 Specialty Doctors, 2 Registrars, 1 SHO , 1 trainee breast physician and 4 Breast Care Specialist Nurses providing a comprehensive quality service across all three hospital trust sites (Northwick Park, Ealing and Central Middlesex).&lt;/p&gt;\n&lt;p&gt;Applicants should have relevant breast surgical experience, to allow independent operating. The contract is full time, 10 PA’s per week and no on call commitment. Included within the 10 PAs is protected time for continuing professional development. Duties include provision of clinical and administrative care to both in-patients and outpatients, with theatre sessions also time-tabled. Attendance at Multi-disciplinary meetings and audit meetings is mandatory. Supervision and training of the junior doctors and medical students attached to the team is part of the role.&lt;br /&gt;&lt;br /&gt;The Trust provides a comprehensive range of acute and community-based services, including A&amp;E emergency care and emergency surgery, elective surgery in many specialties, maternity and cancer services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Krystel Copeland - Breast service Manager Krystel.copeland1@nhs.net 07388857775&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London North West university Healthcare, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Breast Speciality Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252151", "validThrough": "2020-11-16T23:59:59+0000"}