{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-27T10:31:43+0000", "description": "&lt;p&gt;The Ward Coordinator has the responsibility to lead the multidisciplinary team and oneself in the provision of woman centered care, either directly within her/his caseload or indirectly in support of midwives and associated staff liaising with consumer groups and external agencies. Practice in accordance to best practice informed by NICE and Government initiatives. The role encompasses the responsibility for direct line management of all staff supporting/coaching staff in problem solving and decision making, ensuring the clinical environment is safe and practitioners provide evidenced based high quality maternity care, a responsibility to facilitate learning for all staff, ensuring that the clinical areas provide experience that is conducive to formal learning.&lt;/p&gt;\n&lt;p&gt;Provide midwifery care in accordance with the NMC professional standards of practice.&lt;/p&gt;\n&lt;p&gt;We are proud of our reputation for providing a woman centred service using evidenced based guidelines on which to build our practice.&lt;/p&gt;\n&lt;p&gt;Midwifery Led Care is well established for women with low risk pregnancies and the Acorn Suite (MLU) is well utilised. Midwives all work closely with Obstetricians to provide high quality individualised care for women with high risk pregnancies and labour.&lt;/p&gt;\n&lt;p&gt;uccessful applicants will be expected to maintain a record of excellent attendance and have the ability to work flexible shift patterns to include nights and weekends.&lt;/p&gt;\n&lt;p&gt;Although we have a very strong learning and development function, you will need to have acquired some skills and experience from your career in order for your time with us to be a real success. These can be found in the Person and Job Description attachment on NHS Jobs. However we have highlighted three of them below&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1 NMC Registered Midwife&lt;/li&gt;\n&lt;li&gt;2 Evidence of professional development towards degree/diploma level&lt;/li&gt;\n&lt;li&gt;3 ENB 997/8 or MSPP&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What about the department I will Join?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Maternity Department is housed in a purpose built modern accommodation. All of the Services are under one roof in very pleasant surroundings.&lt;/p&gt;\n&lt;p&gt;Although we have a very strong learning and development function, we appreciate you will need to have acquired some skills and experience from your career you will require in order for your time with us to be a real success. These can be found in the Person and Job Description attachment on NHS Jobs. However we have highlighted three of them below&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To take responsibility for the provision of sound clinical, educational and managerial leadership to a team of midwives and support staff concerned with hospital and community based midwifery care. You are responsible for providing Leadership and Management skill associated with educational Health and Safety and audit and reducing risks staff and self-development.&lt;/li&gt;\n&lt;li&gt;To provide care, support innovative and up to date advice to women and their families throughout the in all care settings, in accordance with the Midwives rules and standard.&lt;/li&gt;\n&lt;li&gt;Support the Head of Midwifery, Matrons - Clinical Midwifery Manager in the execution of their role.&lt;/li&gt;\n&lt;li&gt;Demonstrate and promote excellent interpersonal skills promoting quality written, verbal and nonverbal communication styles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Susan Prince&lt;/p&gt;\n&lt;p&gt;Job title: Matron - Maternity Inpatients&lt;/p&gt;\n&lt;p&gt;Email address: susan.prince@bedfordhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01234 355122 ext:5812&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedfordshire Hospitals NHS Foundation Trust, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Labour Ward Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244027", "validThrough": "2020-11-10T23:59:59+0000"}