{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32283", "minValue": "32283", "unitText": "YEAR", "value": "£32,283 WTE pro rata"}}, "datePosted": "2020-10-07T10:47:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Derby Health Staffing Workers - Registered Nurse (Adult)&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Derby Health Staffing manage and provide flexible workers in a variety of settings. We are committed to providing experienced healthcare professionals across multiple staffing disciplines and are an integral part of the workforce.&lt;/p&gt;\n&lt;p&gt;If you are looking for flexible work that can fit around your other commitments, and are dedicated to providing the very best care for patients then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;We are looking for passionate and experienced Registered Nurses who can work across a variety of disciplines to meet the needs of our service&lt;/p&gt;\n&lt;p&gt;Zero hours per week - As and When Required Working Arrangements&lt;br /&gt;&lt;br /&gt;Working Arrangements are £32,283 pro-rated based on 37.5 Whole Time Equivalent&lt;br /&gt;&lt;br /&gt;As an experienced healthcare professional, we enable you to have control over your availability to work, provide ongoing professional support to meet your registration needs and give you the opportunity of working in a variety of settings which will inevitably strengthen your skills as a practitioner.&lt;br /&gt;&lt;br /&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Requirements:&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;We are looking to appoint individuals that meet all of the requirements below:&lt;br /&gt;&lt;br /&gt;• Display excellent interpersonal skills with a flexible approach to work&lt;br /&gt;• Be able to work effectively within an established team&lt;br /&gt;• Have a minimum of 6 months post qualification experience in an acute hospital, which must be recent&lt;br /&gt;• Have current and valid professional registration as defined by the job description&lt;br /&gt;• Have evidence of ongoing CPD and learning related to your areas of practice.&lt;br /&gt;&lt;br /&gt;If you have been out of acute hospital practice for a while, please contact the Recruitment Team to discuss what support would be available to you.&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Please note: There is no guarantee of work being offered to you should you be successfully appointed. You are also under no obligation to accept work offered to you. Working Arrangements with further details will be issued to you for review and agreement prior to commencement.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Recruitment Team dhft.flexiblerecruitment@nhs.net&lt;br /&gt;Tel: 01332 787898/787034/786143&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby, Burton, Lichfield, Tamworth", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Flexible Registered Nurse (Adult)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216075", "validThrough": "2021-04-06T23:59:59+0100"}