{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "89545", "minValue": "65542", "unitText": "YEAR", "value": "£65,542 - £89,545"}}, "datePosted": "2020-11-03T08:22:02+0000", "description": "&lt;p&gt;Associate Director of Operations – ePR and Digital Transformation Lead&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 8c - 8d&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours Per Week:&lt;/strong&gt; 37.5 but flexibility will be required&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type:&lt;/strong&gt; Fixed term or Secondment for 12 months with the possibility of extension&lt;/p&gt;\n&lt;p&gt;Based at Guildford&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Join us as we begin our journey to transform the way we deliver clinical care&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Background&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Royal Surrey NHS Foundation Trust, Guildford and Ashford and St Peter’s Hospitals NHS Foundation Trust, Chertsey have an exciting opportunity to be part of a dynamic team that will implement the Trusts’ &lt;strong&gt;new Integrated Clinical Care System&lt;/strong&gt; (ICCS). This role will be supporting implementation at the Royal Surrey.&lt;/p&gt;\n&lt;p&gt;The ICCS, incorporating the Cerner Millennium Patient Record, will enable clinical staff and other authorised users to share data and streamline their processes across the entire organisation and trust boundaries. This is part of a high-profile transformational programme.&lt;/p&gt;\n&lt;p&gt;This will be an integrated and interoperable system providing a connected experience with access to up-to-date and real-time information about our patients, complete with decision-support tools for clinicians.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the leadership and governance from an operational perspective of the transition to a new ePR system, working with the COO for the Royal Surrey NHS Foundation Trust, the Director of Digital and the ePR Programme Director to ensure that pre- and post-transition planning and oversight is sufficient to maximise benefits, mitigate risks and ensure continued visibility and delivery of the Trust’s performance and quality objectives. A key element of the role will be to ensure that throughout the transitional period of the ePR implementation that operational management teams for services across the Trust are supported to achieve the required results.&lt;/p&gt;\n&lt;p&gt;The role will also promote innovation and champion the development of an appropriate information culture across the health economy.&lt;/p&gt;\n&lt;p&gt;You will be primarily based at one Trust but will be required to collaborate and manage relationships with your counterparts across other Trusts within the programme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an experienced operational senior leader with a post-graduate qualification or equivalent experience, with experience of leading significant change and delivering tangible and sustained improvements.&lt;/p&gt;\n&lt;p&gt;You will be familiar with the development of service improvement plans, confident in advising board/senior staff on professional issues and also able to engage with patients and key stakeholders. You will have outstanding communication and IT skills with knowledge of a wide range of software packages and good experience of the impact of using clinical systems. Experience of using Cerner Millennium is also desirable.&lt;/p&gt;\n&lt;p&gt;You will be confident in building rapport and credibility with senior clinical and managerial colleagues and communicate highly complex, sensitive, contentious information to groups of staff where there may be barriers and resistance to change.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS check will be required for the role. Some evening and weekend work will be required to meet deadlines, so flexibility with regard to working hours is essential.&lt;/p&gt;\n&lt;p&gt;For further information about this post, please contact:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bob Peet, Chief Operating Officer bob.peet@nhs.net&lt;/li&gt;\n&lt;li&gt;PA – Clare Page c.page4@nhs.net&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "AD Operations", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253151", "validThrough": "2020-11-12T23:59:59+0000"}