{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16913", "minValue": "15789", "unitText": "YEAR", "value": "£15,789 - £16,913 pro rata"}}, "datePosted": "2020-11-06T11:46:58+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dorset is renowned for its quality of living, picturesque countryside and its famous Jurassic Coastline. You could improve your quality of life by combining these benefits with working for a transformational organization.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic person to join our Intermediate Care and Rehabilitation Therapy Team here in the East Dorset Locality. We aim to deliver a high quality rehabilitation service to patients within the locality and local Community Hospitals.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work predominately within the East Dorset Locality community but may also need to work on the wards as required . They will need to have the ability to drive a car as they will be required to visit patients in their own homes and other community settings.&lt;/p&gt;\n&lt;p&gt;Responsibilities will require you to work mainly under the close supervision of the clinicians within the team, but at times also to work autonomously. Previous rehabilitation/care experience, working in the community or on a ward would be desirable.&lt;/p&gt;\n&lt;p&gt;You will be required to achieve a certain competency level which we will give you support and training to help you reach. Opportunities for further training may be available through the Trusts Training Department.&lt;/p&gt;\n&lt;p&gt;Some administrative responsibilities will be required within the team.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Van den Akker, Team Lead, Email address: sue.vandenakker@nhs.net, Telephone number: 01202584209&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Leonards Hospital, Hants", "postalCode": "BH24 2RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8179", "longitude": "-1.85603"}}, "title": "Community Rehabilitation Assistant, Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259506", "validThrough": "2020-11-22T23:59:59+0000"}