{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "34000", "unitText": "YEAR", "value": "Up to £34,000 FTE - DOE"}}, "datePosted": "2020-10-26T09:44:58+0000", "description": "&lt;p&gt;&lt;strong&gt;I treat more than just symptoms!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Looking for something a little different?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;We&#39;re looking for a Primary Care Mental Health Nurse to join our team within the healthcare department at HMP Huntercombe. This will involve working inside the prison, within healthcare and on the prison wings.&lt;br /&gt;&lt;br /&gt;HMP Huntercombe is a category C adult male prison for a foreign national population in order to support government priorities on the deportation of foreign national offenders. HMP Huntercombe is situated in Nuffield in Oxfordshire within the North Wessex Downs ares of outstanding natural beauty. It&#39;s located within 15 minutes of Henley on Thames, 30 minutes of Reading and 35 minutes of High Wycombe.&lt;br /&gt;&lt;br /&gt;Healthcare is provided:&lt;br /&gt;07:45 – 18:30, weekdays&lt;br /&gt;08:30 - 16:30, weekends&lt;br /&gt;HMP Huntercombe does not offer 24 hour healthcare and as such there are no night shifts.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. CBT, substance misuse, ANP, BBV, sexual health, plastering, ILS, health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;In return for your hard work you will...&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Receive an annual salary of up to £34,000 FTE - dependent on experience. Pro-rata for part-time hours. Please note both the full-time and part-time roles will require weekend working.&lt;br /&gt;&lt;br /&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time hours) plus CPD and re-validation support. Other benefits include cycle to work scheme, staff wellbeing, plus training and clinical development opportunities.&lt;br /&gt;Onsite benefits at HMP Huntercombe include access to a free gym on site (outside of regime hours), free parking, subsidised mess/canteen.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;You will be a qualified Registered Mental Health Nurse with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service. If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;br /&gt;&lt;br /&gt;You will also be working as part of a larger multi-disciplinary team, alongside the primary care and pharmacy teams.&lt;br /&gt;&lt;br /&gt;New to prison healthcare?&lt;br /&gt;Do not worry... you will be supported and mentored throughout your first 6 months and beyond with Practice Plus Group by experienced teams of highly skilled nurses and practitioners as well as management.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by our Internal Recruitment team. The recruiter will submit your CV to the hiring manager and in turn we will arrange an interview for you to attend at HMP Huntercombe if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Henley-On-Thames", "postalCode": "RG9 5SB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.588", "longitude": "-1.01951"}}, "title": "Mental Health Nurse - HMP Huntercombe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241880", "validThrough": "2020-11-09T23:59:59+0000"}