{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T17:01:00+0000", "description": "&lt;p&gt;This post will deliver specialist Perinatal services in North Lancashire and South Cumbria. The Specialist Perinatal Community Mental Health Team (SPCMHT) is an exciting new service development for the whole of Lancashire and South Cumbria.&lt;/p&gt;\n&lt;p&gt;The SPCMHT aspires to provide an excellent comprehensive Perinatal Mental Health Service for the women of Lancashire and South Cumbria. We deliver a sustainable and resilient solution for women suffering from a mental illness in the perinatal period by focusing on improving outcomes for them, their infant and their families. We do this by effective multidisciplinary integrated team working and ensuring effective prevention that responds to local need by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Intervening earlier to at preconception, during pregnancy and up to 1 year following delivery&lt;/li&gt;\n&lt;li&gt;On-going training of professionals from multiple disciplines&lt;/li&gt;\n&lt;li&gt;Improving pathways and processes for mothers, their families and professionals&lt;/li&gt;\n&lt;li&gt;Delivering a multi-disciplinary specialist perinatal mental health service to woman who present with severe/complex mental health needs, in accordance with CR197 staffing recommendations and delivery of NICE recommended intervention.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Specialist Perinatal CMHT is one team, made up of three hubs, Central and West Lancashire, North Lancashire/South Cumbria and Pennine Lancashire.&lt;/p&gt;\n&lt;p&gt;The post holder will carry a caseload and work with senior clinicians, have responsibility for the delivery of high quality care that will include delivering talk therapies.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from both male and female applicants and although it would be an advantage there is no requirement to have previous perinatal experience as all training requirements will be available as part of your induction and within your Personal Development Planning.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Wall, Team Leader, Tel: 01254 612731, or email: helen.wall@lscft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Leonie Smedley, Team Leader, Tel: 01772 520733, or email: leonie.smedley@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Barn, Lancaster", "postalCode": "LA1 4JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.032", "longitude": "-2.80452"}}, "title": "Perinatal Community Mental Health, Care Co-ordinator.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245518", "validThrough": "2020-11-10T23:59:59+0000"}