{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary plus benefits"}}, "datePosted": "2020-10-29T09:35:42+0000", "description": "&lt;p&gt;&lt;strong&gt;BMI Harbour Hospital&lt;/strong&gt;&lt;strong&gt; in Poole &lt;/strong&gt;is part of BMI Healthcare, Britain&#39;s leading provider of independent healthcare with a nationwide network of hospitals &amp; clinics, performing more complex surgery than any other private healthcare provider in the country. &lt;/p&gt;\n&lt;p&gt;Would you like an opportunity to work in BMI Harbour Hospital Cancer Services as a Nurse Specialist? This is an excellent opportunity if you are an experienced nurse looking to enhance your skills in supporting patients across their whole cancer pathway. Breast Cancer services are an integral service within BMI and so this is an exciting time to make a contribution to the further development of this passionate and dynamic Specialist Nursing team. The successful candidate will join a busy, established and motivated team who provide an excellent service to patients who have been diagnosed with breast cancer who require a comprehensive programme of support throughout their diagnosis, treatment and beyond.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who can demonstrate they have experience in caring and supporting patients and their families and enabling them to make informed decisions. You must be able to demonstrate you have the necessary communication and organisational skills and have an understanding of the current cancer agenda.&lt;/p&gt;\n&lt;p&gt;The successful applicant should be able to actively plan, implement and evaluate expert nursing care and provide specialist advice and psychosocial support to patients and carer’s with breast cancer across the range of care settings within the hospital. You will work in collaboration with the Breast Consultant Oncologists and other members of the multi-professional team to ensure the continuity of an integrated seamless holistic approach to Breast Cancer Care. You will play an active part in clinical practice, education, audit and the implementation of national guidelines. You will be required to make quality improvements in the provision of breast care, alongside the nursing team.&lt;/p&gt;\n&lt;p&gt;For further detailed information on the responsibilities and accountabilities of this vacancy please refer to the job description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Salary &amp; Benefits:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BMI Healthcare is committed to offering competitive starting salaries alongside access to a wide range of employee benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BMI Healthcare Private Medical Insurance&lt;/li&gt;\n&lt;li&gt;BMI Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 days holiday per annum increasing up to 30 days with long service&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity, Paternity &amp; Adoption Leave&lt;/li&gt;\n&lt;li&gt;Market leading learning and development, including free courses and industry recognised qualifications&lt;/li&gt;\n&lt;li&gt;Nationwide Gym discounts &amp; Online Fitness Classes&lt;/li&gt;\n&lt;li&gt;BMI Staff Health Checks&lt;/li&gt;\n&lt;li&gt;Blue Light Discount Card for 1,000s of nationwide discounts and exclusive offers&lt;/li&gt;\n&lt;li&gt;Cycle to Work – and much more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Interested?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to apply for this opportunity, please complete our brief online application form and ensure to upload the most recent copy of CV.  We aim to respond to your application within 14 days of the closing date.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory &lt;/strong&gt;&lt;strong&gt;Enhanced Disclosure Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Disability Confident – Committed Employer:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed Employer BMI we endeavour to ensure that disabled people and those with long term health conditions have the opportunities to fulfil their potential and realise their aspirations within BMI. If you require reasonable adjustments for your application, interview or during your onboarding/induction process BMI will support you. For more information on the Government’s Disability Confident Employer Scheme, please click here&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH15 2BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97569"}}, "title": "Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247749", "validThrough": "2020-11-29T23:59:59+0000"}