{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 gross per annum"}}, "datePosted": "2020-10-20T12:41:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Adult Psychiatrist Bury South Adult Community Team (Full-time 10-PA’s) – G Block, Hospital Road Site, Bury St Edmunds, Suffolk. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a well-established, friendly team, working in the beautiful county of Suffolk. We are looking for a highly motivated and enthusiastic Consultant Psychiatrist to join us as we move forward with major service reconfiguration. We are in the process of establishing our Primary Care Networks and specialist secondary care provision. This will enable closer working relationships with our primary care colleagues and partners in our local, well established care network alliance, improving mental health provision for our population. Work is already underway for a more needs lead, intervention-based approach in secondary care for those with SMI. This is an exciting time to be involved in making a real difference to the quality of services delivered. The post holder will provide a pivotal clinical leadership role in decisions and their implementation about our interventions-based offer. This post would equally suit a Consultant looking to take up their first substantive post or an experienced Consultant looking for a new challenge or change of location.&lt;/p&gt;\n&lt;p&gt;This really is a dynamic role which will provide applicants with plenty of scope to develop clinical and leadership expertise. You will be supported by anther consultant working in the team as well as other consultant colleagues providing community and crisis care in West Suffolk. There are good working relationships with the new Care Group leadership team who will also provide you with support.&lt;/p&gt;\n&lt;p&gt;In West Suffolk we have strong links with the University of Cambridge with several teaching opportunities available both at undergraduate and postgraduate level. Embedding Quality Improvement is key to the services development and you will benefit from access to the Trusts QI training and support. The successful applicant will be encouraged to participate in and lead QI projects. The Care Group are highly supportive of research, Quality Improvement and CPD and are keen to work with all clinical leaders to provide services that imbue quality standards.&lt;/p&gt;\n&lt;p&gt;Applicants for the post should have, or be eligible for, a CCT and General Medical Council Specialist Registration within six months of the interview date. Full GMC registration, approval under Section 12 of the Mental Health Act, eligibility / approval for Approved Clinician status and appropriate psychiatry experience required.&lt;/p&gt;\n&lt;p&gt;Norfolk and Suffolk NHS Foundation Trust was founded in January 2012, from the predecessor Norfolk &amp; Waveney Mental Health Trust and Suffolk Mental Health Partnership.&lt;/p&gt;\n&lt;p&gt;The Trust believes in equal opportunities and welcomes applications irrespective of age, disability, ethnic origin, gender, sexuality or religious belief.&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;If you are passionate about improving acute care and working with colleagues across Crisis and Community Pathways, then come to work with us as we have much to offer including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Beautiful countryside with easy access to award winning coastal locations.&lt;/li&gt;\n&lt;li&gt;Excellent rail links to Cambridge and London&lt;/li&gt;\n&lt;li&gt;Affordable housing and reputable college and schools.&lt;/li&gt;\n&lt;li&gt;Relocation allowance / removal benefit&lt;/li&gt;\n&lt;li&gt;Protected time of 2.5 SPA per week (pro rata)&lt;/li&gt;\n&lt;li&gt;We have a strong education reputation and close ties with both the university of Cambridge and The University of East Anglia&lt;/li&gt;\n&lt;li&gt;Local teaching programme&lt;/li&gt;\n&lt;li&gt;Access and encouragement to partake in research and a well-established research network within the Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants for the post should have or be eligible for a CCT and eligible onto the Specialist Register within six months of the interview date. Full GMC registration, approval under Section 12 of the Mental Health Act, eligibility for Approved Clinician status and appropriate adult psychiatry experience are required.&lt;/p&gt;\n&lt;p&gt;The Trust is working towards equal opportunities and welcomes applications irrespective of age, disability, ethnic origin, gender, sexuality or religious belief.&lt;/p&gt;\n&lt;p&gt;The Trust operates a no smoking policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying. Interviews will be held remotely via Microsoft Teams.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle PainterAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our service then please contact Michelle Painter, Clinical Director, West Suffolk Care Group on 01284 719822, email&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "G Block, Hospital Road, Bury St Edmunds, Bury St Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Consultant in Adult Psychiatry - Community with Relocation Allowance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234433", "validThrough": "2020-11-08T23:59:59+0000"}