{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-27T14:29:23+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for 2 full time Nurse Practitioners / Primary Care Practitioners.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a skilled Registered Nurse, Registered Paramedic or Registered Physiotherapist with the appropriate attitude, skills and knowledge base. In addition, you will hold a current qualification at degree level in the management of minor illness, and a Bachelor’s degree or working towards a Bachelor’s degree, or currently be undertaking a Masters level programme in Advanced Clinical Practice. You will deliver quality holistic care and treatment to the Practice population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a really exciting time for Central Healthcare, having recently formed a new partnership with Haxby Group, who are rated ‘outstanding’ by the CQC.&lt;/p&gt;\n&lt;p&gt;Both Haxby Group and Central Healthcare are accredited training practices and by joining forces we are able to strengthen staff training and development opportunities for all of our staff.&lt;/p&gt;\n&lt;p&gt;Further benefits that Central Healthcare can offer are:&lt;/p&gt;\n&lt;p&gt;· Support from a larger clinical team, including senior GPs, primary care practitioners and specialist advanced nurse practitioners.&lt;/p&gt;\n&lt;p&gt;· A state-of-the-art digital patient access and consultation system and appointment booking to improve waiting times and availability of appointments.&lt;/p&gt;\n&lt;p&gt;· Investment in new IT and telephone infrastructure.&lt;/p&gt;\n&lt;p&gt;· Support from a large HR, Finance and Business Intelligence team&lt;/p&gt;\n&lt;p&gt;· Help with patient communications and engagement&lt;/p&gt;\n&lt;p&gt;· Flexibility of staffing as specialists can be available from across sites&lt;/p&gt;\n&lt;p&gt;· Benefit from the experience and knowledge embedded in a practice that has achieved outstanding results in areas with a similar patient populations&lt;/p&gt;\n&lt;p&gt;· Support from Haxby Group Training.&lt;/p&gt;\n&lt;p&gt;We have a flexible approach to working and working hours.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact our Clinical Nurse Lead – sue.mabbott@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO11 1UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2773", "longitude": "-.409719"}}, "title": "Nurse Practitioner / Primary Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244946", "validThrough": "2020-11-17T23:59:59+0000"}