{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "11767", "minValue": "11767", "unitText": "YEAR", "value": "Band 6/7 depending on experience"}}, "datePosted": "2020-10-14T16:18:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Infection Prevention and Control Specialist Nurse&lt;/strong&gt;&lt;strong&gt; | &lt;/strong&gt;&lt;strong&gt;Band 6/7 depending on experience&lt;/strong&gt;&lt;strong&gt;| Southampton &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Southampton Hospital has an exciting opportunity for an Infection Prevention Control Lead to join our experienced and dynamic team. This is an exciting role to support all infection prevention &amp; control processes within the Hospital, by assisting the Director of Clinical Services to achieve a robust governance framework in their role as Director of Infection Prevention &amp; Control (DIPC).&lt;/p&gt;\n&lt;p&gt;Spire Southampton Hospital holds a long standing reputation for providing high quality, comprehensive private hospital care. Our facilities are excellent and the hospital is staffed by a valued team of highly skilled professionals. We provide a dynamic and stimulating environment for highly motivated nurses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assume a senior position in the development of up to date infection prevention and control policies, overseeing their implementation into practice&lt;/li&gt;\n&lt;li&gt;Ensure and supervise the maintenance of a high quality service and a safe environment for staff, patients and visitors.&lt;/li&gt;\n&lt;li&gt;To set up and establish education and training initiatives to ensure that all hospital personnel have access to appropriate training in infection prevention and control practice.&lt;/li&gt;\n&lt;li&gt;To be aware of current trends and research findings relating to infection prevention and control in clinical practice and support services and to ensure that relevant developments are communicated to the appropriate staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a Registered Nurse and hold a IP&amp;C Diploma (or equivalent)&lt;/li&gt;\n&lt;li&gt;Experienced with the IP&amp;C agenda and standards&lt;/li&gt;\n&lt;li&gt;Be used to working in teams with minimum supervision.&lt;/li&gt;\n&lt;li&gt;Experience of working in an acute environment.&lt;/li&gt;\n&lt;li&gt;Competence across a range of skills, supported by professional and clinical knowledge acquired through state registration.&lt;/li&gt;\n&lt;li&gt;A surgical background is desirable.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package, which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Penny Lawless on 07715 055760 or penny.lawless@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.43272"}}, "title": "Infection Prevention and Control Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227075", "validThrough": "2020-11-14T23:59:59+0000"}