{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-11-04T11:01:57+0000", "description": "&lt;p&gt;We are currently recruiting healthcare assistants to join the Peterborough city Hospital to work on ward B11. Ours is a dynamic, innovative and stimulating environment and comes with a flexible approach to role development and working hours. Investing heavily in new facilities, we’re equipping ourselves to meet tomorrow’s healthcare challenges head on. As part of this, we’re also investing in our people – helping them to realise their potential within a friendly, supportive and listening culture.&lt;/p&gt;\n&lt;p&gt;No experience or qualifications are required but you must have a good standard of literacy and numeracy. Applicants who are shortlisted will be expected to take a literacy and numeracy test and attend interview.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint enthusiastic and motivated healthcare assistants with keen interest in stroke care. We need you to have a passion for delivering high standards of care, commitment to sharing your knowledge and skills and motivation to help drive our services forward. You will assist with essential hygiene and nutrition needs, undertake rehabilitation goals and offer support and comfort whilst maintaining patient safety at all times.&lt;/p&gt;\n&lt;p&gt;Ward B11 is split into 2 areas; with 9 beds in the hyper acute area and 25 beds in the ward area providing acute and rehabilitation stroke care, plus and assessment room We offer a 24 hour thrombolysis service and also provide a service for high risk TIA patients.&lt;/p&gt;\n&lt;p&gt;The ward has the support of a dedicated stroke coordinator 24/7 and you will have support to complete your care certificate and stroke competencies.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarole BarhamJob titleWard ManagerEmail addresscarole.barham@nhs.netTelephone number01733 677714 / 11Additional contact information&lt;/p&gt;\n&lt;p&gt;Carole Barham Ward Manager on 01733 677711/14 or email carole.barham@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Healthcare Assistant  - Ward B11", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255521", "validThrough": "2020-11-18T23:59:59+0000"}