{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive salary"}}, "datePosted": "2020-11-06T10:56:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join a friendly, dynamic and forward thinking practice with an Outstanding CQC rating, in the Berkshire town of Reading.&lt;/p&gt;\n&lt;p&gt;The position is full-time.&lt;/p&gt;\n&lt;p&gt;We are looking for an additional competent Paramedic Practitioner to join our duty team, who is looking to use their skills in a General Practice setting.&lt;/p&gt;\n&lt;p&gt;You are already an experienced Paramedic able to deal with the challenges of the role and looking for a change of environment. We can offer you variety of work, fulfilling patient focused care, more family friendly hours and career progression within a supportive multi-disciplinary team structure.&lt;/p&gt;\n&lt;p&gt;You should be HCPC registered and hold one of the following qualifications BTECH Level 4, BSc, DipHE, FdSc or have acheived the IHCD Paramedic Award.&lt;/p&gt;\n&lt;p&gt;Urgent care centre (UCC) experience or primary care experience is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;It would be advantageous to have completed modules in the following: Minor Illness, Minor injuries, Drugs and therapeutics, Clinicial thinking and reasoning.&lt;/p&gt;\n&lt;p&gt;This role would suit candidiates interested in new and innovative ways of providing primary care and who are keen to work in a large supported, multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;About us - we are a large practice serving 30,000 patients+ in Reading and have championed an allied healthcare professional team which currently comprises 18 GPs, 4 clinical pharmacists,1 physicians associate, 3 prescribing nurses, 4 nurses, 4 paramedics, 3 HCAs and 2 social prescribers. We have mentors and trainers in the practice and you will be supported by a large, enthusiastic and visionary clinical team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG2 7HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4404", "longitude": "-.95407"}}, "title": "GP Paramedic Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259313", "validThrough": "2020-12-11T23:59:59+0000"}