{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-04T10:01:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Quality and Performance Specialist – Clinical post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at Jubilee House –Contract Management team (Hub Team)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term /Secondment opportunity until 31/03/2021 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main role and duties&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The MLCSU Contract Management Team are looking to recruit a highly experienced Specialist Nurse to assist in the Quality and Performance monitoring of our NHS contracted providers. The role is for a Nurse with both good Clinical and Management background, who has the skill and dedication to improve the quality of Nursing Funded services.&lt;/p&gt;\n&lt;p&gt;Contract Management includes the issuing and monitoring of the CHC Standard NHS Contract for Nursing providers, many of which are Nursing and Residential homes with specialisms such as; ABI, Dementia Care, Physical and Learning Disabilities as well as Mental Health. The post holder needs to be able to support the Contracts Team to offer the clinical review of contracted providers, review quality data and triangulate a full range of intelligence to measure quality and performance is of high standard. Ultimately this measure, will assist our IPA colleagues (Individual Patient Activity) to offer appropriate and safe NHS funded packages of care.&lt;/p&gt;\n&lt;p&gt;The Quality and Performance Specialist (Clinical) will act as a key member of the multi-agency safeguarding and quality teams to identify and support improvement with failing or inadequate providers. This will involve working closely with colleagues in the CCG, Local Authorities (contracting and safeguarding) as well as CQC. To do this there will be attendance at the county RADAR forums, as well as individual provider QIP meetings. The post holder will also be pivotal in any Contract Management meetings where quality issues are raised.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, the post holder will need to have a good understanding of quality indicators in healthcare, excellent skills in performance management and leadership. The role also includes review of Serious Incidents related to contracted providers, for this experience of Route Cause Analysis, good investigatory skills and understanding of safeguarding issues is also required.&lt;/p&gt;\n&lt;p&gt;The Contract Management Team in Lancashire has recently moved to be part of the IPA service, which now includes closer working with partners in IPA/CHC teams and commissioning. The move which took place in April 2020 means that now is an exciting time to be involved in various opportunities to widen contract management, monitoring and greater quality outcomes for our providers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal Enquiries About Vacancies should be sent to:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Barry Glasspell – Senior Contract and Brokerage Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone: 07881 353836&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: Barry.glasspell@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarry GlasspellJob titleSenior Contracts and Brokerage ManagerEmail addressBarry.glasspell@nhs.netTelephone number07881 353836&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "Quality and Performance Specialist – Clinical post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255286", "validThrough": "2020-11-18T23:59:59+0000"}