{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-27T09:15:43+0000", "description": "&lt;p&gt;We welcome you to apply for an exciting job in a close-knit and supportive, multi professional team.&lt;/p&gt;\n&lt;p&gt;If you have an interest in problem solving, data analysis and changing lives, the Intensive Support Team is the place for you. We work with people of all ages who have a learning disability and who may also have Autism. We specialise in supporting individuals at a difficult time in their lives, when this is shown through behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to observe and work with clients in a variety of settings, such as in their homes, day services, in the community, and in schools. However, a big part of your role would also be supporting with data collection, analysing information, collating information and developing evidence in a way that will directly influence the support a person receives. The role will focus on contributing to the assessment of behaviour functions and the application of Positive Behaviour Support interventions for these individuals, under the supervision of registered clinicians. This job role is highly rewarding in every sense and provides the opportunity to build skills and knowledge in Positive Behaviour Support. You will get to work with a range of professionals, such as Nurses, Occupational Therapists, Speech and Language Therapists, Clinical Psychologists and Behaviour Specialists within the team, as well as a range of professions from different settings, such as Consultant Psychiatrists, Teachers, Social Workers, and Support Workers.&lt;/p&gt;\n&lt;p&gt;If you are a team player, keen to learn and be fully involved in working with people with a learning disability who show behaviours that challenge, we would encourage you to read our Job description and person specification to apply for the position. We look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NB: A car driver and having access to a car that can be used for work purposes is essential for this post. As the team is currently encouraged to work from home, it is also essential to have internet access at home to accommodate this. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Cornelia Honold&lt;/p&gt;\n&lt;p&gt;Job title: Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;Email address: cornelia.honold@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07795174503&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7435", "longitude": "-1.19866"}}, "title": "Behavioural Assistant Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243793", "validThrough": "2020-11-08T23:59:59+0000"}