{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-22T11:55:46+0100", "description": "&lt;p&gt;Post: Social Prescribing Link Worker&lt;/p&gt;\n&lt;p&gt;Location: Newark PCN&lt;/p&gt;\n&lt;p&gt;Salary: £21,892 – 24,157 referencing Agenda for Change, Band 4&lt;/p&gt;\n&lt;p&gt;Hours: 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: To be assigned  – Via Microsoft Teams&lt;/p&gt;\n\n&lt;p&gt;PICS is the employer for this role. PICS is a local company wholly owned by GPs, specialising in community-based care, and run for the benefit of patients. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE ROLE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are self-motivated, enthusiastic and a committed person whose passion is to support and empower individuals to take control of their health and wellbeing, we are looking to recruit 1 wte Social Prescribing Link Worker to cover the Newark Primary Care Network area – read more about Newark PCN here.&lt;/p&gt;\n&lt;p&gt;The practices covered for this role will be as follows:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Balderton Primary Care Centre&lt;/li&gt;\n&lt;li&gt;Barnby Gate Surgery&lt;/li&gt;\n&lt;li&gt;Collingham Medical Centre&lt;/li&gt;\n&lt;li&gt;Fountain Medical Centre&lt;/li&gt;\n&lt;li&gt;Housfield Surgery&lt;/li&gt;\n&lt;li&gt;Lombard Medical Centre&lt;/li&gt;\n&lt;li&gt;Southwell Medical Centre&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The patient population for Newark PCN is in excess of 76,339.&lt;/p&gt;\n&lt;p&gt;If you are innovative and would love the exciting challenge of developing a brand new patient focussed service within local Primary Care Networks in the Newark area – then this could be the job for you.&lt;/p&gt;\n&lt;p&gt;Social Prescribing aims to address non-medical issues that may be causing or exacerbating long term health problems such as mental health, social isolation or have complex social needs which affect their wellbeing.  The role is to adopt an holistic non-medical approach, co-designing a social prescription to improve health and wellbeing based on’ what matters’ to the individual  and their individual strengths and needs and integrating services around the person. The aim in the longer term is to reduce the number of clinical and medical interventions required, to promote independence and resilience and improve wellbeing.&lt;/p&gt;\n&lt;p&gt;Ideally you will have worked in a similar role, but this role would also be suited to someone with good local knowledge, appropriate experience and enthusiasm. If you are proactive, enthusiastic, person-centred and hold a clean driving licence with unlimited access to a car then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You can contact Louise Redhead on louise.redhead1@nhs.net for an informal discussion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BENEFITS:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Auto Enrolment to the NHS Pension Scheme or an alternative government based scheme (based on eligibility)&lt;/li&gt;\n&lt;li&gt;Attractive salaries (dependent on experience and qualifications) – referenced to Agenda for Change&lt;/li&gt;\n&lt;li&gt;Access to NHS IT systems&lt;/li&gt;\n&lt;li&gt;Annual leave entitlement references Agenda for Change&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;On Appointment – 27 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;After 5 years’ – 29 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;After 10 years’ – 33 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Recognition of previous NHS service for Annual leave and sickness pay&lt;/li&gt;\n&lt;li&gt;Superb levels of satisfaction reported by staff &lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;TERMS AND CONDITIONS                            &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;All applications are to be made via NHS Jobs - CVs will not be accepted. &lt;/li&gt;\n&lt;li&gt;Please note that applications received after the closing date will not normally be considered.&lt;/li&gt;\n&lt;li&gt;Applicants who have not heard from us with seven days of the closing date can assume that they have not been successful.&lt;/li&gt;\n&lt;li&gt;By submitting an application you consent to your personal data being shared for the purposes of recruitment.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Primary Care Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unit H4, Ash Tree Court, Mellors Way, Nottingham Business Park, Nottingham, NG8 6PY", "postalCode": "NG8 6PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9815", "longitude": "-1.23812"}}, "title": "Social Prescribing Link Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238268", "validThrough": "2020-11-08T23:59:59+0000"}