{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T15:16:03+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a suitably qualified individual to become the new Blood Transfusion Manager within the Laboratory Medicine Service of Swansea Bay University Health Board (SBUHB). SBUHB Laboratory Medicine Service was formed in 2012 from the merger of Laboratory Haematology and Clinical Biochemistry and operates as a Swansea Bay region “hub and spoke” network. The Blood Transfusion element of the Service currently covers the areas and populations served by four hospital sites i.e. Morriston Hospital, Singleton Hospital, Neath Port Talbot Hospital in SBUHB and the Princess of Wales Hospital (which is now in Cwm Taf Morgannwg Health Board). Service provision for the latter is subject to an SLA, and there are discussions relating to the recent Health Board boundary change.&lt;/p&gt;\n&lt;p&gt;The Blood Transfusion Manager will provide an overarching role facilitating the comprehensive management of Transfusion Services within the Swansea Bay University Health Board (SBU HB) in conjunction with the Clinical Lead for Transfusion. Three of the four hospital sites have Blood Transfusion laboratories with exception of Neath Port Talbot Hospital that hosts an issue fridge. The successful applicant would be expected to work on all Health Board sites.&lt;/p&gt;\n&lt;p&gt;Applicants will be required to have responsibility for the operational service delivery and regulatory compliance of Blood Transfusion within SBUHB. The Blood Transfusion department works closely with clinical colleagues including the Welsh Air Ambulance (EMERTS) for which Swansea Bay provides blood and blood products for use on the helicopter. The successful applicant must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive technical knowledge of Blood Transfusion, laboratory and information systems&lt;/li&gt;\n&lt;li&gt;Experience of managing a Blood Transfusion laboratory service either individually or collaboratively&lt;/li&gt;\n&lt;li&gt;Experience of leadership and managing people&lt;/li&gt;\n&lt;li&gt;Advanced knowledge of regulatory and accreditation requirements for Blood Transfusion&lt;/li&gt;\n&lt;li&gt;Extensive experience of Quality Management Systems&lt;/li&gt;\n&lt;li&gt;Experience controlling and managing risk&lt;/li&gt;\n&lt;li&gt;Extensive practical experience of working in a Blood Transfusion laboratory&lt;/li&gt;\n&lt;li&gt;Experience of Pathology IT systems&lt;/li&gt;\n&lt;li&gt;Extensive experience in equipment validation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants for the post will need to be enthusiastic, maintain and develop high standards of quality and enjoy working as part of a team. You will be taking responsibility for service development and duties include supporting the teams, providing operational management and professional leadership for staff in the department. As part of regulatory compliance, ensuring training and competency are in place, ensuring that the department meets its quality, activity and financial targets and in so doing contributes to the Service Group, Unit and Health Board objectives and targets.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lynnette Garrett&lt;/p&gt;\n&lt;p&gt;Job title: Quality Manager&lt;/p&gt;\n&lt;p&gt;Email address: lynnette.garrett@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01792 702222 Ext 39328&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nominated base is Morriston Hospital, Swansea Bay University Health Board (Multi Site Role)", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Blood Transfusion Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258286", "validThrough": "2020-11-19T23:59:59+0000"}