{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T09:00:38+0000", "description": "&lt;p&gt;&lt;span&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) is an established provider of the national programme for ‘Improving Access to Psychological Therapies’ (IAPT). The service provides stepped care treatment for people with mild, moderate and severe common mental health problems such as anxiety and depression.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for 7.6 wte&lt;span&gt; High Intensity Therapists to&lt;/span&gt; join the Cambridge and Peterborough Psychological Wellbeing Service (PWS). Ideally we are looking for individuals who are primarily CBT based practice. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would also consider individuals with alternative IAPT modalities such as Interpersonal Therapy (IPT), Dynamic Interpersonal Therapy (DIT), Counselling for Depression (CfD) or Couples Therapy for Depression (CTfD). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have positions available across our Teams based in Cambridge, Huntington and Fenland, although d&lt;/span&gt;&lt;span&gt;ue to COVID, most staff are working remotely. This is regularly reviewed in line with government and CPFT guidelines.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful candidates will be offered a permanent contract. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Banding will be dependent on having appropriate professional qualifications and accreditation. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer a high standard of supervision to our clinicians that far exceeds the nationally set minimum requirements within IAPT services. Monthly line management and annual appraisals are offered in addition to regular clinical supervision, and supervisors and line managers work closely together to ensure a supportive and developmental environment. We also offer excellent CPD opportunities within the service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service has recently benefited from increased investment, which has led to associated increase in the numbers of patients entering psychological treatments and increased range of interventions and initiatives undertaken by the teams. The successful candidates will therefore need to be flexible, evidence reliability and demonstrate the ability to cope with a demanding job. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holders will be enthusiastic, hard working and able to meet specified targets in order to deliver a high quality Primary Care Mental Health Service to the local population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would also consider applications for part time work (minimum 22.5 hours/week required). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;James Clarke&lt;/strong&gt;, Service Lead PWS&lt;/p&gt;\n&lt;p&gt;james.clarke@cpft.nhs.uk or call 01480 458888&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterton Medical Centre, Cambridge/Huntingdon/March", "postalCode": "CB4 1PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2194", "longitude": ".135919"}}, "title": "High Intensity Therapist/ CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253198", "validThrough": "2020-11-24T23:59:59+0000"}