{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 gross per annum"}}, "datePosted": "2020-11-06T11:46:19+0000", "description": "&lt;p&gt;Suffolk Wellbeing are pleased to be able to offer an exciting opportunity for an enthusiastic and motivated individual to join our team as a Trainee Psychological Wellbeing Practitioner (PWP) Band 4. After successful completion/passing of the training course you would be employed at Band 5.&lt;/p&gt;\n&lt;p&gt;The posts will be based in either Ipswich or Bury St Edmunds, but travel will be required as part of the role during training and post qualification across Suffolk and Norfolk. This is a full time training post which will comprise of 3 days in service, 1 day at university and 1 self directed study day per week. Working hours are between 8am and 8pm.&lt;/p&gt;\n&lt;p&gt;The trainee PWP position involves undertaking the PG or UG Certificate in evidence based low intensity CBT at University Essex (depending on qualifications).&lt;/p&gt;\n&lt;p&gt;We welcome applications from candidates who do not have a degree or who may not have recent study experience or qualifications, but who do have good experience in a caring capacity such as in a support, care or admin work role for example and who are interested in supporting patients with anxiety and depression in using the techniques of Cognitive Behavioural Therapy (CBT) self help. If this applies to you and you are successful at interview we have a short online access course to help you prepare for the training and to build study skills and confidence as well as learning more about IAPT. We recommend you take a look at the University website for more information.&lt;/p&gt;\n&lt;p&gt;If you are invited to interview, you must provide evidence of academic qualification certificates as applicable. Offers cannot be made without this information.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with the knowledge and skills to work as part of a team and be innovative in their approach. You will need to be flexible and have the ability to cope in a highly demanding training role and demonstrate a high level of organisational skill.&lt;/p&gt;\n&lt;p&gt;You will work under the direction of the Team Leader/Senior Psychological Wellbeing Practitioner.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews will be held week commencing November 30th 2020 however subject to change.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The training course will start at 11th January 2021&lt;/p&gt;\n&lt;p&gt;***********************************************************************************************&lt;/p&gt;\n&lt;p&gt;Covid-19 Update.&lt;/p&gt;\n&lt;p&gt;Suffolk Wellbeing continues to function fully despite the restrictions brought about by the Covid - 19 pandemic. All clinical staff (including trainees) are working from home, and this is will continue for the rest of 2020 and potentially well into 2021. The University have made adaptations to the course to enable this to continue via remote delivery.&lt;/p&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via Skype/Microsoft Teams/Zoom rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;**********************************************************************************************&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;A comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;Career progression&lt;/li&gt;\n&lt;li&gt;Starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;Staff physio service&lt;/li&gt;\n&lt;li&gt;Gym membership&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out more about the job role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NSFT is committed to lifelong learning and continuous professional development (CPD) for its entire staff. There are a variety of definitions of CPD across the professions but it is usually taken to mean learning activities which update existing skills. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CPD is determined through appraisal with a personal development plan agreed between an individual and their manager, with the commitment of the necessary time and resources. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Andrew Barton&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: andrew.barton@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07775547643&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Due to the anticpated high demand for these positions we are not able to respond to individual enquiries, so would urge you to look at both the Wellbeing and University websites, as well as search the role of Trainee Psychological Wellbeing practitioner for some helpful guidance.&lt;/p&gt;\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellbeing Suffolk, Ipswich/Bury St Edmunds", "postalCode": "IP33 3ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2407", "longitude": ".707966"}}, "title": "Trainee Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259481", "validThrough": "2020-11-12T23:59:59+0000"}