{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27600", "minValue": "27600", "unitText": "YEAR", "value": "£27,600 per annum FTE"}}, "datePosted": "2020-11-03T16:33:52+0000", "description": "&lt;p&gt;We are looking to recruit several 1 x full time, and 1 x part time (24 hours) Health and Wellbeing Coaches who will work as part of a multi-disciplinary team in the Barnsley Primary Care Network. The  full time role is based in the Central and North Neighbourhoods, and the part time role is based in the Dearne Neighbourhood. &lt;br /&gt;Barnsley has established one “super” Primary Care Network of over 250,000 patients which includes all of GP practices across Barnsley. This is supported by six Neighbourhood Networks building on our successful and existing model of neighbourhood working; this enables us to maintain and focus on the specific needs of each local area whilst allowing integration at a borough wide level.&lt;/p&gt;\n&lt;p&gt;This role involves coaching and motivating patients in managing their own health and wellbeing to live independently and improve their health outcomes. The post holder will work with individual and/or groups of patients to deliver sessions on healthy eating, physical activity and health and well-being to meet personalised care plans. You will use a holistic approach to promote lifestyle medicine approaches and support patients to address their existing health problems and prevent new ones.&lt;/p&gt;\n&lt;p&gt;The role is varied, and may include supporting self-management education, peer support, case management and facilitating group consultations.&lt;/p&gt;\n&lt;p&gt;Please see the attached Job Description and Person Specification for more details&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;please state on your application if you are interested in full time or part time. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5281", "longitude": "-1.46969"}}, "title": "Health and Wellbeing Coach", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254808", "validThrough": "2020-11-30T23:59:59+0000"}