{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35250", "minValue": "35250", "unitText": "YEAR", "value": "£20.97 per hout"}}, "datePosted": "2020-11-05T20:29:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Case Manager - Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ormskirk Hospital, West Lancashire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Case Manager looking to join our newly created virtual ward in West Lancashire working flexible bank hours to suit you and your lifestyle?&lt;/p&gt;\n&lt;h2&gt;Feel Proud&lt;/h2&gt;\n&lt;p&gt;As a Case Manager within Virgin Care you’ll join a virtual team who are focused on supporting our local community.&lt;/p&gt;\n&lt;p&gt;As a Case Manager you will provide support and guidance to a multi-disciplinary team coordinating patient care. You will be required to work autonomously, to manage a case load of patients requiring assessment, diagnosis and treatment, referral, review or discharge, utilising a range of advanced clinical skills and expert knowledge for patients in a virtual setting.&lt;/p&gt;\n&lt;p&gt;You will be an accredited HCPC or NMC registered professional with experience of working at a band 7 or above. You will have experience working with MDT’s and providing complex care packages along with having the confidence to explain chosen clinical pathways to clinicians providing reasoning.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feel valued as a Bank Case Manager with Virgin Care you will recieve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality;&lt;/li&gt;\n&lt;li&gt;Paid induction shift&lt;/li&gt;\n&lt;li&gt;Access to online payslips via our people system (iTrent)&lt;/li&gt;\n&lt;li&gt;Plus the benefits you’d expect from working with an NHS partner&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Feel the Difference&lt;/h2&gt;\n&lt;p&gt;If you’d like to discuss the role further, please contact Careers via email: Careers @virgincare.co.uk&lt;/p&gt;\n&lt;h2&gt;Virgin Care&lt;/h2&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;                                                                                                                                            &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ormskirk", "postalCode": "L39 2AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5645", "longitude": "-2.87161"}}, "title": "Bank Case Manager - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258799", "validThrough": "2020-11-19T23:59:59+0000"}