{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-23T13:46:29+0100", "description": "&lt;p&gt;OXFORD UNIVERSITY HOSPITALS NHS TRUST&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MATERNITY LOCUM CONSULTANT IN GERIATRIC/GENERAL INTERNAL MEDICINE with specialist interest in Community Geriatrics and Complex Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Foundation Trust is looking to appoint a Locum consultant in Geriatric Medicine with an interest in community geriatrics and complex medicine to cover a period of maternity leave.&lt;/p&gt;\n&lt;p&gt;We are looking for a colleague to work with existing consultants in complex medicine unit and in community hospitals within Oxfordshire. The job will include a block of acute general medicine (AGM) in the Horton General Hospital and/or John Radcliffe Hospital and/or sessions on one of our ambulatory units. There may also be an opportunity to do outpatient work, depending on interest.&lt;/p&gt;\n&lt;p&gt;The Trust is a NHS Digital exemplar as one of 12 Trusts on a fast track to becoming paperless. This Directorate has been at the forefront of this change having led the e-prescribing rollout. New colleagues are expected to support this ongoing work; training will be provided.&lt;/p&gt;\n&lt;p&gt;The appointment is based on a 10 PA job-plan. Applications are welcome from those who wish combine clinical work with research.&lt;/p&gt;\n&lt;p&gt;Geratology in Oxford offers acute and community services, innovative outpatient and ambulatory care for older people. This is a great time to join our dynamic team and become part of a consultant workforce with a reputation for excellence and leadership. We are seeking enthusiastic skilled colleagues to deliver better care for older people. We work in a flexible modular way that allows the opportunity for ongoing consultant career development. With a planned expansion of the substantive consultant workforce, this is a great way to gain insight into our department. Oxford is a beautiful historic city with much to offer. We have excellent schools and fabulous links to London and major airports.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah SmithJob titleClinical Lead for GeratologyEmail addressSarah.Smith2@ouh.nhs.ukTelephone number01865 234848Additional contact information&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to visit the department and hospital and are invited to contact Dr Sarah Smith, Clinical Lead for Geratology (01865 234848); Dr Matthew Giles, Clinical Lead for AGM (01865 234848); Dr Sudhir Singh, Clinical Director (01865 234848).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Geratology - Medical A53860, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Locum Consultant in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240776", "validThrough": "2020-11-20T23:59:59+0000"}