{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-30T13:31:24+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;CONSULTANT POST IN CNS and COLORECTAL CANCER&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Due to continued investment and expansion an opportunity has arisen for a Locum Clinical Oncologist for 6 months with an interest in CNS and Colorectal cancers to join our dynamic team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of 14 consultants managing cancer across Norfolk. There is a strong site-specific team ethos to working in the department and within each cancer site. Treatment is according to local protocols developed in conjunction with cancer network tumour groups. The post is based full time at the NNUH, although applicants may be asked to do clinics at the James Paget or Cromer in the future.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are extremely proud of the strength of our Radiotherapy service with IMRT and IGRT as standard in many tumour sites and state-of-the-art equipment. Chemotherapy is provided in purpose built units in Norwich, Great Yarmouth and Cromer, whilst an exciting opportunity has enabled us to commission the use of a Mobile Chemotherapy Care Unit which will provide chemotherapy to patients closer to home.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;em&gt;&lt;strong&gt;Why Norfolk and Norwich University Hospital?&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Norwich is home to our beautiful, purpose built hospital which is the 6th largest Acute Trust in the UK. Located on the same site as Norwich Research Park and next to world renowned University of East Anglia (UEA), we are a teaching hospital with a strong focus around career development and research. We have on site specialist services such as oncology and radiotherapy, neonatology, orthopaedics, plastic surgery, ophthalmology, rheumatology, paediatric medicine and surgery.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our staff of over 8,000 treat more than one million patients; people from Norfolk, neighbouring counties and further afield. Our patients are referred to us by around 100 local GP practices, but also from other acute hospitals and primary care trusts around the country.&lt;br /&gt;Why Norwich?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In Norwich a staggering 77% of people say they love their job. Less than 2 hours from London (yet a world away in terms of house prices and cost of living) and serviced by excellent transport links, Norwich is one of few UK cities that still retain a strong local identity and with that a strong sense of community – people walk down the street and say hello to each other, baristas remember our coffee order, you get to know about interesting local projects.&lt;br /&gt;This strong sense of self along with excellent shopping, eating out, affordable house prices and excellent schooling is why Norwich has been ranked by the Guardian as the best city to work in.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Norwich is well connected to major airports and the rest of the UK. Trains run to and from London every 30 minutes, and there are direct rail services from Manchester, Nottingham and Cambridge.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We welcome all applications irrespective of age, disability, gender, sexual orientation, race or religion. Additionally, people with disabilities will be offered an interview providing they meet the minimum criteria for the post. The Trust operates job sharing and flexible working programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Dr Kapur, on (01603) 28722&lt;strong&gt;6&lt;/strong&gt;. We encourage potential applicants to come and visit our amazing facilities and can assist with travel costs to support this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oncology NNUH, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Locum Consultant Clinical Oncology with interest in CNS and Colorecta", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250373", "validThrough": "2020-11-12T23:59:59+0000"}