{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17650", "minValue": "15566", "unitText": "YEAR", "value": "£9.26 - £10.50 per hour"}}, "datePosted": "2020-11-05T22:04:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Care Assistants (or HCA’s as they often referred to) at Practice Plus Group come from all walks of life. Many have no, or minimal, experience, but are keen to explore a career in care, while many already have invaluable experience. What they all have in common is the right values. They’re adaptable, friendly, polite and caring. They enjoy working as a team with people from different cultures and backgrounds. And, they consider it a privilege to be trusted to look after others. Do you share these values? Then we could have just the role for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working as a Health Care Assistant in Outpatients at our Practice Plus Group Hospital, Shepton Mallet, you’ll provide support to the nursing staff, ensuring that a safe and effective service is provided to all users across the department. This will involve liaising with the recovery, theatre, ward and radiology teams when required. Above all, you have a natural ability to help make the lives of others more fulfilling and want to work in an environment where the work can be hard, but also fun and rewarding.&lt;/p&gt;\n&lt;p&gt;You will have completed your NVQ Level 3 in Health and Social Care or be willing to work towards it and hold your BLS certificate. With recent experience working as a Health Care Assistant in an acute setting it would be advantageous if you have performed basic investigations but it is not essential. Just as important is your flexibility, your knowledge of infection control, belief in teamwork and your ability to use your initiative, follow instructions and prioritise a busy workload.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a bank team member you have flexibility to choose the shifts that work for you around your other commitments. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to join our permanent team, we’ll support you. If you just want to stay as a bank practitioner, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded so we offer a competitive rates.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghvi in our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Bank Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258821", "validThrough": "2020-11-27T23:59:59+0000"}