{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T15:45:49+0100", "description": "&lt;p&gt;An opportunity has arisen in our team for an experienced, self-motivated Infection Prevention &amp; Control Nurse.&lt;/p&gt;\n&lt;p&gt;The successful candidate will play a key role in supporting the Infection Prevention &amp; Control team in delivering CNWL IPC strategy.&lt;/p&gt;\n&lt;p&gt;The post is full time, based at CNWL THQ, Milton Keynes; providing support across all services in Diggory Division which includes inpatient and community services, Mental Health, Sexual Health, Addictions and Offender Care services across a broad geographical area&lt;/p&gt;\n&lt;p&gt;You will be required to:&lt;/p&gt;\n&lt;p&gt;Work within and across the organisation. Alongside a dedicated team, you will be required to provide evidence based IPC advice to teams, support teams, manage outbreaks and undertake investigations and RCA’s when required&lt;/p&gt;\n&lt;p&gt;You will undertake audit and contribute to reports for service meetings as part of the board to ward reporting system. You will participate and lead on projects and key pieces of IPC work.&lt;/p&gt;\n&lt;p&gt;Education and training is a major component of this role and you will have opportunity to organise and participate in internal and external training events.&lt;/p&gt;\n&lt;p&gt;You must have extensive post registration experience including infection prevention and control. In addition you will need to have excellent communication and presentation skills together with the ability to work autonomously and as part of a forward thinking team.&lt;/p&gt;\n&lt;p&gt;Are you are a self-motivated and innovative registered nurse with a genuine enthusiasm for infection prevention and control?&lt;/p&gt;\n&lt;p&gt;This exciting opportunity provides the opportunity to develop your IPC knowledge, clinical and teaching skills in a friendly and supportive environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 17th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClare PalmerJob titleDivisional Lead Nurse, Infection Prevention &amp; ControlEmail addressclare.palmer9@nhs.netTelephone number07707257113Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information, please contact Clare Palmer on 07707257113 or clare.palmer9@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CNWL-MK THQ, Milton Keynes", "postalCode": "MK6 5NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0248", "longitude": "-.738428"}}, "title": "Infection Prevention &amp; Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241156", "validThrough": "2020-11-23T23:59:59+0000"}