{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per anum (pro rata)"}}, "datePosted": "2020-10-16T15:05:39+0100", "description": "&lt;p&gt;&lt;span&gt;Are you ready for an exciting new challenge? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Opportunities have arisen for Registered Nurses to join the team working within Critical Care at Pinderfields Hospital (The Mid Yorkshire Hospitals NHS Trust).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Critical Care unit has twelve Level 3 ICU beds, six Level 2 HDU beds as well as two Level 3 Intensive Care Burns beds. At the last CQC inspection, the unit received an overall rating of good and we were proud to be rated as outstanding for the caring element of the inspection. The teams were also successfully nominated for the Kate Granger compassion in care award at the Trust’s celebrating excellence awards in May of last year. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for enthusiastic, well-motivated and caring individuals to work within the multidisciplinary team, providing high standards of patient care and the maintenance of a safe working environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will have the ability to plan, assess, implement and evaluate patient care. Good interpersonal skills are essential, along with a willingness to learn; the ability to work effectively in a team; to be self-motivated, to have a positive attitude towards change and to be able to adapt to change quickly. Candidates should have recent NHS experience; Critical Care experience is desirable but not essential. We have a dedicated Critical Care education team to provide specialty training and support the professional development of all colleagues and students. All new team members are provided with a robust induction and education programme. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you share our visions and values and want to be part of our team, we would love to hear from you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You are very welcome to contact us with any questions you may have, or to find out more, by contacting Tracey Spacey, Critical Care Unit Manager, on 01924 542631.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Critical Care Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230792", "validThrough": "2020-11-08T23:59:59+0000"}