{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T11:31:12+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 18 MONTHS TO MEET THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Immunisation nurses to contribute to the vaccinations plans in Cwm Taf Morgannwg for staff and population with COVID-19 vaccine.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of Cwm Taf University Health Board Immunisation Team, and will be expected to offer vaccination advice and deliver vaccinations to patients and staff living and working in Cwm Taf Morgannwg University Health Board. The post holder will support the safe delivery of vaccines and help increase local uptake of vaccinations and may be asked to Immunise in other settings i.e. Community/ GP practices and Patients home&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside, Immunisation team, Occupational Health and Public Health to meet the Welsh Government Targets for immunisation.&lt;/p&gt;\n&lt;p&gt;This post is for 18 month fixed term contract, part time or full time.&lt;/p&gt;\n&lt;p&gt;The hours of work will be predominately Monday to Friday with some weekend and evening hours required.&lt;/p&gt;\n&lt;p&gt;You should be a first level registered nurse, with desirable experience of working within the community environment.&lt;/p&gt;\n&lt;p&gt;You should be a motivated, autonomous practitioner, able to integrate and work competently within a skill mix team. The role encompasses responsibility for clinical delivery of vaccinations and patient safety, specialist advice on immunisation issues.&lt;/p&gt;\n&lt;p&gt;You should be fully committed to your own professional development and ready to undertake specific development required of the role. You must be able to meet the geographical needs of the role and must be able to travel between sites in a timely manner.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 10 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jane Williams&lt;br /&gt;Senior Nurse Immunisation and Vaccination&lt;br /&gt;jane.williams9@wales.nhs.uk &lt;br /&gt;01443 443443 Ext. 75304&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Azelle Gerry&lt;br /&gt;Immunisation Coordinator&lt;br /&gt;azelle.gerry@wales.nhs.uk&lt;br /&gt;01443 443443 exr 75304&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To be agree on appointment, CTM wide", "postalCode": "CF72 8XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5476", "longitude": "-3.39093"}}, "title": "Immunisation Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244241", "validThrough": "2020-11-10T23:59:59+0000"}