{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-05T10:31:19+0000", "description": "&lt;p&gt;We are seeking someone with significant expertise and experience in breast screening and symptomatic service planning, strategy development and service change who can lead the future direction of the breast services at the Trust. This is an exciting time to be joining the team to implement new breast screening programme service model effectively and efficiently.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who can lead the development of breast screening/imaging service strategies and plans and contribute to the ongoing work of the team as a whole. You will be a senior manager with the confidence to work at all levels within the organisation, as well as with leaders in partner organisations and with community groups.&lt;/p&gt;\n&lt;p&gt;You will have a good track record of delivery of strategic plans and programmes and be able to demonstrate robust knowledge and skills in planning. You will be a key member of senior management team for Clinical Support Services Division, working closely with the Director of Breast Screening and the Director of Operations.&lt;/p&gt;\n&lt;p&gt;We are particularly interested in individuals with the following skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Senior programme and project management expertise to develop, coordinate and deliver projects.&lt;/li&gt;\n&lt;li&gt;Experience of delivering large scale improvement using continuous improvement, organisational development, strategic development and transformation methodologies.&lt;/li&gt;\n&lt;li&gt;Significant experience of working with executive level stakeholders and sponsors and reporting progress clearly and effectively, in a timely manner.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are enthusiastic, resilient and can bring the skills and experience to the team that will complement others then we are keen to hear from you. In return, you will find a team that is creative, supportive and positive about making a difference to the lives of our population, and who are committed to developing and delivering a high quality services.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information or to arrange an informal visit please contact Pradip Karanjit, Director of Operations (Clinical Support Services) on 01384 456 111 ext. 3065 or &lt;/strong&gt;anne.battersbee@nhs.net&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital Cross site, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Breast Screening Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257231", "validThrough": "2020-11-19T23:59:59+0000"}