{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 per annum"}}, "datePosted": "2020-10-30T13:00:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Various locations available across the South of England&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term and permanent contracts available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS is amongst the most important organisations in England, but it faces significant challenges in meeting the demands of an ageing and growing population within limited resources and in recent times responding to the COVID-19 pandemic&lt;/p&gt;\n&lt;p&gt;These challenges are helping to provide opportunities for innovation, with a stronger focus on promoting health and wellbeing, the deployment of new technologies and the redesign of the way care services are delivered. This transformation of health care services is complex and challenging and requires individuals with a broad range of skills and experience.&lt;/p&gt;\n&lt;p&gt;South Central and West (SCW) is a leading provider of transformation services across health and social care. Through our consultancy service we support NHS organisations and their partners to manage, analyse and improve performance and to transform the way services are provided for the local population. We provide support across the south of England (covering 14,400 square miles and a population of almost 12 million people), as well as running national and regional improvement initiatives.&lt;/p&gt;\n&lt;p&gt;Our customers include NHS England, clinical commissioning groups, provider trusts, general practices, and numerous social care, community care, and voluntary sector organisations.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for you to join our Strategy and Transformation service line. As a highly talented Systems Transformation Programme Manager your experience of leading teams in complex environments, and your excellent communication and interpersonal skills will be essential within this role. As will your exceptional organisational skills, your ability to successfully prioritise and manage a busy workload, and your proven programme/project management skills’&lt;/p&gt;\n&lt;p&gt;As a subject matter expert in one of the following areas, your contribution to SCW will be instrumental in helping us to transform health care services in a complex and challenging environment:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prevention and Wellbeing&lt;/li&gt;\n&lt;li&gt;Primary Care&lt;/li&gt;\n&lt;li&gt;Cancer&lt;/li&gt;\n&lt;li&gt;Elective Care&lt;/li&gt;\n&lt;li&gt;Urgent &amp; Emergency Care&lt;/li&gt;\n&lt;li&gt;Mental Health/Learning Disabilities&lt;/li&gt;\n&lt;li&gt;Maternity&lt;/li&gt;\n&lt;li&gt;Continuing Health Care&lt;/li&gt;\n&lt;li&gt;Social Care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Further information on our specific requirements for this role is included in the Job Description and Person Specification.&lt;/p&gt;\n&lt;p&gt;We have both permanent and fixed term contract (6 months) opportunities, please clearly state which contract type you are applying for in bold at the top of the additional information section of the application form.&lt;/p&gt;\n&lt;p&gt;The role will involve travel across the South of England and potentially further afield.&lt;/p&gt;\n&lt;p&gt;If you are passionate about improvement and have the desire to become one of our growing Strategy and Transformation team, we are looking to hear from you.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;scwcsu.recruitment@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127935.jpg", "name": "South, Central and West Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Locations", "postalCode": "BS1 3NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.46", "longitude": "-2.59169"}}, "title": "Programme Manager Manager (Systems Transformation)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250272", "validThrough": "2020-11-13T23:59:59+0000"}