{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892  / £24,157"}}, "datePosted": "2020-11-03T13:19:17+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Eating Disorder Assistant Practitioner (Band 4) – Childrens and Young Peoples Community Eating Disorder Team Leicester City base&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you would you like to be part of an innovative and supportive team, where motivated professionals are making a significant difference to outcomes for young people with eating disorders then we want to hear from you!&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is passionate about working with individuals who are experiencing eating disorders. In addition, you will contribute to our award winning, forward thinking and dynamic team of professionals (Including family therapists, nurses, psychiatrists, psychologists and psychotherapists).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whilst a full Job and Person specification is attached to this advertisement, key elements of the role include (but are not limited to):&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide effective, evidence based general and specific care for patients admitted to a specific clinical specialty / area, under the indirect or remote supervision of registered practitioners.&lt;/li&gt;\n&lt;li&gt;Plan, organise and deliver clinical care as agreed with the supervising practitioner, in line with clinical governance and within agreed professional standards and guidelines.&lt;/li&gt;\n&lt;li&gt;Use personal effectiveness and knowledge to contribute to the development and delivery of a quality service.&lt;/li&gt;\n&lt;li&gt;Ensure a high standard of care for all patients by effective communication with patients, carers and the wider health care team.&lt;/li&gt;\n&lt;li&gt;Participate in clinical supervision and training. This may include supervision and teaching of less experienced staff as part of the Assistant Practitioner role.&lt;/li&gt;\n&lt;li&gt;Contribute to undertaking audit and to participate in research where appropriate.&lt;/li&gt;\n&lt;li&gt;Work proactively as a member of the multi-disciplinary and multi professional health care team, in support of registered practitioners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Successful Candidate will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have the qualifications and experience as highlighted in the Person specification&lt;/li&gt;\n&lt;li&gt;Have experience of working with individuals with eating disorders - essential. Experience of working with young people and families is desirable&lt;/li&gt;\n&lt;li&gt;Be motivated assistant practitioners or nursing associates with excellent team and communication skills.&lt;/li&gt;\n&lt;li&gt;Have a full driving licence with access to a car is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at the CAMHS Eating disorder team we strive for excellence and good quality care in our everyday practice. Using evidence based interventions; we offer specialist treatment for young people under the age of 18 who are suffering from anorexia nervosa, bulimia nervosa and binge eating disorder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team has undergone significant transformation in recent years (as part of the Access and Waiting Time Initiative, 2015) with the aim of offering early and timely intervention to those who are in need of the service. We are actively engaged in a number of exciting local, national and international research projects. We have excellent links with our adult eating disorders team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be part of our cohesive team and be able to develop a good level of skill in working with complex presentations of young people with eating disorders. There will be an opportunity to engage in individual, family and group interventions and reflective learning opportunities are facilitated through clinical and operational supervision.&lt;/p&gt;\n&lt;p&gt;We would encourage you to carefully review the essential and desirable criteria before applying. This is an ideal learning opportunity to develop a range of skills and therapeutic approaches within a supportive specialist eating disorders team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Having a full driving licence with access to a car is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed. Please contact; Zoe Thistlewood (Zoe.Thistlewood@leicspart.nhs.uk) Senior Clinical Nurse Specialist on (0116295 0310)&lt;/p&gt;\n&lt;p&gt;Or Mikaela Malt (mikaela.malt@leicspart.nhs.uk) Senior Clinical Nurse Specialist on (0116 295 0310&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 1AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6263", "longitude": "-1.16492"}}, "title": "Band 4 CAMHS Eating Disorder Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254127", "validThrough": "2020-11-17T23:59:59+0000"}