{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T12:46:25+0000", "description": "&lt;p&gt;Are you looking for a career in Paediatrics? We have an exciting opportunity for a confident and enthusiastic Band 6 Dietitian to become an integral member of the paediatric dietetic service based at the Children’s Hospital for Wales in Cardiff. We provide several tertiary paediatric services including Surgery, Metabolic, Cystic Fibrosis, Gastroenterology, Neonatology, Intensive Care and Nephrology.&lt;/p&gt;\n&lt;p&gt;The role will be split between managing the inpatient dietetic service of children under the neuro-rehabilitation team, covering outpatient allergy clinics and the opportunity to work with the Specialist Gastroenterology Dietitian gaining experience in both inpatients and outpatients. As part of the neuro-rehabilitation role you will provide clinical supervision to the neuro-rehab assistant.&lt;/p&gt;\n&lt;p&gt;You will ideally have at least eighteen months of clinical dietetic experience. Paediatric is desirable, but not essential. You must have excellent communication skills and enjoy working within a dynamic multidisciplinary environment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate excellent relationship management skills and a practical, forward thinking approach to service development and evaluation and the ability to work in a team. You will work within a friendly and highly skilled department and have numerous opportunities for professional and personal development. The team is committed to providing a seven day service to the hospital. You will be actively involved in the research, audit and the Clinical Governance agenda of the department and Health Board.&lt;/p&gt;\n&lt;p&gt;The service is a major deliverer of pre-registration dietetic education and the successful candidate will be involved in the delivery of training and education. The successful candidate will be able to demonstrate that they share our organisational values in line with Caring for People, Keeping People Well:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about the people we serve and the people we work with&lt;/li&gt;\n&lt;li&gt;We trust one another&lt;/li&gt;\n&lt;li&gt;We respect each other&lt;/li&gt;\n&lt;li&gt;We take personal responsibility&lt;/li&gt;\n&lt;li&gt;We treat people with kindness&lt;/li&gt;\n&lt;li&gt;We act with integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;p&gt;Hold a Degree or equivalent, or post graduate qualification in dietetics.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Mott - Paediatric Dietitian&lt;/p&gt;\n&lt;p&gt;claire.mott@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;02921 844294&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nutrition and Dietetics, University Hospital of Wales, Cardiff", "postalCode": "CF14 3UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.499", "longitude": "-3.19007"}}, "title": "Paediatric Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248380", "validThrough": "2020-11-12T23:59:59+0000"}