{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T18:45:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Adult Psychiatrist Eating Disorders, Kent &amp; Medway &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an organisation that are at the cutting edge of new care models and systems delivering mental health care to children and young people across Kent and Medway? Do you want to innovate and diversify whilst working alongside the wider health and social care teams across the county? If so, we have an exciting opportunity for an Adult Psychiatrist in a new service across Kent and Medway within our Eating Disorders service.&lt;/p&gt;\n&lt;p&gt;At NELFT we will offer you both professional and personal growth and development with excellent and fully supported CPD and training opportunities including QI, along with dedicated and protected time. We value our staff and are supportive of flexible and part-time working arrangements.&lt;/p&gt;\n&lt;p&gt;NELFT is rated Good by the CQC and is renowned for providing care to people in the community closer to their homes. We have just acquired and created new posts in the Children and Young People’s Mental Health Services (CYPMHS) in Kent, the Young Persons&#39; Wellbeing Service (YPWS) in Medway and the All Age Eating Disorder Services across Kent and Medway. NELFT also provides award winning community and mental healthcare for over 2 million people in the London Boroughs of Barking and Dagenham, Havering, Redbridge and Waltham Forest. We also provide a number of services across Essex.&lt;/p&gt;\n&lt;p&gt;Kent “The Garden of England” is an attractive place to live with a great heritage and is a stone’s throw from the continent. The Ebbsfleet/Ashford Eurostar link takes you to Paris, Bruges, Brussels, Lille, Amsterdam and beyond and you can enjoy great weekend/city breaks. There are good transport links to Central London, Surrey and East Sussex. London with its vibrant life of theaters, museums and gastronomic delights for all palates is at a commutable distance. Kent offers good housing opportunities , along with a diverse range of schools, colleges and universities.We will offer a generous relocation package should you require to relocate to Kent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Geetha GandluruJob titleConsultant Psychiatrist/ Associate Medical Director for Kent NELFTEmail addressgeetha.gandluru@nelft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing the opportunities that are available, have professional registration and speak fluent English, please contact Dr Geetha Gandluru, Consultant Psychiatrist, Associate Medical Director for Kent, NELFT via email on geetha.gandluru@nelft.nhs.uk or via her P.A. Denise McNamara on 01277 695595.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Courtyard, Pudding Lane, Maidstone, Kent   ME14 1PA, Maidstone", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Consultant Adult Psychiatrist ED", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237499", "validThrough": "2020-11-23T23:59:59+0000"}