{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-29T08:40:45+0000", "description": "&lt;p&gt;Following the recent promotions of current staff to band 6 posts, Wessex House in Bridgwater are looking for qualified Mental Health Nurses (RMN) to join our team.&lt;/p&gt;\n&lt;p&gt;We know that working on a Child &amp; Adolescent Mental Health Inpatient ward can be challenging, but with the right team around you, you can make a real difference to young people at a crucial stage of their lives.&lt;/p&gt;\n&lt;p&gt;Wessex House is an innovative and supportive place to work, offering care for up to 12 young people between the age of 13 and 18 who require support for complex mental health needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are proud to have become the first CAMHS inpatient unit in the South West to achieve fully accredited status from the Royal College of Psychiatrists (RCP) in March 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We can offer you a positive and supportive environment to work with excellent support from your manager and colleagues. We are also able to provide you with further development opportunities to enable you to progress to a future band 6 role should one become available.&lt;/p&gt;\n&lt;p&gt;You will play a valuable role in the recovery of the young people, working closely with them and their families and contributing to the assessment, planning and implementation of treatment plans.&lt;/p&gt;\n&lt;p&gt;We have a recovery focussed approach on the ward and you’ll play a valuable role in working with young people and their families towards discharge. Our main therapy model is Dialectical Behavioural Therapy and there potential for you to become involved in this programme and access further specialist training. You will also take part in a variety of therapeutic activities with young people, related to their care plans.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to become part of a well-established team and work hand in hand with other professionals to deliver high-quality care.&lt;/p&gt;\n&lt;p&gt;Wessex house can offer you a rewarding career where you will be valued as a key member of our team. We can offer you bespoke training for CAMHS, as well as CPD and supervision.&lt;/p&gt;\n&lt;p&gt;You will benefit from the usual NHS benefits such as 5.4 weeks annual leave PLUS Bank Holidays, enhanced pay for unsociable hours to complement your income, and flexible working practices to promote a good work-life balance.&lt;/p&gt;\n&lt;p&gt;We are also able to consider Registered General, Children and Learning Disability Nurses depending on your experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;William Mongare Inpatient CAMHS Operational Manager&lt;/p&gt;\n&lt;p&gt;william.mongare@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01278 454141&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgwater", "postalCode": "TA6 5YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1266", "longitude": "-2.99756"}}, "title": "Staff Nurse RMN, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247652", "validThrough": "2020-11-11T23:59:59+0000"}