{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 per annum incl HCAS (pro-rata)"}}, "datePosted": "2020-10-15T11:01:49+0100", "description": "&lt;p&gt;&lt;strong&gt;Child and Adolescent band 8C post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Course Lead and Head of Child and Adolescent Psychoanalytic Psychotherapy Training (M80)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: Tavistock and Portman NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type: Permanent (0.8 FTE) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: AfC Band 8C&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: The Tavistock and Portman NHS Foundation Trust, 120 Belsize Lane, London NW3 5BA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Tavistock &amp; Portman &lt;/strong&gt;NHS Foundation Trust consists of the Tavistock Clinic and the Portman Clinic. The Trust is a National Health Service post-graduate training institution for a wide range of care-givers in the field of mental health. It provides multi-disciplinary services for adults, adolescents and children and their families; these cover a spectrum of psycho-analytic, psychotherapeutic and systemic approaches. The Tavistock Clinic is also a resource of consultation to professionals in other centres and in the community, within both the public and voluntary sectors, covering health, social services and education. The overall, major concern is with the prevention of mental illness and the promotion of mental health, and its research work is in support of these aims. In all aspects of its work the Trust is committed to the development of anti-discriminatory practice and the provision of equal opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit a senior, highly experienced Consultant Child and Adolescent Psychotherapist with a proven management background to lead the Tavistock Child and Adolescent Psychotherapy Training. This internationally renowned NHS training leads to the recognised qualification as a Child and Adolescent Psychotherapist with eligibility for membership of the Association of Child Psychotherapists (ACP). It is also a validated programme by the University of Essex, leading to the award of professional doctorate in child and adolescent psychoanalytic psychotherapy. This is a key role within the Trust’s Department of Education and Training, and we are looking to recruit a high calibre applicant with commitment to addressing issues of inclusion, equity and diversity to lead a large Course Team in delivering all aspects of the training from recruitment to graduation. Establishing and maintaining links with a number of key stakeholders, including clinical and professional services within the Trust, and externally with NHS Trusts across the UK, Commissioners and the ACP is a key aspect of the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As the range of skills required for this post is extensive, the role may lend itself to job sharing and flexible working would be encouraged.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are very aware that people from BAME backgrounds are under-represented in leadership roles in the child psychotherapy profession. For this reason we would very much welcome applications from individuals from BAME communities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; F&lt;/strong&gt;&lt;strong&gt;or further information and to arrange preliminary discussion, please contact by email&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Catrin Bradley, Head of Child and Adolescent Psychoanalytic Psychotherapy Training, M80 Course Lead &lt;/strong&gt;cbradley@tavi-port.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Anne Hurley, Portfolio Manager Psychoanalytic Clinical Programmes &lt;/strong&gt;ahurley@tavi-port.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katie Argent, Trust Head of Child Psychotherapy &lt;/strong&gt;kargent@tavi-port.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122294.JPG", "name": "Tavistock and Portman NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tavistock and Portman NHS Foundation Trust, London", "postalCode": "NW3 5BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5469", "longitude": "-.175418"}}, "title": "Head of Child Psychotherapy Training (M80)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227847", "validThrough": "2020-11-09T23:59:59+0000"}