{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T11:31:05+0000", "description": "&lt;p&gt;Manchester Royal Infirmary is part of a leading integrated health, teaching, research and innovation campus in the thriving city of Manchester. We offer a unique range of services to the North West, treating and managing the simplest to the most complex conditions and diseases. For our nurses, it means the chance to gain diverse experience in pioneering teams.&lt;br /&gt;&lt;br /&gt;Due to expansion we have opportunities within both our general and Cardiac Critical Care Units. In the general Critical Care Units we have rotations in place between the 20 bed General Adult Intensive Care Unit, 20 bed High Dependency Unit, 13 bed Elective HDU (on the Central site) and our 4 bed Critical Care Unit (on the Trafford site). You will gain valuable experience in the care of patients with a wide range of needs including Trauma, Haematology, Gi Surgery, Vascular Surgery, Renal Medicine/Transplant surgery and Head and Neck Surgery.&lt;/p&gt;\n&lt;p&gt;Our Cardiac Critical Care Unit comprises 12 Intensive Care beds and 4 High Dependency beds providing care for patients requiring cardiology intervention, elective and emergency cardiac surgery as well as those with thoracic trauma and congenital heart disease.&lt;/p&gt;\n&lt;p&gt;Supported by a strong team of admin, support and management roles that form the backbone of our non-clinical infrastructure, you will deliver our values and be committed to delivering the highest standards of quality care to our patients whilst demonstrating and celebrating the character of MFT through our values and behaviours framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Everyone matters&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;li&gt;Dignity and Care&lt;/li&gt;\n&lt;li&gt;Open and Honest.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;We care for our staff through excellent development and progression opportunities starting with a comprehensive induction programme as well as a respected preceptorship programme for newly qualified nurses. For experienced nurses joining our team you will be encouraged to participate and lead on quality improvement initiatives with the focus of improving patient experience. To enhance your skills further, we offer a range of internal and external courses and can facilitate optional rotations to our critical care areas based on the Wythenshawe site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Together Care Matters&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;So if you want a new start, there couldn’t be a better time to join us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTom WithersJob titleMatronEmail addresstom.withers@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Matron Rowena Murray&lt;/p&gt;\n&lt;p&gt;rowena.murray@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Matron Sherly Udeshi&lt;/p&gt;\n&lt;p&gt;sherly.udeshi@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Staff Nurse - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248129", "validThrough": "2020-11-17T23:59:59+0000"}