{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 £40,681 to £46,294 per annum pro"}}, "datePosted": "2020-11-02T11:31:44+0000", "description": "&lt;p&gt;&lt;em&gt;Frimley Health NHS Foundation Trust is growing and moving forward with ambitious plans and major investment in our people and facilities! It’s an exciting time to join us and grow as a professional – while playing your part in the delivery of first class care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic, motivated team leader who is looking to join our Senior Team. We are looking to recruit Band 7 Senior Sister/Charge Nurses to join our critical care team based on the Wexham site. The successful individuals will provide leadership, responsibility and accountability for the management of the Critical Care unit.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a committed leader with exemplary communication and interpersonal skills, who is an excellent role model and passionate about quality, safety and innovation. The role is high profile and requires you to lead and manage a team of nurses with varied skills and experience.&lt;/p&gt;\n&lt;p&gt;You must have energy and enthusiasm to oversee the delivery of safe and effective care, explore new and innovative ways of working and drive forward the Trust Quality Strategy. The successful applicant will be able to demonstrate insight into team structures, dynamics and have the ability to motivate and influence stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to support the Matron and Directorate Manager in delivering the Trusts Nursing agenda in ensuring that both local, cross site and national quality targets as well as key performance indicators are achieved.&lt;/p&gt;\n&lt;p&gt;We are proud to hold an outstanding rating by CQC and have carefully developed a robust plan to extend our capacity to support the current pandemic climate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ana Coelho - Clinical Matron&lt;/p&gt;\n&lt;p&gt;ana.coelho@nhs.net 07746206359&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham Park Hospital, Slough", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Senior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251793", "validThrough": "2020-11-16T23:59:59+0000"}