{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T15:43:06+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 Podiatrist to join the Suffolk GP Federation&#39;s Podiatry Service, on a permanent contract.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated and forward-thinking podiatrist who strives to meet exemplary standards of patient care. You&#39;ll be fully supported and be assigned a mentor who will provide you with supervision and will assist you to develop your clinical skills. As part of the role, you&#39;ll treat a diverse range of patients many of whom have complex needs. &lt;/p&gt;\n&lt;p&gt;If you are highly motivated, dedicated and forward-thinking and want to join our team we would be interested to hear from you.&lt;/p&gt;\n&lt;p&gt;Suffolk GP Federation is a not-for-profit organisation owned by 57 GP practices. Our aim is to find innovative solutions to the challenges currently faced by the NHS, while at the same time protecting the interests of general practice and ensuring that patients continue to receive the very best care.&lt;/p&gt;\n&lt;p&gt;Here at Suffolk GP Federation we pride ourselves on recognising key players, and rewarding our hard working teams. As a result, we’re excited to be partnered with Perkbox – giving everyone access to their award winning employee experience platform. Team members will get hundreds of perks from some of the world’s biggest brands, and benefit from the great freebies on offer! Become part of our team today!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Suffolk GP Federation CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136254"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Suffolk", "postalCode": "IP3 0AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0446", "longitude": "1.16513"}}, "title": "Podiatrist (Band 5 equivalent)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258394", "validThrough": "2020-11-20T23:59:59+0000"}