{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T10:16:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Major Trauma Rehabilitation Coordinator with responsibility for trauma spinal cord injury case management – Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced nurse or AHP with a trauma background to join the Major Trauma Service at UHCW. The Major Trauma Service oversees the patient pathway from Emergency Department admission to hospital discharge and the early phase of rehabilitation. The team provides support to patients and their relatives during their hospital stay; and works closely with the multiple specialties and professions involved in major trauma care.&lt;/p&gt;\n&lt;p&gt;UHCW is one of the busiest Major Trauma Centres in England. It is the hub of the Central England Trauma Network and serves a resident population of circa 1.9million. The successful candidate will join an excellent, forward thinking team who are strongly committed to evidence based practice, patient focused service improvement and continuing personal and professional development.&lt;/p&gt;\n&lt;p&gt;The role will encompass the full set of responsibilities as set out in the accompanying job description but in summary the key responsibilities are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work with the Major Trauma Therapy Lead, Service Lead and Clinical Lead to provide an excellent patient centred service for all major trauma cases.&lt;/li&gt;\n&lt;li&gt;Responsibility for ensuring multidisciplinary delivery of excellent acute care of patients following traumatic spinal cord injury. Will be the primary major trauma service link with our Spinal Cord Injury Centres.&lt;/li&gt;\n&lt;li&gt;To work as part of the rehabilitation coordinator team to ensure early rehabilitation needs are met, timely referral to Consultant in Rehabilitation Medicine and appropriate specialist rehabilitation referrals made.&lt;/li&gt;\n&lt;li&gt;Work with ward based teams to ensure completion of quality prescriptions of rehabilitation.&lt;/li&gt;\n&lt;li&gt;To attend and facilitate multidisciplinary meetings&lt;/li&gt;\n&lt;li&gt;To participate in and lead staff training, development and supervision.&lt;/li&gt;\n&lt;li&gt;To work with our external partners in Trauma Units, the Central England Rehabilitation unit and the Trauma Network to arrange early rehabilitation and care closer to home when clinically appropriate.&lt;/li&gt;\n&lt;li&gt;Maintain the current service and help initiate and implement service improvements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is ideal for an enthusiastic clinician with a specialist interest in early spinal cord injury management and more generally in promoting excellence in rehabilitation. This post forms part of a 7-day working roster so the successful candidate will be required to work weekend shifts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy SilvesterJob titleMajor Trauma Service LeadEmail addresslucy.silvester@uhcw.nhs.ukTelephone number02476 967582Additional contact information&lt;/p&gt;\n&lt;p&gt;Nicola Dixon&lt;/p&gt;\n&lt;p&gt;Major Trauma Therapy Lead&lt;/p&gt;\n&lt;p&gt;nicola.dixon@uhcw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Major Trauma Rehabilitation Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240001", "validThrough": "2020-11-06T23:59:59+0000"}