{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Pro rata, per annum"}}, "datePosted": "2020-11-05T10:46:07+0000", "description": "&lt;p&gt;An opportunity has arisen for a High Intensity Cognitive Behavioural Therapist to join our Staff Bank to work in our MyWellbeing College service. You will need to have specialist post graduate training to a Masters level, or equivalent, in CBT with professional registration and accreditation from a recognized Psychological Therapy body such as BABCP, BACP, UKCP as well as experience in a relevant Mental Health practice.&lt;/p&gt;\n&lt;p&gt;The purpose if this role will be to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide evidence based psychological therapy, making autonomous clinical decisions about own professional practice&lt;/li&gt;\n&lt;li&gt;Provide clinical supervision, consultation and advice to Psychological Therapists&lt;/li&gt;\n&lt;li&gt;Assist the Team Manager with service development, including research and development activities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is truly an opportunity not to be missed, you will be given exposure to a range of different situations that will continue to professionally and clinically develop yourself. It is an exciting time to join Bradford District Care NHS Foundation Trust and support the delivery of our vision to become a leading provider of integrated care for people of all ages who have mental health needs.&lt;/p&gt;\n&lt;p&gt;As one of the largest employers in the district with around 3,000 staff, you will be joining a Trust that offers a wide range of staff benefits to support your performance as well as health and wellbeing, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A comprehensive paid induction and training programme for your continuous development needs&lt;/li&gt;\n&lt;li&gt;Annual leave accrual based on the hours you work&lt;/li&gt;\n&lt;li&gt;Flexible working patterns&lt;/li&gt;\n&lt;li&gt;Access to a range of NHS Wellbeing@Work benefits and discounts as well as other staff discounts &lt;em&gt;(See our website and click on &#39;working with us&#39; for a full list of staff benefits)&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;Eligibility to join the NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;A great team environment and place to work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;So, what are you waiting for? Contact us and let’s get you on board to become part of Bradford District Care NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Samantha Dent&lt;/p&gt;\n&lt;p&gt;Job title: Team Manager&lt;/p&gt;\n&lt;p&gt;Email addresssamantha.dent@bdct.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Staff Bank StaffBank@bdct.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120637.jpg", "name": "Bradford District Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120637"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerset House, Shipley", "postalCode": "BD19 3BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7259", "longitude": "-1.71895"}}, "title": "Staff Bank High Intensity CBT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257306", "validThrough": "2020-11-12T23:59:59+0000"}