{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 per annum"}}, "datePosted": "2020-10-28T13:00:59+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly organised and committed public health project manager to join the North west Population Health &amp; Prevention (NWPHPN) programme team to provide project management support and expertise to the work programme and team.&lt;/p&gt;\n&lt;p&gt;The team comprises a programme manager and administrator, working closely with the national population health programme team and public health workforce development colleagues in PHE regionally and nationally.&lt;/p&gt;\n&lt;p&gt;The North West Population Health &amp; Prevention Network (NWPHPN) is a multi-professional public health network funded by Health Education England (HEE). The network supports and develops the public health role and contribution of the healthcare, social care and voluntary sector workforce. A free members community of practice providing policy updates, news, information and access to learning opportunities for network members&lt;/p&gt;\n&lt;p&gt;The North West Population Health and Prevention Network work programme provides the HEE NW public health workforce development function as part of a national function and work programme.&lt;/p&gt;\n&lt;p&gt;Responsible for delivering the population health requirements set out in the HEE Mandate, Interim People Plan &amp; NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;The main aim of the work programme is to develop the population health and prevention role of the health, care and voluntary sector workforce across the North West.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a project manager to join the team to develop a new programme of work, including developing local ICS/STP level public health workforce development plans to take a systematic approach to building public health capacity and capability at scale and pace.&lt;/p&gt;\n&lt;p&gt;Location: The post will be based in one of the North West Health Education&lt;br /&gt;England offices (Manchester/Liverpool); however whilst HEE&#39;s COVID-19 arrangements are in place, the postholder will work from home. Under normal circumstances, the post holder will be required to travel throughout the North West and at times nationally.&lt;/p&gt;\n&lt;p&gt;This is a development opportunity, the ideal candidate would have a proven track record of project management within public health.&lt;/p&gt;\n&lt;p&gt;Responsible for: supporting the North West Population Health &amp; Prevention Network (free members network) and for effective delivery of programme activity.&lt;/p&gt;\n&lt;p&gt;We are seeking a public health project manager to work as part of a well-established HEE function to deliver a public health workforce programme across the North West.&lt;/p&gt;\n&lt;p&gt;This post provides a great opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Gain experience on a Regional work programme whilst developing leadership and project/programme management skills&lt;/li&gt;\n&lt;li&gt;Work with a wide range of stakeholders, both internal and external, and at all levels&lt;/li&gt;\n&lt;li&gt;Lead in an area of growing political and social interest, contributing to a future healthcare workforce which is enabled to deliver the vision outlined in the NHS LTP – to improve health outcomes and reduce health inequalities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;p&gt;The post holder will work with the programme manager to develop strong working relationships with a range of stakeholders, including health &amp; social care, local authorities, PHE, professional bodies and the voluntary sector.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;have excellent project management skills and hold a public health qualification at graduate level. Prior experience of working in a public health role is a requirement of this post.&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for the delivery of specific projects with oversight from the programme manager.&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for communications via the website, events planning and delivery and be able to support procurement and management of contracts with external providers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that this is a temporary fixed term contract for 12 months currently or could be offered as a secondment opportunity to the successful candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants from within the NHS will be offered this role on a secondment basis only, agreement should be obtained from their employer prior to submitting the application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 7 with a full-time starting salary of £38,890 , with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt; If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Farrar, Public Health Workforce Lead&lt;/p&gt;\n&lt;p&gt;Email: alison.farrar@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 0782545036&lt;/p&gt;\n&lt;p&gt;Available for an informal conversation about the vacancy Mon, Tues, Wed - 12 - 2pm&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3 Piccadilly Place Manchester or Regatta Place, Liverpool", "postalCode": "L3 4BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.385", "longitude": "-2.97971"}}, "title": "Project Manager ( Public Health)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246683", "validThrough": "2020-11-11T23:59:59+0000"}