{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000-£60,000 pa Depending on exp"}}, "datePosted": "2020-10-26T09:17:12+0000", "description": "&lt;p&gt;There has never been a more exciting time to join us at &lt;em&gt;gtd healthcare&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;gtd healthcare&lt;/em&gt; is one of the largest primary and urgent care providers in North West England and has a long standing strong track record in providing innovative healthcare services when and where they are needed. &lt;em&gt;gtd healthcare&lt;/em&gt; is a not-for-profit provider providing care to a patient population of approximately 2.7 million.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Gtd&lt;/em&gt; are seekingto improve the way people receive urgentprimarycare, advice and treatment in Oldham.&lt;/p&gt;\n&lt;p&gt;Oldham’s new and innovative Digital Hub is striving to make a real difference to the health and wellbeing of the Oldham community and you could be a key part in driving the service forward.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Gtd &lt;/em&gt;is recruiting to &lt;strong&gt;Matron&lt;/strong&gt;roles, which have arisen within theDigital Hub. The role isdeemed a key asset in ensuring patients are seen as quickly and safely as possible, in the right place and at the right time.&lt;/p&gt;\n&lt;p&gt;Based at the Integrated Care Centre, you will have a unique opportunity toworkwithin a service that will contribute towards transforming how the Oldham population access their healthcare.Furthermore, youwill have a key role within the Digital Hub’s multidisciplinary team to support the Urgent and Emergency Care by Appointment Agenda.&lt;/p&gt;\n&lt;p&gt;This is an excellent prospect to workalongside ateam who hasa real commitment to continuous improvement, shared learning and best practice, whilebeing passionate aboutproviding Oldham patients with the highest possible quality care.&lt;/p&gt;\n&lt;p&gt;As a matron working for the Digital Hub, you will have exposure to a multitude of streaming pathwaysandbespoke workincluding:&lt;/p&gt;\n&lt;p&gt;Working within the Clinical Assessment Serviceto:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;access a wide range ofand refer tocommunity-based services using the Directory of Services (DoS);&lt;/li&gt;\n&lt;li&gt;book appointments;&lt;/li&gt;\n&lt;li&gt;undertakevideo consultations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Work closely with Royal Oldham Hospitaltoidentify patients with primary care presentations and stream them out of ED to the Digital Huband other community services.Patients will be offered telephone/video consultations and face-to-face consultations, where appropriate.&lt;/p&gt;\n&lt;p&gt;Full clinical assessmentsvia telephone triage (which canincludepatients with a wide range of conditionssuch as frailtyandpaediatrics).&lt;/p&gt;\n&lt;p&gt;Face-to-faceand virtualappointmentsforCovidand non-Covidpatients&lt;/p&gt;\n&lt;p&gt;Respond to healthcare professional line calls(including care homes).&lt;/p&gt;\n&lt;p&gt;You will have dedicated management and leadership time to help develop the service and the team along with opportunities to work with other matrons within the &lt;em&gt;gtd&lt;/em&gt; footprint.&lt;/p&gt;\n&lt;p&gt;To express your interest, you must meet the following criteria:&lt;/p&gt;\n&lt;p&gt;Although anMSc in Advanced Practice/credentialing qualification (or equivalent experience) is desirable, staff who possess a clinical assessment and diagnostics module at level 7 will be considered.&lt;/p&gt;\n&lt;p&gt;A leadership qualification is desirable.&lt;/p&gt;\n&lt;p&gt;V300 non-medical prescriber ideal but not essential.&lt;/p&gt;\n&lt;p&gt;Experience ofurgentprimary care.&lt;/p&gt;\n&lt;p&gt;ED experience is an advantage but not necessary.&lt;/p&gt;\n&lt;p&gt;A ‘can do’ attitude.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;gtd&lt;/em&gt;is a values driven organisation. We are passionate about providing the best possible healthcare for our patients but also our people are our greatest asset and so it’s imperative that we provide the training and support to ensure everyone can reach their full potential.&lt;/p&gt;\n&lt;p&gt;If you are interested and for further information, please contactLynne Barlow, clinical lead (lynne.barlow@nhs.net)or Carole Johnson,urgentcareclinicallead(carole.johnson7@nhs.net).&lt;/p&gt;\n&lt;p&gt;Six-month secondment opportunities, part-time, flexible working patterns and bank work will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130019.png", "name": "gtd healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130019"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham", "postalCode": "OL1 1NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5438", "longitude": "-2.11687"}}, "title": "Matron - Oldham Digital Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241824", "validThrough": "2020-11-09T23:59:59+0000"}