{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-06T09:30:52+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;An excellent opportunity has arisen to join the Cardiology (Cardiac Catheter Suites) at Manchester University NHS foundation Trust (MFT). MFT is one of the largest NHS Trust in the country and it is a place of innovation. Manchester Heart Centre in partnership with Northwest Cardiac Centre provides tertiary care to cardiac patients throughout the northwest region. If you would like to develop your talents in an exciting and dynamic environment Cardiac Catheter Suites at Manchester Heart Centre could be the place for you.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one the largest Cardiology centres in the Northwest, we undertake progressive initiatives in diagnostic and interventional cardiology, e.g. day case PCI (Percutaneous Coronary intervention), pacing, electrophysiology, TAVI (Transarterial Aortic Valve Implant) and Primary PCI. As a team we are committed to providing a gold standard of care to all our patients, focusing on progressive, forward thinking approach to achieve this. You will have the opportunity to develop skills and knowledge to undertake various procedures performed in Cardiology.&lt;/p&gt;\n&lt;p&gt;In return we offer a safe and encouraging environment for staff development- with a robust orientation program, strong leadership that will provide you with the support and guidance on your professional journey in cardiology in accordance with Trust vision and values.&lt;/p&gt;\n&lt;p&gt;The catheter labs are run by a close-knit team of doctors, radiographers, nurses and cardiac physiologists. Ability to work within a multidisciplinary team environment is a must. The radiographic team is essential to all cases and particularly relied-upon to advise junior cardiologists with regard to preferred projections and radiation safety. Radiographers are also involved in the performance of adjunct imaging such as intravascular ultrasound (IVUS) and optical coherence tomography (OCT).&lt;/p&gt;\n&lt;p&gt;The successful candidate would be expected to participate in the 24/7 out of hours, non- residential on-call service in each area and must be prepared to work flexible shifts.&lt;/p&gt;\n&lt;p&gt;This post is a permanent Band 7 post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants must possess a degree or a diploma in Diagnostic Radiography and be HCPC registered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates should be enthusiastic, flexible, forward thinking and highly motivated. They should demonstrate good communication skills and work well as part of a team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMax PiJob titleLead Cardiac RadiographerEmail addressmax.pi@mft.nhs.ukTelephone number01612764257Additional contact information&lt;/p&gt;\n&lt;p&gt;Rizwan Rashid&lt;/p&gt;\n&lt;p&gt;rizwan.rashid@mft,nhs.uk&lt;/p&gt;\n&lt;p&gt;01612764267&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mariane Ranas&lt;/p&gt;\n&lt;p&gt;mariane.ranas@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01612764257&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiac Catheter Laboratories, Manchester Heart Center, Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Specialist Cardiac Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259017", "validThrough": "2020-11-16T23:59:59+0000"}