{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "94988", "minValue": "57705", "unitText": "YEAR", "value": "£57,705 - £94,988 Dependent on experience"}}, "datePosted": "2020-10-21T13:13:17+0100", "description": "&lt;p&gt;Sussex Partnership is about the people. The people we work for, the people we work with and the people we want to become. We want to create the right job for you that not only provides a service but works with your interests.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Research&lt;/strong&gt; – Are you looking to further or start your research? We have Research Assistants embedded within teams and have access to leading edge technology to support you with this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education&lt;/strong&gt; – Are you interested in taking students on placement or getting involved with teaching? We have strong links with Brighton and Sussex Medical School.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Support&lt;/strong&gt; – Are you looking for opportunities to work flexibly or work in teams that understand and support each other? We appreciate how caring our staff are and recognize the importance of caring about you too. Are you looking for opportunities to work flexibly or work in teams that understand and support each other? We appreciate how caring our staff are and recognize the importance of caring about you too.&lt;/p&gt;\n&lt;p&gt;The Trust is seeking a new developed Associate Specialist post as part of the expanded Early Intervention in Psychosis Services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity, as the service has expanded from an age-limited 14-35yrs to an ageless service up to 65yrs providing assertive outreach mental health care to people with a first episode psychosis. The post holder will provide Associate Specialist doctor input to EIP services (currently within Children &amp; Young People&#39;s Services) in Brighton &amp; Hove, in a vibrant team and community setting&lt;/p&gt;\n&lt;p&gt;This post is being advertised as less than full time. However, please get in touch if you are interested in the position but want to work different hours. We can discuss how this role can work for you!&lt;/p&gt;\n&lt;p&gt;If you would like to discuss working at Sussex Partnership then please pick up the phone and talk to us! We want to hear your thoughts and ideas on how our jobs can work for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Richard WhaleJob titleConsultant PsychiatristEmail addressrichard.whale@sussexpartnership.nhs.ukTelephone number0300 304 0064Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information regarding EIP services across Sussex, please contact our Clinical Lead Dr Katherine Hill at katherine.hill@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aldrington Centre, Hove", "postalCode": "BN3 4AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8301", "longitude": "-.184206"}}, "title": "Locally Appointed Associate Specialist Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236556", "validThrough": "2020-11-08T23:59:59+0000"}