{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5 equivalent"}}, "datePosted": "2020-10-26T09:49:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Surgical Wards | Band 5 | Sutton | Full Time and Part Time | Fully Funded Training&lt;/strong&gt; &lt;strong&gt;Programs &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire St Anthony Hospital is looking for a Surgical Staff Nurse to join our dynamic and forward thinking nursing team, work within safe COVID pathways and benefit from our fully funded training programs and excellent IPC support&lt;strong&gt;. &lt;/strong&gt;We have six operating theatres coving a wide range of specialities and procedure including Ortho, Gynae and Cardio, where you will work alongside some of the best consultants in the region and expand your skills and expertise.&lt;/p&gt;\n&lt;p&gt;Founded in 1904, Spire St Anthony&#39;s Hospital delivers care through skilled and dedicated staff working together. With a completed £27m development investment, we provide very high quality healthcare to patients around Sutton, Epsom, Surrey and South London. We have six operating theatres coving a wide range of specialities and procedure including Ortho, Gynae and Cardio. There is an ITU department providing care and accommodating more complex patients.  We have a number of developmental training courses and progression opportunities available for our ambitious employees.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Hospital covers a wide variety of surgical procedures, you will support in assessing patient’s health and well-being across a complex and changing caseload, assisting in the delivery of care to meet the patient’s needs. You will actively promote best practice and contribute towards quality improvements, collect collate and organise data, interpret all of the information and make a justifiable assessment, making this available to relevant others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registered&lt;/li&gt;\n&lt;li&gt;Minimum of 2 years surgical experience&lt;/li&gt;\n&lt;li&gt;ALS training is desirable, however training is provided&lt;/li&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Good team working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Elena Tsoneva on 07921 065 874 or elena.tsoneva@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton", "postalCode": "SM3 9DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3795", "longitude": "-.220251"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241913", "validThrough": "2020-11-26T23:59:59+0000"}