{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa pro rata"}}, "datePosted": "2020-11-05T13:31:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow in Emergency Medicine (ST4+) – &lt;/strong&gt;&lt;strong&gt;80:20 &lt;/strong&gt;&lt;strong&gt;Frailty&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Love Emergency Medicine but wish you could combine it with your specialist interest? Want to broaden your interests in a non-clinical area without losing too much training time? Can you help us strive for clinical excellence?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The following could be offered individually&lt;br /&gt;or a combination of the three:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;20% Frailty – working alongside the new acute frailty service assessing frail older people in ED and AMU&lt;/li&gt;\n&lt;li&gt;20% Orthogeriatrics – working alongside the team to assess elderly trauma patients and contribute to their ongoing management (silver trauma)&lt;/li&gt;\n&lt;li&gt;20% Stroke – working on the acute stroke unit and being part of the team performing assessments for thrombolysis / thrombectomy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In addition to this Frailty Fellowship opportunity we can also consider your own interests related to Frailty that you may wish to pursue.&lt;/p&gt;\n&lt;p&gt;The senior clinical fellow posts include 80% time working in the adult emergency department and 20% paid time to develop in a specialist interest of the successful candidate’s choice. The posts are open as OOPT/E for EM HSTs and as stand-alone posts for non-trainees, and can be 100% EM if required. We are also open to SAS and Specialty Doctors if that suits.&lt;/p&gt;\n&lt;p&gt;You will be joining a forward thinking Trust, recently awarded outstanding by the CQC for 2 years in a row, based in the heart of Bristol – a city that has been rated in the top 3 best places to live and work in the UK!&lt;/p&gt;\n&lt;p&gt;The posts provide an ideal opportunity for the successful candidates to develop their own specialist interests while working in a busy inner city university hospital, with teaching and research responsibilities and are based in the adult side of the department, serving the Bristol Royal Infirmary (BRI).&lt;/p&gt;\n&lt;p&gt;Ongoing recruitment cycles and flexible start dates&lt;/p&gt;\n&lt;p&gt;Applicants should hold a relevant postgraduate qualification (MRCEM, MRCP, MRCS, FRCA or equivalent), and should be ST4 + or equivalent, having completed a minimum of 3 years in approved SHO posts (Post Foundation Medicine) or equivalent in relevant acute specialities including at least 1 year in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Duncan Courtney Duncan.Courtney@UHBristol.nhs.uk and Elizabeth Martin Elizabeth.Martin2@UHBristol.nhs.uk and their Secretary Emily Broughton on 0117 342 1499 /97&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Senior Clinical Fellow in Emergency Medicine 80:20 Frailty", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257899", "validThrough": "2020-11-19T23:59:59+0000"}