{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27350", "minValue": "27350", "unitText": "YEAR", "value": "Circa £27,350"}}, "datePosted": "2020-10-29T13:54:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“Newly Qualified Applications Considered”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we are recognised leaders in helping people recover from addiction and gain control of their lives. By providing the right support at the right time, and making sure that people can find all the help they need through a single point of contact, we have grown into one of the largest providers of substance misuse services in England and Wales. Right now, we are now looking for a talented CBT Therapist to ensure the effective implementation of all psycho-social interventions within our community-based substance misuse services in Swindon and Wiltshire.&lt;/p&gt;\n&lt;p&gt;IMPACT Swindon and Wiltshire Active Recovery service is a fully integrated adult service delivered by Turning Point since April 2018. We were awarded a rating of “Outstanding “ by the CQC in 2019. There will be a focus on partnership working throughout the services to help those in the local community who need support to achieve their goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As we have adapted our service delivery model in response to COVID-19 and alongside Public Health England guidance, we have developed new technology and approaches to deliver services in ways that ensure we continue to deliver services that are both safe and effective for service users and staff alike. The successful candidate will be expected to embrace new approaches alongside more traditional methods.&lt;/p&gt;\n&lt;p&gt;You will offer clinical guidance, training and leadership to a team that delivers psycho-social interventions to both individuals and groups. You will use your expertise to oversee a range of innovative approaches with people who use substances. In addition to being responsible for the systematic governance of these and other services, you will offer practical advice on use of a CBT framework to colleagues as well as local agencies and organisations. Inspiring, developing and coordinating everyone on your team will of course, be a vital part of your role. We will also expect you to have a small caseload of service users with complex needs, providing CBT for co-existing mental health difficulties.&lt;/p&gt;\n&lt;p&gt;Beyond the operational level, you will have a significant impact on the strategic direction and development of the service as a whole. This will include building strong professional links with other statutory and voluntary service providers and using your expertise to put relevant support and education structures in place. You will also explore ways to continuously improve our services and integrate wider issues - housing, employment and finances, for example – into the overall treatment process. You will be invited to work with our national team of Clinical, Counselling and Forensic Psychologists and CBT Therapists to develop psycho-social approaches used across services and to pursue a therapeutic specialism that fits with service needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be trained in Cognitive-Behavioural Therapy to Masters level and have proven ability to deliver psychological services. You will either be BABCP accredited or be working towards accreditation. Your experience of leading and supervising clinical staff will be supported by experience of working with substance misuse Service Users. Formal training in supervision, whilst not essential, would be desirable. Excellent communication skills, adaptability and commitment to the Recovery Agenda, will all contribute to you becoming a vital member of our clinical leadership team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not just about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation fromInvestors in People&lt;/li&gt;\n&lt;li&gt;31 days’ paid holiday a year, increasing with each year of service up to 33 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon &amp; Wiltshire", "postalCode": "SN1 1SQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.559", "longitude": "-1.78286"}}, "title": "CBT Therapist (Psycho-Social Interventions Lead) – IMPACT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248581", "validThrough": "2020-11-30T23:59:59+0000"}