{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-21T12:15:21+0100", "description": "&lt;p&gt;Following a national development we have an exciting opportunity for an enthusiastic Clinical or Forensic Psychologist band 8a to join the Forensic Outreach Liaison Service (FOLS).&lt;/p&gt;\n&lt;p&gt;The FOLS service is available to people over the age of 18 with a diagnosis of learning disability and/or autism who have offended or are at risk of offending. The service covers the Barnsley, Calderdale, Kirklees and Wakefield areas.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work alongside the Principal Clinical Psychologist and Assistant Psychologist, in co-ordinating and delivering psychological provision within the FOLS team. Due to this being a development post, the post-holder will be invited, to take a lead on developing the interventions provided by FOLS, particularly embedding and supporting development of a Dialectical Behaviour Therapy (DBT) informed approach across the service. There will also be opportunities to deliver offence-focussed intervention, both directly with service users and through support and supervision of non-psychological colleagues. As a service situated within the Forensic BDU, wehave good links with other psychologists working in forensic services, including the secure division, and other FOLS teams within the region. There are opportunities to become involved in teaching on the local DClinPsy courses, alongside offering placements to trainee psychologists.&lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, confident, enthusiastic and proactive Psychologist who has or wants to develop their leadership skills.&lt;/p&gt;\n&lt;p&gt;Effective communication, organisational and IT skills are essential.&lt;/p&gt;\n&lt;p&gt;We are dedicated to personal and professional development.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be passionate about improving the lives of vulnerable adults.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Dr Nici Grace 07901 558148 or Catherine Dunne 07901518864 or Jo Barber General Manager 07384 248875.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Clinical/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236299", "validThrough": "2020-11-13T23:59:59+0000"}