{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-22T10:11:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Permanent Part time Community Physiotherapist - Band 6.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at Torbay and South Devon we value our staff and the diverse experiences and contributions they bring. We pride ourselves on being an inclusive organisation where every individual has the opportunity to make a real difference. So why join us?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Our organisation is one of the first of its kind with integrated health and social care and is a leader on innovation within health and social care service delivery&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We deliver our services from a variety of clinical settings and bases in an outstanding area of beauty.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We have a positive a vibrant working atmosphere with good transport links to all our sites&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We are a mindful employer that recognises that employee health and wellbeing is a fundamental part of our success&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We offer a number of staff benefits including salary sacrifice schemes for cars/technology/cycles and childcare.&lt;/p&gt;\n&lt;p&gt;An exciting opening has arisen within our community therapy team for a Band 6 physiotherapist to join us. You will have the opportunity to work in a variety of areas including Intermediate Care, Community Rehab and Brixham Community Hospital Rehab. Our friendly team, prides itself on providing goal centred holistic rehab within our integrated unit. We are able to consider full time or part time hours.&lt;/p&gt;\n&lt;p&gt;All staff receive regular supervision and have access to a wide range of development opportunities including Clinical interest groups and in-service training. We can also offer funding opportunities for external courses.&lt;/p&gt;\n&lt;p&gt;Torbay and South Devon NHS Foundation Trust is an integrated organisation which aims to provide high quality, safe health and social care at the right time, in the right place to support the people of Torbay and South Devon to live their lives to the full. The physiotherapy service is integral to ensuring that this statement of purpose is delivered to our communities. For staff this gives unequalled scope for joint working, skill sharing and learning in a supportive environment.&lt;/p&gt;\n&lt;p&gt;We welcome applications from established band 6 staff and more experienced band 5 staff who have completed their core rotations.&lt;/p&gt;\n&lt;p&gt;For further information on why to work with us, please see our welcome films in the further links sections to the right of this page. #seeyouinsouthdevon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paignton &amp; Brixham", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Community Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237830", "validThrough": "2020-11-15T23:59:59+0000"}