{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-04T13:00:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mental Health Services for Older People Directorate is the major provider of mental health services to older people in Nottinghamshire. It delivers a range of Community and Inpatient based assessment and treatment for people of any age with dementia and those people over 65 years experiencing mental health problems. We strive to be leaders in specialist mental health care and treatment, working in close partnership with the Trust Involvement Team to ensure that all service users are valued, listened to and receive high quality personalised care.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for 2 full-time Healthcare Assistants to work with older people with dementia needs on Silver Birch Ward at Highbury Hospital.&lt;/p&gt;\n&lt;p&gt;Applicants must have experience of working with people with mental health problems in a health and social care setting.&lt;/p&gt;\n&lt;p&gt;As part of the nursing team you will have responsibility for providing and maintaining a high standard of person-centred care and facilitating therapeutic / meaningful activities for patients on the ward. You will liaise closely with other health and social care professionals as well as patients, relatives and carers, therefore the use of excellent communication skills are essential for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Asif Zaman - Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address: Asif.Zaman@nottshc.nhs.uk / Telephone number: 01159 691300 Ext:12517&lt;/p&gt;\n&lt;p&gt;Pete Ansell- Clinical Lead Silver Birch Ward&lt;/p&gt;\n&lt;p&gt;Email address: pete.ansell@nottshc.nhs.uk / Telephone number: 01159691300 Ext: 12223&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255943", "validThrough": "2020-11-15T23:59:59+0000"}