{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 Per annum"}}, "datePosted": "2020-10-20T10:01:19+0100", "description": "&lt;p&gt;Trust&lt;strong&gt; Grade Doctor (Core Level) – Maxillofacial Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for Trust Grade Doctors at Core Level. Applications are invited to join our dynamic team at the Leicester Royal Infirmary.&lt;/p&gt;\n&lt;p&gt;Successful candidate will take up post for a fixed period of 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full GDC required at time of commencement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to the large volume of maxillofacial trauma, there are special interests in the management of salivary gland disorders, facial deformity, and patients with head and neck malignancy utilising reconstruction with micro-vascular free tissue transfer technique.&lt;br /&gt;&lt;br /&gt;You will be expected to carry out minor surgical procedures under both local and general anaesthetic with supervision.&lt;br /&gt;&lt;br /&gt;The post is not accredited for any training.&lt;br /&gt;&lt;br /&gt;For further information or to arrange a visit please contact:&lt;br /&gt;&lt;br /&gt;Mr Baker &amp; Miss Busby - Earle via switchboard at Leicester Royal Infirmary&lt;/p&gt;\n&lt;p&gt;The basic salary is £38,694.00 - plus additional allowances where applicable upon joining the on call rota according to the appropriate work schedule. Trust Grade doctors at UHL will be entitled to take study leave and allocated funding for training and study.&lt;/p&gt;\n&lt;p&gt;These posts allow successful candidates to develop their clinical skills and experience in a hospital with a track record of innovative service delivery, excellence in training and clinical research. The University Hospitals of Leicester is one of the largest and busiest teaching trusts in England employing over 14,000 members of staff, providing services to nearly a million people across Leicestershire and Rutland with all three hospitals delivering an acute general hospital service.&lt;/p&gt;\n&lt;p&gt;It is important that if you have been employed as a doctor by another organisation that you provide details of your most recent Designated Body and Responsible Officer together with contact details to the Chair of the interview panel.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Baker Consultant Maxillo-facial Surgeon &amp; Miss Busby - Earle Consultant Maxillo-facial Surgeon and Head of Service via switchboard at Leicester Royal Infirmary&lt;/p&gt;\n&lt;p&gt;Closing Date: 17/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Trust Grade Doctor - Core Level", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233689", "validThrough": "2020-11-17T23:59:59+0000"}