{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104408", "minValue": "104408", "unitText": "YEAR", "value": "£104,408 pro rata"}}, "datePosted": "2020-10-28T12:00:59+0000", "description": "&lt;p&gt;As part of Health Education England, Health Education Wessex is responsible for the planning, development, education, and training of the healthcare and public health workforce across Hampshire, Dorset, Isle of Wight, and Salisbury. We also provide medical training for the States of Jersey for foundation and GP training.&lt;/p&gt;\n&lt;p&gt;Across primary and secondary care for these health communities, we manage postgraduate medical training– totalling around 2,400 doctors in training at any one time - across 12 Trusts and 240 GP practices. In addition, we support the workforce development for GP Practice Nurses and Public Health practitioners.&lt;/p&gt;\n&lt;p&gt;Additionally, Wessex hosts a bespoke GP appraisal service on behalf of NHS England for established GP Practitioners to meet the requirements for revalidation in accordance with the statutory requirements set by the General Medical Council for the Wessex area as well as Jersey, Guernsey, and Gibraltar.&lt;/p&gt;\n&lt;p&gt;Following the appointment of the current postholder to the role of Head of School of Primary Care in Wessex, we are looking to recruit to the post of Associate Dean for GP Recruitment, Retention and Development. The postholder will be medically qualified with a relevant background in primary care and experience and understanding of postgraduate medical education with the requisite credibility to quickly establish themselves in the role.&lt;/p&gt;\n&lt;p&gt;The portfolio for this AD role will focus on developing and overseeing GP recruitment for the HEE Wessex office including close liaison with the national GP National Recruitment Office, local Patch offices, stakeholders and programme team. The role will also support the development, implementation and ongoing management of the new GP training programme as well as retention initiatives to support local workforce requirements.&lt;/p&gt;\n&lt;p&gt;Health Education Wessex would be looking for the successful applicant to start in December 2020.&lt;/p&gt;\n&lt;p&gt;The post is a permanent role with two sessions per week available for this role. In addition, support will be available for your personal and educational development.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about any aspect of this role, please contact Dr Peter Haig, Head of School of Primary Care, Wessex – peter.haig@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Peter Haig&lt;/p&gt;\n&lt;p&gt;Job title: Head of School of Primary Care&lt;/p&gt;\n&lt;p&gt;Email address: peter.haig@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01962690359&lt;/p&gt;\n&lt;p&gt;Name: Fenella Williams&lt;/p&gt;\n&lt;p&gt;Job Title: Education Programme Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: fenella.williams@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southern House, Winchester", "postalCode": "SO21 2RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.009", "longitude": "-1.33424"}}, "title": "Associate Dean - GP Recruitment, Retention and Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246468", "validThrough": "2020-11-11T23:59:59+0000"}