{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-03T09:16:07+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a 6 month fixed term contract for a Band 6 Junior Sister/Charge Nurse based in Fishguard. Ideally the post holder would have previous community experience or undertaking / completed the Specialist Practitioner Qualification in District Nursing (SPQ).&lt;/p&gt;\n&lt;p&gt;This opportunity will allow you to manage a delegated caseload within the Community Nursing Team providing high quality and complex care management to patients in their own homes, with the guidance and support of an experienced District Nurse Team Leader.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure high standards of care are delivered to patients and their families/carers within the home or clinic environment. This includes liaising with staff, patient/carers and other agencies/organisations as required to ensure appropriate delegation of duties and risk management, whilst ensuring effective communication between those involved in the care package.&lt;/p&gt;\n&lt;p&gt;Along with Band 6 District Nurse colleagues, you will be required to deputise in the absence of the Band 7 District Nurse Team Leader in duties concerning the broader operational / professional performance, quality, clinical effectiveness and effective resource / budget management of the team.&lt;/p&gt;\n&lt;p&gt;Pembrokeshire’s Community Nursing Teams have a wide ranging nursing skill mix and pride themselves on supporting professional development and improving high standards of community practice in line with current health policy.&lt;/p&gt;\n&lt;p&gt;This is a temporary 6 month full time position working 37.5 hours per week as 5 days over a 7 day period including weekends and bank holidays. The post holder will need the ability to travel between sites in a timely manner.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board offers the following benefits:&lt;/p&gt;\n&lt;p&gt;Dedicated career pathways and great opportunities for continuing professional development;&lt;br /&gt;Comprehensive and structured induction programme and training;&lt;br /&gt;Monthly pay plus enhancements for weekend and bank holiday working;&lt;br /&gt;NHS pension scheme;&lt;br /&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on NHS service;&lt;br /&gt;NHS discount and salary sacrifice scheme;&lt;/p&gt;\n&lt;p&gt;Additionally, one of our unique selling points is our famous Pembrokeshire coastline, allowing you to really make the most of a great work / life balance.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 25th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo LewinJob titleDistrict Nurse Team LeaderEmail addressjo.lewin@wales.nhs.ukTelephone number07811711676&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fishguard Health Centre, Fishguard", "postalCode": "SA65 9BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9948", "longitude": "-4.97934"}}, "title": "Sister / Charge Nurse Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253234", "validThrough": "2020-11-17T23:59:59+0000"}