{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-13T14:34:31+0100", "description": "&lt;p&gt;Be part of something special. Be part of a not for profit organisation driven by doing what’s best for people. At Nuffield Health, we reinvest every penny we make in our expert staff, our technology and our facilities, to provide accessible, innovative ways for people to be as healthy as they can be. Join us, and we’ll support you to be your best too.&lt;br /&gt;&lt;br /&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference. Our unique approach to connected healthcare means the difference can be truly transformative. Our network spans hospitals, Fitness and Wellbeing Clubs, and specialist services including physiotherapy - which means we can support lasting changes by taking great care of people in every way. And as Britain’s largest not for profit healthcare provider, we’d love to take good care of you too. Investing every penny in our services and people, we’ll bring out the specialist in you.&lt;br /&gt;&lt;br /&gt;At Nuffield Health, you’ll discover nursing as it should be - with more time to care, and get to know the people who are your patients as you help them through difficult times. Whether you’re currently in the NHS or a private setting, we’re sure you’ll find your career with us motivating and rewarding. Because we genuinely believe in putting our patients first. We’ll trust you to use your own judgment and skills, and respect and value you as a professional. Across a varied caseload, you’ll need to draw on all your skills to ensure each individual patient receives the high quality of care they deserve.&lt;br /&gt;&lt;br /&gt;You’ll be part of a close-knit team headed by our matron, who provides the foundation and lead for our patient centred care. And, with our consultant-led service, you’ll be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities. These are maintained to a high standard – we take great pride in our low infection rates and high CQC scores at Nuffield Health.&lt;br /&gt;&lt;br /&gt;As a nurse registered with the appropriate governing body, you’ll have the qualifications and experience relevant to your registration, including NMC. You’ll also have post-registration experience. Like us, you believe in putting people first. So you’ll appreciate having the time to care – to fully understand each patient’s needs and provide individual attention that can mean so much when they’re at their most vulnerable. In short, you’ll be able to deliver the type of care that comes naturally to a talented nurse. You’ll be an excellent communicator and team worker – flexible and motivated. As part of the hospital team, you’ll interact with practitioners from other departments because you understand the importance of continuity in patient care.&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. So we promise to support you with training, career development and our unique health and wellbeing focused benefits package. This includes free membership of your local Fitness and Wellbeing Club, physiotherapy services and an annual health assessment, as well as a range of lifestyle and financial wellbeing benefits. Along with a competitive salary package you will also be paid enhancements for shift/unsociable hours worked and on call.&lt;/p&gt;\n&lt;p&gt;We want you to love coming to work. So we nurture a supportive working environment, where you’ll feel respected, trusted, and valued. We want you to be the best you can be. So we promise to support you with training, career development and our unique health and wellbeing focused benefits. This includes free membership of your nearest Nuffield Health gym, physiotherapy services and an annual health assessment, as well as a range of lifestyle and financial wellbeing benefits such as childcare vouchers and a retirement savings plan. We really value the time you give to care, so you can be sure that we’ll reward you properly.&lt;/p&gt;\n&lt;p&gt;Experience nursing as it should be.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Health Ipswich Hospital, Foxhall Road, Ipswich, Suffolk", "postalCode": "IP4 5SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0475", "longitude": "1.22896"}}, "title": "Staff Nurse - Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224728", "validThrough": "2020-11-10T23:59:59+0000"}