{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc"}}, "datePosted": "2020-11-02T18:30:19+0000", "description": "&lt;p&gt;Central and North West London NHS Foundation Trust is one of the largest specialist Mental Health Trusts in England. We are also a University Teaching Trust; recognised locally, nationally and internationally for providing high quality innovative healthcare. We’re led by the best in the industry too – our Chief Executive, Claire Murdoch, is a national mental health director for NHS England.&lt;/p&gt;\n&lt;p&gt;Our Community Mental Health HUBS are covering the borough of Harrow defined by GP peer groups and Primary Care Network ; and comprising a multidisciplinary team of Mental Health Nurses, Social Workers, Occupational Therapists, Employment specialist, Housing officer, Support workers Psychologists and Consultant Psychiatrists. The CMHT is based in Harrow Wealdstone, a diverse multi-cultural area situated within easy reach of Central London.&lt;/p&gt;\n&lt;p&gt;If you are a highly motivated, compassionate and caring Social Worker/Approved Mental Health Professional (AMHP) with post registration experience and you have a passion for delivering high quality expert care in Community Mental Health HUBS (CMHH) then this is a fantastic opportunity for you to join our dynamic team.&lt;/p&gt;\n&lt;p&gt;This is a full-time permanent post.&lt;/p&gt;\n&lt;p&gt;The Post-holders must be a qualified Social Worker and/or Approved Mental Health Professional and meet all essential person specification requirements for the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking applications for Band 6 Social Worker/AMHP&lt;/strong&gt;, from experienced candidates who are currently registered with a healthcare professional body, have post-qualification experience in mental health, can demonstrate excellent assessment, risk management and communication skills with the ability to deliver high quality person-centered care. You will need to have extensive post-registration experience of working in a multidisciplinary mental health team with clients with acute/severe and enduring mental health problems.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Post-registration experience of working in a multidisciplinary mental health team with clients with acute/severe and enduring mental health problems.&lt;/li&gt;\n&lt;li&gt;Friendly, approachable, compassionate with good communication skills&lt;/li&gt;\n&lt;li&gt;Enjoys working as part of multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Committed to outstanding patient car&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; What you will get &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;£2,500 as a “Golden Hello” or up to £8,000 as part of the relocation package (subject to T&amp;C)&lt;/li&gt;\n&lt;li&gt;AMHP Allowance of £1800 per annum&lt;/li&gt;\n&lt;li&gt;Retention Allowance (subject to T &amp; C) of £2000 per annum&lt;/li&gt;\n&lt;li&gt;Thorough induction, regular individual supervision and reflective practice groups&lt;/li&gt;\n&lt;li&gt;Training package to ensure continuous professional development (AMHP training)&lt;/li&gt;\n&lt;li&gt;Working within a dynamic team with visibility of the Senior Management Team (Team Manager, Service Manager and Borough Director)&lt;/li&gt;\n&lt;li&gt;A range of staff benefits including “kids pass”, range of salary sacrifices schemes (inc for electronic goods and 30% savings on a car), interest free loans and many more (see attached booklet)&lt;/li&gt;\n&lt;li&gt;Streamlined recruitment process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Staff Survey results &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our borough has achieved fantastic results on the national Staff Survey and were above average comparing to other mental health trusts on the number of key indicators including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Staff motivation at work&lt;/li&gt;\n&lt;li&gt;Staff satisfaction with level of responsibility &amp; involvement&lt;/li&gt;\n&lt;li&gt;Quality of non-mandatory training, learning or development&lt;/li&gt;\n&lt;li&gt;% staff reporting good communication between senior management and staff&lt;/li&gt;\n&lt;li&gt;% agreeing role makes a difference to patients/service users&lt;/li&gt;\n&lt;li&gt;% feeling unwell due to work related stress in last 12 months&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have outstanding staff retention and sickness absence rates which we believe is the result of our compassionate and non-judgemental culture where everyone is looking after each other.&lt;/p&gt;\n&lt;p&gt;The Post-holders must be a Social Worker/AMHP and meet all essential person specification requirements for the post.&lt;/p&gt;\n&lt;p&gt;Community Mental Health HUBS operate Monday to Friday from 9.00 am to 5.00 pm.&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Musfika Begum&lt;/p&gt;\n&lt;p&gt;Job title Team Manager&lt;/p&gt;\n&lt;p&gt;Email address mbegum@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07904 112968&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bentley House, Harrow Adult Community Mental Health Service, Harrow", "postalCode": "HA3 5QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5944", "longitude": "-.336169"}}, "title": "Social Worker/AMHP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253053", "validThrough": "2020-11-09T23:59:59+0000"}