{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T13:30:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Pathology Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department of Haematology, Blood sciences laboratory, Queen&#39;s Hospital, Burton upon Trent.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Haematology and Blood Transfusion Biomedical Scientist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£ 24,907- £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited from suitable candidates interested in joining our excellent team within the Haematology department of Coventry and Warwickshire Pathology Services (CWPS). This post is based at Queen&#39;s Hospital Burton upon Trent.&lt;/p&gt;\n&lt;p&gt;The Haematology service is a rapidly expanding part of the Coventry and Warwickshire Pathology Network, which is based on the hospital sites at Coventry (University Hospital), Nuneaton (George Eliot Hospital), Warwick (South Warwickshire Hospital) and Burton upon Trent (Queen&#39;s Hospital). It offers a comprehensive range of Pathology Services to a population of approximately 1.8 million and has a close relationship with the Medical school at Warwick University. The network offers an excellent opportunity to those seeking employment in a modern, innovative and high-profile organisation.&lt;/p&gt;\n&lt;p&gt;CWPS is one of the largest Pathology Networks within the UK, it is UKAS accredited as a Network and is hosted by UHCW which is the second busiest trauma centre within the UK. As a Network we are very forward thinking and innovative and offers the prospect for great career development and future opportunities.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be willing to manage a busy workload, be forward thinking and keen to develop new skills. They must have good communication skills, be able to work successfully as part of a team and be able to work from ones own initiative&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ian Webster (Haematology Site Lead) ian.webster1@nhs.net&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jeby Jeyachandran (Blood Transfusion Site Lead) jeby.jeyachandran@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ian Webster / Jeby Jeyachandran 01282 511511 x4043 / x4087&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Burton upon Trent, Burton upon Trent", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244728", "validThrough": "2020-11-10T23:59:59+0000"}