{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7 depending on experience"}}, "datePosted": "2020-11-02T11:58:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Management Team | Governance | Band 7 depending on experience | Manchester | 30 hours Flexible Monday – Friday | Fantastic Opportunity for Senior Clinical Professional.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Manchester Hospital has an exciting opportunity for a Governance Lead to support all departments of Manchester Hospital and work closely with the Head of Clinical Services to ensure safe, effective, compassionate and high-quality care underpinned by continuous quality improvement. This is an excellent opportunity for a healthcare professional to develop their career, influence change and make a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Manchester Hospital is a brand new, £65m state-of-the-art healthcare facility offering patients a wide range of integrated surgical, medical and diagnostic services. The rapidly expanding team in Manchester consists of over 500 colleagues, who thrive in the welcoming atmosphere that is friendly, supportive and progressive.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working closely with the SMT, Complaints and all Heads of Department, you will have full responsibility for Clinical Governance within our hospital. This will include preparation for all CQC inspections and ensuring the Hospital is compliant at all times and managing the evidence based practice, policies and procedures. As this position is central to the continuing success of the hospital, you will have a high level of stakeholder engagement. This role involves a high amount of autonomy and independent working.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An excellent understanding of Clinical Governance either from a similar role or a more hands on Clinical position&lt;/li&gt;\n&lt;li&gt;Experience in report writing&lt;/li&gt;\n&lt;li&gt;Good working knowledge of the CQC and RCA.&lt;/li&gt;\n&lt;li&gt;The ability to take responsibility for a vital position within our hospital&lt;/li&gt;\n&lt;li&gt;Passionate about Clinical Governance&lt;/li&gt;\n&lt;li&gt;Ideally you will be registered nurse with an active NMC pin number or HCPC registered clinical professional.&lt;/li&gt;\n&lt;li&gt;Good negotiator with excellent communication.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little on grace.little@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M20 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4149", "longitude": "-2.23507"}}, "title": "Clinical Governance Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251914", "validThrough": "2020-12-02T23:59:59+0000"}