{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-10-26T11:16:21+0000", "description": "&lt;p&gt;The Royal Wolverhampton NHS Trust are delighted that we have been rated as a &lt;strong&gt;“Good” &lt;/strong&gt;organisation by CQC and just like you, we are ambitious about what we do. We are continually striving to improve patients’ experience and outcomes.&lt;/p&gt;\n&lt;p&gt;Bring your dedication and determination here, and you will benefit from the support of an experienced and enthusiastic multi-professional team committed to the delivery of brilliant patient care.&lt;/p&gt;\n&lt;p&gt;Will you join us on this journey? Here’s more about the role and what we are looking for.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a Lead Cancer due to the retirement of the current post holder. We are looking for an individual who has experience of working with cancer care services and has an understanding of cancer pathways and how they influence patient care.&lt;/p&gt;\n&lt;p&gt;Your role will involve working closely with the Deputy Chief Nurses, Divisional Heads of Nursing and Senior Nursing group to ensure that the national initiative Living with and Beyond Cancer (LWBC) agenda is delivered, safe and effectively while leading on the Trusts Cancer Strategy. You will lead the Trust’s 104 day reviews and work closely with teams to resolve issues and develop new pathways, ensuring that patient care and their cancer journey is at the forefront of any new developments.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who can demonstrate high-performing leadership and who is able to use their knowledge and experience to help Cancer Services at The Royal Wolverhampton NHS Trust become pioneering and a leading Trust within the West Midlands. You will need to possess good communication and negotiation skills in order to develop strong working relationships with both internal and external teams and partner agencies.&lt;/p&gt;\n&lt;p&gt;The Royal Wolverhampton NHS Trust is one of the largest NHS Trusts in the West Midlands providing primary, acute and community services. We have been nationally recognised for providing excellence in healthcare; we are home to the busiest and most technologically advanced Cardiac Centre in the West Midlands. We have a strong research focus; the Trust hosts the Clinical Research Network West Midlands (CRN WM), which is part of the National Institute for Health Research, the clinical research delivery arm of the NHS. This alliance makes sure that clinical research occupies the place it deserves and is a driver to improve patient care.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to make an immediate and positive difference, and be at the heart of driving forward our vision and aspirations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bev Morgan&lt;/p&gt;\n&lt;p&gt;Head of Nursing – Emergency and Medical Services Division&lt;/p&gt;\n&lt;p&gt;beverleymorgan@nhs.net&lt;/p&gt;\n&lt;p&gt;01902 694101&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Lead Cancer Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242175", "validThrough": "2020-11-09T23:59:59+0000"}