{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum"}}, "datePosted": "2020-10-28T10:18:52+0000", "description": "&lt;p&gt;&lt;span&gt;The Supplies Department is seeking a Procurement and Materials Management Officer to join our team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This an excellent opportunity for an enthusiastic, motivated outgoing person. The successful applicant would need to demonstrate great caring, communication and teamwork skills plus confidence and professionalism using the phone.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Core elements of the post are to provide an efficient &amp; effective procurement and supply service to the Trust in respect of a Materials Management service to wards and departments across all Trust sites: Pinderfields Hospital, Pontefract Hospital and Dewsbury and District Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Duties to include the management of products and services required by wards and departments through materials management top ups and download to NHS supply chain using electronic data capture units; processing e-procurement requisitions onto systems and creation into purchase orders for goods and services and ensuring the right goods are ordered from the right supplier at the right price to be delivered at the right time and to the right place.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be able to work with minimum supervision, on your own initiative within a demanding environment and be confident in working to deadlines. You must be computer literate with excellent verbal/customer care skills. Attention to detail and accuracy will be required.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Procurement and Materials Management Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246033", "validThrough": "2020-11-11T23:59:59+0000"}