{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "113625", "minValue": "100000", "unitText": "YEAR", "value": "£100,000 - £113,625 per annum"}}, "datePosted": "2020-11-04T09:46:03+0000", "description": "&lt;p&gt;COVID-19 has further exposed the inequalities which characterise nearly every health outcome, and the NHS has now made the acceleration of actions to address health inequalities a core element of our plans for helping support those most vulnerable in society during the pandemic and also in restoring and resetting services.&lt;/p&gt;\n&lt;p&gt;To lead this expanded and high-profile agenda we are seeking to appoint a time-limited role of &lt;strong&gt;Director for Patient Equalities and Health Inequalities&lt;/strong&gt;. The post holder will oversee the delivery of this national programme to accelerate action to address inequalities. They will provide leadership, advice, evidence, support and challenge to ensure that we deliver improvements, deliver meaningful change and create momentum for wider progress.&lt;/p&gt;\n&lt;p&gt;They will lead team who work across the organisation, with Systems and the wider community to support and drive change.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Key aspects of this role will be to:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Provide senior oversight, leadership and drive to deliver the commitments NHS England/ Improvement has made to reduce inequalities for patients as an integral part of the next phases of COVID-19 system recovery.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;To lead any subsequent COVID-19 related strategic responses to inequalities, drawing on the learning from the next stage of response. &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Provide visible senior leadership across the organisation and wider system for medium and longer term action on health inequalities as set out in the Long Term Plan;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Manage and maintain key relationships across health and social care for NHS England/ Improvement. This includes partners across government (DHSC, GEO, PHE), system leaders and programme directors;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Negotiate with colleagues across the organisation to ensure that health inequalities are mainstreamed into key plans and programmes and adequately resourced and measured;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;With colleagues from major programmes and regional offices, support the development of local systems to further strength the role of systems (integrated care systems/sustainability and transformation partnerships and Primary Care Networks) in leading the development of partnerships and strategies for addressing health inequalities;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enhance the availability and quality of data and champion the use of all forms of insight to inform decision-making in a timely way;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Ensure effective assurance and support is in place across the organisation, so that programme commitments are delivered;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enhance the capability of NHS England/ Improvement and of NHS systems to understand, interpret and address health inequalities; &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Establish and negotiate new service changes required as part of programmes, taking into account progress against objectives and the developing evidence base;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Act as a role model internally for inclusive leadership and meaningful engagement with people experiencing discrimination and disadvantage.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please note that the reason for the fixed term of your contract is due to short-term funding. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Ben Jupp&lt;/p&gt;\n&lt;p&gt;Job title: Director of Strategy&lt;/p&gt;\n&lt;p&gt;Email address: ben.jupp@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds or London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Director for Patient Equalities and Health Inequalities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255225", "validThrough": "2020-11-25T23:59:59+0000"}