{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T14:45:48+0000", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for an enthusiastic and highly motivated Radiographer to join our dedicated team of CT and General X-ray Radiographers providing high quality imaging services. The CT department has a Canon Aquilion One and has recently secured funding for an additional Canon Aquilion Prime, being installed in November. Prince Charles Hospital is a major trauma centre and stroke unit for the surrounding area. The hospital is undergoing a major refurbishment and has recently installed state of the art Siemens Fluoroscopy and MRI units. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We perform a comprehensive range of CT examinations to include MSK interventions, CT guided biopsies and CT Colonography, with our Radiographers being integral to our patient centered, one stop diagnostic clinics.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We actively encourage role development of staff supporting our CT Radiographers to train in IV cannulation, image appreciation and act as practitioners for specific CT examinations in line with IR(ME)R 2017 and local protocol.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Prince Charles Hospital is a great place to develop your skills and gain specialised knowledge in CT and support the general X-ray department on a rotational basis. We are looking for a CT Radiographer with sound knowledge and excellent team working skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Health Board fully recognises the value of our Radiographers and actively support training opportunities. The Trust have the widest array of Radiographers performing advance practice in South Wales as part of a wider Radiology team. Radiographers are independently reporting in CT (Head/CTA/CTV), Plain Film (CXR/AXR/MSK), Fluoroscopy (Upper &amp; lower GI), performing interventional TRUS biopsy, MSK Ultrasound and HSG procedures. We are constantly looking to expand these services collaboratively with our Radiologists colleagues adopting supported and structured training programmes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Radiology Directorate has a well-established Governance Agenda which includes modality User Group Meetings on a quarterly basis. The aim of the User Groups is to improve our patient centered service by encouraging collaborative working, discussing service/patient concerns, reviewing training strategies, reviewing/updating knowledge of relevant Policy, Procedure &amp; Protocol and contributing to the Audit &amp; Clinical Effectiveness agenda.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Cwm Taf Morgannwg Health Board hosts the National Imaging Academy Wales which provides us with excellent future development opportunities for our staff. We actively support monthly internal CPD meetings, regularly support external training for staff and we are keen to develop you professionally.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants will possess BSc / DCR(R) in Diagnostic Radiography, HCPC registration plus appropriate CT experience. The successful applicant will be based at Prince Charles Hospital but will be expected to be flexible in their approach and may be required to work at other sites within the Health Board.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Hours: 37.5 hours/week. You will participate in Radiology Directorate&#39;s shift roster as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Yanamarie James - CT Superintendent Radiographer&lt;/p&gt;\n&lt;p&gt;yanamarie.james@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01685 728213&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Nicholas Yule - Senior Radiographer&lt;/p&gt;\n&lt;p&gt;Nicholas.yule@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01685 721721 ext 28362&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Charles Hospital, Merthyr Tydfil", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252487", "validThrough": "2020-11-16T23:59:59+0000"}