{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T09:00:43+0100", "description": "&lt;p&gt;In line with the government’s priority to increase access and availability of mental health and wellbeing support for children and young people, the new Education Mental Health Practitioner (EMHP) role is an exciting opportunity to deliver evidence-based early interventions for children and young people, working across both educational settings and health.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to join Wave 4 of this training as we are recruiting four Education and Mental Health Practitioners to join our three teams in BaNES and Wiltshire. We are recruiting one EMHP for the BaNES team (based from our base in Keynsham and local schools across BaNES), one EMHP for the Salisbury and Devizes team (who will cover schools in Wootton Bassett, as well as more local provision) and two EMHPs for the Trowbridge and Westbury Team (covering schools in Chippenham as well as more local provision).&lt;/p&gt;\n&lt;p&gt;Each of these teams are responsible for a cluster of education settings, so it is crucial that the successful candidate can travel between these settings as well as travel to training, however, please note that all training has been scheduled for online currently.&lt;/p&gt;\n&lt;p&gt;The post offered is a full-time educational programme delivered specifically for the role in partnership with the University of Exeter. The posts will be fixed term for 12 months at NHS Agenda for Change (AfC) Band 4 level, gaining credits towards either a degree or diploma level qualification (depending on level of previous academic study), with a view to guaranteed permanent employment conditional on completion of training, with a starting salary at NHS AfC Band 5&lt;/p&gt;\n&lt;p&gt;To enable this, the applicant must demonstrate in their application the ability to work at degree level or have an equivalent level of relevant experience, with a proven record of previous learning or formal study in child development, wellbeing or mental health. Further to this, experience of working with children and young people and an understanding of the educational system in England is highly desirable.&lt;/p&gt;\n&lt;p&gt;Delivery of the programme will be provided through a combination of taught days, independent self-guided study days and experience gained in education wellbeing and mainstream mental health services.&lt;/p&gt;\n&lt;p&gt;During training, the post-holder will work under supervision to gain experience across healthcare and educational settings to enable them to gain the level of competence required to deliver high-quality, evidence-based early interventions for children and young people experiencing mild to moderate mental health problems.&lt;/p&gt;\n&lt;p&gt;The training course is divided into 6 modules, developing skills and knowledge in areas such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with children, young people and their parents/carers to support self-management including development of plans for specific interventions and agreeing outcomes;&lt;/li&gt;\n&lt;li&gt;Learning to manage own caseload, gaining the necessary skills to practice a range of interventions such as guided self-help;&lt;/li&gt;\n&lt;li&gt;Preparing and presenting caseload information to supervisors;&lt;/li&gt;\n&lt;li&gt;Working with colleagues to provide better access to specialist mental health services and supporting referrals where required;&lt;/li&gt;\n&lt;li&gt;Supporting colleagues in education to identify and manage issues related to mental health and wellbeing.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;On successful completion of training, you will be equipped with the necessary skills, knowledge and capabilities to work as a qualified EMHP and an autonomous and responsible practitioner within the scope of practice, alongside education colleagues.&lt;/p&gt;\n&lt;p&gt;EMHPs will play a key role as members of the new Mental Health Support Teams, who will have the responsibility for delivering schools’ overarching approach to providing mental health and wellbeing support for children and young people.&lt;/p&gt;\n&lt;p&gt;The successful post holder will commence training delivered by the University of Exeter (via remote learning) on February 24&lt;span&gt;th&lt;/span&gt; and would ideally be able to start at the beginning of February.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie HurryJob titleClinical Team ManagerEmail addressDebbie.hurry@oxfordhealth.nhs.ukTelephone number07867142116Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants details will be shared with the parties involved in developing the EMHP role and the services they will work in.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that as this role is intended to rapidly increase the numbers of trained staff available to support children and young people, Wellbeing Practitioners for Children and Young People (CYPWPs) are not currently permitted to apply for this training programme. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Due to the expected volume of applications, we will not be able to send you a personal response but only communicate with you if your application is successful.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to bring the closing date forward for this vacancy at any time should we receive an overwhelming number of applications. We therefore encourage applicants to apply early if you wish to be considered for this post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "School bases in Devizes, Salisbury, Trowbridge, Westbury, Chippenham and Wotton Bassett, Wiltshire", "postalCode": "SN12 7NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3671", "longitude": "-2.13154"}}, "title": "Trainee Education Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239745", "validThrough": "2020-11-08T23:59:59+0000"}