{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-13T16:16:00+0100", "description": "&lt;p&gt;Are you ready for the next step in your nursing career?&lt;/p&gt;\n&lt;p&gt;Are you ready for the next step in your life?&lt;/p&gt;\n&lt;p&gt;Is it time for a positive change?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Band 5 Mental Health Nursing Practitioners as part of our further development of inpatient services.&lt;/p&gt;\n&lt;p&gt;Over the past two years we have worked in partnership to develop a range of services that provide real alternatives to admission and reduce the length of stay for people in our adult mental health acute care. We now have a dynamic mental health service with our inpatient teams at the heart.&lt;/p&gt;\n&lt;p&gt;If you have an ambition to develop skills in acute mental health care with the support of experienced, skilled and professional colleagues the Humber Teaching Foundation Trust has a great opportunity to join a successful team. We provide short-term assessment and treatment of less than 7 days in our decisions unit alongside evidence based, effective treatments in our range of community treatment units across Hull and the East Riding.&lt;/p&gt;\n&lt;p&gt;We have a developed and supportive programme of preceptorship for newly qualified staff or for those who are seeking a longer term career in mental health inpatient services we have access to a range of post-graduate education, training and development. Humber Teaching NHS Foundation Trust is the place to build your career.&lt;/p&gt;\n&lt;p&gt;The posts would be based across PICU (Miranda House) Westlands (Female Acute Treatment) Newbridges (Male Acute Treatment) and Mill View Court (Mixed Acute Treatment) and we offer a great range of flexible hours and experiences.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,700 staff across more than 70 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jenni JordanTelephone number: 07816 331226&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull", "postalCode": "HU3 5QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.743", "longitude": "-.384447"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225022", "validThrough": "2020-11-10T23:59:59+0000"}