{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-03T17:15:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to recruit a senior Advanced Critical Care Practitioner (ACCP) to work on the critical care unit at the Royal United Hospital in Bath.&lt;/p&gt;\n&lt;p&gt;Our busy 13 bedded Critical Care Unit delivers a Critical Care service to a population of around 500,000 in Bath, and the surrounding towns and villages of North East Somerset and Western Wiltshire. We admit 800-900 patients per year: approximately 50% are medical patients, and 50% are surgical patients, but 90% of all admissions are emergencies. Our unit SMR is 0.89 overall and 0.8 for patients with a predicted risk of death of &lt;20%, making the RUH one of the top performing units in the UK. The successful post holder will join our dynamic and enthusiastic team of doctors, nurses, therapists and pharmacists at a time of exciting evolution for the service; the Critical Care Unit has been extended, during COVID to give an additional 14 bedded unit with full negative pressure bays. The Critical Care outreach service has recently been given funding to go 24/7, we are piloting a Critical care follow-up clinic and the unit is growing in its reputation as a contributor towards national research in critical care medicine, whilst continually evolving its processes and care delivery systems. The successful post holder will work shoulder to shoulder with all staff on the unit, but particularly with the doctors, as the post holder will be an integral part of the medical rota.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who:&lt;br /&gt; &lt;br /&gt;• Has undertaken the ACCP training and has the clinical experience required to work in the ACCP role. &lt;br /&gt;• Is ready to take on additional clinical and non-clinical duties.&lt;br /&gt;• Has the experience and interpersonal skills required to not only bridge the gap between medical and nursing roles but to do so at a high level within the organisation and to be an ambassador for this role at a local level.&lt;br /&gt;• Is prepared to undertake research, teaching, audit and quality improvement within the unit.&lt;br /&gt;• Can operate as an advanced practitioner at a Trust level- contributing towards continual improvements in patient safety in and out of the unit.&lt;br /&gt; &lt;br /&gt;Further details are found within the job description;&lt;/p&gt;\n&lt;p&gt;Dr. Andrew Georgiou Consultant in Anaesthesia and ICM, andrew.georgiou@nhs.net&lt;br /&gt;Telephone number: 01225 825057&lt;br /&gt;Margi Jenkins, Matron - Critical care and Outreach&lt;br /&gt;marghanita.jenkins2@nhs.net&lt;br /&gt;Telephone number: 01225 821935&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Senior Advanced Critical Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254896", "validThrough": "2020-11-15T23:59:59+0000"}