{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 £38,890 - £51,668 per annum"}}, "datePosted": "2020-10-26T12:46:35+0000", "description": "&lt;p&gt;We are looking for enthusiastic and committed clinical psychologists to join our well established and dynamic service for people over the age of sixty five who live in Kent and Medway. The post holders will be based in Medway within a multidisciplinary community mental health team for older people and provide a comprehensive psychological service to older people with a wide range of mental health needs including dementia.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit clinical psychologists at Band 7 and 8a. Band 7 psychologists will be supported in a preceptorship role.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to be involved in providing dementia services, participating in multidisciplinary working and enhancing the provision of psychological therapies for older people across Kent and Medway.&lt;/p&gt;\n&lt;p&gt;The post holder will join a supportive psychology service for older people working in and across Kent and Medway. Work colleagues include 30+ clinical &amp; counselling psychologists, music and drama therapists and assistant psychologists.&lt;/p&gt;\n&lt;p&gt;The psychological services team is warm, friendly and committed to providing outcome focused, evidence based interventions to clients, their families and support network at the time they need it.&lt;/p&gt;\n&lt;p&gt;As a team we actively promote service user engagement in the development and delivery of services and we support many service user engagement and empowerment initiatives across Kent.&lt;/p&gt;\n&lt;p&gt;Across the older adult specialty, clinical psychologists use a wide range of psychological models. This provides opportunities to access expert supervision in a range of therapeutic approaches, in addition to being able to access a network of specialist supervision groups across the trust. You will be encouraged to develop your skills and expertise in a friendly and supportive multi-professional context.&lt;/p&gt;\n&lt;p&gt;With close links to the Salomons Clinical Psychology Training Centre, our service welcomes trainees, offers a high number of Older People placements and takes advantage of post-qualification training courses and events.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Margaret O’Shaughnessy&lt;/p&gt;\n&lt;p&gt;Consultant Clinical Psychologist on 01634 382080&lt;/p&gt;\n&lt;p&gt;or email margaret.o’shaughnessy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Britton House, Gillingham", "postalCode": "ME7 1AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3885", "longitude": ".544437"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242500", "validThrough": "2020-11-09T23:59:59+0000"}