{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc"}}, "datePosted": "2020-11-04T16:00:58+0000", "description": "&lt;p&gt;Band 7 Operating Theatre Practitioner -&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Exciting opportunities have arisen at Whipps Cross Hospital, Barts Health NHS Trust for a dynamic, innovative, committed and highly skilled Registered Nurse or Operating Department Practitioner to join and Lead our Operating Theatre Teams.&lt;/p&gt;\n&lt;p&gt;You will be a Registered Nurse or Operating Department Practitioner with experience of working in a busy theatre environment at Band 6. You will be committed to developing professional competences and helping to build skilled portfolios through experiential learning and education, to maximise career prospects of each team member. You will be leading the Theatre Team on a daily basis, working with the MDT in delivering high quality care to all our patients.&lt;/p&gt;\n&lt;p&gt;We currently have 11 Inpatient Theatres at Whipps Cross Hospital covering a diverse range of both elective and emergency work in a variety of specialties including Orthopaedics, ENT, Gynaecology, Colo-rectal, Urology, Paediatrics and Day Surgery. Our Theatres have been recently re-furbished and we are working on our Elective recovery programme with the NEL Consortium. .&lt;/p&gt;\n&lt;p&gt;Our Peri-operative Department, part of the Surgical Group, is committed to building a dynamic, flexible and enthusiastic team to help develop our services and achieve the Barts Health vision for the future. If you are up for the challenge, you will be joining our team at an important time of change as we continue our initiatives to improve our patients’ experience at Barts Health.&lt;/p&gt;\n&lt;p&gt;For further information please contact Carol Waspe Matron, Whipps Cross Theatres 0208 539 5522 x4242 or carol.waspe@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross Hospitsl, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Sister/Charge Nurse/Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256536", "validThrough": "2020-11-18T23:59:59+0000"}