{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 pa (banding subject to AfC Job E"}}, "datePosted": "2020-10-21T15:46:32+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;P&lt;span style=&quot;text-decoration: underline;&quot;&gt;LEASE NOTE: Indicative Band 7 (subject to AfC Job Evaluation)&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Due to the retirement of the current post holder we are inviting applications from experienced Learning Disability Nurses for the Lead Strategic Health Facilitator (LSHF) within our proud CQC rated GOOD Learning Disability service!&lt;/p&gt;\n&lt;p&gt;The post holder will provide clinical &amp; operational management of a team of five Learning Disability Nurses, one Acute Liaison Nurse based within the UHDB’s Derby Hospital, and our three Assistants who are all experts by experience.&lt;/p&gt;\n&lt;p&gt;A major part of the role is to support the CCG and NHSi to implement Learning Disability Annual Health Checks provided by Derbyshire GP Practices. This includes the development and provision of training, resources and guidance.&lt;/p&gt;\n&lt;p&gt;The post holder will act as the named link Nurse for identified Primary Care Networks.&lt;/p&gt;\n&lt;p&gt;You will support GPs to identify the health needs of their adult population and seek support to meet those needs.&lt;/p&gt;\n&lt;p&gt;This includes promotion of the Learning Disability Annual Health check (AHC) but also identifying, leading and supporting strategies to address the health inequalities faced by people with learning disabilities.&lt;/p&gt;\n&lt;p&gt;It is important that any candidates are aware of the recently announced Quality Improvement plans for the LD AHC in primary care, and able to facilitate GP practice peer network meetings. Therefore, the successful applicant will need to have an in-depth understanding of the LD AHC process, barriers and areas for improvement.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have proven ability to provide health promotion activity with people with learning disabilities, and evidence of engagement and liaison with self-advocates and carer groups.&lt;/p&gt;\n&lt;p&gt;The expectation is that you will guide physical healthcare services to implement reasonable adjustments, and therefore you will need to demonstrated ability to deliver reasonable adjustments.&lt;/p&gt;\n&lt;p&gt;There is a requirement to work alongside the Community Support Team in the Learning Disability service with the priorities over the next 12 months:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the LD QOF Quality Improvement plans for primary care&lt;/li&gt;\n&lt;li&gt;Work with the Primary Care Informatics team to obtain data regarding the health status of people with learning disabilities in Derbyshire&lt;/li&gt;\n&lt;li&gt;Address the Health inequalities identified via the Derbyshire LeDer programme- particularly Health Action Plans, Pneumonia, constipation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information contact&lt;/p&gt;\n&lt;p&gt;Area Service Manager, Stuart Clensy, stuart.clensy@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Area Service Manager, Libby Runcie, e.runcie@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Application Closing Date: 10/11/2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 23/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingsway, Derbyshire", "postalCode": "DE223LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9167", "longitude": "-1.51329"}}, "title": "Lead Strategic Health Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237141", "validThrough": "2020-11-10T23:59:59+0000"}