{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 pro rata"}}, "datePosted": "2020-10-13T15:43:20+0100", "description": "&lt;p&gt;Are you looking to broaden your clinical experience outside of the NHS? Perhaps you have worked with military veterans and would like to know more about mental healthcare for serving military personnel? In this civilian post you will be delivering occupationally-focused mental healthcare within the Ministry of Defence whose purpose is to protect the people of the UK, prevent conflict, and be ready to fight our enemies. Experience of working with military populations would be welcome but it is by no means a pre-requisite for application. Your interest, enthusiasm and commitment are more important!&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a Clinical Psychologist to join the Defence Clinical Psychology Service (DCPS), a team of clinical psychologists and psychological therapists working within military Departments of Community Mental Health (DCMH) and specialist services throughout the UK. The role is part time and estimated to be between 13-15 hours per week.&lt;/p&gt;\n&lt;p&gt;DCMHs are multi-disciplinary teams comprising military and civilian staff: psychiatrists, mental health nurses, social workers, mental health practitioners and psychologists. The job is challenging and varied. Whilst there are similarities with NHS roles, to make the most of this opportunity you will need to be willing to embrace a different organizational culture, take on wider team responsibilities and draw on your applied psychological knowledge and expertise. For example, you could find yourself running group programmes with military colleagues, completing small scale QIP, audit or research, working with the Navy, Army and RAF to promote psychological wellbeing, teaching and training military GPs, hosting a third-year specialist trainee clinical psychologist or introducing and evaluating a new (to MOD) mode of therapy delivery. We have a strong professional structure led by a Head of Service/Defence Consultant Advisor in Clinical Psychology and regular opportunities to meet and train as a professional community of practice.&lt;/p&gt;\n&lt;p&gt;This role is based at Merville Barracks, Colchester and will work with a part time Clinical Psychology colleague under the line management of the team Consultant Clinical Psychologist, to manage, develop and contribute to clinical psychology and psychological therapy provision, case consultation, supervision and training within the catchment area for DCMH Colchester. Formal training/accreditation in one of the cognitive therapies will be of particular value in this role. There may be an opportunity to deliver part of your role from another site within the catchment area for the team or to use remote video consultation if that meets the clinical need and is more convenient for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must show evidence of holding the following qualifications, training and memberships;&lt;br /&gt;- Doctoral level training in clinical psychology or equivalent for those trained prior to 1996.&lt;br /&gt;- HCPC registered as a Practitioner Psychologist.&lt;br /&gt;- Post-doctoral training in one or more additional specialised areas of psychological practice.&lt;br /&gt;- Experience working as a qualified clinical psychologist (Band 7-8a) and ability to evidence appropriate knowledge.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Civil Service Behaviours:&lt;br /&gt;• Leadership&lt;br /&gt;• Changing and Improving&lt;br /&gt;• Communicating and Influencing&lt;br /&gt;• Delivering at Pace&lt;br /&gt;• Making Effective Decisions&lt;br /&gt;• Working Together&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;This is a Fixed-term Appointment as a Principal Clinical Psychologist at Merville Barracks, Colchester. Your responsibilities will be as described in this job advert. The reason why you are appointed for a fixed period is due to a funding review. This post will end on 31/08/2021. You should be aware that when your Fixed-term Appointment at MOD comes to an end, arrangements will be made in line with the FTA policy.&lt;/p&gt;\n&lt;p&gt;If you are a permanent MoD civil servant and are found successful for an advertised Fixed-term Appointment (FTA) you should move into the post under a Temporary Transfer (for up to a maximum of 3 years). At the end of the posting you will return to your previous MoD Business area. If this posting is at a higher grade, your promotion will be temporary, and you will return to your substantive grade at the end of the Temporary Transfer. If a Temporary Transfer cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA and Change of Work Location in the UK policy for further information.&lt;/p&gt;\n&lt;p&gt;If you are transferring to MoD from another government department (OGD) you should join the MoD on an inward loan. At the end of the loan you will return to your home (OGD) department. If a loan cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA policy for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merville Barracks, Colchester, Essex", "postalCode": "CO2 7SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8836", "longitude": ".901728"}}, "title": "Principal Clinical Psychologist (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224907", "validThrough": "2020-11-12T23:59:59+0000"}