{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-04T09:40:36+0000", "description": "&lt;p&gt;Community Staff Nurse&lt;/p&gt;\n&lt;p&gt;Hereford City Team&lt;/p&gt;\n&lt;p&gt;2 posts 1.6 WTE&lt;/p&gt;\n&lt;p&gt;Fixed Term Contract – 12 months&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a registered nurse who has always wondered what it would be like to be a Community Staff Nurse?&lt;/p&gt;\n&lt;p&gt;We have supported 2 of our staff to take up secondments to further their skills in different specialist areas and are looking to backfill their vacancies until they return.&lt;/p&gt;\n&lt;p&gt;If you would like to experience working in the City District Nursing team, working with patients in their own environment – this may be the opportunity you are looking for.&lt;/p&gt;\n&lt;p&gt;The work is varied, from supporting patients with their sometimes twice daily insulin injections and diabetes management, assessing, dressing and healing a variety of wounds (leg wounds, pressure ulcers complex wounds and topical negative therapy), supporting patients with long and short term catheters, holistic support, syringe driver management and pain relief for patients at the end of their lives, taking bloods, disconnection of chemotherapy, supporting administration of other medication and so much more.&lt;/p&gt;\n&lt;p&gt;Nursing in patients in their own environment is very different from nursing on a ward or out-patient setting. In all settings you are required to be holistic in your assessment and intervention, in a patients home the context is different, how are they managing with their activities of daily? Is there food in the fridge? Are they seeing anyone other than you? And if you arrive and they aren’t well, you will have to decide what you are going to do.&lt;/p&gt;\n&lt;p&gt;When you come into this role you will be shadowing an experienced community nurse initially before heading out on your own and you will be trained in all the skills and competencies you need.&lt;/p&gt;\n&lt;p&gt;The City team is split between the 2 City Primary Care Networks and carries a caseload of round 950 patients. It is a busy and supportive team who will help make your experience of working in community so enjoyable you may not ever want to work anywhere else!&lt;/p&gt;\n&lt;p&gt;We work 7 days a week, 365 days a year, there are a variety of shifts starting from 8am and continuing to 10pm when we handover to the Taurus overnight service.&lt;/p&gt;\n&lt;p&gt;If you would like more information please email Claire James or Miranda Smith on districtnurses3@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR2 9RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0391", "longitude": "-2.75472"}}, "title": "Community Staff Nurse - City", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255207", "validThrough": "2020-11-18T23:59:59+0000"}