{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a/pro rata"}}, "datePosted": "2020-10-27T09:15:52+0000", "description": "&lt;p&gt;The Minor Injury Unit are looking for a dynamic, enthusiastic staff nurse who is interested in a challenging position. The successful candidate will be employed as a &lt;strong&gt;Triage nurse&lt;/strong&gt; within the busy MIU. They will be responsible in triaging Minor and Major patients that self present to the Unit. They may therefore have to refer Major patients, inappropriate attendancies and safeguarding concerns to the appropriate healthcare provider. Their role will also include providing care to Minor and Major patients that may require stabilising prior to transfer to one of the acute hospital sites in worcestershire.&lt;/p&gt;\n&lt;p&gt;The Minor Injury Unit is a busy 14 hours service covering the population of Worcestershire/Wyre Forestand surrounding areas.This is a nurse led unit ran by Emergency Nurse Practitionerssupported by Health Care Support Workers. Triage nursing is now a key elementfor all urgent care settings. Using an approvedTriage tool to identify, priotise, and start any time sensitive treatment to the seriosly sick/injuredperson who self present to the unit.&lt;/p&gt;\n&lt;p&gt;Previous experience in an Emergency Department is preferred but all triage training will be delivered by a qualified instructor with in the unit. The successful candidate will be provided with limb assesments, IRMER training and age appropiate assessment techniques and competences.&lt;/p&gt;\n&lt;p&gt;A triageservice is a key element in patient safety and improving the patients journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you need any further information please contact either: Sally Bloomer ( Ward Manager) or Rebecca Wood ( ENP) on 01562 513039.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kidderminster Treatment Centre", "postalCode": "DY11 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3852", "longitude": "-2.26133"}}, "title": "Triage Nurse -  Minor Injury Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243799", "validThrough": "2020-11-08T23:59:59+0000"}