{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T14:15:46+0000", "description": "&lt;p&gt;We are looking for a passionate, autonomous and highly driven Speech and Language Therapist to join the Speech and Language Therapy inpatient team at The Royal Shrewsbury Hospital (RSH), part of The Shrewsbury and Telford Hospital NHS Trust. This position is full time, working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Three days (22.5 hours) a week will be based within the Macmillan Integrated Therapy Service (MITS) and two days per week (15 hours) based within the inpatient SLT team at RSH. This is an exciting opportunity to develop skills in inpatient and outpatient settings, as well as becoming involved in our new telehealth initiatives to support our caseloads across Shropshire, Telford and Wrekin and Mid Powys.&lt;/p&gt;\n&lt;p&gt;You will be based at RSH, working as a senior member within a team of Speech and Language Therapists, offering a service to the inpatient wards, and the oncology caseloads in chemotherapy, radiotherapy and the oncology ward, with a focus on head and neck cancer. Cross site working to The Princess Royal Hospital, Telford (PRH) may be required to support service delivery.&lt;/p&gt;\n&lt;p&gt;Experience of working with adults with complex acquired disorders of communication and swallowing is essential. Competencies in tracheostomy management and videofluoroscopy are desired; however in house training can be supported to facilitate these skills if required.&lt;/p&gt;\n&lt;p&gt;Weekly videofluoroscopy clinics are held cross site, and we are also currently exploring the development of a FEES service within our team.&lt;/p&gt;\n&lt;p&gt;As a team we are able to provide excellent line management and peer support, working closely together, with regular team meetings, clinical supervision and opportunities for continuing professional development. Through Macmillan there are opportunities for personal development grants.&lt;/p&gt;\n&lt;p&gt;As a Macmillan Professional you will work with complex cancer patients following the principles of the charity, providing expert clinical advice, treatment and support whilst striving to improve the service we deliver. The team also provides training to colleagues both internally and externally to the organisation and contributes to the Health and Wellbeing agenda activities.&lt;/p&gt;\n&lt;p&gt;The Therapy department are working towards being at the forefront of innovation in leading the way by undertaking development and service evaluation utilising the Virginia Mason Institute (VMI) methodology in Lean practices as the Trust are one of only 5 Trusts in England to be affiliated with the VMI based in Seattle, USA.&lt;/p&gt;\n&lt;p&gt;Informal visits and telephone discussions are welcomed (taking into account coronavirus precautions).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSonia Rogers-DodsonJob titleTherapy Co-ordinator, Macmillan Integrated Therapy Service / PhysiotherapistEmail addresssonia.rogers-dodson1@nhs.netTelephone number07595 464 007&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Macmillan Speech Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248660", "validThrough": "2020-11-12T23:59:59+0000"}