{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-12T10:15:21+0100", "description": "&lt;p&gt;A post has become available in South West Yorkshire Partnership Foundation Trust and we are looking to appoint an enthusiastic Band 7 Nurse to join the team.&lt;/p&gt;\n&lt;p&gt;Reporting to the Senior Nurse for Infection Prevention and Control the successful candidate will work both autonomously and as part of the Infection Prevention Control Team across the trust, striving to minimise risk from healthcare associated Infection.&lt;/p&gt;\n&lt;p&gt;The post will support, develop and implement systems to improve the quality of infection prevention and control management, by the delivery of national directives to develop local quality, patient safety and safe systems of working for staff. You must have good organisational skills and the ability to influence others.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be self-motivated and have a flexible approach to work, acting as a role model across disciplines. You will provide clear Leadership for infection prevention across the trust, influencing and improving the quality of care delivered to our patients.&lt;/p&gt;\n&lt;p&gt;You must demonstrate excellent communication skills and be computer literate&lt;/p&gt;\n&lt;p&gt;As the post is Trustwide, there will be travelling involved, the candidate should hold a current driving licence and have access to a car.&lt;/p&gt;\n&lt;p&gt;If you want to help make a difference, this is a role for you.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you require any more information please contact Alison Thomas- Senior Nurse Infection Prevention and Control 01226 644344.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BARNSLEY", "postalCode": "S75 3RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5424", "longitude": "-1.52482"}}, "title": "Specialist Nurse Infection Prevention and Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221819", "validThrough": "2020-11-11T23:59:59+0000"}