{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 / £33,176 / £37,890"}}, "datePosted": "2020-10-20T13:33:59+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you passionate about the well-being and mental health of people? If so, we would love for you to work in one of our specialist teams ,&lt;strong&gt;The Criminal Justice Liaison &amp; Diversion Service (CJLDS)&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Criminal Justice Liaison &amp; Diversion Service (CJLDS) is an all age service, providing liaison and diversion within the Criminal Justice System (CJS). It offers support to vulnerable adults and young people suspected of committing a crime, with identified health and social care vulnerabilities.&lt;/p&gt;\n&lt;p&gt;It aims to improve health and justice outcomes for people in contact with the CJS where a range of complex needs are identified. A key aim is to divert individuals out of the CJS by improving access and engagement with a range of relevant health and social care services. We work closely with the Police, Courts, Youth Offending Teams, Drugs and Alcohol Services, Probation, Housing and other services.&lt;/p&gt;\n&lt;p&gt;The service consists of a core team of professionals including Police, mental health practitioners, youth workers, Social Workers and a Speech/Language Therapist. The team offers assessments / support within Police Custody and Magistrates Court settings, alongside provision of a short term community outreach services.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to recruit a &lt;strong&gt;Specialist Speech and Language Therapist&lt;/strong&gt; to the team.&lt;/p&gt;\n&lt;p&gt;This post will be based at &lt;strong&gt;Keyham Lane Police Station&lt;/strong&gt; in Leicester.&lt;/p&gt;\n&lt;p&gt;The role will include assessment of individuals with SLCNs, within police custody and court settings, alongside assessments and support within the community. Intervention may be offered to support risk management, positive behaviour support plans and communication. The role demands good working relationships with the police and healthcare in custody during assessments of clients who have been arrested and presenting with vulnerabilities.&lt;/p&gt;\n&lt;p&gt;We can offer you a comprehensive induction program, with full support in the form of supervision, appraisal and personal development plans. There will be support and supervision from a Highly Specialist Speech and Language Therapist also working within the CJLD Team. The service also includes a wider network of Speech and Language Therapists and assistants who meet regularly to discuss clinical cases and service improvement. You will be joining a dynamic enthusiastic team of professionals who want to make a difference.&lt;/p&gt;\n&lt;p&gt;Alongside Trust requirements of an Enhanced DBS Check, the post holder will be required to be vetted by Leicestershire Police and post will be subject to vetting being approved.&lt;/p&gt;\n&lt;p&gt;If you like what you’ve read, please apply.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, to arrange a visit, or for further information please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Carol Reffin- Speech and Language Therapy Team Lead for Adult Mental Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: Carol.Reffin@leicspart.nhs.uk Tel: 0116 2252607&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE5 1FY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6501", "longitude": "-1.07267"}}, "title": "Band 6 Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234586", "validThrough": "2020-11-15T23:59:59+0000"}