{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T13:01:09+0100", "description": "&lt;p&gt;The Luton and Dunstable Hospital Therapy Department would like to present an exciting Fixed Term or Secondment opportunity for a Physiotherapist to join an established team in the Acute and Emergency Medicine Therapy Department&lt;/p&gt;\n&lt;p&gt;The team provide therapy input, with a 7 day extended hours service, across all our Front door areas such as Emergency Department, Emergency Assessment Units, Medical Short Stay units and Frailty Unit.&lt;/p&gt;\n&lt;p&gt;Our Emergency Department is proud to be the best performing in the country and are keen for further development within the Therapy team to maintain high clinical standards and services in the pursuit of excellence. The therapy team works closely with the MDT to enable efficient discharges with the patient at the heart of each decision. We are involved in many quality improvement initiatives to drive service provision forward.&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitably motivated and innovative individuals to join an energetic and evolving Therapy Team within a reputable Trust. The post holders are required to be enthusiastic and passionate about the field of therapy and must be able to work flexibly across weekends and extended hours.&lt;/p&gt;\n&lt;p&gt;We will consider flexible working and job shares for the appropriate candidates. The department has a strong commitment to CPD and supports staff members with development.&lt;/p&gt;\n&lt;p&gt;The post available is as follows:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1x WTE band 6 Senior Physiotherapist (9 month fixed term or Secondment)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further discussion or to arrange an informal visit please contact Olivia Moore or Helen Burns on 07811997205.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen BurnsJob titleSpecialist PhysiotherapistEmail addresshelen.burns@ldh.nhs.ukTelephone number07811997205&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust (formerly known as The Luton and Dunstable NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton &amp; Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Senior Physiotherapist - Acute &amp; Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240639", "validThrough": "2020-11-13T23:59:59+0000"}