{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-05T13:00:24+0000", "description": "&lt;p&gt;&lt;span&gt;Are you ready to take on the opportunity of your career and be part of something great?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you have what it takes to lead and develop a service fit for the 21&lt;/span&gt;&lt;span&gt;st&lt;/span&gt;&lt;span&gt; century?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If so, we are looking for someone with strong leadership qualities to lead our Ophthalmic theatre team here at the County hospital in Hereford. The development of the Ophthalmic service is an exciting opportunity and is a key part of the overall re-engineering of the way that the operating services are being delivered to meet the demands of modern day healthcare.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Following a major review of the way that theatre services were being delivered, we have moved away from the traditional operating structure, from the static teams, limited opportunities and the “that’s the way we have always done it” mentality. We are a department of flexible teams, exciting opportunities with innovation and improvement. We take this very seriously and to build on this we are developing teams and work streams that cover Education, Governance and Service Improvement. These teams have members from all disciplines and all grades to make this department a success.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here at the County the skills, knowledge and contributions that our colleagues bring to our department are acknowledged and valued. Individual talents are recognised and we invest in growing the potential in people. We don’t want people that are just going to fill a post but want them to help us shape the future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to the Ophthalmic team leader position, we are also looking to expand our theatre team in all disciplines – for that we are looking for exceptionally talented people that will complement our existing talented workforce, to help take our operating theatres to the next level and beyond.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you believe that you have the strong leadership and management qualities and you want to be part of a dynamic forward thinking department then we would welcome your application. Remember these opportunities do not come around often and you may regret it if you miss it!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have 8 operating theatres that cover a wide range of surgical specialities including Ophthalmology, Trauma and Orthopaedics, General, Urology, ENT, Obstetrics and Gynaecology, Breast and Dental surgery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to be flexible in your working hours as we run a 24 hour service. Shifts include earlies, lates, weekend working and rotation on to nights. You will also be required to participate in an on call rota for additional cover at night time.  &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Team Leader - Theatres", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257751", "validThrough": "2020-11-29T23:59:59+0000"}