{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-28T22:02:54+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic and experienced Band 6 nurse to work in the Single Point of Access team within Derby City Community Mental Team B .&lt;/p&gt;\n&lt;p&gt;This post is based at St Andrew&#39;s House, Derby.&lt;br /&gt;&lt;br /&gt;The post involves the triage of referrals, comprehensive assessment and short term interventions for people who are referred to secondary mental health services.&lt;/p&gt;\n&lt;p&gt;This includes comprehensive evidence based assessment and short term treatment using a range of appropriate interventions, based on the local and national practice guidance.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate expertise in risk assessment and management working in a community assessment service.&lt;/p&gt;\n&lt;p&gt;We are looking for experience and commitment, together with a desire to make our service the best we can, through innovation and collaboration with our key stakeholders.&lt;/p&gt;\n&lt;p&gt;It is essential that you have good communication and organisational skills and that you operate as a well-integrated member of the multi-disciplinary team, maintaining a person-centred focus.&lt;br /&gt;&lt;br /&gt;As a lead nurse, you will have demonstrable RMN post registration experience and be able to demonstrate post registration study and development.&lt;/p&gt;\n&lt;p&gt;You will be expected to be a role model, offering mentoring and supervision to other staff and students.&lt;br /&gt;&lt;br /&gt;You will need to have the ability to transport yourself and service users across a wide geographical area without compromising service needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Eleanor Spencer Job title: Service Manager Email address: eleanor.spencer@nhs.net Telephone number: 0300 123 4011 Additional contact information&lt;/p&gt;\n&lt;p&gt;Eleanor Spencer, Service Manager, 0300 123 4011&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Andrew&#39;s House, Derby", "postalCode": "DE1 2SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9132", "longitude": "-1.46378"}}, "title": "Lead Nurse SPOA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247587", "validThrough": "2020-11-11T23:59:59+0000"}