{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "Up to £36,500 FTE - DOE + Golden Hello"}}, "datePosted": "2020-11-04T14:25:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Break into prison healthcare!&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt; Are you looking for a new challenge in an environment where no two days are the same?&lt;br /&gt;&lt;br /&gt;Patient care is at the centre of what we do and we are looking for an enthusiastic, hard working and committed nurse who wants to make a difference to our patient’s lives.&lt;br /&gt;&lt;br /&gt;HMP Bullingdon is a Cat B/C prison holding male adults ages 18 and over located in Arncott near Bicester, Oxfordshire. We provide a GP surgery provision alongside access to mental health and substance misuse services.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Make a difference from day one!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Prisons are challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;What can we offer you?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;As a Substance Dependency Nurse you will work as part of a multi-disciplinary team, whilst being a support and resource to other staff. You must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users.&lt;br /&gt;&lt;br /&gt;You will work with individuals, on a 1-1 basis, providing advice and information. You will support in group work delivery and liaise with prescribers and Recovery Practitioners on clinical interventions. You will be required to support dispensing and attend medical emergencies. You must have an understanding and commitment to recovery and a person centred approach. This is an exciting role to support and motivate individuals to take control of their lives and to make changes to overcome dependence on substances and move onto a life free of offending.&lt;br /&gt;&lt;br /&gt;You will also be working as part of a larger multi-disciplinary team, alongside the substance misuse and mental health teams. There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;A bit about you...&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;You will be a qualified Registered Mental Health Nurse or Adult Nurse with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;br /&gt;&lt;br /&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;br /&gt;&lt;br /&gt;This is a full-time role, working 37.5 hours per week. You’ll receive an annual salary up to £36,500 FTE - depending on experience + 2 year Golden Hello (£2,000 in Year 1 of service and £1,500 in Year 2 of service - conditions apply).&lt;br /&gt;&lt;br /&gt;Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, cycle to work scheme, on-site gym facilities and onsite parking.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Bullingdon if suitable for the role.&lt;br /&gt;&lt;br /&gt;For more information or to arrange an informal visit please contact us on the details provided.&lt;br /&gt;&lt;br /&gt;Please note that this role is subject to Practice Plus group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced free DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Substance Misuse Nurse - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256209", "validThrough": "2020-11-18T23:59:59+0000"}