{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro-rata"}}, "datePosted": "2020-11-05T15:01:47+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Direct Commissioning Team (Midlands Region) to cover the role Contract Support Officer -Primary Dental, Care – East Midlands.&lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic, motivated and enthusiastic individual to join the Secondary Dental Care Commissioning Team, operating within the wider East Midlands Pharmacy, Optometry and Dental (PODs) team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work as part of a highly productive team in delivering an effective service, supporting managers and staff across the locality to commission/transform services. The ideal candidate will need to embrace change, be flexible in approach and have a passion for innovation as we move forward with implementing the priorities outlined in the Long-Term Plan.&lt;/p&gt;\n&lt;p&gt;The post holder will provide and coordinate administrative and secretarial services to the team and consistently deliver a service which promotes good customer service and effective working relationships. This will include: reparation of agendas and action logs, taking appropriate follow-up actions, management of specialist dental services payments processes, supporting the team with the management of contracts and projects, gathering information and managing communication and correspondence as required.&lt;/p&gt;\n&lt;p&gt;The role is responsible for delivering administration support for the Secondary Care Team which hold a portfolio of contracts that includes 11 Acute Trust contracts and 36 Integrated Minor Oral Surgery contracts and 5 Community Dental Services contracts across the 5 STP/ICS areas of Derbyshire, Nottinghamshire, Lincolnshire, Northamptonshire and Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, the successful applicant maybe required to attend some scheduled evening meetings.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work for the NHS England and NHS Improvement – Midlands to help shape and commission specialist dental services.&lt;/p&gt;\n&lt;p&gt;For further details on the role, please contact:&lt;/p&gt;\n&lt;p&gt;Claire Hames&lt;/p&gt;\n&lt;p&gt;Contract Manager, Secondary Dental Care/IMOS/CDS – East Midlands&lt;/p&gt;\n&lt;p&gt;Tel: 07783816176 or Email claire.hames@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Claire Hames&lt;/p&gt;\n&lt;p&gt;Job title: Contract Manager Secondary Dental Care IMOS/CDS&lt;/p&gt;\n&lt;p&gt;Email address: claire.hames@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07783816176&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Midlands", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Contract Support Officer - Primary Dental", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258242", "validThrough": "2020-11-19T23:59:59+0000"}