{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37729", "minValue": "36411", "unitText": "YEAR", "value": "£36,411 to £37,729 p.a."}}, "datePosted": "2020-11-03T16:08:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Experienced Social Worker, Swindon Recovery Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £36,411 to £37,729 p.a.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Swindon Borough Council sets great value on the role of social work in supporting people who experience mental health difficulties and is investing in getting the right structure in place. In Swindon our mental health social workers are seconded and successfully integrated within Avon &amp; Wiltshire Mental Health Partnership NHS Trust which also hosts our rota of experienced AMHPs who have worked together for many years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join an established and dynamic multi-disciplinary team based at Chatsworth House in Swindon. Swindon Recovery Service provides specialist mental health services for people of working age, and their carers. The service provides interventions to clients requiring short or long-term support to assist their recovery.&lt;/p&gt;\n&lt;p&gt;We currently have an opportunity for an Experienced Social Worker to join Swindon Recovery Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will manage a complex and dynamic case load so should have experience with mental health clients, with good knowledge and practice in working with the Care Act, the Mental Health and Mental Capacity Acts.  Experience of using Care Programme Approach would be desirable. Training opportunities for the AMHP role will also be offered where appropriate. In addition the post holder will have the support of our specialist mental health Integrated Service Lead and AMHP Lead.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would welcome applications from experienced or newly qualified AMHPs who can also join our SBC AMHP rota. This service is coordinated and supported by an AMHP Lead who ensures that AMHPs access specialist training and supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This vacancy within the Swindon Recovery Service is Monday to Friday, 9am to 5pm.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What you will get:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•    Benefit from corporate subscription to RiPFA including attendance at events &lt;br /&gt; •   Professional and Clinical Supervision and support from the integrated leadership team &lt;br /&gt; •    Learning and development opportunities including AMHP training&lt;br /&gt; •    Social Work &amp; Leadership Academy&lt;br /&gt; •    25 days annual holiday (up to 30 dependent on continuous service)&lt;br /&gt; •    Eating Out, Shopping and Entertainment discounts&lt;br /&gt; •    A career average revalued earnings (CARE) pension scheme&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be fluent in the English language (as a requirement of Part 7 of the Immigration Act – for the effective performance of a customer-facing role).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion, please contact Leila Alizadeh-Mattingley, Integrated Service Lead, telephone 01793 715000.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 24 November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Swindon Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN1 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5602", "longitude": "-1.77996"}}, "title": "Experienced Social Worker, Swindon Recovery Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254722", "validThrough": "2020-11-24T23:59:59+0000"}