{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-11-04T10:04:41+0000", "description": "&lt;p&gt;Foxhall House is part of Norfolk and Suffolk NHS Foundation Trust, which is a fantastic place to work for nurses looking for an exciting new experience, where they will be fully-supported and where they can positively develop their nursing career.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual to join our forensic low secure unit who shares our team passion of providing high quality, collaborative and thoughtful care to our service users. Foxhall House is a 16 bedded unit based in Ipswich, Suffolk. We provide inpatient support in a secure setting for male adults over the age of 18 who have come into contact with the criminal justice service and who are now detained under the mental health act.&lt;/p&gt;\n&lt;p&gt;As part of the role you will be supported to develop your leadership skills, and be responsible for implementing high standards of care. You will be supporting the facilitation of training programmes for our junior members of staff with an opportunity to create bespoke training packages for newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;The ward has gone through a huge transformation over the last year, implementing not two but three quality improvement projects. This has resulted in a real sense of community by increasing and enhancing the quality of patient and staff interactions, reducing restrictive interventions, and developing a culture of safe, effective and positive care.&lt;/p&gt;\n&lt;p&gt;If you want to work with our award winning team, you want to challenge yourself; possess the drive to deliver high quality care; have excellent communication skills; have a close attention to detail, and a positive and proactive approach, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lindsay Sadler Additional contact information&lt;/p&gt;\n&lt;p&gt;Kim Mayes - Clinical Team Leader&lt;/p&gt;\n&lt;p&gt;Lindsay Sadler - Matron&lt;/p&gt;\n&lt;p&gt;01473 322200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Foxhall House, 3 Brightwell Close, C/o Ribbans Park (Formerly St Clements Hospital), Ipswich", "postalCode": "IP3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.05", "longitude": "1.19501"}}, "title": "Charge Nurse - Low Secure Services - Suffolk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255311", "validThrough": "2020-11-18T23:59:59+0000"}