{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "Band 8A £45,753 - £51,668"}}, "datePosted": "2020-10-28T13:46:50+0000", "description": "&lt;p&gt;&lt;strong&gt;This is an exciting job that presents a unique combination of opportunities: not only will you apply cutting-edge quantitative methods to develop high-quality economic models and original research, you will also present it to national policy-makers and contribute to their decision-making. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You also get the satisfaction of knowing your work will directly improve health and social care in England. See our ‘week in the life’ documents for an illustrative indication of what you can expect to do.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for a single permanent post, at either the Band 7 Technical analyst (economics) or Band 8A Senior technical analyst (economics) level within the Centre for Guidelines. Please complete the appropriate application depending on the role you wish to apply for &lt;em&gt;&lt;strong&gt;(apply to this vacancy for the band 8a or vacancy 907-0150 for the band 7)&lt;/strong&gt;&lt;/em&gt;. Full details of the essential criteria for each level are provided in the attached Job Descriptions and Person Specifications.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 Technical analyst (economics) (£38,890 - £44,503):&lt;/strong&gt; Working collaboratively within a small multidisciplinary team, the post-holder will provide advice and technical support to committees on economic issues during development and updating of guidelines. This includes systematically identifying and appraising economic evidence to address key health and social care questions and preparing structured summaries of the evidence. The post holder will also undertake the development of original, applied decision models and analyses that will be used to inform the deliberations of the guideline committee (comprising decision-makers who are predominantly clinical, public health, social care and patient experts with limited formal expertise in economics).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8A Senior technical analyst (economics) (£45,753 - £51,668):&lt;/strong&gt; In addition to the responsibilities outlined for the Band 7 Technical analyst above, the post-holder will also severe a quality-assurance function. You will be involved in reviewing guidelines produced by other developers to ensure that they reflect the economic evidence appropriately. As part of this, you will ensure that economic modelling and statistical analyses produced by the developer have been conducted robustly, are in line with NICE’s methods and are free from technical errors. You will also have the opportunity to mentor junior analysts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will bring to NICE:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The primary requirement for the position is demonstrable ability in the practical application of mathematical modelling to inform real-world decision problems:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For the Band 7 level:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You should have skills and experience in economics, mathematical modelling, statistics, operations research and/or data science.&lt;/li&gt;\n&lt;li&gt;Expert ability in the analysis and synthesis of quantitative data is essential.&lt;/li&gt;\n&lt;li&gt;You will also need the ability to communicate the methods and results of complex analyses to a range of audiences, both orally and in writing.&lt;/li&gt;\n&lt;li&gt;At present, the team has a preference for models developed in MS Excel, R, TreeAge and/or WinBUGS; however, applications from candidates with experience in other platforms are welcome.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For the Band 8A level (in addition to all the Band 7 level requirements):&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You should have experience conducting economic evaluations in healthcare, including the development of economic models.&lt;/li&gt;\n&lt;li&gt;Understand the principles of evidence-based healthcare, critical appraisal and the interpretation and synthesis of health care research evidence.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Have experience or familiarity with research design, methodology, conduct and reporting.&lt;/li&gt;\n&lt;li&gt;An ability to establish effective working relationships with a range of professionals both within and outside the Institute.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At both the Band 7 and 8A levels, you will have the opportunity to extend your own skills in modelling and economics and contribute to methodological developments in the field.&lt;/p&gt;\n&lt;p&gt;Our analysts are supported to publish their research in high-impact journals and present it at international conferences. The post will be line-managed by a Band 8B Technical adviser (economics).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why NICE?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at NICE we are passionate and proud of the work we do and the impact we make.&lt;/p&gt;\n&lt;p&gt;We can offer you a great place to work with good benefits, flexible working and a supportive, friendly and inclusive environment.&lt;/p&gt;\n&lt;p&gt;We have an academic culture committed to producing high-quality work and we take collective responsibility.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The department:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Centre for Guidelines is a world-leading authority in developing clinical, public health and social care guidelines. It provides recommendations for the NHS and local authorities on appropriate prevention, treatment and care options for people in England, based on systematic appraisal of the best available evidence of effectiveness and cost effectiveness.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: &lt;/strong&gt;Midnight Sun 29th November 2020. No late applications will be accepted.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held remotely over Zoom on 9 December 2020 for the Band 8A level and TBC for the Band 7 level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No agencies please.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Brett Doble – Technical adviser (economics)&lt;br /&gt; +44 (0)161 413 4093&lt;br /&gt; brett.doble@nice.org.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "National Institute for Health and Care Excellence", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120816"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester  UK, London UK", "postalCode": "M1 4BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4805", "longitude": "-2.23899"}}, "title": "Technical Analyst/Senior Technical Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246836", "validThrough": "2020-11-29T23:59:59+0000"}