{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-14T11:01:18+0100", "description": "&lt;p&gt;An exciting and rewarding opportunity has arisen for a suitably qualified, enthusiastic and passionate Advanced Nurse Practitioner to join the South Cynon Primary Care cluster.&lt;/p&gt;\n&lt;p&gt;We have six GP surgeries in the cluster, covering a population of approximately 30,000 patients and work collaboratively alongside community pharmacists, optometrists, dentists, district nurses, the third sector and the local authority to support the health of our population.&lt;/p&gt;\n&lt;p&gt;The ‘multi-disciplinary team’ approach allows us to meet the health needs of our ageing population and is something we are already fully committed to and working with as a cluster. We believe this can bring huge benefits to our population with improved access to services closer to home and new and improved services and models of care for the population.&lt;/p&gt;\n&lt;p&gt;The main focus of this role will be to lead, co-ordinate and manage the new Care Home directed enhanced service on behalf of the GP practices. This includes regularly and effectively engaging with care home staff in the comprehensive management of care home residents on a weekly basis, and ensuring appropriate assessments are completed.&lt;/p&gt;\n&lt;p&gt;The Advanced Nurse Practitioner will also act as an expert resource within the cluster multi-disciplinary team, providing specialist advice regarding the clinical management of individuals presenting with minor illnesses or chronic conditions. Patients are reviewed at a weekly multi-disciplinary meeting alongside healthcare colleagues.&lt;/p&gt;\n&lt;p&gt;An induction programme and development/training opportunities across the primary care sector will be offered.&lt;/p&gt;\n&lt;p&gt;Working hours are 37.5 hours a week, and can be undertaken flexibly between 08:00 – 18:30 Monday to Friday to suit the individual.&lt;/p&gt;\n&lt;p&gt;If you are dynamic, organised, work well within the multidisciplinary team and have an interest in developing a career in Primary Care, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;As this is a new post, we welcome questions and enquiries to: Angharad Pitt, Primary Care Development Manager (Angharad.pitt@wales.nhs.uk)&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Angharad Pitt, Primary Care Development Manager&lt;/p&gt;\n&lt;p&gt;angharad.pitt@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01685 351387&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Cwm Cynon, Mountain Ash", "postalCode": "CF45 4BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6561", "longitude": "-3.34335"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225841", "validThrough": "2020-11-11T23:59:59+0000"}