{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 pro rata, inc HCA"}}, "datePosted": "2020-11-06T09:16:02+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King&#39;s College Hospital NHS Foundation Trust is part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), a pioneering collaboration between King&#39;s College London, and Guy&#39;s and St Thomas&#39;, King&#39;s College Hospital and South London and Maudsley NHS Foundation Trusts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and well-organized Administrative Assistant to join our MSK team. You will work collaboratively with other team members and be responsible for providing a first class administrative support service to the King’s MSK Pain Team and from time to time for the MSK Orthopaedic Team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to work within a busy, supportive and dynamic multidisciplinary musculoskeletal service for King’s College Hospital based at Queen Mary’s, Sidcup. The King’s Musculoskeletal (MSK) service consists of Pain Management, Orthopaedics and Rheumatology. The service is part of King’s College Hospital NHS Foundation Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will ensure a comprehensive effective administrative service to all consultants, specialist nurses, medical staff and their team within the clinical unit to allow the smooth and efficient performance of the service. An integral part of this role will be supporting the booking of patients for ultrasounds and ultrasound guided injections. In the supporting role to the MSK Pain Secretary, you will be expected to liaise with the multi-disciplinary team, internal departments and external agencies to ensure continuity in achieving excellence in patient care.&lt;br /&gt; &lt;br /&gt;Exceptional interpersonal and communication skills are essential, as the post holder will be expected to be able to communicate effectively and sensitively with a wide range of people including patients, colleagues, sub-contractors and external agencies. The ability to organise meetings, including pain management programmes and diary management are essential to this post. Excellent IT skills and previous experience in an office setting for a minimum of 12 months are essential.&lt;br /&gt; &lt;br /&gt;There is more information in the Job Description and Person Specification, so please make sure you read them properly before applying and detail clearly how you meet the essential criteria on the person specification within your application. This information will be used during the shortlisting process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;span&gt;Interviews will take place on Monday 7th December 2020 (via Microsoft Teams).&lt;/span&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Particular emphasis is put at King’s on the need to ensure that all staff recognises their responsibility to deliver services in a high quality, courteous, patient focused manner maintaining patient confidentiality at all times.&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Elizabeth Buckingham&lt;/p&gt;\n&lt;p&gt;Job title MSK Service Delivery Manager&lt;/p&gt;\n&lt;p&gt;Email address elizabeth.buckingham@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 910 7364&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Mary&#39;s Hospital, Sidcup", "postalCode": "DA14 6LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4186", "longitude": ".103279"}}, "title": "MSK Pain Administration Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258988", "validThrough": "2020-11-15T23:59:59+0000"}