{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45000", "unitText": "YEAR", "value": "£45-753-£51,668 (Band 8A)"}}, "datePosted": "2020-11-05T19:06:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Service Manager - Locality Mental Health Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£45-753-£51,668 (Band 8A)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Full time - Permanent&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to join the Isle of Wight NHS Trust Mental Health and Learning Disabilities Division extended Senior Leadership Team, as it embarks on delivering the new Strategy for the Isle of Wight Mental Health and Learning Disability Services, “No Wrong Door”. This Strategy was co-produced with key stakeholders including service users, families and carers, staff, partner organisations including those from the third sector and commissioners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will have responsibility for the implementation of this strategy in relation to locality based Community Mental Health Team and Older Persons Community Mental Health Team, but will work extensively with other Service Manager colleagues across the Division, Trust and wider Partnership.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Whilst it is important that the post-holder is a visible, accessible leader, there will be opportunities for the post holder to work from home at regular intervals. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The post holder will have responsibility for the operational management and strategic development and leadership of their portfolio of services. They will ensure the delivery of a pathway for people using services that meet all quality, financial and operational performance targets and that these are monitored and tracked effectively. The post holder will lead, develop and manage teams within the service group portfolio to ensure the service provides high quality care for our service users.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The post holder will be required to form effective working relationships internally by working collaboratively with other service managers of different multi-disciplinary teams, and external with clinical commissioning groups, other providers and the third sector. They will also be responsible for ensuring exemplary service user, carer and family engagement across their portfolio of services, with a true ethos of co-production of services.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The post holder will be a compassionate, respectful leader, who takes full accountability for their portfolio of services, and values the contributions that all stakeholders can make.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The post holder will be required to facilitate the development of autonomous teams and individuals that are empowered, engaged and committed to continually delivering excellent care with compassion. The post holder will be an advocate for recovery.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258788", "validThrough": "2020-12-04T23:59:59+0000"}