{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-11-04T16:16:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Post 1: Fixed Term / Secondment for 12 months to cover Maternity Leave - Based at Queens Hospital Burton &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 2: Fixed Term / Secondment until 15 January 2022 to cover Internal Secondment - Based at Royal Derby Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting Fixed Term / Secondment opportunity to work at the University Hospitals of Derby and Burton NHS Foundation Trust (UHDB).&lt;/p&gt;\n&lt;p&gt;The Capital Projects Department are looking for a Senior Technical Design Advisor as part of recent changes to the department personnel. This role is a key member of the Capital Projects Team and will be responsible for supporting the Head of Capital Projects.&lt;/p&gt;\n&lt;p&gt;The Capital Projects Department is responsible for designing, implementing and project managing capital schemes on behalf of UHDB from inception through to completion - this includes aspects such as architectural, general building services, data &amp; voice installations, piped medical gas services, flooring, decoration etc.&lt;/p&gt;\n&lt;p&gt;The team liaise and work closely with all levels of the organisation, including executive and Trust Board level so we are looking for an individual who has excellent communication, negotiation and motivational skills along with all of the professional and technical aspects that this role requires.&lt;/p&gt;\n&lt;p&gt;As a team we share and uphold the organisation&#39;s values in all that we do - if you share our values and feel that you can contribute to our team along with the service we provide then we would welcome your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 15 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 25 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises; this includes Covid-19 secure areas. If you have Covid-19 related symptoms or you have been instructed to self-isolate by track and trace and have been invited for a face to face interview please request a Microsoft Teams interview. &lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Miklos Horvath - Head of Capital Projects&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Email: miklos.horvath@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: 01332 785823&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Post 1: Queen&#39;s Hospital Burton / Post 2: Royal Derby Hospital, Burton and Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Senior Technical Design Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256605", "validThrough": "2020-11-15T23:59:59+0000"}