{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:46:30+0000", "description": "&lt;p&gt;We are excited to offer an excellent opportunity for career progression with the vacancy for a Senior Therapeutic Radiographer role across the pre-treatment and treatment delivery aspect of the radiotherapy pathway. We invite applications from highly motivated, enthusiastic and experienced Therapeutic Radiographers with a specific interest in managing and leading small teams of Therapeutic radiographers and students and supporting the team leaders.&lt;/p&gt;\n&lt;p&gt;The radiotherapy team is a patient centred multi-professional and enthusiastic team including the Radiotherapy managers, Consultant Therapeutic Radiographers, Advanced Practitioners, Team Leaders, Senior Therapeutic Radiographers, Therapeutic Radiographers, Radiotherapy Nurse Practitioners, Radiotherapy Clinical Support Workers and our booking team. Macmillan has adopted the entire radiotherapy team which will provide you with excellent resources for your role, CPD opportunities and access to funding. The department is based at the Queen’s Centre at Castle Hill Hospital in Cottingham; a purpose built centre that has a range of facilities for our patients along with access to Macmillan services and our Living with and beyond team. The equipment profile of the service includes a Varian Halcyon, 3 Varian Truebeams and 2 Varian iX clinacs, all of which have IGRT capabilities, 2 Phillips CT scanners and Varian Aria software.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have excellent communication and interpersonal skills and be able to build good relationships with patients, families and colleagues within the radiotherapy service and wider MDT. The post holder must have a wide knowledge of radiotherapy localisation, treatment delivery and verification and the modalities used for radiotherapy localisation, treatment delivery and verification along with a good knowledge of future developments in radiotherapy. They must also have evidence of post graduate qualifications or working towards M level studies. They must also demonstrate excellent technical skills and experience for this role.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to ensure a high quality and safe service in the daily operational delivery of pre-treatment and treatment delivery. This includes supporting junior staff and students, the post holder will be expected to manage and motivate their small team, leading and encouraging them to develop for example enabling staff to attend CPD and participate in departmental projects. The post holder will be expected to have excellent communication with team leaders and advanced practitioner colleagues regularly so they are aware of developments and how they can be involved in projects.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates interested in applying for this opportunity are encouraged to contact Barbara Whitaker Macmillan Deputy Radiotherapy Manager, for an informal discussion before submitting their application. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Barbara.Whitaker@hey.nhs.uk&lt;span&gt; 01482 461213&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Castle Hill Hospital, Cottingham", "postalCode": "HU16 5JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7768", "longitude": "-.44499"}}, "title": "Therapy Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253528", "validThrough": "2020-11-17T23:59:59+0000"}