{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 pa inc HCA"}}, "datePosted": "2020-10-16T15:16:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Provide the very best care, for every Patient, every day…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Position: &lt;/strong&gt;Band 5 Anaesthetic Practitioner, Watford Hospital&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospitals NHS Trust provides healthcare services to a population of approximately half a million people living in West Hertfordshire and the surrounding areas. As an employer of over 4000 people we are one of the biggest employers in the area and see around one million patients each year. Every day in our hospitals, staff go to extraordinary lengths to provide exceptional care and support for our patients, as well as their families and friends.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible as one of the Band 5 Anaesthetic team members here at Watford Hospital.&lt;/p&gt;\n&lt;p&gt;The role will require enthusiasm and motivation within the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated, enthusiastic, and dynamic practitioners to join our friendly multi-disciplinary team. We have been known to offer rotational opportunities for staff in order for them to develop and/or maintain their skills.&lt;/p&gt;\n&lt;p&gt;We welcome both nurses with appropriate post registration qualifications and ODPs alike, as training and development is essential to maintain the excellent service provided therefore meeting evidence based best practice. Applicants will need to possess good interpersonal skills in order to work effectively within the existing theatre teams whilst having the ability to work under their own initiative.&lt;/p&gt;\n&lt;p&gt;Our values are as important to our workforce as they are to our patients and we are “Committed” to your development, we “Care” for all our staff’s needs and provide “Quality” support.&lt;/p&gt;\n&lt;p&gt;Opportunities in theatres include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CPD opportunities including post registration courses&lt;/li&gt;\n&lt;li&gt;Mentorship opportunities supporting the diverse professions working in the operating department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Supported induction and preceptorship programmes with skills and competency packages relevant to the specialist area of surgical practice.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tanya McIntyre&lt;/p&gt;\n&lt;p&gt;ATP Anaesthetics Watford Hospital&lt;/p&gt;\n&lt;p&gt;Theatres: 01923 217122&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 5 - Anaesthetics Practitioner - Theatres", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230813", "validThrough": "2020-11-15T23:59:59+0000"}