{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43520", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £43,520"}}, "datePosted": "2020-10-30T09:31:04+0000", "description": "&lt;p&gt;PAEDIATRIC JUNIOR CLINICAL FELLOW&lt;br /&gt;&lt;br /&gt;We are looking for Junior Clinical Fellows (previously known as SHO-tier) to come and work with us for a period of 12 months with further extension where appropriate.&lt;br /&gt;&lt;br /&gt;These are temporary fixed term posts to support the junior clinical fellow 1 in 11 rota and the successful applicants will work in a busy acute paediatric unit and level 1 neonatal unit. Currently we have 10 Junior Clinical Fellow tier doctors including 3 GPSTs, 1FP2, 5 Junior Clinical Fellows and 1 Locum Doctor.&lt;br /&gt;&lt;br /&gt;We are happy to welcome doctors who wish to just have a taster of general paediatrics prior to doing something else, or those committed to a career in the specialty. The clinical fellow post is not an approved training post. However, we strive to provide the successful applicant with the same training and educational experience as the trainees. Our Paediatric (Dewi) Ward has recently been on Welsh TV featuring in a popular series called Ward Y Plant.&lt;br /&gt;&lt;br /&gt;We expect all our doctors to actively engage in departmental educational activities and undertake audits during their time with us.&lt;br /&gt;&lt;br /&gt;We are located on the doorstep of the magnificent Snowdonia National Park and the Menai Straits. We’re only three hours from London by train, or an hour from Chester/M6 by car.&lt;br /&gt;&lt;br /&gt;If you are interested give us a call for a chat or to arrange a visit to the department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Manohar JoishyJob titleClinical Lead, Acute PaediatricsEmail addressManohar.Joishy@wales.nhs.ukTelephone number01248 384500Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Dr Manohar Joishy or Dr Mair Parry on 01248 384500.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Gwynedd, Bangor", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Paediatric Junior Clinical Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249497", "validThrough": "2020-11-29T23:59:59+0000"}