{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata per annum"}}, "datePosted": "2020-11-05T13:31:29+0000", "description": "&lt;p&gt;We currently have an exciting opportunity for a part time Band 4 qualified GDC registered Dental Nurse to work in our Prison Dental Services at HMP Swaleside. We are seeking to appoint someone who is passionate about delivering a high quality standard of care to our patients.&lt;/p&gt;\n&lt;p&gt;Our service covers Special Care &amp; Paediatric services; we also provide domiciliary care, prison dentistry and treatment under Sedation &amp; General Anaesthetic. You will be an ambassador for the service, providing patient centred and effective care is at the heart of everything we do and pride ourselves in demonstrating our values that people feel cared for, safe and confident that we are making a difference in everything we do.&lt;/p&gt;\n&lt;p&gt;This is a Permanent position for 37.5 hours (5 days).&lt;/p&gt;\n&lt;p&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognized qualification, which we will support. So if you do not have the essential qualification for the role, this may not be an automatic barrier to you being offered an interview.&lt;/p&gt;\n&lt;p&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be held on 26th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alice Leith - Dental Nurse Team Leader (Projects)&lt;/p&gt;\n&lt;p&gt;Email address: a.leith@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07584144893&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Swaleside, Isle of Sheppey", "postalCode": "ME12 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3938", "longitude": ".855035"}}, "title": "Prison Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257888", "validThrough": "2020-11-12T23:59:59+0000"}