{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-30T09:07:34+0000", "description": "&lt;h2&gt;Biomedical Scientist&lt;/h2&gt;\n&lt;p&gt;Portsmouth Hospitals UniversityNHS Trust has an exciting opportunity for a Biomedical Scientist (band 5) to join our dynamic Histopathology team at the Queen Alexandra Hospital, Portsmouth.&lt;/p&gt;\n&lt;p&gt;The Histopathology department processes in the region of 40,000 specimens per year and covers a wide range of diagnostic specialities.The laboratory has full UKAS accreditation and is located within a spacious, modern, purpose-built laboratory complex, which opened in August 2007.&lt;/p&gt;\n&lt;p&gt;We are looking for a talented, enthusiastic and motivated individual to join our dynamic team in providing a high quality, patient- focussed service&lt;/p&gt;\n&lt;p&gt;You will be working in a modern well equipped department carrying out a wide range of tasks including tissue transfer, immunohistochemistry, immunofluorescence techniques, renal biopsy work and all other aspects of routine Histology. You will support the section leads in various areas of the laboratory, assisting in the supervision and training of lower grade staff and supporting a large team of Consultant Histopathologists.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Cellular Pathology laboratory is essential.&lt;/p&gt;\n&lt;p&gt;Excellent numeracy and literacy skills, plus a focus for attention to detail and accuracy are essential. Experience of Microsoft Office, Excel and Word and confidence with IT systems is important as the role involves some data entry. Experience of supervision and training is also advantageous.&lt;/p&gt;\n&lt;p&gt;The Trust runs a low cost park and ride service for staff which is close to the hospital and there is an on-site staff gym and swimming pool for those who wish to become members.&lt;/p&gt;\n&lt;p&gt;A visit to the laboratory is welcomed – for more information please contact Charlotte Shepherd, Histopathology operational Manager via charlotte.shepherd@porthosp.nhs.uk or call 02392 286000 ext 1775.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 06/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249410", "validThrough": "2020-11-06T23:59:59+0000"}