{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "neg. &amp; competitive acc. to skills/experience."}}, "datePosted": "2020-10-28T13:19:28+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced and enthusiastic part time Practice Nurse.&lt;/p&gt;\n&lt;p&gt;We have 10,500 patients and are a dynamic, forward thinking and innovative GP training practice using EMIS web clinical system.&lt;/p&gt;\n&lt;p&gt;We are based in the beautiful market town of Great Dunmow which has fantastic transport links. Our team are very supportive and keen to facilitate training and staff development.&lt;/p&gt;\n&lt;p&gt;Our nursing team provide specialised respiratory and diabetes clinics, cytology, travel, contraception, childhood immunisations and wound management.&lt;/p&gt;\n&lt;p&gt;The salary is negotiable and competitive according to skills and experience.&lt;/p&gt;\n&lt;p&gt;This role is also being advertised on the Essex Primary Care Careers website – pleasecomplete only one application.&lt;/p&gt;\n&lt;p&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;/p&gt;\n&lt;p&gt;NO AGENCIES PLEASE&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;If you are an experienced Practice Nurse looking for an exciting new change in career then we would love to hear from you. You will have the following skills and qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing degree and experience in a General Practice setting;&lt;/li&gt;\n&lt;li&gt;Current NMC registration with an active PIN;&lt;/li&gt;\n&lt;li&gt;Fundamentals of Practice Nursing course (General Practice Nurse Foundation Programme) or equivalent experience or qualifications.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The applicant must be experienced and enthusiastic, preferably with chronic disease management skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Angel Lane Surgery are a friendly innovative dispensing practice using EMIS Web clinical system with 10500 patients.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Dunmow", "postalCode": "CM6 1AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.872", "longitude": ".362662"}}, "title": "Practice Nurse - part time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246753", "validThrough": "2020-11-11T23:59:59+0000"}