{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15784", "minValue": "15347", "unitText": "YEAR", "value": "£9.13 - £9.39 per hour"}}, "datePosted": "2020-10-20T08:09:59+0100", "description": "&lt;p&gt;&lt;strong&gt;BRAIN INJURY REHABILITATION CENTRE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Frenchay &lt;strong&gt;Brain Injury Rehabilitation&lt;/strong&gt; Centre in Bristol is the service for patients with complex neurological rehabilitation needs for the South West of England. We have 52 rehabilitation beds and offer both intensive and slower stream specialist inpatient rehabilitation for patients with brain injury and other neurological conditions. The service operates in two adjacent buildings, BIRU South (newly built in 2016) and BIRU North (fully refurbished.) The service is run by The Huntercombe Group in partnership with North Bristol NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NURSING REHABILITATION ASSISTANTS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: £16,250 - £16,690&lt;/p&gt;\n&lt;p&gt;Full time / Part time / Bank / Nights&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Today I made a real difference in helping a patient to become more independent”&lt;/em&gt; Sarah – Rehab Assistant&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Rehabilitation Assistant&lt;/strong&gt;, you will be part of a company that is understanding, strives towards excellence, is reliable and above all puts people first. Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive service change for the better.&lt;/p&gt;\n&lt;p&gt;The Frenchay Brain Injury Rehabilitation Centre is well renowned both locally and nationally as an established brain injury rehabilitation unit providing specialist in-patient rehabilitation for adults and adolescents (16+) with a traumatic or acquired brain injury.&lt;/p&gt;\n&lt;p&gt;The core aim of the service is to promote rehabilitation and recovery so that patients maximise their recovery potential and long term quality of life. The service aims to provide exceptional patient care and rehabilitation, achieving outcomes for patients that are consistently above the national average and is transforming the way we care for people with a brain injury. The Unit is a registered placement for all the UWE Undergraduate nursing programs, in addition, the nursing team continue a long established relationship with UWE collegiate staff.&lt;/p&gt;\n&lt;p&gt;We are looking for exceptional people to join our expanding Nursing Team, who have special nursing qualities and would like to make a difference to our patients’ care and recovery.&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Rehabilitation Assistant&lt;/strong&gt; role involves working as part of our dynamic nursing team, to deliver individualised nursing care to patients, implementing person-centred care plans and undertaking a broad range of nursing duties. Good communication skills, team working and a flexible approach are essential. Previous experience of working in a healthcare setting is desirable for this post. Care Certificate training offered.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Rehabilitation Assistant&lt;/strong&gt; working in our Brain Injury Rehabilitation Centre your main duties will be:-&lt;/p&gt;\n&lt;p&gt;•To assist patients with all aspects of their personal care which includes: washing, bathing, dressing, continence, mouth care and maintain patient comfort.&lt;/p&gt;\n&lt;p&gt;•Provide individualised patient centred care in accordance with the patients care plan.&lt;/p&gt;\n&lt;p&gt;•To assist patients in all aspects of their diet and fluid intake, including feeding patients&lt;/p&gt;\n&lt;p&gt;•To provide accurate verbal and written feedback to the Staff Nurses and the clinical team on patients condition and care.&lt;/p&gt;\n&lt;p&gt;To join The Huntercombe Group as a&lt;strong&gt; Rehabilitation Assistant&lt;/strong&gt; you will&lt;strong&gt;:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Have a person centred ethos, show care and compassion, empathy and a desire to make a real difference in the delivery of rehabilitation care to patients&lt;/p&gt;\n&lt;p&gt;•Be able to demonstrate initiative and creativity&lt;/p&gt;\n&lt;p&gt;•Be flexible and adaptable, regarding 7 day shift work&lt;/p&gt;\n&lt;p&gt;•Ideally have health care experience (but not essential)&lt;/p&gt;\n&lt;p&gt;•Have a legal right to work in the UK&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•A thorough induction programme tailored specifically to brain injury nursing&lt;/p&gt;\n&lt;p&gt;•A very supportive team working environment&lt;/p&gt;\n&lt;p&gt;•Regular clinical supervison&lt;/p&gt;\n&lt;p&gt;•Clear pay structure, with competitive rates&lt;/p&gt;\n&lt;p&gt;•A range of staff discounts&lt;/p&gt;\n&lt;p&gt;•Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;p&gt;The Centre is located on the outskirts of the historic &lt;strong&gt;City of Bristol&lt;/strong&gt; and is located&lt;strong&gt; just&lt;/strong&gt; off the &lt;strong&gt;M32 / M4&lt;/strong&gt;. Bristol is the gateway to the South West within easy reach of the beautiful Cornwall and Devon coastline and excellent rail links to London.&lt;/p&gt;\n&lt;p&gt;Interested? Would you like to find out more?&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please ring Pearl Griffiths&lt;/p&gt;\n&lt;p&gt;(Nurse Manager) or Jason Tovey (Deputy Nurse Manager).&lt;/p&gt;\n&lt;p&gt;on 0117 9562697.&lt;/p&gt;\n&lt;p&gt;Frenchay Brain Injury Rehabilitation Centre&lt;/p&gt;\n&lt;p&gt;Frenchay Hospital, Frenchay Park Road, Frenchay, BRISTOL. BS16 1UU&lt;/p&gt;\n&lt;p&gt;Social Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4962", "longitude": "-2.5256"}}, "title": "Rehabilitation Assistants", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233441", "validThrough": "2020-11-23T23:59:59+0000"}