{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T10:32:43+0000", "description": "&lt;p&gt;We have an exciting opportunity to expand our multi-disciplinary teams with the Staffordshire prisons. As part of this expansion weare looking for compassionate and highly skilled RMN or HCPC qualified individuals to join us. Working in prisons is both challenging and rewarding. This is an opportunity to work with some very interesting people with complex mental health needs. Working in prisons is a fantastic opportunity to make a positive difference to the lives of people who are often disadvantaged and vulnerable.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;HMP Stafford is a category C male adult prison. The prison promotes a rehabilitative culture and the Inclusion Service are recovery focussed. The team are an integrated mental health and substance misuse service, offering therapeutic interventions, in line with the Stepped Care model, which are delivered on an individual basis and within a group setting. The team work closely with prison based colleagues and the focus is on multi-agency working. The applicant would be expected to carry a caseload and have a working knowledge of the CPA framework and Mental Health Act. The prison environment can be a challenging and exciting environment to work in and therefore individual monthly supervision is offered to team members.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;There is a strong emphasis on creative approaches to engaging this population. We have strong relationships with Partner agencies to ensure a joined up approach to care which has been recognised regionally.&lt;/p&gt;\n&lt;p&gt;Successful applicants will work as part of a full multi-disciplinary and fully integrated Mental Health and Substance Misuse Service. Interventions are offered in line with a stepped care model with a single point of access for prisoners experiencing mental health or substance misuse difficulties.&lt;/p&gt;\n&lt;p&gt;As a senior Mental HealthProfessional with the team you will need to have a sound knowledge of The Mental Health Act and its application to sentenced and remand prisoners. You will need to be confident in managing a caseload of people with complex mental health difficulties and to be able to offer supervision, support and guidance to junior members of the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in this opportunity we would love to hear from you. If you are unsure about the prison environment we are happy to arrange for you to visit teams within the prisons.&lt;/p&gt;\n&lt;p&gt;The Inclusion Directorate with Midlands Partnership NHS Foundation provides Integrated Mental Health and Psychosocial teams into 10 prisons across Staffordshire and Worcestershire.&lt;/p&gt;\n&lt;p&gt;Please contact prison.mentalhealth@mpft.nhs.uk or telephone 01785 221529 if you would like to discuss further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132074.png", "name": "Inclusion", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Stafford", "postalCode": "ST163SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Mental Health Professional", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251620", "validThrough": "2020-11-23T23:59:59+0000"}