{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-27T09:30:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Post: Head of Finance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: AfC 8C / Permanent/ Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Liverpool University Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On 1st October 2019, Liverpool University Hospitals NHS Foundation Trust was created, through the merger of Aintree University Hospitals NHS Foundation Trust and Royal Liverpool and Broadgreen University Hospitals NHS Trust. The newly formed Trust is responsible for managing services at Aintree University Hospital, Broadgreen Hospital, Liverpool Dental Hospital and the Royal Liverpool University Hospital.&lt;/p&gt;\n&lt;p&gt;Bringing together a combined workforce of over 12,000 staff, the Trust has become the largest NHS employer in Merseyside and Cheshire. As well as providing general hospital services to the local population, the Trust provides a range of highly specialist services to more than two million people in the North West and beyond.&lt;/p&gt;\n&lt;p&gt;This merger has been driven by clinicians, who for a long time have recognised that a union of the Trusts will enable significant changes that will transform the way healthcare is delivered. The aim is to address the current levels of variation and fragmentation that exists between acute hospital services in Liverpool, and to ensure that all services are of the highest quality. The new Trust will also seek to influence the wider determinants of health by closer involvement in employment, housing and education, and to be part of a first class research and scientific development partnership with Higher Education and business enterprise across the city and beyond.&lt;/p&gt;\n&lt;p&gt;These changes, which will take place over the next few years, through a phased approach, building on the skills and talents of a fantastic workforce, to spread best practice, deliver innovation and provide sustainable services for patients. This will be achieved by reconfiguring services, centralised where necessary, local where possible and focusing on staff; with an ambition to be the best place for staff to train and work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Finance Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following the merger and formation of the new Finance structure an exciting opportunity has arisen to work within the finance team as the Head of Finance for Contracting, Income, PLICs and Costing . The successful candidate will report directly to the Deputy Director of Finance and will work closely with clinical and operational colleagues, and will link in closely with senior colleagues across other areas of the finance structure.&lt;/p&gt;\n&lt;p&gt;As a department we strive to be a world class finance team and be the employer of choice for finance staff. The successful candidate will support the development this vision and ensure our Trust receives the best financial services and support possible. To do this they will; work to the highest professional standards, add value in all that they do, deliver stakeholder satisfaction and create an environment ensuring we are a great place to work, maximising staff potential.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role, please contact&lt;/p&gt;\n&lt;p&gt;Jim Davies (Jim.Davies@liverpoolft.nhs.uk / 0151-706 - 4600)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJim DaviesJob titleDeputy Director of FinanceEmail addressjim.davies@liverpoolft.nhs.ukTelephone number01517064600Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal discussions welcomed.&lt;/p&gt;\n&lt;p&gt;Given current restriction in place as a result of COVID-19, site visits will not be possible - but happy to discuss role by phone or Microsoft Teams.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool University Hospitals NHS FT, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Head of Finance (Contracting / Income / PLICs &amp; Costing)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243823", "validThrough": "2020-11-08T23:59:59+0000"}