{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-03T13:31:14+0000", "description": "&lt;p&gt;A vacancy has arisen within our Estates and Facilities Services Directorate, where our teams are committed to the provision of safe and effective patient care working alongside all of our colleagues to provide excellent Facilities for our patients, staff and visitors. We are looking for individuals who can demonstrate a positive “can do” attitude to work, and can demonstrate the qualities required of a caring professional working within the NHS. We are recruiting for caring, positive, and dependable people to join our team in the role of a deep clean operative.&lt;/p&gt;\n&lt;p&gt;Our Deep Clean Assistants are an integral part of the Hospitals operations, working on Wards and Departments providing all of our deep cleaning responsibilities. The role is part of a wider team responsible for excellent standards of cleanliness, food hygiene and environmental safety. A typical day for a deep clean assistant would include working to a programme of deep cleaning all areas of the hospital site during the course of the year, in addition to any ad hoc additional tasks that may arise during the working day. The activities will include wet mopping, vacuuming, emptying bins, replenishing supplies, cleaning fixtures, furniture and toilet/bathroom areas, in addition to removal and cleaning of light fittings, radiators, fans etc.&lt;/p&gt;\n&lt;p&gt;Whilst a comprehensive training package will give you the skills and knowledge to work effectively as a deep clean assistant, we want to learn from your application how you can meet the minimum of the essential criteria in our person specification, and perhaps even exceed this minimum standard. We support the continuous development of our staff so regular refreshers of training take place. Both developmental and mandatory will be required, which on occasion may fall during non-working days due to shift patterns, for which you will receive either time of in lieu or additional pay. And finally, our environment can be often placed under operational challenge which requires some flexibility, team working and a joined working approach to ensure our patients receive the best care possible, so we would also be interested in understanding how you might be able to help us deliver services in such an environment.&lt;/p&gt;\n&lt;p&gt;The right candidate would be working 37.5 hours on a Bank contract. Working the hours of 06:00 – 14:00 Monday - Friday within our Hospital Support Services Department. Some weekend work may also be required dependent on hospital site requirements. At times the team may be required to work across Northern Lincolnshire &amp; Goole Foundation Trust sites, transport will be provided. The requirement to be flexible to this post is essential to meet the needs of the client base.&lt;/p&gt;\n&lt;p&gt;Candidates will be asked to attend an interview which will consist of scenario testing, multi choice questionnaire and interview process. Due to interview timescales we will not be in a position to re-arrange a date.&lt;/p&gt;\n&lt;p&gt;Once appointed you will access the many benefits of working for the NHS including an excellent pensions scheme, increasing annual leave allowance of up to 41 days pro rata per annum (including bank holidays) once you have completed 10 years’ service, multiple discount schemes and the opportunity to develop and grow your skills within the NHS through our excellent training and development schemes.&lt;/p&gt;\n&lt;p&gt;Additionally we recommend applicants submit their on line application at the earliest opportunity as this vacancy will close once we receive 30 applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracey Barnett/Vicki Matthews, Supervisors&lt;/p&gt;\n&lt;p&gt;Telephone: 03033 306196&lt;/p&gt;\n&lt;p&gt;Email: &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;vicki.matthews@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Email:&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt; tracey.barnett1@nhs.net&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Bank Deep Clean Assistant - Scuthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254159", "validThrough": "2020-11-17T23:59:59+0000"}