{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 £24,907-£30,615 (Band 5) £31,365"}}, "datePosted": "2020-10-29T15:31:04+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a band 5 or 6 Midwife for a permanent contract within East Cheshire NHS Trust. We are looking for enthusiastic and motivated Midwives to join our Maternity Team. We are focused on Continuity of Care for our women in East Cheshire in line with the Better Births agenda and are implementing team community and birth care for all our women. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;However due to current constraints of covid-19 our inpatient and birth care is currently provided in our host sites at Mid Cheshire foundation trust; Leighton, St Marys; Wythenshawe and Stockport foundation trust; Stepping Hill hospital. This provides an excellent opportunity for midwives to obtain varied experience in a range of low and high risk settings at host sites. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;When our inpatient Maternity services return we will be returning full obstetric and midwifery led services to all women in East Cheshire providing continuity of care. Come and join our friendly and supportive team and obtain excellent midwifery experience and the satisfaction of trusting close relationships with the women in your care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be provided with an extensive preceptorship package to attain progression to band 6. Midwives will be rotated throughout the service providing care in all areas to gain further competency to band 6.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Band 6 midwives are welcome to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are proud of our achievements at Macclesfield Maternity Unit. As a valued member of our maternity unit you will be part of an innovative team and will help us to excel further to deliver our Trust objectives and values.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Travel is an essential part of this role, please demonstrate on your application form how you would meet this requirement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: various hours are available&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Louise Yusuf Job title Team Leader Email address louiseyusuf@nhs.net Telephone number 01625 663044&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Team Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248877", "validThrough": "2020-11-12T23:59:59+0000"}