{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-09T15:16:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Queen’s Hospital Burton &amp; Royal Derby Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in General Paediatrics with an interest in Diabetes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is full time consultant appointment for University Hospitals of Derby and Burton NHS Foundation Trust based at Queen’s Hospital Burton. We are looking for a General Paediatrician with a special interest in diabetes to join our busy team, which includes a Specialty Doctor, Nurse Specialists, Dietician and a Clinical Psychologist. The service is well established including attendance at peer review meetings for training and is supported by tertiary Consultants within the network.&lt;/p&gt;\n&lt;p&gt;Applicants must hold MBBS/MBChB or an equivalent medical qualification, along with full GMC registration. Have CCT or within 6 months of attaining CCT at time of interview or entry onto GMC Specialist Register by time of interview. Applicants must have experience within Diabetes.&lt;/p&gt;\n&lt;p&gt;This post will be based at Queen’s Hospital Burton, where you will join a paediatric team of 8 Consultant Paediatricians in the provision of a comprehensive acute paediatric services to a general population of over 360,000 people. This postholder will also be expected to work at the Royal Derby Hospital where you will be part of a large paediatric team serving a centralised population of over half a million.&lt;/p&gt;\n&lt;p&gt;Because of its strategic central location, Burton-Upon-Trent has excellent rail and road links to neighbouring large cities in England. Burton has a network of good schools and Peak District is within easy reach for day trips. East Midlands and Birmingham airports are also in close proximity to Burton&lt;/p&gt;\n&lt;p&gt;The Trust provides a wide range of services and has a number of outreach and community based clinics, all of which are supported by a dedicated team of clinical staff. The Trust recognises the importance of working in the community, providing patients with the choice to access services in a setting that may be more amenable or comfortable for them. Since acquiring the Samuel Johnson Community Hospital in Lichfield, the Sir Robert Peel Community Hospital in Tamworth and the Midlands NHS Treatment Centre based on the Queen’s Hospital acute site in 2011, the Trust has continued to develop and reconfigure the services provided at these facilities in order to meet the needs of the local population.&lt;/p&gt;\n&lt;p&gt;The Trust also provides a full complement of Accident and Emergency, outpatient and direct access services. All specialties are supported by a comprehensive range of clinical services in therapies, pharmacy, pathology, and radiology. In addition, we provide facilities to other NHS providers for specialties such as orthopaedics, phlebotomy and obstetrics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE WORK OF THE DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Inpatient Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Continuity of consultant care is provided by ‘service week’. The paediatric ward is staffed for 8 beds and is sometimes shared with surgical specialities. In addition, a 12 bedded Paediatric Assessment Unit is co-located with an isolation room plus a HDU stabilisation space and is staffed between the hours of 9:30am and 10:00pm.&lt;/p&gt;\n&lt;p&gt;The Local Neonatal Unit has 8 + 1 cots and the delivery rate is between 3500-4000/year. Babies less than 29 weeks’ gestation are transferred out. When on call this post will provide on call for the neonatal service as well as the general paediatric unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Outpatient Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is a designated paediatric out-patient clinic area with 6 clinic rooms. Visiting specialists (Cardiology, Genetics, Endocrinology, Paediatric Surgery and Urology) conduct regular outreach clinics within the department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We welcome discussion with interested candidates and would be pleased to arrange a visit to the department for you. For further details, an informal discussion or to arrange a visit regarding this post please contact the secretary of Dr Gisela Robinson, Clinical Director on 01332 786808.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burton, Burton", "postalCode": "DE130RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Consultant Paediatrician with an interest in Diabetes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220833", "validThrough": "2020-11-06T23:59:59+0000"}