{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42000", "minValue": "35100", "unitText": "YEAR", "value": "£35,100 - 42000 per annum"}}, "datePosted": "2020-11-06T16:05:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Please Note:&lt;/strong&gt;This role may require some travel to our North Hub (Leeds) and Client Sites&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about Learning and Development? Would you like to be involved in building a compelling Learning and Development programme for our diverse clinical and non-clinical flexible workforce?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;It is an exciting time for NHSP, as our new leadership team drives us towards our ambition of becoming the workforce solutions provider to the NHS.&lt;/p&gt;\n&lt;p&gt;Flexible workers are an integral part of the NHS workforce and we are looking for an experienced Learning Manager to support their growth through a process of learning and development at a critical moment in the NHS. - Under the support and guidance of a new Deputy Chief Nurse.&lt;/p&gt;\n&lt;p&gt;You will be responsible for establishing approaches that will enable NHSP Bank Members to be confident and competent in the latest practice within their specialities, and for encouraging continual upskilling. This will include playing a key role in developing the flexible worker’sleadership skills which are required to effectively lead and work across all systems for both existing and future leaders in the region.&lt;/p&gt;\n&lt;p&gt;This role is pivotal in improving patient care, and staff experience through the development of exceptional and inclusive leaders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will need to have demonstrableknowledge of learning and development in a healthcare settingand in-depth knowledge and application of the latest clinical learning and development pathways in a fast-past organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be need to be an independent thinker who can always look at all processes from a clinical lens to ensure high quality service and demonstrate that you are enthusiastic, highly motivated, well organised, and able to work both independently and as part of a team. – You will be proactively supported to develop in a growing and innovative learning and development team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Skills/Responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualified to a degree level or Equivalent&lt;/li&gt;\n&lt;li&gt;Knowledge of learning and development in a healthcare&lt;/li&gt;\n&lt;li&gt;Excellent stakeholder management skills and the ability to build relationships at all levels&lt;/li&gt;\n&lt;li&gt;Experience of working in a fast-paced team/organisation&lt;/li&gt;\n&lt;li&gt;Strategic approach to problem solving&lt;/li&gt;\n&lt;li&gt;Demonstrabletheoretical &amp; specialist knowledge that meets the training and development requirements of the complex nature of the healthcare sector workforce&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone who is highly creative, flexible, and passionate about people and learning with outstanding organisation skillsto make a real difference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Corporate Staff", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120988"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel Hempstead or Tingley", "postalCode": "HP2 4TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7556", "longitude": "-.425633"}}, "title": "Learning &amp; Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260524", "validThrough": "2020-11-20T23:59:59+0000"}