{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-20T10:17:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced band 5 or a current band 6 looking to progress and enhance your career?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Therapies Service currently has an exciting opportunity for 2 full time Band 6 Speech and Language Therapists to join our dynamic, friendly and experienced team.&lt;/p&gt;\n&lt;p&gt;The post will include opportunities to work within our early years service, mainstream schools service and within our clinic based service for children with speech sound difficulties. We work creatively with parents and within settings to support children to develop their speech, language and communication skills and achieve their potential. We pride ourselves on our strong working relationships with parents, education staff, including Specialist Teachers and Educational Psychologists. We offer a range of training packages to enable staff and parents to support children / young people to develop their speech, language and communication skills at a universal and targeted level. We also provide specialist assessment and intervention packages.&lt;/p&gt;\n&lt;p&gt;Our service delivery is based on well-established Care Pathways which have been developed by our Clinical Leads and reflect current evidence based practice. All staff have access to support from Clinical Leads in a range of specialist areas, in addition to regular clinical supervision and line management. We offer on-going CPD, including in house training from Clinical Leads (e.g. Speech Sound Disorders, DLD, ASD, Bilingualism, Voice, Dysfluency, SM), new-starter workshops, shadowing opportunities and external training as appropriate to your role.&lt;/p&gt;\n&lt;p&gt;You will be working closely with other SLTs and Therapy Assistants within both a clinical and educational context. We work closely with our Team Physiotherapists, Occupational Therapists and Specialist Nurses as appropriate. We have strong links with a range of other services encompassing Community Paediatrics, Audiology and CAMHS.&lt;/p&gt;\n&lt;p&gt;As a location, West Kent comprises both towns and countryside with easy access to London and railway/motorway networks.&lt;/p&gt;\n&lt;p&gt;There are 2 full time posts available (2x37.5 hours per week), however part time, flexible working and developing posts will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Planned Interview date: 27th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Catherine Allison - Team Lead&lt;/p&gt;\n&lt;p&gt;Email: catherine.allison@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: 01622 742333&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Anthony Wright – a.wright27@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Maria-Loukia Bratsou - marialoukia.bratsou@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Kent, West Kent", "postalCode": "TN11 0NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1781", "longitude": ".273493"}}, "title": "Children&#39;s Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233803", "validThrough": "2020-11-16T23:59:59+0000"}