{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29000", "minValue": "27000", "unitText": "YEAR", "value": "£27,000 - £29,000 per annum"}}, "datePosted": "2020-10-14T10:47:04+0100", "description": "&lt;p&gt;Are you?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;A driven and dynamic Nurse?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;An experienced RMN or wanting to return to the profession after a career break?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Wanting to make a difference to someone’s life?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Ready for a new challenge?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Wanting to work with the best nurses in the UK?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you’ve answered yes to the above then we WANT to talk to you!&lt;/p&gt;\n&lt;p&gt;The Priory wants you to become part of something special&lt;/p&gt;\n&lt;p&gt;We are at the forefront of our field and we are dedicated to providing the highest quality of care to our patients and the only way to do that is by investing in our extraordinary colleagues who work for us. We are looking for people to join our team who are rewarded by seeing their patients turn a corner after a demanding journey to recovery.&lt;/p&gt;\n&lt;p&gt;About our Priory Hospital&lt;/p&gt;\n&lt;p&gt;Job Advert Location Description&lt;/p&gt;\n&lt;p&gt;Priory Hospital Hemel Hempstead offers a safe and supportive complex care and rehabilitation service for male and female service users with enduring mental health problems.The 34 bedded locked facility is split into three services and gender specific wards and has a range of facilities available on site.&lt;/p&gt;\n&lt;p&gt;Our consultant led multidisciplinary team offer safe and supportive rehabilitation, aiming to work collaboratively with our service users to provide the best quality care, improve the quality of their lives and help them achieve the highest level of independence and dignity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nurse Careers @ Priory Group&lt;/p&gt;\n&lt;p&gt;We offer consistent support, training and professional development and we look to ensure that our Nurses do what they love..&lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;What we’d like to offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent salary&lt;/li&gt;\n&lt;li&gt;Many benefits in line with the NHS&lt;/li&gt;\n&lt;li&gt;Working with a dedicated multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;li&gt;Flexible benefits including reduced rates and access to new schemes including gym membership, IT technology (laptops / tablets / smartphones) and private healthcare&lt;/li&gt;\n&lt;li&gt;Access to development opportunities including:&lt;/li&gt;\n&lt;li&gt;Sponsorship of professional qualifications through our Individual Professional Development (IPD) panel&lt;/li&gt;\n&lt;li&gt;Improved CPD application &amp; panel process&lt;/li&gt;\n&lt;li&gt;£250 Contribution towards CPD&lt;/li&gt;\n&lt;li&gt;Leadership &amp; management development&lt;/li&gt;\n&lt;li&gt;Support with your Revalidation&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Long service award&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Find out more about a career with Priory and hear from some of our nurses at our website.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Feldon, Hertfordshire", "postalCode": "HP3 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7324", "longitude": "-.498062"}}, "title": "Registered Mental Health Nurse - RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225806", "validThrough": "2020-11-13T23:59:59+0000"}