{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-11-05T13:31:31+0000", "description": "&lt;p&gt;This is a pivotal role that will be responsible for part of our recruitment team. You will need to be extremely well organised, work in a methodical manner and have relevant recruitment experience along with staff management. Any advert writing expertise would be desirable. &lt;br /&gt;&lt;br /&gt;You will be highly professional, with a customer-centred, problem solving approach, confident communicator with the ability to establish and maintain excellent working relationships with a wide range of colleagues.&lt;/p&gt;\n&lt;p&gt;A flexible and pragmatic approach to your work and exceptional organisational skills that will enable you to manage a varied workload, with competing priorities and deadlines, is also key success in this role. &lt;br /&gt;&lt;br /&gt;In return we are committed to providing on-going support, training and development and the opportunity to learn from experienced HR practitioners.&lt;/p&gt;\n&lt;p&gt;For non-NHS applicants, starting salary will be based on number of years equivalent experience in a similar role.&lt;/p&gt;\n&lt;p&gt;Provisional virtual interview date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;Also note that those who are successfully shortlisted will be asked to a complete an unseen exercise. Those who are successful will be invited to the virtual interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Shereen Ratnabal, Job title: Recruitment Manager, Email address: shereen.ratnabal@nhs.net (no CV&#39;s please)&lt;/p&gt;\n&lt;p&gt;Alternatively email: andrew.sims4@nhs.net or miriam.bone1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Senior Recruitment Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257889", "validThrough": "2020-11-11T23:59:59+0000"}