{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-08T15:01:09+0100", "description": "&lt;p&gt;We have 10 Qualified Inpatient Nursing Associate Posts across the Acute Care Group at St Martins Hospital, Canterbury, Priority House, Maidstone and Little brook Hospital, Dartford.&lt;/p&gt;\n&lt;p&gt;This post is a great development opportunity for a Band 4 Nursing Associate looking to gain experience and insight into working within the acute mental health wards within the Acute Care Group. You may be currently working in other areas of nursing practice and this would be a good opportunity to develop your nursing skills in mental heath practice.&lt;/p&gt;\n&lt;p&gt;The Nursing Associate brings a variety of mental health and physical heath nursing skills to the team, working independently under the leadership of registered nurses, providing and delivering all aspects of the nursing care. As a Band 4 Nursing Associate, you will be supported to develop your nursing skills and participate in delivering nursing interventions in the MDT.&lt;/p&gt;\n&lt;p&gt;On starting your new position you will join the Preceptorship Action Learning Set and Acute Preceptorship programme. There will also be opportunities to develop your competencies and career which can include a pathway to become a registered nurse. We work closely with two Universities to offer this.&lt;/p&gt;\n&lt;p&gt;If you are seeking a new challenge and interested in becoming part of this forward thinking and innovative Trust then we want to talk to you.&lt;/p&gt;\n&lt;p&gt;What we can offer you:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Career development with our comprehensive range of training &amp; development opportunities to enhance your skills&lt;/li&gt;\n&lt;li&gt;Strong Supportive Management committed to provide 1-2-1 support to advance personal development.&lt;/li&gt;\n&lt;li&gt;Car Lease Scheme opens to all staff&lt;/li&gt;\n&lt;li&gt;Staff discounts for employees and their families&lt;/li&gt;\n&lt;li&gt;Relocation Support if you are moving to the area dependent on your circumstances&lt;/li&gt;\n&lt;li&gt;35 days paid holiday, increasing to 41 days after 10 years’ service&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;Child Care Vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We take pride in our services – which are underpinned by our values: - Respect - Openness - Accountability - Working together - Innovation - Excellence&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sojan Joseph, West Kent Inpatient Clinical Service Manager / Matron on&lt;/p&gt;\n&lt;p&gt;01622 725000 ext 6223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priority House, Maidstone", "postalCode": "ME16 9PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2734", "longitude": ".486413"}}, "title": "Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218799", "validThrough": "2020-11-16T23:59:59+0000"}