{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 per annum"}}, "datePosted": "2020-11-05T11:46:25+0000", "description": "&lt;p&gt;&lt;strong&gt;All staff are eligible to apply however staff must ensure they have the permission for a secondment application from their substantive line manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for four Programme Managers to join the Directorate of Education and Quality within Health Education England on secondment for up to 12 months.&lt;/p&gt;\n&lt;p&gt;The four posts will sit in the following portfolios:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Allied Health Professions and Advancing Practice&lt;/li&gt;\n&lt;li&gt;Medical Recruitment&lt;/li&gt;\n&lt;li&gt;Education Reform x2&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Each role will support a programme of work underpinned by the need for a flexible, productive and affordable healthcare workforce that meets the needs of patients, reflecting evolving care pathways and the values set out in the NHS Constitution, NHS Long Term Plan and NHS Interim People Plan.&lt;/p&gt;\n&lt;p&gt;The post holder will coordinate a range of projects, from proof of concept work to integrating emerging workstreams with established programmes. A number of projects are already in delivery, with further proposals in development and the post holder will work closely with existing professional networks.&lt;/p&gt;\n&lt;p&gt;To be successful in the role, the individual will need to utilise formal project management principles and methodology in the delivery and governance of the programme, working closely with the programme leads, project managers, local and regional leads and workforce groups across the system.&lt;/p&gt;\n&lt;p&gt;Our Core Values are that everyone feels valued and respected and are included and involved in everything that affects them; are trusted to make decisions with clear reasons in order to be empowered to deliver; are committed to clear, effective communication, which is transparent and open when sharing information; takes pride and has integrity in everything we do and recognises that everyone has a significant contribution whilst taking personal responsibility and accountability for actions and behaviours.&lt;/p&gt;\n&lt;p&gt;The posts are offered at any HEE office, however remote working will be the default position during the current COVID 19 pandemic. This will be continually reviewed in line with HEE policy. Please note there will be an assessment held before the interview for this Post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will commence at the bottom of Band 8b with a full-time starting salary of £53,168, with a pay step increase after 5 years’ service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For posts based in Inner London, the above salaries will include the additional supplement of 20% of basic salary, subject to a minimum payment of £4,473 per annum and a maximum payment of £6,890 per annum. This is offered in accordance with NHS Terms and Conditions and is based on office location.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;All staff are eligible to apply however staff must ensure they have the permission for a secondment application from their substantive line manager.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the advert early once a sufficient number of applications have been received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ria Corey&lt;/p&gt;\n&lt;p&gt;Ria.corey@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;07920 834876&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "LS1 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7988", "longitude": "-1.55967"}}, "title": "Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257509", "validThrough": "2020-11-19T23:59:59+0000"}