{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-30T16:19:34+0000", "description": "&lt;p&gt;We are seeking recruit three speciality doctors in Anaesthesia and Critical Care to join our dynamic, welcoming team at The Rotherham Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post-holders will work alongside the existing team of 26 Consultants, 11 other Specialty Doctors and Associate Specialists and five clinical fellows as well as 12 doctors in training from Health Education England (HEE).&lt;/p&gt;\n&lt;p&gt;The Anaesthetic and Critical Care Department serves a modern and recently expanded theatre and day surgery complex with adjacent ITU and HDU facilities. The Department has an excellent reputation and enthusiasm for Undergraduate and Postgraduate teaching and would support applicants if there was a specific teaching interest. The Trust has Associate Teaching Hospital status within the University of Sheffield Medical School.&lt;/p&gt;\n&lt;p&gt;Surgical Specialties in the Trust include: General Surgery (including Laparoscopic Colorectal Surgery), Orthopaedics and Trauma, Gynaecology, Urology, ENT, Maxillofacial, Breast Surgery, Ophthalmology and Obstetrics. We run a busy pre-operative assessment service including cardiopulmonary exercise testing. We specialise in day case surgery (lead by the BADS president) and regional anaesthesia.&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit consists of six Funded ITU beds and eight funded HDU beds with plans to expand in accordance with demands upon the service. There are currently eight consultants with a special interest in Critical Care Medicine. We have also appointed an Associate Specialist in Intensive care to support the expanding department. We have FICE echo accreditation.&lt;/p&gt;\n&lt;p&gt;There are many research opportunities within the Anaesthetic department and the trust as a whole. A consultant colleague is a professor with an active research portfolio. Successful applicants will be encouraged to have an active part in furthering projects and Quality Improvements within the department.&lt;/p&gt;\n&lt;p&gt;We have a wealth of managerial experience within the department with colleagues contributing to many senior roles within the Trust.&lt;/p&gt;\n&lt;p&gt;Our SAS colleagues occupy senior roles within the Anaesthetic Department and the wider Trust and are valued members of our permanent team. We would welcome motivated and talented clinicians to join our team and provide support and opportunities for career development.&lt;/p&gt;\n&lt;p&gt;Any doctor who is unable to work full-time may be eligible for the post; if such a person is appointed, modification of the job content will be discussed on an individual basis with the Chief Executive, Medical Director and Clinical Lead.&lt;/p&gt;\n&lt;p&gt;The job plan may be modified in discussion with the Clinical Lead and Service Organiser.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;To visit the department contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the department. For an informal discussion, more information about the posts or to arrange a visit, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Katy Shuker Clinical Lead for Anaesthesia: 01709 424550 (sec)&lt;/p&gt;\n&lt;p&gt;Katy.shuker@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Mark Smith Clinical Lead for Critical Care : 01709 424550 (sec)&lt;/p&gt;\n&lt;p&gt;Mark.smith85@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Alison Colhoun Service organiser : 01709 424550 (sec)&lt;/p&gt;\n&lt;p&gt;Alison.colhoun@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham Hospital", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Specialty Doctor in Anaesthesia and Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250932", "validThrough": "2020-11-20T23:59:59+0000"}