{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-29T11:59:41+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for a motivated, determined and enthusiastic Physiotherapist to join our Orthopaedic Team here at Northern Devon Healthcare Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will provide specialist advice, assessment and treatments to a range of orthopaedic patients. We cover an elective ward, day surgery unit, trauma ward, paediatrics and Orthopaedic Supported Discharge (OSD) in the community.&lt;/p&gt;\n&lt;p&gt;Our team currently celebrate having the shortest length of stay for femoral fractures in England (NHFD) and this is due to our strong integrated MDT working ethos and the intense OSD service that we can provide on discharge.&lt;/p&gt;\n&lt;p&gt;We are a trauma unit for the Major Trauma Centres in Derriford and Bristol; we have close working links with them through the major trauma network. Our major trauma (TARN) patients with an ISS&gt;15 are seen in our OSD service and we offer hydrotherapy and gym sessions as part of their rehabilitation.&lt;/p&gt;\n&lt;p&gt;We have been very proactive with our enhanced recovery after surgery in elective patients and we are now looking at discharging patient’s home on the day of surgery, providing therapy in their own homes under the OSD service.&lt;/p&gt;\n&lt;p&gt;The Therapy service at NDDH is an expanding, forward thinking and highly regarded service and this post offers excellent personal and professional development opportunities within an established and supportive team.&lt;/p&gt;\n&lt;p&gt;The hours for this post are 37.5 per week.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Alexa Coyle or Penny Palmer on the below details.&lt;/p&gt;\n&lt;p&gt;Contact Email Address: alexacoyle@nhs.net&lt;/p&gt;\n&lt;p&gt;Reviewer Email: pennypalmer@nhs.net&lt;/p&gt;\n&lt;p&gt;Contact Telephone Number: 01271 322577&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** As this post is in a shortage occupation code it qualifies for the Trust’s Recommend a Friend Scheme, please find further information on the attached link**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 11/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Orthopaedic Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248207", "validThrough": "2020-11-11T23:59:59+0000"}