{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17936", "minValue": "17936", "unitText": "YEAR", "value": "£10.67 per hour"}}, "datePosted": "2020-10-29T08:21:12+0000", "description": "&lt;p&gt;&lt;span&gt;Granville Lodge, part of the Huntercombe Group is a 9 bedded residential home close to the centre of Hartlepool for children and young people who require a high level of specialist care due to physical and learning disabilities due to conditions such as Cerebral Palsy and Epilepsy.&lt;br /&gt;We also welcome Children and Young People who stay with us for short breaks to provide respite. We encourage and promote lots of activities and trips out with our young people to ensure that they get a chance to have fun and encounter different experiences; we aim to replicate a family environment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;We are recruiting a Team Leader to support the Deputy and Registered Manager in the running of the home via shift leading and to ensure that all quality standards are maintained and we comply at all times with OFSTED regulations. &lt;/span&gt; &lt;span&gt;&lt;br /&gt;To be considered for this opportunity you must have:&lt;/span&gt; &lt;span&gt;&lt;br /&gt;• Relevant experience (min. 1 years) working within a care role, ideally within a Learning Disabilities/PMLD environment.&lt;br /&gt;• Level 3 NVQ in Residential Childcare or Children’s Workforce (or equivalent)&lt;br /&gt;• Experience of leading, coaching and mentoring a team and ensuring that relevant Codes of Conduct are upheld.&lt;br /&gt;• Competent IT skills, mainly MS Office&lt;/span&gt; &lt;span&gt;&lt;br /&gt;The team leader will work a minimum of 22.5 hours per week on a shift basis to include weekends and due to the nature of the role, flexibility is required to ensure that the home runs smoothly and safely. The exact working pattern will be negotiated with the successful candidate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;On completion of 3 months membership of the Flexi Bank arrangements you may automatically be enrolled into NEST Occupational Pension Scheme dependent upon your earnings.&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartlepool", "postalCode": "TS26 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6897", "longitude": "-1.23084"}}, "title": "Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247637", "validThrough": "2020-11-30T23:59:59+0000"}