{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T08:16:34+0000", "description": "&lt;p&gt;An exciting opportunity for a mental health nurse has arisen to join our innovative Community Mental Health Team based in the Staffordshire Moorlands. You will be based at the Ashcombe Centre in Cheddleton and the working hours are Monday to Friday from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;You will be expected to be highly motivated, enthusiastic with excellent communication skills and capable of working in an independent manner within a small team. If successful, you will be working to a community locality working model with GP’s, other mental health services and the wider primary care teams across the area.&lt;/p&gt;\n&lt;p&gt;You will need to have a core RMN qualification.&lt;/p&gt;\n&lt;p&gt;Our community mental health team is made up of a vibrant and supportive multi-disciplinary team. We aim to support our staff development with lots of opportunities to develop your skills and learning. There will be opportunities to lead on projects, support research and quality improvements. This is an exciting time for our team as we continuously develop more effective therapy based pathways, with a focus on recovery for our service users.&lt;/p&gt;\n&lt;p&gt;You will work alongside our current mental health nurses and occupational therapists to develop these group and individual recovery focused pathways.&lt;/p&gt;\n&lt;p&gt;Our Trust is on an incredible journey of innovation and we’d like you to be part of it. To excel, you will be an enthusiastic, caring and compassionate registered professional who is looking to work within a Trust that is ambitious to perform well and has been told by the CQC that it is the fastest improving mental health trust in the Country.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie BeardmoreEmail addressdebbie.beardmore@combined.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Ashcombe Centre, Stoke-on-Trent", "postalCode": "ST13 7ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0742", "longitude": "-2.04124"}}, "title": "Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253144", "validThrough": "2020-11-17T23:59:59+0000"}