{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Very Competitive"}}, "datePosted": "2020-10-14T13:37:19+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrists&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Northampton&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Full Time or Part Time&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Packages competitive depending on experience&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You can achieve more at St Andrew’s Healthcare&lt;/strong&gt;&lt;br /&gt;A top 20 UK charity, St Andrew’s is a unique provider of specialist care in mental health and learning disability. We aspire to deliver truly world class, holistic services within our outstanding, modern facilities. Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services. We are currently transforming the Charity to deliver ‘Value Based Healthcare’ which will ensure our patients consistently get the best possible outcomes and local teams gain more control and responsibility.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are currently recruiting within the charity for Consultant Psychiatrists and can consider people who have an interest in working in services such as Learning Disability, Autism (ASD), CAMHS, Forensics, PICU, Older Age Adults or Neuropsychiatry.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The services in Northampton have exciting opportunities for passionate Consultant Psychiatrists to develop and strengthen their experience working with patients in secure care settings and the chance to develop research and clinical ideas. This services are forward-thinking, open to new ideas and a holistic approach is taken to patient care and treatment.&lt;/p&gt;\n&lt;p&gt;If you would like to be part of working with an innovative and dynamic team; be able to develop and deliver up to date treatments; and work in a supportive environment then this is the place for you! This will be a personally and professionally rewarding role. The post-holder will be able to undertake non-clinical activities of interest e.g. research, teaching, governance and management - in an innovative way, and influence the direction of services in order for them to attain the best outcomes for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will lead a multi-disciplinary team and oversee the management of patients with often complex needs.You will be able to promote innovation and improvement of services and there will also be a strong research and teaching element to the role. With scope to develop your specialist interests and grow your remit and responsibilities, we will actively encourage you to be a leader nationally in mental health and influence the future direction of services.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who wants a role where they have the autonomy to make decisions that will help improve patient care and outcomes and has a passion about transforming care. Someone who wants to join an organisation and be a leader of a team who also shares this passion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are extremely proud to empower the careers of our medical professionals, and our Executive Medical Director and all of our Clinical Directors have grown and developed into their current roles within the Charity&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We also support a number of our Consultant Psychiatrists through an Executive MBA programme at some of the most prestigious business schools in the country. There are also opportunities to attend our regular internal CPD events and for you to develop a medico-legal out-patient practice as part of the St Andrew&#39;s Consultancy Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will lead a full MDT and help shape services further through strategic decision-making and improvement projects whilst having support from a team of Junior Doctors and MDT specialists. You will also be able to undertake research projects as part of St Andrew&#39;s commitment to innovation and world-class care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have MRCPsych or equivalent, a CCT in Learning Disability, Child &amp; Adolescent Psychiatry, Old Age Psychiatry, Forensic Psychiatry or General Adult Psychiatry.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details or to discuss further (even for an informal conversation) please contact or James Farrelly 01604 616624 or jcfarrelly@standrew.co.uk&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why Choose St Andrew’s?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;A tailored comprehensive induction programme&lt;/li&gt;\n&lt;li&gt;Medical indemnity cover&lt;/li&gt;\n&lt;li&gt;Supportive working environment&lt;/li&gt;\n&lt;li&gt;Huge opportunities for Continuing Professional Development with regular onsite educational &amp; training events&lt;/li&gt;\n&lt;li&gt;Autonomy to make decisions to improve patient outcomes&lt;/li&gt;\n&lt;li&gt;Relocation allowance available (subject to status)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a charity, our purpose is to embed value based healthcare, allowing us to achieve the best possible outcomes and experiences of the people in our care. We have a responsibility to educate the next generation of professionals and to innovate - researching new treatments, therapies and environments to achieve better outcomes for our patients.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Consultant Psychiatrists - Northampton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226487", "validThrough": "2020-11-08T23:59:59+0000"}