{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T11:46:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Area:&lt;/strong&gt; Taunton, Minehead, Exmoor&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is seeking to appoint a Consultant Psychiatrist in Older Persons Mental Health (OPMH) to join the Community Mental Health Teams and support patients in the Taunton, Minehead &amp; Exmoor areas, in both Community Mental Health and Memory Services.&lt;/p&gt;\n&lt;p&gt;This newly created Consultant opportunity offers an additional (optional) SPA to develop an area of special interest in research, leadership or medical education. This role will be bespoke for each applicant, and will include mentoring, coaching and training as decided during the job application process and within the individuals’ job plan.&lt;/p&gt;\n&lt;p&gt;There will be extra funding available to pursue this enhanced development, and the pathway will be adapted as the individual progresses through their career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver assessment, diagnosis and treatment of mental and physical health needs of community patient’s for the defined area.&lt;/li&gt;\n&lt;li&gt;Responsible Clinician for patients subject to a compulsory treatment order under the Mental Health Act;&lt;/li&gt;\n&lt;li&gt;Undertake MHA assessments as the Trust Section 12 doctor for patients in their care (including those detained under S136);&lt;/li&gt;\n&lt;li&gt;Provide Mental Capacity Act s49 reports for patients in their community area.&lt;/li&gt;\n&lt;li&gt;Work closely with the community teams to provide effective multidisciplinary collaborative care; this will include availability for consultation, case discussion and advice at the request of team members and / or team managers;&lt;/li&gt;\n&lt;li&gt;Provide visible and clear clinical leadership to the mental health service both locally and across the Trust;&lt;/li&gt;\n&lt;li&gt;Work collaboratively with inpatient doctors to ensure smooth transition for patients admitted and discharged from the ward;&lt;/li&gt;\n&lt;li&gt;Contribute to the development of older people’s community best practice,&lt;/li&gt;\n&lt;li&gt;Participate in Medical Audit, including audit of their own practice and attendance at quarterly Medical Audit meetings;&lt;/li&gt;\n&lt;li&gt;Provide cross cover for planned leave with the other inpatient medical staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Out of Hours: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are no compulsory out of hours duties with this role, the post holder can choose to opt to join the senior out of hour’s 1:12 rota.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be Section 12 approved, with eligibility for entry onto the GMC Specialist Register (or be within 6 months of CCT at time of application), ideally with prior experience gained in an older adult community setting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Area:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset offers an outstanding quality of life, with easy access to the moorland and coast, a thriving arts and entertainment scene and excellent transport links to the nearby cities of Bristol and Exeter.&lt;/p&gt;\n&lt;p&gt;Somerset has some of the region’s most reasonably priced housing, and is well serviced by a range of high achieving state and private schools.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information please contact Dr. Antony Christopher, Clinical Director on: 01460 238 701&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton, Minehead, Exmoor, Taunton, Minehead, Exmoor", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Older Persons Consultant Psychiatrist – Community and Memory Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244311", "validThrough": "2020-11-19T23:59:59+0000"}