{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-28T10:46:45+0000", "description": "&lt;p&gt;We are looking for experienced mental health nurses to join our busy and dynamic Crisis Assessment and Treatment Team (CATT) based in Ware, South East Hertfordshire. You’ll have substantial clinical experience of working with service users who have presented with a mental health crisis. We’d like to see a real passion for mental health crisis services, and the difference they can make to service users and carers. It’s a challenging role, in a challenging environment, but we believe it will provide a talented and ambitious clinician with real scope to develop and influence practice.&lt;/p&gt;\n&lt;p&gt;The team carries out urgent assessment of people with acute mental health problems and provide home treatment as an alternative to admission. The job is varied and challenging, it offers an opportunity to work in a variety of settings, with people with a variety of mental health issues. You will work as part of a multi disciplinary team to provide safe and effective treatment in the community, gate keep for hospital admission and facilitate early discharges from the acute inpatient units.&lt;/p&gt;\n&lt;p&gt;We are an exceptional organisation with big ambitions. There has never been a more exciting time to join us following our CQC rating of Outstanding awarded to us in April 2019. We are on our “Good to Great” journey as we continue to innovate, improve, transform and ultimately deliver the very highest standards of care to the service users and communities that we serve.&lt;/p&gt;\n&lt;p&gt;As a University Trust, we have close links to the University of Hertfordshire, providing excellent learning and development opportunities to our staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameZoe BrownJob titleTeam LeaderEmail addresszoe.brown19@nhs.netTelephone number01920 443950Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet House, Ware", "postalCode": "SG12 0DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8119", "longitude": "-.037244"}}, "title": "CATT Worker / CPN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246163", "validThrough": "2020-11-11T23:59:59+0000"}