{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-10-23T12:21:20+0100", "description": "&lt;p&gt;An exciting opportunity has arisen due to team expansion leading to the creation of a new role of Nursing Associate in the Diabetes Specialist Team.&lt;/p&gt;\n&lt;p&gt;We are a dynamic multidisciplinary diabetes team and the appointed nursing associate would support the diabetes specialist nurses in the delivery of their service.Our team works Monday to Friday and this post&#39;s 28 hours per week would be worked over 4 days.&lt;/p&gt;\n&lt;p&gt;A significant part of the role will be providing support and education to people living with diabetes, their family and carers, both in person and remotely. Another important aspect will be supporting the diabetes team to deliver inpatient safety initiatives promoting safe hospital care for people with diabetes.&lt;/p&gt;\n&lt;p&gt;The world of diabetes management is seeing increasing amounts of diabetes technology as well as increased remote ways of supporting patients, so good IT skills are essential.&lt;/p&gt;\n&lt;p&gt;If you are organized, can work as a team member, with excellent communication skills and quality care then please consider applying. If the successful applicant does not yet have an accredited diabetes qualification then they will be supported to complete this.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herefordshire", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Nursing Associate Diabetes Specialist Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240516", "validThrough": "2020-11-06T23:59:59+0000"}