{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-03T15:46:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like to use your clinical skills in a different environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working alongside colleagues from other backgrounds to deliver Mental Health support to adult male patients who are being treated for Substance Misuse and are also experiencing Mental illness.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a qualified experienced and motivated Mental Health Nurse to work within the Substance Misuse Team. Our aim is to provide the same level of health care to prisoners as if they were in the community. To be responsible for the day to day organisation and smooth running of the multi- disciplinary substance misuse team providing a service to a diverse caseload of prisoners who present with complex substance misuse and mental health problems.&lt;/p&gt;\n&lt;p&gt;You will be able to work independently and effectively and you will be expected to line manage a small team and delegate duties and tasks to staff. You will have had experience in a clinical role with some management responsibilities.&lt;/p&gt;\n&lt;p&gt;The successful candidate must have excellent communication and inter-personal skills, be able to prioritise and have the ability to work under pressure. To undertake appraisals/personal development review 1-1’s with team members and support staff in achieving their goals. To lead and participate in service development. To identify the need for new practice and determine methods of implementing change.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a secure environment would be an advantage but is not essential as full training and induction will be given.&lt;/p&gt;\n&lt;p&gt;This position is 37.5 hrs per week. The service covers 7 days a week between the hours of 7:30am-7:30pm during the week, and 8am-6pm on weekends and bank holidays. Some flexibility to meet service needs will be expected.&lt;/p&gt;\n&lt;p&gt;Informal visits are encouraged and any further information can be sought by contacting Emily Craven on 01788 523556&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Emily Craven&lt;/p&gt;\n&lt;p&gt;Job title: Substance Misuse Clinical Manager&lt;/p&gt;\n&lt;p&gt;Email address: Emily.Craven@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01788 523556&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Onley, Rugby", "postalCode": "CV23 8AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3265", "longitude": "-1.24768"}}, "title": "IDTS/RMN Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254644", "validThrough": "2020-11-17T23:59:59+0000"}