{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-03T10:16:35+0000", "description": "&lt;p&gt;&lt;strong&gt;HEALTHCARE ASSISTANT - (BURTON ONLY)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£18,005 - £19,337 PER ANNUM (PRO RATA IF PART TIME)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;OPPORTUNITIES AT QUEENS HOSPITAL AT BURTON.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;WE HAVE FULL AND PART TIME OPPORTUNITIES AVAILABLE DEPENDANT ON THE CLINICAL AREA WITHIN THE TRUST&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;PLEASE STATE WHICH SITE YOU WOULD PREFER TO WORK.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;PLEASE ONLY APPLY TO THIS VACANCY IF YOU WOULD LIKE TO WORK AT QUEENS HOSPITAL BURTON.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;There&#39;s one thing that makes more of a difference to our organisation than anything else: &lt;strong&gt;OUR STAFF&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Our staff are skilled, enthusiastic and committed people sharing in the delivery of high quality healthcare.&lt;/p&gt;\n&lt;p&gt;And there are many reasons why talented people like you join us……..&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;staff feeling satisfied with the quality of work and patient care they deliver&lt;/li&gt;\n&lt;li&gt;Our staff recommend the Trust as a place to work or receive treatment&lt;/li&gt;\n&lt;li&gt;Reporting good communication between senior management and staff&lt;/li&gt;\n&lt;li&gt;Effective team working&lt;/li&gt;\n&lt;li&gt;Overall staff engagement &amp; Job satisfaction&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for enthusiastic, passionate and caring individuals to join us and to help us &lt;strong&gt;BE THE BEST&lt;/strong&gt;, supporting our nurses in all aspects of Patient Care. We have various opportunities around the Trust to join our wards as trained Healthcare Assistants.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to gain experience in a variety of clinical areas and develop your skills, whilst working in a friendly environment. Successful candidates must be reliable, motivated and enthusiastic, be able to demonstrate excellent communication skills and work within a multidisciplinary team. We are committed to the training and development of our staff; therefore, you will need to be able to attend training days required for your role.&lt;/p&gt;\n&lt;p&gt;As a Healthcare Assistant you will be qualified to either NVQ level II or QCF level II diploma in a health related subject or have equivalent related healthcare experience.&lt;br /&gt;&lt;br /&gt;In addition you will be educated to a good standard of Numeracy and Literacy (i.e. GCSE A-D or equivalent). &lt;strong&gt;Please state clearly on your application form each individual qualification you have obtained that is essential for the role, otherwise your application may not be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All applicants who have a disability and meet the minimum criteria for the job will be short listed for further assessment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Interview Date: 20th November 2020&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential you are available to attend interview on the above date as no other dates will be offered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If we receive a high number of applications for this position we reserve the right to withdraw the post before the closing date, therefore it is advisable that you apply as early as possible to avoid disappointment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust induction for trained Healthcare Support Workers will comprise of your first day at the Royal Derby Hospital, followed by four days at London Road Community Hospital, Derby.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Recruitment Team &lt;br /&gt;dhft.flexiblerecruitment@nhs.net&lt;br /&gt;01332 787898/787690/787034.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital Burton", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Healthcare Assistant - Burton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253396", "validThrough": "2020-11-08T23:59:59+0000"}