{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-04T16:00:22+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Staff Nurse, Band 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full time. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Woodlands suite&lt;br /&gt; &lt;em&gt;Newly qualified Nurses welcome&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About us&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Royal Orthopaedic Hospital NHS Foundation Trust is one of the largest specialist orthopaedic units in Europe. Our 200-year heritage of innovation and excellence still drives us today as we continue to push boundaries to deliver the best care possible. We are rated among the best in the NHS for both clinical outcomes and patient experience and were rated as ‘good’ by the CQC in our latest inspection. We are in an exciting period of strategic change which includes new service development and growth.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our vision is to be ‘first choice for orthopaedic care’ and we’re looking for the right people to help us achieve our vision. If you’re values-driven and committed to quality and continuous improvement, then you might be just who we’re looking for…&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About the role&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for full time  and Part-time Staff Nurses at Band 5 to support the provision of care on our recently relaunched ‘Woodlands Suite’. The Woodlands Suite is our seven-bedded private patient facility which offers a comprehensive range of orthopaedic treatments from our well respected surgeons. As Staff Nurses you will play an important role in providing holistic care to a diverse patient group with complex musculoskeletal, spinal and oncology conditions. You will work as part of a multi-disciplinary team to continually enhance patient experience and provide high quality, evidence-based and compassionate care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return you’ll be part of a dynamic and professional team who will support you to achieve your potential. Nurses play a vital role in The Royal Orthopaedic Hospital and whether you’re interested in specialising, advancing or moving in to a leadership position, we can offer you the right opportunity. We are committed to education and training and will provide a comprehensive package of learning and skills based competency and if required, access to our Trust Preceptorship programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Royal Orthopaedic Hospital offers a truly unique experience to Nurses which can be only be found here. As a specialist Foundation Trust without an A&amp;E department, we are in an enviable position to focus our attention on high quality care and innovation. The Woodlands Suite is often at the forefront of these innovations and as Staff Nurse you will be involved in delivering pioneering and life-changing care. &lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For a full list of duties and requirements, please read our Job Description and Person Specification. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Also visit the trust website&lt;/span&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;to find out more about us.&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Who we’re looking for&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Enthusiastic and proactive people&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Well organised individuals who work well in a multi-disciplinary team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Motivated candidates who are committed to self-development and improvement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Values-driven Nurses who demonstrate care and compassion in all they do &lt;/p&gt;\n&lt;p&gt;For further information or an informal chat or visit please contact Mishera Musabayana Ward Manager Ward Phone number 0121 685 4050.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120848.PNG", "name": "The Royal Orthopaedic Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120848"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northfield, Birmingham", "postalCode": "B31 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4212", "longitude": "-1.96082"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256527", "validThrough": "2020-11-20T23:59:59+0000"}