{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Voluntary Placement"}}, "datePosted": "2020-11-02T13:16:39+0000", "description": "&lt;p&gt;Are you a Nurse (adult or child branch trained) with lapsed registration looking to resume your career?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you miss the challenges and rewards of clinical practice? Do you want to return to practice and re-join the NMC professional register? Do you want to join a Trust recognised as OUTSTANDING and GOOD with the CQC and acknowledged for its success supporting the Return to Practice Nursing Programme?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If the answer is YES, here at Homerton University Hospital in East London, we can offer the support and assistance you need to regain your registration and return to practice in a busy acute hospital Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are recruiting now for the January 2021 Cohort!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Return to Practice programme is funded by Health Education England in partnership with City University. As a friendly NHS Foundation Trust we can provide practice areas to support your learning and achieve the required clinical competencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The programme is open to you if your NMC registration has lapsed. The course will update you on any new developments in nursing and you will have support and mentoring throughout.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To help you, Health Education England will pay your course fees, clinical placement fee and £500 stipendiary to help towards travel, childcare and book costs. Placement hours at Homerton are flexible depending on how many hours you need to complete and we can work around your schedule and requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;On successful completion of the programme you have the opportunity to apply for a permanent position within the Trust as a Band 5 Registered Nurse. We offer flexible hours and a variety of choice of clinical areas from.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please submit an application form outlining your career history, background in nursing, reason for lapse of registration and your motivation for returning to nursing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be invited for a Literacy and Numeracy Test. If successful, this is followed by interviews at Homerton University.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Interviews are due to be held on the 30th November**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For information on the academic components of the course, entry requirements and funding:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ben Teh b.teh@city.ac.uk or T +44 (0)7388230924&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For Information on practice placements available and a Nursing career at Homerton:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Karleen Mundle at karleen.mundle@nhs.net or Nadira Balkissoon at nadira.balkissoon@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital Homerton Row London E9 6SR, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Return to Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252208", "validThrough": "2020-11-19T23:59:59+0000"}