{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45000", "unitText": "YEAR", "value": "£45-753-£51,668 (Band 8A)"}}, "datePosted": "2020-11-04T12:49:24+0000", "description": "&lt;h1&gt;&lt;strong&gt;Lead Practice Development Nurse for Emergency Care&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Full time &lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;£45,753 -£51,668 (Band 8a)&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experience Emergency Nurse with the ability to inspire others through education and role modelling? ……. If yes read on&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A Registered nurse educated to graduate level with significant Emergency nursing experience?&lt;/p&gt;\n&lt;p&gt;A proven track record of effective education/ training and practice development.&lt;/p&gt;\n&lt;p&gt;Passion for improving practice and role modelling on the shop floor alongside staff.&lt;/p&gt;\n&lt;p&gt;The role will be full time over 5 days per week working a range of shifts including occasional weekend and twilight / night shifts to ensure all staff have access to the development opportunities. The post will be based on the ‘shop floor’ 4 days a week with one office day a week. On the shop floor you will be working alongside all grades of Nursing staff educating, supervising and developing their skills and expertise.&lt;/p&gt;\n&lt;p&gt;You will need to be fully competent in all aspects of Emergency care from acutely ill to minor illness and injury and the relevant care and treatments.&lt;/p&gt;\n&lt;p&gt;You will be responsible for developing and delivering an Emergency care education strategy for all grades as well as a robust local shop floor induction programme for all new staff joining the emergency care environment.&lt;/p&gt;\n&lt;p&gt;The role requiresfocus initially on the Emergency Department developing the workforce skills and practice in the resuscitation room,Majors and Children’s area. An early priority for the post holder is to develop induction programme for all levels of Registered nursing and non-registered nurses&lt;/p&gt;\n&lt;p&gt;We welcome an informal conversation and or visit to share our vision and for you to see the great opportunities the Isle of Wight has for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Lead Practice Development Nurse for Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255922", "validThrough": "2020-11-18T23:59:59+0000"}