{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum"}}, "datePosted": "2020-10-29T12:46:10+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a 1.0 WTE Band 8a clinical psychology position covering maternity leave for a period of 12 months in Clinical Haematology. The post comprises of 0.6 FTE into adult haematological malignancies in Nottingham and 0.4 WTE into adult haemoglobinopathies across the East Midlands region.&lt;/p&gt;\n&lt;p&gt;The haematological malignancies aspect will entail providing psychological therapy to both inpatient and outpatients for all blood cancers and stem cell transplants. The post will involve working as part of the multi-disciplinary team, providing input to group based interventions and delivering group supervision to non-psychology colleagues. The haemoglobinopathy service provides input to adults living with sickle cell disease and thalassaemia across Nottingham and Derby and the post will involve providing psychological therapy and support to the MDT in clinics and meetings.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Clinical Psychologist who is interested in expanding their experience in working with adults with acute and chronic health problems. Appropriate clinical supervision will be provided by clinical psychologists working in the adult medical psychology service&lt;/p&gt;\n&lt;p&gt;It is essential that the post-holder has a Doctorate in Clinical Psychology and to be HCPC registered by the time of commencing in post. The post holder will be employed by Nottingham University Hospitals NHS Trust and will usually be based at the City Hospital but will be required to work at both the City Campus in Nottingham and the Derby Hospital.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be welcomed to the Department of Clinical Psychology &amp; Neuropsychology within the trust. Currently there are over 20 Clinical Psychologists and two psychology assistants working in the department across a number of medical inpatient and outpatient services within the Trust including: Adult Medical Outpatient Service, Adult Neurology Services including Neurorehabilitation, Stroke and Non-Pressure Hydrocephalus, generic child service, Burns (child and adult), Cystic Fibrosis (child and adult), Child Oncology, Child Neurology Services including children with acquired and traumatic brain injury, Cleft Lip and Palate (child and adult), Haematological Cancers, Major Trauma, Neonatal Intensive Care, Non Epileptic Attack Disorder, Renal (adult) and Sickle Cell (child and adult). We have excellent links with the University of Nottingham and regional Clinical Psychology Doctorate Courses.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Sarah Crozier, Clinical Psychologist in Clinical Haematology (Sarah.Crozier@nuh.nhs.uk).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham City Hospital, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Clinical Psychologist in Clinical Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248369", "validThrough": "2020-11-09T23:59:59+0000"}