{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata Per Annum"}}, "datePosted": "2020-10-28T14:01:42+0000", "description": "&lt;p&gt;&lt;strong&gt;1 x Full time post 37.5 hours per week = 7 day working under agenda for change between the hours of 08:00 and 20:00 (Core hours 09:00-17:15, 5 day week Monday-Friday), including pro rata shift pattern that includes weekends and Bank Holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent Post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful post holder will work in a progressive modern laboratory. They will deal with routine clerical and laboratory duties such as data entry and the initial processing of patient samples. A worthy team player, you must be able to work meticulously, display good communication and possess keyboard skills of a high standard. A satisfactory aptitude in numeracy and literacy is also essential. A flexible approach towards working hours is expected and participation on a weekend and public holiday rota is mandatory.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Laboratory, or experience of working in a clerical / customer service role would be advantageous. Knowledge of medical terminology is desirable but full training will be provided where necessary.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Doncaster and Bassetlaw Teaching Hospital NHS Foundation Trust is currently one of five Trusts involved in the South Yorkshire and Bassetlaw (SYB) Pathology Transformation Programme. The aim is to design a Pathology Service that provides all SYB patients and clinicians with equitable access to high-quality, innovative laboratory medicine solutions that will ensure the best clinical outcomes for patients. The service will also be efficient and sustainable, encourage research and development in collaboration with Acadaemia and Industry to improve health and wealth in the region and provide rewarding jobs and career opportunities for all staff. The Transformation Programme may include the consolidation of some services. Staff will be consulted about proposals that may involve them.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sally Lowe - Senior BMS in Microbiology, sallylowe@nhs.net, (01302) 642835&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster Royal Infirmary", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Higher Medical Laboratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246896", "validThrough": "2020-11-11T23:59:59+0000"}