{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75000", "minValue": "75000", "unitText": "YEAR", "value": "£75,000"}}, "datePosted": "2020-09-29T16:16:03+0100", "description": "&lt;p&gt;Join the new multidisciplinary team at our service, St Neots hospital in Eynesbury St Neots. The service provides specialist care for adults with Neurodegenerative conditions and Acquired brain injury, with a female and male care pathway requires an Associate Specialist Doctor to be part of the team providing care for service users. &lt;br /&gt;The 24-hour service will be well supported to support the recovery, rehabilitation and maintenance of individuals by providing a pathway of care that supports in receiving good quality of care that enhances their quality of life and assisting others in getting them back to their community. &lt;br /&gt;As an Associate Specialist Doctor, you will have prior experience working in a similar environment, completing specialist training within medicine. You will ensure all service users have a full physical health screen upon admission, this will include a physical examination, ECG and bloods, and you will manage any physical health concerns and continue to analyse their mental health. &lt;br /&gt;At St Neots you will work alongside a network of healthcare professionals, ensuring you have the necessary training, support and preparation to work within this specialised area. It&#39;s what delivering great healthcare should feel like. &lt;br /&gt;&lt;strong&gt;Your responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring an adequate handover to colleagues including out of hours.&lt;/li&gt;\n&lt;li&gt;Seeking collateral history from other professionals and family.&lt;/li&gt;\n&lt;li&gt;Completing discharge letters/reports/s62 forms as required in a timely manner.&lt;/li&gt;\n&lt;li&gt;Preparing First-tier Tribunal and Hospital Managers&#39; hearing reports under the supervision of Consultant.&lt;/li&gt;\n&lt;li&gt;Depending on your experience, providing oral evidence at First-tier Tribunal and Hospital Managers&#39; hearings under the supervision of the Consultant.&lt;/li&gt;\n&lt;li&gt;Contributing to the service development by participating in Clinical Governance activities by conducting audits, research and teaching.&lt;/li&gt;\n&lt;li&gt;Work effectively with colleagues to ensure that patients have access to appropriate medical cover at all times.&lt;/li&gt;\n&lt;li&gt;Providing prospective cover to other specialty doctors when they are on leave.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC registration&lt;/li&gt;\n&lt;li&gt;Experience working in psychiatry within multi-disciplinary teams&lt;/li&gt;\n&lt;li&gt;To be in good standing with the Royal College of Psychiatrists&lt;/li&gt;\n&lt;li&gt;To have had an appraisal/RITA within the last year&lt;/li&gt;\n&lt;li&gt;At least 3 years&#39; experience in Psychiatry&lt;/li&gt;\n&lt;li&gt;Experience working as a doctor within similar environment&lt;/li&gt;\n&lt;li&gt;MRCPsych (desirable)&lt;/li&gt;\n&lt;li&gt;Section 12 (2) approval (desirable)&lt;/li&gt;\n&lt;li&gt;AC status (desirable)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £75,000&lt;/li&gt;\n&lt;li&gt;The equivalent of 25 days of annual leave, 8 bank holidays– plus your birthday off.&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;br /&gt;Developing you regularly to ensure you’re on the cutting edge and at the top of your game is important to us. You’ll have access to excellent CPD and career development opportunities, plus access to a large peer group of enthusiastic and high-calibre consultants.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;br /&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium. &lt;br /&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Neots", "postalCode": "PE19"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2466", "longitude": "-.266276"}}, "title": "Associate Specialist Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916205198", "validThrough": "2020-11-29T23:59:59+0000"}