{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-22T11:32:09+0100", "description": "&lt;p&gt;We are looking forward to and excited to recruit a number of Band 5 Staff Nurses to work within a new medium secure mental health ward. Hadrian ward will be a 6 bed medium secure ward, based at the Kenneth Day Unit on the Northgate Hospital site for men with complex mental health problems and personality disorders.&lt;/p&gt;\n&lt;p&gt;The service will create a therapeutic milieu which will encourage engagement and provide a sense of hope and wellbeing for patients throughout their pathway. The pathway will be person centred, and access to a broad range of professionals from first point of contact will be available, the specialist workforce will ensure recovery focused goals are achieved.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated, hard-working and enthusiastic Registered Mental Health and Learning Disability Nurses with excellent values to support adults with complex mental health problems and personality disorders in a secure care setting. You must have excellent communication skills, be reliable, punctual and work well in a team, whilst being adaptable to changing situations. You will need to be able to work calmly and efficiently within a busy and intensive environment dealing with unpredictable situations whilst remaining focused on providing a person centred approach to care and treatment.&lt;/p&gt;\n&lt;p&gt;We also have a number of band 5 opportunities across Secure Care Inpatient Learning Disability and Mental Health Medium and Low Secure services on both the Northgate Hospital site and the St Nicholas Hospital site&lt;br /&gt;&lt;br /&gt;On commencement, you will receive induction to our services and mandatory training including PMVA and ILS&lt;/p&gt;\n&lt;p&gt;Successful candidates will be required to undergo standard NHS pre-employment checks, including an Enhanced DBS (Disclosure and Barring Service) Check.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Goudie&lt;/p&gt;\n&lt;p&gt;Clinical Nurse Manager&lt;/p&gt;\n&lt;p&gt;helen.goudie@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;0191 246 7270&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morpeth", "postalCode": "NE61 3BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1848", "longitude": "-1.71199"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238172", "validThrough": "2020-11-19T23:59:59+0000"}