{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-05T11:31:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced nurse leader to undertake the role of Associate Director of Professional Practice &amp; Safe Staffing at Wirral University Teaching Hospital NHS Trust.&lt;/p&gt;\n&lt;p&gt;As part of the senior nursing, midwifery and AHP team, you will work proactively and collaboratively with the workforce &amp; HR teams to implement the Trust’s non-medical workforce recruitment and retention plans. This includes international recruitment, local pipeline, students, preceptorship, clinical supervision and clinical skills development.&lt;/p&gt;\n&lt;p&gt;You will be an experienced and credible nurse leader with the ability to motivate and inspire staff to deliver the highest possible clinical and professional standards. You will be a clinical role model and will be passionate about improvement and patient-centered care.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills to engage and collaborate with our senior leaders and nursing colleagues. You will provide professional leadership and specialist expertise within the Trust and work regularly with key stakeholders on a national, regional and local basis.&lt;/p&gt;\n&lt;p&gt;The successful candidate will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead the development of the Trust’s strategic approach to provide the nursing and midwifery workforce with evidence based safety standards to ensure that they are able to provide a safe and quality service to our patients.&lt;/li&gt;\n&lt;li&gt;Lead the Trust’s co-ordination and implementation of a range of key projects that run alongside the Trust’s nursing and midwifery education, training and workforce strategies to ensure a safe and productive workforce.&lt;/li&gt;\n&lt;li&gt;Hold overall responsibility in the development, implementation and evaluation of continuing education programmes for registered nurses, midwives, allied health professionals, nursing associates, assistant practitioners and care support workers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As part of the Corporate Nursing Team, you will be an ambassador for the organisation with extensive experience at a senior leadership level.&lt;/p&gt;\n&lt;p&gt;Closing Date Tuesday 18th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are expected to take place on 3rd December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Hazel Richards&lt;/p&gt;\n&lt;p&gt;Job title: Chief Nurse&lt;/p&gt;\n&lt;p&gt;Email address: r.cobon@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0151 604 7221&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact Rachel Cobon, Executive Assistant to Hazel Richards to arrange an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Upton", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Associate Director of Professional Practice and Safe Staffing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257463", "validThrough": "2020-11-18T23:59:59+0000"}