{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T17:01:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Cavendish Ward- Registered Mental Health Nurse- Staff Nurse Position&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cavendish Ward is a male, 20 bedded Later Life ward based at Laureate House in Wythenshawe Hospital. We are an assessment ward for both organic and functional patients, therefore the desirable applicant will need to have a range of skills; both in general mental health nursing, and also nursing patients with dementia.&lt;/p&gt;\n&lt;p&gt;We are an experienced team with a variety of ward-based professionals; including charge nurses, staff nurses, support workers, occupational therapist, physiotherapist, social worker and also activity workers. This is in addition to our community colleagues. The successful applicant will need to be able to have good communication skills, both verbal and written, to ensure the smooth coordination of patients care whilst on the ward. &lt;br /&gt;&lt;br /&gt;Many of our staff are passionate about delivering person centered, holistic care; and recognize the important link between mental health and physical health. Ideally the candidate will have skills and interests in physical health care, although it is not an issue if you do not have skills in this area; we would be keen to help you develop.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Summary &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If successful your key role would be to co-ordinate the smooth running of the ward, and to maintain and develop quality, person-centred care on the Ward.&lt;/p&gt;\n&lt;p&gt;You will have a key role in the assessment of individual patient needs and plan, implement and evaluate plans of care which will maximise an individual’s potential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Requirements &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN with current NMC registration&lt;/li&gt;\n&lt;li&gt;Effective communication, team and interpersonal skills.&lt;/li&gt;\n&lt;li&gt;Must be able to carry out a full range of caring duties, including moving and handling and managing violence and aggression.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanna PeaseJob titleWard ManagerEmail addressjoanna.pease@gmmh.nhs.ukTelephone number0161 271 0484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cavendish Ward, Wythenshawe Hospital, Wythenshawe", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249193", "validThrough": "2020-11-12T23:59:59+0000"}