{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Drawings"}}, "datePosted": "2020-11-03T08:59:36+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a GP Partner to join our expanding practice. We are a dynamic and supportive partnership, proud of our clinical care and patient services, at the heart of our local community. The practice has 10 GP Partners and a very skilled multi-disciplinary team including Nurse Practitioners, Practice Nurses and HCA&#39;s . Our management team and administration staff are very experienced, with our Practice Manager having worked with us for 18 years. CQC inspection rated Good. High QOF achievement. We are looking for dynamic and committed individuals who work well in a team and are keen to shape future service provision at the practice. Social distance visits are very welcome. Please contact Colleen Shelley/ Allison Boor for more information or an informal discussion regarding the role.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;em&gt;Please note this role is also being advertised on the Essex Primary Care Careers &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;website, so please only apply once.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NO AGENCIES PLEASE.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ideally you will be an experienced GP who has Partner experience or looking to become a GP Partner. You will have the following qualifications / registrations:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully qualified GP with GMC registration&lt;/li&gt;\n&lt;li&gt;Annual appraisal and revalidation (when appropriate)&lt;/li&gt;\n&lt;li&gt;NHSE medical performers list&lt;/li&gt;\n&lt;li&gt;Interest in GP registrar training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;and have the following skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good understanding and experience of chronic disease management and primary prevention &amp; screening services&lt;/li&gt;\n&lt;li&gt;Ability to take responsibility for your own career development, learning and performance and are responsible for ensuring that all your mandatory training is in date&lt;/li&gt;\n&lt;li&gt;Awareness of and compliance with all relevant practice policies/guidelines, e.g. prescribing, confidentiality, data protection, health and safety&lt;/li&gt;\n&lt;li&gt;Commitment to life-long learning and audit to ensure evidence-based best practice&lt;/li&gt;\n&lt;li&gt;Excellent inter-personal and communication skills in a confidential manner&lt;/li&gt;\n&lt;li&gt;An interest in Practice Business&lt;/li&gt;\n&lt;li&gt;An enthusiasm to implement new ideas to Primary Care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The practice has recently taken over another surgery which is now our branch surgery. We have therefore grown in population from 14000 to 18400. Wickford is growing fast and we know that we have to continue to expand our services. We are also looking at expanding our building so that more services and staff can be accommodated. We have a PMS contract and use SystemOne. We are active within the local CCG, one of our partners being the chairman. We work closely with our local practices as a PCN and with others in Basildon in our consortium. Wickford&#39;s road and rail links to London make it an excellent area to live Supporting your work life balance and professional development is important to us. We are looking for a full time partner (8 sessions over 4 days) however we will be happy to discuss any requirements for flexible working and offer the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive remuneration (Drawings)&lt;/li&gt;\n&lt;li&gt;Supportive clinical and non-clinical team&lt;/li&gt;\n&lt;li&gt;Forward thinking and friendly environment&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Peer and mentoring support&lt;/li&gt;\n&lt;li&gt;CPD Support with training and development&lt;/li&gt;\n&lt;li&gt;6 weeks holiday&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;Study leave (1 week per year)&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wickford", "postalCode": "SS12 9NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6018", "longitude": ".535868"}}, "title": "GP Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253192", "validThrough": "2020-11-17T23:59:59+0000"}