{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc"}}, "datePosted": "2020-10-29T17:45:14+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Snowsfields Adolescent Unit (SAU) is a National &amp; Specialist CAMHS Inpatient Unit admitting adolescents between the ages of 13 to 18 years old. The unit is part of the South London Partnership, and is located at the Maudsley Hospital. SAU is an 11-bedded mixed-sex unit for young people with an acute mental health illness who cannot be safely cared for at home or in a community setting. the unit also caters for day patients.&lt;/p&gt;\n&lt;p&gt;We offer a broad range of treatments, including medication, cognitive behavioural therapy, group work, psycho educational family work, systemic family work and art psychotherapy. Our multi-disciplinary team includes psychiatrists, psychologists, nurses, teachers, occupational therapists, social workers and other therapists.&lt;/p&gt;\n&lt;p&gt;We maintain close links with the young person’s referring team to ensure they experience a smooth transition back to the community. The ward is part of the larger CAMHS inpatient care pathway across the South London Partnership, which includes crisis care, two further GAU’s, CAMHS PICU and an Enhanced Treatment Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a fantastic career opportunity to work as a Clinical Charge Nurse. You will join a well established service within a renowned facility, with excellent career development and training opportunities – while seeing the difference you make to children and young people’s lives. You will be part of a great team in a collaborative environment that embraces progressive thinking.&lt;/p&gt;\n&lt;p&gt;We’ll encourage you to share ideas and follow them through into innovative practice. Strengthen your experience &amp; build your skills in providing evidenced based practice and effective clinical leadership to the nursing and multi-disciplinary team whilst supervising qualified staff and students. You will provide support to the ward and deputy ward manager in the operational management of nursing staff, both permanent and bank (provided by NHSP).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are based at Maudsley Hospital, Denmark Hill, London, SE5 8AZ&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane FergusonJob titleClinical Service ManagerEmail addressjane.ferguson@slam.nhs.ukTelephone number07815001466Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Jane Ferguson, Clinical Service manager 07815 001 466 - jane.ferguson@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;Will Brackenbury - Clinical Service Lead - 0203 228 4637 - will.brackenbury@slam,nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Snowfield Adolescent Unit, Maudsley Hospital, Denmark Hill, London, SE5 8AZ, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Clinical Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249239", "validThrough": "2020-11-06T23:59:59+0000"}