{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc. HCA"}}, "datePosted": "2020-11-03T09:16:35+0000", "description": "&lt;p&gt;We are one of the largest hospital trusts in the country, with around 12,500 staff and over 1 million patient contacts a year. Our hospitals have been at the forefront of medical progress and innovation since they were founded. We continue to build on these traditions and have a reputation for clinical, teaching and research excellence.&lt;/p&gt;\n&lt;p&gt;We provide a full range of hospital and community services for local residents. We also provide specialist services for patients from further a field including cancer, cardiac, kidney, women&#39;s and orthopaedic services, and we are home to the Evelina Children&#39;s Hospital.&lt;/p&gt;\n&lt;p&gt;We are part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC). This brings together the best research, clinical excellence and world-class teaching to deliver groundbreaking advances in physical and mental healthcare.&lt;/p&gt;\n&lt;p&gt;Like many in the profession, we believe that the control of infection is one of the most important 21st century health care challenges. If you prefer to be in the thick of things and to make a difference where it really counts and want to influence change and drive progress, an opportunity has arisen to join the Infection Prevention and Control Team as a band 7 Clinical Nurse Specialist. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated, qualified Infection Prevention and Control nurse or a nurse with extensive clinical experience with evidence of a developed interest in Infection Prevention &amp; Control. You will be responsible within the operational scope of the Infection Prevention and Control (IPC) (both acute and community), facilitating the prevention, surveillance, investigation and control of infection within Guy&#39;s and St Thomas’ NHS Foundation Trust. You will also be expected to be involved in the delivery of the IPC education programmes for all staff throughout the Trust (both community and acute). The post holder must be information technology literate (Microsoft Office, Outlook), training will be provided for our Infection Prevention and Laboratory IT systems. &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;The post provides support to the diverse specialties across the Trust, including community services, and the Evelina Children’s Hospital. A vital remit of the post involves providing clinical advice, as well as participating in education, surveillance, audit and research programmes. You’ll also have the opportunity to further your professional development by building specialist skills and interests.&lt;/p&gt;\n&lt;p&gt;The job description is Guys and St Thomas’ NHS Foundation Trust generic Clinical Nurse Specialist job description; please see the supporting document for specific detail on the requirements of the post. &lt;br /&gt;&lt;br /&gt;To arrange an informal visit please contact: Yusupha Ceesay, Deputy Director – Infection Prevention and Control 02071881922.&lt;/p&gt;\n&lt;p&gt;Closing Date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 27th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameYusupha CeesayJob titleDeputy Director, Infection Prevention and ControlEmail addressyusupha.ceesay@gstt.nhs.ukTelephone number02071881922Additional contact information&lt;/p&gt;\n&lt;p&gt;Yusupha Ceesay - Mobile: 07920587023&lt;/p&gt;\n&lt;p&gt;y.ceesay@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Clinical Nurse Specialist - Infection Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253253", "validThrough": "2020-11-16T23:59:59+0000"}