{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum. Additional on-call pa"}}, "datePosted": "2020-11-03T12:00:59+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 2 YEARS TO MEET HE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join the ICT Clinical Systems support team at Cwm Taf Morgannwg University Health Board. The post will focus on the planning, integration and rollout of a new national digital nursing inpatient record within Cwm Taf Morgannwg. You will be part of a dedicated local and national multi-disciplinary team driving forward the future of digital working within the organisation. The role will encompass both national and local systems and working on projects and upgrades in collaboration with other health boards and NWIS.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage the service delivery of the clinical information systems&lt;/li&gt;\n&lt;li&gt;Recognise and influence service improvements through user engagement&lt;/li&gt;\n&lt;li&gt;Act as an advocate for and to promote best practice with regard to the clinical information systems&lt;/li&gt;\n&lt;li&gt;Develop modern working practices, maximising benefits from clinical systems and their interaction with other clinical and hospital system/devices&lt;/li&gt;\n&lt;li&gt;Be responsible for formulating and monitoring policies and protocols to support the clinical information systems&lt;/li&gt;\n&lt;li&gt;Work with multiple stakeholders&lt;/li&gt;\n&lt;li&gt;Support a small team of support staff within ICT and work alongside other system managers&lt;/li&gt;\n&lt;li&gt;Work with the service support team in order to design and implement an effective support model&lt;/li&gt;\n&lt;li&gt;Work closely with the lead informatics nurse on the development and delivery of projects.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience in managing systems within an NHS setting will be required for this role as well as experiencing of working with multiple stakeholders and supporting users through business change.&lt;/p&gt;\n&lt;p&gt;You will be required to support system upgrades, liaising with the infrastructure team, NWIS and the end users by communicating effectively and also assist in user acceptance testing.&lt;/p&gt;\n&lt;p&gt;Typically the Systems Support team handle the day to day operations of the departments and include clinical decision making and patient care systems in use on wards and in clinics.&lt;/p&gt;\n&lt;p&gt;You will be expected to participate in an on-call rota as part of the role, supporting multiple clinical systems during out of hours.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Williams, Head of ICT Systems &amp; Support&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Hub, Williamstown, Williamstown", "postalCode": "CF40 1AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6222", "longitude": "-3.45429"}}, "title": "Clinical Systems Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253856", "validThrough": "2020-11-17T23:59:59+0000"}