{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-05T12:46:07+0000", "description": "&lt;p&gt;Are you an inspiring very experienced operational manager, passionate about delivering high quality and efficient health services? If so, we have an exciting and unique opportunity for a General Manager to lead the delivery and continuous development of services across one of network of new enhanced local general hospitals.&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board serves a population of 600,000. Services are based across five County Borough Councils, namely Blaenau Gwent, Caerphilly, Monmouthshire, Newport and Torfaen.&lt;/p&gt;\n&lt;p&gt;The Grange University Hospital is set to open in November 2020 and as a beacon site across Wales will transform the way health services are accessed within Aneurin Bevan University Health Board (ABuHB). As a result, Nevill Hall Hospital will change its role and will help support the differentiation of general and routine services and the major and more specialist services.&lt;/p&gt;\n&lt;p&gt;All our Local General Hospitals will deliver the majority of hospital services focusing on 24 hour minor injuries, general and routine care, sub-acute, elderly frail unit, medical assessment, rehabilitation, palliative, therapies, out-patients and enhanced investigations. Nevill Hall Hospital will provide circa 208 bedded facility and will be the main centre for elective day surgery and will also be the site of a planned satellite radiotherapy unit and local cancer services hub. It will be pivotal to the way secondary care flows across our Health Board.&lt;/p&gt;\n&lt;p&gt;The role of Divisional General Manager for Medicine / Hospital Manager NHH is a newly established post, responsible for ensuring that the hospital and Division of Medicines provide first class healthcare to the patients of AbuHB. The role is vital role in making sure the Health Board functions efficiently and effectively.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Divisional Director of Medicine, with professional accountability to the Executive Director of Operations and will operate as part of a triumvirate Divisional Management Team alongside the Divisional Nurse for Medicine. The successful candidate should have extensive operational management experience and knowledge within the NHS and must be able to evidence delivery of whole system change and management of complex and interdependence operational services.&lt;/p&gt;\n&lt;p&gt;We are waiting to hear from passionate individuals who can lead on the continued progress of our Clinical Futures Programme, whilst ensuring the delivery of first class healthcare services in a challenging and unpredictable environment.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deborah Wales - Divisional Director of Medicine &amp; NHH&lt;/p&gt;\n&lt;p&gt;deborah.wales@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;07854211405&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nevill Hall Hospital, Abergavenny", "postalCode": "NP7 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8246", "longitude": "-3.03402"}}, "title": "Divisional General Manager for Medicine &amp; NHH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257706", "validThrough": "2020-11-19T23:59:59+0000"}