{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa plus £149 HCAS"}}, "datePosted": "2020-11-05T15:04:19+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant in Neurology&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Ready for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for dynamic, forward thinking individuals to join our award winning hospital as we embark on a new journey of transforming our services.&lt;/p&gt;\n&lt;p&gt;Our thriving Neurology Department provides general and specialist outpatient clinics (MS, PD &amp; Movement Disorders, Epilepsy, Headache and Functional Disorders) in addition to an in-reach service to the wards. We have strong links with St George’s Hospital which includes admission rights. This post will attract an honorary contract with St George’s as the regional neuroscience centre which fulfils CPD requirements. We are also active in research and have strong links with several local universities, all staff are encouraged to support and participate in research activities.&lt;/p&gt;\n&lt;p&gt;We are looking for a new consultant to join Dr Coebergh, Dr Barnes, Dr Abdel-Aziz, Dr Teodoro, Dr Gulli and Dr Kamman and our team of specialist nurses and practitioners in MS and PD.&lt;/p&gt;\n&lt;p&gt;Please see the job description for an indicative job plan. We are happy to discuss individual candidates’ interests and will be as flexible as we can in terms of PAs and job plans, so please contact us to discuss your requirements or to arrange a visit to the Trust.&lt;/p&gt;\n&lt;p&gt;Ashford and St Peter’s Hospitals NHS Foundation Trust serves a population of around 450,000 from an area which includes Chertsey, Woking, Walton-on-Thames, Weybridge, Staines, Bedfont, Feltham and Spelthorne. There are 413 beds in a range of specialties. There is a full range of imaging services including CT and MRI scanning and laboratory services. Both hospital sites have thriving, modern and fully equipped postgraduate centres with the latest and up to date library services with a forever expanding wealth of facilities and resource. We have a strong and exciting library and postgraduate team with excellent knowledge and experience allowing assistance and guidance in all aspects of academia, research, clinical development and quality improvement.&lt;/p&gt;\n&lt;p&gt;Ashford and St Peters Hospital is located within Surrey in the western border of the M25 near London Heathrow. It is an affluent demographic known for its picturesque environment and high quality schools and high quality of life, with the added bonus of being very close to London with excellent rail connections and easy motorway links.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jonathan Robin, Divisional Director (Medicine &amp; Emergency Services) on 01932 726187&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jan Coebergh, Clinical Lead for Neurology on 01932 722383/ jan.coebergh@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultant Neurologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258256", "validThrough": "2021-01-04T23:59:59+0000"}