{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-11-02T17:02:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;CLINICAL FELLOW IN PAEDIATRIC EMERGENCY MEDICINE &lt;/strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Clinical Fellow in Paediatric Emergency Medicine (PEM) at the Bradford Teaching Hospitals NHS Foundation Trust. Our Emergency Department is the 3rd busiest department in the country. This is a fixed term post for 12 Months. Applicants must have full registration with the GMC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is designed for a Higher Specialist Trainee in Paediatrics or Emergency Medicine to develop their skills in Paediatric emergency medicine. Applications from post CCT trainees will also be considered. The Clinical Fellow will contribute to the Joint Paediatric and Emergency Department middle grade rota for 80% of their contracted time, covering the Paediatric clinical decision area or Emergency department, enabling the department to provide two middle grade paediatric clinicians overnight improving patient safety and flow. The other 20% of the time will be spent in research or quality improvement project.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Clinical Fellow will be encouraged to take a lead in developing and delivering local Paediatric/PEM simulation training events, including in situ simulation, and will also be encouraged to attend regional training courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There will be opportunities for research; Bradford Institute for Health Research (BIHR) is a unique partnership of primary and secondary care and universities, established to promote the faster translation of health research to patient benefit. Over 30,000 Bradford people are currently involved in our research programmes that include the internationally acclaimed Born in Bradford and Better Start Bradford studies. All 88 General Practices are involved in our Connected Bradford programme that harnesses data linkage to redesign care pathways. Over 100 primary schools are involved in our Starting Schools programme.&lt;/p&gt;\n&lt;p&gt;The main function of the Paediatric Emergency Department is to organise the reception, assessment and immediate management of the large numbers of patients presenting to the unit. A close working relationship has been established between the Paediatric Emergency Department and the general paediatric ward. Patients referred from ED are assessed in the Children’s Clinical Decisions Area (CCDA) and those requiring observation or admission&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant would be expected to provide clinical support at middle grade level and to supervise members of the junior medical staff. Joint supervision will be provided from a PEM consultant and a consultant paediatrician with an interest in acute medicine.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact Dr Elizabeth Jones on &lt;span&gt;Elizabeth.jones@bthft.nhs.uk&lt;/span&gt; or Helen Jepps (Clinical Director for Childrens Services ) &lt;span&gt;Helen.jepps@bthft.nhs.uk&lt;/span&gt; for an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120952.JPG", "name": "Bradford Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120952"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD9 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8059", "longitude": "-1.79488"}}, "title": "Clinical Fellow in Paediatric Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252983", "validThrough": "2020-11-16T23:59:59+0000"}