{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T13:01:16+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM UNTIL 31ST MARCH 2020 DUE TO MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact tracing is a tried and tested method of controlling the spread of infectious diseases.&lt;/p&gt;\n&lt;p&gt;As lockdown restrictions are gradually relaxed &lt;strong&gt;Welsh Government&lt;/strong&gt; has introduced Test, Trace, Protect. Implemented by Public Health Wales in partnership with Health Boards and local Councils across Wales, its aim is to limit the spread of infection, trace the virus and protect our communities.&lt;/p&gt;\n&lt;p&gt;It works by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;testing people who have symptoms, while they, and their households, self-isolate;&lt;/li&gt;\n&lt;li&gt;tracing people who have been in close contact with someone who has tested positive, and asking them to self-isolate;&lt;/li&gt;\n&lt;li&gt;protecting the community by reducing the onward spread of COVID-19, especially to the most vulnerable;&lt;/li&gt;\n&lt;li&gt;allowing people (and their households) who test negative and whose symptoms are not due to coronavirus to return to their usual routines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What is the Gwent Test, Trace, Protect Service?&lt;/p&gt;\n&lt;p&gt;All five Local Authorities in Gwent and Aneurin Bevan University Health Board (ABUHB) are working together to deliver a contact tracing service across Gwent.&lt;/p&gt;\n&lt;p&gt;The post holder will contribute to the planning, implementation, delivery and evaluation of the incident/outbreak management associated with COVID-19 in the region. The role will provide public health support to the Regional Cell, support local Contact Tracing activity as well as liaise with and engage multi-agency internal and external partners to escalate issues and manage the outbreak response, as required, and contribute to the Gwent COVID-19 Prevention and Response Plan.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work with internal and external partners across the Gwent region to implement and progress action, in a timely manner, particularly in relation to outbreak control and management relating to the COVID-19 response.&lt;/p&gt;\n&lt;p&gt;Applicants will have excellent communication skills, be able to work to tight deadlines and co-ordinate a multi-agency team to ensure a prompt response and take accountability for action.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to developing a bilingual workforce, applications are welcomed from candidates who can demonstrate their ability to work in both English and Welsh as well as those with additional language skills.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Lewis, Principal Public Health Practitioner&lt;br /&gt;rebecca.lewis16@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Cadocs Hospital, Caerleon", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Senior Public Health Incident Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246694", "validThrough": "2020-11-08T23:59:59+0000"}