{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32426", "minValue": "32426", "unitText": "YEAR", "value": "£19.29"}}, "datePosted": "2020-10-26T11:58:01+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Social Worker – Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Salford Royal Hospital – Salford Royal NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt;  Integrated Discharge Team&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £19.29 Saturdays/Nights: £25.08 Sunday/Bank Hols: £30.86&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 36365&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Touching Hands, Hearts, And Minds.. Join the Bank to Start changing Lives&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Outstanding’ in a recent CQC report, working in a location with all the benefits country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a Social Worker available at Salford Royal Hospital.&lt;/p&gt;\n&lt;p&gt;The Main Purpose of this role with be&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n\n&lt;ul&gt;\n&lt;li&gt;To provide a person centred, statutory social work service for the most vulnerable adults and their carers in accordance with local and national policies and procedures&lt;/li&gt;\n&lt;li&gt;To actively support and participate in the development and implementation of integrated, multi-disciplinary working.&lt;/li&gt;\n&lt;li&gt;To take a key role working with partners to safeguard service users through the effective management of safeguarding risk and the recording and sharing of information.&lt;/li&gt;\n&lt;li&gt;To assess and plan person-centred support plans to meet the individual needs of service users to promote their independence.&lt;/li&gt;\n&lt;li&gt;To promote an inclusive, partnership approach supporting the leadership of the team and service through the provision of advice and supervision to colleagues as well as contributing to the effective development of the team.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salford Royal Hospital has an enviable reputation, great supportive team with a family feel.  Based in the heart of the Hospitals main site the post holder here will be pivotal in providing the best level of quality care to varying departments and their patient’s needs.Salford Royal Hospital also benefits from excellent transport links mean their location is commutable from Manchester.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Possession of a recognised Social Work qualification; Degree, CQSW, CSS, Dip SW or equivalent.&lt;/li&gt;\n&lt;li&gt;You must hold a current registration with the HCPC.&lt;/li&gt;\n&lt;li&gt;You must clearly evidence an understanding of the principles and values underlying the Care Act 2014, Mental Capacity Act 2005 and other relevant legislation.&lt;/li&gt;\n&lt;li&gt;You must clearly evidence your ability to develop effective working relationships with service users and their carers’ and show evidence of good assessment practice.&lt;/li&gt;\n&lt;li&gt;You must clearly evidence an understanding of the integration agenda and the promotion of independence (enablement) model of health and social care.&lt;/li&gt;\n&lt;li&gt;Demonstrate a thorough understanding of personalisation and a person centred approach.&lt;/li&gt;\n&lt;li&gt;You must clearly evidence that you have the ability to maintain accurate records and to communicate complex information clearly and concisely both verbally and in written form.&lt;/li&gt;\n&lt;li&gt;You must clearly evidence that you have a clear understanding of the social work role in a multi-disciplinary setting.&lt;/li&gt;\n&lt;li&gt;Demonstrate the ability to develop effective working relationships with other professionals and colleagues.&lt;/li&gt;\n&lt;li&gt;Possess skills of negotiation, mediation and de-escalation - seeking constructive approaches to problem solving.&lt;/li&gt;\n&lt;li&gt;Experience of working with adults/older people.&lt;/li&gt;\n&lt;li&gt;Have a good standard of computer skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Katie Phillips, Recruitment Consultant on 0333 014 4370 or Katie.Phillips&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242307", "validThrough": "2020-12-31T23:59:59+0000"}