{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27741", "minValue": "24491", "unitText": "YEAR", "value": "APT Qualified:£24,491- £27,741 (SCP 17–23)"}}, "datePosted": "2020-09-25T10:44:09+0100", "description": "&lt;p&gt;&lt;strong&gt;The post holder is required to have passed the IAPT Accredited Training allowing them to work as a Qualified Psychological Wellbeing Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About TalkingSpace Plus.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;TalkingSpace Plus: Oxfordshire ‘Improving Access to Psychological Therapies’ Service&lt;br /&gt;We are expanding our Improving Access to Psychological Therapies Service, TalkingSpace Plus in Oxfordshire and we are looking for a Senior PWP. TalkingSpace Plus is a partnership between Oxfordshire Mind, Oxford Health NHS Foundation Trust and Principal Medical Limited.&lt;/p&gt;\n&lt;p&gt;We offer excellent supervision and CPD and training to support career progression. We actively encourage innovation and research with opportunities for collaborations with Oxford Academic Health Science Network, University of Oxford Department of Psychiatry and Department of Experimental Psychology.&lt;br /&gt;For further information and informal visits please contact Kim McMaster, Step 2 Manager on 01865 901222. We look forward to welcoming you to TalkingSpace Plus.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;About Oxfordshire Mind.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We’re Mind, the mental health charity. We’re here to make sure anyone with a mental health problem has somewhere to turn for advice and support; in total over 20,000 people in Oxfordshire access our services each year. With one in four people experiencing a mental health problem at some point in their lives, people need Mind more than ever. Our work includes:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;• The Transitional Supported Housing Recovery Service (part of the Oxfordshire Mental Health Partnership).&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• The TalkingSpace Plus psychological therapy service in partnership with Oxford Health NHS Foundation Trust.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• The Oxfordshire Mind Wellbeing Service, which is part of both the TalkingSpace Plus and Oxfordshire Mental Health Partnerships and includes:&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Five Wellbeing Centres throughout the county&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Public Wellbeing &amp; Information Services&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Physical Activity and Wellbeing&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Benefits for Better Mental Health, a welfare benefits advice service&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Volunteering and Peer Support Opportunities&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Raising awareness and campaigning activity.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;We employ over 100 staff and operate in 28 locations around the county.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Purpose of the Job&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;This post holder will:&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Work within the Oxfordshire ‘Improving Access to Psychological Therapies’ (IAPT) Service which is called TalkingSpace Plus.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Provide a range of high volume low intensity Step 2 cognitive behavioral therapy (CBT) based self-management interventions mainly by telephone contact to clients with mild to moderate anxiety and depression.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• See patients and deliver low intensity interventions in different locations around the County, through telephone and face-to-face contact. Telephone contact normally takes place at TalkingSpace Plus.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• The PWP will be involved in key areas of work to reach people with anxiety and depression currently not accessing the service including patients with comorbid LTC/MUS.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Undertake GP liaison, data entry and follow up work.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Deliver TalkingSpace Plus psycho-educational courses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please ensure you structure your statement by listing and answering the criteria on the personal specification.&lt;/p&gt;\n&lt;p&gt;For more information, please contact&lt;/p&gt;\n&lt;p&gt;recruitment@oxfordshiremind.org.uk or send them to Oxfordshire Mind, 2 Kings Meadow, Osney Mead, Oxford OX2 0DP&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire", "postalCode": "OX2 0DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7485", "longitude": "-1.2775"}}, "title": "Qualified Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916200076", "validThrough": "2020-11-12T23:59:59+0000"}