{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum"}}, "datePosted": "2020-11-03T12:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – &lt;/strong&gt;&lt;strong&gt;Senior Administrator – Children and Young People’s Services School-aged Immunisation Team – Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Edward Jenner Court&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £19,737 to £21,142 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week –37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Be part of our team…&lt;/p&gt;\n&lt;p&gt;An exciting, varied and challenging position has arisen within the Gloucestershire Immunisation Administrative Team for a Senior Administrator.&lt;/p&gt;\n&lt;p&gt;We are looking for a reliable, well-organised and highly motivated individual to provide a comprehensive administration service to the Immunisation Team. You will need to be conscientious, with the ability to work under pressure, plan and coordinate a demanding workload in order to meet strict deadlines. The nature of the work requires accuracy, sensitivity and confidentiality.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills are essential as is the ability to liaise with senior managers, clinical team members and people at all levels. The successful applicant should have robust computer skills and have the ability to learn new skills and processes. A common sense approach to work is important as well as having the ability to handle sensitive and confidential information in a professional manner at all times. You will also be able to work on your own initiative and as part of a team with a positive and solution-focused attitude.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Andrina Clapham, Immunisation Team Administrator on 0300 421 8372 andrina.clapham@ghc.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held Microsoft Teams – Invite to interview will be direct from Andrina Clapham and not NHS Jobs due to interviews being held on Microsoft Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Short Listing: 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GLOUCESTER", "postalCode": "GL3 4AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8471", "longitude": "-2.17646"}}, "title": "Senior Administrator - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253977", "validThrough": "2020-11-20T23:59:59+0000"}