{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc. HCAS"}}, "datePosted": "2020-10-28T10:01:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Neonatal Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Unit is a perinatal referral centre, within the North West Operational Delivery Network. The unit consists of 12 ICU cots, 12 high dependency cots and 13 special care cots. We are the designated Neonatal Surgical Centre for North West London and accept in-utero and post-natal transfers from throughout the South East of England and within London. As well as caring for newborn babies with surgical conditions we also care for sick and premature newborn babies with medical conditions.&lt;/p&gt;\n&lt;p&gt;We serve a maternity department which caters for over 6,000 deliveries per annum, with a private area and maternity led unit. Also there is support by a Fetal Medical Team and an Assisted Conception Unit&lt;/p&gt;\n&lt;p&gt;The challenges are stimulating because we have both medical and surgical babies on our unit. One shift, you could be caring for a baby with extreme prematurity on a ventilator. The next, attending a delivery and caring for a baby with a diaphragmatic hernia or gastroschisis, then you could be preparing them for surgery, right here in the unit. After the operation, you could be working alongside our Neonatal Surgical Nurse Specialist ensuring that evidenced based care is delivered. Of course the care does not stop there and our High Dependency and special care areas also need specialist care provided to the babies and families. The unit also has community outreach as well as Complex Bereavement and Palliative Care Specialist nurses who work on the unit as well as visiting babies and families to ensure smooth integration to their home.&lt;/p&gt;\n&lt;p&gt;Our nurses have the responsibility for planning, managing and coordinating clinical care for babies requiring high level of nursing care and supporting staff to develop these skills on the unit. We focus on developing nursing leaders for the future and therefore provide individualised professional leadership and clinical development.&lt;/p&gt;\n&lt;p&gt;Our nurses work with change and challenge to ensure improved lives and futures for neonates and families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Future &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently undergoing major redesign and refurbishment of our unit, meaning we will have state of the art facilitates with the provision of additional cots and improve service to the population, why not come and be a part of a fantastic unit at this exciting time?&lt;/p&gt;\n&lt;p&gt;Chelsea and Westminster Hospital NHS Foundation Trust aims to be a hospital of choice for patients and an employer of choice for staff. The Trust gained Foundation status in October 2006 and consists of two modern hospitals each with state of the art facilities and a long history of pioneering, innovative healthcare. We are constantly rated among the highest performing hospitals nationally. Our goal to be a hospital of choice by improving all aspects of the patient experience relies upon us having a highly skilled, motivated, diverse, productive and patient focused workforce. In the latest annual national staff survey Chelsea and Westminster achieved the best score for an acute hospital Trust nationally in four areas including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Staff reporting good communication between senior management and staff&lt;/li&gt;\n&lt;li&gt;Staff believing the Trust is committed to their work-life balance&lt;/li&gt;\n&lt;li&gt;Staff believing there are good opportunities to develop their potential at work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Why not work for a top acute Trust committed to flexible working and diversity in employment?&lt;/p&gt;\n&lt;p&gt;We offer employees an inspiring work environment, an opportunity to influence change and room for advancement. As our goal is preparing leaders for the future you will have the opportunity to develop your skills in, Neonatal Gastrointestinal Surgery as well as cardiac experience through our rotation with the Royal Brompton Hospital. You will also enhance your leadership and management skills through shared working with our West Middlesex counterparts where you can gain experience as charge nurse in managing a 16 bedded medical unit. The maternity and special care baby units at West Middlesex University Hospital are proud to announce their reaccreditation as baby friendly, by the UNICEF UK Baby Friendly Initiative (BFI).&lt;/p&gt;\n&lt;p&gt;The Trust welcomes and is committed to flexible working and Diversity in Employment.&lt;/p&gt;\n&lt;p&gt;You will need to meet the essential criteria in the person specification in order for your application to be considered for shortlisting.&lt;/p&gt;\n&lt;p&gt;Please note that there is one post to be based at Chelsea and one at West Middlesex Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date to be confirmed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca DaviesJob titleNeonatal MatronEmail addressRebecca.davies@chelwest.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Rebecca Davies(Neonatal Matron) Rebecca.davies@chelwest.nhs.uk tel-02013157879&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Specialist Neonatal Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245964", "validThrough": "2020-11-11T23:59:59+0000"}