{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T14:46:58+0000", "description": "&lt;p&gt;An opportunity has arisen for an HR Administrator to join our busy HR Team covering our Derbyshire and Nottinghamshire divisions.&lt;/p&gt;\n&lt;p&gt;The post holder will support the delivery of a responsive and efficient HR service to all staff, and managers on a range of employment related matters. The main focus of this role is to provide administrative duties as part of the HR Team.&lt;/p&gt;\n&lt;p&gt;The Divisional HR Team are the first point of contact in relation to a wide range of generalist HR queries, receiving telephone calls and responding to the caller’s enquiries or directing them to the appropriate level of support within the wider HR Team.&lt;/p&gt;\n&lt;p&gt;This post will be suitable for someone who has experience of working in a busy HR office environment, dealing effectively with internal and external customers. Experience of data entry and producing reports is essential and preferably with experience of NHS computerised HR systems.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic individual to be part of a fast paced HR Team. This role requires strong organisational skills and high attention to detail. This is an excellent opportunity to be involved in a varied portfolio of work, helping to deliver an efficient and effective service to our client base covering staff and managers within EMAS. You will need to communicate effectively at all levels, work efficiently as part of a team and also on your own initiative. The successful candidate will preferably be working towards the level 3 CIPD qualification. This role will involve home working, with some requirement for travel.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated individual who will help us excel in the service and care given to patients.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Midlands Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121632"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottinghamshire and Derbyshire (Home Based), Nottingham and Derby", "postalCode": "NG8 3LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.961", "longitude": "-1.19427"}}, "title": "HR Administrator - Nottingham and Derbyshire", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250654", "validThrough": "2020-11-15T23:59:59+0000"}