{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-11-05T14:46:46+0000", "description": "&lt;p&gt;This Senior Psychological Wellbeing Practitioner position provides an exciting opportunity to join a diverse and innovative team, The Wellbeing Team. The steam is based in Watford though nearly all work is currently undertaken remotely from home. There is opportunity to work from base too.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated, organised, flexible and creative individual to join a team of two other SPWPs, with the skills required to lead our team of qualified and trainee PWPs, and contribute to wider clinical leadership, in the service, focusing on projects such as delivery of cCBT, remote treatments and our extensive programme of CBT Workshops/Courses.&lt;/p&gt;\n&lt;p&gt;To do this, you will need to be enthusiastic, conscientious, responsible and hardworking, with excellent clinical skills and knowledge of step 2 working practices and processes.&lt;/p&gt;\n&lt;p&gt;Our service is tasked with increasing access to evidence based psychological therapies for common mental health problems (depression and anxiety disorders), delivered in a variety of modalities including over the telephone, face to face, or online, both individually and in groups. The team consists of primarily psychological wellbeing practitioners, CBT therapists and an administrative support team. The service delivers care in partnership with an employment support team.&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership University NHS Foundation Trust (HPFT) is an exceptional organisation with big ambitions, our aim is to be the leading provider of mental health and specialist learning disability services in the country.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent relationship and communication skills, and demonstrate a range of leadership qualities to engage and enthuse the team. You will need to have good planning skills and oversight, to support the team with achieving the tasks set for the service.&lt;/p&gt;\n&lt;p&gt;As a Trust, and as a service, we are strongly committed to delivering high quality, community oriented services, and to working in partnership with patients, carers, health and social care agencies and the voluntary sector. We appreciate our staff and recognise the importance of staff wellbeing and regular CPD.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel AmiranJob titleTeam LeaderEmail addressrachel.amiran@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "prospect house, watford, Watford", "postalCode": "WD17 3XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6584", "longitude": "-.405292"}}, "title": "Senior Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258181", "validThrough": "2020-11-19T23:59:59+0000"}