{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-16T11:46:42+0100", "description": "&lt;p&gt;The Royal Free London NHS trust is a leading academic and tertiary referral centre for Acute Kidney Injury (AKI), transplantation, dialysis, nephrology and urology - now one of the largest renal units in the UK. We work within a dynamic multidisciplinary team - our world class care values are at the forefront of all that we do. &lt;br /&gt;&lt;br /&gt;Are you an experienced nurse, looking for part time, flexible work ? We are looking for experienced registered nurses to join us on the renal wards at the Royal Free Hospital. We can offer flexible working and will consider all hours – school time working, term time working, job shares and part time hours.&lt;br /&gt;&lt;br /&gt;We are looking to recruit Registered Nurses to work and develop their skills within our friendly, supportive teams. We are able to support newly qualified staff as well as those new to the renal specialty. You will be required to demonstrate commitment to excellent patient experience, in line with the Trust World Class Care Values, and in support of our renal patients throughout their pathway. &lt;br /&gt;&lt;br /&gt;The Renal team at the Royal Free can offer valuable support and development coordinated through our Clinical Practice Educators, available for each ward area. There is also a wealth of support provided from the senior nursing team, renal nurse specialists and the Consultant Nephrologists. This will start with your comprehensive induction and orientation, and continue with access to formal and informal study sessions and development days, including simulation training. Further university accredited courses are available. A Trust preceptorship programme is available to all newly qualified staff. There are many interesting opportunities for further career development with renal services at the Royal Free.&lt;br /&gt;&lt;br /&gt;A career in renal nursing offers all aspects of care: chronic and acute, medical and surgical, curative and palliative care, inpatient and outpatient care, and the care of patients of all ages. Exciting opportunities exist to join our teams working within our inpatient renal wards.&lt;br /&gt;&lt;br /&gt;10 South is a 25 bedded ward caring for a wide range of patients with renal disease and those undergoing surgery for renal cancer. 10 South provides expertise and assistance to our patients on the peritoneal dialysis programme. &lt;br /&gt;&lt;br /&gt;The Royal Free is located within an attractive part of London, with easy access to transport; train, bus or tube. We can offer onsite accommodation, on site leisure facilities and nursery places. Many of our staff commute from outer London and beyond.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;We support flexible working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Martina Bablola&lt;/p&gt;\n&lt;p&gt;mbabalola@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 Staff Nurse - 10 South A - Renal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229967", "validThrough": "2020-11-08T23:59:59+0000"}