{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-10-22T17:00:35+0100", "description": "&lt;p&gt;&lt;em&gt;Applications are invited for Senior Adult Intensive Care Fellow to support&lt;/em&gt; &lt;em&gt;level 3 transport within the trust. You will work as an integral member of the adult intensive care team at Glenfield Hospital and we can support candidates with a special interest in research, echocardiography or another area by mutual agreement, in addition to transport.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Following planned service reconfiguration in UHL, Glenfield’s intensive care unit has expanded to 33 beds admitting in excess of 2000 patients per year.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This is particularly exciting time for Leicester’s Hospitals. We have been given £450m by the Government to provide a host of new facilities and reconfigure services between our three main sites. Flagship projects include a new Children’s Hospital, a new Maternity Hospital, a new Treatment Centre and two new Intensive Care Units. Equally importantly, we are going “paperless”, with a £12m investment in our NerveCentre computer system to help our team deliver world class care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As one of the very largest NHS Trusts in the country, our contribution to our communities goes way beyond direct health; we are the largest employer in our region, we educate and train the staff of the future, we push research boundaries and with our £1bn turnover we are an economic engine for the wider East Midlands and beyond. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The University Hospitals of Leicester NHS Trust consists of three acute teaching hospitals serving the population of Leicestershire and the wider region.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As this post is regulated by the Protection of Children Act 1999, The Criminal Justice Courts Act 2000 and / or the Care Standards Act 2000 an enhanced police criminal records disclosure will be requested by the Trust in the event of a successful application&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Susan DasheyJob titleConsultantEmail addresssusan.dashey@uhl-tr.nhs.ukTelephone number0116 258 2315&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glenfield Hospital, Leicester", "postalCode": "LE3 9QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6537", "longitude": "-1.1793"}}, "title": "Senior Adult Intensive Care Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239452", "validThrough": "2020-11-19T23:59:59+0000"}