{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-15T08:30:30+0100", "description": "&lt;p&gt;We are looking for a qualified mental health professional (nurse, social worker or OT) to work at the heart of our multi disciplinary Community Mental Health Service, to engage with service users, and their families and carers, in a focussed and therapeutic way.&lt;/p&gt;\n&lt;p&gt;We have opportunities across Taunton, Minehead and Bridgwater, and are excited to offer roles in either primary or secondary care or a combination of both. We’d love to hear from you and discuss your interests further so we can find the right role for you.&lt;/p&gt;\n&lt;p&gt;We have significant additional investment in our mental health services in Somerset as a trailblazer site for the Community Mental Health Framework. We pride ourselves on offering an excellent service to people with mental health difficulties in both primary care, within GP surgeries, and secondary Community Mental Health Teams, ensuring that people can have the right help at the right time in the right place.&lt;/p&gt;\n&lt;p&gt;As part of this expansion in our provision, we are developing a comprehensive package of training and supervision for all our staff in CMHS. Regardless of where you are in your career, we are confident that we can offer opportunities for you to develop your clinical skills and knowledge. We will ensure you have all the core skills you need to confidently build relationships with our service users in order to best create and deliver an effective and personalised treatment plan with them.&lt;/p&gt;\n&lt;p&gt;Alongside these core skills, you may be interested in offering psychological interventions, from brief clinical interventions through to specific psychological therapies, such as CAT, CBT or DBT. In this case we can either enable you to utilise your existing skills in this area and/or we can offer the chance to train in these approaches. There will also be opportunities to develop skills in non medical prescribing and other areas, as appropriate to your needs and interests.&lt;/p&gt;\n&lt;p&gt;We are excited to welcome you to the tea, and provide you with the support and training that will make you want to stay with us.&lt;/p&gt;\n&lt;p&gt;We have the following dates available for a remote interview:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5th November 2020&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Clare Munt, Operational Service Manager, Taunton Community Mental Health Service, 07919 173952 or clare.munt@somersrtft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tracy Jardine, Operational Service Manager, Bridgwater &amp; Minehead Community Mental Health Services, 01643 701735 or tracy.jardine@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TBC (Minehead, Taunton or Bridgwater)", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Community Mental Health Professional, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227381", "validThrough": "2020-11-11T23:59:59+0000"}