{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-03T14:01:39+0000", "description": "&lt;p&gt;We are looking for caring and enthusiastic people to join our 24/7 team on the Day Surgery ward, is this you!&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Day Surgery, based at William Harvey Hospital at Ashford, Kent for Band 5 Registered Nurses /ODP to look after our pre and post op patients in a fast paced environment. The successful applicants will be joining a highly motivated and effective team who strive to ensure patient care is at the forefront of our service which are predominantly day cases but will include overnight stay patients.&lt;br /&gt;&lt;br /&gt;We are looking for individuals with experience in care who will offer the highest quality care to our patients, someone who is eager to learn, has a kind and caring attitude towards patients and colleagues and can be a positive team member.&lt;/p&gt;\n&lt;p&gt;We will offer you the full support of our team and a mentor who will work with you while you are getting to know the ward. We will provide any training you require to safely carry out your role and further learning opportunities.&lt;/p&gt;\n&lt;p&gt;The shift patterns the ward work are: 0730-1730, 1100-2030 &amp; 2000-0800 with a small amount of flexibility available or hours worked over five days with shorter shifts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Susan Crowhurst - Theatre Education and Training Facilitator&lt;/p&gt;\n&lt;p&gt;susan.crowhurst@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashord, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Day Surgery Ward Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254251", "validThrough": "2020-11-17T23:59:59+0000"}