{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-10-30T13:59:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Pharmacy Assistant (Assistant Technical Officer) – Band 2 – Pharmacy – Full time and part time positions available – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The West Suffolk NHS Foundation Trust has significantly invested in its pharmacy department to further improve the service we provide to our patients. We have expanded our team of qualified or trainee Pharmacy Assistants. If not already qualified, the successful candidate will be provided with structured training leading to an NVQ Level 2 in Pharmacy Services&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department at the West Suffolk Hospital is a busy department providing medication and pharmaceutical advice to the Trust’s staff and patients. Pharmacy Assistants are vital members of the Pharmacy team who work as part of a multidisciplinary team. The successful candidate will work closely with Pharmacists, Pharmacy Technicians, as well as with ward based nursing and medical staff.&lt;/p&gt;\n&lt;p&gt;This rotational role will involve regularly working in the following areas:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Reception – Receiving requests for both in-patient and out-patient prescriptions both in the In-patient and Outpatient dispensaries&lt;/li&gt;\n&lt;li&gt;Distribution – includes provision of ward based Pharmacy Stock Top up service, and maintenance of pharmaceutical stock.&lt;/li&gt;\n&lt;li&gt;Goods In – Receipt of pharmacy stock, order queries, includes moving and handling of boxes of bulk fluids&lt;/li&gt;\n&lt;li&gt;Dispensing – Dispensing medication for named patient use in both the In-patient and Outpatient Dispensary&lt;/li&gt;\n&lt;li&gt;Production Unit – Assist in cleaning the Pharmacy Sterile Production Unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt; Applicants must be passionate, self-motivated and show a willingness to learn and be trained. The successful candidate must be able to pay close attention to detail and consistently produce work to the required standard, whilst meeting deadlines. The successful candidate must be able to carry out manual handling duties. Previous experience of stock control and working in a pharmacy would be an advantage. The successful candidate will be expected to use the pharmacy stock control, labelling and issuing system and therefore must have appropriate computer skills.&lt;/p&gt;\n&lt;p&gt;The Trust has implemented an extended hours seven day, pharmacy service which has improved patient experience, safety and clinical efficiency. The start and finish times will be dependent on the rostered shifts. The pharmacy department core working hours are between 8.30am and 5.00pm with all staff contributing to the extended hour’s periods on a rostered basis Candidates will be expected to be available to work their agreed contracted hours between 7.00am and 10.00pm over the seven day period, through a variety of flexible working patterns. The majority of full time pharmacy staff work a 7.5 hour working day. NHS Agenda for Change pay enhancements will apply to weekend, bank holiday and unsocial hours worked.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; If you require any additional information not included in the job description please contact either Tina Reynolds or Ali Preston on 01287 713110 or 01284 713233&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Pharmacy Assistant - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250441", "validThrough": "2020-11-13T23:59:59+0000"}