{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-06T10:46:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Shrewsbury and Telford Hospital NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Severn Hospice, North Powys Community Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in Palliative Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is to provide Consultant Specialist Palliative Medicine support to Powys Teaching Health Board Community Palliative Care Nursing Service within North Powys. It will provide medical support for the Clinical Nurse Specialists already working across North Powys and will provide advice to the primary care teams and community hospitals. Support will be provided through close MDT working, outpatient and domiciliary patient assessment.&lt;/p&gt;\n&lt;p&gt;This post will provide an opportunity for a highly motivated and enthusiastic Consultant to contribute significantly to the strategic development and provision of Palliative Care services in Powys. It will suit a first- time post holder and mentorship will be provided. Applicants should be within six months of gaining entry to the specialist register at time of interview.&lt;/p&gt;\n&lt;p&gt;There is already a well-established Community Palliative Care Team working across Powys and close co-operation with the health board, primary care teams, community hospitals, voluntary and charitable sectors including Macmillan. The continuation of this post is well supported by the health board and the Hospice.&lt;/p&gt;\n&lt;p&gt;Candidates for this role must have GMC registration and recent experience within the NHS. The post will be for an initial period of 12 months, with review and potential for permanent appointment thereafter.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Department &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The postholder will work closely with the existing team of five Palliative Medicine Consultants in Shropshire, Telford and Wrekin, providing on call services for the hospices, hospitals and communities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust provides District General Hospital clinical services to the population of Shropshire and mid-Wales with a dedicated Cancer and Haematology Centre at Shrewsbury. There has been centralisation of specialties such as Surgery, Stroke and Cardiac as well as Interventional Radiology to improve services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are ideally located between the north and the south making travelling around the UK extremely easy. As well as being only a short distance from major cities and busy transport links including Birmingham airport, our county also borders with beautiful north Wales which is abundant in outdoor activities, brilliant beaches, and thrilling scenery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Alice O&#39;ConnorJob titleConsultant In Pallative MedicineEmail addressaliceo@severnhospice.org.ukTelephone number01743 236565Additional contact information&lt;/p&gt;\n&lt;p&gt;We want you to find out more about the department and our hospice or even arrange a visit. Please also take the time to read any supporting documentation to really get to know us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion, please contact: Dr Alice O’Connor or Prof Derek Willis, Medical Director &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Severn Hospice, Bicton Heath, Shrewsbury SY3 8HS. Tel: 01743 236565&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Severn Hospice, Shrewsbury, Shrewsbury", "postalCode": "SY3 8HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7204", "longitude": "-2.80233"}}, "title": "Consultant In Palliative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259290", "validThrough": "2020-12-04T23:59:59+0000"}