{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T12:47:03+0000", "description": "&lt;p&gt;Birmingham Community Healthcare (BCHC) has established an enviable reputation for providing high quality, accessible and responsive community and specialist services within Birmingham and the West Midlands. The Trust delivers over 100 clinical services, out in people’s homes and in over 400 hospitals, health centres, schools and clinics.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a new Local Security Management Specialist (LSMS) at our Trust Headquarters at Priestley Wharf. We have a dedicated workforce of compassionate, skilled professionals who are well supported and we are committed to making Birmingham Community Healthcare a great place to work.&lt;/p&gt;\n&lt;p&gt;As Local Security Management Specialist you will interpret national guidance and policy and to lead the development and implementation of local policies, procedures and guidance on behalf of the organisation in respect of security management matters. To act as the key point of contact for both staff within the organisation, providing them with expert support and externally as the lead point of communication and reporting on these matters.&lt;/p&gt;\n&lt;p&gt;To lead the security management agenda in terms of both physical and ensure that suitable and sufficient risk assessments are undertaken and recorded and that statutory reports are compiled and submitted internally to various Trust Committees. To co-ordinate and provide expert risk assessment and advice in accordance with Health and Safety legislation.&lt;/p&gt;\n&lt;p&gt;You will be expected to have an exceptionally high level of interpersonal and communication skills. You will regularly communicate with Senior/Director level staff within external NHS and non-NHS partners, the emergency services and a variety of Governmental/Regional and Local bodies.&lt;/p&gt;\n&lt;p&gt;You will report to Head of Risk Management and Emergency Planning and your main duties will include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the national framework required for the local delivery of professional and highly skilled security management work to allow the organisation to better protect its resources.&lt;/li&gt;\n&lt;li&gt;Lead the security management agenda on behalf of the organisation and produce a work plan for the financial year for approval by the Security Management Director and the Board.&lt;/li&gt;\n&lt;li&gt;Provide assurance to the Board and senior managers on security related issues by the investigation, prevention and detection of breaches of security.&lt;/li&gt;\n&lt;li&gt;Maintain comprehensive and accurate records of any breaches or suspected breaches of security and maintain these in accordance with information security principles.&lt;/li&gt;\n&lt;li&gt;Identify and undertake comprehensive security audits of local premises arrangements.&lt;/li&gt;\n&lt;li&gt;Ensuring that the organisation has suitable and sufficient training programmes in relation to security management and staff safety and to provide assurance to the Board that these are in place.&lt;/li&gt;\n&lt;li&gt;Ensure there are sufficient systems in place to protect staff who may be working alone in the community.&lt;/li&gt;\n&lt;li&gt;Provide an Annual Security Management Report.&lt;/li&gt;\n&lt;li&gt;To participate in regular action centred and goal focused team meetings. To agree service and individual objectives and development plans.&lt;/li&gt;\n&lt;li&gt;Attend relevant Committees in order to progress the delivery of the Security Management agendas i.e. Risk Management, Audit and Health and Safety Committees.&lt;/li&gt;\n&lt;li&gt;Contribute to an appropriate annual report to the Risk Management and Quality, Governance and Risk committees and the Board&lt;/li&gt;\n&lt;li&gt;To develop key performance indicators and to monitor security management performance against these; creating regular, formal reports to the Audit Committee and Health and Safety Committee.&lt;/li&gt;\n&lt;li&gt;To participate in departmental business planning processes and to prepare bids for funding where necessary&lt;/li&gt;\n&lt;li&gt;To and contribute to the Risk Management annual report presented&lt;/li&gt;\n&lt;li&gt;In conjunction with the Head of Learning and Development, to monitor and report performance against mandatory training requirements in relation to security management training requirements, Including Conflict Resolution Training (CRT)&lt;/li&gt;\n&lt;li&gt;Undertake the complex analysis and follow up of clinical and non-clinical incident reports, reporting on these to senior managers, appropriate committees and working groups&lt;/li&gt;\n&lt;li&gt;To interrogate the incident reporting database and to prepare comprehensive quarterly incident trend reports.&lt;/li&gt;\n&lt;li&gt;to provide expert advice to the Divisions in the analysis of security management issues.&lt;/li&gt;\n&lt;li&gt;Work with the Legal Services team to review incidents that may give rise to complaints or claims and to promote greater communication and integration between the two departments.&lt;/li&gt;\n&lt;li&gt;Support root cause analysis and serious incident investigations in order to identify, assimilate and analyse all the relevant information in terms of sequence of events and contributory factors. To identify and share organisational learning as a result of findings&lt;/li&gt;\n&lt;li&gt;To provide expert support to divisions following a Serious Incident by providing information to the police, HSE, MHRA and other government external regulatory bodies.&lt;/li&gt;\n&lt;li&gt;To develop and implement audit systems and tools throughout the organisation and to undertake regular audits to ensure legislative, policy and assessment compliance across the organisation. Formally report findings to relevant senior managers and the Health and Safety Committee.&lt;/li&gt;\n&lt;li&gt;Act as an expert resource to advise the purchasing department regarding appropriate equipment purchase, security systems (Inc. CCTV and Access Controls)&lt;/li&gt;\n&lt;li&gt;Act as an expert resource to advise the Learning and Development department on training needs and provision.&lt;/li&gt;\n&lt;li&gt;Contribute to the publication of a regular risk and security management newsletter (Compass), using a variety of computer software and resources.&lt;/li&gt;\n&lt;li&gt;To undertake complex risk assessments and to produce post assessment reports for managers that detail good practice&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priestley Wharf, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 7 Local Security Management Specialist (LSMS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242518", "validThrough": "2020-11-13T23:59:59+0000"}