{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum including HCA"}}, "datePosted": "2020-11-05T16:30:58+0000", "description": "&lt;p&gt;An exciting and rewarding opportunity has arisen for several dynamic individuals to join our Digital First Programme Team, providing project support for the delivery of digital maturity and key training for care homes in North East London.&lt;/p&gt;\n&lt;p&gt;The post is for an individual with experience of supporting the planning, implementation and evaluation of projects, and does not necessarily need specific Digital Experience, although this would be advantageous.&lt;/p&gt;\n&lt;p&gt;The Digital Support Officer will report to, and work with, the Digital Project Manager for Remote Monitoring Implementation in North East London Care Homes, as well as be accountable to the Care Home Programme Manager. The focus of this role will be to work with care providers to support the delivery of digital solutions, particularly with regards to enabling remote consultations between Primary Care Networks, MDTs and Care Homes, as well as undertaking reporting and supporting the delivery of training.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing high quality project and administrative support, maintaining good information management practices and supporting with research development. You will also hold a key role in building and maintaining excellent working relationships with stakeholders. Please see the Job Description for full details and requirements.&lt;/p&gt;\n&lt;p&gt;The Digital Support Officer will be supporting the delivery of the nationally funded Digital First Programme, within one of its 12 major projects: Improving Digitisation of Care Home Support.&lt;/p&gt;\n&lt;p&gt;The Digital First Programme is looking for a variety of applicants from a diverse range of backgrounds, expertise, and professions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameELHCP TeamEmail addresselhcp.digitalfirst@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tower Hamlets Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128184"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mile End Hospital, London", "postalCode": "E1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5245", "longitude": "-.04262"}}, "title": "Digital Project Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258565", "validThrough": "2020-11-19T23:59:59+0000"}