{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36069", "unitText": "YEAR", "value": "£36,069 to £42,712 pa inc"}}, "datePosted": "2020-11-06T08:45:35+0000", "description": "&lt;p&gt;An opportunity has arisen for a Band 6 Senior Staff Nurse to join the Critical Care Team based at Ealing Hospital, London North West Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit Consists of a 9 bedded ITU / HDU Intensive Care and High Dependency Unit where we pride ourselves on being at the cutting edge of innovation and service development. The Critical care Unit also operates a 24/7 Critical care Outreach Service supporting patients throughout the hospital as well as supporting teaching and training.&lt;/p&gt;\n&lt;p&gt;As a Critical Care Unit we specialise in providing a high standard of medical and post-operative care for patients undergoing a variety of procedures. The majority of our admissions are medical covering Level 2 and Level 3 types of care for organ / system support such as respiratory,renal and cardiovascular support. We also work closely with other specialist units around the UK such a Respiratory and Renal Support Units.&lt;/p&gt;\n&lt;p&gt;The Unit is a long standing Member of ICNARC, submitting data to the largest health database in the UK. We are also part of the North West London Critical Care Network.&lt;/p&gt;\n&lt;p&gt;Ealing Hospital Site is part of a larger Critical Care Unit within the LNWH Trust and staff may be required to rotate to other sites within the Trust, when required. The post-holder must be able to care for COVID positive patients and AGPs/ Proned patients.&lt;/p&gt;\n&lt;p&gt;The role of the Band 6 Senior Staff Nurse would involve providing a high standard of Nursing care, strong leadership and effective mentorship to junior staff. The Senior Staff Nurse will work closely with all the Senior Sisters and the Modern Matron to ensure the smooth running of the Critical Care Unit, with support for the Outreach Service. The post-holder will be expected to work closely with all members of the Multi-disciplinary team within the Speciality, to ensure quality, efficiency and productivity of our service. This is the ideal work environment to use and develop your specialist knowledge and skills in a friendly, innovative environment, with a warm and welcoming Team. We are a culturally diverse workforce, who fits well with our patient population, reflective of the cultural mix of West London.&lt;/p&gt;\n&lt;p&gt;The Unit offers access to comprehensive education programmes and development opportunities provided within and outside of the trust as well as promoting attendance and participation at International Critical Care events.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria MarslandJob titleActing-up MatronEmail addressVictoria.marsland@nhs.netTelephone number0208 967 5751Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Victoria Marsland / Liza Rabajante / Martina Eliasova on 0208 967 5593/5751 if you require any further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Hospital Site base / Cross site, Southall", "postalCode": "UB1 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.507", "longitude": "-.346317"}}, "title": "Senior Staff Nurse - Intensive Care Unit / Cross Site", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258927", "validThrough": "2020-11-20T23:59:59+0000"}