{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109830", "minValue": "82022", "unitText": "YEAR", "value": "£82,022 - £109,830 per annum, including London Wei"}}, "datePosted": "2020-10-15T16:30:42+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 13,000 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department of Clinical Gerontology at the Princess Royal University Hospital (PRUH) is seeking to expand their team of consultants by appointing new proactive, compassionate and committed colleagues to share in the challenge of providing patient centred specialist care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department offers a broad range of sub-specialist opportunities such as the ongoing development of the multi-disciplinary frailty service, acute frailty wards, a specialist dementia ward and orthogeriatrics as well as the general geriatric wards. We offer a range of outpatient services including tilt table testing, falls clinics, movement disorder clinics and a bone health clinic. We are part of One Bromley; a care partnership with local health providers, social care services and the third sector providing joined up and improved care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The London Borough of Bromley has a growing, aging population. It already has the largest population of older people of all the London Boroughs with 58,200 people aged 65+ years, about 17% of population. It is expected that this will increase to 82,500 (42% increase) by 2035.The older population accounts for 53% of emergency admissions and 72% of bed days. We see this as a challenge to take a different approach to the care of our elderly population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our vision is to build upon our relationship with our external partners and develop a truly integrated and multidisciplinary frailty service spanning the community, intermediate care and acute settings. A service where care is tailored to meet the individualised needs of the patient, where we stop doing things ‘to’ and ‘for’ patients and start doing things ‘with’ them.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a key member of our multidisciplinary team, you will need to be flexible and creative in developing new ways of working. Whilst we are looking for applicants with passion for frailty, we encourage candidates with other subspecialty interests to apply. Applicants should hold a CCT or equivalent in both Geriatric and GIM, or be a Specialist Registrar within six months of expected date of receipt of their CCT at the time of interview. We offer a generous relocation package, and opportunities exist for additional PAs for lead roles, educational supervision, risk, governance and patient outcomes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Princess Royal Hospital and Orpington Hospital are based in Locksbottom and Orpington. These are highly sought after locations due to its close proximity to its good primary and secondary schools. Bromley also has nationally recognised grammar schools. The thriving town centre of Bromley with retail, entertainment, gyms, restaurants, cafes and bars means that many staff live in the local area, enhancing the community spirit within the hospitals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;From Bromley or Orpington, trains will take into the centre of London in 20 minutes. We are equally well located for escaping to the countryside of Kent. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Aza Abdulla, Clinical Lead Telephone number01689 865848&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mr Nick Yard, Service Manager on 01689 865878 or e-mail nicholas.yard@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital &amp; Orpington Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Consultant Physician in Clinical Gerontology &amp; Frailty", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229017", "validThrough": "2020-12-13T23:59:59+0000"}