{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615"}}, "datePosted": "2020-10-21T15:01:21+0100", "description": "&lt;p&gt;&lt;strong&gt; (Full Time/Part Time, Hours Negotiable)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With our expanding services an exciting career opportunity has arisen for a part time 1st level registered nurse to join our team on the Endoscopy Unit at Louth. Although experience would be desirable, full training will be given as this is a developmental post which will cover all areas of Endoscopy.&lt;/p&gt;\n&lt;p&gt;The Endoscopy Units’ within the Trust perform a variety of standard and advanced Endoscopic procedures for both out-patients and in-patients including; gastroscopy, flexible sigmoidoscopy, colonoscopy, oesophageal stenting and other specialist work is also undertaken by individual consultants.&lt;/p&gt;\n&lt;p&gt;The Endoscopy Unit is presently open between 0800hrs and 19.00hrs 7 days a week, these hours are subject to review to meet the needs of the service and evening work will be introduced at later date. The On Call Nurse Bleed Rota has been implemented at Lincoln and Pilgrim Hospital, all Band 5’s after appropriate training will be expected to participate, at the moment Louth does not take part in this but may be subject to change in the future. Our aim is to provide the very highest standards of care to patients and relatives a like ensuring privacy and dignity is maintained at all times.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to the Endoscopy Sister the successful candidate will be responsible for the decontamination of endoscopes, assisting endoscopists in the procedure room, be the patients named nurse acting as their advocate ensuring privacy and dignity throughout the endoscopy journey. They should be able to demonstrate good leadership skills, be adaptable to a changing environment and possess good written and verbal communication skills. There will be a need to work flexibly to meet the needs of the Endoscopy service, a commitment to personal/professional development is required and a teaching/mentorship certificate would be desirable. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;With our expanding services an exciting career opportunity has arisen for 1.48 WTE 1st level registered nurse to join our team on the Endoscopy Unit. Although experience would be desirable, full training will be given as this is a developmental post which will cover all areas of Endoscopy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMandy LoveleyJob titleSisterEmail addressMandy.Loveley@ulh.nhs.ukTelephone number07467353791 or 01507 631236&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Louth County Hospital, Louth", "postalCode": "LN11 0EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3706", "longitude": "-.00913"}}, "title": "Band 5 Staff Nurse Endoscopy - Louth", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237017", "validThrough": "2020-11-11T23:59:59+0000"}