{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75914", "minValue": "75914", "unitText": "YEAR", "value": "75914"}}, "datePosted": "2020-10-16T12:46:05+0100", "description": "&lt;p&gt;We are seeking to appoint a values driven inspirational Divisional Director of Nursing who will provide professional inclusive leadership to Division 1.&lt;/p&gt;\n&lt;p&gt;Services with the Division include Trust-wide provision of over 75 Operating Theatres, 200+ Consultant Anaesthetists in addition to departments including Radiology &amp; Medical Physics, Laboratory Services, Pharmacy, Critical Care, Pre-Admission Services, Short Stay / Ambulatory Care Services &amp; Pain Services. These services pan 4 hospital sites across Birmingham and Solihull and the Division employs over 5,500 staff alone.&lt;/p&gt;\n&lt;p&gt;Working in partnership with the Divisional Managing Director and Divisional Medical Director the post holder will provide senior management and clinical leadership across the operational, quality, safety, risk, clinical governance and patient experience agendas throughout the Division. The role will take professional responsibility for Nursing, Theatre Practitioners, &amp; Allied Healthcare Professionals&amp; Scientists.&lt;/p&gt;\n&lt;p&gt;This role requires a dynamic, innovative, self-assured clinical leader who is able to think and plan strategically.You will need to have the energy and a determination to achieve, and have extensive operational and leadership experience in managing operational / strategic services in a large complex Acute Healthcare organisation.&lt;/p&gt;\n&lt;p&gt;As an experienced leader, you&#39;ll be able to demonstrate your vision and drive to lead and inspire our clinical workforce through transformational change, contributing to plans to ensure we are fitfor the future, whilst continuing to provide first-class care to our patients during this transformation.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;With enthusiasm and optimism about changing the NHS through system working, whilst acknowledging day to day pressure.&lt;/li&gt;\n&lt;li&gt;With well-developed practical problem solving skills, the ability to dissect both strategic and operational challenges through the application of data, professional knowledge and policy application.&lt;/li&gt;\n&lt;li&gt;Who has passion for improving outcomes for patients.&lt;/li&gt;\n&lt;li&gt;Who can demonstrate skills in delivering sustainable and effective change whilst maintaining operational delivery.&lt;/li&gt;\n&lt;li&gt;Who is a leader that can work collaboratively with staff and ensure that staff health, well-being and experience is central to culture transformation across the Division.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Supported by two Deputy Directors of Nursing you will be a key member of the Trust senior leadership team and will lead and support the quality, workforce and organisational development of all the nursing and non-medical clinical teams within the Division.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will share out Trust values and our passion and tenacity for providing high quality, compassionate care to our community.Successful candidates will have the relevant experience, qualifications and significant leadership skills in an acute complex healthcare provider organisation to undertake this role. You should have demonstrable experience in improving and sustaining patient outcomes and atrack record in operational management of a large acute hospital service. With a passion for transformational clinical leadership the ideal candidate will be responsive to new challenges, see opportunities, ensure that new ways of working and delivering care are reflected clearly in objectives and in a collective sense of mission and that the staff are engaged, supported&amp; listened to.&lt;/p&gt;\n&lt;p&gt;To be short-listed applicants will need to detail in their supporting information how they can demonstrate the essential requirements of the experience and skills section of the person specification. The post holder will be expected to work Monday - Friday as core business hours and will participate in the on call managers rota out of hours / weekends and public holidays. If you are looking for an opportunity which will put you at the forefront of driving innovative change in order to influence practice, as well as a passion for high quality patient care and staff experience then please contact:-&lt;/p&gt;\n&lt;p&gt;Ms Yma Choudhury, Managing Director, Division 1 via Katie Kelly, PA &amp; Office Manager on 0121 371 2782.&lt;/p&gt;\n&lt;p&gt;Ms Margaret Garbett, Trust Director of Nursing or Ms Lisa Stalley Green, Executive Chief Nurse via Sam Fryer, EA to Chief Nurse on 0121 424 0278.&lt;/p&gt;\n&lt;p&gt;Interview and selectionwill be conducted in two parts - Assessment centre with successful candidates progressing to a detailed interview. The assessmentcentre will be held on 11 November 2020 and interviews on 12 November 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Director of Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230243", "validThrough": "2020-11-06T23:59:59+0000"}