{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33988", "minValue": "33988", "unitText": "YEAR", "value": "£33,988.50 per annum"}}, "datePosted": "2020-10-07T10:12:56+0100", "description": "&lt;p&gt;About The Role&lt;/p&gt;\n&lt;p&gt;The Huntercombe Hospital Maidenhead is part of The Huntercombe Hospitals Group providing renowned inpatient care within a CAMHS service. We require a Social Worker to join our dedicated department and work in partnership with a busy multi- disciplinary team. As part of the social work team we require someone who is able to provide expert communication skills, with the sensitivity and skills to work collaboratively with children and young people. Working and in partnership and liaising with external agencies and families is integral to the role.&lt;br /&gt;&lt;br /&gt; The role is varied and is an opportunity to gain additional skills and experience within a CAMHS environment. We are looking for enthusiastic social worker with an interest in working within a CAMHS setting. Applicants are required to have a good understanding and awareness of social work values and theory.&lt;br /&gt;&lt;br /&gt; A comprehensive knowledge of the Children’s Act (1989)(2004) and The Working Together to Safeguard Children 2018 are essential. Within this challenging but rewarding environment an awareness of Mental Health Act 1983 and 2007 would also be beneficial together with an understanding of childhood trauma and it’s implications on emotional and mental health.&lt;br /&gt;&lt;br /&gt; A diploma in Social Work will be required for this role along with current Social work England registration.&lt;br /&gt;&lt;br /&gt; For an information pack including application form and job description, please contact.&lt;br /&gt;&lt;br /&gt;About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Generous annual leave allowance&lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;br /&gt;&lt;br /&gt; For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest. &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;About The Company&lt;/p&gt;\n&lt;p&gt;Huntercombe Group are one the leading specialist healthcare providers, with hospital and centres throughout England and Scotland, delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adult mental health services (CAMHS) including eating disorders and social care for children with special needs.&lt;br /&gt; Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents&lt;br /&gt; We’re proud to have recruited some of the most experienced doctors, nurses and therapists in their fields and alongside our supportive stable Management structure we hope that it’s you that can help make a difference to our excellent teams and workforce.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taplow, Nr Maidenhead &amp; Slough", "postalCode": "SL6 0PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.659092"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215914", "validThrough": "2020-11-30T23:59:59+0000"}