{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-04T10:22:32+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Registered Nurse who can demonstrate the delivery of high quality clinical patient care.  The successful Registered Nurse will be an excellent communicator and team player, be flexible, motivated and committed to the highest standards of patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include: &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;You’ll get to enjoy working in a close multi-disciplinary team where there is real respect and a drive for high quality, evidence based safe patient care in an innovative modern working environment that has recently been refurbished to an exceptional standard.   You will benefit from a varied surgical caseload which includes Orthopaedics, spinal, colorectal, breast, gynaecology, urology, bariatric, general and cosmetic surgery; the care will broaden your skills and experience as well as support and training opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will require:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current Registered Nursing Qualification&lt;/li&gt;\n&lt;li&gt;Sound written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Desire to expand skills and knowledge&lt;/li&gt;\n&lt;li&gt;Experience of looking after surgical patients (or an ability to develop these skills)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Free onsite parking and a subsidised staff restaurant cooked fresh by our chief&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;li&gt;Wellbeing centre and access to 24/7 employee assistance line for free advice&lt;/li&gt;\n&lt;li&gt;Free DBS checking&lt;/li&gt;\n&lt;li&gt;Long service, Employee recognition and appreciation awards&lt;/li&gt;\n&lt;li&gt;Hospital bonus / employee incentive scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of Northamptonshire’s leading private and NHS ‘Choose &amp; Book’ hospitals, the Woodlands is at the forefront of medical technology and patient care. If you are excited about pushing your ability to the next level, whilst at the same time becoming part of a friendly team renowned for excellence and exceptional patient satisfaction then the Woodlands Hospital is for you.  The Hospital has 4 state of the art theatres, with 23 In-patient beds including two SECU beds for patients who require increased monitoring post operatively.  &lt;br /&gt;The hospital offers a wide variety of specialties and prides itself on providing a high standard of care to both patients and staff.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering", "postalCode": "NN16 8XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4119", "longitude": "-.768808"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255356", "validThrough": "2020-11-22T23:59:59+0000"}