{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-04T16:01:09+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Locality Manager to work as an integral part of the senior leadership team in Secure Inpatients Service, Forensic Directorate.&lt;/p&gt;\n&lt;p&gt;The post holder will lead on staffing and recruitment; staff wellbeing; service development opportunities and visibility within the Secure Inpatient Service. Our Forensic Secure Inpatients Service includes 17 ward areas with each area providing specialist care for the client group. The service provides mental health and learning disability care for men and women in a low and medium secure setting. You will be required to work closely with the Locality Manager with responsibility for Health and Justice services to ensure a positive patient experience across service lines &amp; the delivery of the highest standards of care.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work with the Head of Service, Clinical Director and wider Directorate Team (including partner agencies) to lead the effective and efficient management and development of a range of complex services.&lt;/p&gt;\n&lt;p&gt;The post will encompass a range of operational and strategic management issues across a wide range of complex services and local partnership arrangements.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual with proven experience in working in a management role who wishes to continue to develop their management skills in an exciting environment.&lt;/p&gt;\n&lt;p&gt;Significant experience and knowledge of working within operational services is essential. A requirement of the role is to be part of the locality on call rota.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be able to work well within a team yet able to work independently with minimal supervision. You will be educated to degree level, possessing excellent interpersonal skills and be committed to providing a high standard of care to individuals with mental health problems and their families.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for this post the successful applicant will be confirmed in post on a permanent basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simon Lancashire, Head of Service - Secure Inpatient Services&lt;/p&gt;\n&lt;p&gt;simon.lancashire@nhs.net&lt;/p&gt;\n&lt;p&gt;07788415313&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roseberry Park Hospital, , Middlesbrough", "postalCode": "TS4 3AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.554", "longitude": "-1.21524"}}, "title": "Locality Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256543", "validThrough": "2020-11-18T23:59:59+0000"}