{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-26T13:31:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Gynaecology Nurse - Birchington Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Welcome to East Kent Hospitals NHS University Foundation Trust and thank you for considering us as your choice of employer. The Trust is in an area that has great transport access to London &amp; the continent but is also set in beautiful countryside with easy access to many great Kentish beaches and towns.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint enthusiastic and proactive Gynaecology Nurses who are passionate about delivering a high quality service to our women. We welcome new ideas and suggestions for service improvement for women to have the best possible experience in our care.&lt;/p&gt;\n&lt;p&gt;Birchington is an twenty one bedded inpatient ward, with an Early Pregnancy Assessment Clinic, a Gynaecology Emergency Assessment Unit and a Pre-assessment clinic. There are development opportunities to expand your skills as well as flexible working options.&lt;/p&gt;\n&lt;p&gt;We are on an improvement journey and we know that our staff are key to this progress. Our latest staff friends and family test tells us that we are making really big improvements on achieving ‘Great Place to Work’ – and we welcome you to be a part of this.&lt;/p&gt;\n&lt;p&gt;The Trust covers a population area of 760,000 and we need people like ‘You’ with fresh ideas and a great attitude to come and join us on our journey. We are in the middle of our journey with lots of improvements underway or planned.&lt;/p&gt;\n&lt;p&gt;If you feel you have these qualities and want to join our teams at a very exciting time we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDeborah Wilson-WebbJob titleWard ManagerEmail addressd.wilson-webb@nhs.netTelephone number01843 234201Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabth The Queen Mother Hospital., Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Registered Nurse in Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242665", "validThrough": "2020-11-09T23:59:59+0000"}