{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-30T13:45:53+0000", "description": "&lt;p&gt;Post Title Community Diabetes Specialist Nurse &lt;br /&gt;Service/Ward/Department Integrated Community Diabetes Service (Adults)&lt;br /&gt;Borough Bury and HMR&lt;br /&gt;Band &amp; salary scale Band 6&lt;br /&gt;Hours of work 37.5 hours&lt;/p&gt;\n&lt;p&gt;Permanent/Fixed term Permanent&lt;br /&gt;Base Primary base (Bury) post holder will be required to work across bases Bury and HMR (Phoenix)&lt;/p&gt;\n&lt;p&gt;Service/Ward/Department Summary:&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Diabetes Specialist Nurse to join our friendly, forward thinking and supportive Integrated Community Diabetes Service that provides diabetes care to adult across Bury, Heywood, Middleton and Rochdale.(HMR)&lt;/p&gt;\n&lt;p&gt;The Integrated Community Diabetes Service provides specialist clinical diabetes care across Bury and the Borough of Rochdale. The service provides support between the primary &amp; secondary care interface, in preventing unnecessary readmissions. The service also provides support, advice, education and information relating to the management of patients, carers, the public, other health professionals &amp; the voluntary sector.&lt;/p&gt;\n&lt;p&gt;The team is based at Moorgate Primary Care Centre, Bury and Phoenix Centre (HMR) and offers specialist diabetes interventions to patients, families and carers across a range of community care settings.&lt;/p&gt;\n&lt;p&gt;• The patient focused objective is to improve the patient’s diabetes status and to promote a culture that supports self-management &lt;br /&gt;• Continue to develop &amp; deliver ongoing education &amp; guidelines for practice staff to improve the quality of diabetes care&lt;br /&gt;• The service objectives are also to work closely with the CCG to support, and manage the care of patients with diabetes.&lt;br /&gt;• Assist to reduce readmissions, support people out of hospital where possible and improve symptoms and quality of life with patients with diabetes&lt;/p&gt;\n&lt;p&gt;The candidate must have current NMC registration first level nurse and current experience and knowledge of all aspects of the diabetes specialty. An independent prescriber is preferred or working towards or interested in gaining this qualification to initiate and adjust injectable and oral diabetes medication.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supported through a comprehensive induction programme, with access to clinical supervision and continuing professional development. Their contribution to future service development will be positively encouraged.&lt;/p&gt;\n&lt;p&gt;Role Summary:&lt;/p&gt;\n&lt;p&gt;To work autonomously as well as being an integral member of the established Diabetes Specialist Nurse and wider multi-disciplinary diabetes team in the provision of a specialist, evidence based and high quality diabetes service. Contribute to the organisation and delivery of ongoing education and training for patients, carers and other health professionals and assist in the implementation of local diabetes care strategies and guidelines.&lt;/p&gt;\n&lt;p&gt;Key Responsibilities of the Post: &lt;br /&gt;You will have clinical responsibility for shared patient caseload; working in partnership with patients and families to promote choice and ensuring the delivery high quality care. This will include:&lt;/p&gt;\n&lt;p&gt;• Acting as a specialist resource; providing clinical expertise, specialist diabetes advice and support to health and social care staff across service boundaries.&lt;br /&gt;• Promoting choice by using advanced communication skills to negotiate treatment and care options for patients, carers and their families whilst ensuring the delivery of high quality care&lt;br /&gt;• Organisation and delivery of structured patient education programmes.&lt;br /&gt;• Delivering evidence based individualised and personalised care through holistic needs assessment, care planning and evaluation of care and all care interventions.&lt;br /&gt;• Where appropriate promote concordance and achieve continuity of care through the use of non-medical prescribing&lt;br /&gt;• Maintenance of Clinical Professional Development and registration&lt;br /&gt;Key requirements of the person specification&lt;br /&gt;• 1st Level Registered Nurse&lt;br /&gt;• 1st Level degree in a related subject or on a degree pathway&lt;br /&gt;• Current NMC registration &lt;br /&gt;• Evidence of professional development at Certificate/ Diploma/ Degree level in adult Community Nursing e.g. District Nurse, Practice Nurse or Community Nurse&lt;br /&gt;• An accredited course in diabetes ENB 928/Warwick Diabetes Course or equivalent&lt;br /&gt;• Mentorship/teaching or other recognised teaching qualification &lt;br /&gt;• Non-medical prescriber or be willing to undertake and successfully complete the course&lt;br /&gt;• Evidence of continuing Professional Development and completed portfolio&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kim Hopkinson&lt;/p&gt;\n&lt;p&gt;Job title Diabetes specialist nurse/Team lead&lt;/p&gt;\n&lt;p&gt;Email address kim.hopkinson@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 447 9847&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorgate Primary care center, Bury", "postalCode": "BL9 0NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5955", "longitude": "-2.28862"}}, "title": "Diabetes Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250391", "validThrough": "2020-11-15T23:59:59+0000"}