{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 p.a."}}, "datePosted": "2020-10-28T10:46:25+0000", "description": "&lt;p&gt;Due to internal promotion, an exciting opportunity has arisen for a pharmacy technician to join the Pharmacy team at St. Ann&#39;s Hospital in Poole. This is a full time position, however a job share position maybe possible following interviews. This job role would be ideally suited to a newly qualified pharmacy technician or a technician who wishes to broaden their experience by working in the mental health sector.&lt;/p&gt;\n&lt;p&gt;The department provides pharmaceutical services and support to inpatient and outpatient units in both mental health and community hospital services, community teams and other sites around the Trust. We have a good track record in enabling staff to progress their career within our pharmacy department. The post will provide an excellent opportunity to gain diverse varied experience and for possible career development as vacancies arise not just within St Ann&#39;s pharmacy itself but also the wider pharmacy service within the Trust. &lt;br /&gt;&lt;br /&gt;This post involves dispensary based and patient facing responsibilities including ward based medicines management activities e.g. medicines reconciliation, assessing patients&#39; own medication, medication supply and supporting patients to get the optimum use from their medicines. A locally or nationally recognised Medicines Management qualification is required and full support and training will be provided to achieve this if it is not already held.&lt;/p&gt;\n&lt;p&gt;Four days a week you will be working with the St Anns Pharmacy team supporting the dispensary and in-patient wards. One day a week you will be required to travel off site to work with our very experienced Medicines Management Team to support the community hospitals and their patients when discharged this will require travelling in and around the whole of Dorset. This is an exciting opportunity to gain a wider knowledge of services provided by Dorset Healthcare and full training and support will be given.&lt;br /&gt;&lt;br /&gt;You should be an enthusiastic, highly self-motivated technician, registered with the GPhC and with an interest in mental health. We welcome applicants from all pharmacy sectors including Community, Retail, Hospital, or Prison pharmacy practice where you will have gained relevant experience and transferable skills for the role. You will have excellent communication skills and be capable of working on your own as well as a good team player.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A full driving licence and own form of transport is essential for this full-time post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Tracy Sandford&lt;/p&gt;\n&lt;p&gt;Job title: Senior Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Email address: tracy.sandford@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01202 492042&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Tessa Seward, Pharmacy Operations Manager or Tracy Sandford, Senior Pharmacy Technician on 01202 492042&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Anns Hospital, Poole", "postalCode": "BH13 7LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6986", "longitude": "-1.92791"}}, "title": "Pharmacy Technician, Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246149", "validThrough": "2020-11-11T23:59:59+0000"}