{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-28T16:01:05+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;We are currently looking for enthusiastic, highly motivated Registered Nurses to work within our Neurology Unit at University Hospital of North Midlands.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are a dedicated Neurology Unit, consisting of 21 inpatient beds including an elective bed covering Video Telemetry; alongside the elective admissions we also admit directly from the Emergency Department and Outpatient Clinics as required. Within the Neurology Unit we have a Neurological Ambulatory Clinic which is dedicated to patients requiring regular infusions to manage their condition; this is a day case unit which covers Monday to Friday at the present time.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt; As a Registered Nurse, you will work as a team member on the Neurology Unit alongside the multi-disciplinary team and the Emergency Department to provide seamless care to our patients; our common goal is to achieve the best possible outcomes and experiences for our patients and our staff, in line with our Trust vision and Values.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt; We are committed to continuing professional development of our staff and as part of our specialised workforce you will have excellent opportunities to specialise in many different areas within the field of Neuroscience. The successful candidate will be expected to undertake training, complete competencies successfully and keep their practice up to date; we offer extended role opportunities and encourage staff to fulfil their potential. &lt;br /&gt;The ward offers a supportive learning environment, which endeavours to constantly develop the service, in order to ensure its patients can receive the highest quality and most up to date care. You will need a high level of self-awareness and be dedicated in improving patient care and delivery of care in a timely manner.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt; The candidate is expected to work flexibly and offer assistance across the Trust as required.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt; We want to develop the future of Neurology Nursing, the up and coming Senior Nurses, Ward Managers, Matrons, Specialist Nurses and Advanced Clinical Practitioners.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Swift, Senior Sister&lt;/p&gt;\n&lt;p&gt;email: rachel.swift@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01782 676218&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke &amp; county hospital, Stoke on Trent &amp; Stafford", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Band 5 staff nurse Neurology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247295", "validThrough": "2020-11-15T23:59:59+0000"}