{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "32000", "unitText": "YEAR", "value": "Up to £32,000 FTE - dependent on experience"}}, "datePosted": "2020-11-05T12:34:41+0000", "description": "&lt;h2&gt;Make a difference!&lt;/h2&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;HMP Highpoint is a category C adult male prison for sentenced prisoners, holding up to 1323 men across 15 residential units. HMP Highpoint is situated on the A143 at Stradishall, which is approximately 7 miles from Haverhill when heading to Bury St Edmunds and within 20 miles of the A14 to the north and the M11 to the west. The prison is split across two sites - North and South. Healthcare is provided:&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Highpoint, we’re looking for a Mental Health Nurse to support us and the existing team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;What we can offer you…&lt;/h2&gt;\n&lt;p&gt;• Clinical development opportunities in specialist roles of your interest , such as CBT, ANP, BBV, sexual health, ILS/ALS (intermediate life support and advanced life support), health promotion, RCGP and long term condition courses.&lt;/p&gt;\n&lt;p&gt;• A salary of up to £32,000 per annum FTE - dependent on experience.&lt;/p&gt;\n&lt;p&gt;• Free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;• 25 days annual leave plus 8 public bank holidays (pro-rata for part-time), plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;How we will support you…&lt;/h2&gt;\n&lt;p&gt;• Bespoke induction&lt;/p&gt;\n&lt;p&gt;• Competency framework&lt;/p&gt;\n&lt;p&gt;• Preceptorship (newly qualified practitioners)&lt;/p&gt;\n&lt;p&gt;• Regular clinical supervision&lt;/p&gt;\n&lt;p&gt;• Supported development into specialties such as diabetes or asthma&lt;/p&gt;\n&lt;p&gt;• Regional and national career development opportunities&lt;/p&gt;\n&lt;p&gt;• Our bespoke Learning Management System to address your learning needs&lt;/p&gt;\n&lt;p&gt;• Support from the wider team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;What we need from you...&lt;/h2&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Mental Health) with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;/p&gt;\n&lt;p&gt;You should possess a good working knowledge of conducting risk assessments and care planning as well as someone who is creative and forward thinking to work through the issues that may arise in this challenging but exciting environment. Knowledge in therapeutic interventions such as CBT or Steps to Wellbeing are desirable but transferable clinical skills will be considered with appropriate training provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Next Steps&lt;/h2&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt;The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;For more information, please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;More information&lt;/h2&gt;\n&lt;p&gt;The salary for this role is up to £32,000 per annum.&lt;/p&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. Healthcare operates 7 days a week, we also welcome part-time applications.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newmarket", "postalCode": "CB8 9YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.137", "longitude": ".51069"}}, "title": "Mental Health Nurse - HMP Highpoint", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257686", "validThrough": "2020-11-19T23:59:59+0000"}