{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T15:31:10+0000", "description": "&lt;p&gt;Royal Lancaster Infirmary Emergency Department see’s approximately 5000 patient each month, as a Registered Nurse with us you will be able to work across all areas of the specialty including Triage, Minor Injuries and Illness (Ambulatory Pathway), Majors (Clinical Assessment) and in our Resuscitation Room as we are a Trauma Unit receiving road and air ambulances from the as far as the Lake District. As a part of the Medicine Care Group we are partnered with the Acute Medical Unit and Ambulatory Care Unit providing Emergency Care to the South Lakes and North Lancashire.&lt;/p&gt;\n&lt;p&gt;We are a supportive multi-professional and multi-agency team working with our integrated Children’s and Young Peoples Nurses, Adult Mental Health Liaison Team and Hospital Ambulance Liaison Officers along with specialist Nurses who in-reach.&lt;/p&gt;\n&lt;p&gt;The Emergency Department supports lifelong learning and development and is committed to the continuing development of our trained nurses developing the wide portfolio of clinical skills required to work in the Emergency Department. You will have access to a dedicated Practice Educator who will support your development; once settled and established within the team Registered Nurses are offered further fabulous learning opportunities including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Advance Life Support (ALS)&lt;/li&gt;\n&lt;li&gt;Trauma Nursing Care Course (TNCC)&lt;/li&gt;\n&lt;li&gt;Stimulation Trauma Training (STT)&lt;/li&gt;\n&lt;li&gt;Paediatric Intermediate Life Support (PILS)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for suitably qualified nurses from a variety of adult nursing specialties, however post registration experience is not essential we offer a preceptorship program for newly qualified nurse who would like a career in emergency nursing, all new staff have a period of supernumery working and all staff have a mentor to coach you through your first 12 months. For more experienced nurses we also run an on-going development post with the opportunity to develop Clinical Leadership skills.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer a variety of flexible working arrangements to ensure a work life balance that supports both yourself and our patients.&lt;/li&gt;\n&lt;li&gt;We would like to offer family friendly contracts for a twilight shift with a shift from 5pm till 1am.&lt;/li&gt;\n&lt;li&gt;Also we would like to offer permanent night contracts.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Victoria Squires or Jennifer Molloy Emergency Department Unit Managers on 01524 511981 or 01524 519241&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Emergency Care Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258336", "validThrough": "2020-11-19T23:59:59+0000"}