{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T08:16:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Team Manager/ Senior Mental Health Practitioner CAMHS Single Point of Access (SPA) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting new opportunity to work with the SPA . The team has a key role in the CAMHS New Front Door project being developed to support children and young people to access “the right help at the right time” to meet their emotional health &amp; wellbeing and mental health needs. The Trust, local commissioners and the wider children system are seeking to adopt principles outlined in the iTHRIVE model of practice.&lt;/p&gt;\n&lt;p&gt;The Team Manager / Senior Practitioner role involves working alongside the SPA Clinical Lead, to provide operational management and clinical leadership to the team, ensuring effective implementation and on-going delivery of agreed CAMHS pathways and protocols in order that the Children’s directorate can deliver safe and effective, high quality compassionate services.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with strong communication and organisational skills, and a flexible approach, to ensure that the team deliver positive experiences to children, young people and families. A highly visible, collaborative leadership and management style is required with a genuine interest supporting system change through liaison and consultation with a range of stakeholders including commissioners, general practitioners and third sector organisations.&lt;/p&gt;\n&lt;p&gt;The post holder will use their mental health experience to undertake triage and screening to determine if referrals meet the threshold for specialist assessment and/or for treatment in an agreed CAMHS pathways. Their knowledge of the wider children’s system will facilitate signposting of referrals to the appropriate service statutory and third sector organisations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The permanent posts are eligible for a £1500 New Hire Bonus. An initial payment of £500 will be paid in the first 1 month and a final payment of £1000 will be paid 1 year after your start date. This will be pro-rata for part-time posts. Internal applicants are not eligible.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The trust has made significant investment to support agile working and although the workbase for the team is Huntingdon the majority of the team continue use online platforms to work from home for the majority of their time.&lt;/p&gt;\n&lt;p&gt;Opportunities exist for your own further training, professional development and research within the New Front Door project but also within the Children’s Directorate and wider trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suzanne Hare, Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;suzanne.hare@cpft.nhs.uk / 01480 445281&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newtown Centre, Huntingdon", "postalCode": "PE29 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3317", "longitude": "-.179007"}}, "title": "Team Manager / Senior CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253139", "validThrough": "2020-11-17T23:59:59+0000"}