{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24907 – £30,615"}}, "datePosted": "2020-11-04T11:47:34+0000", "description": "&lt;p&gt;TalkPlus is a high achieving IAPT service and a well-established Long-Term Conditions (LTC) IAPT service and we are recruiting for Psychological Wellbeing Practitioners.&lt;/p&gt;\n&lt;p&gt;Please note, we can only consider applications for candidates that hold the Graduate or Post Graduate Certificate in Evidence Based Psychological Therapies (PWP Qualification).&lt;/p&gt;\n&lt;p&gt;Here at Talkplus we provide specialist training in house and externally such as extra training around supporting people with long term conditions as well as a generous CPD allowance. This includes attending the PWP forum every year as a team. We enable our PWPs to have a fair and manageable caseload and have protected time as a team on a quarterly basis to boost team morale and our own wellbeing. Our PWPs have been involved in creating their own guided self-help materials used throughout the service as well as creating the courses and workshops we run for our patients. In addition, we are heavily involved in community outreach work in many different areas such as older adults, BAME, LGBTQ+ and many more. Salary is negotiable within band 5 dependent on experience.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of an Improving Access to Psychological Therapies (IAPT) service and will provide Step 2 Cognitive Behavioural Therapy (CBT) interventions. You will work with clients who have a range of Anxiety and Depression related problems for which CBT is demonstrated to be clinically effective.&lt;/p&gt;\n&lt;p&gt;The post holder will work with people with different cultural backgrounds and ages, using interpreters when necessary and should be committed to equal opportunities.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to work out of hours when necessary to meet the service needs.&lt;/p&gt;\n&lt;p&gt;The full-time role is 37.5 hours and the post holder will be required to have the flexibility to possibly work evening and weekend shifts as part of these hours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Our offices are open from 08:00 Monday – Friday and close at 20:00 on Monday to Thursday. Friday, we close at 17:00 and we hold weekend workshops/courses/promotional events.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Our OOH clinics are held in our Head Office in Farnborough until 20:00, and some clinics start at 08:00.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would consider part time hours for the right candidate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Must be able to travel to areas within the locality.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "External Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Meads Business Centre, 19 Kingsmead, Farnborough", "postalCode": "GU14 7SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2921", "longitude": "-.754495"}}, "title": "Qualified PWP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255683", "validThrough": "2020-11-22T23:59:59+0000"}