{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 pa inc HCA"}}, "datePosted": "2020-10-29T16:46:03+0000", "description": "&lt;p&gt;The Trust is undertaking an exciting EPR programme, which will deliver in the key aims of the strategic vision and represents a cornerstone of the digital strategy. The EPR programme is delivering in an accelerated timescale in partnership with clinical and operational staff. This opportunity is to be part of a dynamic and versatile team delivering a Trust transformational programme.&lt;/p&gt;\n&lt;p&gt;The Trust requires an IT Systems Integration Analyst to manage the development of the current Trust IT applications into integrated clinical/business information systems to cater for the needs of all clinical and non-clinical areas. They will be responsible for leading on the integration of business and clinical system interfaces at a time when West Herts are embarking on an Electronic Patient Record programme. The postholder will work across the current IT applications as well as being involved in discussions with the EPR programme team.&lt;/p&gt;\n&lt;p&gt;The roles requires multiple skills and the ability to organise and prioritise different workloads. You will engage with a wide group of staff and external partners so excellent communication skills, attention to detail and experience of leading on delivering IT healthcare applications.&lt;/p&gt;\n&lt;p&gt;You will need to be able to thinking creatively, work independently and deliver to deadlines. The postholder will need to be able to design and document technical architecture and to ensure that the systems deployed link to the Trusts integration strategy. You will also need to be able to communicate the types of change in application to clinical and operational staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Knowledge of NHS applications, NHS data standards and healthcare system interfaces are key to this position as tasks will include: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Migration/redesign of HL7 interfaces across numerous applications. &lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Ensuring the integrity of NHS data standards are maintained.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Working with internal clinical teams and external system suppliers to integrate their systems.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Testing integration solutions across our legacy systems and ensuring compatibility with the EPR.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Supporting the change in workflows/data entry from our current PAS to the new EPR .&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Secondments will also be considered and you may be required to travel across the Trust’s three sites and to work outside standard working hours occasionally.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is fixed term as only required for the life of the project. This is expected to be until December 2021.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The EPR team via: westherts.eprprogramme@nhs.net &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 7- IT Systems Integration Analyst- EPR Programme", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249142", "validThrough": "2020-11-12T23:59:59+0000"}