{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T14:46:31+0000", "description": "&lt;p&gt;A temporary full-time Care Coordinator post has arisen within the Early Interventions psychosis (EIP) team for people of Hull and East Riding. Applications are welcome from registered mental health nurses, Social Workers or Occupational Therapists who meet the essential criteria for this post and are registered with the appropriate professional body. We are looking for someone who is enthusiastic and motivated and has the ability to cope with change as we work through the Covid-19 pandemic.&lt;/p&gt;\n&lt;p&gt;After initially completing a comprehensive Assessment of at risk mental state (CAARMS) Patients are offered a comprehensive menu of support and interventions:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Activities&lt;/li&gt;\n&lt;li&gt;Health &amp; Lifestyle support&lt;/li&gt;\n&lt;li&gt;Education and employment support&lt;/li&gt;\n&lt;li&gt;Family interventions&lt;/li&gt;\n&lt;li&gt;Cognitive Behaviour Therapy&lt;/li&gt;\n&lt;li&gt;Medication&lt;/li&gt;\n&lt;li&gt;Support/Education for friends and/or family&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The multi-disciplinary team offers a service to people aged between 14 and 64, who are or are suspected of, experiencing symptoms of psychosis for the first time. The team are working towards the implementation of national standards and targets to achieve accreditation and to ensure we deliver high quality NICE concordant packages of care. We are looking to recruit an individual who shares the philosophy of therapeutic optimism, promotes “getting on with life” and can deliver a range of individual and group interventions in line with our menu of services offered. Groups are currently being held virtually as we deal with Covid-19.&lt;/p&gt;\n&lt;p&gt;EIP currently works with many local agencies, so the ability to communicate and work collaboratively with people and their families is an essential component of the work. Client contact takes place predominantly in settings external to mental health services so the ability to commute within the Trust’s geographical area, with access to an appropriate means of transport, is essential as the team are currently working in an Agile manner.&lt;/p&gt;\n&lt;p&gt;The team have also moved towards being “paperlight” so the successful candidate would need to have the ability to use IT equipment and be able to keep electronic patient records.&lt;/p&gt;\n&lt;p&gt;This post is a temporary post for 6 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:Lesley Kitchen Email:addresslkitchen1@nhs.net Telephone number: 01482 336786&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Townend Court, HULL", "postalCode": "HU6 8QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7708", "longitude": "-.377052"}}, "title": "Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256286", "validThrough": "2020-11-18T23:59:59+0000"}