{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-06T13:28:37+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Leeds Teaching Hospitals NHS Trust&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant in Allergy &amp; Immunology&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;St James’s University Hospital&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date: 3 December 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ref: 298-CON-639&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic consultant immunologist to join the Leeds Immunology &amp; Allergy  services at St James’s University Hospital. The appointee will become a key member of a dedicated and highly experienced multidisciplinary team.  &lt;/p&gt;\n&lt;p&gt;The job is a full time post comprising of ten programmed activities, with supervision of the junior doctors and specialist nurses. There is a commitment to clinical advice on call on a 1:3.&lt;/p&gt;\n&lt;p&gt;Leeds Teaching Hospitals NHS Trust makes up one of the largest teaching hospitals in Europe housing over 2,000 beds and providing a range of general, acute and elective services, together with a significant number of regional and supra-regional specialties. &lt;/p&gt;\n&lt;p&gt;The Leeds Department of Immunology &amp; Allergy is based at St James’s University Hospital. The department has a worldwide reputation for its clinical and academic achievements and our aim is to provide a first class service. The department has recently gained QPIDS accreditation.  We are committed to providing high quality specialist care to patients, suffering from allergic, immunodeficiency and autoinflammatory disorders. Great emphasis has been placed on delivery a friendly, consultant lead, patient centric service. Our multidisciplinary teams are a key part of our success and include anaesthetics, clinical nurse specialists, pharmacists and researchers. There is a dedicated outpatient and Day Case facility at St James’s Hospital. The post includes dedicated time to support our immunology laboratory.&lt;/p&gt;\n&lt;p&gt; The appointee must hold the Membership of the Royal Colleges of Physicians of the United Kingdom, or equivalent and should have completed a recognised training programme in clinical and laboratory immunology as per curriculum outlined by JRCPTB or equivalent body. Applicants must be on the Specialist Register or within six months of being admitted to the Register for trainees if currently in a training programme within the UK. In accordance with the consultant appointment regulations, all other categories of doctors must be on the Specialist Register.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates are encouraged to visit by prior appointment.Consideration will be given to applicants who wish to work full or part time and those wishing to job share.&lt;/p&gt;\n&lt;p&gt;Informal enquiries may be made to:&lt;/p&gt;\n&lt;p&gt;Dr Sinisa Savic , Consultant Immunologist and Clinical Lead for Allergy &amp; Immunology - sinisa.savic@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;INTERVIEWS WILL BE HELD VIA ZOOM - Wednesday 13 January 2021&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this, or have any queries, please contact Lynn Lindley in Medical Staffing on (0113) 2064895: E Mail Address: LynnLindley@nhs.net &lt;/p&gt;\n&lt;p&gt;Please note that only electronic applications can be accepted for this post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122872.jpg", "name": "Consultants", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Consultant in Immunology (Allergy)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259908", "validThrough": "2020-12-03T23:59:59+0000"}