{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T12:31:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Medicines Optimisation Pharmacy Technician - Berkshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are a Pharmacy Technician looking for a new rewarding and challenging role come and join our CQC rated ‘Outstanding’ Trust. We currently have an opportunity for a Medicines Optimisation Pharmacy Technician to join our team. You will deliver a high quality, safe and effective pharmacy service to our community health and mental health services across our sites in Berkshire. You should be a pharmacy technician registered with the General Pharmaceutical Council/with a nationally recognised Medicines Management skills qualification to include POD checking, one-stop dispensing and Medicines Reconciliation and a nationally recognised ACPT qualification.&lt;/p&gt;\n&lt;p&gt;We are a small friendly team, which is based at Prospect Park Hospital in Reading where you will be scheduled to work at the different community hospitals across Berkshire including Slough, Newbury, Wokingham, Maidenhead and Reading (usually on a rota basis but you will also provide cover for leave). Our working hours are currently 9.00 – 17.00 Monday to Friday with you also working a late shift in the dispensary on a rota basis, which means no nights, weekends or bank holiday work at present. We offer free parking on site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with minimal supervision to provide an admission, supply and discharge service to nominated wards&lt;/li&gt;\n&lt;li&gt;To provide information and advice to patients, relatives, carers and staff regarding prescribed medicines and further supplies&lt;/li&gt;\n&lt;li&gt;Liaising directly with pharmacists, doctors and nursing staff over clinical issues as appropriate.&lt;/li&gt;\n&lt;li&gt;Providing a ward top-up service&lt;/li&gt;\n&lt;li&gt;Checking Patients’ Own Drugs (PODs)&lt;/li&gt;\n&lt;li&gt;Undertaking medicines reconciliation&lt;/li&gt;\n&lt;li&gt;Discharge planning and supporting patients to ensure that they get the best possible outcomes from their medicines&lt;/li&gt;\n&lt;li&gt;Participate in the training, supervision and assessment of new staff, Pre-registration trainee Pharmacy Technicians and Band 4/5 Pharmacy Technicians undergoing medicines optimisation training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from &lt;strong&gt;£24,907 - £30,615&lt;/strong&gt; per annum&lt;/li&gt;\n&lt;li&gt;We provide regular clinical supervision to support staff and enhance learning opportunities&lt;/li&gt;\n&lt;li&gt;Pharmacy have just adopted QMIS (our trusts quality improvement methodology) – all staff have the opportunity to raise and implement changes to improve the service we provide&lt;/li&gt;\n&lt;li&gt;We have a protected time each Wednesday morning for the whole pharmacy team to meet for learning opportunities&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The &lt;/strong&gt;&lt;strong&gt;4&lt;/strong&gt; &lt;strong&gt;“must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Pharmacy Technician registered with the GPhC&lt;/li&gt;\n&lt;li&gt;Nationally recognised Medicines Optimisation Pharmacy Technician qualification to include POD checking, Supply and Medicines Reconciliation.&lt;/li&gt;\n&lt;li&gt;Nationally recognised Accuracy Checking Pharmacy Technician qualification.&lt;/li&gt;\n&lt;li&gt;Current full UK driving license and use of a vehicle for work purposes.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call: Sara Jackson on 0118 960 5080 or email: Sara.Jackson@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prospect Park Hospital, Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Medicines Optimisation Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252076", "validThrough": "2020-11-16T23:59:59+0000"}