{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-05T15:01:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Leeds and York Partnership Foundation Trust, Leeds&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Older People’s Community Mental health Services&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join The Care Homes Service in Leeds. We are looking for a skilled and enthusiastic mental health nurse to join a small, friendly service that directly supports older people with complex dementia /mental health needs residing in a Leeds care home. The service is provided by registered Nurses and Occupational Therapists with a background and specialist knowledge and skill in mental health /dementia. Broadly, the model of service delivery includes: care coordination; timely assessment, role modelling appropriate behaviours / techniques, education for care staff tailored to the needs of the individual service user, fast access to mental health, psychology and pharmacological advice.&lt;/p&gt;\n&lt;p&gt;We aim to help older people in their transition from hospital to care home and also prevent unnecessary hospital admissions by supporting care homes. We have recently embraced the CLEAR dementia strategy, developed in Northern Ireland and our ethos is underpinned by person-centred dementia care. You will be part of an MDT consisting of enthusiastic occupational therapists, nurses and psychologist, with medical support from sector Consultant Psychiatrists and their colleagues. This is a challenging and rewarding role requiring liaison with care home staff, social workers, inpatient wards at The Mount (Older Peoples Mental Health Inpatient Unit) and LTHT (Leeds General Hospitals), as well as direct contact and assessment of older people in care homes and liaison with their families. The service operates over 7 days, 8-20.30 hours weekdays and 10-18.00 hours weekends. You would be supported in developing and furthering your professional skills. We would be delighted to hear from you.&lt;/p&gt;\n&lt;p&gt;Please contact Sarah Flounders, CTM (Clinical Team Manager)RMN, Tel 07980 969848 or Lynn Welsh, OPS (Older Peoples Service) Practice Development OT, Tel 07944745302, for more information and to arrange a visit to the service.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Mount, Leeds", "postalCode": "LS2 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8042", "longitude": "-1.55908"}}, "title": "Mental Heath Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258229", "validThrough": "2020-11-19T23:59:59+0000"}