{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401- £37,267 pro rata"}}, "datePosted": "2020-11-06T09:45:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week (We will consider reduced hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, enthusiastic and motivated nurse to work as a Research Nurse undertaking NIHR portfolio research.&lt;/p&gt;\n&lt;p&gt;Working under the supervision of the Senior Research Nurses you would take responsibility for working on the current trial portfolio and the set-up, management, co-ordination and facilitation of new studies across a number of clinical areas. &lt;br /&gt;&lt;br /&gt;The primary area for this post is Care Group 1 research. You would have continuing responsibility for assessing care needs of study participants and for providing them with high quality care that is timely and protocol-driven. You would provide participants with specialist nursing care and advice on all aspects of their involvement in trials and be responsible for ensuring identification and proper reporting of any adverse events. &lt;br /&gt;&lt;br /&gt;In addition to clinical and patient related care, this role includes document generation and control, data collection, patient recruitment and reporting. Due to the nature of the research there needs to be a high level of flexibility around hours as this post may involve on-call, some weekend working and may require the member of staff to stay late with a trial participant. &lt;br /&gt;&lt;br /&gt;The successful candidate must be a first Level Registered Nurse and educated to diploma level or equivalent. It is essential that applicants have recent professional clinical knowledge evidenced through at least two years practice. Evidence of experience in Cardiology, Renal, Stroke, or Gastroenterology and/or clinical research would also be an advantage and/or a willingness demonstrated to undertake appropriate training. &lt;br /&gt;&lt;br /&gt;In addition the applicant must demonstrate an understanding of the Good Clinical practice and UK Policy Framework for Health and Social Care Research and there application in practice, within the written application and during the interview process. You must be able to prioritise workload and work on your own initiative whist making judgements about a range of clinical issues regarding trial patients. &lt;br /&gt;&lt;br /&gt;A key part of the role will be to liaise with all members of the multi-disciplinary team across a number of specialities therefore the successful candidate must possess excellent interpersonal and communication skills.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that is a great draw. In addition, as a member of our team you will have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Laura Griffiths, Senior Research Nurse&lt;/p&gt;\n&lt;p&gt;Laura.griffiths@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;01904 725125&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259073", "validThrough": "2020-11-19T23:59:59+0000"}