{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro-rata"}}, "datePosted": "2020-10-16T16:30:46+0100", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated Band 5 Pharmacy Technician to join our Defence Primary Healthcare (DPHC) Team in delivering a Primary Health Care (PHC) service to Armed Forces personnel based in Kendrew Barracks, Cottesmore. This post offers the successful candidate 20 hours per week to be worked 4 hours a day Monday through to Friday.&lt;/p&gt;\n&lt;p&gt;DPHC is a vibrant and fast-moving organisation that aims to provide the very best primary healthcare to Defence personnel. In addition to General Practice, DPHC provides rehabilitation services, occupational health advice and community mental health support. The patient population is generally young and healthy and much of the work relates to occupational health, minor injuries and sports medicine.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be jointly responsible for providing an accurate, safe and efficient dispensing service to all patients under the care of the Medical and Dental Centres.&lt;/p&gt;\n&lt;p&gt;You will be working alongside a full-time Pharmacy Technician. The successful candidate works without pharmacist’s supervision, and has responsibility for the safe and accurate ordering, storage and dispensing of all medicines and medicinal products as prescribed by Medical Officers and Non-Medical Prescribers and other authorised prescribers as well as those medications that can be supplied by Nurses and by Combat Medical Technicians.&lt;/p&gt;\n&lt;p&gt;To apply for this role, you will need to satisfy the following requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Pharmacy Technician with the General Pharmaceutical Council (GPhC).&lt;/li&gt;\n&lt;li&gt;Approved Pharmacy Technician qualification (i.e. BTech/Apothecaries Hall with BTech conversions where required/NVQ Level 3 in Pharmaceutical Sciences or other qualification regarded as equivalent).&lt;/li&gt;\n&lt;li&gt;Other additional training for checking dispensed prescriptions without further reference. Practical experience to be able to operate in a singleton post.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Previous experience of working in a military environment and an Accredited Checking Technician would be desirable.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Key Skill Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core - NHSC1 - Communication&lt;/li&gt;\n&lt;li&gt;NHS Core - NHSC2 - Personal and People Development&lt;/li&gt;\n&lt;li&gt;NHS Core - NHSC4 - Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Health and Wellbeing - HWB10 - Products&lt;/li&gt;\n&lt;li&gt;NHS Information and Knowledge - NHS IK3 - Knowledge and Info Resources&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will be required to undertake a two-day induction course to be held at DMS Whittington, Lichfield, Staffordshire, WS14 9PY. This should happen soon after taking up appointment.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kendrew Barracks, Cottesmore, Oakham, Rutland, LE15 7BL", "postalCode": "LE15 7BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7261", "longitude": "-.650195"}}, "title": "Band 5 Part Time Pharmacy Technician (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231104", "validThrough": "2020-11-12T23:59:59+0000"}