{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-02T14:16:11+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Critical Care comprises of a 32 bedded Critical Care Unit.&lt;br /&gt;&lt;br /&gt;The Critical Care Unit cares for level 2 &amp; 3 General adult, Surgical and Trauma patients and Neuroscience, Spinal and Trauma patients. The patients can be either on elective or emergency pathways of care.&lt;br /&gt;&lt;br /&gt;Salford Royal is the Neuroscience Centre &amp; Regional Trauma Centre for Greater Manchester.&lt;br /&gt;&lt;br /&gt;We are looking for a Registered Nurse with extensive Critical Care &amp; Neuroscience experience as a Band 5 or Band 6 within the specialty to join the team. &lt;br /&gt;&lt;br /&gt;It is essential that you are a proficient critical care practitioner, hold a post registration critical care qualification and possess a mentorship qualification.&lt;br /&gt;&lt;br /&gt;You must be able to deliver a high standard of evidence based individual patient care. &lt;br /&gt;&lt;br /&gt;You will have evidence of continual professional development which is relevant to this speciality. Level 3 skills are essential to this role.&lt;br /&gt;&lt;br /&gt;You must also be able to demonstrate self-motivation and leadership skills, together with the ability to communicate effectively.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual preference, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cate Clarke, Matron&lt;/p&gt;\n&lt;p&gt;0161 206 8741&lt;/p&gt;\n&lt;p&gt;catherine.clarke@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Rachel Clarke, Matron&lt;/p&gt;\n&lt;p&gt;0161 206 8741&lt;/p&gt;\n&lt;p&gt;Rachel.clarke@srft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Nurse Practitioner - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252374", "validThrough": "2020-11-16T23:59:59+0000"}