{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum, pro rata"}}, "datePosted": "2020-11-04T10:31:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Operational/Organisational Lead for Supervisor Training &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Secondment or Fixed Term Post, 2 years&lt;/p&gt;\n&lt;p&gt;Band 8 (b) -0.6 – 1.0 wte secondment or fixed term, 2 years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Following recent expansion of supervisor training programmes across the CYP-IAPT, Adult IAPT and Secondary Care programme portfolios, the GMMH Psychological Therapies Training Centre is looking to expand the supervision programme team, by recruiting an Operational/Organisational lead to oversee, co-ordinate and drive forward this supervision training expansion.&lt;/p&gt;\n&lt;p&gt;Suitable candidates will be responsible for establishing and co-ordinating a portfolio of high-quality supervision training that fits national curricula and expectations of commissioning bodies. They will lead on/ co-ordinate recruitment of suitable candidates for supervision training including liaising/ co-ordinating liaison with service leads/ managers across the IAPT/CYP and adult services footprints as well as integrating and overseeing the work of ‘supervision leads’ within each of the individual training programme pathways. The successful candidate will develop and design the academic structure of the supervision programmes in conduction with the University of Manchester. They will also lead in tendering of supervision training for the NW to further expand and grow the supervision offer of the PTTC.&lt;/p&gt;\n&lt;p&gt;Prospective candidates will be enthusiastic about supervision training and passionate about the role of supervision in service transformation. Experience of the delivery of supervision training would be advantageous, as would knowledge of the EMHP/CYWP programmes as the supervision offer for these programmes is expansive, though neither are a pre-requisite. Candidates will have excellent communication and organisational skills, and be able to lead and work alongside others, as part of a training team, participating in all aspects of delivery.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be able to be central to the shaping and development of a growth area of the PTTC. For more information, please contact Madeline Marczak, Director of CYP Training madeline.marczak@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Secondments would require the agreement of an existing manager. Job share options would be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Madeline Marczak&lt;/p&gt;\n&lt;p&gt;Job title: Director of CYP Training&lt;/p&gt;\n&lt;p&gt;Email address: madeline.marczak@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prestwich site, Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Operational/Organisational Lead for Supervisor Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255368", "validThrough": "2020-11-14T23:59:59+0000"}