{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23810", "minValue": "22478", "unitText": "YEAR", "value": "£22,478 - £23,810 pa inc"}}, "datePosted": "2020-11-05T10:31:45+0000", "description": "&lt;p&gt;Be a Critical Care Non - Registered Support Workers&lt;br /&gt;&lt;br /&gt;What is a Critical Care Non - Registered Support Workers?&lt;br /&gt;&lt;br /&gt;A Critical Care Non - Registered Support Workers is a unique new role created during this period of unprecedented demand on our services as a result of the Covid-19 pandemic. You will provide vital one-to-one care for patients in critical care environments, closely observing and providing direct care, as well as keeping the bedside area and other spaces clean and safe. You will be under the supervision of qualified nurses, doctors and other members of the critical care team.&lt;br /&gt;&lt;br /&gt;Who can be a Critical Care Non - Registered Support Workers?&lt;br /&gt;&lt;br /&gt;Anyone with a keen interest in supporting others can become a Critical Care Non - Registered Support Workers, provided you have occupational health clearance and are happy to undertake appropriate training. If you possess a background in healthcare that’s advantageous – you may be a healthcare assistant or healthcare support worker, a medical student or pre-registration allied health professional, or perhaps you’ve worked as a carer in the past and now occupy a non-patient facing role.&lt;br /&gt;&lt;br /&gt;What is the role of a Critical Care Non - Registered Support Workers?&lt;br /&gt;&lt;br /&gt;To provide vital support to critical care staff during the Covid-19 pandemic. This will require you to:&lt;br /&gt;• wear PPE (personal protective equipment)&lt;br /&gt;• help with personal care, including washing patients under supervision&lt;br /&gt;• record and chart vital signs from a monitor (temperature, pulse, respiration, blood pressure etc.)&lt;br /&gt;• escalate concerns if there are any changes in the patient’s condition, as directed&lt;br /&gt;• help make patients as comfortable as possible&lt;br /&gt;• stock up and maintain the bed area and other ICU areas&lt;br /&gt;• carry out bed space cleaning and four-hourly damp dusting&lt;br /&gt;• support the repositioning and turning of patients and provide a range of movement exercises after assessment by, and under the advice of, a physiotherapist&lt;br /&gt;&lt;br /&gt;What training will be provided?&lt;br /&gt;• PPE - including donning and doffing, FFP3 mask fit testing&lt;br /&gt;• patient care – including personal care and repositioning in ICU&lt;br /&gt;• care of lines and tubes, checking infusion pumps under supervision&lt;br /&gt;• recognising signs that require escalation&lt;br /&gt;• clinical monitoring as required&lt;br /&gt;• cleaning bed spaces and disposing of waste&lt;br /&gt;• communication and well-being&lt;br /&gt;• ICU orientation&lt;/p&gt;\n&lt;p&gt;You will be required to complete an online assessment.&lt;/p&gt;\n&lt;p&gt;Interviews will be held via Microsoft Teams, Should you be successful complete the online assessment, further details will be provided once the vacancy has closed on a specific day and time.&lt;br /&gt;&lt;br /&gt;The NHS faces a period of unprecedented demand. In the face of the global pandemic of coronavirus, this is your chance to save lives and make a difference.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Recruitment team Email address: Imperial.covid19resourcing@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02033111462&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Critical Care Non - Registered Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257248", "validThrough": "2020-11-29T23:59:59+0000"}