{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-02T17:15:27+0000", "description": "&lt;h1&gt;Clinical Specialist Dietitian - ITU, Band 7&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity is available at the Royal United Hospital Bath for an enthusiastic and forward thinking Dietitian. The Therapy service provided to ITU has been reviewed and uplifted in line with GPIC S2 for a 16 bed unit for all Therapy areas including SLT, OT, PT, Dietetics, Psychology and Pharmacy. The team will join the existing staff members to provide patient care within the ITU.&lt;/p&gt;\n&lt;p&gt;The post holder will be a highly specialized Dietitian who is dedicated to establishing and delivering evidence based dietetic care within ITU. They will be required to manage nutritional requirements alongside competing demands of the complex patient. The post holder will be able to demonstrate significant experience in this area of practice and will have the competencies to match. They will have completed the PENG clinical update course (or demonstrate equivalent competencies) and it would be helpful to have experience of protocol development. There will be a need to review existing nutritional protocols and update practice and procedures on an on-going basis in line with emerging evidence. The Dietitian will be an active member of the MDT and contribute to the shared vision for ITU services.&lt;/p&gt;\n&lt;p&gt;The RUH Dietetics team is committed to high quality care, and are well respected within the hospital. The Dietitians are based in the Therapies Building alongside their AHP colleagues. The RUH is committed to collaborative working between the professions and this post is a result of recognizing the need to uplift the service provided to ITU patients in all areas and respects the role of each member of the MDT within that. The Therapy Department has a positive approach to professional development and networking. The post holder will lead in the development of critical care skills and competencies for the Dietetic team and participate in student training.&lt;/p&gt;\n&lt;p&gt;We are open to all applicants on a full, part-time or job-share basis. Previous experience can be recognized within salary. There is a commitment to working flexibly and in accordance with patient needs.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Clinical Specialist Dietitian - ITU, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253002", "validThrough": "2020-11-16T23:59:59+0000"}