{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-04T15:30:19+0000", "description": "&lt;p&gt;We have an exciting opportunity for a project manager to join the Service Improvement &amp; Transformation team at The Walton Centre NHS Foundation Trust. The purpose of this role is to provide delivery support within the Service Improvement function against key projects from within the Trusts change portfolio including the Quality Improvement Programme (QIP).&lt;/p&gt;\n&lt;p&gt;The Service Improvement Team provides a customer orientated service to meet the business requirements of the Trust. This service includes the full management of strategically aligned programmes and projects required for delivery as well as providing advice and expertise in change management.&lt;/p&gt;\n&lt;p&gt;The post holder will work with teams to support delivery of key projects identified from inception of an idea through to implementation and close-out, ensuring appropriate governance is deployed whilst benefits are planned and delivered appropriately.&lt;/p&gt;\n&lt;p&gt;The key projects that the successful candidate will be involved include:&lt;br /&gt;• Provide support to teams in service redesign and pathway improvement activity to deliver improved quality of patient care whilst supporting the Trust in becoming a more efficient provider of care&lt;br /&gt;• Annual delivery of the Trusts Quality Improvement &amp; Productivity portfolio, supporting the Trusts financial improvement programme&lt;br /&gt;• Provide delivery support to employees on the execution of quality improvement techniques locally to support delivery of a continuous improvement approach across the Trust&lt;/p&gt;\n&lt;p&gt;For further information on the post or to arrange an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt;Ben Davies&lt;/p&gt;\n&lt;p&gt;Ben.Davies@thewaltoncentre.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256435", "validThrough": "2020-11-25T23:59:59+0000"}