{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum, pro rata"}}, "datePosted": "2020-10-26T11:01:22+0000", "description": "&lt;p&gt;A unique opportunity has arisen to join the SW regional maternity team on a part-time secondment basis for a period of 6 months in the first instance. Please note that the reason for the Fixed Term of your contract is that the funding is provided by the Maternity Transformation Programme and therefore an annual form of funding is required.&lt;/p&gt;\n&lt;p&gt;This rotational role is new to the regional team and aimed at providing aspiring midwifery leaders with the opportunity to gain regional level experience, to influence and drive forward the maternity transformation programme and to work alongside the regional chief midwife in ensuring safe and high-quality maternity services.&lt;/p&gt;\n&lt;p&gt;You will be an experienced, visionary, credible, senior midwifery leader and will be supported to develop within the role, build networks and develop key elements of maternity care across the region.&lt;/p&gt;\n&lt;p&gt;As Regional Transformation Midwife, you will have a strong work ethic, the ability to manage a key workstream to tight time scales, and the confidence to represent the regional chief midwife working across system boundaries engaging a wide range of stakeholders. The initial focus for this role will be supporting systems to progress and achieve their continuity of carer plans with an emphasis on supporting BAME and disadvantaged populations.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be a Midwife with current NMC registration.&lt;/li&gt;\n&lt;li&gt;be able to evidence strong leadership skills, expert clinical knowledge and experience of leading wide-scale change programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;have an in-depth knowledge of the maternity transformation programme workstreams and deliverables&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;have experience of leading projects involving multiple partners preferably ccross organisational boundaries&lt;/li&gt;\n&lt;li&gt;have significant experience of managing a team and achieving objectives by working with others not under direct line management control.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen WilliamsJob titleRegional Chief Midwife (South West)Email addresshelen.williams99@nhs.netTelephone number07702417367&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "TA1 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0141", "longitude": "-3.0681"}}, "title": "Regional Transformation Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242108", "validThrough": "2020-11-09T23:59:59+0000"}