{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T15:31:40+0000", "description": "&lt;p&gt;We are pleased to invite application for two new posts in acute medicine from accomplished and enthusiastic individuals with acute or general medical experience (GMC Specialist Register or within 6 months of CCT). We welcome applications from candidates who have an additional specialty interest, or who would want the opportunity for less than full time working within acute medicine.&lt;/p&gt;\n&lt;p&gt;You will be joining our enthusiastic and well established team of 8 Consultant Physicians working in Acute Medicine, who provide high quality care for our 51 bedded Acute Medical Unit and our soon to be redeveloped Same Day Emergency Centre. These new posts will enable our acute medicine department to further develop our same day emergency centre provision.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We can offer an attractive relocation package for the right candidate.&lt;/p&gt;\n&lt;p&gt;You will be based in Musgrove Park Hospital, an Acute General hospital in the heart of the Somerset county town of Taunton, serving a catchment population of approximately 350,000. Our hospital is proud to have a very strong local reputation and has a long held culture of being supportive, friendly yet forward looking institution, as a consequence there is a good morale and we pride ourselves on providing excellent patient care.&lt;/p&gt;\n&lt;p&gt;You will be joining a department that has a strong educational role, providing simulation training across the medical wards and we provide teaching to Bristol medical students attached to the team. There will be an increase in the educational work of the department with Plymouth Medical students starting placements in Musgrove Park Hospital on clinical attachments from August 2021, this in turn will bring several opportunities regarding educational delivery and leadership roles.&lt;/p&gt;\n&lt;p&gt;Aside from joining a Trust with a Good rating from the CQC, alongside the highest GMC score for training in the South West, you will get to experience life in the West Country. Taunton enables you to take advantage of some of the UK’s most beautiful locations, being in close proximity to Exmoor, the Quantock hills and Blackdown hills, which all offer great walking and cycling. There are the surf beaches of North Devon and the Jurassic coast of Dorset, with easy reach to the cosmopolitan centres of Bristol, Bath, and Exeter, Taunton offers you many benefits of the countryside while still being less than two hours from London by train.&lt;/p&gt;\n&lt;p&gt;Nestled in the heart of Somerset as the County town, Taunton has a diverse range of shopping and restaurants, and boasting sporting arenas such as the Somerset county cricket ground regularly hosting international fixtures. It is surrounded by areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, there’s plenty to keep you occupied alongside the abundance of music festivals including Glastonbury festival and the Sidmouth folk festival alongside smaller local traditional celebrations.&lt;/p&gt;\n&lt;p&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington school, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to The Castle school in Taunton, ranking in the top 5% of secondary schools nationally.&lt;/p&gt;\n&lt;p&gt;With a great educational offering, and abundance of open country side, we think there’s nowhere better. Throw in a cost of living that will see you afford a higher quality of living, including an average house price of £252,000, and significantly lower than the national average crime rate. We like to think we’re offering you an employment opportunity with many great opportunities both professionally, and personally.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust&lt;/strong&gt;&lt;br /&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;Please refer to the NHS Jobs website for further information, including the job description and person specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please email Dr Duncan Whitehead, Clinical Service Lead for Acute Medicine,&lt;/strong&gt; Duncan.Whitehead@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;To discuss the application process please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or jordan.pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Consultant - Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245215", "validThrough": "2020-11-24T23:59:59+0000"}