{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-06T07:48:53+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an Administrative Co-ordinator, within the Oncology CSU based at St James’s Hospital in the Bexley Wing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an interesting and diverse post which will primarily entail undertaking the co-ordination of patients attending for &lt;strong&gt;Radium 223&lt;/strong&gt;. This will include liaising with doctors, specialist nurses, Nuclear Medicine and the wider service to ensure the pathway for these patients runs smoothly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will also provide administrative support to a number of Oncology Clinical Nurse Specialists who work within advanced urology oncology and GI chemo-radiotherapy. This will include: typing clinical letters, updating relevant databases, assisting in setting up new service clinics, preparing nurse led clinics, answering patient queries and other general day to day administrative tasks; therefore, the post holder will be required to work using their own initiative on a daily basis and should be able to work under pressure, with good attention to detail, in this growing and fast paced position. Data inputting and good keyboard skills are essential, along with good communication and IT skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If this sounds like the job for you or if you would like any further information we would be pleased to hear from you. We recommend that you contact us for an informal chat prior to applying.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact Joanne Simpson on 0113 2068505 or email joanne.simpson13@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123992.jpg", "name": "Leeds Cancer Centre", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Administrative Co-ordinator (XN03)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258856", "validThrough": "2020-11-20T23:59:59+0000"}