{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-10-26T13:17:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an ambitious CNS or AHP looking for your next challenge in a senior position?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for you to join our Supportive and Palliative care team at Musgrove Park Hospital as an Enhanced Support Care Lead (Band 7).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an innovative thinker who is passionate about service development? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team is committed to providing high quality, specialist symptom control advice and support to patients, their relatives/carers and to professional colleagues whether in the acute hospital or community setting. This is a relatively new service and the role would involve the ongoing development of this service within Somerset.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want a varied role that allows you to utilise and advance your clinical and leadership skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This role involves working as a member of a multi-professional team and continual service development.&lt;/li&gt;\n&lt;li&gt;This role is to work alongside the Lead Band 7 specialist palliative care nurse in providing clinical advice to patients and carers and to medical, nursing and allied health professionals responsible for the care of the patients within an acute hospital setting.&lt;/li&gt;\n&lt;li&gt;You would be responsible for the day to day management and development of the enhanced supportive care service within the acute trust, supporting the current OT and CNS team.&lt;/li&gt;\n&lt;li&gt;Promoting best practice and delivering coordinated quality supportive care to patients and their families who are known to the Enhanced supportive care service in close liaison with the multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Work across organisational and professional boundaries to promote the care philosophy, to ensure an integrated approach to care management between organisations and agencies.&lt;/li&gt;\n&lt;li&gt;Deliver training for all staff, to support consistent and high quality delivery of care for patients known to the enhanced supportive care service&lt;/li&gt;\n&lt;li&gt;The posts cover a 5 day a week service at the present time but there will be an expectation that 7 day a week working will be implemented in the future, flexibility is essential to ensure the needs of the patients and service are covered.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working in Somerset, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for a highly motivated, enthusiastic and experienced individual to join the team.&lt;/li&gt;\n&lt;li&gt;You will be a registered nurse/AHP with significant experience of working at a Band 6 or above with palliative experience and symptom control knowledge and preferably a teaching qualification.&lt;/li&gt;\n&lt;li&gt;You should have proven excellent communication skills, the ability to manage a clinical caseload and multi-professional working.&lt;/li&gt;\n&lt;li&gt;A real commitment to improving the quality of care for patients with a newly diagnosed incurable cancer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Hours of Work - Full time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Cheryl chambers&lt;/p&gt;\n&lt;p&gt;Job title Lead nurse counsellor&lt;/p&gt;\n&lt;p&gt;Email address cheryl.chambers@somersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07950 939631&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Enhanced Support Care Lead (Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242641", "validThrough": "2020-11-22T23:59:59+0000"}