{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-05T15:31:54+0000", "description": "&lt;p&gt;An opportunity has become available for a band 5 nurse (Emergency Department - A&amp;E)&lt;/p&gt;\n&lt;p&gt;Are you a highly motivated and enthusiastic Nurse who enjoys working as part of an innovative and CQC rated ‘Good’ Team?&lt;/p&gt;\n&lt;p&gt;If so, we have an exciting opportunity for you at the Royal Berkshire NHS foundation Trust ! Do you enjoy the challenges an Emergency Department demands? Would you like the opportunity to work in the Emergency Department at the Royal Berkshire Hospital? If you&#39;re looking for your next role and an opportunity to work within a fast paced, dynamic environment as part of an experienced, committed team then we&#39;d be pleased to hear from you. We are looking for nurses to join our friendly, focused team to deliver high quality levels of care. We are looking for someone who will bring a positive attitude to the Trust and can demonstrate a kind and compassionate attitude.&lt;/p&gt;\n&lt;p&gt;We aim to recruit professional, motivated and enthusiastic Band 5 staff. We take great pride in being part of a top performing Trust and Emergency Department and are committed to ensuring quality patient care.&lt;/p&gt;\n&lt;p&gt;We are looking for nurses who are dynamic, motivated and enthusiastic with a very high standard of clinical practice and must have band 5 experience in an Acute setting. You will need to have excellent clinical skills, be adaptable to change and be able to complement and support the existing team of nurses and doctors, and be interested in both adult and Paediatric Emergency Care. At interview, you must be able to demonstrate sound clinical knowledge as well as knowledge of current healthcare initiatives. We encourage personal development within the trust and offer the opportunity to undertake relevant courses after successful competency based objectives are met. You will need to be educated to degree level. The candidate will have a global understanding of health delivery and the implications for Emergency pathway development.&lt;/p&gt;\n&lt;p&gt;Please contact Alison Eatwell on 01183226633 or Alison.Eatwell@royalberkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Eatwell on 0118 322 7856 or by email at&lt;/p&gt;\n&lt;p&gt;Alison.Eatwell@royalberkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Berkshire Hospital NHS Foundation Trust, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Staff Nurse (Emergency Department - A&amp;E)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258366", "validThrough": "2020-11-19T23:59:59+0000"}