{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T12:46:47+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Clinical Oncology Consultant (Breast – Brain with GI Cover)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term contract: six months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity to join our friendly department in the heart of beautiful Cornwall. Applications are invited for a six month Locum Consultant Clinical Oncologist post at the Royal Cornwall Hospital Trust (RCHT) with the aim to substantiate the role in 2021.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is flexible with a minimum of 6PA upwards needed to cover the tumour sites in the job role. There is also the possibility of accommodation costs being covered. This would be discussed and agreed prior to appointment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our ideal candidate would join our team treating Breast and CNS malignancies. Due to a planned absence from the department in early 2021, we are offering this post as including a period of up to three months covering the Gastrointestinal workload instead of Breast Cancer alongside two colleagues. The department will substantiate this post for the CNS and Breast Cancer practices.&lt;/p&gt;\n&lt;p&gt;This role would be ideal for a colleague finishing their training as it will be highly-supported whilst being varied. It may also suit a senior colleague looking for a change of pace and the opportunity to share their experience.&lt;/p&gt;\n&lt;p&gt;As the only Cancer Centre in the county, the Sunrise Centre at RCHT provides a full range of cancer treatments for our patients as close to home as possible. We are early adopters of new treatments and have a large and active clinical trial portfolio, being second highest recruiters in the Peninsula. Alongside this quality of care, we also deliver in quantity, regularly being in the top five departments in the country for radiotherapy treatments per machine and treatment complexity. We continue to be the highest scoring Trust in the South-West in the National Cancer Patient Experience Survey with our highly trained specialist nurses notably praised. With £135 million in new investments, the Trust is currently building a brand new Haematology-Oncology Inpatient Unit, due to open in 2022. We will also be launching our SABR service later in 2020.&lt;/p&gt;\n&lt;p&gt;The Covid pandemic has shown how important quality of life and work-life balance are. Cornwall is a beautiful county, offering outstanding quality of life with many opportunities for outdoor activities. Sailing waters, surfing beaches, rugged coastal pathways and a thriving arts and theatre scene all make weekends long and sunsets memorable. We have risen to the challenges posed by altering our clinical pathways to provide care and oversight closer to patients and virtually when we can.&lt;/p&gt;\n&lt;p&gt;Please contact Dr Grant Stewart, Clinical Lead for Oncology at grantstewart1@nhs.net to discuss this great opportunity.&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospital is an Equal Opportunities Employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Locum Consultant Clinical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236451", "validThrough": "2020-11-08T23:59:59+0000"}