{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa based on full time hours"}}, "datePosted": "2020-10-19T10:45:21+0100", "description": "&lt;p&gt;&lt;span&gt;The System Support Team within Southern Health NHS Foundation Trust supports 8000 users of our Electronic Patient Record (EPR) system, RiO and several other patient information systems (PAS) used by clinicians in the Trust. A post has arisen within the team for a Senior System Support Specialist, based in &lt;span&gt;either Moorgreen or Tidbury Farm&lt;/span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In this innovative team you will develop expertise in a variety of systems and encounter a wide range of challenges. We offer excellent learning and personal development opportunities. Training is provided in classroom and on the job. &lt;br /&gt; &lt;br /&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently delivering an exciting portfolio of projects which this post will support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;The key function of the Senior System Support Specialist is to support the users of our patient information systems, through daily monitoring and resolution of calls assigned to the team by our first line Service Desk. Providing excellent service to our internal customers, you will have good communications and customer handling skills to support our users. You will be investigating issues, and creating solutions, updating the systems and sometimes escalating incidents to colleagues, managers, or suppliers. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;You will also be called upon to work with, and build relationships with staff at all levels of clinical, administration and management. The key working relationships within the Trust will be with other System Support Team colleagues, and your Managers, the IT Training Team, our Change and Benefits Team, Teams delivering Trust Projects and most importantly Clinical staff within our operational Teams to support the delivery of excellent patient care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;All our supported systems have regular managed configuration and maintenance releases to deliver continuous improvement to the features available to our users. The Senior System Support Specialist must be able to work with colleagues to assess the impact of requests for change, propose options, create and document changes to configuration, test the fixes and releases and ultimately support the release process to ensure their safe deployment to the users.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Your experiences in system management, system configuration or customer service are relevant and if you have this in NHS/Health/Clinical Sector it is an advantage. You will need to be able to communicate effectively and demonstrate good written and spoken English. You must have good customer handling/negotiation skills and have IT skills, and if you have experience of VBA, MSExcel or MSAccess this will be a plus.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;This is not a primarily a technical role, and requires that you are a flexible self-starter, who can work effectively as part of a team or alone. Successful candidates will enjoy solving problems, and take pride in completing their work efficiently to a high standard.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Training will be given for RiO and other Client Information Systems, our ICT Services Incident Management system ITBM, and IT Information Library (ITIL) guidelines on managing and resolving incidents.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Out of core working hours is occasionally required to support releases or help users with urgent problems. The ability to travel within Hampshire is required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you think this could be you, please contact Tony Goodwin/Emma Chester (023 8231 1281/023 8231 1274) for an informal discussion.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorgreen or Tidbury Farm", "postalCode": "SO31"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8666", "longitude": "-1.30859"}}, "title": "System Support Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231850", "validThrough": "2020-11-09T23:59:59+0000"}