{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16305", "minValue": "16305", "unitText": "YEAR", "value": "£9.70 per hour"}}, "datePosted": "2020-10-23T15:44:15+0100", "description": "&lt;p&gt;Do you want to join a company that cares?&lt;/p&gt;\n&lt;p&gt;Alpha Health Care are Dementia Specialists, providing a person centred, caring and professional service to all our residents in a safe and homely environment. Currently recruiting for an NVQ 3 qualified Team Lead to join our specialised team at Waters Edge Residential Care Home.&lt;/p&gt;\n&lt;p&gt;The benefits of this Team Lead position include:&lt;/p&gt;\n&lt;p&gt;- £9.70per hour&lt;/p&gt;\n&lt;p&gt;- Paid breaks&lt;/p&gt;\n&lt;p&gt;Shift Pattern - 8am - 8pm&lt;/p&gt;\n&lt;p&gt;-Company pension scheme&lt;/p&gt;\n&lt;p&gt;- Dedicated In-house training team&lt;/p&gt;\n&lt;p&gt;- Free parking on site&lt;/p&gt;\n&lt;p&gt;- Easily commutable from Bloxwich, Walsall, Wolverhampton, Great Wyrley, Cannock, Hednesford and surrounding areas.&lt;/p&gt;\n&lt;p&gt;- Uniform provided&lt;/p&gt;\n&lt;p&gt;- 5.6 weeks holiday entitlement per year&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SUMMARY OF KEY RESPONSIBILITIES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The responsibilities linked to this position can be summarised as follows:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring the highest standards of person centred, caring, safe, responsive and effective care is delivered to all Service Users at all times.&lt;/li&gt;\n&lt;li&gt;Safe administration of medication&lt;/li&gt;\n&lt;li&gt;Working as a team player in support of the Managers and alongside Senior and Care Assistants who they will both support and supervise.&lt;/li&gt;\n&lt;li&gt;Co-operating with and applying operational and environmental controls to ensure that care is delivered in a safe, consistent and collaborative manner.&lt;/li&gt;\n&lt;li&gt;Maintaining and respecting the confidentiality of Service User’s, their relatives and all staff within the home as well as visiting professionals.&lt;/li&gt;\n&lt;li&gt;Adhering to and promoting Safeguarding, Health and Safety and other protective measures at all times; acting on and reporting any concerns identified or raised in a prompt, professional and appropriate manner.&lt;/li&gt;\n&lt;li&gt;On call - to be available to offer support, advise and attend the home when required&lt;/li&gt;\n&lt;li&gt;To complete assessments on potential Service Users, and advise the management team of the Service User’s needs so that a decision can be made&lt;/li&gt;\n&lt;li&gt;To attend meetings Internal/External&lt;/li&gt;\n&lt;li&gt;To supervise the Senior and care team&lt;/li&gt;\n&lt;li&gt;To take the lead on reviews with external professionals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experience and Job Related Knowledge&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Previous experience working as a Senior Care Assistant is essential&lt;/p&gt;\n&lt;p&gt;Experience and knowledge in delivering individualised person centred dementia care&lt;/p&gt;\n&lt;p&gt;Experience and knowledge in mental capacity and best interest&lt;/p&gt;\n&lt;p&gt;Experience of ordering, administering and safe storage of medication.&lt;/p&gt;\n&lt;p&gt;Sound Knowledge of health, safety and welfare is essential&lt;/p&gt;\n&lt;p&gt;Strong Experience of staff supervision required&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;At Alpha Health Care, we are committed to keeping our staff safe from the risk presented by Coronavirus (COVID-19). We have introduced a number of steps to increase protection for our staff which include regular swab testing, increased access to hand washing and hand sanitising facilities, full access to PPE and welfare support for all our staff.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Alpha Care Homes Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall", "postalCode": "WS6 6BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6361", "longitude": "-2.0112"}}, "title": "Healthcare Team Lead - Residential Care - Days", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241150", "validThrough": "2020-11-06T23:59:59+0000"}