{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Pro rata Per Annum"}}, "datePosted": "2020-10-28T15:31:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our Trust, which is one of the largest providers of healthcare in the area. University Hospitals of Morecambe Bay NHS Foundation Trust covers a large geographic area which encompasses the Furness peninsula, the city of Lancaster and the Lake District. We provide a comprehensive range of acute and support hospital services to a population of 350,000 based around Morecambe Bay. One of the largest employers in the area, we have approximately 6,000 staff working across five sites; Furness General Hospital (Barrow in Furness), Royal Lancaster Infirmary, Westmorland General Hospital (Kendal), Ulverston Community Health Centre and Queen Victoria Centre (Morecambe). By joining us you will be part of a progressive team committed to diversity, excellence and achievement.&lt;/p&gt;\n&lt;p&gt;This is a replacement appointment for a Medical Oncologist to join a motivated, friendly and experienced Oncology team with 5 locally employed Oncologists (four medical one clinical) and four visiting Clinical Oncologists (who visit from Lancashire Teaching Hospitals NHS Trust). You will preferably demonstrate an interest in Lung, Upper GI or Renal Cancers although applicants with other site specialist interests and those seeking to work part-time or flexibly will also be considered. .&lt;/p&gt;\n&lt;p&gt;The Hospitals are situated on the edge of the Lake District National Park, surrounded by an area of outstanding natural beauty offering superb outdoor and recreational activities, particularly related to the sea, lakes, fells and countryside. The Trust has a keen interest and deep involvement in medical and dental education at both undergraduate and post graduate levels. Medical Students from Lancaster Medical School receive the whole of their education, academic and clinical, in Cumbria and North Lancashire following the Liverpool undergraduate medical curriculum. UHMBT is the lead NHS organisation and takes responsibility throughout the five years of the degree for the provision of acute practice placements.&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the GMC with a license to practice and be eligible for inclusion on the Specialist Register or be within 6 months of obtaining your CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;Interview expenses will be paid from point of entry to the UK.&lt;/p&gt;\n&lt;p&gt;We welcome informal discussions/visits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr David EatonJob titleMedical Oncologist and Clinical LeadTelephone number01524 583510 (oncology secretary)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Oncology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247187", "validThrough": "2020-11-29T23:59:59+0000"}