{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T13:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 12 MONTHS DUE TO &lt;/strong&gt;&lt;strong&gt;MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiatic Project Manager who will be based within the Emergency Department at Ysbyty Glan Clwyd, supporting a Nationally commissioned programme to support phase 2 of ‘What does good look like for the emergency department within Wales? ‘&lt;/p&gt;\n&lt;p&gt;This post will support National Programme for Unscheduled Care in understanding &lt;em&gt;‘what good looks’&lt;/em&gt; like for patients accessing an Emergency Department and the creation of a National Emergency Department Quality &amp; Delivery Framework for NHS Wales (EDQDF), as well as the implementation of the Welsh Access Model (WAM). This will include work to agree care standards, a uniform approach to measuring activity and a nationally agreed model of care for Emergency Departments to enable optimization of clinical outcomes and patient and staff experience.&lt;/p&gt;\n&lt;p&gt;The National Collaborative Commissioning Unit (NCCU) is a national unit which is a provider of services to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Welsh Government in the form of the National Programme for Unscheduled Care (NPUC) which is a key National Programme sponsored by the Welsh Government, and it is currently developing a National Emergency Department Quality &amp; Delivery Framework for the NHS in Wales;&lt;/li&gt;\n&lt;li&gt;Emergency Ambulance Services Committee (EASC), and it has created Commissioning Quality &amp; Delivery Frameworks on its behalf for Emergency Ambulance Services, Non-Emergency Ambulance Services and Emergency Medical Retrieval Services;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;and it acts in collaboration with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;the NHS Wales Shared Services Partnership-Procurement Services (NHWSSSP-PS) across the seven Health Boards, twenty-two Local Authorities and WHSSC for National Framework Agreements for external / independent (and commercially) provided care services covering Mental Health &amp; Learning Disability Hospital Services; CAMHS and Mental Health &amp; Learning Disability Younger Adult Care Homes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post would appeal to someone who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;has recent project or improvement experience or a qualification that would support project management&lt;/li&gt;\n&lt;li&gt;has ability to work with and quickly build strong relationships with a wide range of colleagues across health and social care organisations, and from fellow project officers to front line clinical operational staff&lt;/li&gt;\n&lt;li&gt;is motivated to make a difference to patient experiences; staff engagement; quality of care and delivery of value for money services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 22/11/20&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGuto GwynJob titleEDQDF Programme ManagerEmail addressGuto.Gwyn@wales.nhs.ukTelephone number07919302314&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Glan Clwyd, Bodelwyddan", "postalCode": "LL18 5UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2718", "longitude": "-3.49635"}}, "title": "EDQDF Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259796", "validThrough": "2020-11-22T23:59:59+0000"}