{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a inc HCA"}}, "datePosted": "2020-11-02T14:02:09+0000", "description": "&lt;p&gt;&lt;em&gt;We are one of only two community teams in the UK to receive an outstanding status by CQC. Come and join us, and become a part of the amazing work we do!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Integrated Local Services are seeking an enthusiastic, full time, Senior Practitioner District Nurse to join the District Nursing team in Southwark and Lambeth.&lt;/p&gt;\n&lt;p&gt;It is essential that the post holder is able to undertake a prescribing course and advanced assessment course once in post as it is an essential part of the role. Please can you describe your ability to undertake these courses and that you have academic experience in your application form. We will also assess at interview.&lt;/p&gt;\n&lt;p&gt;You will be forward-thinking and motivated, as you gain invaluable experience of proactively meeting the health needs of our community population. You must demonstrate excellent communication and team working as through clinical case management you will care for patients with long-term conditions, those at risk, end of life care needs, and those with supported self-care programmes. High quality nursing will also be demonstrated as you care for patients with complex and challenging needs. Training and opportunities will be provided for you to develop your skills and competencies, in addition to clinical supervisions and appraisals.&lt;/p&gt;\n&lt;p&gt;Working on a 7 day shift service (hours between 8.00 – 20.00), this post also includes rotational weekend work (maximum two per month).&lt;/p&gt;\n&lt;p&gt;Closing date: 30th November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;Interview date: 9th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Karen Jackson&lt;/strong&gt; (karen.jackson@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Senior Practitioner District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252341", "validThrough": "2020-11-30T23:59:59+0000"}