{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 pa plus HCAS pro rata"}}, "datePosted": "2020-11-06T09:45:56+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Highly Specialist Clinical/ Counselling Psychologist 7 / 8a&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and committed Health and Care Professions Council (HCPC) registered Clinical Psychologist to join our well established mental health and memory assessment services for older people, who live in the Royal London Borough of Merton.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at Springfield University Hospital and will cover maternity leave for 12 months. The role involves being part of the well-established memory assessment service and a community multidisciplinary mental health team who provide a comprehensive service to older people with a wide range of mental health needs. This post is particularly varied and includes providing formal evidenced based psychological therapies and intervention, psychological consultation and carrying out neuropsychological assessments.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We welcome candidates who are interested in older adult work. Regular individual supervision and support will be provided by an 8b psychologist within the service line and also good network of psychologists across the Cognition and Mental Health (CMHA) service line, who regularly meet for CPD activities and peer supervision. CMHA psychologists practice CBT, ACT, CFT, IPT and Systemic therapies. We have good links with the ClinPsyD course at Surrey University and regularly have psychology trainees on placement. Both the multidisciplinary team and the wider trust recognises and values the contribution of Clinical Psychology.&lt;/p&gt;\n&lt;p&gt;This post would be suitable for someone newly qualified and also someone who is interested in developing their skills working with older people.&lt;/p&gt;\n&lt;p&gt;A car driver would be ideal but not essential.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the location:&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous pay, pensions and leave, we offer a comprehensive pay, pensions and leave&lt;br /&gt;package which is dependent on the role and length of service&lt;/li&gt;\n&lt;li&gt;Work life balance, we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home&lt;/li&gt;\n&lt;li&gt;Career development, There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes.&lt;/li&gt;\n&lt;li&gt;Subsidised car parking - You can park at any of our sites at a reduced rate of £20/month&lt;/li&gt;\n&lt;li&gt;NHS discounts, with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicole Hull, Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address Nicole.Hull@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, Tooting", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Highly Specialist Clinical/ Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259078", "validThrough": "2020-11-13T23:59:59+0000"}