{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 pa inc pro rata"}}, "datePosted": "2020-10-21T12:47:32+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Mental Health Consultant Pharmacist within CNWL due to the current post holder relocating.&lt;/p&gt;\n&lt;p&gt;The postholder will be based in London at one of the London mental health sites. As Consultant Pharmacist you will work closely with the senior pharmacy team to deliver the Trust’s medicines optimisation strategy and pharmacy objectives. You will provide professional and clinical leadership for mental health and support pharmacy staff with their development and training. This post will deliver innovative mental health care to people.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Lead Consultant Psychiatrist/Divisional Medical Director; Managing Director for the appropriate division (Jameson) and have professional accountability to the Chief Pharmacist.&lt;/p&gt;\n&lt;p&gt;You must have initiative and drive, be forward thinking and have the ability to influence a wide range of health professionals. We offer a supportive and friendly environment and we have a genuine and active commitment to education and staff career development.&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptional candidate for this role, to support the management of mental health patients across CNWL to optimise medicine use in a holistic way. This role will have a high degree of autonomy and be responsible for providing expert leadership and knowledge across the health and care systems in which CNWL operates, as well as through national and international networks.&lt;/p&gt;\n&lt;p&gt;The successful candidate for this post must be working in line, or show commitment to work towards Consultant Pharmacist credentialing as set by the Royal Pharmaceutical Society.&lt;/p&gt;\n&lt;p&gt;Interview date: 25th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTf ChanJob titleChief PharmacistEmail addresstf.chan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Charles Hospital, London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Consultant Pharmacist - Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236479", "validThrough": "2020-11-19T23:59:59+0000"}