{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata plus HCAS"}}, "datePosted": "2020-10-21T12:01:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Eight sessions (0.8 WTE) Band 8a Highly Specialist CAMHS Practitioner&lt;/strong&gt; &lt;strong&gt;(e.g. Clinical Psychologist/ Family Therapist or Senior Clinical Nurse Specialist) two year fixed-term post in the newly commissioned Waiting List Team, alongside the existing Neurodevelopmental Team in Ealing CAMHS. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Following investment and subsequent expansion of our Neurodevelopmental team, an interesting opportunity has arisen in Ealing CAMHS for a Band 8a (0.8 WTE) Highly Specialist CAMHS Practitioner role to work in the Neurodevelopment team in Ealing CAMHS. This is a two-year fixed term post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will undertake specialist assessments for autism spectrum disorder (ASD), including the ADOS-II, 3di, ADI and cognitive assessments. Additionally, there will be opportunity to facilitate psychoeducation groups for parents relating to ASD and individual/family work with children and young people with comorbid mental health difficulties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Neurodevelopmental team is part of a thriving Tier 3 CAMHS service, which also includes a child, adolescent and family team and links to a comprehensive Tier 2 service. The wider team includes professionals from multiple disciplines. The post holder will be part of a growing speciality team.&lt;/p&gt;\n&lt;p&gt;Clinical Psychology, Nursing and Family Therapy are well represented throughout the teams. The service prides itself in thinking and implementing creative and innovative ways of delivering care; for example, Ealing CAMHS was selected to be a trailblazer site for the new mental health support in schools and colleges, and there are opportunities to be involved in quality improvement projects.&lt;/p&gt;\n&lt;p&gt;We are passionate about supporting our specialists in training and regularly have trainees on placement with us. We offer excellent CPD opportunities and if required, specialist training will be provided for conducting ASD assessments (e.g. ADOS-II and 3di). You will be well-supported in the post and will receive clinical and professional supervision from the senior leads. There will be opportunities to supervise Band 7 CAMHS practitioners, Trainees and Assistants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ealing CAMHS is a friendly, busy, borough-located service, and operates as part of a wider three-borough CAMHS service, including Hounslow and Hammersmith and Fulham, within West London Mental Health Trust. The teams have excellent relationships with the local mainstream and specialist schools and links within Social Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a skilled clinician who is enthusiastic and dedicated, who brings a committed interest, and a level of experience of working with children neurodevelopmental and mental health difficulties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome any inquiries about this post to&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Lynne Eastwood, (Principal Clinical Psychologist) Lynne.Eastwood@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Sumita Dutta (Principal Systemic Family Therapist)&lt;/p&gt;\n&lt;p&gt;Sumita.Dutta@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;Ann Simms (CAMHs Lead Nurse)&lt;/p&gt;\n&lt;p&gt;Ann.simms@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;in Ealing CAMHS on 0208 354 8160&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews planned for: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Lynne EastwoodJob titlePrincipal Clinical PsychologistEmail addressLynne.Eastwood@westlondon.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "17111 Ealing CAMHs NDT Waiting List, Southall", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Highly Specialist CAMHS Practitioner NDT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236243", "validThrough": "2020-11-06T23:59:59+0000"}