{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-27T12:46:42+0000", "description": "&lt;p&gt;The Royal Bolton Hospital is a leading health care provider in the Northwest of England and is at the forefront of service provision across all pathways. This enables us to provide high quality, timely care to all of our patients, whilst ensuring job satisfaction for our staff. The Trust is financially robust and has recently secured substantial funds to develop estates and IT infrastructure across all sites.&lt;/p&gt;\n&lt;p&gt;Due to planned service expansion, the Radiology Department is looking for an enthusiastic, experienced sonographer/Advanced Practitioner Ultrasound to add to our dynamic, multi-professional team. We offer a wide range of Ultrasound Services including Obstetrics, Gynaecology, MSK, General Abdominal and a daytime A&amp;E service as well as provision at our satellite site at Bolton One and Ingleside.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Radiology Department has a managed equipment contract with Siemens resulting in a rolling five year equipment replacement plan.&lt;br /&gt;&lt;br /&gt;As a department, we are committed to education and are proactive in encouraging and supporting Continuing Professional Development and audit. We participate in teaching and learning at post graduate level for Sonographers and other medical professions. We are participating in several active research projects; we have a Sonographer led HyCoSy service and have an innovative Emergency Department ultrasound service.&lt;br /&gt;&lt;br /&gt;In order to apply for this post you must possess PGC/D in Medical Ultrasound, DMU or equivalent. Registration on the voluntary SCoR sonographer or HCPC registration would be expected.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah HollingsJob titleTeam Lead UltrasoundTelephone number01204 390354&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bolton Hospital, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Sonographer/Advanced Practitioner Ultrasound", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244600", "validThrough": "2020-11-10T23:59:59+0000"}