{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "1681", "minValue": "1681", "unitText": "YEAR", "value": "£16,416 per annum for 1 session per week"}}, "datePosted": "2020-10-29T12:07:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Post Title:&lt;/strong&gt; Clinical Leadership, SEL Integrated Urgent Care/111&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£16,416 per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Length: &lt;/strong&gt; up to 2 years&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sessions:&lt;/strong&gt; 1 session per week (1 session = 4 hours)&lt;/p&gt;\n&lt;p&gt;SEL CCG’s 111 team is seeking to appoint a Clinical lead for one session a week, to work as part of a management and clinical team to develop integrated urgent care. This is a unique opportunity for a clinician to develop and hone their commissioning and quality improvement skills.&lt;/p&gt;\n&lt;p&gt;The postholder will be expected to work closely with key personnel in the CCG, providers such as the London Ambulance Service, general practices, GP out of hours, as well as NHSE/I and other STPs.&lt;/p&gt;\n&lt;p&gt;Supervision and support will be provided by Dr Rob Davidson, SEL CCG Governing Body member and clinical lead for urgent and emergency care. The post is initially for 6 months with the possibility of extension for a further year.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Organisational Context&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;NHS South East London Clinical Commissioning Group is the statutory body responsible for commissioning healthcare services to south east London’s 1.9 million residents of the boroughs of Bexley, Bromley, Greenwich, Lambeth, Lewisham and Southwark.&lt;/p&gt;\n&lt;p&gt;The CCG buys services from hospitals, ambulance service and community service providers.&lt;/p&gt;\n&lt;p&gt;South East London CCG covers all GP practices in the area and is overseen by a governing body, which is responsible for making decisions about healthcare. The governing body includes GPs, nurses, a hospital doctor and other healthcare professionals and patient representatives. This is supported by other prime committees including Borough Based Boards which will have delegated responsibility for commissioning local services.&lt;/p&gt;\n&lt;p&gt;The purpose of the role is to provide clinical leadership for quality and safety for SEL into the IUC/111 programme; provide a systematic approach to supporting quality improvement and the delivery of better outcomes for local residents who use the 111 service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "160 Tooley Street, London", "postalCode": "SE1 2TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5032", "longitude": "-.079442"}}, "title": "Clinical Leadership, SEL Integrated Urgent Care/111", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248253", "validThrough": "2020-11-15T23:59:59+0000"}