{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T14:16:27+0100", "description": "&lt;p&gt;&lt;strong&gt;**Please note that this position is fixed term until October 2021**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualified Dental Nurse&lt;br /&gt;Community Dental &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5 hours per week&lt;strong&gt; &lt;br /&gt;Band: &lt;/strong&gt;4&lt;strong&gt;&lt;br /&gt;Salary: &lt;/strong&gt;£21,892 - £24,157 pa&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Requirements: NEBDN Certificate and / or an appropriate professional qualification or equivalent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A stimulating and rewarding opportunity has arisen for a Registered Dental Nurse within our friendly and enthusiastic Community Dental team.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic and highly motivated dental nurse to work as part of a team in the York and wider East Locality Team of HDFT Community Dental Services.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for chair side and clerical duties for the day to day operation of the dental surgery and to assist the dental clinician with clinical treatment of patients, both children and adults, including those who may have special needs or dental phobia; holding a current registration with the GDC and recognised dental nursing qualification.&lt;/p&gt;\n&lt;p&gt;We are a busy, interesting Community Dental department providing clinical treatment for patients, both children and adults, including those who may have special needs, whom may have challenging behaviour, communication difficulties, dental phobias, sensitive and /or complicated medical requirements.&lt;/p&gt;\n&lt;p&gt;Our Dental Nurses work collaboratively with Dentists and Dental Therapists providing high standard of care and the best possible experience for our diverse group of patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate joining our team, should be flexible, well organised with a professional friendly manner and demonstrate excellent communication skills and have a tactful, sensitive approach to the service patient base, dealing with occasional difficult situations; this will include being able to work well under pressure with a flexible approach and contribute to service delivery and clinical governance. The service will support and encourage professional development, with in house training provided on our patient base, enhancing your skills and knowledge of the specialised services provide by Community Dental Services and continual professional development recognized by the GDC.&lt;/p&gt;\n&lt;p&gt;If you would like to be part of our expanding and dynamic nursing team, then please contact us.&lt;/p&gt;\n&lt;p&gt;We have a full time and part time post available, flexible working options can be discussed at interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Joanna Fielden Job title: Dental Nurse Team Leader Email address: Joanna.fielden@nhs.net Telephone number: 07825 522 681&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Level 4 Dental Services - East, York", "postalCode": "YO24 3WY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9491", "longitude": "-1.12924"}}, "title": "Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240888", "validThrough": "2020-11-08T23:59:59+0000"}