{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T09:46:23+0000", "description": "&lt;p&gt;The Clinical Delivery &amp; Networks teams in the South East Region work across the 6 Integrated Care Systems to support delivery of the NHS Long Term Plan priority clinical programmes of Mental Health &amp; Dementia, Maternity, Children &amp; Young People, Diabetes and Cardiovascular-Respiratory disease. There are two posts – one supporting Mental Health, the other supporting the Palliative and End of Life Care programme.&lt;/p&gt;\n&lt;p&gt;As Quality Improvement Support Manager, you will be a key member of the Clinical Delivery and Networks team across the South East supporting service improvement and transformational delivery to the wider system. We are seeking an individual with proven experience in one of the following: service improvement, project management or programme support. Clinical background not essential.&lt;/p&gt;\n&lt;p&gt;As a Quality Improvement Support Manager, you will have a key role in supporting the Heads of Clinical Programmes and their teams in effective planning and management of the workstreams. You will also be expected to take the lead in assisting in their successful delivery.&lt;/p&gt;\n&lt;p&gt;The post-holder will be required to maintain constructive relationships with a broad range of stakeholders, participate in relevant working groups/projects, services and initiatives to provide, information and analytical advice and expertise. You will also be expected to develop and implement data collection systems that will provide accurate and timely data, and present information and issues, explaining highly complex issues, to a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;Close collaboration is required both nationally and regionally and associated travel across the locality will be required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;To have an informal conversation please call Debbie Kennedy on 07918336018 or email at debbie.kennedy1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that the reason for the fixed term contract is due to 3 years funding.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Debbie Kennedy&lt;/p&gt;\n&lt;p&gt;Job title: Head of Clinical Programmes&lt;/p&gt;\n&lt;p&gt;Email: addressdebbie.kennedy1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07918 336018&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG17EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4587", "longitude": "-.976695"}}, "title": "Quality Improvement Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253318", "validThrough": "2020-11-17T23:59:59+0000"}