{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "84103", "minValue": "70794", "unitText": "YEAR", "value": "£70,794-£84,103 per annum (pro rata for part time)"}}, "datePosted": "2020-10-26T14:05:48+0000", "description": "&lt;p&gt;Are you a General Practitioner looking to move into a rewarding role? If you are, we have a new opportunity for a Civilian Medical Practitioner (CMP) at the Medical Centre, RAF Benson, Wallingford, Oxford.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide primary and occupational healthcare in line with General Medical Council standards to ensure our objectives are achieved to optimise patient care.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly team providing a first-class medical service for military personnel and entitled civilians. The working environment is welcoming, inclusive and supportive, and you will be valued for the skills you bring.&lt;/p&gt;\n&lt;p&gt;The role of Defence Primary Healthcare (DPHC) is to provide and commission a safe, effective and efficient healthcare service for entitled personnel contributing to the maximisation of Service personnel fit for task. This is achieved through the provision of an occupationally aware primary healthcare service which includes dental, rehabilitation and mental healthcare services.&lt;/p&gt;\n&lt;p&gt;The duties of the successful candidate will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing general healthcare to all registered patients.&lt;/li&gt;\n&lt;li&gt;Maximising the levels of health, wellbeing and employability of Service personnel to ensure the needs of the single Services are met.&lt;/li&gt;\n&lt;li&gt;Appropriately supervising the management of communicable diseases, including monitoring and reporting through single Service chains.&lt;/li&gt;\n&lt;li&gt;Providing appropriate preventative medical advice to both individuals and Chain of Command.&lt;/li&gt;\n&lt;li&gt;Working in collaboration with all members of the primary healthcare team and line management.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information regarding the role of Civilian Medical Practitioner at RAF Benson, please refer to the Job Description and Person Specification link.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Required Qualifications and Memberships:&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Practitioner with a license to practise.&lt;/li&gt;\n&lt;li&gt;Current GMC registration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is desirable for the successful applicant to be Aviation Medicine trained.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be CV based. At interview, you will be tested against the following Civil Service Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;li&gt;Managing a Quality Service&lt;/li&gt;\n&lt;li&gt;Delivering at Pace&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a Fixed-term Appointment as a Civilian Medical Practitioner in the RAF Benson Medical Facility. Your responsibilities will be as described in this job advert. The reason why you are appointed for a fixed period is due to covering a period of Maternity leave. This post will therefore begin on your appointment and end July 2021. You should be aware that when your Fixed-term Appointment at MOD comes to an end, arrangements will be made in line with the FTA policy.&lt;/p&gt;\n&lt;p&gt;If you are a permanent MoD civil servant and are found successful for an advertised Fixed-term Appointment (FTA) you should move into the post under a Temporary Transfer (for up to a maximum of 3 years). At the end of the posting you will return to your previous MoD Business area. If this posting is at a higher grade, your promotion will be temporary, and you will return to your substantive grade at the end of the Temporary Transfer. If a Temporary Transfer cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA and Change of Work Location in the UK policy for further information.&lt;/p&gt;\n&lt;p&gt;If you are transferring to MoD from another government department (OGD) you should join the MoD on an inward loan. At the end of the loan you will return to your home (OGD) department. If a loan cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA policy for further information.&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical Centre, RAF Benson, Wallingford, Oxfordshire, OX10 6AA", "postalCode": "OX10 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.613", "longitude": "-1.08795"}}, "title": "Civilian Medical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242833", "validThrough": "2020-11-18T23:59:59+0000"}