{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 2"}}, "datePosted": "2020-11-05T14:41:43+0000", "description": "&lt;p&gt;Are you positive, motivated and enthusiastic with strong administrative skills? If so please apply for this Clinical Administrator role as we value your skills.&lt;/p&gt;\n&lt;p&gt;If you enjoy working as part of a friendly, supportive team, have a flexible and positive approach with a professional attitude we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;As part of our growing team you will have the opportunity to make a real contribution to the improvements in NHS care and patient services our organisation provides. You will become part of our aim to be the UKs most respected provider of Dermatology and ENT services by providing a stunningly positive customer experience to Patients, their GPs and our commissioners.&lt;/p&gt;\n&lt;p&gt;You will benefit from weekly 1:1 mentoring sessions with a focus upon your personal development and achieving your goals. You and your team will also benefit from quarterly team events, weekly recognition awards and company-wide summer and end of year celebrations.&lt;/p&gt;\n&lt;p&gt;We currently provide NHS ENT and Dermatology Community services from multiple locations on behalf of 10 CCGs in and around London. Our aim is to continue growing our services to help as many patients as possible.&lt;/p&gt;\n&lt;p&gt;You will provide full administration support to our community health services including effective and positive communication with our patients, referring GPs and appropriate partner organisations.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for full-time and part-time positions and if you are shortlisted you will have an opportunity to discuss this further.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What skills and experience will you need to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Friendly, enthusiastic and positive approach&lt;/li&gt;\n&lt;li&gt;Excellent written, verbal and electronic communication Skills including a strong and positive telephone manner&lt;/li&gt;\n&lt;li&gt;Proven ability to communicate effectively &amp; build relationships at all levels&lt;/li&gt;\n&lt;li&gt;Proven level of accuracy and attention to detail&lt;/li&gt;\n&lt;li&gt;Strong initiative and organisational skills&lt;/li&gt;\n&lt;li&gt;Essential knowledge of Microsoft office&lt;/li&gt;\n&lt;li&gt;GCSE Maths and English Grade C/above or Equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Previous experience of working within an NHS administrative environment would be an advantage, however applicants with other previous administration experience will be considered.&lt;/p&gt;\n&lt;p&gt;Do you embody our company values of emotional intelligence; positivity; continuous personal development; accountability and data orientation? If so we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We know how important it is when you apply for a role – in fact it’s the greatest compliment we can receive as a company. We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Communitas Clinics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR7 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3973", "longitude": "-.103387"}}, "title": "Clinical Administrator - Croydon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258149", "validThrough": "2020-11-12T23:59:59+0000"}