{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 to £53,459 pa inc. allowances"}}, "datePosted": "2020-10-20T10:15:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Full time/part time&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Radiology Directorate has an extensive range of modalities including CT, MRI, breast imaging, nuclear medicine, bone densitometry, interventional and cardiac angiography, all aspects of general and fluoroscopic radiography, with ultrasound performed across our two sites, Darent Valley Hospital and Queen Marys Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for HCPC registered, highly motivated professionals, with good leadership skills and commitment to ongoing service improvement and development to join our friendly but forward thinking department. Applications are invited from enthusiastic and motivated advanced practice sonographers prepared to work flexibly within the department (and cross site) in order to deliver a range of examinations which include: obstetrics (including NT’s, Doppler), gynaecology, general, paediatrics, small parts, MSK and vascular. All sonographers independently report examinations performed. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You must possess a Diploma in medical ultrasound. Vascular and MSK training would be an advantage however we can offer good training opportunities.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications are also invited from sonographerswho hold the Post Graduate Certificate in Ultrasound for Obs/gynae &lt;/span&gt;&lt;span&gt;or Vascular. Post Graduate training for these candidates would be positively encouraged and supported.&lt;/span&gt;&lt;span&gt;Nuchal accreditation/training would be desirable. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;CPD is positively encouraged with regular allocated sessions available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The department offers extended day working and rotational Saturdays and Sundays with time off in lieu as part of our core hours. Part time hours would be considered with shift patterns to be agreed by the line manager to meet the needs of the service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal visit please contact Lesley Northam, Lead Sonographer on 01322 428655 ext 4938 or via &lt;/span&gt;&lt;span&gt;lesley.northam@nhs.net&lt;/span&gt;&lt;span&gt;&lt;span&gt; or alternatively, &lt;/span&gt;&lt;span&gt;contact Nicholas Key Operational Lead Radiographer on 01322 428655 ext 8557 or via &lt;/span&gt;&lt;/span&gt;&lt;span&gt;nicholaskey@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust has a strong commitment to equality and diversity. We aim to employ a representative workforce that reflects the communities we serve. &#39;Positive action&#39; initiatives can be used whenever an under-represented group is identified. As our workforce is currently under-represented in bands 6, 7 and 8, we encourage applications from people with black or minority ethnic backgrounds.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Working days and or shift patterns will be agreed by the line manager to meet the needs of the service. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Dartford and Gravesham NHS Trust is a smoke free organisation. To improve public health, smoking is not permitted anywhere on the hospital site. For advice and support on stop smoking please call 0300 123 1220.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Sonographer (B7 or 8A depending on experience)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233761", "validThrough": "2020-11-09T23:59:59+0000"}