{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum Pro Rata"}}, "datePosted": "2020-11-02T16:00:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and driven Band 6 Speech and Language Therapist to join the Adult Speech and Language Therapy Team at Macclesfield District General Hospital. The post is a 6 month fixed term temporary contract , 0.76 wte, 28.75 hours a week.&lt;/p&gt;\n&lt;p&gt;You will join our forward thinking multidisciplinary team to deliver high quality care to patients with communication and swallowing disorders in the community, in care homes and in patient’s own homes.&lt;/p&gt;\n&lt;p&gt;The team provides a community rapid access service offering assessment, treatment and advice to patients with dysphagia and their carers. This service is delivered primarily in care homes within 24 hours of referral Monday to Friday, 72 hours over the weekend.&lt;/p&gt;\n&lt;p&gt;Experience is required in independent management of a varied caseload including dysphagia. You will be able to demonstrate a high level of assessment and treatment skills of patients with a range of complex neurological and long term conditions.&lt;/p&gt;\n&lt;p&gt;Enthusiastic and motivated, you will be confident liaising with a range of health care professionals. You will be innovative and able to contribute to the development of the Speech and Language Therapy Service.&lt;/p&gt;\n&lt;p&gt;You will engage in staff supervision and training of others and there will be opportunities for self-development within the Trust.&lt;/p&gt;\n&lt;p&gt;We are a well-established, friendly team with a wide range of skills and expertise.&lt;/p&gt;\n&lt;p&gt;Flexibility is essential as you will be required to work across sites in East Cheshire and assist colleagues from other teams. It is therefore necessary to travel efficiently between sites and to rural areas.&lt;/p&gt;\n&lt;p&gt;Why join us?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Varied exposure to a range of diverse conditions, every day is different!&lt;/li&gt;\n&lt;li&gt;Our dynamic management team are helpful and open to improvements and thinking differently&lt;/li&gt;\n&lt;li&gt;Funded training opportunities&lt;/li&gt;\n&lt;li&gt;Welcoming and helpful team&lt;/li&gt;\n&lt;li&gt;Opportunity to engage in the development of the Occupational Therapy department objectives and project work&lt;/li&gt;\n&lt;li&gt;Regular formal and informal supervision with a twice yearly personal development review&lt;/li&gt;\n&lt;li&gt;Ideally located where the Peak District meets the Cheshire Plain, yet only 20 minutes by train from central Manchester and its airport. Training in a location with the best of all worlds; a DGH within reach of countryside and city.&lt;/li&gt;\n&lt;li&gt;A small and friendly DGH where everyone counts. In a recent visit (May 2016), Health Education England NW noted that ‘all trainer groups would recommend the Trust as a place to work. Trainees indicated they felt appreciated and said the Trust provided a supportive and friendly working environment. We are happy to provide additional information or to arrange an informal visit, please contact Jacquie Ollier, jacquie.ollier@nhs.net, 01625 661488.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;East Cheshire NHS Trust benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27-33 days annual leave PLUS bank holidays (pro rata)&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes&lt;/li&gt;\n&lt;li&gt;Occupational Health and Wellbeing Service&lt;/li&gt;\n&lt;li&gt;Counselling service&lt;/li&gt;\n&lt;li&gt;Competitive pension&lt;/li&gt;\n&lt;li&gt;Option to purchase additional annual leave&lt;/li&gt;\n&lt;li&gt;Large range of discounts with local and national businesses i.e. gym memberships, theatre offers, local beauticians, hairdressers, jewellery, large retail stores and much more.&lt;/li&gt;\n&lt;li&gt;Free seasonal flu vaccinations&lt;/li&gt;\n&lt;li&gt;Fast access to the Physiotherapy department&lt;/li&gt;\n&lt;li&gt;Free eye care vouchers&lt;/li&gt;\n&lt;li&gt;Staff car parking scheme&lt;/li&gt;\n&lt;li&gt;Stop smoking support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is Fixed Term for 6 Months&lt;/p&gt;\n&lt;p&gt;Hours per week: 28.75&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jacquie Ollier Job title Therapy Team Manager Email address jacquie.ollier@nhs.net Telephone number 01625 661488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Clinical Specialist Community - Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252732", "validThrough": "2020-11-16T23:59:59+0000"}