{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-21T13:47:50+0100", "description": "&lt;p&gt;&lt;strong&gt;West Enfield Collaborative Primary Care Network&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our PCN comprises of 4 practices- Abernethy House, The Town Surgery and Winchmore Hill Practice/ Park Lodge Medical Centre. The practices have a combined geographic area across West Enfield. There is a wide socio-economic and demographic served within this area which will provide an interesting and varied case mix. You will be joining an enthusiastic team of clinicians and administrators. Two of the larger practices are teaching practices so you will be well supported with on-going professional development (training support, CPD and peer support). The role will contribute to the improving quality of care of our patients across the network of practices.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide high quality patient care, enhancing patient experience by providing excellent clinical effectiveness in a safe environment. Working in partnership to provide gold standard services and develop a sustainable future for the local health community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The PCN teams work with a wide range of partner organisations and stakeholders, including acute trusts, mental health trusts, local authorities, community services and primary care, as well as voluntary sector organisations.&lt;/p&gt;\n&lt;p&gt;The PCN approach is to deliver integrated care based around the needs of service users and patients rather than being constrained by historical structures. We are looking to appoint Health and Social Care Coordinators who will play a key co-ordinating role at the heart of the GP Practices. The post holder will ensure that our patients receive the co-ordinated care they depend on, care, which is responsive to their needs and designed in cooperation with patients, carers and all supporting services.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "N21 2SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6332", "longitude": "-.09381"}}, "title": "Health &amp; Social Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236696", "validThrough": "2020-11-11T23:59:59+0000"}