{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-05T09:30:48+0000", "description": "&lt;p&gt;South London and Maudsley NHS Foundation Trust (SLAM) are looking to recruit a full time, dynamic and enthusiastic Consultant Psychiatrist to work within the Liaison team in the London Borough of Lewisham. This is an all age service, which is compliant with the Core 24 model for Liaison Psychiatry.&lt;/p&gt;\n&lt;p&gt;This is initially a twelve-month fixed term post with likelihood of becoming permanent in due course following a formal AAC process.&lt;/p&gt;\n&lt;p&gt;If you are looking for an exciting front line role, within a well- established team, with opportunities for further service development and incorporating quality improvement methodology to evaluate changes, then this is the ideal post for you.&lt;/p&gt;\n&lt;p&gt;You will join two other consultants, one of who is an Adult Liaison Psychiatrist (full time, 10 PA) and the other, is an Old Age Liaison Psychiatrist (0.7 PA). The role would be ideal for a dual trained Liaison consultant (Adult and Old age) but we are also open to receiving applications just from Adult Liaison Consultants.&lt;/p&gt;\n&lt;p&gt;You will be working closely with a well establish core 24 MDT Liaison team with junior doctor support (ST, CT and FY doctor).&lt;/p&gt;\n&lt;p&gt;Ideally we would like the post holder to work from 11 am until 7 pm, Mon to Friday although we are open to those who may want to follow a more traditional 9-5 working pattern or a flexible working pattern.&lt;/p&gt;\n&lt;p&gt;Lewisham Liaison psychiatry team provides liaison mental health service to University Hospital of Lewisham (UHL). UHL is a 450 bedded teaching hospital situated in an inner London Borough, Lewisham. Lewisham has an estimated population of about 305,000 with a diverse ethnic community, approx. 47% BME population.&lt;/p&gt;\n&lt;p&gt;For more details regarding the post please see the Job description attached.&lt;/p&gt;\n&lt;p&gt;The trust is a part of King’s Health Partners Academic Health Sciences Centre (AHSC). KHP is responsible for seeing 2 million patients each year, has 25,000 employees and 19,500 students, and a £2 billion annual turnover. It brings together the best of basic and translational research, clinical excellence and world-class teaching to deliver ground-breaking advances in physical and mental healthcare. There are excellent opportunities for teaching, training, supervising and mentoring medical students and trainee doctors, participating in audit and quality improvement projects and getting involved in research. You will work very closely with your fellow consultants and be encouraged to participate in and be a part of the famous Maudsley Grand rounds and be an active member of the Lewisham MAC (Medical Advisory committee) where you will have the opportunity to regularly network with and seek support from your consultant colleagues.&lt;/p&gt;\n&lt;p&gt;It is a condition of your employment that you are, and remain a fully registered medical practitioner and are included on the Specialist Register for General Adult Psychiatry held by the General Medical Council (GMC), or are eligible for inclusion into the register within six months of your appointment and continue to hold a licence to practice. You will be approved under Section 12 (2) of the Mental Health Act 1983 and be an Approved Clinician or able to achieve this within 3 months of your appointment.&lt;/p&gt;\n&lt;p&gt;The salary range for this post is in accordance with the NHS consultant salary scale (whole time), plus London Weighting (whole time).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Covid &lt;/strong&gt;– There are robust systems in place within Lewisham and SLAM to support staff and patients during the pandemic including infection control measures (in line with PHE guidance) with emphasis on staff and patient well being and support. You will be provided with a work lap top and VPN access and mobile phone to enable working off site should the need arise. All such arrangements will need to be discussed with your line manager (Associate Medical director for Lewisham .&lt;/p&gt;\n&lt;p&gt;Lewisham is cosmopolitan part of London with an energetic, creative and diverse local community. It benefits from attractive residential neighbourhoods, great local schools and a large number of parks and green spaces. There are excellent transport connections to the rest of London and the wider region, with Canary Wharf, the City, London City Airport and the new international rail terminal at Stratford all within easy reach of the borough. The London Overground is now connecting more of Lewisham with central London and the rail and tube network. In addition, there are exciting developments taking place in local town centres and neighbourhoods, bringing new housing, new schools and new leisure facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits offered by SLAM&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close-knit team at SLaM. It’s important to us that you feel valued and appreciated and that is why we have a comprehensive benefits package on offer.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further information please contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Lewisham Associate Medical Director, Dr. Zain Sadiq; Zain.Sadiq@slam.nhs.uk&lt;span style=&quot;text-decoration: underline;&quot;&gt;; Tel 0203 228 6393/ 07736462312&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;General Manager for In-patient, Crisis and Liaison Services, Lesa Bartlett &lt;/span&gt;Lesa.Bartlett@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Adult Liaison Consultant Dr Andrew Camden &lt;/span&gt;Andrew.Camden@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Start date – Ideally mid Dec 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ladywell Unit, Lewisham", "postalCode": "SE13 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4536", "longitude": "-.016997"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257050", "validThrough": "2020-11-19T23:59:59+0000"}