{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-11-06T08:16:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated, innovative and enthusiastic individual to join our well established ACCP team. South Tees Hospitals NHS Foundation Trust is a highly regarded organisation. The Cardiothoracic Critical Care directorate has a consistent and extremely successful track record in delivering high quality patient services for the population it serves.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Successful selection will be dependent upon proven experience in critical care and your ability to demonstrate the motivation and competence required within an advanced practice role. You will be required to have successfully completed the Masters/Postgraduate Diploma Advanced Clinical Practice (Critical Care) or equivalent.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will work closely with the medical team as a member of the medical rota across the 24/7 period as an advanced practitioner, assessing and managing critically ill patients and prescribing independently as an integral part of the Critical Care team. You will also be involved in, and lead on education and audit/project work.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting your professional development with appropriate supervision from your Medical colleagues, whilst enabling you to play a key role within the multi-professional team.&lt;/p&gt;\n&lt;p&gt;This role is integral to the safe and effective delivery of critical care services both now and in the future at South Tees Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Please contact Lindsay Garcia, Nurse Consultant Critical Care 01642 854643, Dr Simon Gardner Consultant in Anaesthesia and Critical Care, Dr Jonathan Brand, Clinical Director and Consultant in Anaesthesia and Critical Care&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact Lindsay Garcia, Nurse Consultant Critical Care 01642 854643, Dr Simon Gardner Consultant in Anaesthesia and Critical Care, Dr Jonathan Brand, Clinical Director and Consultant in Anaesthesia and Critical Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Advanced Critical Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258860", "validThrough": "2020-11-20T23:59:59+0000"}