{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43973", "minValue": "36815", "unitText": "YEAR", "value": "£36,815 - £43,973"}}, "datePosted": "2020-11-04T21:39:10+0000", "description": "&lt;h1&gt;High Intensity CBT Therapists&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Salary band:&lt;/strong&gt;  £36,815 - £43,973 depending on skills and experience (pro rata for part time employees)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full time (37.5 hours per week) and part-time positions (minimum 22.5hrs), as well as flexible and bank hours available&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Remote working attached to one of our services&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt; The CBT therapist role within Insight Healthcare IAPT services is highly valued and seen as an integral part of what we do. Our therapists provide disorder specific assessments, formulation and evidence-based CBT protocols for people with anxiety disorders and/or depression. We work to the stepped care model to provide the least intrusive and most appropriate level of care to meet the needs of the person. Therefore, our CBT therapists will offer a wide range of treatments and delivery formats. Adapting what we offer to make our treatments more accessible is a critical characteristic of what we do.&lt;/p&gt;\n&lt;p&gt; We have new CBT preceptorship for newly qualified staff and career development opportunities through to senior management and clinical leadership. As you will already know, IAPT is fast paced. We listen to our staff wellbeing needs and provide clinical CPD, self-care sessions and high-quality resources to enable you to support people effectively. The role is varied and constantly evolving with the evidence base and guidance and you can be a part of our evolution if you join us.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We will care for you, your role and career development, while you care for the people who need our support.&lt;/li&gt;\n&lt;li&gt;Together we will evolve and innovate services to help us to face the future needs of people with anxiety disorders and depression.&lt;/li&gt;\n&lt;li&gt;Together we will increase access; provide the least burdensome, most effective treatments first; and help more people to recover.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is our mission to improve the mental health and wellbeing of the people we serve. You will play a key role in delivering this mission and be committed to our core values, which are at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;We would love to hear from you if you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are a qualified and accredited CBT therapist&lt;/li&gt;\n&lt;li&gt;Are looking to work for an innovative provider who really values you and your career development.&lt;/li&gt;\n&lt;li&gt;Have a proven track record of delivering high quality disorder specific assessments, formulation and protocol-based CBT interventions that reflect local and national priorities and targets.&lt;/li&gt;\n&lt;li&gt;Are able to demonstrate good therapeutic relationships with people.&lt;/li&gt;\n&lt;li&gt;Are able to undertake thorough risk assessments.&lt;/li&gt;\n&lt;li&gt;Are an inspirational and collaborative team player with excellent verbal and written communication skills.&lt;/li&gt;\n&lt;li&gt;Are able to organise high volume workload to ensure effective prioritisation and delivery of objectives.&lt;/li&gt;\n&lt;li&gt;Are flexible to meet the needs of the service.&lt;/li&gt;\n&lt;li&gt;Are committed to improving access to psychological therapies and working within these services for your future career development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I have worked for Insight Healthcare for many years and am proud of the services that we offer. We really care about supervision, doing the right things at the right time and putting the patient at the heart of all we do. There is really exciting developments in the organisation at the moment you can get involved in, like our new clinical training CPD hub and patient resources, our new website that is being built and apps. I have found it a really inspiring and encouraging service in which to develop. I have recently been appointed as Clinical Lead for our National Team and am really enjoying sharing knowledge and skills. We have such talent in the organisation”&lt;/em&gt; - &lt;strong&gt;Sara, National Team Interim Clinical Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;How to apply&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;We have attached the job description, person specificaition and information pack for this role. It is essential that you read these documents prior to applying.&lt;/li&gt;\n&lt;li&gt;For further information on the role, please email Alfia Jaweed (People Adviser) via &lt;span style=&quot;text-decoration: underline;&quot;&gt;recruitment@concerngroup.org&lt;/span&gt; and she will be happy to help you.&lt;/li&gt;\n&lt;li&gt;Please apply through the NHS Jobs website. Please note, all correspondence will be through the email address or phone number(s) provided on your application form. To avoid missing our emails, please regularly check your junk mail folder.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is 29th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The interview dates are to be confirmed, but likely to be held early December&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced DBS disclosure, which we will cover the cost of. If you have not heard from us within 6 weeks of applying, please assume you have been unsuccessful on this occasion. Concern Group reserves the right to close the vacancy early if a large volume of applications is received.        &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mental Health Concern", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130357"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England", "postalCode": "NE13 6DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0608", "longitude": "-1.63005"}}, "title": "High Intensity CBT Therapists  (Remote Working)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256885", "validThrough": "2020-11-18T23:59:59+0000"}