{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,146 per annum inclusive of HCAS"}}, "datePosted": "2020-10-28T10:16:20+0000", "description": "&lt;p&gt;Welcome to Frimley Health NHS Foundation Trust (FHFT) – one of the country’s largest NHS Trusts! Our focus on clinical excellence means we are the perfect place to progress as a professional.&lt;/p&gt;\n&lt;p&gt;Our friendly, supportive, open culture makes this a special setting to deliver great patient care so if you are a passionate, patient focused Nurse or ODP looking for a role where you are well supported to develop and grow in your career then this is the place for you.&lt;/p&gt;\n&lt;p&gt;So, why join FHFT, and in particular Wexham Park Hospital&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We have a reputation as a centre of clinical excellence and rated “good-outstanding” by the CQC&lt;/li&gt;\n&lt;li&gt;Wexham Park is in a great location based in the busy commuter belt with quick and easy transport links into London&lt;/li&gt;\n&lt;li&gt;We have upcoming new facilities, and state-of-the-art medical technology&lt;/li&gt;\n&lt;li&gt;We have a wide range of career opportunities &amp; training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Theatres department in Wexham Park Hospital covers a wide range of specialties including Obstetrics, Paediatrics, Plastics hand surgery, Emergency, Trauma &amp; Orthopaedics, and advanced laparoscopic surgery both in general and gynecological surgery. The Recovery team provides and maintains safe level of patient care throughout any after surgical and Anaesthetic procedure. The Recovery Practitioner will be responsible for assisting with planning, implementing and assessing care of patients and ensure that standards are met as per national and local guidelines.&lt;/p&gt;\n&lt;p&gt;So, whether you are an experienced practitioner or a final year student due to qualify we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;You will be supported with a comprehensive Trust induction when you join us and for our Newly Qualified Practitioners we offer a 12 month bespoke preceptorship program with 14 days protected study days designed to teach and develop our practitioners to the very highest standard.&lt;/p&gt;\n&lt;p&gt;We are committed to the on-going professional development of all our staff and offer support such as in-house training opportunities, university courses, and we promote multiskilling into scrub, for Practitioners who wish to do so. We have a dedicated practice development team along with supportive management to assist you in developing your career.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Arlaine Vinuya - Senior Sister&lt;/p&gt;\n&lt;p&gt;arlaine.vinuya@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0300 614 5000 ext. 159066&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham Park Hospital, Slough, Berkshire", "postalCode": "SL2 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5331", "longitude": "-.575106"}}, "title": "Staff Nurse PACU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246007", "validThrough": "2020-11-11T23:59:59+0000"}