{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-£110,683"}}, "datePosted": "2020-10-30T15:31:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Radiologist with an interest in Symptomatic Breast Radiology&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Lewisham and Greenwich NHS Trust (LGT) in partnership with King’s College Hospital NHS Foundation Trust (KCH), Denmark Hill&lt;br /&gt;&lt;br /&gt;Lewisham and Greenwich NHS Trust invites applicants to apply for a new and innovative post for a Consultant Radiologist with an interest in Breast Imaging. The post is based at LGT but includes 2 planned sessions at KCH Denmark Hill to help support and develop closer working between the Trusts and with the aim of encouraging the post holder to maintain and develop specialist interests while in post and offering the opportunity to be involved with research and development at King’s College Hospital NHS Foundation Trust. &lt;br /&gt;&lt;br /&gt;We are looking for a highly motivated and enthusiastic individual who is keen to develop and nurture services across both the Queen Elizabeth Hospital and University Hospital Lewisham sites, as well as maintain and develop our links within the SE London sector.&lt;/p&gt;\n&lt;p&gt;The post is full time, attracting 10 programmed activities and consideration will be given to a part time appointment for any applicant unable or not wishing to work full time.&lt;br /&gt;&lt;br /&gt;The post holder will be joining a team of 3 radiologists and a consultant mammographer working across the Lewisham and Queen Elizabeth sites taking a role in the symptomatic service provided on both. It would be beneficial to the Trust if the post holder were keen to maintain their skills in general radiology and take part in a 1 in 8 on call for general radiology but consideration will be given to applicants who no longer are able to provide general radiology cover due to further specialisation. The job plan will include a day at KCH Denmark Hill working one session in the symptomatic service and one session of SPA to be used for learning, research, development.&lt;br /&gt;&lt;br /&gt;LGT aims to be the hospital of choice for patients and an employer of choice for staff. In order to improve all aspects of patient experience, we rely upon having a highly skilled, motivated, diverse, productive and patient focused workforce. Our staff are key to the current and future development of our services and have in recent times demonstrated their deep commitment to the Trust and the community we serve. By joining us now, you can play a pivotal role in shaping a new organisation that continues to put patient care first and one that takes great pride in our place at the heart of the local community.&lt;/p&gt;\n&lt;p&gt;The Trust employs more than 6000 staff, providing healthcare throughout Lewisham and Greenwich, caring for a combined population of over 500,000. Lewisham is a teaching hospital of the Guy’s, King’s and St Thomas’ School of Medicine with a first class reputation for undergraduate and postgraduate training. The successful candidates will also contribute to the postgraduate and undergraduate teaching.&lt;/p&gt;\n&lt;p&gt;The two radiology departments are modern and spacious and both have a programme for replacement of equipment.&lt;/p&gt;\n&lt;p&gt;All applicants must have full GMC registration and hold a Licence to Practise. They must possess a recognised medical degree and will have been awarded a CCT in Diagnostic Radiology or be within six months of CCT by the date of the interview, and/or be on the GMC Specialist Register.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr ShahJob titleClinical Director RadiologyEmail addressfatima.shah1@nhs.netTelephone number020 3192 6571Additional contact information&lt;/p&gt;\n&lt;p&gt;To arrange to visit the departments and to discuss your application further, interested candidates should contact:&lt;/p&gt;\n&lt;p&gt;Mr Martin Baghurst, tel: 020 3192 6835 or 077480 24471, email m.baghurst@nhs.net&lt;/p&gt;\n&lt;p&gt;or Dr Fatima Shah, tel: 020 3192 6571, email fatima.shah1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lewisham &amp; Greenwich NHS Trust, London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Consultant Breast Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250756", "validThrough": "2020-11-24T23:59:59+0000"}