{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-06T09:16:08+0000", "description": "&lt;p&gt;Humber Teaching NHS Foundation Trust have been selected to be 1 of only 11 National pilot sites across the country to test new ways of delivering community mental health care. This is an exciting time for the Trust and gives opportunity for the right candidates to help shape and deliver new ways of working within community mental health across Hull and East Riding of Yorkshire.&lt;/p&gt;\n&lt;p&gt;As part of this exciting development we have a number of clinical and non-clinical posts available to support the development of Primary Care Mental Health Networks and to deliver innovative ways of supporting people to improve their mental health and wellbeing and support recovery.&lt;/p&gt;\n&lt;p&gt;These roles include Band 6 and 7 Senior Mental Health Nurses, Social Workers, Psychologists, Psychology Assistants, Pharmacist and Pharmacy technicians, Peer Support Workers and Mental Health and Wellbeing Coaches.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and experienced band 6 mental health nurses to join our team and help shape and improve the delivery of contemporary community mental health support and treatment.&lt;/p&gt;\n&lt;p&gt;The post-holders will be accountable for the delivery of high quality services to clients across the Mental Health Division.&lt;/p&gt;\n&lt;p&gt;If you think you have the right skills and experience and you want to be part of developing and delivering future models of care within the HSJ Mental Health Provider of the Year (2019) then please contact Steph Fletcher Service manager (07887550842) for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated Good by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Steph Fletcher, telephone 01405 608220, email steph.fletcher@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various locations in Hull and East Riding, Hull", "postalCode": "HU10 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7726", "longitude": "-.448921"}}, "title": "Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258992", "validThrough": "2020-11-19T23:59:59+0000"}