{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "131300", "minValue": "100000", "unitText": "YEAR", "value": "£100,000 - £131,300 per annum"}}, "datePosted": "2020-10-28T10:31:39+0000", "description": "&lt;p&gt;NHSX is leading the largest digital health and social care transformation programme in the world. With investment of more than £1 billion pounds a year nationally and a significant additional spend locally, NHSX has been created to give staff and citizens the technology they need. NHSX brings together the Department of Health and Social Care, NHS England and NHS Improvement who will deliver the Health Secretary’s Tech Vision, building on the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;We will speed up the digital transformation of the NHS and social care. We have set ourselves five missions, which are focused on how we can make things better for patients and staff.&lt;br /&gt;&lt;br /&gt;These are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Reducing the burden on clinicians and staff, so they can focus on patients&lt;/li&gt;\n&lt;li&gt;Giving people the tools to access information and services directly&lt;/li&gt;\n&lt;li&gt;Ensuring clinical information can be safely accessed, wherever it is needed&lt;/li&gt;\n&lt;li&gt;Improving patient safety across the NHS&lt;/li&gt;\n&lt;li&gt;Improving NHS productivity with digital technology&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;More information can be found on our website.&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen within the Digital Transformation Directorate for the role of Director of Digital Service Transformation: Digital Urgent and Emergency Care, ESM1.&lt;/p&gt;\n&lt;p&gt;This role is being advertised as permanent on a full-time basis. This fantastic opportunity provides a great developmental opportunity for the right person.&lt;/p&gt;\n&lt;p&gt;The post holder is required to have a broad range of digital and delivery experience to lead and assure best practice for complex digital transformation programmes. The post holders skills will be deployed within the Digital Transformation Directorate, to lead Digital Urgent and Emergency Care, along with a number of other priority digital transformation areas. You will also be expected to provide support and guidance to help deliver the missions of NHSX, and the long-term plan commitments to help digitise the NHS.&lt;/p&gt;\n&lt;p&gt;The individual will influence both service design, organisational strategy, priorities and collaborate with counterpart colleagues across Health and Care and across government. They will focus on ensuring the right conditions and environment for delivery teams to work effectively and ensure the Digital Transformation Directorate and Digital Urgent and Emergency Care programme is using digital and technology best practice to deliver against its objectives.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nadine Brown, Business Manager; nadine.brown@nhsx.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House / Quarry House, London / Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Director of Service Transformation: Digital Urgent and Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246080", "validThrough": "2020-11-11T23:59:59+0000"}