{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-23T09:15:50+0100", "description": "&lt;p&gt;The Medical Secretary provides a link between the hospital, the patient and their GP and is a central point of contact for patients and other health care professionals. They will provide a comprehensive, efficient and responsive administration service to the medical and nursing staff and their teams.&lt;/p&gt;\n&lt;p&gt;Often the first point of contact, the post holder will have an understanding of the specialty, and an appreciation on the concerns and queries that patients and carers alike will have.&lt;/p&gt;\n&lt;p&gt;Accuracy, excellent communication and organisational skills are essential within this post. The post holder will coordinate the patients care throughout their pathway process from referral to discharge following strict rules and standards in accordance with the Trust Patient Access Policy, with support from the Team Leader as required. The postholder may be expected to work on a rota basis ensuring the service is appropriately covered at all times and have a flexible approach to working hours to meet the demand of the service. The post may also involve cross-site working or working at non-Trust premises (e.g. clinics held off site).&lt;/p&gt;\n&lt;p&gt;This post requires a self-motivated professional candidate with the confidence and ability to work on their own initiative or as part of a team within a busy and demanding environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally Stafford/Rebekkah Lloyd-Williams, Team Leaders&lt;/p&gt;\n&lt;p&gt;Email addressSally.Stafford@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 03033 302535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Medical Secretary - Scunthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239780", "validThrough": "2020-11-08T23:59:59+0000"}