{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc pro rata"}}, "datePosted": "2020-11-02T15:46:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Rotational Community Midwife&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and dynamic midwife with excellent standard of care to join our community teams in the Queen Charlotte’s &amp; Chelsea and St. Mary’s Hospital’s and Ealing catchment areas. Each area has a designated team, with each member assuming certain roles and areas of expertise.&lt;/p&gt;\n&lt;p&gt;This role will involve providing continuity of care to women during the antenatal and postnatal periods. Midwives on this team will be involved in running antenatal/postnatal clinics from local children’s centres, as well as conducting home visits. Additionally you will be providing parent education classes, and breastfeeding support sessions.&lt;/p&gt;\n&lt;p&gt;To meet the needs of our diverse population of women you will also cover on-calls for homebirths (4-5times per month), cover for maternity escalation, and work in partnership with our safeguarding team. You will be supported to develop your skills and knowledge by offering course such as Newborn examination, NLS course, Leadership in house courses e.tc. In order to maintain intrapartum skills, there will be opportunity to do supernumery shits in the unit. . You will be supported and encouraged during a personalised orientation period, and be confident to work within the team and alone.&lt;/p&gt;\n&lt;p&gt;With recent CQC outstanding rating, we pride ourselves on our reputation for providing an exceptional standard of care to women and their families. We actively encourage career progression and access to educational programme to encourage our Midwives to achieve their full potential. You will be supported and encouraged during a personalised orientation period, and be confident to work within a team and alone.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic, forward-thinking Midwife with excellent communication skills (both written and verbal) and have a passion for providing exceptional women centred midwifery care we would like to hear from you. We are looking for midwives who are ideally car drivers, due to the size of the catchment areas.&lt;/p&gt;\n&lt;p&gt;Please note attached Person Specification and Job Description stipulate a rotational position, which is an opportunity offered within this role.&lt;/p&gt;\n&lt;p&gt;We offer: Part Time (22.5hrs/week)/ Full Time.&lt;/p&gt;\n&lt;p&gt;You must have the flexibility to travel and undertake on call duties. Car driver essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name&lt;/strong&gt; Shree Koirala &lt;strong&gt;Job title&lt;/strong&gt; Community Matron Imperial College Hospital &lt;strong&gt;Email address&lt;/strong&gt; Shreejana.koirala@nhs.net &lt;strong&gt;Telephone number&lt;/strong&gt; 07717431042&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust Wide, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 6 Rotational Community Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252704", "validThrough": "2020-11-15T23:59:59+0000"}