{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T14:46:09+0000", "description": "&lt;p&gt;BLACK COUNTRY HEALTHCARE NHS FOUNDATION TRUST&lt;/p&gt;\n&lt;p&gt;Clinical / Counselling Psychologist&lt;br /&gt;Dudley Physical Health Psychology, Stroke, ABI and Long Term Neurological Conditions&lt;/p&gt;\n&lt;p&gt;BAND 8a&lt;/p&gt;\n&lt;p&gt;0.5 wte (18.75 hours)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Physical Health Psychology Service is a team of psychologists, therapists and counsellors who aim to assist people in adapting to and developing creative solutions for living with physical health problems. The Black Country Healthcare Physical Health Psychology Service currently operates across 3 geographical areas (Dudley, Wolverhampton and Sandwell and West Birmingham) with a number of contracts in each area. This post will be based at Cross Street Health Centre in Dudley, in the Stroke, ABI and Long Term Neurological Conditions service.&lt;/p&gt;\n&lt;p&gt;This service has recently been redesigned, with an increase in staffing, to work closely with the multi-disciplinary teams working across stroke, long term neurological conditions and acquired brain injury. You will be working alongside a Principal Clinical Psychologist, and an additional Clinical/ Counselling Psychologist and an Assistant Psychologist with support from a Consultant Clinical Psychologist. A robust leadership and supervision structure is in place, alongside operational management.&lt;/p&gt;\n&lt;p&gt;The valuable role of psychologists working with this client group is recognised by our commissioners and the multi-disciplinary teams. We are seeking a highly motivated and dynamic individual with a keenness and ability to integrate your current skills and apply them in this context. Experience of working in a physical health setting is desirable, but we are also keen to hear from applicants who have been working in other specialities, who feel they have transferable skills. The most important qualities are good communication skills, working co-operatively and thinking creatively.&lt;/p&gt;\n&lt;p&gt;In return for your enthusiasm, hard work and commitment you will benefit from being part of an expanding and exciting service with good support structures and lots of variety within the role.&lt;/p&gt;\n&lt;p&gt;The post will be based at Cross Street Health Centre with other psychologists working in physical health but with the expectation that you will work closely with the MDTs that are based locally.&lt;/p&gt;\n&lt;p&gt;The post holder will be professionally allied with the Physical Health Psychology Service, with all the associated benefits of professional development, supervision and peer support. Current staff hold a range of therapeutic interests including Cognitive Behavioural, ACT, Narrative and Psychodynamic approaches. Clinical and leadership supervision, and continuing professional development, are highly valued, with the wider Physical Health Psychology community coming together every six months for Summer and Winter CPD workshops. Additionally, there are opportunities to join peer supervision groups. We are able to offer great opportunities for career progression, with many members of the service seeking and successfully securing promotions.&lt;/p&gt;\n&lt;p&gt;This is what our staff have said about working in the service:&lt;/p&gt;\n&lt;p&gt;‘The psychology team provided a number of opportunities for broadening experiences, and the roles are varied in nature. For example, there are opportunities to provide supervision, training, reflective practice, team development and individual client work.’&lt;/p&gt;\n&lt;p&gt;‘Thank you for helping me grow – I wouldn’t be the psychologist I am today...”&lt;/p&gt;\n&lt;p&gt;‘My experiences enabled me to develop skills in consultation, which in turn helped me to support the development of psychological thinking in the team in which I was working.... in the development of psychological thinking across team meetings, trust wide discussions and broader forums where clinical decision making was involved.’&lt;/p&gt;\n&lt;p&gt;The post holder will have opportunities for personal support and development via the Trust appraisal system. You will have support from a Principal Clinical Psychologist and the Consultant Clinical Psychologist. Job share and flexible working would be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr samantha oakleyAdditional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact either Dr Samantha Oakley, Consultant Clinical Psychologist 01384 366249 or Debbie Gardner 01384 366249. We would be happy to discuss the post and provide the opportunity to meet with staff from the MDT prior to interview. Please also see our other vacancies as we are open to combining roles to create a post to suit individual need.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross street, dudley", "postalCode": "DY1 1RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5102", "longitude": "-2.08905"}}, "title": "Senior clinical or counselling psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260181", "validThrough": "2020-11-19T23:59:59+0000"}