{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "50000", "unitText": "YEAR", "value": "£50,000 - £60,000 per annum"}}, "datePosted": "2020-10-28T19:58:35+0000", "description": "&lt;p&gt;Nottingham and Nottinghamshire ICS have combined forces of the NHS, local councils and the voluntary sector to coordinate health and care services for the whole needs of our local population. Our vision is ambitious: we want people living in Nottingham and Nottinghamshire to live longer, healthier and happier lives.&lt;/p&gt;\n&lt;p&gt;We have three levels of partnerships, each with different responsibilities and tasks according to the size of community it serves. At neighbourhood level, we have 20 Primary Care Networks (PCNs) serving communities of 30,000 to 50,000 people; at place level, we have three Integrated Care Partnerships (ICPs) – Mid-Nottinghamshire, Nottingham City and South Nottinghamshire serving populations of 250,000 to 500,000 people. The system level is the Strategic Commissioner (CCG) and Integrated Care System (ICS) Board. They look after the entire system across Nottingham and Nottinghamshire, setting the goals for the ICPs and PCNs and the strategy for success.&lt;/p&gt;\n&lt;p&gt;We are now looking for a new Independent Chair to take us on the next stage of our evolution, enabling and galvanising the work of system leaders to maximise the benefits of collaborative working and effective governance whilst also ensuring the Board provides assurance to the wide range of stakeholders including provider trusts, commissioners, NHS regulators, local authorities and the population we serve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Person Specification&lt;/p&gt;\n&lt;p&gt;You will be leading in an environment where traditional boundaries and authorities are shifting to a wider collective approach and therefore strong influencing skills are crucial in order to ensure that the constituent organisations are working collegiately and are aligned to the strategy and ambition of the ICS, recognising that constituent organisations each have their own statutory responsibilities.&lt;/p&gt;\n&lt;p&gt;To be successful in the role you will need to be adaptive and comfortable within a dynamic environment. You will be person-centred, inclusive, collaborative, altruistic and consensus seeking. Your long-term view will be focused on transformation of our whole system, and primarily on our accountability to local people and communities.&lt;/p&gt;\n&lt;p&gt;These traits will be underpinned by deep knowledge of Health and social care or the broader public sector, and specifically of complex public service systems and highly effective system-wide partnership arrangements.&lt;/p&gt;\n&lt;p&gt;The Independent Chair must have the vision and passion to continue our journey towards greater integration across the system. You will develop and stimulate a constructive and frank relationship with members of the ICS Board and promote a culture of openness and transparency with all organisations ‘acting as one’. Specifically, you will ensure the ICS Board develops and oversees strategies which will result in tangible improvements to the health of the population.&lt;/p&gt;\n&lt;p&gt;Some of the key determinants of success will be the ability to foster partnerships, build a strong Board, facilitate constructive challenge and debate, and effectively hold the Board to account.&lt;/p&gt;\n&lt;p&gt;The successful appointee will have substantial board level experience and personal credibility in their chosen profession. A proven track record of chairing within a complex organisation and working in a regulated environment requiring collaborative working with system partners is essential.&lt;/p&gt;\n&lt;p&gt;The ICS Board is comprised of the senior leaders of all the health and care organisations in Nottingham and Nottinghamshire. The Board has oversight of the whole system, sets the strategic direction and defines the outcomes the system should deliver.&lt;/p&gt;\n&lt;p&gt;Additional Information&lt;/p&gt;\n&lt;p&gt;If you have any questions or would like a confidential discussion with our recruitment partners at Badenoch + Clark, please contact James McLeod on 07523 044455 or at james.mcleod@badenochandclark.com or David Hunter on 07889 202229 or at david.hunter@badenochandclark.com.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Nottingham and Nottinghamshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128368"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham, NG2 7QP", "postalCode": "NG2 7QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9365", "longitude": "-1.13572"}}, "title": "ICS Independent Chair", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247558", "validThrough": "2020-11-15T23:59:59+0000"}