{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Pro Rata Per Annum"}}, "datePosted": "2020-10-30T13:31:26+0000", "description": "&lt;p&gt;&lt;strong&gt;ROYAL VICTORIA INFIRMARY / FREEMAN HOSPITAL/ NEW CROFT CLINIC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DIRECTORATE : Out of Hospital/Community Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT in Genitourinary Medicine and HIV&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;REF. 317-LCON-20-262&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to offer an opportunity for a highly motivated, ambitious individual to join our integrated sexual health service dedicated to providing high quality sexual health care in Newcastle upon Tyne. New Croft clinic is the largest level 3 sexual health service in the region. Prior to coronavirus there were more than 32,000 consultations delivered annually, with over a third of patients being seen for both contraception and genitourinary medicine needs at the same visit. Consultant led complex genitourinary services offer near patient microscopy, skin biopsy, hyfrecation and management of genital dermatoses. In addition, sexual health screening and management of sexual infections; partner notification; and all methods of contraception including emergency intrauterine devices are offered through a combination of telephone and face-to-face consultations. Our service continues to be a key provider of HIV Pre-Exposure prophylaxis, and we offer online remote self-sampling for asymptomatic STI screening. GUM physicians deliver HIV out-patient care from within the sexual health service for nearly 400 patients, working as part of the wider HIV multidisciplinary team including colleagues from Infections Diseases, HIV psychology, pharmacy and social work.&lt;/p&gt;\n&lt;p&gt;Applicants should have experience of delivering integrated health in a community based setting, with skills in complex genitourinary medicine, HIV out-patient care, and HIV PrEP. Competence in the insertion and removal of subdermal contraceptive implants and intrauterine devices would be advantageous. Undergraduate and post-graduate teaching forms an integral part of the post and the successful candidate will be committed to teaching in the clinic environment and will lead on educational governance, coordinating both rotations and formal teaching sessions for medical trainees, specialty doctors, nurses, health advisers and admin staff. This post is offered on a part time basis of 6 sessions per week.&lt;/p&gt;\n&lt;p&gt;The Newcastle upon Tyne Hospitals NHS Foundation Trust is one of the most successful teaching NHS Trusts in the country. We have one of the highest number of specialist services of hospitals in the UK. With around 14,000 staff, the Newcastle Hospitals is one of the region’s major employers. We have a long-standing reputation for high quality clinical care with our staff’s commitment to excellence reflected in our consistent performance at the highest level. We are committed to being an “employer of choice” offering our staff superb benefits, looking after their wellbeing, and providing access to high-quality education, training, career progression and support which enables them to provide “healthcare at its best – with people at our heart”.&lt;/p&gt;\n&lt;p&gt;We are committed to promoting equality and diversity and recognise the benefit in providing an inclusive environment. In addition to the challenges of the role, we can offer you a commitment to teaching, education, research and audit. We value and respect the diversity of our employees and aim to recruit a workforce which reflects the communities we serve, and is equipped to deliver the best service to our patients. We welcome all applications irrespective of people’s race, disability, gender, sexual orientation, religion or belief, age, gender identity, marriage and civil partnership, pregnancy and maternity and in particular those from under-represented groups.&lt;/p&gt;\n&lt;p&gt;For an informal discussion and further information regarding the opportunity and Directorate, please contact: Dr Kathryn Clement or Dr Sarah Duncan on 0191 229 2888/2862, or via email at Kathryn.Clement@nhs.net.&lt;/p&gt;\n&lt;p&gt;To apply for this post, please visit NHS Jobs and complete the application form in full, please ensure that you provide references to cover the last 3 years. Candidates for the post must be registered medical practitioners and on, or eligible to join, the Genitourinary Medicine Specialist Register within six months of the date of the Appointments Committee. For any further queries, please contact &lt;strong&gt;Colin Sakhe, HR Advisor at&lt;/strong&gt; &lt;strong&gt;Colin.Sakhe@nhs.net&lt;/strong&gt;&lt;strong&gt;, &lt;/strong&gt;quoting the post reference number.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NO AGENCIES PLEASE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the rehabilitation of the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Services (formerly known as the Criminal Records Bureau) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;Please note it is a requirement of The Newcastle upon Tyne Hospitals NHS Foundation Trust that all successful candidates who require a DBS for the post they have been offered pay for their DBS certificate. The method of payment is a salary deduction from your first month’s pay.&lt;/p&gt;\n&lt;p&gt;Candidates who are shortlisted for interview will be contacted by e-mail, and may be required to complete psychometric tools in advance of the assessment process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 13 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 02 December 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 New Croft House", "postalCode": "NE1 6ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.974", "longitude": "-1.60751"}}, "title": "Consultant in Genitourinary &amp; HIV Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250374", "validThrough": "2020-11-15T23:59:59+0000"}