{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum"}}, "datePosted": "2020-10-30T14:46:25+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We take pride in providing specialist care to our service users where our Trust values; being consistent, compassionate, collaborative, respectful and open is at the heart of everything we do. When you join us, you’ll be part of something special – an innovative and rapidly growing organisation that is helping to redefine the Mental Health, education and social You should have demonstrable skills of working with people who experience serious mental health problems, experience of working in a multidisciplinary team and experience of assessing and managing crisis for people with a severe mental illness.&lt;/p&gt;\n&lt;p&gt;The Mitcham Recovery &amp; Support Team provides a specialist Borough based mental health support and recovery service for adults (18-75) with more complex and longer term needs which, because of their seriousness or complexity, cannot be effectively treated within primary care. Clinical/professional judgement will determine priority for treatment and support, but in line with policy implementation guidance. They work in close partnership with GPs and other key partners, including the London Borough of Merton and voluntary organisations. Services are provided through a recovery and evidence based approach within the framework of the CPA.&lt;/p&gt;\n&lt;p&gt;About the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To act as a care coordinator in assessing clients’ needs and strengths through a collaborative approach, ensuring that all clients have care plans and risk management plans and that these are implemented and regularly reviewed/updated.&lt;/li&gt;\n&lt;li&gt;A car driver/owner is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key area of responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To maintain high standard of individualised client care, recognising factors and events that are likely to affect the mental, emotional and physical well-being of clients/carers and provide advice and support when required.&lt;/li&gt;\n&lt;li&gt;To develop and maintain a high standard of practice, based on assessment, through the use of a range of psychosocial approaches, within a health and psycho-social framework.&lt;/li&gt;\n&lt;li&gt;To communicate/liaise effectively within relevant agencies to ensure that an integrated programmed of care is provided throughout.&lt;/li&gt;\n&lt;li&gt;To implement and/or participate in crisis intervention measures with the client/family or in conjunction with other agencies.&lt;/li&gt;\n&lt;li&gt;To supervise and monitor the therapeutic effects and side-effects of prescribed medication providing the client with clear advice and information in accordance with Trust Policy and the NMC Standards for administration of drugs.&lt;/li&gt;\n&lt;li&gt;To organise and participate in the admission, discharge and transfer of clients in accordance with the Trust Policies.&lt;/li&gt;\n&lt;li&gt;To provide clients and carer’s with verbal and written up to date information on the services offered by the Trust, how to express their views, complaints procedure and what they can expect from the service.&lt;/li&gt;\n&lt;li&gt;To attend weekly clinical meetings to provide the team with relevant information in relation to caseload, referrals and to feedback on new assessment.&lt;/li&gt;\n&lt;li&gt;To develop and maintain effective working relationships with in-patient facilities regarding admission and discharge of clients.&lt;/li&gt;\n&lt;li&gt;To facilitate carers’ assessments, provide the appropriate care plan to meet identified needs and to monitor efficacy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mitcham is a district in South London, in the London Borough of Merton. The area is located on the border of Inner London and Outer London. It is both residentially and financially developed, well served by Transport for London there is also trams service from Mitcham Junction.&lt;/p&gt;\n&lt;p&gt;The team is based at The Wilson Cottage Hospital was officially opened in 1928 by Princess Mary Vicountess Lascelles. Built on a 4.5 acre site, it had been gifted to the community by a successful local businessman, Sir Isaac Wilson, after whom it was named.&lt;/p&gt;\n&lt;p&gt;There is free parking located at the Wilson Hospital. The Hospital is closed to shop, cafes and restaurant.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christine King, Team Manager&lt;/p&gt;\n&lt;p&gt;Email address christine.king@swlstg.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3458 5580&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wilson Hospital, Mitcham", "postalCode": "CR4 4LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3985", "longitude": "-.164079"}}, "title": "Community Psychiatric Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250629", "validThrough": "2020-11-06T23:59:59+0000"}