{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum / pro rata"}}, "datePosted": "2020-10-28T15:01:15+0000", "description": "&lt;p&gt;&lt;span&gt;Oxfordshire CAMHS crisis team is evolving and we developing our already established mental health crisis response provision following new investment. We are want to transform our current service, to become consistent with the nationally defined Crisis Resolution Home Treatment Team clinical model. Phase 1 of is this is the recruitment of more passionate and motivated clinicians to provide intensive home treatment to people living in Oxfordshire .&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team will be further developed and expanded over several phases during the next 3 years.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to join the service at and be fully involved in developing and creating the highest quality service provision for service users and their families / supporters. OT and / Or Mental health Nurses will be instrumental in establishing the service and then delivering intensive home treatments to service users in their own place of residence under the guidance and support of qualified Crisis Clinicians and Team Leader. appropriately qualified practitioners will deliver recovery focused intervention (emotional and practical support) to a caseload of service users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Accessibility, responsiveness and excellence in customer service with the highest regard for service experience will be at the heart of the service and Applicants will use their skills and personal qualities to make this a reality. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must have substantial experience and a proven track record working in health or social care and be able to demonstrate Trust values in delivering care to others. The successful candidate will be able to follow and initiate plans of care flexibly and dynamically in challenging and changing circumstances.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return we will offer opportunities for professional development and opportunities to influence and contribute to service development. You will be provided with regular supervision, appraisal and support. The service will operate 24/7 and a variety of working patterns will be available – we welcome flexible working requests. This post does involve working On call night shifts and require weekend working at a set frequency, for which applicants are generously remunerated.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLindsay FisherJob titleTeam ManagerEmail addresslindsey.fisher@oxfordhealth.nhs.ukTelephone number07919553527Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Littlemore Mental Health Centre, Oxford", "postalCode": "OX4 4XN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7175", "longitude": "-1.22952"}}, "title": "CAMHS Crisis &amp; Home Treatment Clinician (OT or RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247084", "validThrough": "2020-11-11T23:59:59+0000"}