{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/ pro-rata"}}, "datePosted": "2020-11-04T16:01:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Medicine Rehabilitation and Cardiac Division at Oxford University Hospital’s NHS Foundation Trust for an exceptional, committed and motivated individual for the role of &lt;strong&gt;Digital Developer and Information Officer&lt;/strong&gt;. The successful individual will join the Divisional Information Digital Lead team to support the development and implementation of the key Power form development, informatics support and project delivery support across a breadth of different services.&lt;/p&gt;\n&lt;p&gt;The successful individual must have a strong commitment and understanding of digital development work, patient safety and have excellent organisational, analytical and teaching skills. Liaison with the Senior Informatics and Digital Team is key and as such the successful applicant must be a team player and have excellent communication skills.&lt;/p&gt;\n&lt;p&gt;The successful Individual will be helping OUHFT visualise and support the digital and information strand of the Medicine Rehabilitation and Cardiac Division and will ensure clinical practice is supported by digital technology and that meets professional standards. If you are passionate and interested in digital and information technology and how it relates to patient care and wish to influence the development of the services and are able to support staff in the Trust’s core values we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;If you are interested in applying for the post, we would welcome your application. If you wish to discuss the post or find out further information, please see contact details below.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Proposed Interview Date: 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nigel Parkin - Acting Service Information and Digital Lead to MRC.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;nigel.parkin@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Digital Developer and Information Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256553", "validThrough": "2020-11-18T23:59:59+0000"}