{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum  pro rata inc."}}, "datePosted": "2020-10-28T14:16:24+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;The landscape of healthcare in London is changing significantly as a result of the COVID-19 pandemic. The most recent guidance issued outlines the designation of Trusts as either Green, Blue or Yellow sites. Green sites are those which will be as COVID negative as possible, while Blue and Yellow sites will continue to treat COVID patients. We intend to become a Green site. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The RNOH has been at the forefront of medical progress and innovation since it was founded and we continue to build on these traditions and have a reputation for clinical, teaching and research excellence. We are very proud of the services we provide and the high standard of care we deliver.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an enthusiastic, motivated and dedicated band 5 Paediatric Nurse to join our fantastic team, where we provide a friendly and supportive environment for staff students and patients. You will become part of a dynamic development and help shape the service, and enjoy substantial professional development opportunities to achieve excellence in care for which we offer opportunities to complete a variety of courses. You might be a newly qualified nurse or a more experienced nurse working in another setting. Either way, you will be keen to work in an environment where you have a chance to build solid relationships with patients over a longer period of time and where the quality of care that you and your colleagues provide is your number one consideration. We are very proud of the services we provide and the high standard of care we deliver. Our nurses are sought from across the NHS by employers who recognise the exceptional standards of care delivered to our patients. We see it as our mission to train the next generation of nursing experts. If you would like to be one of them, then we’d like to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jo Ansell&lt;/strong&gt; or &lt;strong&gt;Kayleigh Hoey&lt;/strong&gt;- &lt;strong&gt;Ward Managers&lt;/strong&gt; &lt;strong&gt;for Coxen Ward&lt;/strong&gt;&lt;strong&gt; on&lt;/strong&gt; &lt;strong&gt;020 39470064/5. We are committed to your professional and personal development and we would love to hear from you, we offer a wide range of flexible working arrangements to suit your requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Paediatric Staff Nurse - Children and Teenage Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246949", "validThrough": "2020-11-11T23:59:59+0000"}