{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Dependent on Experience"}}, "datePosted": "2020-11-03T10:17:18+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Your role will be operational DSD leadership and management responsibilities following the disaggregation of NCA group wide roles.&lt;/p&gt;\n&lt;p&gt;The Decontamination Services Manager is responsible for the operational management of the central DSD and the provision of a flexible and responsive service which meets the needs of the customer.&lt;/p&gt;\n&lt;p&gt;You will ensure continuous quality improvement and the management of change necessary to meet organizational objectives and the changing healthcare environment.&lt;/p&gt;\n&lt;p&gt;You will provide for Trust wide decontamination advice to managers on the compliance of their equipment, procedures and decontamination processes to ensure compliance with current standards.&lt;/p&gt;\n&lt;p&gt;You will lead the strategic development of Decontamination Services for the Trust, in line with national guidelines, advising accountable managers on the implementation of all statutory and regulatory requirements and maintaining compliance with relevant CQC standards.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the delivery of Decontamination Controls Assurance. This will involve liaison with staff in those departments outside DSD, which still engage in decontamination practices.&lt;/p&gt;\n&lt;p&gt;You will act as an advisor in respect of decontamination for the Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTBC&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Decontamination Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253422", "validThrough": "2020-11-18T23:59:59+0000"}