{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-37,890 pa"}}, "datePosted": "2020-10-26T11:06:41+0000", "description": "&lt;p&gt;We would like to invite you to join our team of experienced, highly skilled midwives at Birmingham Women’s Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Do you have a minimum of 3 years experience as a band 6 midwife? If so, then this is a fantastic opportunity to develop skills within Enhanced Midwifery Care. We are looking for experienced, motivated and enthusiastic midwives to join our growing High Risk Midwifery and Outreach Team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Birmingham Women’s and Children’s NHS Foundation Trust is a centre of excellence in healthcare for women and their families within the West Midlands and beyond. We are a referral centre for diverse, high risk pregnancies and, as such, require highly trained and specialist staff. We provide excellent standards of care for all women, including those supporting high risk pregnancies. We strive to provide holistic care for all our women and pride ourselves on expertise and knowledge within high risk pregnancy and the provision of evidence based, women centred Enhanced Midwifery Care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;A rare and exciting opportunity has arisen to join our rapidly growing Enhanced Midwifery Care and Outreach Team. You will be working within our own high dependency unit as well as in collaboration with QEHB Critical Care Units. The dynamic nature of today’s health service dictates close collaboration and a multidisciplinary approach whilst caring for women with diverse co-morbidities, whether that be within our own unit or by our colleagues at neighbouring Queen Elizabeth Hospital. A multi-faceted approach is vital, yet constant, reassuring midwifery presence is paramount.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for highly skilled, motivated and passionate individuals to join our team. Excellent understanding of all aspects of midwifery care is vital with a specific interest in Enhanced Midwifery Care. Provision of seamless maternal care and wellbeing for all women, regardless of the level of medical risk, is at the forefront of our practice.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post is a rare, exciting and challenging opportunity to learn and develop extensive skills within the ever growing realms of midwifery practice. Our Trust has excellent standards of care and we are constantly striving to improve and grow alongside service need. You will be joining a highly motivated and driven team. It is essential that you are passionate about midwifery care. That you are resilient, hardworking and enthusiastic. Excellent learning opportunities will be available. You will be required to work independently but also as a reliable member of the high risk, multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you feel you have the desire to develop midwifery care, if you have the passion and dedication to strive to deliver optimum Enhanced Midwifery Care to women, and if you are keen to develop your own practice to new heights then come and join our vibrant, dynamic and friendly team. We look forward to welcoming you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4532", "longitude": "-1.94224"}}, "title": "HDU- Band 6 Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242152", "validThrough": "2020-11-09T23:59:59+0000"}