{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-22T12:30:28+0100", "description": "&lt;p&gt;Spectrum Community Health CIC is a community owned, award winning health provider. Our recent success at achieving four new contracts demonstrates our policy of innovation and continuous improvement, and is testimony to our committed and talented teams. As a Social Enterprise our profits are reinvested into our staff and services, and we benefit from being independent, large enough to provide a level of security, yet small enough to be able to make things happen.&lt;/p&gt;\n&lt;p&gt;Our multi-disciplinary teams provide healthcare services to some of the most vulnerable people in our society, from diverse backgrounds, who present a full range of general, mental health and recovery concerns.&lt;/p&gt;\n&lt;p&gt;The post holder will, under the guidance of the Specialist Prison Pharmacist at the prison they are working in, assist in the provision of a safe, efficient and cost effective pharmaceutical service to prisoner (hereafter known as service users) within the prison they are working in. This role will also involve providing medicines optimisation, medicines supply and administration, general health education advice and specialist technical services to the service users and healthcare staff.&lt;/p&gt;\n&lt;p&gt;You will also:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dispense, supply or administer medication including controlled drugs.&lt;/li&gt;\n&lt;li&gt;Support the delivery of medicines management services, primary care, health promotion and education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;On top of your basic salary, you will receive at least 27 days&#39; holiday each year rising to 33 days after 10 years’ service (excluding bank holidays). You will also automatically become a member of the NHS pension scheme and will receive an excellent package of pension benefits which are one of the most generous and comprehensive in the UK.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to undertake safeguarding training (Children and Adults) appropriate to their role and adhere to policies and procedures relevant to the area they work in.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancaster", "postalCode": "LA1 3QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0523", "longitude": "-2.77184"}}, "title": "Pharmacy Technician - HMP Lancaster Farms", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238426", "validThrough": "2020-11-16T23:59:59+0000"}