{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638  -  £44,780  per annum inc"}}, "datePosted": "2020-11-02T14:01:30+0000", "description": "&lt;p&gt;We are recruiting for experienced band 6 nurses with a post graduate qualification in critical care to join our world class Adult Critical Care Unit at the Royal London Hospital.&lt;/p&gt;\n&lt;p&gt;We are extremely proud to have been rated as ‘outstanding’ for caring by the Care Quality Commission in 2016 and this year Barts Hero Award Winners:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@Team ACCU were:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Winner of: ‘Fund raising Team’ of the Year raising donations by competing in the Tough Mudder Challenge and from fund raising with patients families.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Highly recommended for Engaging with their patients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the UK’s largest trauma centre we lead the trauma network for North East London and Essex. We are a leading specialist centre with an international reputation for caring for some of the most sick and seriously injured patients in London and beyond.&lt;/p&gt;\n&lt;p&gt;We care for a diverse range of specialties including trauma, neurosciences, acute general medical, surgical, obstetric and hyper-acute stroke, giving the opportunity for varied learning and clinical exposure.&lt;/p&gt;\n&lt;p&gt;Professional development is very important to us and we offer you the opportunity to undertake the neurosciences critical care course/ILS/ALS, we are supporting a number of staff on their degree/masters pathways and we are currently collaborating with City University to run an accredited Trauma Course in house.&lt;/p&gt;\n&lt;p&gt;As part of our Adult Critical Care commitment to enhance the working lives of our staff, we offer flexible working arrangements, childcare vouchers, family-friendly policies and staff benefits including an excellent pension scheme. We are committed to providing a culture of continuous learning, which actively supports the professional and personal development of our staff.&lt;/p&gt;\n&lt;p&gt;Would you like to join this dynamic Award Winning Team?&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Follow us on Twitter @teamaccu to find out more about us.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisted applicants will be offered interview arrangements shortly after applying within a time frame that works for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Hewitt, Matron, on helen.hewitt@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Adult Critical Care Sister/Charge Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252317", "validThrough": "2020-11-15T23:59:59+0000"}