{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Local Pay"}}, "datePosted": "2020-10-28T12:46:05+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the South Locality Care for the role of Associate Director for Access Clinical Business Unit (CBU).&lt;/p&gt;\n&lt;p&gt;The Associate Director will be required to work collectively and collaboratively to ensure the effective implementation of the Trust Service Model, ensuring the integrity and effectiveness of patient pathways at locality level and where appropriate across the organisation.&lt;/p&gt;\n&lt;p&gt;Within the devolved model the Collective Leadership Team will also be collectively responsible and accountable for the delivery of the services within the CBU including:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The provision of high quality responsive services within a framework that is safe, effective and efficient.&lt;/li&gt;\n&lt;li&gt;Ensure that all wards and teams within the agreed CBU delivers financial balance and makes a positive contribution to the organisation delivery plan and control total.&lt;/li&gt;\n&lt;li&gt;The performance management including the attainment of all performance management metrics that apply within the CBU.&lt;/li&gt;\n&lt;li&gt;Provide leadership, support and guidance to staff and work as a role model to ensure the values and principles of the organisation are promoted.&lt;/li&gt;\n&lt;li&gt;Ensure CBU has an appropriate strategy that takes into account pertinent features of the Group and Trust strategy, be they growth and expansion or consolidation.&lt;/li&gt;\n&lt;li&gt;To ensure that systems are in place that promotes the concept of collaborative working within and without services.&lt;/li&gt;\n&lt;li&gt;Where appropriate contribute as the Trust/locality leader in discussions involving external stakeholders.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Associate Director and the Collective Leadership team will provide a visible, accessible and authoritative presence in clinical areas upon which service users can rely to ensure that the fundamentals of care are right.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andy Airey - Group Director&lt;/p&gt;\n&lt;p&gt;Email: andy.airey@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 0191 245 6612&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hopewood Park Hospital, Sunderland", "postalCode": "SR2 0NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8615", "longitude": "-1.37568"}}, "title": "Associate Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246638", "validThrough": "2020-11-11T23:59:59+0000"}