{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-10-26T08:30:18+0000", "description": "&lt;p&gt;&lt;strong&gt; Secure Care, FCAMHS and Offender Health Directorate, BSMHFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(based at the Ardenleigh site, Erdington, Birmingham)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; 1 WTE Band 8a Specialist Systemic Family Therapists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Band 7s are welcome to apply) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 WTE 12 month temporary contract (maternity cover) in Forensic Child and Adolescent Mental Health Service (FCAMHS) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post provides an exciting opportunity to make a significant contribution to the delivery of psychological services in the expanding Secure Care and Offender Health (SCOH) Services directorate across BSMHFT. There are currently around 70 psychology staff within the directorate and this number is increasing. The successful post holders will be linked either to the inpatient Forensic Child and Adolescent Mental Health Services (FCAMHS) at the Ardenleigh site.&lt;/p&gt;\n&lt;p&gt;Ardenleigh FCAMHS medium secure inpatient unit is an 11 bedded mixed gender unit for young people up to the age of 19 years. The service provides assessment, treatment and care for young people who are experiencing complex mental health difficulties and pose a significant risk to themselves or others. This could include direct physical violence, sexually harmful behaviour, fire-setting or self-harm. There is also a CAMHS low secure inpatient 5 bedded female adolescent ward within the building. This service is for females under the age of 18 with complex mental health needs.&lt;/p&gt;\n&lt;p&gt;The Family therapist will work across the inpatient CAMHS services, both in medium and low security, leading and developing the family therapy input across both teams. The role will incorporate specialist assessment and intervention offered to service users and their families / carers. The post holder will also work jointly with other staff when required, as well as contributing to care planning and multi-disciplinary team discussions along with service development. They will also offer training and supervision to others as well as liaising with external agencies and partners.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, robust, resilient, creative and innovative Specialist Systemic Family Therapists interested in working with people who have complex presentations, encompassing risk, personality difficulties and mental health needs. The service has identified resources supporting continuing professional development, including excellent multi-model supervision structures. Previous experience of working in forensic settings is preferred but not essential. Support to understand and negotiate the forensic aspects of the work will be provided to any successful applicants who require this.&lt;/p&gt;\n&lt;p&gt;Given the regional nature of the services, some travel is likely to be necessary in order to conduct assessments, attend multi-professional meetings and engage with families.&lt;/p&gt;\n&lt;p&gt;For those Band 7s who may apply a development plan will be generated in order to help the candidate develop and work towards an 8a role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKate HarrisJob titleConsultant Clinical PsychologistEmail addresskate.harris9@nhs.netTelephone number0121 301 4535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ardenleigh, Birmingham", "postalCode": "B24 9SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5162", "longitude": "-1.83374"}}, "title": "Band 8a Specialist Systemic Family Therapist - Secure Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241759", "validThrough": "2020-11-22T23:59:59+0000"}