{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-20T11:02:58+0100", "description": "&lt;p&gt;&lt;em&gt;“I’m so glad that I joined HDFT,” says one of our Registered Nurses, “they delivered everything they promised…support, Preceptorship Programme, training etc. What more could I ask for?” &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;If you are looking for a team who supports you to be the best nurse you can be then look no further. We pride ourselves on ensuring our staff members get the training and development they need to progress their careers. We welcome applications from experienced nurses, those returning to practice and nurses who are starting their NHS career.&lt;/p&gt;\n&lt;p&gt;We have opportunities for you to join us at Harrogate and District NHS Foundation Trust in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Granby Ward – Medical assessment and Respiratory care (non-Covid)&lt;/li&gt;\n&lt;li&gt;Oakdale Ward – Stroke rehabilitation, Neurological, Haematology and Cardiology care (non-Covid)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for Registered Nurses who will be accountable for ensuring the highest standard of care and who will constantly promote patient safety, effective care and a positive patient experience. You need to have excellent communication skills and work well as part of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Apply today and we’ll contact you to arrange an interview&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Trust we offer our Registered Nurses:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to clinical skills training in our Clinical Skills Lab and personal development courses.&lt;/li&gt;\n&lt;li&gt;First Line Leadership programme to help develop your leadership skills.&lt;/li&gt;\n&lt;li&gt;Highly recommended two-year Preceptorship Programme and your first year of NMC fees paid.&lt;/li&gt;\n&lt;li&gt;4 weeks supernumerary and ongoing mentoring&lt;/li&gt;\n&lt;li&gt;Band 6 and 7 development posts&lt;/li&gt;\n&lt;li&gt;Support and guidance with revalidation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Harrogate and District NHS Foundation Trust we provide ‘outstanding’ care to both our patients and our staff. We support staff through benefits, health and wellbeing initiatives and opportunities for personal and professional development.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An inclusive and supportive culture – our Trust encourages staff to bring their whole selves to work and active Staff Networks identify areas for improvement.&lt;/li&gt;\n&lt;li&gt;Staff Recognition - as well as regular appraisals, we recognise staff with our Making a Difference and Team of the Month Awards plus the Christmas Oscars.&lt;/li&gt;\n&lt;li&gt;Employee Support and wellbeing - we have a comprehensive Employee Assistance Programme, counselling service and fast track physiotherapy service for employees.&lt;/li&gt;\n&lt;li&gt;Staff Benefits - We have a range of staff benefits and schemes to support staff health, engagement, wellbeing and inclusion.&lt;/li&gt;\n&lt;li&gt;Harrogate is consistently voted the happiest place to live in the UK, with a vibrant local music, arts and foodie scene. Beautiful natural spaces, sports facilities, great shopping and high performing schools make this a great location to settle down in.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To keep up to date with all of our latest Recruitment activity here at Harrogate and District NHS Foundation Trust, take a look at our Careers website - Team Harrogate, Facebook page: ‘Team HDFT jobs – Harrogate and District NHS Foundation Trust’ and follow us on Twitter: @HDFT_Careers.&lt;/p&gt;\n&lt;p&gt;For more information, please contact Tammy Gotts, Matron on 01423 555314 or email tammy.gotts@hdft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full and part time positions available&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;5 &lt;strong&gt;Salary: &lt;/strong&gt;£24,907 to £30,615 pa pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements:&lt;/strong&gt; Registered Nurse on the appropriate part of the NMC Register&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Registered Nurse - Medical Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234021", "validThrough": "2020-11-10T23:59:59+0000"}