{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33956", "minValue": "24794", "unitText": "YEAR", "value": "£14.75 - £20.20 Per Hour Depending On Experience"}}, "datePosted": "2020-11-02T11:35:44+0000", "description": "&lt;p&gt;We are looking for a Physiotherapist with a special interest in Neurology and who has previous experience of rehabilitation and tracheostomy care to join our dynamic team.&lt;/p&gt;\n&lt;p&gt;You will assist with completing rehabilitation and maintenance programmes for residents with varied neurological and progressive conditions, and you will also be an active member of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;You will also be involved in the supervision of support staff (Therapy Technician, Assistant) and Students. PJ Care are committed to supporting staff to complete continuing professional development and have excellent training opportunities.&lt;/p&gt;\n&lt;p&gt;As an award winning, independent provider of neurological care, PJ Care only look to recruit individuals who share in our mission to deliver the highest standards of care.&lt;/p&gt;\n&lt;p&gt;PJ Care is one of the Sunday Times Top 100 Companies To Work For in 2019, and is a leading provider of specialist neurological care and neuro rehabilitation for people with progressive or acquired neurological conditions.&lt;/p&gt;\n&lt;p&gt;We specialise in the multidisciplinary care of adults and work with residents, families, charities and the NHS to provide the highest quality care. Our residents are at the heart of everything we do and we strive to nurture dignity, independence and holistic wellbeing through the specialist care models, therapies and activities we provide.&lt;/p&gt;\n&lt;p&gt;Essential Qualification is HCPC registration.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "P J Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134817"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5925", "longitude": "-.287674"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251841", "validThrough": "2020-11-16T23:59:59+0000"}