{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a. excl. LZ"}}, "datePosted": "2020-11-02T13:01:21+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Thoracic Medicine &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Guy’s &amp; St Thomas’ NHS Foundation Trust or Trust Wide &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Consultant in Respiratory Medicine and Pleural disease &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;From £82,096 p.a excl. LZ &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Full Time – 10PAs Permanent &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Directorate of Pulmonary, Adult Critical Care &amp; Sleep (PACCS) Medicine is seeking a full-time (10 PA) Consultant to join a dynamic, enthusiastic and forward thinking team.&lt;/p&gt;\n&lt;p&gt;The established and highly successful multidisciplinary pleural disease team at GSTT provides diagnostic and therapeutic services to the local community, southeast London and beyond. The purpose of the service is to ensure that local patients with pleural disease are reviewed rapidly, experience high value collaborative and coordinated care wherever they need it.&lt;/p&gt;\n&lt;p&gt;The Respiratory Medicine team serves the local population of Lambeth and Southwark, which have high deprivation and smoking rates, and high premature mortality due to respiratory disease. The local population consists of around 600,000 people, served by two clinical commissioning groups (Lambeth and Southwark CCGs), and two large teaching hospitals within an Academic Health Sciences Centre (King’s Health Partners). In addition, Respiratory Medicine provides tertiary services for patients across Southeast London, Kent, Surrey &amp; Sussex that include linear &amp; radial EBUS, interventional bronchoscopy and pleural services.&lt;/p&gt;\n&lt;p&gt;The team currently includes 2 Consultant Physicians, Consultant Thoracic Surgeon, Pleural Fellow, Specialists Nurse and Research Nurse. Clinics are currently held at the St Thomas’ Hospital (once/week). There is a daily pleural list and weekly MDM. This is currently the only comprehensive medical pleural disease service in London.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing consultant review for both inpatients and outpatients. The post also includes a commitment to acute medicine and the GIM/Respiratory rota (inpatient care of patients on William Gull ward – respiratory ward). The post holder will be expected to work closely with oncology service at GSTT.&lt;/p&gt;\n&lt;p&gt;Guy’s and St. Thomas’ NHS Foundation Trust is made up of two of London’s best known teaching hospitals and employs over 13,650 staff and have over 2 million patient contacts a year. Our annual turnover is now £1.3 billion. You must be fully registered with the GMC/GDC and hold Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent at interview stage. The post holder will have regular contact with vulnerable adults and therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions. As an organisation, we are committed to developing our services in ways that best suit the needs of our patients. This includes asking certain groups of staff to work more flexibly so that we can offer services to patients in the evenings and at weekends. We regard this flexibility as essential if we are to continue to provide first class patient care in the future. As a result, any offer of employment to a consultant post will be subject to you agreeing to work a new more flexible pattern of working in the future if required and in accordance with the provisions of the new Guy’s and St. Thomas’ NHS Foundation Trust consultant contract. Please note that successful completion of the International English Language Testing System (IELTS) is our accepted minimum language requirement.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 2nd December 2020 at midnight &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 15th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlex WestJob titleConsultant Physician, Thoracic MedicineEmail addressAlex.West@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas&#39; Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Consultant in Pleural Disease and Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252138", "validThrough": "2020-12-02T23:59:59+0000"}