{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T14:45:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Experienced nurses will be offered fast track values based selection&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Specialising in mental health, learning disability and general community services, we’re dynamic, forward-thinking, and place a strong emphasis on investing in our people We’re looking for motivated, passionate, caring nurses to join teams in Barnsley, Calderdale, Kirklees and Wakefield&lt;/p&gt;\n&lt;p&gt;Here are just a few reasons we believe you’d want to work here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We’re listed in the HSJ’s Best Places to Work 2015&lt;/li&gt;\n&lt;li&gt;We score above average in the NHS Staff Survey - 92% of staff say their role makes a difference to patients&lt;/li&gt;\n&lt;li&gt;We ranked among the country’s best performing NHS organisations in the 2015 Patient-led Assessments of the Care Environment (PLACE) Full time roles are available in our adult and older people inpatient wards, learning disability service and low and medium secure forensic services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have roles in our peripatetic nursing team - in the first instance this will be piloted in Wakefield. Shortlisted applicants will be invited to a Skype interview – details to be confirmed.&lt;/p&gt;\n&lt;p&gt;If a successful candidate moves to live within a reasonable travelling distance to work and a significant distance nearer to their base consideration will be given to reimbursing reasonable relocation costs. This will be done in line with our established process. For further details please get in touch.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All shortlisted candidates will be invited in dial into a Skype or Microsoft Teams interview, scheduled to take place on: Thursday 26th November and/or Saturday 28th November. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Staff Nurse - Forensics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254377", "validThrough": "2020-11-18T23:59:59+0000"}