{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-10-30T13:45:47+0000", "description": "&lt;p&gt;At Time to Talk Health we care about anxious or depressed patients having time to talk through their common mental health difficulties, and provide talking therapies to local residents across West Sussex. If you share our commitment to care, then we’d like to hear from you.&lt;/p&gt;\n&lt;p&gt;Time to Talk Health Psychological Wellbeing Practitioners (PWPs) delivery low intensity CBT interventions across West Sussex to patients who have anxiety and/or depression associated with their long term conditions (LTCs). We are proud to work with out physical healthcare partners to ensure truly holistic care, and our step 2 practitioners play a key role in our collaborative model.&lt;/p&gt;\n&lt;p&gt;Our PWPs provide interventions by phone, in person, by video platform, online and in groups. Group work is currently being reviewed to adhere to social distancing measures. We work out of a number of venues and staff benefit from opportunities to work from home with all necessary IT equipment provided.&lt;/p&gt;\n&lt;p&gt;We are recruiting experienced PWPs, or those who are in the process of completing an IAPT training course. We will provide you with a full induction, or a preceptorship programme if you are newly qualified, as well as continued support through weekly clinical supervision, and protected time for clinical skills and professional development via our Psychology Forum. You will also be provided with additional training around adjusting to working with patients who have long term health conditions.&lt;/p&gt;\n&lt;p&gt;You will enjoy a varied working week, being in charge of your own diary with support from a Senior PWP, CBT Therapists and Administrators every day.&lt;/p&gt;\n&lt;p&gt;Along with being qualified, applicants should be highly motivated with enhanced written and verbal communications skills. Your PWP training will have provided you with ample experience of working in primary care settings, and you should enjoy working in a busy environment. A basic understanding of stepped care, risk assessment, care planning and key performance indicators is preferred.&lt;/p&gt;\n&lt;p&gt;At this current time we have adapted our practices to enable many staff to work from home, however this will not be a permanent arrangement and the emphasis will be working in a more blended form, combining home, clinical settings and from an office base.&lt;/p&gt;\n&lt;p&gt;Before applying we would welcome the opportunity to speak with you about the role in more detail. Interviews can be arranged via video conferencing.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVicky FenwickJob titleClinical Services ManagerEmail addressvicky.fenwick@nhs.netTelephone number07342 084232Additional contact information&lt;/p&gt;\n&lt;p&gt;Additional email contact: sc-tr.ltcreferrals@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central Clinic, Worthing", "postalCode": "BN11 1HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.815", "longitude": "-.374308"}}, "title": "Psychological Wellbeing Practitioner (PWP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250387", "validThrough": "2020-11-15T23:59:59+0000"}