{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-30T10:16:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Health in Mind is expanding! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining Health in Mind and we are looking for committed, enthusiastic, innovative team members to support and shape this service.&lt;/p&gt;\n&lt;p&gt;Do you have what it takes to support the service in this growth, meaning that we can see more people with mild to moderate anxiety and depression? We are currently recruiting into key roles so that we can recognise this ambition that will support our community of East Sussex.&lt;/p&gt;\n&lt;p&gt;In 2019, 93% of our team said that they felt their role made a difference to patients/service users and 97% of team members said that they felt trusted to do their jobs. In 2019, 90% of our team agree/strongly agree that they are happy working in the Health in Mind service.&lt;/p&gt;\n&lt;p&gt;If this sounds interesting to you, read on!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do we do? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Health in Mind, we support people suffering from mild to moderate anxiety and depression. Our interventions are diverse and evidence based, ranging from guided self-help and face-to-face or telephone support to workshop courses. We work closely with our Service-User steering group to refine and improve the service that we offer.&lt;/p&gt;\n&lt;p&gt;The result is a highly accessible and user-friendly service capable of meeting the needs of a geographically dispersed client group.&lt;/p&gt;\n&lt;p&gt;The team is proud of the difference we make to people&#39;s lives. As one of the highest performing services in the region, we consistently meet and exceed performance targets for access rates and patient outcomes by focussing at all times on the quality of care we provide.&lt;/p&gt;\n&lt;p&gt;We know that we can only achieve this with the efforts of our team and in creating an environment where colleagues are valued and involved in developing the service. We believe in investing in people, keeping true to the values and behaviours of Sussex Partnership and the NHS and looking after the wellbeing of all team members.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting an &lt;strong&gt;Team Administrator&lt;/strong&gt; with a desire to make a difference, to work hard and to further their knowledge, skill and experience in a supportive and progressive environment.&lt;/p&gt;\n&lt;p&gt;Your focus in this role will be to provide a comprehensive range of secretarial and administrative services to the Health in Mind team.&lt;/p&gt;\n&lt;p&gt;You will need to be;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;able to consistently deliver a client focussed service, which promotes good customer service and effective working relationships.&lt;/li&gt;\n&lt;li&gt;highly organised and focussed with good attention to detail&lt;/li&gt;\n&lt;li&gt;able to respond to phone calls from people who may be distressed or angry sensitively&lt;/li&gt;\n&lt;li&gt;IT literate ideally with experience of using customer/clinical databases&lt;/li&gt;\n&lt;li&gt;Have the ability to work across localities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will we offer in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return, we can offer you one of the most flexible and accommodating working environments you will find.&lt;/p&gt;\n&lt;p&gt;The team base is central within the stunning East Sussex countryside though we deliver care from multiple sites. We have multiple community sites across the county and our head office is in Hellingly. You would be based between our sites in Hellingly and Seaford&lt;/p&gt;\n&lt;p&gt;We care about and are committed to the quality of the care we provide. We also take care of our team members to support their own wellbeing. We offer flexible working hours; training opportunities and all team members can involve themselves in projects outside of their day to day roles.&lt;/p&gt;\n&lt;p&gt;Beyond the professional advantages of this role, you will have the benefit of living and working in an attractive part of the country and working with a high performing and innovative team.&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eloise Barnard &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Team Coordinator &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Number: 01323 446288&lt;/p&gt;\n&lt;p&gt;Email: eloise.barnard@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rosie Watts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Team Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Number: 01323 446287&lt;/p&gt;\n&lt;p&gt;Email: Rosanna.watts1@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews during COVID-19&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Health in Mind we are committed to maintaining the health and wellbeing of our community and our team members. We have been delivering our sessions via telephone and video, at present we are designing new group webinars. Not only has this allowed us to meet government requirements but they are exciting developments for the future.&lt;/p&gt;\n&lt;p&gt;We will be conducting all interviews via skype whilst the government advises that those who can work at home should work from home. You should ensure that you are able to take part in interviews of this nature and inform us at the earliest opportunity if there is a problem.&lt;/p&gt;\n&lt;p&gt;Candidates who are successful in being shortlisted and invited for an interview will be sent further specific guidance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodside, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Team Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249673", "validThrough": "2020-11-11T23:59:59+0000"}