{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pro rata per annum inc"}}, "datePosted": "2020-10-29T11:46:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the team&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South West London and St George’s Mental Health Trust is committed to promoting the involvement of service users and carers. Through involvement, we want to make sure that the Trust’s services and policies are led and shaped by the people best placed to know what works: people who use mental health services, their carers, family and friends.&lt;/p&gt;\n&lt;p&gt;As a Trust we place huge value on the insight, energy and time of our service users and carers, friends and family and are committed to creating an optimal environment for them to get involved in the activities and day to day running of the Trust. In recognition of this commitment we are expanding our Involvement Team and we have a part time post for a Carers, Families and Friends Involvement Co-ordinator. The purpose of this post is to improve the experience of, and the support available to, carers, families and friends of people who use our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the role:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will support the delivery of the Service User and Carer Involvement Plan by ensuring there is a clear pathway and effective systems and processes in place to recruit, train and support carers, families and friends to become and remain involved. You will develop and facilitate a carers, friends and families network and build a vibrant and diverse pool of people who are involved, whilst supporting Trust staff to offer a broader range of involvement activities for them. You will work to ensure that a culture of coproduction is embedded into the day to day operations of the Trust.&lt;/p&gt;\n&lt;p&gt;You will support the delivery of the Trust’s Carers Charter and the Carers Trust’s Triangle of Care. You will assist in the strategic development of information, advice and support to carers, families and friends and offer this within your role.&lt;/p&gt;\n&lt;p&gt;The Involvement Volunteer Co-ordinator and the Carers, Families and Friends Involvement Co-ordinator will act as Deputy Team Leaders within the Involvement Team, working alongside and supporting the Deputy Head of Coproduction &amp; Involvement; Involvement Project Lead; Peer Involvement Workers; Involvement Volunteer Co-ordinator and an administrator. The team is managed by the Deputy Head of Coproduction and Involvement &amp; the Involvement Project Lead.&lt;/p&gt;\n&lt;p&gt;A track record of providing support and development to service users, carers and colleagues is essential. You will utilise your own lived experience as a person who has received services or actively cared for someone under the care of secondary services to ensure that individuals are fully supported at every stage of the process of getting involved in working with the trust. We&#39;ll also be looking for experience of working with people with mental health issues and an understanding of social exclusion and the recovery approach. You will be expected to build relationships with a variety of external agencies and professionals and be adept at presenting information and writing reports.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate active listening skills, good interpersonal skills, excellent written and verbal communication ,an ability to work under pressure and have leadership skills .Proficiency using office IT systems to record and analyse data is also essential, as is a proactive, customer-focused approach.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate personal self-awareness and resilience with managing your own lived experience and help others to develop these skills.&lt;/p&gt;\n&lt;p&gt;In return we offer a range of benefits including a pension scheme, staff discounts scheme and access to wellbeing treatments / services. We will provide you with the relevant training, regular supervision and development opportunities and an opportunity to develop new skills.&lt;/p&gt;\n&lt;p&gt;Good involvement can transform lives, build resilience in communities and make sure services are really meeting the needs of service users and carers - we want this to be the standard that everyone works towards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the location:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our offices are located on the top floor of Building 32 at Trust headquarters which is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits&lt;/span&gt;&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave,&lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance,&lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development,&lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt;- You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts,&lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Carers, Families and Friends Involvement Coordinator - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248159", "validThrough": "2020-11-11T23:59:59+0000"}