{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-04T11:01:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title:&lt;/strong&gt; &lt;strong&gt;Clinical Psychologist (Specialist Mental Health Practitioner)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have Two Posts Available&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt; Mental Health in Schools Team (MHST) Wokingham Borough Council&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;8a&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary : &lt;/strong&gt;£47,544 to £53,459 per annum, pro rata (incl of HCAS)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 22.5 hours per week (0.6 sessions - Two Year Fixed Term Contract)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Child and Adolescent Mental Health Services (CAMHS) Specialist Community&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Directorate: &lt;/strong&gt;Children, Young People and Families&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt; CAMHS Service Manager &amp; Wokingham Lead Educational Psychologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date :&lt;/strong&gt; 30-Nov-2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;            &lt;/strong&gt;2.&lt;strong&gt; Mental Health in Schools Teams Reading – Brighter Futures for Children&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;8a&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary : &lt;/strong&gt;£45,753 to £51,668 per annum , pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 18.5 hours per week (0.5 sessions - Permanent Contract)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Child and Adolescent Mental Health Services (CAMHS) Specialist Community&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Directorate: &lt;/strong&gt;Children, Young People and Families&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt; CAMHS Service Manager &amp; BFfC Lead Educational Psychologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date : &lt;/strong&gt;03-Dec-2020&lt;/p&gt;\n&lt;p&gt;Are you passionate about helping young people with mental health problems? Are you looking for an opportunity to develop and share your skills and knowledge in mental health? Are you committed to ensuring other professionals feel skilled and able to support presentations of mental health difficulties? If you answer yes to these questions, then Berkshire Healthcare Foundation Trust (CAMHS) is the place for you!&lt;/p&gt;\n&lt;p&gt;We are offering an exciting opportunity to be part of one of current three Mental Health in School Teams (MHST) based across West of Berkshire, which we have developed in partnership with our local authority colleagues. We are looking for an experienced Clinical Psychologist with a committed interest in working in schools to improve outcomes of young people in our new multi-disciplinary Mental Health Schools Team. The aim of the team is improving the mental health and wellbeing of children and young people in the community. There is a specific focus on developing more access to support and improving the general culture of emotional support within primary and secondary schools. The Mental Health Support Team is fully integrated with community educational settings, and each multi agency team is based within each of the three local authorities.&lt;/p&gt;\n&lt;p&gt;The role will help to develop and deliver a wide range of interventions, projects and system change. We aim to deliver whole school and whole community approaches to supporting young people’s mental health.&lt;/p&gt;\n&lt;p&gt;We are looking for confident CAMHS professional with a demonstrable track record of providing good quality evidence based interventions, improving service quality with a strong interest in service development.&lt;/p&gt;\n&lt;p&gt;You need to be an experienced clinically qualified Clinical Psychologist, with the requisite professional registration who has experience post qualifying within a CAMHS setting. Experience of working independently in the community would be particularly advantageous.&lt;/p&gt;\n&lt;p&gt;You will join the Team either based within Wokingham or Reading Local Authority. The teams consist of Senior Educational Psychologists, Primary Mental Health Workers, EMP’s and Outreach Workers. You will be required to work autonomously and in an integrated way within professional guidelines being responsible for providing specialist mental health assessments of clients referred to the team. You will formulate and implement plans for the formal treatment and/or management of a client’s mental health problems, and implementing a range of interventions for individuals, carers, families and groups within and educational setting.&lt;/p&gt;\n&lt;p&gt;You must have significant and demonstrable experience of working with young people and their families, who can often present with a range of complex mental health needs. You will need to develop good working relationships with key professionals across the partnership; therefore excellent communication and engagement skills are essential. A commitment to improving service delivery and developing new ways of supporting early intervention is crucial to work within the wider MHST. Within the role you will contribute to and support the collection of service outcome data across the service.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will contribute to the wider aims of the service through joint working, training and supervision to other professionals and will integrate fully into the MHST.&lt;/p&gt;\n&lt;p&gt;In return we will provide a comprehensive induction and, regular clinical and management supervision and you will be appraised on a yearly basis with a view to developing knowledge and skills where appropriate.&lt;/p&gt;\n&lt;p&gt;Informal visits and enquires are strongly encouraged. Please contact Kim Jones, CAMHS Service Manager on 07786 703615.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please state in your application form which role you will be going for (either the fixed term or permanent one)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CAMHS Reading Sp Comm Team, Reading and Wokingham", "postalCode": "RG1 5LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4506", "longitude": "-.957161"}}, "title": "Clinical Psychologist (Specialist Mental Health Practitioner )", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255507", "validThrough": "2020-11-18T23:59:59+0000"}