{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "28000", "unitText": "YEAR", "value": "Up to £28,000, per annum - depending on experience"}}, "datePosted": "2020-11-05T12:32:21+0000", "description": "&lt;h1&gt;&lt;strong&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Patient care is at the centre of what we do and we are looking for an enthusiastic, hardworking and committed nurse who wants to make a difference to our patient’s lives.&lt;br /&gt; &lt;br /&gt; HMP Highpoint is a category C adult male prison for sentenced prisoners, holding up to 1323 men across 15 residential units. HMP Highpoint is situated on the A143 at Stradishall, which is approximately 7 miles from Haverhill when heading to Bury St Edmunds and within 20 miles of the A14 to the north and the M11 to the west. The prison is split across two sites - North and South. Healthcare is provided:&lt;br /&gt; &lt;br /&gt; North Hours:&lt;br /&gt; 08:00 – 17:30 Monday to Friday&lt;br /&gt; 08:00 – 17:00 Weekends and Bank Holidays&lt;br /&gt; &lt;br /&gt; South Hours:&lt;br /&gt; 07:45 – 18:15 Monday to Friday&lt;br /&gt; 08:00 to 18:00 Weekends and Bank Holidays&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Registered Primary Care Nurse (Adult Nurse) you will be an integral part of the healthcare team by bringing your clinical skills and passion for care. You could be involved in anything from triaging and leading clinics, reception screening, medication administration as well as responding to emergency situations.&lt;/p&gt;\n&lt;p&gt;We offer opportunities to develop your role. Examples include sexual health, health promotion, vaccinations, wound care, long term condition courses, minor illnesses/injuries and infection control. You will also be working as part of a larger multi-disciplinary team, alongside the substance misuse and mental health teams.&lt;/p&gt;\n&lt;p&gt;There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;It’s not just the environment that’s varied here, the role is too. You can expect to be involved in everything from clinical triage to the evaluation and development of patient care and standards. You’ll carry out – and potentially develop – nurse-led clinics, reviewing patient histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;br /&gt; &lt;br /&gt; Across everything you do, you’ll maintain accurate records and provide the kind of helpful, empathetic support that will make every patient feel at ease.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Highpoint if suitable for the role.&lt;br /&gt; &lt;br /&gt; For more information or to arrange an informal visit please contact us on the details provided.&lt;br /&gt; &lt;br /&gt; Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced free DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newmarket", "postalCode": "CB8 9YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.137", "longitude": ".51069"}}, "title": "Primary Care Nurse - HMP Highpoint", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257679", "validThrough": "2020-11-19T23:59:59+0000"}