{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T09:46:42+0000", "description": "&lt;p&gt;Band 8a Practitioner Psychologist - 1.0 WTE working across Crisis Resolution Home Treatment Team and Oaklands Inpatient Ward, Chichester.&lt;/p&gt;\n&lt;p&gt;With national recognition of the importance of treating people in their home environment when experiencing a mental health crisis, West Sussex CRHT teams have received a significant boost in their funding in order to expand the service offered to people in crisis. Careful thought has been given to the whole pathway and there is a strong commitment to increasing access to psychology and psychological therapies both in frequency of contact and in the range of interventions available. In order to meet this need and take part in the exciting re-design of services, we are advertising one full-time band 8a Practitioner Psychologist Post, working across the Crisis team and Oaklands, our 16 bedded mixed inpatient ward for working age adults. The post holder will be expected to work as an integral part of the wider multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Your primary role is to provide complex assessments, formulations and evidence based therapeutic interventions for individuals, groups and families. Some experience of working within acute or crisis settings, or specialist services engaging individuals with psychosis or personality disorder would be of benefit. A solid understanding of recovery principles is essential. You will also support your colleagues and help to nurture a therapeutic culture by supporting other team members to deliver psychologically informed interventions though the provision of supervision and reflective practice and, to supervise Band 6 Psychological therapists. We are very excited about these developments and the positive impact it is likely to have on the local communities that serve our Acute Care Pathway.&lt;/p&gt;\n&lt;p&gt;As part of the wider adult mental health service you will also be joining a small community of psychological therapists who bring a rich variety of skills. We place a high value on staff wellbeing and you will receive regular clinical supervision and support from the Lead Psychologist for Acute Care. Sussex Partnership is well-known for the excellent range of CPD opportunities available to staff including accredited training in EMDR, Mindfulness Based Cognitive Therapy, Family Interventions in Psychosis, Interpersonal Psychotherapy and many more.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership NHS Foundation Trust provides mental health, learning disability and substance misuse services in and across Sussex. The Trust has teaching status and is developing into one of the country’s leading teaching mental health trusts. Psychological Therapies are highly valued in Sussex Partnership and Psychological Therapists occupy a range of senior positions across the Trust. Working here offers continued training and development, variety, plus all the benefits of living in Sussex. West Sussex is a beautiful county with great schools, good transport links, vibrant communities, rural areas, and tourist attractions, including the Coast and the South Downs. We would welcome informal visits and / or a telephone call to tell you more about our service and this post. The Trust has recently been rated by the CQC as Good overall and Outstanding for care.&lt;/p&gt;\n&lt;p&gt;We are really keen to talk to prospective candidates about the service and about their ideas for the role. We would therefore strongly encourage you to make contact for an informal discussion.&lt;/p&gt;\n&lt;p&gt;You can speak with me, Pallavi Bala, Principal Psychologist and Lead for Acute Psychology/Psychological Therapies, North West Sussex on 07387645856 (Pallavi.bala@sussexpartnership.nhs.uk),Lucy Delaney, Clinical Lead Nurse, (Lucy.delany@sussexpartnership.nhs.uk ), on 07765806893, or Julia Kesteven, Service Manager on 07960 135213 ( Julia.kesteven@sussexpartnership.nhs.uk). We would be very happy to arrange an informal visit if you would like to come and meet with our teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chichester, Chichester", "postalCode": "PO19 6GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8466", "longitude": "-.77098"}}, "title": "Practitioner Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245884", "validThrough": "2020-11-11T23:59:59+0000"}