{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum, inc HCA"}}, "datePosted": "2020-11-04T11:01:34+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Clinical Vascular Scientist/Vascular Sonographer&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Band 7 – 1 year fixed term (maternity leave cover)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Plus high cost area supplement&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Plus&lt;/strong&gt;&lt;/span&gt; this post attracts a generous additional recruitment and retention premium in recognition of the highly specialised nature of the role &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Plus&lt;/strong&gt; &lt;/span&gt;option to participate in voluntary Saturday overtime rota paid at good rates&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please see contact details below to request information on these additional payments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking to recruit a specialist in vascular ultrasound imaging. &lt;strong&gt;This post can be offered for the right candidate either full-time or part-time, to be negotiated.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ideally you are an SVT accredited Clinical Vascular Scientist or graduate of the STP scheme in vascular science with some supplementary experience. This role can offer:&lt;br /&gt; &lt;br /&gt;• Exposure to a full range of peripheral vascular investigations and the interesting and varied pathology seen in a tertiary referral centre&lt;br /&gt;• Further clinical development in areas such as renal artery duplex scanning, dialysis access fistulas, transcranial imaging for children with sickle cell disease, as well as ultrasound guidance for interventional procedures&lt;br /&gt;• Opportunities to be involved in teaching and training of STP trainees, junior doctors and other healthcare professionals&lt;br /&gt;• A supportive team environment but with autonomy, sometimes running clinics and lists in other units&lt;br /&gt;• A well-equipped department with top of the range scanners, air conditioned scanning rooms, PACS and RIS connectivity, and full admin support&lt;br /&gt; &lt;br /&gt;The post will be based at Denmark Hill but will require candidates to contribute to clinics at other locations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a responsive team with a reputation within the trust for providing an excellent service to our patients and referring clinical teams. We enjoy close and positive working relationships with many of our colleagues around the trust including those in Vascular Surgery, Renal, Diabetic Foot Clinic and Radiology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Situated in Denmark Hill, the main hospital has good transport links to a range of suburban areas to live as well as easy access to everything the heart of London has to offer.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Ann Kelly&lt;/p&gt;\n&lt;p&gt;Email address ann.kelly1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To informally discuss the role further, please contact Ben Freedman benfreedman@nhs.net tel: 0203 299 3711&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Accredited Clinical Vascular Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255505", "validThrough": "2020-11-22T23:59:59+0000"}