{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T14:46:19+0100", "description": "&lt;p&gt;Are you looking for a new challenge? We have the perfect Opportunity for you.&lt;/p&gt;\n&lt;p&gt;CPFT are delighted to offer you the unique opportunity to be part of a new Crisis (Home Treatment) Team to support children and young people in our county. This is an exciting opportunity to be fully involved in developing and creating the highest quality service provision for service users and their families / supporters from the start and we need you to help us achieve this.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide a multiagency/ multi skilled team to support families and young people in Crisis by delivering short-term, recovery-focused interventions and brief home treatment plans. The Team will have experienced clinical leaders working alongside support staff to deliver planned episodes of care and ensure young people have access to appropriate support.&lt;/p&gt;\n&lt;p&gt;We are looking for practitioners who are passionate, dynamic, and skilled professionals and support staff who are ready for a new challenge to significantly improve children’s experiences.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;The permanent posts are eligible for a £3000 New Hire Bonus. An initial payment of £1000 will be paid in the first 1 month and a final payment of £2000 will be paid 1 year after your start date. This will be pro-rata for part-time posts. Internal applicants are not eligible.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This system-wide service will work collaboratively across multiple sectors, including social care and education, to ensure that the children and young people&#39;s acute mental health needs are shared, understood and that risk management plans are jointly agreed.&lt;/p&gt;\n&lt;p&gt;Key relationships for the service include working with existing CAMHS, First Response Service, CAMHS Intensive Treatment Team, adult mental health services and acute care colleagues, to begin the risk assessment process as soon as the young person enters the acute care Trusts. Liaison with GP’s and professionals such as social care colleagues and education for community assessments will be an essential element to the service delivery.&lt;/p&gt;\n&lt;p&gt;Ideally applicants would have experience working in health or social care with complex family issues and be able to demonstrate our Trust values (Professionalism, Respect, Innovation, Diversity and Empowerment) in delivering care and working as part of a team. We believe this is a genuine opportunity to develop your skills and experience and have a comprehensive range of Learning and Development opportunities to support and stretch you as part of a continuous development and coaching culture throughout the organization. These cover a range of personal, management, leadership and healthy team working topics, management and leadership development programmes and qualifications, access to a performance and career coach as well as support to continue CPD and enhance your clinical skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\nLouise Marks, Service/Clinical Lead, CAMHS Crisis Team\nlouise.marks2@cpft.nhs.uk - 07762 401799\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Base negotiable, Base negotiable", "postalCode": "PE29 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3317", "longitude": "-.179007"}}, "title": "CAMHS Crisis Care Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241000", "validThrough": "2020-11-06T23:59:59+0000"}