{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 to £87,754 pa"}}, "datePosted": "2020-10-26T03:31:05+0000", "description": "&lt;p&gt;Are you looking for a role where your excellent Nursing and Senior Leadership skills can directly contribute to saving lives across the UK? Organ and Tissue Donation and Transplantation (OTDT) in NHSBT is a unique organisation, working across the entire UK to support every Organ Donation and provide life-saving organs for transplant.&lt;/p&gt;\n&lt;p&gt;We are looking for a leader as exceptional as we are, to become our Assistant Director for Organ Donation. A professional Nurse with experience of managing multi skilled healthcare teams and the passion and enthusiasm for high quality service delivery and performance improvement within the field of Organ Donation that will enable you to lead our remarkable cohort of Specialist Nurses. You will be an integral part of our Directorate Senior Management Team providing both strategic and operational leadership taking forward projects and initiative relevant to your portfolio.&lt;/p&gt;\n&lt;p&gt;We know that exceptional candidates don’t come along every day, but neither do exceptional opportunities like this. In joining OTDT you will become part of a world class Organ Donation Organisation with an International reputation for excellence and offering unparalleled opportunities to develop professional links and networks. We are a national organisation and our colleagues are spread across the UK, if you are the right person and live near good transport links than your location works for us as your base can be negotiated. So, if you can bring the skills and experience we need, and want to be a part of saving and improving thousands of lives across the UK, than read on.&lt;/p&gt;\n&lt;p&gt;To arrange an informal discussion please e-mail Kathy.Zalewska@nhsbt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National by agreement", "postalCode": "BS34 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5179", "longitude": "-2.56889"}}, "title": "Assistant Director Organ Donation (Nurse)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241610", "validThrough": "2020-11-15T23:59:59+0000"}