{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-03T11:46:37+0000", "description": "&lt;p&gt;Are you an inspiring very experienced senior operational manager looking for a unique opportunity to lead a brand new hospital?*&lt;/p&gt;\n&lt;p&gt;The Grange University Hospital (GUH) is set to open in November 2020 and will transform the way health services are accessed within Aneurin Bevan University Health Board (ABuHB). The hospital will care for the most sick patients requiring urgent and specialist care and will complement the portfolio of existing hospitals and primary care services. It will be pivotal to the way secondary care flows across our Health Board.&lt;/p&gt;\n&lt;p&gt;The Hospital is a brand new 560 bedded facility offering state of the art Emergency Unit including Helipad and Trauma Centre, 13 Theatres, and 15 inpatient ward areas with 80% single bedded rooms. The hospital has been built overlooking the wonderful Welsh countryside and is a long awaited centre of excellence to service the population of Gwent&lt;/p&gt;\n&lt;p&gt;The role of Divisional General Manager for Urgent Care / Hospital Manager GUH is a newly established post, responsible for ensuring that the hospital and Division of Urgent Care provide first class healthcare to the patients of ABuHB.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Divisional Director of Urgent Care, with professional accountability to the Executive Director of Operations and will operate as part of a triumvirate divisional management team alongside the Divisional Nurse for Urgent Care. The successful candidate should have extensive operational management experience and knowledge within the NHS and must be able to evidence delivery of whole system change and management of complex and interdependence operational services.&lt;/p&gt;\n&lt;p&gt;We are waiting to hear from passionate individuals who can lead on the continued progress of our Clinical Futures Programme, whilst ensuring the delivery of first class healthcare services in a challenging and unpredictable environment.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Paul Mizen - Divisional Director of Urgent Care&lt;/p&gt;\n&lt;p&gt;paul.mizen@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;07753 619446&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grange University Hospital, Cwmbran", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Divisional General Manager for Urgent Care; Hospital Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253805", "validThrough": "2020-11-17T23:59:59+0000"}