{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T13:16:13+0100", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen within Ipswich East Community well established community team. We are looking for an experienced band 6 Physiotherapist who is passionate, committed, innovative, enthusiastic and highly motivate to delivering high quality care within patient’s homes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ipswich is a large area offering a wide variety of exposure to multiple long term and short term conditions with the opportunity to treat individuals either in their own homes or at the Gym facilities at Bluebird Lodge community STARR centre.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be working alongside and supported by Occupational Therapists, Physiotherapist, Community and District Nurses as well as Generic Support Workers and administrative colleagues.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be committed to team work, delivering high quality patient care and have a desire for on-going professional development.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an opportunity to work within a knowledgeable experienced team and wider MDT. Candidates should be flexible, motivated and willing to work within a changing environment. We will provide support through in-service training and professional forums, Mandatory training, 1:1 and personal development meetings as well as clinical rolling skills training via the practice development facilitators. We facilitate students on training and have close working relationships with neighbouring community teams in Health and Social Care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous community experience is preferred; however, training will be available to applicants who possess the personal qualities and skills we are seeking.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt; ‘&lt;strong&gt;Please note that this role is subject to a DBS check which will be charged to the successful candidate. Full details can be found within the ‘DBS Information’ documents attached to this advert.’&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paula Springle Team Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;paula.springle@suffolkch.nhs.uk 07950 851285&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bluebird Lodge, Ipswich", "postalCode": "IP3 9GJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0273", "longitude": "1.19843"}}, "title": "Community Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240673", "validThrough": "2020-11-06T23:59:59+0000"}