{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa, based on full time horus"}}, "datePosted": "2020-11-02T11:00:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you committed to outstanding patient care? Have you completed your Nursing Associate foundation course or are in the process of completing it in the next 5 – 6 months? If so we would love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Austen House opened in October 2019 and is a brand new low secure Child and Adolescent Mental Health (CAMHs) unit&lt;/strong&gt;&lt;strong&gt;. &lt;/strong&gt;This new 14 bed unit will help to meet the national shortage of beds for young people with specialist mental health needs and will mean that young people and their families living in the south of the country will be able to access treatment closer to home, preventing them having to travel long distances to receive the care they need.&lt;/p&gt;\n&lt;p&gt;The clinical team consists of psychiatrists, nurses, psychologists, occupational therapists, teachers and a family therapist. There is a wide range of experience in this exciting and enthusiastic team, where high standards of care and a positive learning environment are highly valued.&lt;/p&gt;\n&lt;p&gt;You will be working with the qualified nurses and other members of the MDT to deliver individual treatment packages with an emphasis on collaborative care that focuses on recovery and the need to work towards discharge. Please refer to the job description for a full breakdown of duties&lt;/p&gt;\n&lt;p&gt;We understand how important work life balance is and we know happy staff makes for outstanding care. Let us know if you require flexible working and we will always do our best to accommodate you.&lt;/p&gt;\n&lt;p&gt;If you are career driven we are here to support you. We have a competency based approach to clinical training and development, ensuring you are able to develop your skills in a safe and effective way. You will receive regular supervision and opportunities for personal and professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to Talk Flexible Working&lt;/strong&gt; - all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251673", "validThrough": "2020-11-16T23:59:59+0000"}