{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 pa pr"}}, "datePosted": "2020-10-27T10:02:05+0000", "description": "&lt;p&gt;Following the merger and formation of University Hospital Dorset (UHD) NHS Foundation Trust an exciting new opportunity has arisen to work within the corporate leadership team as a talented Associate Director of Operational Performance, Assurance and Delivery with a focus on elective care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will report directly to the Deputy Chief Operating Officer and will work closely with the Group Directors of Operations for our three Care Groups to develop a culture of high performance and continuous improvement.&lt;/p&gt;\n&lt;p&gt;This is a key leadership role working with a considerable degree of autonomy, and with the scope to bring a great degree of creativity to the role, the postholder will have specific responsibilities to lead our ambition to align our quality improvement and performance systems.&lt;/p&gt;\n&lt;p&gt;The postholder will work as part of the corporate team supporting the office of the Chief Operating Officer and will be responsible for developing and managing the performance management framework at UHD, leading the development, coordination and oversight of the performance agenda across the Trust and providing assurance to the Trust, commissioners and regulators about improvement plans and delivery against these.&lt;/p&gt;\n&lt;p&gt;This high profile role will provide the right candidate with a great opportunity to broaden their leadership and management skills, and expertise as a next step to an exciting career. The Trust is committed to developing its workforce and has a modular based Operational Management programme structured around the nine dimensions of the Healthcare Leadership Programme (HLM) to develop senior leaders.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the organisation as a member of the senior team on a rapid journey of improvement. As a talented Associate Director of Operational Performance, Assurance and Delivery you will shape and drive forward the ambitions and strategic goals of the organisation.&lt;/p&gt;\n&lt;p&gt;If you are passionate about the value that great leadership can add to an organisation, this is the role for you. You will be resilient, confident and possess the skills that will enable you to drive improved performance.&lt;/p&gt;\n&lt;p&gt;It is essential that you are a team player, have excellent people and leadership skills and the credibility and ability to work with and influence at every level, to deliver innovation and performance.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date 09/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date week commencing: 16/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJacqueline ColesJob titleDeputy Chief Operating OfficerEmail addressjacqueline.coles@uhd.nhs.ukTelephone number0300 019 8651&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals Dorset NHs Foundation Trust, Poole", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Associate Director of Operational Performance, Assurance &amp; Delivery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243925", "validThrough": "2020-11-09T23:59:59+0000"}