{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro rata"}}, "datePosted": "2020-11-04T14:21:58+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for permanent Staff Nurses to join our ward team on a full or part time basis. Ward 7 is a 28 bedded medical ward specialising in Cardiology treating both male and female adult patients. Working closely with our coronary care unit we provide specialist care to cardiac patients requiring primary PCI, pacemakers and ICD’s. We also manage conditions such as endocarditis and heart failure.&lt;/p&gt;\n&lt;p&gt;Our staff nurses provide a high quality service in a safe environment where the needs to each patient are cared for in a professional and holistic manner by using all available specialist knowledge and skills. The wellbeing of all our patients relies on appropriate and timely assessment, investigation, treatment and care.&lt;/p&gt;\n&lt;p&gt;Our medical wards can be busy and challenging environments. In joining our team, you will bring your skills and passion to provide the highest quality patient-focused care and compassion for our patients. You must be a team player with excellent communications skills and have the ability to work using your own initiative as well as part of the wider team.&lt;/p&gt;\n&lt;p&gt;In return, you will find your contribution is valued and that you are supported through excellent management and a teamwork approach, working as part of a multi-disciplinary team with doctors, health care assistants, physiotherapists and other health professionals. We offer comprehensive learning and development support, excellent training opportunities and support to broaden your experience, knowledge and skills as a qualified nurse.&lt;/p&gt;\n&lt;p&gt;We offer flexible working patterns on a roster basis which includes a well-balanced combination of days, nights and weekends in order to meet the needs of our patients and ensure we provide a fair and equal working environment.&lt;/p&gt;\n&lt;p&gt;Our nursing teams are focused on the six C’s, and we aim to provide a high quality service in a safe environment where the needs of each patient are cared for in a professional and holistic manner.&lt;/p&gt;\n&lt;p&gt;The successful applicant will possess excellent communication skills, team working skills and some knowledge of surgical procedures to join our busy units. We will support your development in the post through personal development planning, excellent training opportunities and will support you to broaden your experience, skills and knowledge in the rotation into the surgical ward areas&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Shift patterns:shifts will be either early (07.30-15.30), late (13.30-20.30), long day (07.30-20.30) or night shifts (20.00-08.00).&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 19th November&lt;/strong&gt;&lt;strong&gt;2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Laura Atherton, Ward 7 Sister&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;lauraatherton@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01625 661007&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For queries regarding the application and or interview process, please contact the Recruitment Team either via email, ecn-tr.recruitment@nhs.net or telephone, 01625 656510&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;em&gt;We would like to inform you that if your application is successful, your interview will be held via SKYPE.&lt;/em&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Staff Nurse in Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256202", "validThrough": "2020-11-19T23:59:59+0000"}