{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37000", "minValue": "28000", "unitText": "YEAR", "value": "£28,000 to £37,000"}}, "datePosted": "2020-10-13T16:30:30+0100", "description": "&lt;p&gt;Join our Musculoskeletal Team!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Band 6 MSK Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dartford, Gravesham, Swanley, Medway, Thanet.&lt;/p&gt;\n&lt;p&gt;Salary £28,000 to £37,000 p/a (equivalent band 6) Dependent on Experience&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are an Senior MSK Physiotherapist capable of assessing and treating a varied caseload of patients with complex needs and are comfortable working as an autonomous practitioner within a team of other therapists, you might be exactly who we&#39;re looking for!&lt;/p&gt;\n&lt;p&gt;Healthshare is one of the leading Healthcare providers in the UK. We provide NHS Physiotherapy, Orthopaedic, Rheumatology, MSK Podiatry and Pain Management Services across 19 CCG’s nationwide.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication skills as well as an in-depth understanding of MSK Physiotherapy. They must have a flexible, adaptable and innovative approach to work and be able to proactively deliver results. Our clinical team based in the community in Dartford, Gravesham, Swanley, Medway and Thanetincludes: Extended Scope Physiotherapists (ESPs) and MSK Physiotherapists.&lt;/p&gt;\n&lt;p&gt;The right candidate will be a HCPC and CSP registered Physiotherapist with a B.Sc. Physiotherapy and at least 2 years experience working in an MSK setting. You will be expected to maintain your own electronic patient records (SystmOne), actively participate in clinical teaching and in-service training sessions, deliver a high standard of patient-centred clinical care, possess a friendly and approachable attitude and apply outstanding team-working, communication and organisational skills to your daily practice.&lt;/p&gt;\n&lt;p&gt;Due to its rural location, a driving licence and car is essential for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Healthshare Clinical Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130138"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "KENT", "postalCode": "DA2"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4298", "longitude": ".230653"}}, "title": "Senior Band 6 MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225051", "validThrough": "2020-11-17T23:59:59+0000"}