{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T13:25:38+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;ROYAL DEVON &amp; EXETER HOSPITAL (WONFORD)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;REF: CLOSING DATE: 15&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.**&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you looking for a change or ready for a new challenge?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a dynamic, highly motivated and forward thinking dietitian to join our community dietetic team at the Royal Devon and Exeter Hospital&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You need to have current clinical community dietetic and adult home enteral feeding experience, be enthusiastic, organised and flexible to meet the demands of the service having access to a car at all times. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The role involves providing, as part of a team, dietetic input to; 3 community hospitals, outpatient clinics held either virtually or within a community setting and adult home enteral feeding patients. You will contribute to the group education of patients and healthcare professionals in Exeter, East Devon and Mid Devon localities of Devon CCG. You may often be working alone but with support and advice from senior staff across the service your ability to seek guidance when required is essential.&lt;/p&gt;\n&lt;p&gt;As well as clinical skills, this post will enable you to gain managerial and leadership experience in the form of clinical supervision of junior staff members. Training will be in place to help support you with this.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The community dietetic service is part of a wider team of 26 dietitians including specialists in paediatrics, oncology, gastro, intestinal failure, cystic fibrosis and renal. The department has good integrated services with other AHP’s and is supportive in CPD opportunities. You will contribute to projects, outcome measures, audit and training of both dietetic and medical students. We will support you in developing your skills in a number of ways, including shadowing opportunities across the team. You may also be required to have input into the acute dietetic team depending on demands of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Hours: 37.5 hours/week&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Salary: £31,365 - £37,890&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details please contact: &lt;strong&gt;Catherine tancock, nutrition and dietetic services manager 01392 403751 or carys Jones lead community dietitian,01392 403555&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Community Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257863", "validThrough": "2020-11-16T23:59:59+0000"}