{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "Up to £30,000"}}, "datePosted": "2020-10-30T09:03:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Northumberland Recovery Partnership (NRP) is a dedicated service for anyone in Northumberland, 18 years old or over, who is experiencing problems with drugs and alcohol. We help people get well and stay well and we believe recovery from addiction and substance misuse is possible for everyone, and we’re here to help people achieve it.&lt;/p&gt;\n&lt;p&gt;Everyone’s Turning Point is unique. It’s the moment when they realise they’ve made a small, but important, step forward. Very often, that small step is the start of something bigger. But only when the right support, advice and services are in place.&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people across the UK with substance misuse. As a Team Manager you will assist in delivering Turning Point’s Substance Misuse strategy within a Multi-disciplinary service which reflects our person centred values and the high levels of ambition we have both for the recovery of the individuals for whom we provide support and the development of our own staff. &lt;/p&gt;\n&lt;p&gt;This is done by assisting the Operations Manager in leading, developing and coordinating your teams within the service to ensure the delivery of high quality, innovative and cost effective care.&lt;/p&gt;\n&lt;p&gt;Passionate about people, you’ll enjoy the scope and support to enhance your own life too, as you make the role your own as part of a friendly and multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Running health facilities and services on a not-for-profit basis, we invest every penny back into our care – and our people. So, if you’re ambitious and focused on substance misuse, progress a Managerial career with real value.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribute to the effective planning of excellent person-centred care and support plans throughout the hub that meet the needs of clients in accordance with the recovery agenda.&lt;/li&gt;\n&lt;li&gt;Help to ensure the delivery of excellent person-centred interventions with individuals for whom we provide support within the hub.&lt;/li&gt;\n&lt;li&gt;Help to achieve long term goals by being aware of the Substance Misuse Strategy, working with the Operations Manager to help align the service and service plan to it.&lt;/li&gt;\n&lt;li&gt;Help to achieve the service’s financial targets, by being aware of and contributing to effective financial forecasting, budget development, control and cost effective operations within the hub, operating at all times in line with Turning Point’s financial procedures, reporting progress and escalating concerns to your Operations Manager.&lt;/li&gt;\n&lt;li&gt;Contribute to growth and business development plans by assisting in the management of and, where necessary, transformation of the service in conjunction with your Operations Manager, the Growth team and other stakeholders so that the contract is renewed in accordance with Substance Misuse’s strategy and business plans.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 3 years’ experience in substance misuse treatment.&lt;/li&gt;\n&lt;li&gt;Experience of delivering both drug and alcohol services across a range of settings or previous experience of managing an integrated drug and alcohol service.&lt;/li&gt;\n&lt;li&gt;Experience of change management in substance misuse.&lt;/li&gt;\n&lt;li&gt;Experience of implementing quality standards within a service.&lt;/li&gt;\n&lt;li&gt;Experience of improving service performance and maintaining that performance within a rapidly changing environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;31 days’ paid holiday a year, increasing with each year of service up to 33 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blyth", "postalCode": "NE24 1BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1275", "longitude": "-1.51075"}}, "title": "Team Manager - Northumberland Recovery Partnership", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249400", "validThrough": "2020-11-13T23:59:59+0000"}