{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa inc plus Outer London HCAS"}}, "datePosted": "2020-11-02T15:32:11+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Croydon CAMHS is currently organised along the I Thrive model, with a &lt;strong&gt;Getting Advice team&lt;/strong&gt; leading on referrals and provision of front line groups, a &lt;strong&gt;Getting Help team&lt;/strong&gt; leading on provision of interventions for children presenting for the first time and where an evidence based talking therapy or combination of talking therapy and medication are indicated. The &lt;strong&gt;Getting More Help team&lt;/strong&gt;, offers intervention to young people with particularly complex mental health difficulties which may require a package of interventions and to those who have been discharged from tier 4 services or have been previously seen in the service.&lt;/p&gt;\n&lt;p&gt;The service also has a Single Point of Contact (SPOC) team that manages referrals alongside Croydon Children’s Social Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Croydon CAMHS is seeking an enthusiastic CAMHS Practitioner to join our multidisciplinary team. The post holder will split their time between the Croydon CAMHS Single point of contact (SPOC) team and the Getting More Help Team. They will join the team of multi-disciplinary professionals who process emotional mental health and well-being referrals for CAMHS and will provide assessment, treatment, care coordination and planning for children and/or young people with moderate to severe mental health and neuropsychiatric difficulties, under supervision of the team leader and relevant clinical supervisor. The successful applicant will have either experience of working with Children and Young People with moderate to severe mental health or neuropsychiatric difficulties in mental health settings or transferable skills in the assessment and treatment of people with mental health and hold current professional registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Croydon CAMHS is located in the centre of Croydon, a 15-20min walk from both East Croydon and West Croydon Stations. There are also multiple buses available in the area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLorna TahaJob titleTeam LeaderEmail addresslorna.taha@slam.nhs.ukTelephone number02032280000Additional contact information&lt;/p&gt;\n&lt;p&gt;Neil Palmer, Clinical Psychologist, 02032280000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Christopher Wren House, Croydon", "postalCode": "CR0 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3702", "longitude": "-.099639"}}, "title": "CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252633", "validThrough": "2020-11-09T23:59:59+0000"}