{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-26T10:16:17+0000", "description": "&lt;p&gt;SPA are looking for an energetic, dynamic and ambitious Clinical Advisor to develop into a role which is part of a large and vibrant team. We are looking for someone who is committed to living our Trust Values and becoming part of our ground breaking service which is developing new ways of working in challenging times to further cement our position as a leading integrated healthcare provider.&lt;/p&gt;\n&lt;p&gt;After comprehensive training which is tailored to your learning style with our in-house training staff you will be acting as an autonomous clinician/practitioner, providing a telephone screening and triage service to service users, carers and their referrers resulting in a safe and appropriate clinical decision. You will learn a range of electronic patent record systems, telephony systems, and develop new IT skills to fulfil your role. You will be personable and professional, maintaining a high level of care.&lt;/p&gt;\n&lt;p&gt;The key responsibilities of a Clinical Advisor include, but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitating the provision of accurate health and social care information, self-care / improvement advice or, where applicable, referring to the appropriate level and location of care, in order to meet the holistic and therapeutic requirements of the service user.&lt;/li&gt;\n&lt;li&gt;Staffing our GP telephone hotline service to provide priority mental health advice to surgeries across Hertfordshire&lt;/li&gt;\n&lt;li&gt;Ensuring the privacy of the service user and carer’s interests and wellbeing at all times including service user/carer confidentiality, under the supervision of senior clinicians&lt;/li&gt;\n&lt;li&gt;Reporting all complaints, accidents and incidents in accordance with agreed policies and statutory requirements, and complying with the appropriate regulatory body and within ethical, legislative and organisational frameworks.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you’re looking for a flexible work life balance and being part of a supportive team within Single point of access, then this is the place for you. We also recognise the amazing work you do and also offer some home remote working to provide further flexibilities.&lt;/p&gt;\n&lt;p&gt;Whilst it is a challenging period for the NHS and this is a challenging role, there has never been a more exciting time to join SPA and HPFT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKeira GarforthJob titleClinical Team LeaderEmail addresskeira.garforth1@nhs.netTelephone numbern/aAdditional contact information&lt;/p&gt;\n&lt;p&gt;Please email in the first instance to arrange an informal chat regarding this post&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Keira Garforth - Clinical Team Leader - keira.garforth1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "99 Waverley Road, St Albans", "postalCode": "AL3 5TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7621", "longitude": "-.345255"}}, "title": "Clinical Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241965", "validThrough": "2020-11-09T23:59:59+0000"}