{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "436826", "minValue": "436826", "unitText": "YEAR", "value": "up to £436,826 per annum DOE"}}, "datePosted": "2020-10-23T14:24:50+0100", "description": "&lt;h1&gt;Break into Prison Healthcare!&lt;/h1&gt;\n&lt;p&gt;A new career opportunity has arisen for a Primary Care Nurse Nurse role in HMP Wormwood Scrubs.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Are you ready for a change in direction and new challenge?&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Could you transfer your clinical skills and knowledge into the prison setting?&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Do you want support and development opportunities in an innovative environment?&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Are you passionate about providing safe and effective care?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;This is a unique opportunity to provide nursing care within the Prison setting. The post involves working within an establishment that has five main wings A – E plus a number of smaller units, a First Night Centre, a Healthcare Centre and a Drug Detox Unit.&lt;/p&gt;\n&lt;p&gt;There is a mix of shared and single accommodation throughout the establishment. &lt;br /&gt;Working in prison can be challenging but also very rewarding, interesting and stimulating. Working within a prison primary care environment will develop your clinical, professional and personal strengths. We deliver a variety of healthcare interventions to the men in the establishments including triage, management of minor illness and injury, long term conditions management, acute and chronic wound management, health promotion activity, sexual health clinics and vaccinations and screening programmes. Other services include GP sessions, Opticians, physiotherapy, podiatry, dental clinics, drug and alcohol services and mental health services. If you are interested in every day being different, working in prison with a complex population will provide a stimulating work environment.&lt;/p&gt;\n&lt;h1&gt;About the job...&lt;/h1&gt;\n&lt;p&gt;Nursing in prison is never dull or predictable. On any given day you will be supported to deliver a variety of nursing intervention from health promotion to emergency care, vaccination to wound care, long term conditions to emotional support and managing substance misuse clients. It is this variety that keeps things fresh and stimulating. Every day will bring new challenges and experiences, at the same time you will have all the support and training you need to deliver the best care possible.&lt;br /&gt;&lt;br /&gt;You can expect to be involved in all aspects of the primary care delivery service. You will carry out and contribute to the development of nurse-led services.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Job Requirements... &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be a qualified Registered Nurse – Adult (RGN) with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourages new ideas and opinions on how to improve the service.&lt;br /&gt;&lt;br /&gt;If you are self-motivated and able to work autonomously, a good team player as well as showing plenty of initiative when it comes to handling a wide range of situations, then we look forward to welcoming you to our team.&lt;/p&gt;\n&lt;h1&gt;About Practice Plus Group...&lt;/h1&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;h1&gt;Further Job Information..&lt;/h1&gt;\n&lt;p&gt;We welcome informal visits by appointment so please do contact us for more information and to arrange this.&lt;br /&gt;&lt;br /&gt;This is a full time role, working 37.5 hours per week on a rota basis.&lt;br /&gt;This role has the possibility of Part time hours and Job Share.&lt;br /&gt;&lt;br /&gt;The salary for this role is up to £36,826 per annum - dependent on experience. We also offer training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, access to bank hours, CPD, re-validation, cycle to work scheme, free on-site parking and free use on the on-site gym and low-cost meals in the on-site staff cafe.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;Please note that that role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W12 0AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.516", "longitude": "-.240459"}}, "title": "Primary Care Nurse - HMP Wormwood Scrubs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240910", "validThrough": "2020-11-06T23:59:59+0000"}