{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-26T11:55:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Surgical Wards | Band 5 | Slough | Full Time and Part Time | Fully Funded Training&lt;/strong&gt; &lt;strong&gt;Programs &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Thames Valley Hospital is looking for a Surgical Staff Nurse to join our dynamic and forward thinking nursing team and benefit from the fully funded training programs. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be part of the nursing team looking after orthopaedic surgical patients, plastic surgery, breast surgery and other surgical procedures. If you are a dynamic nurse wanting to expand your skills, than this position is for you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Thames Valley located in Slough provides the highest standard of private healthcare to patients from Berkshire and the surrounding areas. The hospital has a 38 bedded ward with 2 theatres, Endoscopy suite and 10 outpatient consultation rooms. Our modern hospital has a full multi-disciplinary medical team onsite.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within a highly supportive team you will be responsible for assessing patient’s health and well-being across a complex and changing caseload on one of our busy surgical wards, assisting in the delivery of care to meet the patient’s needs. You provide basic post-op care such as wound dressing, IVs and drains. You will the opportunity to develop your own knowledge and skills and that of others whilst promoting best practice in health and safety and security.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registered&lt;/li&gt;\n&lt;li&gt;Surgical experience is desirable however not essential, as full training will be provided&lt;/li&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Good team working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Elena Tsoneva on 07921 065 874 or elena.tsoneva@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham", "postalCode": "SL3 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5428", "longitude": "-.572397"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242303", "validThrough": "2020-11-26T23:59:59+0000"}