{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T12:15:58+0000", "description": "&lt;p&gt;GMMH is seeking to appoint one Research Associate to the GM Digital Research Unit.&lt;/p&gt;\n&lt;p&gt;The post-holder will work in the GM Digital Research Unit of Greater Manchester Mental Health NHS Foundation Trust. GM Digital aims to build, develop and evaluate digital technologies to improve mental health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The post will be for a fixed term of 12 months initially.&lt;/p&gt;\n&lt;p&gt;This Research Associate post will support all activities associated with the GM Digital Research Unit, including project delivery, grant application writing and supporting the integration of digital research projects with clinical services. The Research Associate will be digitally-focused supporting a wide range of digital mental health projects. There will be a strong emphasis on Patient and Public Involvement and Engagement (PPIE). The RA will also be involved in coordinating and running our Children and Young Persons’ Digital Research Advisory Group who are central to co-producing both the digital strategy and the research outputs for children and young people’s mental health. The post holder will provide support to the unit’s leadership team in the design and development of innovative digital mental health projects, and in the development of new research grant applications. The post holder will be involved in writing publications and conducting systematic reviews.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to promote the work of the GM Digital Research Unit both across the Trust and with wider stakeholders, delivering lay summaries, presentations, workshops and producing and disseminating materials in a variety of formats.&lt;/p&gt;\n&lt;p&gt;Supervision is provided for all duties from the Co-Directors of the GM Digital Unit and the Research and Innovation team.&lt;/p&gt;\n&lt;p&gt;The post is based in the Rawnsley building, GMMH; with remote working as required during COVID19.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePauline WhelanJob titleCo-director CAMHS.DigitalEmail addresspauline.whelan@manchester.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greater Manchester Mental Health, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "CAMHS Digital Research Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259607", "validThrough": "2020-11-20T23:59:59+0000"}