{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata, per annum"}}, "datePosted": "2020-10-30T14:17:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, dynamic and forward thinking Specialist Physiotherapist with excellent clinical, supervisory and organisational skills to join our expanding regional Intermediate Neurological Rehabilitation Unit.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is the leading Trust for teaching, research and specialist services in the North West of England.&lt;/p&gt;\n&lt;p&gt;The unit is based at Trafford General Hospital and is part of the Greater Manchester Neurological Rehabilitation Network which provides a whole-system neuro-rehabilitation service across Greater Manchester.The AHP multi professional team consists of Occupational Therapists, Physiotherapists, Speech and Language Therapists and Rehabilitation Assistants.&lt;/p&gt;\n&lt;p&gt;You should have proven practical skills in neurological physiotherapy, with competent respiratory skills. You will be expected to participate in the respiratory on call rota. You should have evidence of acute neurological management and rehabilitation skills, multidisciplinary working and experience of complex discharge planning within the NHS.&lt;/p&gt;\n&lt;p&gt;You should be able to demonstrate excellent communication and organisational skills and work effectively as part of a multi-disciplinary team. You will be supporting the current senior staff in the development of services across the region through the Operational Development Network (ODN) to ensure patients receive high quality and equitable rehabilitation. Multi-disciplinary working within the Trust is well-established and students are accepted on placement from several training schools. You will take responsibility for supervising more junior members of staff and students.&lt;br /&gt;&lt;br /&gt;Allied Health Professions Directorate is a dynamic and forward thinking team of dedicated therapists who actively engage in teaching. Training and on-going continual professional development, with opportunities for further education and personal development is encouraged. There will also be regular appraisals with personal learning objectives and supervision from senior staff within the team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be joining the team at an exciting time as Salford Royal (part of the Northern Care Alliance NHS Group) becomes the single provider of inpatient GM Neuro-Rehabilitation services, establishing a single point of access to inpatient services, supporting patients to be cared for closer to home, by reducing time spent in a hyper-acute environment and offering a great career pathway.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy BoyerJob titleSenior Specialist PhysiotherapistEmail addressamy.boyer@mft.nhs.ukTelephone number0161 934 8653Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Amy Boyer, Senior Specialist Physiotherapist (amy.boyer@mft.nhs.uk) Phone: 0161 934 8653 or Susan Bannister, Clinical Lead Therapist (susan.bannister@mft.nhs.uk) Phone: 0161 934 8653 to discuss your interest in this post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trafford General Hospital, Manchester", "postalCode": "M41 5SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4541", "longitude": "-2.37068"}}, "title": "Specialist Physiotherapist - Neurological Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250534", "validThrough": "2020-11-09T23:59:59+0000"}