{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa, Based on Full Time Hours"}}, "datePosted": "2020-10-15T11:15:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Highly Specialist Clinical / Forensic Psychologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary band: &lt;/strong&gt;8a&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Austen House, Loperwood, Southampton, SO40 2TA&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic Highly Specialist Clinical / Forensic Psychologist to work within a new 14-bedded Low Secure inpatient unit for adolescents, which is part of the Specialist Services directorate of Southern Health NHS Foundation Trust. This post provides an exciting opportunity to contribute to the development of a comprehensive and high-quality service for young people aged 12-18 years experiencing a range of complex presenting problems.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post offers close multi-agency and multi-disciplinary working within a new team comprising of Psychology, Family Therapy, Creative Therapy, Occupational Therapy, Consultant Child and Adolescent Psychiatry, Social Work and Nursing. The role will involve the use and development of specialist psychological skills relating to assessment, formulation, intervention and evaluation in order to contribute to the understanding and treatment of psychological distress and risk. There will be opportunities to promote models of care and new ways of working informed by a recovery-based ethos, as well as attachment theory and developmental perspectives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A key aspect of the role will involve the promotion of a psychologically-informed environment via consultation, training, teaching and reflective practice. Opportunities for direct clinical work with young people and the systems around them within individual and group settings, and to offer supervision to colleagues, will also be available. An active engagement with activities of continuing professional development and research activities to support audit, policy and service development is also encouraged. Clinical, operational and professional supervision is provided by the Principal Clinical Psychologist for the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Austen House is based on the edge of the New Forest in a tranquil rural setting but within a few miles of the city of Southampton, which provides excellent transport links.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed. Please contact Dr Jemma Reynolds (Principal Clinical Psychologist) via jemmareynolds@nhs.net for more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Austen House, Southampton", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Highly Specialist Clinical / Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227898", "validThrough": "2020-11-27T23:59:59+0000"}