{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £79,860-£107,668"}}, "datePosted": "2020-10-21T15:16:05+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant Paediatric Radiologist &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to an upcoming retirement of one of our colleagues, we are looking for an outstanding Colleague wishing to actively support the Paediatric Radiology department at RACH/ BSUH, and contribute to the expanding MSK, oncology and paediatric neuroradiology workload. There are many opportunities provided by working in an Acute Teaching Hospital with a strong commitment to clinical excellence, teaching and research and high quality patient experience. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will contribute to a 1:5 (weeks) Paeds oncall rota and experience in leading and delivering procedures as intussusception reduction and malrotation are essential. Additional sub-speciality interests will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Brighton and Sussex University Hospitals is the regional teaching hospital, providing general acute services to Brighton and Hove, and tertiary services for patients across Sussex and the South East of England.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sussex is also a great location to live near to the London Gatwick airport, seaside and South Downs with excellent schools nearby and also easy commuting distance to London for partners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please refer to the person specification in the job description with regards to CCT requirements.&lt;/p&gt;\n&lt;p&gt;When completing the application form please ensure you complete the section relating to your CCT date. If you have already have your CCT please confirm when you will be on the GMC Specialist Register. Please be aware you only have 12 months from your CCT to join the specialist registrar otherwise you will have to go thorugh the CESR Route.&lt;/p&gt;\n&lt;p&gt;In addition to supplying us with your referee details for the last 3 years please also provide us with the contact details of your Responsible Officer for Appraisal and Revalidation&lt;/p&gt;\n&lt;p&gt;In the interest of equal opportunities, we want to make sure that information about candidates is provided in the same format so all applicants should fill in the standard application form on the NHS Jobs website and attach their cv.&lt;/p&gt;\n&lt;p&gt;Please be aware that candidates will be informed by email of the outcome of their application&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date 22 November 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NO AGENCIES&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Kyriakos IliadisJob titleLead Consultant Paediatric RadiologistEmail addressKyriakos.iliadis@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Sabina Dizdarevic, Principle Lead Consultant for Imaging Services&lt;/p&gt;\n&lt;p&gt;Sabina.dizdarevic@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Alexander Children&#39;s Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Consultant Paediatric Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237044", "validThrough": "2020-11-22T23:59:59+0000"}