{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-04T14:15:58+0000", "description": "&lt;p&gt;Paediatric Staff Nurse or ODP –Adolescents, Theatres, Cardiac, Cath Lab.&lt;/p&gt;\n&lt;p&gt;Are you an experienced staff nurse ready to take the next step in your career? Or are you a staff nurse looking for a new challenge in a supportive environment? Are you caring, compassionate and motivated?&lt;/p&gt;\n&lt;p&gt;Within a Trust that has been recently awarded ‘Outstanding’ by the CQC, Bristol Royal Hospital for Children (BRHC) is one of the most established and cutting-edge Children’s Hospitals in the UK.&lt;/p&gt;\n&lt;p&gt;We are located in the centre of the beautiful city of Bristol, which has been voted best place to live. It is bursting with character and provides the perfect work-life balance.&lt;/p&gt;\n&lt;p&gt;This is your opportunity to join us on our journey and become a part of our talented and passionate team.&lt;/p&gt;\n&lt;p&gt;We currently have vacancies for nurses with at least 12 months experience in the following areas:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dolphin Ward (Cardiac)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dolphin is our specialist cardiac ward. We have 16 beds, 5 of which are based within our specialist high dependency unit. We care for patients from the age of 0 up to 18 years old. We are a specialist children’s cardiac centre, providing care across the south west of England and Wales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apollo 35 (Adolescents)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Apollo 35 is our adolescent unit which has been specifically designed for young people aged 11 – 16 with a variety of medical, mental health, oncological and surgical conditions. On this ward we have 14 beds as well as activity and breakout rooms for teenagers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Theatres – Paediatric Catheter Laboratory &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have an opportunity to join our paediatric catheter lab team within our Paediatric Theatres department. We are the regional congenital heart centre and provide a comprehensive congenital cardiology and cardiac surgical service for patients in the south west of England as well as a cardiac surgical service to south Wales. We encourage applications from nurses and ODPs and no cardiac catheterisation lab experience is necessary for this role, as training will be provided by our dedicated education team who will provide a comprehensive local induction programme. We encourage and support training and development opportunities for all of our staff, and with interest can offer skill development in a broader range of surgical specialities and patient recovery across the department.&lt;/p&gt;\n&lt;p&gt;Please specify which area you would like to interview for in your application. We are currently holding interviews virtually with an option for an informal phone call first.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The ideal candidate for the role will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be able to develop their clinical skills and participate in continuing their professional development&lt;/li&gt;\n&lt;li&gt;Have experience in solving problems and using their initiative&lt;/li&gt;\n&lt;li&gt;Be able to communicate and work together in a multidisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work you will receive the following benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working within an internationally renowned Children’s Hospital&lt;/li&gt;\n&lt;li&gt;Opportunities for education and development&lt;/li&gt;\n&lt;li&gt;Our own Faculty of Children’s Nurse Education&lt;/li&gt;\n&lt;li&gt;Minimum of 262.5 hours holiday per annum (increasing with length of service)&lt;/li&gt;\n&lt;li&gt;Industry leading pension scheme&lt;/li&gt;\n&lt;li&gt;Access to discounts in a multitude of local and national outlets.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are supported by two proactive charities, Above and Beyond and The Grand Appeal. The Grand Appeal’s Gromit Unleashed 2 Trail held in the south west which has raised substantial funds for clinical services. The city of Bristol is frequently voted a top destination in the UK and Europe to live and visit. There has never been a better time to relocate to and explore the beautiful and vibrant city of Bristol.&lt;/p&gt;\n&lt;p&gt;Apply today as this vacancy will close when we receive a suitable number of applications. For more information, or to organise an informal conversation please email W&amp;Crecruitment@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressW&amp;Crecruitment@uhbw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Hospital for Children, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Paediatric Staff Nurse or ODP –Adolescents, Theatres, Cardiac, Cath L", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256183", "validThrough": "2020-11-30T23:59:59+0000"}