{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87034", "minValue": "76130", "unitText": "YEAR", "value": "£76,130 - £87,034 per annum"}}, "datePosted": "2020-10-22T16:54:56+0100", "description": "&lt;p&gt;&lt;strong&gt;We are recruiting to exciting opportunities that have arisen for 2 appointments as a Consultant in Public Health on 12 month Fixed Term Contracts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join an innovative, multi award-winning team and lead it to further success.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be ready to work hard and have fun with the job. You will be outgoing, energetic and creative. We will look to you to come up with new ideas and make them a reality.&lt;/p&gt;\n&lt;p&gt;Responsibilities will include playing a central role in our response to COVID-19 and leading a variety of community-based health improvement programmes. However, we’ll always try to design your job to suit your interests.&lt;/p&gt;\n&lt;p&gt;A good track record of working at a senior level in local government, managing staff and working across a broad range of public health areas will be a clear advantage.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be&lt;strong&gt;registered as Specialists with the UKPHR or be within 6 months of registration.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Dr Lisa McNally, Director of Public Health onlisa_mcnally@sandwell.gov.uk&lt;/p&gt;\n&lt;p&gt;Our Values;&lt;strong&gt;Trust&lt;/strong&gt;,&lt;strong&gt;Unity&lt;/strong&gt;and&lt;strong&gt;Progress&lt;/strong&gt;make us unique, they define how we do things and are reflected in the way we behave.They are important to us, guiding and shaping our organisational culture. Our values are key to us achieving Sandwell’s Vision 2030 and also guide us when we recruit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;37 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This advert will close as soon as sufficient applications are received. Therefore, you are strongly advised to complete and return your application as soon as possible.When completing your application please refer to the supporting documents attached.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have a disability and require assistance in making an application, or have experienced a problem whilst applying for a position, please contact the Resourcing Team on 0121 569 3300 or via e-mail to:hr_resourcing@sandwell.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sandwell Metropolitan Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldbury", "postalCode": "B69 2AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5036", "longitude": "-2.01621"}}, "title": "Consultant in Public Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239434", "validThrough": "2020-11-11T23:59:59+0000"}