{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-30T12:16:20+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an opportunity to take your potential further in an NHS Trust that’s as passionate as you are about providing excellent patient care – and that will be just as passionate about giving you exceptional scope for professional development. It’s an&lt;/p&gt;\n&lt;p&gt;opportunity to live and work in Kent, a county with a spectacular coastline, gentrified seaside towns, a historic cathedral city and mile upon mile of beautiful countryside.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently looking for a Specialty Doctor in Urology at Kent and Canterbury Hospital to support and learn from our Consultant teams in our innovative and progressive department. We have ten consultants, supported by, staff grades and specialist registrars. As a University teaching hospital, we also have Core Training and Foundation doctors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We embrace innovation, being the proud owners of a DaVinci Robot, and performing extensive laparoscopic surgery. There is a large stone work-load with an on-site lithotripter. We are also a cancer centre, which includes rapid access diagnostic services. We have a dedicated Urology ward, supported by an excellent team of nursing and specialist nursing staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We provide comprehensive urology services from Canterbury, together with out-patient and diagnostic services at peripheral sites, and are a key department within the Surgery &amp; Anaesthetics Care Group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Kent &amp; Medway Medical School (KMMS) opens its doors in September 2020, offering 100 undergraduate medical places on a yearly basis. The five year programme will be taught at the Canterbury campuses of both universities with medical placements within Primary, Community and Secondary Care across Kent and Medway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;KMMS will be Kent and Medway’s first ever medical school, bringing together the existing centres of excellence in health and medical education provided by the two universities, and local healthcare organisations such as East Kent Hospitals University Foundation Trust. It will offer a new model of patient-focused medical education.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;KMMS will also play a key part of the solution to the challenges of recruiting and retaining medical professionals for this region. You will have the chance to be there at the start of what is expected to be an exciting and productive relationship and help to shape the Drs of the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be a part of our expanding and innovative service, you must have completed at least 4 years postgraduate training, two of which will be in a relevant training programme. This post commences as soon as possible and will be offered as a permanent position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are training opportunities within the post to develop either general or sub-specialty skills in urology.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;East Kent offers good housing and schools, beautiful surrounding countryside and incredible beaches. We are within easy reach of London, the Channel Tunnel and airports, with the rail link via Ashford taking just 35 minutes to London and 2 hours to Paris!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmber Howlett&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Specialty Doctor in Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250112", "validThrough": "2020-11-13T23:59:59+0000"}