{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 (pre-CCT) / £52,036 (post-CCT)"}}, "datePosted": "2020-11-04T16:01:00+0000", "description": "&lt;p&gt;Applications are invited for the posts of Clinical Fellow (Higher/Senior) in Radiology at Cambridge University Hospitals NHS Foundation Trust (CUH).&lt;/p&gt;\n&lt;p&gt;We have two posts available:&lt;/p&gt;\n&lt;p&gt;Post 1: Available to commence from 04 January 2021 until 03 August 2021&lt;/p&gt;\n&lt;p&gt;Post 2: Available to commence from 01 February 2021 until 03 August 2021&lt;/p&gt;\n&lt;p&gt;The duties of these posts include:&lt;/p&gt;\n&lt;p&gt;On-call: participation in a 1 in 11 Senior Resident on-call (subject to change) responsible for performing and reporting all emergency radiology investigations including head, chest and body CT, US plain film and fluoroscopy. The working week comprises 5 service and 5 sub-specialty sessions.&lt;/p&gt;\n&lt;p&gt;Service sessions: reporting chest and body CT, hot seat plain film reporting, general US and presentation at Clinico-radiological meetings.&lt;/p&gt;\n&lt;p&gt;Sub-specialist interest sessions: The successful candidate will have the opportunity to obtain training in a sub-specialist interest which may including Cardiac and Chest, Gastrointestinal Radiology, Uroradiology, Gynaecological Radiology, General Oncology or a combination of the above.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The specialty sessions are flexible but the following are examples of sub-specialty experience which may be available depending on the needs of the Service:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This timetable will be flexible and chosen by the candidate to include sub-specialist reporting sessions as well and multidisciplinary team meetings.&lt;/p&gt;\n&lt;p&gt;In order to be considered applicants must meet the essential criteria stated in the job description and have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Completed a minimum of three years of training as a Specialty Registrar in Radiology or equivalent and hold the FRCR.&lt;/li&gt;\n&lt;li&gt;Full registration and a Licence to Practice with the General Medical Council at time of application.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that these posts do &lt;strong&gt;not &lt;/strong&gt;carry Postgraduate Dean’s approval or training recognition.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC licence to practice.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please note that due to high volume of applications for some posts, this post may close before the displayed closing date. We recommend that you apply for this role as soon as possible.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries about this post should be addressed to Dr Justin Cross, Programme Director for Radiology at justin.cross@addenbrookes.nhs.uk or via telephone on 01223 216910.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Fellow (Higher/Senior) in Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256537", "validThrough": "2020-11-20T23:59:59+0000"}