{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-06T10:30:54+0000", "description": "&lt;p&gt;The Directorate of Anaesthesia at Manchester NHS Foundation Trust has an exciting opportunity for a high quality candidate to join the obstetric anaesthesia team as a locum consultant.&lt;/p&gt;\n&lt;p&gt;You should have a strong background in general and obstetric anaesthesia, with demonstrable experience in successful working in a tertiary obstetric unit that accommodates the care of adult congenital heart disease parturients. You should have a track record of delivering high quality research, preferably involving national projects.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is one of the largest acute Trusts in the UK, employing over 20,000 staff and responsible for running a family of nine hospitals across six separate sites. The Trust provides a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;The Trust is the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;There is an opportunity for Anaesthetists to work across a wide range of surgical specialties in the Trust. The Division of Anaesthesia, Critical Care and Preoperative Medicine consists of nearly 170 consultants and the scale of the service across a number of hospital sites provides significant subspecialisation and the opportunity to develop within a particular area of interest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul HannahAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Andrew Heck, Clinical Director of Obstetric Anaesthesia (0161 276 4551) for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road Campus, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Locum Consultant Anaesthetist with interest in Obstetric Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259217", "validThrough": "2020-11-19T23:59:59+0000"}