{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on Experience"}}, "datePosted": "2020-11-04T13:54:40+0000", "description": "&lt;p&gt;Ramsay Health Care’s Woodland Hospital in Kettering, Northamptonshire has a vacancy for a MRI Radiographer – 30 hours Contract to join their team of staff in the Radiology department. This is a FULL time role to assist in the provision of radiology services for the hospital.&lt;/p&gt;\n&lt;p&gt;As one of Northamptonshire’s leading private and NHS “Choose &amp; Book” hospital, The Woodland Hospital is at the forefront of medical technology and patient care. If you are excited about pushing your ability to the next level, whilst at the same time becoming part of a friendly team renowned for excellence and exceptional patient satisfaction then the Woodland Hospital is for you.&lt;/p&gt;\n&lt;p&gt;The Woodland Hospital is in the progress of an expansion with the addition of a 4th Theatre, MRI scanner, extra bedrooms and consulting rooms along with a kitchen upgrade and new ward pantry to meet the needs of a busy hospital. The hospital offers a wide variety of specialities and prides itself on providing a high standard of care to both patients and staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Details of the position:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a key member of the department, you will support the Radiology Manager in the provision of radiology services.&lt;/p&gt;\n&lt;p&gt;You will have key relationships with the hospitals departments and will be interacting with Consultants on a daily basis so excellent organisational and communication skill are essential.&lt;/p&gt;\n&lt;p&gt;As a MRI Radiographer you will be part of a close knit innovative team. The successful applicant will have an enthusiastic out look to ensure the delivery of a high diagnostic imaging service.&lt;/p&gt;\n&lt;p&gt;The role will include some non-clinical responsibilities such as ordering stock, audits, booking patients appointments and answering telephone enquiries.&lt;/p&gt;\n&lt;p&gt;The candidate will need to have excellent communication skills, good attention to detail and be flexible with their work patterns.&lt;/p&gt;\n&lt;p&gt;You must have a Diploma form the College of Radiographers or hold a BSc in Radiology and be registered with the HCPC. You must demonstrate strong customer service skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible for the provision of high quality MRI service within financial margins&lt;/li&gt;\n&lt;li&gt;To participate in the provision of a high standard of patient care and treatment&lt;/li&gt;\n&lt;li&gt;Participates as a member of the radiology team in providing a radiographic service throughout the whole of the imaging department&lt;/li&gt;\n&lt;li&gt;Proactive and enthusiastic&lt;/li&gt;\n&lt;li&gt;Articulate&lt;/li&gt;\n&lt;li&gt;Self-motivated&lt;/li&gt;\n&lt;li&gt;Flexible / adaptable&lt;/li&gt;\n&lt;li&gt;Able to prioritise workload&lt;/li&gt;\n&lt;li&gt;Team builder&lt;/li&gt;\n&lt;li&gt;Excellent time management skills&lt;/li&gt;\n&lt;li&gt;Ability to participate in on call rota and work evening / weekends as required&lt;/li&gt;\n&lt;li&gt;Processing radiology bookings&lt;/li&gt;\n&lt;li&gt;RIS/PACS processes&lt;/li&gt;\n&lt;li&gt;Ensuring that the agreed standards of patient care and confidentiality are maintained in accordance with Ramsay policies&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will also hold the following essential qualifications/criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Sound written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Proven ability to work effectively in a team environment and independently as required&lt;/li&gt;\n&lt;li&gt;Flexibility and adaptability to meet the changing needs of the business&lt;/li&gt;\n&lt;li&gt;Demonstrated Customer Service skills&lt;/li&gt;\n&lt;li&gt;Demonstrated Computer Skills&lt;/li&gt;\n&lt;li&gt;Desirables Experience working in a healthcare or hospital environment&lt;/li&gt;\n&lt;li&gt;Must have at least three years of up-to-date MRI experience&lt;/li&gt;\n&lt;li&gt;Evidence of post registration development&lt;/li&gt;\n&lt;li&gt;Desirables – Previous private sector experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary Plus Enhancements (if eligible)&lt;/li&gt;\n&lt;li&gt;33 days annual leave inc bank holidays which increase with service (pro rata)&lt;/li&gt;\n&lt;li&gt;Private Healthcare&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Child Care Vouchers&lt;/li&gt;\n&lt;li&gt;Excellent Training and Development Opportunities&lt;/li&gt;\n&lt;li&gt;Subsidised Staff Restaurant&lt;/li&gt;\n&lt;li&gt;Free on Site Parking&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering", "postalCode": "NN16 8XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4119", "longitude": "-.768808"}}, "title": "MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256084", "validThrough": "2020-11-22T23:59:59+0000"}