{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40869", "minValue": "37722", "unitText": "YEAR", "value": "£37,722 to £40,869"}}, "datePosted": "2020-11-02T16:43:58+0000", "description": "&lt;p&gt;Public Health Officer - Life Chances&lt;/p&gt;\n&lt;p&gt;Waltham Forest is looking for an enthusiastic individual to join our team, focusing on the Council Priority of improving children&#39;s life chances. The Public Health Officer will be responsible for the project management of various projects designed to improve children&#39;s health and wellbeing, and hence the life chances of Waltham Forest residents. This incorporates a number of different public health priorities, ranging from food poverty, improving parenting skills and knowledge around health, addressing youth violence through our public health approach and supporting the Healthy Schools London programme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Waltham Forest&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Waltham Forest is a vibrant, diverse home to approximately 260,000 residents in East London, easily accessible from central London by train and underground, and was the 2019 London Borough of Culture and the MJ Local Authority of the Year. The Public Health team has well developed relationships across the organisation and with partners. Led by the Director of Public Health for Waltham Forest, the team is based in the Families Directorate.&lt;/p&gt;\n&lt;p&gt;The leaders of the borough are firmly committed to public health, and the principles of early intervention and prevention, making this an excellent place to work in collaboration to achieve genuine improvements for residents. Improving Life Chances, with a strong focus on children and young people, has been a key priority locally, and remains so as we look to adjust locally to a world affected by COVID-19.&lt;/p&gt;\n&lt;p&gt;We are also a team committed to providing a stimulating environment within which to work, running monthly reflective practice sessions, journal clubs and providing opportunities for personal development through training, education, shadowing and on-the-job learning.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Examples of discreet projects the Officer may take forward include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting local work to improve parent’s knowledge and skills, especially at the point of transition to secondary school&lt;/li&gt;\n&lt;li&gt;Promote and support the Healthy Schools London programme&lt;/li&gt;\n&lt;li&gt;Supporting public health projects that arise through the Violence Reduction Partnership&lt;/li&gt;\n&lt;li&gt;Improving uptake of Healthy Start vouchers locally&lt;/li&gt;\n&lt;li&gt;Taking forward actions within the local Food Poverty action plan&lt;/li&gt;\n&lt;li&gt;Improving awareness of the community and voluntary sector offer around children&#39;s mental wellbeing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post will sit within the Public Health Team but will involve working closely with other departments in the Families Directorate and external project partners.You will work in co-operation with other colleagues within Public Health as well as other key council directorates to deliver against the Life Chances agenda. Further to this you will work with a range of external stakeholders including schools, the NHS and voluntary sector partners and will need to establish and maintain a wide range of working relationships. You will need to develop a good understanding of the context of services in the borough which impact on health and health inequalities of children and young people.&lt;/p&gt;\n&lt;p&gt;We invite applications from individuals who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have strong project management skills and experience of delivering and supporting public health initiatives, particularly in schools and other educational settings.&lt;/li&gt;\n&lt;li&gt;Are skilled at managing relationships and negotiating across a wide range of organisations&lt;/li&gt;\n&lt;li&gt;Understands the challenges faced by schools, local authorities and the Health Service&lt;/li&gt;\n&lt;li&gt;Have experience working on projects related to improving children’s health&lt;/li&gt;\n&lt;li&gt;Who will contribute positively to the work of our dynamic public health team.&lt;/li&gt;\n&lt;li&gt;Ideally the person will be familiar with working in Waltham Forest or a borough with a similar demographic profile.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Your application should set out how you meet the role and person specification.&lt;/p&gt;\n&lt;p&gt;For further information please contact Catherine Hutchinson, Senior Public Health Strategist on: catherine.hutchinson@walthamforest.gov.uk&lt;/p&gt;\n&lt;p&gt;We reserve the right to close any vacancies from further submissions, when we have received sufficient applications from which to make a shortlist. Please ensure you apply without delay if you wish to be considered for this role. If you have not heard from us within 6 weeks from the closing date please assume your application has been unsuccessful.&lt;/p&gt;\n&lt;p&gt;London Borough of Waltham Forest values and respects the diversity of its employees, and aims to recruit a workforce which reflects our diverse communities. We welcome applications irrespective of people&#39;s age, disability, gender, race or ethnicity, religion or belief, sexual orientation, or other personal circumstances. We have policies and procedures in place to ensure that all applicants are treated fairly and consistently at every stage of the recruitment process.&lt;/p&gt;\n&lt;p&gt;Waltham Forest Council is committed to safeguarding children, young people, and vulnerable adults.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Borough of Waltham Forest", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129677"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E17 4JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5912", "longitude": "-.013507"}}, "title": "Public Health Officer - Life Chances", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252907", "validThrough": "2020-11-08T23:59:59+0000"}