{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-26T10:46:37+0000", "description": "&lt;p&gt;Experienced Staff Nurse positions are available with Support and Development as appropriate.&lt;/p&gt;\n&lt;p&gt;Due to service expansion and development a number of opportunities have arisen for Experienced 1st Level NMC Registered Nurses to join our team at Glenfield Hospital working as a Staff Nurse in the Clinical Decisions Unit (CDU).&lt;br /&gt;&lt;br /&gt;An interest in Acute Cardiac or Respiratory care or Acute Admissions is essential, however all training including a full induction will be provided therefore prior experience of the speciality is desirable but not essential. &lt;br /&gt;&lt;br /&gt;The CDU at Glenfield Hospital is a 27 bedded, fully monitored ward, with a recently expanded and improved Triage Area. Unique to other Admission Units nationally, patients are admitted direct via ambulance, Urgent Care Centre, Emergency Department Referral and GP referral with a range of cardiac and respiratory conditions. It also takes acute admissions from within Glenfield Hospital and serves as our emergency flow hub and communication centre; CDU is a demanding, but very rewarding area to work in.&lt;br /&gt;&lt;br /&gt;As a Staff Nurse working in CDU you will have the opportunity to learn about acute care, additionally many opportunities for further development exist within this large unit.&lt;br /&gt;&lt;br /&gt;CDU is part of the wider Renal, Respiratory, Cardiac and Vascular management group (RRCV). Glenfield Hospital (GH), is RRCV’s main administrative site and is located approximately three miles from Leicester City Centre on a spacious campus. This site will eventually be the hub of all speciality acute services in Leicester.&lt;br /&gt;&lt;br /&gt;The campus has its own emergency ambulance bay and helipad, modern speciality theatres and intensive care units are also based on this site. GH campus is a regional centre for clinical research with both Respiratory and Cardiac Biomedical research units based here and has close links with both the University of Leicester and DeMontfort University.&lt;br /&gt;&lt;br /&gt;To see some of our staff at work at Glenfield Hospital please search for &#39;Glenfield Shine&#39; on Vimeo.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Sibbick or Karen Vann, Sisters, CDU. Telephone number 01162583359&lt;br /&gt;Or Ben Hyde, RRCV recruitment lead 0116 2583176 or 07908235983&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSue SibbickJob titleSisterEmail addresssue.sibbick@uhl-tr.nhs.ukTelephone number01162583359&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glenfield Hospital, Leicester", "postalCode": "LE3 9QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6537", "longitude": "-1.1793"}}, "title": "Staff Nurse Glenfield Hospital Clinical Decisions Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242044", "validThrough": "2020-11-16T23:59:59+0000"}