{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 per hour"}}, "datePosted": "2020-11-04T13:53:01+0000", "description": "&lt;p&gt;The NHS needs you now more than ever. We are looking for Cleaner (Domestic Assistant). As a mobile team member, you will support a number of sites in the local area and will need to be flexible and travel, you will be required to cover sites across Southampton and the surrounding areas.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our people are working hard behind the scenes to provide safe, clean, well maintained environments for patients and their NHS colleagues during this challenging time. They are the #HiddenHeros and we need more of them. You will become part of a team who are passionate about supporting the NHS and its people in their vital work by keeping premises clean and safe.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have a driving licence and access to a vehicle to be able to support a number of sites&lt;br /&gt;On our Bank team you will be offered a range of shifts to suit your lifestyle, these vary from part time to full time hours with some early starts, evening works and day time shifts up to 7 days a week.&lt;/p&gt;\n&lt;p&gt;Salary and benefits&lt;br /&gt;• £9.21 Per Hour &lt;br /&gt;• Plus, up to 50% premium for early, late and weekend hours &lt;br /&gt;• Excellent holidays – 27 days plus public and bank holidays &lt;br /&gt;• Life assurance, income protection, personal accident cover and an employee assistance programme in addition to many other benefits.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Where would you work?&lt;br /&gt;You will cover sites across Southampton and the surrounding areas. &lt;br /&gt;What hours would you work? &lt;br /&gt;Variety of hours per week, with various shift patterns and start times throughout the day from early starts to late afternoons, Monday to Sunday&lt;/p&gt;\n&lt;p&gt;What would you do? &lt;br /&gt;• You will be responsible for ensuring a clean environment for patients by; vacuum cleaning; mopping; dusting, cleaning mirrors, baths, showers, sinks, toilets, washing of tiled surfaces and paintwork; walls and ceilings; emptying and cleaning bins and making sure paper towels; toilet tissue; hand soap dispensers. &lt;br /&gt;• If you are working in a ward you will usually have additional duties such as washing up and cleaning the kitchen, helping to serve food and drinks and some laundry duties.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;What experience and skills do you need? &lt;br /&gt;• You do not need to have any experience as full training and support will be provided&lt;br /&gt;• We are looking for people who have the right values and want to make a difference &lt;br /&gt;• You will need to have good basic level of English because you may need to speak to patients, visitors and staff in a healthcare environment as well as reporting any issues, ensuring that you understand your training and can carry out all policies and procedures and able to keep accurate records.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;What are we looking for? &lt;br /&gt;• You will do a great job in the right way &lt;br /&gt;• You will deliver the best cleanliness standards for NHS Patients, staff and visitors &lt;br /&gt;• You will work hard, be a great team ambassador and bring energy to everything you do&lt;br /&gt;• You will join a team who are committed to promoting equal opportunities and diversity – we welcome people who want to contribute to our inspiring and inclusive workforce.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;What do you need to think about before applying?&lt;br /&gt;• This role is physically demanding, and you will be moving/using equipment and furniture, stretching, reaching, bending and doing lots of repetitive movements&lt;br /&gt;• You will also be exposed to dirt, dust and smells&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127515.png", "name": "NHS Property Services Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127515"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 0YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9124", "longitude": "-1.39707"}}, "title": "Cleaner (Domestic Assistant) Bank - Southampton &amp; Surrounds", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256079", "validThrough": "2020-11-11T23:59:59+0000"}