{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 AFC unsocial hours payments"}}, "datePosted": "2020-11-03T14:47:00+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen to apply for the Lead Renal Pharmacist for renal medicine and renal transplant at Manchester Royal Infirmary.&lt;/p&gt;\n&lt;p&gt;Manchester Royal Infirmary (MRI) is the centre providing comprehensive renal care for approximately 1.4 million people living in and around Manchester Services provided at MRI includes outpatient, inpatient, pre-dialysis, peritoneal dialysis, haemodialysis, Lipid aphaeresis and ABO transplantation. The renal department is also a partner in the regional kidney/pancreas transplantation unit also based at MRI, which performs over 200 transplants per year. Our renal pharmacy team support the prescribing for the majority of the renal transplant patients in clinic settings which are now being converted to virtual clinics.&lt;/p&gt;\n&lt;p&gt;We provide highly specialist pharmacist services to Inpatient facilities together with the haemodialysis unit, outpatient, peritoneal dialysis and Continuous Ambulatory Peritoneal Dialysis (CAPD) training unit, the department manages over 100 renal failure patients per year. Maintenance haemodialysis is provided at MRI (29 stations) and in satellite units (spokes) An increasing number of patients also undertake haemodialysis in their own homes. In addition, the directorate manages around 90 peritoneal dialysis patients.&lt;/p&gt;\n&lt;p&gt;The renal multidisciplinary team see patients with general nephrology problems, metabolic bone disease, diabetic nephropathy, glomerular disease, critical care nephrology, Vaculitis, antenatal and renal transplantation. The department is actively involved in a variety of clinical and basic science research projects. The Manchester Institute of Nephrology and Transplantation (MINT) co-ordinate research.&lt;/p&gt;\n&lt;p&gt;Manchester University Hospital Foundation Trust (MFT) which is one of the biggest, most ambitious and progressive NHS Trusts in the country. MFT is responsible for running a family of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our vision is to improve the health and quality of life of our diverse population by building an organisation that:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excels in quality, safety, patient experience, research, innovation and teaching&lt;/li&gt;\n&lt;li&gt;Attracts, develops and retains great people&lt;/li&gt;\n&lt;li&gt;Is recognised internationally as a leading healthcare provider&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post requires highly specialist clinical knowledge, excellent and demonstrable leadership experience, and a track record of managing change and innovation. The individual will have a keen interest in managing high cost medicine budgets and leading research initiatives within the team. You must have excellent communication and interpersonal skills with the ability to work as part of a team whilst also leading by example You must be able to manage and motivate others and have the ability to influence the multidisciplinary team and engage with key stakeholders.&lt;/p&gt;\n&lt;p&gt;Please note the Interviews will be held via Teams on 24th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAdele TorkingtonJob titleClinical Services ManagerEmail addressAdele.torkington@mft.nhs.ukTelephone number0161 701 5980&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road Campus, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Lead Pharmacist - Renal Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254410", "validThrough": "2020-11-10T23:59:59+0000"}