{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T11:02:18+0000", "description": "&lt;p&gt;Sussex Partnership is about the people. The people we work for, the people we work with and the people we want to become. We want to create the right job for you that not only provides a service but works with your interests.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Research&lt;/strong&gt; – Are you looking to further or start your research? We have Research Assistants embedded within teams and have access to leading edge technology to support you with this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education&lt;/strong&gt; – Are you interested in taking students on placement or getting involved with teaching? We have strong links with Brighton and Sussex Medical School.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Support &lt;/strong&gt;– Are you looking for opportunities to work flexibly or work in teams that understand and support each other? We appreciate how caring our staff are and recognise the importance of caring about you too.&lt;/p&gt;\n&lt;p&gt;The Trust is seeking a consultant psychiatrist to join the integrated adult and functional older adult inpatient team at Langley Green Hospital, Crawley. The unit serves the population of Horsham, Crawley, Haywards Heath, East Grinstead and Burgess Hill.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly and supportive multidisciplinary ward team that consists of a Specialty Doctor, Junior Doctor, Matron, Nurse, Support Workers, OT’s and more. The ward team is also supported by additional resources such as ‘The Early Discharge Team’. The day hospital within the building also adds to the resource for patients admitted to the ward post-discharge.&lt;/p&gt;\n&lt;p&gt;The Trust strives to maximise clinical time for doctors so you will benefit from an assigned 0.5 WTE of direct admin support, as well as an established administrative support service who work for the whole team.&lt;/p&gt;\n&lt;p&gt;You will join a medical advisory committee consisting of Psychiatrists in the North West Sussex (Consultants and SAS doctors) who meet monthly to discuss service needs and issues at a local level. In addition to this there are established consultant peer groups which you will be encouraged to join.&lt;/p&gt;\n&lt;p&gt;The Trust operates a QI methodology which is encouraged to be used by all staff. This post is one example of the commitment of the Trust to develop better provision and capacity for Langley Green hospital and the families and carers using the service. There are also opportunities to use SPA time for teaching or clinical and other basic research through Sussex University and Brighton and Sussex Medical School.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership is committed to participation, meaning that we involve patients and their carers and supporters, in service decision-making and planning. You will be expected to contribute to this shared value and to support the functioning of this service in the delivery of its participation strategy.&lt;/p&gt;\n&lt;p&gt;Not decided yet or want to discuss your individual interests in working at Sussex Partnership then please pick up the phone and talk to us! We want to hear your thoughts and ideas on how our jobs can work for you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Claire Tanner &lt;/span&gt;&lt;span&gt;07710 977985 or Claire.Tanner@sussexpartnership.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Langley Green Hospital, Opal Ward, Crawley", "postalCode": "RH11 7EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": "-.188818"}}, "title": "Consultant Psychiatrist - Older Adult Inpatient", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244131", "validThrough": "2020-11-17T23:59:59+0000"}