{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 per annum pro rata"}}, "datePosted": "2020-10-29T10:15:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Therapy Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Team Lead Occuaptional Therapist for the Treatment Centre Elective Hand and Rheumatology Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Nottingham Treatment Centre is based at the Queens Medical Centre and provides care for a range of services, including the elective hand and rheumatology service.&lt;/p&gt;\n&lt;p&gt;Due to the current post holder moving on to a new post within NUH Therapies, we have the exciting opportunity for a dynamic self-motivated experienced Occupational therapist to join the Treatment Centre (TC) team, to provide team leadership to the TC OT team and clinical leadership to the elective hand and rheumatology service. Initially, this is on a fixed term or secondment basis, with a view to being made permanent after 12 months&lt;/p&gt;\n&lt;p&gt;This post will have both a leadership and clinical role. The post holder will be responsible for scoping and developing the TC Elective Hand and Rheumatology OT service, and developing OT interventions into outpatient clinics as well as overseeing the inpatient caseloads.&lt;/p&gt;\n&lt;p&gt;If you have a broad range of clinical skills including experience in working in muscoloskeletal service, splinting and bracing skills, and leadership experience, then this is the post for you. Although this is a part time position the ability to work flexibly to cover clinics and develop the service is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have regular appraisals and professional support including training as identified. This is an opportunity to help further develop the Occupational Therapy Service in the acute setting, working in partnership with colleagues to develop the MSK service and lead the OT team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLiz WeedonJob titleTeam Lead OT - Treatment CentreEmail addresselizabeth.weedon@nuh.nhs.ukTelephone numberext. 23058&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Occupational Therapy Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247872", "validThrough": "2020-11-12T23:59:59+0000"}