{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T10:31:46+0000", "description": "&lt;p&gt;&lt;strong&gt;STAFF NURSE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;URGENT CARE ADULT MENTAL HEALTH (INPATIENT) SERVICES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HALLAM STREET HOSPITAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 HOURS PER WEEK (ROTATIONAL SHIFT PATTERNS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Early shift 07:00-15:00hrs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Late shift 12:00-20:00&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Night shift 19:30-07:30&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Long day 07:00-20:00&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PERMANENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Adult Mental Health directorate, based in Sandwell. The ward is supported by a dedicated multi-disciplinary team, with a music room, kitchen, gym, art room, with great links with local charities, and housing services.&lt;/p&gt;\n&lt;p&gt;Applications are invited from both newly qualified Staff Nurses and those with relevant experience, to support our core values: honesty and transparency, integrity, empowerment, compassion and kindness, and dignity and respect.&lt;/p&gt;\n&lt;p&gt;You should be motivated and forward thinking in your approach and possess excellent communication and inter-personal skills. A degree of flexibility in approach is required along with a willingness to learn whilst working in a potentially challenging environment.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of a multi-disciplinary team responsible for assessing, planning, implementing and evaluating the care afforded to service users under appropriate supervision.&lt;/p&gt;\n&lt;p&gt;We have a strong commitment to the personal and professional development of our staff, through support, individual appraisal, comprehensive preceptorship programme, mentorship and clinical supervision.&lt;/p&gt;\n&lt;p&gt;The Mental Health division of Black Country Partnership Foundation Trust is part of MERIT Vanguard, one of 4 Mental Health Trusts in the West Midlands working together to develop new ways of working to improve the way mental health services are provided. We are the only group of Mental Health Trusts working together this way. We want to focus on proactive early intervention and care, rather than reactive crisis management.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to provide leadership and support for support staff&lt;/li&gt;\n&lt;li&gt;Act as a role model for good clinical and care governance practice&lt;/li&gt;\n&lt;li&gt;To take charge on a regular basis, and, in the absence of the management team, accepting responsibility for the smooth and effective running of the unit&lt;/li&gt;\n&lt;li&gt;Good organisational skills&lt;/li&gt;\n&lt;li&gt;Good supervisory skills&lt;/li&gt;\n&lt;li&gt;Good communication skills both written and verbal&lt;/li&gt;\n&lt;li&gt;Ability to contribute to, monitor and implement changes that improvement service delivery and outcomes&lt;/li&gt;\n&lt;li&gt;Enjoy working with service users with various mental health needs&lt;/li&gt;\n&lt;li&gt;Working knowledge of the Mental Health Act&lt;/li&gt;\n&lt;li&gt;Be caring and compassionate&lt;/li&gt;\n&lt;li&gt;Enjoy team work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Please note, Dudley and Walsall Mental Health Partnership NHS Trust and Black Country Partnership NHS Foundation Trust have merged together as one organisation to create Black Country Healthcare NHS Foundation Trust from 1st April 2020. Our aim as one trust is to provide sustainable, high quality, accessible and responsive services. Combining resources, strategies and talented workforce enables us to deliver a wider variety of outstanding services that are based on best practice and are continually improving. We are really excited by this opportunity and hope that you are too, we look forward to you expressing an interest in working joining us.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in the position and would like to know more about the organization i.e information in regards to the acute patient wards. Please get in contact with Deborah Strachan on 0121 612 8679&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hallam Street Hospital, Sandwell", "postalCode": "B71 4NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5278", "longitude": "-1.98643"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255391", "validThrough": "2020-11-15T23:59:59+0000"}