{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T17:15:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Midwifery Manager, Antenatal Lead - permanent post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our amazing Antenatal Ward in Winchester is looking for a Clinical Midwifery Manager.&lt;/p&gt;\n&lt;p&gt;This position requires a passion for antenatal care within the acute setting. You will be a role model of the highest professional standards of practice and conduct. You should be an enthusiastic leader, encourage multidisciplinary working and be able to demonstrate a commitment to delivering high quality, compassionate, and safe antenatal patient care whilst incorporating trust core values.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“The right care, by the right person, in the right place”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Description:&lt;/strong&gt; Your role will include working alongside the Clinical Midwifery Matron Labour Ward, to lead on developing a core team of Midwives and Maternity Staff Nurses. This will then enable you to focus on implementing enhance care for women who are admitted onto the antenatal ward, embedding a model of care that improves services and patient satisfaction. If you believe that you have the right qualities and passion to make a difference we would welcome your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we look for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dynamic, passionate and proactive individual to lead on our Antenatal ward. You should be a confident clinical practitioner and committed to improving services for women at Hampshire Hospitals.&lt;/li&gt;\n&lt;li&gt;You will need to have excellent leadership skills to support the team to deliver high quality care and open to embracing positive change and transformation in order to meet the needs of the women&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Be an enthusiastic and visionary leader, be able to influence others through education and multidisciplinary working and assist in delivery of our highly evaluated in-house training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we Offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An exciting opportunity to work with dedicated teams in a supportive environment&lt;/li&gt;\n&lt;li&gt;On-going professional development attending in-house mandatory study days with the multi-professional team&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Your life outside HHFT is important and the Trust are happy to consider applications with flexible working patterns that cater to individual requirements; this can be discussed at interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For enquiries please contact Lisa Birkett, Deputy operational service manager for maternity via email on Lisa.birkett@hhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hampshire County Hospital, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Clinical Midwifery Manager, Antenatal Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254900", "validThrough": "2020-11-17T23:59:59+0000"}