{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T08:16:02+0000", "description": "&lt;p&gt;&lt;strong&gt;8A Contracts Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;City and County base with some home working and travel&lt;/p&gt;\n&lt;p&gt;The Leicester, Leicestershire and Rutland (LLR) CCGs’ are progressing their plans to appoint to job roles in its new single management team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will support the Contracts and Procurement Team to deliver system transformation and best practice through:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Playing a key role in ensuring contracts are planned and agreed on time, across a range of acute, community, primary care and independent sector provider contracts and grant agreements, including completion of all contract documentation to meet the CCG’s statutory and delegated responsibilities.&lt;/li&gt;\n&lt;li&gt;In-year management to ensure delivery of contract requirements, including service standards, activity levels, financial control, and performance and quality measures; and provision of assurance reports to the CCGs’ boards and committees, as well as to the Regulator.&lt;/li&gt;\n&lt;li&gt;Initiating actions to address variances outside of expected parameters, working with providers and system partners to resolve issues and disputes, and escalating where necessary with appropriate use of contract levers and sanctions.&lt;/li&gt;\n&lt;li&gt;Manage day-to-day contracting queries and provide expert advice relating to any of the contracts in the CCG’s portfolio, from Localities, GP Practices, PCNs, Contract Associates and/or other healthcare providers.&lt;/li&gt;\n&lt;li&gt;Contribute to service reviews, service specification development and pathway redesign to help ensure that the best value for money and highest quality health services are secured within the available resources and specifications.&lt;/li&gt;\n&lt;li&gt;Participate in the development and implementation of new innovative contracting models to support the CCGs and LLR in the delivery of the changing strategic commissioning and transformational agenda.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details/informal visits contact: Jo McKenna, Head of Contracts and Procurement on 07795 176907 or Sarah Shuttlewood, Assistant Director of Contracts and Procurement on 07552 676798&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah Shuttlewood/Jo McKenna&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester City CCG, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253123", "validThrough": "2020-11-10T23:59:59+0000"}