{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 Pa inc"}}, "datePosted": "2020-10-26T15:01:15+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Research Practitioner/ Research Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Oncology Research – Hammersmith Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fixed Term for 1 year&lt;/p&gt;\n&lt;p&gt;SALARY BAND 6&lt;/p&gt;\n&lt;p&gt;37.5 HOURS PER WEEK&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust is the North West London administrative centre for the National Institute for Health Research (NIHR) Clinical Research Network (CRN). The Network is the clinical research delivery arm of the NHS in England, and is tasked with supporting the rapid set-up and effective conduct of studies, enabling the research community to gather evidence to improve treatments for NHS patients.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced research practitioner or research nurse to support the oncology study portfolio at Hammersmith Hospital.&lt;/p&gt;\n&lt;p&gt;The post-holder will be required to work collaboratively with the research teams and wider multi-disciplinary team in the management of your own caseload. This will involve the identification, recruitment, education and monitoring of patients participating in research along with the timely collation and documentation of accurate data.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for managing a portfolio of clinical trials whereby they can make a valued contribution in assessing and managing the care pathways for cancer patients participating in research.&lt;/p&gt;\n&lt;p&gt;The post requires a highly organised individual with excellent communication skills and an understanding of complex scientific protocols.&lt;/p&gt;\n&lt;p&gt;Experience in working within the field of research and within oncology is highly desirable. A mature attitude and the ability to work independently as well as part of a team are essential.&lt;/p&gt;\n&lt;p&gt;The post will be based at Imperial College Healthcare NHS Trust with the expectation of supporting research with partner organisations. Willingness to work flexibly and across hospital sites is an essential aspect of the post.&lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt;Informal enquiries are strongly encouraged. Please contact Emily Pickford / Sarah Stimpson (Team Leader, Hammersmith Hospital Emily.pickford.nhs.net sarah.stimpson@nhs.net)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hammersmith Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 6 Senior Clinical Research Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243021", "validThrough": "2020-11-09T23:59:59+0000"}