{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T08:17:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the busy and dynamic team working within the Sexual Health and Contraception Service in Brighton. Brighton Sexual Health and Contraception is an integrated service in Brighton, and operates across three sites in the city, with outreach to other parts of the city. We are a multi-professional progressive team providing a comprehensive, evidence based and patient focused service for Contraception and Sexual Health.&lt;/p&gt;\n&lt;p&gt;We have 1.6 WTE B6 hours, and are looking for experienced registered nurses to fill the role of Band 6 Sexual Health and Contraception Nurse. The successful candidate/s will contribute to the delivery of an effective and efficient service in a professional and sensitive manner, and it is essential that the post holder has a recognised qualification and experience in the provision of contraception and qualification/experience in sexual health care.&lt;/p&gt;\n&lt;p&gt;A recognised post graduate basic teaching qualification is also essential. A letter of competence in the insertion and removal of subdermal implants and/or IUC (or working towards) would be desirable, as would experience within safeguarding and working with vulnerable young people. Excellent communication and team working skills are imperative. Flexibility in working hours is expected including weekend &amp; evening working. We are able to consider full or part time working requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kim Fortescue Talwar&lt;/p&gt;\n&lt;p&gt;Job title Nurse Team Leader&lt;/p&gt;\n&lt;p&gt;Email address kim.fortescue-talwar@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 664723&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251322", "validThrough": "2020-11-15T23:59:59+0000"}