{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-10-30T17:00:58+0000", "description": "&lt;p&gt;Applications are invited for the post of Clinical Fellow (Higher) in Clinical Pharmacology at Addenbrooke’s Hospital, part of Cambridge University Hospitals NHS Foundation Trust. This post is available as soon as possible until 20 September 2021.&lt;/p&gt;\n&lt;p&gt;The Clinical Pharmacology department at CUH is an accredited European Centre of Excellence in Hypertension, and is embedded in a world-class biomedical campus.&lt;/p&gt;\n&lt;p&gt;This post will be of interest to medical trainees post MRCP who wish to gain extensive expertise in hypertension, and want to consolidate their skills in general internal medicine as well as gain experience in clinical research. There are extensive opportunities for teaching, training and research within the department. The post will also be of interest for trainees in Endocrinology, Nephrology Cardiology, or General Medicine who seek an out of programme experience (OOPE); the candidate may be given the opportunity to spend half a day a week with another speciality.&lt;/p&gt;\n&lt;p&gt;Please note that this post does &lt;strong&gt;not&lt;/strong&gt; carry Postgraduate Dean’s approval or training recognition.&lt;/p&gt;\n&lt;p&gt;Full Registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC licence to practice.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Johann Graggaber, SDU lead in Clinical Pharmacology&lt;/p&gt;\n&lt;p&gt;Email: johann.graggaber@addenbrookes.nhs.uk&lt;br /&gt;or&lt;br /&gt;Telephone via his secretary on: 01223 256653&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Fellow (Higher) in Clinical Pharmacology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251006", "validThrough": "2020-11-15T23:59:59+0000"}