{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T10:45:49+0000", "description": "&lt;p&gt;East Kent Hospitals NHS Foundation Trust are pleased to be able to offer Band 5 Physiotherapist posts across the trust for immediate employment. We would also be pleased to offer posts at band 4 to applicants in their final year of study whilst awaiting their HCPC registration post-graduation.&lt;/p&gt;\n&lt;p&gt;The post will be based at&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;William Harvey Hospital, Ashford Kent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Each site offers rotations lasting 4 months in core areas of Medicine, Trauma &amp; Orthopaedics, Musculoskeletal outpatients, Stroke and Neurology, and Surgery / ITU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Exciting specialist rotations&lt;/strong&gt; are also available in Hand Therapy (in addition to MSK out-patients), A&amp;E and emergency care, Vascular surgery / regional Renal centre and Regional Neuro-rehab centre on site.&lt;/p&gt;\n&lt;p&gt;Our Preceptorship programme for new qualified or newly-HCPC registered staff supports you to develop your problem solving, analytical and leadership skills alongside mentoring, CPD opportunities and supervision to offer consistent feedback to promote your clinical reasoning and confidence as an autonomous practitioner in an acute hospital environment.&lt;/p&gt;\n&lt;p&gt;East Kent Hospitals NHS Foundation Trust is committed to delivering a 7 day physiotherapy service to support optimum patient outcomes, reduce unnecessary stays in hospital and aid patient flow. There is therefore an expectation that band 5 physiotherapists will participate in a 7 day rota in many clinical areas.&lt;/p&gt;\n&lt;p&gt;Innovation is welcomed at all levels in the East Kent Hospitals NHS Foundation Trust Therapy Team and Band 5 staff are actively encouraged to offer ideas and be involved with quality improvements and service development initiatives. Physiotherapy teams work very closely with our Occupational Therapists and Speech &amp; Language Therapists to create a fun, vibrant and clinically excellent Therapy service to patients across East Kent.&lt;/p&gt;\n&lt;p&gt;There are many benefits to living and working in East Kent&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;High Speed train links to Central London&lt;/li&gt;\n&lt;li&gt;Proximity and ease of travel to Europe&lt;/li&gt;\n&lt;li&gt;Beautiful and diverse countryside&lt;/li&gt;\n&lt;li&gt;Stunning coastline and beaches (both pebble and sand!), perfect for walks, runs, bike rides and sea swimming&lt;/li&gt;\n&lt;li&gt;Affordable house prices in proximity to our hospitals&lt;/li&gt;\n&lt;li&gt;Extensive excellent shopping facilities&lt;/li&gt;\n&lt;li&gt;Plentiful options for gyms, cinemas, nightlife and days out&lt;/li&gt;\n&lt;li&gt;Internationally celebrated festivals – Whitstable Oyster Festival, Broadstairs Folk Week&lt;/li&gt;\n&lt;li&gt;Outstanding Primary, Secondary and Independent Schools and award winning Universities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anna Slark&lt;/p&gt;\n&lt;p&gt;Email address:anna.slark@nhs.net&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Casarotto, Head of Transformation &amp; Performance for Therapies on 07787005049 or clairecasarotto@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251638", "validThrough": "2020-11-09T23:59:59+0000"}