{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 - 30,615.00"}}, "datePosted": "2020-10-30T13:47:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;&lt;strong&gt;Sheerness (Isle of Sheppey)- Sheppey Community Hospital&lt;/strong&gt;&lt;br /&gt;Full or Part Time Opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a motivated and caring Registered Nurse based in the Kent area and passionate about the rehabilitation of the patents in your care?Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt;If you are newly qualified – why not let us support you with our forward-thinking Preceptorship scheme. This is a mixture of face to face, e-Learning and workshop based learning to support your development in your chosen career pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a band 5 staff nurse you will receive an AFC 20/21 salary and terms and conditions including an NHS pension. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. We will offer a combination of in house eLearning, workshops and courses to support your development to ensure you meet the correct competencies to become an effective co-worker within the team of the ward environment!&lt;/p&gt;\n&lt;p&gt;You will also be supported when you first start in your role by managers, colleagues and our TLE department to complete all your training and to show you the ropes of the job! Your learning and development in the role will also be supported through our dedication to regular team meetings to share best practice and weekly one to ones with managers. You will also be provided with the latest equipment to allow you to provide the clinical standards of the highest quality. We also continue to thrive in our environment to excel in the CQC domains.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as discounts on Virgin Products including holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health. All this, and flexible working patterns to help support your work/life balance.&lt;/p&gt;\n&lt;p&gt;In addition to the above, you could receive an additional one-off payment of up to £2,000 as a welcome to our service – a Golden Hello from us, to you&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking forBand 5 Nurses with an RGN qualification and license to practice, to join our in-patient ward team at Sheppey Community Hospital.&lt;/p&gt;\n&lt;p&gt;As a band 5 Staff Nurse working for Virgin Care, you will work collaboratively alongside our multi-disciplinary teams, consisting of around 30 members of staff. Within Sheppey Community Hospital, we have 24 beds for patients where you will be responsible for contributing to the holistic assessment, planning delivery and evaluation of patient care.You should be passionate about the rehabilitation of patients in your care and be encouraging them, to aid their ability for independent living.&lt;/p&gt;\n&lt;p&gt;You will also put to use your strongcommunication and organisation skills, along with a flexible approach, to ensureyou deliver positive experiences to patients at every stage of theirhealthcare journey.&lt;/p&gt;\n&lt;p&gt;You’ll care forpatientsand their families in the way thatyou believe is best, delivering our high service standards, sharing bestpractice, and actively improving the way we work to help us continue to change things for the better. We feel passionate that everyone should feel valued when they come into contact with our organisation, whether that&#39;s you, someone we care for or the wider community we operate in.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;“Thank-you so much for all your help and dedication in looking after me during my stay. I cannot praise you all enough and although I am looking forward to being in my own home I will miss you all very much.”&lt;/p&gt;\n&lt;p&gt;A quote from one of our in-patients that we helped regain her independence. This is a fantastic team to be part of where you can feel proud of the work you do!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact Angela SellenonAngela.sellen@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in Kent and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheerness (Isle of Sheppey)", "postalCode": "ME12 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4156", "longitude": ".792928"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250408", "validThrough": "2020-11-13T23:59:59+0000"}