{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45753", "minValue": "45753", "unitText": "YEAR", "value": "From £45,753 per annum, pro rata"}}, "datePosted": "2020-10-29T12:31:21+0000", "description": "&lt;p&gt;We have been awarded new funding to develop and deliver a perinatal mental health service into HMP Eastwood Park.&lt;/p&gt;\n&lt;p&gt;The prison is conveniently located just off J14 of the M5. It is an uncategorized women&#39;s prison that acts as a local / remand as well as a resettlement jail, working with women from a wide geographical area.&lt;/p&gt;\n&lt;p&gt;In practice this means that the work is hugely varied as we cater for women at all stages of the criminal justice process from those on remand / newly sentenced who may require stabilisation and detoxification from drugs / alcohol and / or may present with a complex and acute array of health and social care needs, through to more settled women who need assistance to plan a successful transfer at the end of sentence, back into the community.&lt;/p&gt;\n&lt;p&gt;You will be joining a well established and thriving mental health service. The mental health service is made up of a primary care prescribing team with a greater focus on non medical prescribers (as opposed to GPs), a crisis team that covers 8am until 8pm 7 days / week, and a therapies team made up of Psychology , group work facilitators and support workers, along with Psychiatry. The team also employs a dual diagnosis practitioner and a neuro developmental lead (we are also in the process of expanding our neurodevelopmental service).&lt;/p&gt;\n&lt;p&gt;The aim of this new service is to enhance our mental well-being offer to women who are pregnant or up to 12 months post partum.&lt;/p&gt;\n&lt;p&gt;We can offer some flexibility in terms of the hours the successful candidate will work.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Fiona Banes, Community Services Manager&lt;/p&gt;\n&lt;p&gt;Email fiona.banes@nhs.net  telephone number  07827 357240&lt;/p&gt;\n&lt;p&gt;I look forward to discussing this post with any interested applicants and am happy to arrange for you to visit the service. please note I am not available 22 -23.10.20 or 9 -20.11.20&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Eastwood Park, Wotton Under Edge", "postalCode": "GL12 8DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6345", "longitude": "-2.46738"}}, "title": "Band 8a Perinatal Mental Health Psychologist - HMP Eastwood Park", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248329", "validThrough": "2020-11-12T23:59:59+0000"}