{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 p.a. inc."}}, "datePosted": "2020-11-03T10:00:56+0000", "description": "&lt;p&gt;Are you naturally inquisitive?&lt;/p&gt;\n&lt;p&gt;Do you like a challenge?&lt;/p&gt;\n&lt;p&gt;Do you have an eye for detail?&lt;/p&gt;\n&lt;p&gt;If so, then this could be the role for you. We are looking for an experienced, self-motivated and detail orientated Data Warehouse Manager, to work in our busy Information Services Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Information Services comprises of Informatics, Contract Monitoring and Data Quality teams. Information Services is responsible for providing analytical support and intelligence to both internal and external customers of the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Data Warehouse Manager role requires highly skilled individual who can demonstrate track record both in database design, development and management as well as innovative in approach to problem solving. This role requires a person with thorough DBA knowledge and experience either acquired working in the area or able to demonstrate his/her knowledge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will have a proven track record within the data warehouse function and extensive knowledge of NHS healthcare reporting from a provider perspective. They will be a natural leader, with the ability to develop and motivate staff. Due to the evolving nature of information systems, this position requires an adaptable, forward thinker who is not afraid of change. In addition, they will have strong communication skills that enable them to share and simplify their extensive knowledge around the complexities of healthcare informatics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return we will offer you the opportunity to develop your skills and be recognised for them. If you think you have what it takes to succeed in this challenging position, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Homerton has a proud tradition of supporting and developing its staff, and we would like you to be the next individual to take advantage of this.&lt;/p&gt;\n&lt;p&gt;This post is offered as a full time position 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be taking place week commencing 30th November 2020.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact&lt;/p&gt;\n&lt;p&gt;Neela Tirumala (Head of Information Services) on 020 8510 7868 / 07753436350&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Data Warehouse Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253352", "validThrough": "2020-11-16T23:59:59+0000"}