{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-30T17:01:10+0000", "description": "&lt;p&gt;&lt;strong&gt;STAFF NURSE – IN-PATIENT REHABILITATION BRACKLEY COMMUNITY HOSPITAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; 37.5 hrs per week, part time hours consider – minimum 25 hours per week –&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;on a 24/7 rota basis&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;We are opening  a New Inpatient Hospital – do you want to be part of it?&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHFT are excited to be involved in the opening of a brand new purpose built community hospital ward opening soon in Brackley, South Northamptonshire.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you want to make an impact in your Nursing career in a role that cares as much as you, then we are the Trust for you! At NHFT we&#39;ll give you every opportunity to realise your full potential and develop the stand-out career that’s right for you. We are looking for somebody who is a proactive and dedicated team member, is open to new ideas, has the vision, passion and skills to implement new patient pathways and who is committed to delivering excellent high quality patient care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Staff Nurse you will have a unique opportunity to help us shape the n&lt;strong&gt;ew Inpatient Hospital  &lt;/strong&gt;and ward team. We want to create an effective and high performing team which you can be part of from the very beginning making a positive difference and delivering outstanding care. The ward is situated in a new building, with a wide range of services co-located in it and therefore we need somebody who is open to new ways of working on the ward and developing strong links with other services and the wider community.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our most recent Care Quality Commission (CQC) inspection recognised us with an ‘Outstanding’ rating and our vision is to continue to be a leading provider of outstanding compassionate care. Our dedication to caring and making a difference doesn’t just extend to our patients, but to our staff too. Wellbeing is a Trust priority.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer excellent employment benefits including:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Family Friendly policies, such as flexible working and support for working carers&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Occupational Health and wellbeing services, including fitness classes , free and confidential psychological support services , discounted gym memberships and more&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free staff networks, including LGBTQ+, Disability and BME groups&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Over 200 learning and development courses available&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary sacrifice scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Staff bank , allowing employees to gain experience and supplement income with additional shifts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Minimum 27 days annual leave (rising with length of service) plus bank holidays&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;**Please note only applicants with NMC Registration will be considered for shortlisting **&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;In addition to the benefits offered under the NHS terms and conditions of service, this post additionally attracts an incentive of £3000 pro rata for the successful applicant/s paid over the first 12 months of employment. Please refer to the attached FAQ document or contact the Recruitment team for further information. Please note incentive payments are not applicable to existing NHFT substantive staff. Terms and conditions apply.&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be working in an integrated multi professional inpatient team that includes a ward matron, team leaders, staff nurses, unregistered staff, therapy MDT, medical staff and wider trust colleagues. The post holder will need to provide quality care for a group of patients, specialising in rehabilitation and sub-acute care from patients stepping down from acute hospitals and step up patients for acute hospital admission avoidance in a physical health inpatient unit .&lt;/p&gt;\n&lt;p&gt;The post holder after a period of induction will be expected to manage the ward in the absence of the Ward Matron and Ward Sister providing support to junior colleagues and assisting them in problem solving any issues relating to patients and staff.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely with MDT colleagues to assist in timely discharge for patients where appropriate.&lt;/p&gt;\n&lt;p&gt;Reporting to the Ward Sister and ultimately to the Ward Matron for the ward enabling them to deliver services effectively and efficiently to patients and service users.&lt;/p&gt;\n&lt;p&gt;The post holder will assist in the development and delivery of high quality care over the 24/7 period that meets the needs of the patients. They will be involved in developing, planning, implementing and evaluating the care, in the continuing development of the team, participating in the supervision and appraisal process and in professional development of team members.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressvanessa.cross@nhft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion or further information on this post please contact:&lt;/p&gt;\n&lt;p&gt;Rita Reeves, Senior Matron – rita.reeves@nhft.nhs.uk or Rosemary Cairns, Service Manager – Vanessa Cross – Clinical Practice and Service Development Facilitator - vanessa.cross@nhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brackley, Brackley", "postalCode": "NN13 6GN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0455", "longitude": "-1.15016"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251014", "validThrough": "2020-11-30T23:59:59+0000"}