{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17286", "minValue": "17286", "unitText": "YEAR", "value": "£17,286.45 per annum"}}, "datePosted": "2020-10-29T13:41:46+0000", "description": "&lt;p&gt;We are looking for an additional person to join our very happy, supportive reception/admin team.  The work is varied and interesting, you never know what you will be faced with so you need to be adaptable and good at multi-tasking.  You will have five weeks holiday per year plus bank holidays (pro rata if part-time) and there is an attendance bonus paid 6 monthly.  NHS Pension Scheme available and all staff have access to Health Assured a health and wellbeing support platform. &lt;br /&gt; &lt;br /&gt; The successful candidate must be prepared to work in a fast paced environment, have good computer skills, a friendly approachable manner and an excellent telephone manner.  You must be enthusiastic to learn new skills, work well within a team but also be able to use your own initiative.  You require a good understanding of confidentiality and need to show empathy to our patients.  Attention to detail is also essential.  Good GCSE grades including English desirable.  Welsh speaking would be useful but not essential.&lt;br /&gt; &lt;br /&gt; You will be part of a very busy team but we are all very supportive of each other and we all get on very well - doctors, nursing staff and reception/admin.  As we are busy the days go by very quickly and you will not be clock watching but no matter how busy we are we still find time for laughter.  The job is on  weekdays only so your weekends and evenings will be free.  Immediate start available.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132734.png", "name": "GP Practices - Betsi Cadwaladr University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132734"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mold", "postalCode": "CH7 1SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1683", "longitude": "-3.14713"}}, "title": "Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248526", "validThrough": "2020-11-15T23:59:59+0000"}