{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T14:16:14+0000", "description": "&lt;p&gt;DAY SURGERY UNIT, CORBETT HOSPITAL&lt;/p&gt;\n&lt;p&gt;ANAESTHETIC &amp; RECOVERY PRACTITIONER – DAY SURGERY, CORBETT HOSPITAL&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HOURS: 37½ PER WEEK &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SALARY: BAND 5 - £24,907-£30,615 PER ANNUM PRO RATA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PERMANENT CONTRACT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Day Surgery Department have vacancies for 2 x full-time Anaesthetic and Recovery Practitioners in a busy, multi-specialty unit.&lt;/p&gt;\n&lt;p&gt;The successful candidates must be registered with the Nursing Midwifery Council or the Health Care Professions Council. Recent Anaesthetic and Recovery experience is essential, while scrub skills would be beneficial.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be expected to participate in flexible shift working over 7 days at the Day Surgery Unit at Corbett Hospital, with occasional shifts at Russells Hall Hospital as required.&lt;/p&gt;\n&lt;p&gt;At the Dudley Group our patients and staff are at the heart of all that we do to offer a high quality patient experience in a caring and supportive environment. This aligns with our vision of providing safe, caring and effective services because people matter.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join an NHS organisation that inspires its staff to innovate, with support and encouragement to continually develop. In return you will have the opportunity to inspire exemplary support for our patients.&lt;/p&gt;\n&lt;p&gt;We expect all of our staff to demonstrate the Trust values of Care, Respect and Responsibility.&lt;/p&gt;\n&lt;p&gt;We believe healthcare is better when provided by supported and dedicated staff, so if you are innovative, forward thinking and dedicated to high quality patient care come and join our amazing team.&lt;/p&gt;\n&lt;p&gt;Our Trust gives its staff a voice and empowers its employees to be involved in service innovation and change as well as achieving their personal goals and aspirations. We want staff to always feel valued and respected and know they can make a difference to our patients.&lt;/p&gt;\n&lt;p&gt;As a responsible employer we strive to promote a healthy and safe environment and to ensure a positive experience for all. We work hard to create a culture of engagement and inclusivity where colleagues believe in and live by our values. We engage with our staff in an open and transparent way by listening, being honest and working together to achieve our aims. We firmly believe in the ability of our colleagues to help us shape our services so that our values are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;Be part of our journey of continuous improvement, come and join us at the Dudley Group.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister Georgina Brueton on 01384 456111 Ext: 4700 or email: georgina.brueton@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Corbett Hospital, Stourbridge", "postalCode": "DY8 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4654", "longitude": "-2.14639"}}, "title": "Theatre Practitioner Anaesthetics &amp; Recovery, Corbett Day Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260086", "validThrough": "2020-11-20T23:59:59+0000"}