{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-06T12:31:58+0000", "description": "&lt;p&gt;East Sussex Care Delivery Service (CDS) provides specialist community and inpatient mental health services for adults over the age of 18, living within East Sussex. We believe in providing outstanding quality, safe and effective care and treatment that everyone can be proud of. We are a friendly and committed team looking for people to join us, as we continue to develop our vision of local, seven day, specialist mental health provision that is based on evidence-based clinical care pathways. Working for us will enable you to be part of a forward thinking developing service. You can also be part of our Trust-wide Disability, BME and LGBT staff networks or be involved in the Trust’s Wellbeing Network as a wellbeing champion, mental health ambassadors or mental health first aider.&lt;/p&gt;\n&lt;p&gt;Amberstone Hospital, a 28 bedded unit, lies within the East Sussex Rehabilitation Pathway providing care to those individuals with severe and enduring mental health problems. The team is working towards a recovery approach with an emphasis on social inclusion.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for a number of enthusiastic and motivated support workers to fill our vacant positions and complement our existing team. Experience welcome, but not essential as training and supervision is provided.&lt;/p&gt;\n&lt;p&gt;Applicants must have good interpersonal skills and a flexible approach to duty as some night work will be required. A commitment to supervision and the opportunity for staff development are key aspects of this service.&lt;/p&gt;\n&lt;p&gt;For an informal discussion or to arrange a visit please contact either:&lt;/p&gt;\n&lt;p&gt;Rachel Perkins, Interim Ward Manager or Danny Gregory Charge Nurse on 01323 444104.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Perkins&lt;/p&gt;\n&lt;p&gt;Interim Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address: rachel.perkins@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number01323 444104&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Danny Gregory Charge Nurse on 01323 444104&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Amberstone Hospital, Hailsham", "postalCode": "BN27 4HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8819", "longitude": ".275407"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259691", "validThrough": "2020-11-22T23:59:59+0000"}