{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36856", "minValue": "36856", "unitText": "YEAR", "value": "up to £36,856 DOE"}}, "datePosted": "2020-10-23T15:02:22+0100", "description": "&lt;h1&gt;I help to make a difference!&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the Health in Justice market leader - 2 years ago we were managing 12 prison healthcare services and in 2019 we&#39;re providing healthcare services in over 40 prisons across the country.&lt;br /&gt; &lt;br /&gt; We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;/p&gt;\n&lt;h1&gt;Looking for something different?&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; We&#39;re looking for a Mental Health Nurse to support our multi-disciplinary healthcare team at HMP Brixton. This will mean working inside the prison within healthcare and on the prison wings. What do we need from you so you can do the job?&lt;br /&gt; You will be a registered Mental Health Nurse you will need to have evidence of Mental health experience.&lt;br /&gt; &lt;br /&gt; If you are new to offender health, we will create a suitable induction package to ensure you are equipped for this role.&lt;/p&gt;\n&lt;h1&gt;Next steps&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Brixton if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;h1&gt;More information&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; The work is interesting and varied and is an opportunity to make a difference to peoples’ lives, enabling them to improve and maintain their health and wellbeing.&lt;br /&gt; &lt;br /&gt; The Salary is up to £36,856 per annum dependant on experience and is a permanent full time role for 37.5 hours per week.&lt;br /&gt; &lt;br /&gt; Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW2 5XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.452", "longitude": "-.124685"}}, "title": "Mental Health Nurse - HMP Brixton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241032", "validThrough": "2020-11-06T23:59:59+0000"}