{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 £31,365 - £37,890 per ann"}}, "datePosted": "2020-10-26T14:01:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Stockport NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are lots of good reasons to choose to come and work at Stockport NHS Foundation Trust. A dynamic integrated Trust with integrity and vision, exactly the same qualities you’ll see in yourself.&lt;/p&gt;\n&lt;p&gt;Stockport NHS Foundation Trust aims to be the organisation of choice for patients and an employer of choice for staff. In order to continually improve all aspects of our patient experience, we rely upon having a highly skilled, motivated, diverse, productive and patient focused workforce.&lt;/p&gt;\n&lt;p&gt;Stockport Foundation Trust is one of four ‘specialist’ hospital sites in Greater Manchester. Being a ‘specialist’ hospital will enhance our general surgery, anaesthetics, critical care and emergency medicine for the benefit of people in Stockport, High Peak, Cheshire and across Greater Manchester.&lt;/p&gt;\n&lt;p&gt;Our values &lt;strong&gt;‘Quality and Safety, Communication, Service’&lt;/strong&gt; are at the heart of everything we do and come from our ‘Your Health. Our Priority’ promise. Every day they drive the behaviour and actions for every person in our organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Radiographer – Radiology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join our friendly and dedicated radiology team, We are looking for an enthusiastic, hardworking and motivated Radiographer to work predominantly in our busy CT department, in return we will ensure the successful candidate gains a wide range of experience particularly in stroke imaging, CT colonography and urology, with opportunities for further development.&lt;/p&gt;\n&lt;p&gt;The CT department has extended recently with the installation with a new Out-Patient CT suite which opens in November 2020, and a new out-patient modular unit, opened summer 2020. In spring 2021 we plan to also replacement of one on the existing acute scanners. The scanners are equipped with state of the art multi-dose injector units.&lt;/p&gt;\n&lt;p&gt;Stockport Foundation Trust is one of four ‘specialist’ hospital sites in Greater Manchester, our Hyper-Acute Stroke Centre is one of only three in Greater Manchester.&lt;/p&gt;\n&lt;p&gt;Radiology provides plain film and fluoroscopy services to hospital wide clinical areas. Our specialist areas include trauma and orthopaedic radiography, theatre and interventional radiology.&lt;/p&gt;\n&lt;p&gt;The Department also provides a full range of Ultrasound, CT Scanning, Nuclear Medicine, Symptomatic Mammography and MRI scanning services.&lt;br /&gt;&lt;br /&gt;The department operates on a Trust-wide PACS system and the department includes 6 DR plain film rooms, 2 digital fluoroscopy rooms, Dental and Dexa imaging and 3 current CT scanners, a further CT planned for 2021 and a replacement of an existing scanner in 2021 – (5 scanners total).&lt;/p&gt;\n&lt;p&gt;The Department supports a number of extended scope roles including CT Head, MSK, chest and GI reporting. &lt;br /&gt;&lt;br /&gt;The candidate will be Health Care Professions Council registered and eligible to work in the United Kingdom.&lt;br /&gt;&lt;br /&gt;Current CT experience is desirable for this role.&lt;/p&gt;\n&lt;p&gt;Ability to participate in 24 hour working patterns is essential; the department operates a full Radiographer shift system&lt;/p&gt;\n&lt;p&gt;All candidates must attend interview in person.&lt;br /&gt;&lt;br /&gt;For further information and/or informal visits please contact: Karen Andrew, CT Lead, 0161 419 4782.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If successful this vacancy will require an enhanced DBS check at a cost of £40 approx. This cost will be deducted from your first Trust salary&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren AndrewJob titleCT LeadEmail addresskaren.andrew@stockport.nhs.ukTelephone number0161 419 4782&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "CT Rotational Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242813", "validThrough": "2020-11-15T23:59:59+0000"}