{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-30T17:01:05+0000", "description": "&lt;p&gt;We are currently looking to recruit a highly motivated and enthusiastic Band 7 Cognitive Behavioural Therapist within our Cheshire and Merseyside Resilience Hub hosted at Mersey Care NHS Foundation Trust. This post will be until 31st March 2021 and we welcome applicants who are looking for a secondment or temporary post for part-time or full-time hours of employment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of a new project to develop a Resilience Hub and be involved in the mobilisation and delivery of this service across the whole of Cheshire and Merseyside. The Resilience Hub is committed to enhancing mental health resilience through providing support to health and care colleagues involved in caring for people who use our services during the COVID-19 pandemic and beyond.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The aim of the Resilience Hub is to ensure health and care colleagues have timely access to psychosocial interventions within a stepped care model which integrates with existing service offers across the Cheshire and Merseyside footprint. It will offer a holistic approach by undertaking clinical screening and triage to identify an individual’s needs and advocate for health and care colleagues to access existing service provision within Cheshire &amp; Merseyside. The Resilience Hub will offer clinical leadership and deliver specialist training, advice, consultation and clinical supervision to enhance knowledge and skills amongst professionals to promote and build resilience in the workforce.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will work in a team consisting of a Consultant Clinical Psychologist who is the clinical lead for the service, Principle Clinical Psychologists, a Highly Specialist Clinical Psychologist, a Senior Operational Manager, Cognitive Behavioural Therapists, a Research Assistant, Psychology Assistants and a Project Administrator. The successful candidate will be employed by Mersey Care NHS Foundation Trust and will be provided with clinical supervision, reflective practice and training to support the role with access to our programme of learning and development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Jane Jamieson, Trust Wide Professional Lead for Psychological Practice: Jane.Jamieson@merseycare.nhs.uk&lt;/li&gt;\n&lt;li&gt;Fran Cairns, Deputy Director of Therapies, Psychological &amp; Allied Health Professionals: Francesca.Cairns@merseycare.nhs.uk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: midnight on 11th November 2020&lt;/p&gt;\n&lt;p&gt;Shortlisting scheduled for: 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews scheduled for: 16th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheshire and Merseyside Resilience Hub hosted at Mersey Care NHS Foundation Trust, Liverpool", "postalCode": "L34 1PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4231", "longitude": "-2.8262"}}, "title": "Cognitive Behavioural Therapist  - Resilience Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251011", "validThrough": "2020-11-11T23:59:59+0000"}