{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49034", "minValue": "49034", "unitText": "YEAR", "value": "£49,034 pa pro rata"}}, "datePosted": "2020-11-05T13:31:15+0000", "description": "&lt;p&gt;RCEMlearning Digital Education Fellow/Clinical Fellow in Emergency Medicine ST4 +&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;University Hospitals Bristol has teamed up with the Royal College Emergency Medicine to present an exciting opportunity&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A job in a busy teaching hospital combined with an opportunity to work 20% of your time with the RCEMLearning team…..&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Post will be split into 80/20% and are open as OOPT/E for EM HSTs and as stand alone posts for non-trainees.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These posts are offered in a CQC rated Outstanding Trust, in an Award Winning Emergency Department:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Innovative approaches were being used to deliver quality care”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“There was a strong multidisciplinary approach to patient care”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Teamwork in the A&amp;E department was exceptional. Staff at all levels were committed, motivated and engaged. They worked very well with each other across all job roles and staff grades. They were cohesive and demonstrated excellent teamwork within their department and with other departments.” CQC Report 2014&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;‘Outstanding’ Trust rating CQC 2016&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol NHS Foundation Trust (Bristol Royal Infirmary site) and the Royal College of Emergency Medicine seeks highly motivated applicants for Digital Education Fellow posts (which can be OOPT/E or standalone posts) at ST4-6 Level/equivalent in Emergency Medicine to commence from August 2019.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts provide an ideal opportunity for the successful candidates to develop a specialist interest in digital education, working alongside the RCEMLearning team, whilst working in a busy inner city adult Emergency Department. Teaching and research responsibilities are available. This year the Emergency Department won a BMJ award, HSJ award and was recognised in two categories in the RCEM awards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts include 80% time working in the adult emergency department and 20% paid time to work as a Digital Education Fellow with RCEMLearning. In additional the successful applicant will have a postgraduate qualification in education funded to a maximum of £4,000&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;RCEMLearning innovatively combines a Virtual Learning Environment (VLE) with Free Open Access Medical (FOAMed) resources, and it makes an invaluable contribution to how RCEM Fellows and Members prepare for exams, deliver teaching, refine critical appraisal skills, stay aligned with changes in evidence-based medicine, and maintain their eportfolio and CPD activities. As a result of RCEMLearning’s continued growth, the RCEM is looking to appoint Digital Education Fellows (DEFs)to support the platform’s pioneering work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts are offered as a fixed term contract until August 2020. Educational support, computer and office facilities will be provided to the successful candidate, including a study budget.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should preferably hold a relevant postgraduate qualification (MRCEM, MRCP, MRCS, FRCA or equivalent), and have completed a minimum of 3 years in approved posts since foundation year or equivalent in relevant acute specialities including at least 1 year in Emergency medicine.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Potential applicants are invited to contact Dr Rebecca Maxwell (Clinical Lead BRI ED/RCEMLearning Clinical Chair ) Rebecca.maxwell@UHBristol.nhs.uk 0117 342 1498&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Clinical Fellow 80:20 Emergency Medicine: RCEM Learning Education", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257877", "validThrough": "2020-11-19T23:59:59+0000"}