{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753-£51,668 (B8a) £53,168-£62,001 (B8b) pa p/r"}}, "datePosted": "2020-10-28T15:00:04+0000", "description": "&lt;p&gt;&lt;span&gt;37.5 hours per week (office hrs. &lt;/span&gt;Silver on call rota: 2-10pm shift required to support management of the site on achieving B8b. As B8a, to support with Bronze Community on call.)&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NCIC has recently concluded a restructure of the AHP Senior Leadership team and currently have a vacancy for a new Head of Podiatry. The Trust acknowledge the importance of a Head of Podiatry position to continue to support and lead the Podiatry professionals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a developmental post that requires commitment over a 24 month period to developing the leadership and management capabilities outlined in the Head of Podiatry job description. The post-holder will be supported through formal and informal learning, coaching and mentoring, to develop their skillset in order to meet the competencies and capabilities of the post. The post-holder will be appointed as a Band 8a; only achieving Band 8b on satisfying all the requirements of the role. The competencies and capabilities of the role will be defined in line with the job description. Given the developmental aspect of the role a probationary period of 6 months will be required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested candidates should be able to demonstrate experience of professional leadership and working internally and externally to the organisation they are employed in. They should have experience of having had accountability for Podiatry service provision and extensive Profession specific knowledge, application of theory, best practice and procedures. They need to demonstrate a proven record of achieving service development, managing change and performance.An in depth knowledge and understanding of current NHS and other national policy and their implication for professional practice will be required to support the Podiatrists as the system develops its pathway approach to Health and Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will ensure the wider health care system has a high quality integrated Professional service that is flexible and able to meet the clinical needs of the population it serves within the resources available. They will be required professionally manage podiatrists across the Care Groups.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be based in the community and will need to travel across the wider healthcare system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested candidates can contact Penny Parsons on 07811 714533 to discuss the role.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These schemes are subject to availability&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CIC Carlisle &amp; WCH Whitehaven, Cumbria", "postalCode": "CA28 8JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5302", "longitude": "-3.56318"}}, "title": "Head of Podiatry Development Post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247071", "validThrough": "2020-11-11T23:59:59+0000"}