{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T08:30:32+0100", "description": "&lt;p&gt;Applications are invited from professional and enthusiastic individuals who would welcome the challenge of working within a busy ICT Technology Department.&lt;br /&gt;&lt;br /&gt;The ICT Department is responsible for the continued development and support of the ICT infrastructures for over 6000 users across 100+ sites.&lt;br /&gt;&lt;br /&gt;Based at Blackpool Victoria Hospital, you will work with a wide range of hardware and software technologies. The primary function of this role will be to assist in the support of the Fylde Coast’s infrastructure within the central Trust Information Technology function.&lt;br /&gt;&lt;br /&gt;You will be required to have a full working knowledge of PC’s, as well as a wide variety of healthcare systems and appropriate knowledge to maintain a wide variety of IT hardware equipment and trouble shoot faults with Tablet devices. As a ICT Engineer, you will be responsible for the resolution of service requests/faults, remotely or in person across the Fylde Coast.&lt;br /&gt;&lt;br /&gt;You will be expected to work as a member of an integrated IT team, but in addition you should be capable of unsupervised working. A professional manner at all times is essential when dealing with the Trust’s user population.&lt;br /&gt;&lt;br /&gt;This position will demand a high level of activity and resource. The successful candidate will be a car owner/driver and hold a full, current UK drivers licence as support across the Fylde Coast is integrated within the role.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire WhithamJob titleICT Support Team LeaderEmail addressc.whitham@nhs.netTelephone number01253 952126&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Victoria Hospital, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "ICT Engineer - Fixed Term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239699", "validThrough": "2020-11-15T23:59:59+0000"}