{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 gross per annum"}}, "datePosted": "2020-11-03T16:00:43+0000", "description": "&lt;p&gt;Is your passion working creatively with children and families? Looking for a role with flexible working opportunities?&lt;/p&gt;\n&lt;p&gt;We are excited to offer an opportunity for an Assistance Practitioner to join our Crisis Assessment and Intensive Support Service (CAIST) within Norfolk and Suffolk Foundation NHS Trust. The provision works within the wider Children &amp; Families Young Persons Service, to provide specialist evidence-based intervention of Crisis Management and Intervention for young people in crisis across Norfolk and Waveney.&lt;/p&gt;\n&lt;p&gt;The team offers assessment and intensive support to children and young people under the age of 18. The working hours are 8am to 8pm, seven days a week. We offer this service across all the Bank Holidays, in order to support quicker access to appropriate services for children and young people attending local hospitals.&lt;/p&gt;\n&lt;p&gt;As part of this team, responsibilities would be working alongside the Practitioner (Band 6) to assess the mental state and risk when children and young person are in crisis. These assessments may take place in the Accident and Emergency Departments and/or Children’s Ward.&lt;/p&gt;\n&lt;p&gt;CAIST provides community based intensive support to young people and their families. This enables the team to build a therapeutic relationship to develop an individualised Crisis and Contingency Plan, to support the child and young person often distressing situations. Parents/carers as well as Education and Social Care where necessary will be asked to support multi-agency planning.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join an innovative and newly expanded service, that is well thought of by Commissioners and Partner agencies. We are confident that being part of our small team, will assist in supporting you be the practitioner you trained to be!&lt;/p&gt;\n&lt;p&gt;We will provide a full Induction program, regular clinical and management supervision with opportunity to explore goals and aspirations.&lt;/p&gt;\n&lt;p&gt;If you would like to know more about the role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt;We can offer you the full range of NHS benefits and in addition:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Financial support with relocation cost&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Up to 307 hours holiday entitlement (subject to length of service)&lt;/li&gt;\n&lt;li&gt;FREE physio service&lt;/li&gt;\n&lt;li&gt;FREE Yoga and Pilate&lt;/li&gt;\n&lt;li&gt;Cycle scheme tax-free bikes and accessories&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Support with revalidation&lt;/li&gt;\n&lt;li&gt;Post graduate training opportunities&lt;/li&gt;\n&lt;li&gt;We will pay for your initial DBS check (excluding the annual update service charge of £13)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAl BaileyJob titleTransformation ManagerEmail addressal.bailey@nsft.nhs.ukTelephone number01603 272800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk, Norfolk", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254703", "validThrough": "2020-11-23T23:59:59+0000"}