{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-05T11:46:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Consultant Histopathologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: Salford Royal NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: Cellular Pathology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working pattern: 10 PA&#39;s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Number of Posts/location: 2 at Royal Oldham Hospital Oldham &amp; 1 at Salford Royal Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £82,096-£110,683 per annum &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Histopathology teams at The Northern Care Alliance (NCA), a group of two trusts Salford Royal Foundation Trust (SRFT) and Pennine Acute Trust PAHNT) is looking to appoint quality driven Histopathology consultants to join our high performing team on our Oldham and Salford sites. We provide a comprehensive, efficient and cost effective Cellular Pathology service to SRFT and PAHNT and Wrightington, Wigan &amp; Leigh NHS Foundation Trust (WWL). We are looking to enhance our skilled and committed team of 21 general consultants with individuals who can drive our continued success and contribute to an exciting future.&lt;/p&gt;\n&lt;p&gt;The Departments of Cellular Pathology are friendly and busy departments that support many multidisciplinary teams for cancer specialists including breast, upper and lower gastrointestinal, lung, urology, gynaecology, head and neck and haematology. Our surgical and medical colleagues are very appreciative of the high quality diagnostic service we provide and this is reflected in our excellent working relationships with our clinical colleagues.&lt;/p&gt;\n&lt;p&gt;The Pathology Department at The Royal Oldham Hospital is housed in a purpose built and innovatively designed laboratory providing a comprehensive clinical and diagnostic service across the Trust. The Department is UKAS Accredited. The state of the art facilities have been designed and constructed with the professional in mind.&lt;/p&gt;\n&lt;p&gt;Salford Royal Hospital is a teaching hospital and all consultants are involved in teaching medical students and training medical staff. Development of management skills is actively encouraged with Trust based courses and the opportunity for career progression within divisional management is available to all colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Putting your needs under the microscope&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to providing you with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A consultant team with clear vision for the continued success of their department.&lt;/li&gt;\n&lt;li&gt;Support for your own personal development utilising our strong links with external stakeholders.&lt;/li&gt;\n&lt;li&gt;A flexible approach to job planning that delivers a working environment to best suit you and your team.&lt;/li&gt;\n&lt;li&gt;An opportunity for additional PA’s and coronial post mortem work.&lt;/li&gt;\n&lt;li&gt;A workload that is distributed amongst the team using Royal College guidelines for Histopathology and Cytopathology departments.&lt;/li&gt;\n&lt;li&gt;Opportunities to work with other local organisations to enhance your skills and experience.&lt;/li&gt;\n&lt;li&gt;Participation and support with local and national clinical trials.&lt;/li&gt;\n&lt;li&gt;Networking and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your valued contribution&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a strong background in Cellular Pathology and be a team player able to work as part of a sub-specialised team. Candidates should have full GMC registration (with a licence to practice) and be on the Histopathology Specialist Register or within 6 months of attaining their CCT or equivalent at interview stage. In addition, prospective candidates should hold the FRCPath or equivalent higher professional qualification.&lt;/p&gt;\n&lt;p&gt;This post provides an excellent opportunity to work with multi-disciplinary teams from a range of specialties so you will be someone who can create great relationships quickly and be adept at utilizing the skills of colleagues from other specialties within the organization and the community to provide a fully holistic approach to patient care.&lt;/p&gt;\n&lt;p&gt;You’ll be someone who remains calm under pressure, with an ability to take charge when needed with an encouraging and supportive approach. Your attention to detail and clear passion for delivering an efficient, high quality service will stand you out from the crowd.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups, individuals with disabilities and women are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Mayuri BasnetJob titleConsultant HistopathologistEmail addressmayuri.basnet@srft.nhs.ukTelephone number0161 206 1740Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Mayuri Basnet, Consultant Histopathologist on 0161 206170 or via email&lt;/p&gt;\n&lt;p&gt;Mayuri.Basnet@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Sami Titi, NCA Clinical Director for Cellular Pathology on 0161 656 1364 or via email:&lt;/p&gt;\n&lt;p&gt;Sami.Titi@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;We would welcome the chance to introduce you to our team and show you around our facilities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern Care Alliance, Salford and Oldham", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212497", "validThrough": "2020-11-29T23:59:59+0000"}