{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 p.a."}}, "datePosted": "2020-10-29T10:35:35+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;The Solent NHS Trust Estates Premises Team in &lt;/strong&gt;&lt;strong&gt;Southampton&lt;/strong&gt;&lt;strong&gt;are seeking 2 enthusiastic and customer focussed Reception Supervisors. This role is an exciting opportunity to join a forward-thinking Trust and Premises Team at a time of exciting change within the NHS.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This role will see the successful candidate based at Western Community Campus &amp; also at Bitterne Health Centre in Southampton but supporting remotely buildings across Hampshire &amp; the Isle of Wight. The successful candidates will be Line Managers for reception teams based on the Western Community Hospital, Adelaide Health Centre &amp; Pickles Coppice in the West of the city &amp;. Bitterne Health Centre &amp; Thornhill Centre for Healthy Living to the East of the city.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will be highly motivated individuals, capable of working independently and as part of a wider team. They will be approachable and highly customer focussed and take pride in the attractive appearance and smooth operation of Estates Site Management. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Under the guidance of the Estates Premises Manager they will support the operation of buildings and development of a customer focused highly utilised environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please contact Marie Ames on marie.ames@solent.nhs.uk for more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hampshire", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Reception Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247939", "validThrough": "2020-11-13T23:59:59+0000"}