{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T11:47:01+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Physiotherapist to join our team in a split Pelvic Health &amp; MSK physiotherapy role in the newly formed Cwm Taf Morgannwg University Health Board*. This will be predominantly a pelvic health role with a proportion of the week carrying an MSK caseload.&lt;/p&gt;\n&lt;p&gt;We are a small supportive team spread across 3 sites, delivering a comprehensive range of services in Gynaecology, Urogynaecology, Obstetrics, Urology and Sexual health. We are looking for an enthusiastic and proactive physiotherapist to join us.&lt;/p&gt;\n&lt;p&gt;Clinically you will work in the outpatient setting, carry an outpatient caseload, running classes and be involved in the wider MDT. You will participate in monthly IST, will have regular supervision and be supported to participate in quality improvement projects.&lt;/p&gt;\n&lt;p&gt;Please note this role may be based at any site and may include days with travel between sites based on the demands of the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have excellent communication and people skills; be competent at delivering physiotherapy intervention without direct supervision but with delegated autonomy within the scope of the role; be keen and eager to be involved in research and development, regular in service training and senior support; and to become an effective part of the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Closing Date: 19th November 2020.&lt;/p&gt;\n&lt;p&gt;* Cwm Taf Morgannwg University Health Board was created on 1st April 2019 and extents to the North and West of Cardiff – Wales’ cosmopolitan and multicultural capital city. Our location affords easy access from Cardiff and provides opportunities to participate in a wide range of outdoor activities. There are many areas of outstanding natural beauty nearby. To the north is the Brecon Beacons National Park and easy access to the fabulous coastal Gower Peninsula.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vonda Price - PelvicHealth Physiotherapy Team Lead&lt;/p&gt;\n&lt;p&gt;vonda.price@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01443 443277 or 01443 471515&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Glamorgan Hospital, Llantrisant", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Pelvic Health Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259508", "validThrough": "2020-11-19T23:59:59+0000"}