{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum pro rata inclusive"}}, "datePosted": "2020-11-04T14:31:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Radiographer (General Rotation)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Radiology&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 FTE 12 month fixed term contact&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Senior Rotational Radiographer&lt;/p&gt;\n&lt;p&gt;37.5 hours a week&lt;/p&gt;\n&lt;p&gt;Great Ormond Street is a world-renowned tertiary referral specialist children’s hospital, in the heart of Central London. We see children of all ages with a myriad of conditions, which provide for a truly interesting and varied workload in all modalities.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a Radiographer for our diagnostic service. This rotational position, at the core of the Service, provides a wealth of opportunity to those looking to be part of a high quality and respected department. This role would suit those with a minimum of two years postgraduate Radiography experience , looking to develop their specialist paediatric Radiography skills and utilise their clinical skills in a supportive and innovative department, where maintaining an excellent diagnostic service to patients and their families is key. Applications are invited from experienced radiographers wishing to expand their horizons and develop in an exciting and challenging role within our Radiology department.&lt;/p&gt;\n&lt;p&gt;You will be working closely with other members of the multidisciplinary team in providing this service. Good communication skills and excellent team working abilities are essential for this post.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please call Rebekah Bennison on ext. 1370 or Clare Simcock, Professional Lead Radiographer on ext. 5381&lt;/p&gt;\n&lt;p&gt;Great Ormond Street Hospital is located in central London close to Covent Garden and Oxford Street. The Trust values all their staff and has been awarded the Improving Working Lives Practice Plus standard. There is support for research activity and your CPD through provision of study leave and funding. There are also generous staff benefits available including subsidised accommodations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebekah BennisonJ&lt;/p&gt;\n&lt;p&gt;Superintendent Radiographer&lt;/p&gt;\n&lt;p&gt;Rebekah.Bennison@gosh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number Ext 1370&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital for Children, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256230", "validThrough": "2020-11-18T23:59:59+0000"}