{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-26T12:05:51+0000", "description": "&lt;p&gt;University College London Hospital staff bank are looking for Assistant Technical Officers to join our team within the UCLH Pharmacy. UCLH Pharmacy offer a comprehensive array of services with the overall aim of ensuring safe, effective and economical use of medicines throughout the trust.&lt;/p&gt;\n&lt;p&gt;The Assistant Technical Officer will ensure that medicines are ordered and supplied in a correct, Optimal and timely manner. They will undertake duties as part of the pharmacy team and support the work of other members of the team.&lt;/p&gt;\n&lt;p&gt;Main Duties will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To dispense medicines in an accurate and timely manner for inpatients and outpatients of the trust as directed by senior technicians using the pharmacy computer system and automated dispensing devices where in place.&lt;/li&gt;\n&lt;li&gt;To answer the telephones in a prompt and courteous manner whilst providing cover the Outpatient reception receiving prescriptions (following Standard Operating Procedures) checking payment exemptions and taking payment where appropriate&lt;/li&gt;\n&lt;li&gt;To ensure all filing of prescriptions and other documentation is complete&lt;/li&gt;\n&lt;li&gt;To ensure all medicines delivered to wards are placed in sealed bags to ensure security in the transport of medicines within the hospital&lt;/li&gt;\n&lt;li&gt;To print off electronic discharges&lt;/li&gt;\n&lt;li&gt;To ensure that the dispensary has adequate supplies of medicine bottles, bags spoons, measures and syringes and ordering these on a when required basis&lt;/li&gt;\n&lt;li&gt;To ensure equipment used in the dispensary is clean and ready for everyday use&lt;/li&gt;\n&lt;li&gt;Posting prescriptions to patients&lt;/li&gt;\n&lt;li&gt;Stock Management Duties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Essential requirement for the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 months aseptic dispensing/manufacturing experience&lt;/li&gt;\n&lt;li&gt;NVQ level 2 in pharmacy services or equivalent is desirable but not essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Assistant Technical Officer Band 2 &amp; 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242341", "validThrough": "2020-11-30T23:59:59+0000"}