{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T09:16:09+0000", "description": "&lt;p&gt;Matron for Pre-registration education&lt;/p&gt;\n&lt;p&gt;1.0 WTE (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;Are you an established Nurse educator who works in pre-registration non-medical education and has extensive experience managing practice placements? If so, this is a great opportunity for you. We invite applications into the role of Matron for Pre-registration education.&lt;/p&gt;\n&lt;p&gt;We envisage this post will play a lead role in developing new placement pathways and expanding existing placements. The post holder will take a creative approach to placements using existing and new technology as well as taking the opportunity to develop multidisciplinary placement allocations. The post holder will have accountability for the placement of nurses, midwives and allied health professionals including responsibility for the quality assurance of the practice learning environment analysing national directives.&lt;/p&gt;\n&lt;p&gt;They will also be responsible for the launch of a new evaluation model of the student experience and ensuring that this is fed back in a timely manner to the placement areas.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to manage the Learning and Development Agreement and its associated income related tariff budgets, deputise for the Head of Education, workforce plan, commission, provide cross cover and attend team meetings to share good practice, ensuring a high quality standardised approach to all pre-registration education.&lt;/p&gt;\n&lt;p&gt;The role-holder will provide the key link between the external academic institutes and Head of Nursing Education.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic forward thinking practitioner with a commitment to the student experience and developing our future workforce.&lt;/p&gt;\n&lt;p&gt;Whilst the post is based at New Cross Hospital there is a requirement for the post holder to support education across the organisation.&lt;/p&gt;\n&lt;p&gt;If you want to be part of this exciting opportunity to influence the education of pre-registration professional this may be the post for you.&lt;/p&gt;\n&lt;p&gt;For further information please contact: Head of Nurse Education- Catherine Wilson on C.wilson12@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine WilsonJob titleHead of Education- NursingEmail addressc.wilson12@nhs.netTelephone number01902 447299 Internal:8223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Wolverhampton NHS Trust- Newcross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Matron for Pre-registration Education", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253235", "validThrough": "2020-11-17T23:59:59+0000"}