{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-05T16:01:32+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM BANK POST UNTIL 28/02/2021 DUE TO MEET THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the Welsh Ambulance Service providing support to Covid-19 Mobile Testing Units (MTUs) based at Cardiff City Stadium and the Liberty Stadium, Swansea, testing patients (utilising self-test kit) who are exhibiting Covid-19/Coronavirus symptoms or who have come into contact with an individual who has tested positive for the disease.&lt;/p&gt;\n&lt;p&gt;The Mobile Testing Unit may be required to test members of the public at various locations across Wales, if a local outbreak of Covid-19 is confirmed and additional testing resources are required. This will ensure that applicants must be flexible and adaptable team players, willing to travel across the country with overnight stays (if required).&lt;/p&gt;\n&lt;p&gt;We have already established Mobile Testing Unit Teams in Cardiff, Swansea &amp; St Asaph and now look to provide bank opportunities to provide resilience to the teams as the rate of Covid infections remains prevalent across Wales. Opportunities exist for bank work at our Cardiff &amp; Swansea sites.&lt;/p&gt;\n&lt;p&gt;Successful applicants will possess excellent communication and interpersonal skills, reassuring members of the public who may be unwell or concerned about the requirement to undergo a test, or the testing process itself.&lt;/p&gt;\n&lt;p&gt;A range of shifts will be available for your to choose across the seven day week (no nights) and you should be flexible in your approach. You must also be prepared to work outdoors with appropriate training and PPE provided.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to provide real support to the NHS in the fight against Covid-19. If you are an effective communicator, good at dealing with the public in a stressful or potentially challenging situation, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Tell us in no more than 100 words why you feel you have the personal skills &amp; experience to succeed in this role, plus let us know your preferred location (Cardiff or Swansea).&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Catherine Mulligan Recruitment Manager&lt;/p&gt;\n&lt;p&gt;catherine.mulligan@wales.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123209.JPG", "name": "Welsh Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123209"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff City Stadium OR Liberty Stadium, Swansea, Cardiff or Swansea", "postalCode": "LL17 0RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2528", "longitude": "-3.43469"}}, "title": "BANK Mobile Testing Unit Operative", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258479", "validThrough": "2020-11-12T23:59:59+0000"}