{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive"}}, "datePosted": "2020-10-26T12:47:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Haematology/Oncology Daycare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These are exciting times for the progressive, rapidly expanding Haematology/Oncology Daycare at UCH. We provide highly specialised care for a wide variety of patient groups within haematology and oncology, between 8am and 8pm Monday to Saturday. Staff in this friendly and supportive team develop a range of advanced skills and knowledge by rotating between the 4 main areas of Daycare. Our Supportive care provides holistic care for haemoglobinopathy patients as well as follow-up and treatments for patients who have undergone high dose chemotherapy and bone marrow transplant. We have a busy and varied chemotherapy suite; and a highly respected Apheresis service which includes the peripheral blood stem cell harvest programme, and therapeutic plasma exchange. We have received a great deal of positive publicity for our Ambulatory Care project, where patients undergo high dose chemotherapy and bone marrow transplants as a day-case while staying in a nearby hotel. The Haematology/Oncology Unit as a whole is a sociable, fast moving and progressive area which actively supports nurse led activities and research and offers excellent opportunities for professional and personal development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Staff Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The candidate is required to have existing specialist haemato-oncology experience to meet the requirements of the position at entry (foundation) level with a minimum of 45 credits at Level 3 or equivalent (30 of which must be haematology / cancer nursing education). Who is competent in chemotherapy administration and patient education. They must possess knowledge and skills in all areas of IV administration (including blood products) and be competent in Cannulation and Venepuncture. The successful candidate will be given the opportunity to further develop their competencies within Haemato-Oncology by working in the 4 main areas of our large cancer daycare unit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information, please contact:&lt;/p&gt;\n&lt;p&gt;Helen Keane, Haematology Matron, helen.keane@nhs.net&lt;/p&gt;\n&lt;p&gt;Tom Marler-Hausen, Chemotherapy Matron, tom.marler-hausen@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Senior Staff nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242522", "validThrough": "2020-11-09T23:59:59+0000"}