{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-05T16:01:16+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for innovative and enthusiastic Nurse to work in Rehabilitation and Recovery Services as Band 6, Deputy Ward Manager.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic individual who will have the opportunity to work with experienced teams. You would need to provide leadership, role modelling and clinical skills. We are looking for the post-holders to be enthusiastic, dedicated and flexible to the service.&lt;/p&gt;\n&lt;p&gt;Our unit/wards and wider services benefit from a welcoming, warm, multi-disciplinary team made up of Psychiatrists, Health Care Support Workers, Mental Health Nurses, Occupational Therapists, Physiotherapists and Psychologists. These are exciting opportunities for enthusiastic applicants.&lt;/p&gt;\n&lt;p&gt;You will be required to act in the role of clinical specialist and as part of the management team in the running of a busy service, providing both clinical and managerial leadership to junior staff.&lt;/p&gt;\n&lt;p&gt;We are committed to continuous learning to improve patient care and are looking for a Registered nurse who has up-to-date knowledge of underpinning drivers/legislation/research &amp; experience of mental health rehabilitation would be an advantage.&lt;/p&gt;\n&lt;p&gt;We are committed to the ethos of the recovery model promoting hope, optimism and innovative ways of working in partnership with patients and families.&lt;/p&gt;\n&lt;p&gt;We are also searching for nurses who share our values that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about the people we serve and the people we work with&lt;/li&gt;\n&lt;li&gt;We trust one another&lt;/li&gt;\n&lt;li&gt;We respect each other&lt;/li&gt;\n&lt;li&gt;We take personal responsibility&lt;/li&gt;\n&lt;li&gt;We treat people with kindness&lt;/li&gt;\n&lt;li&gt;We act with integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we will offer you a dynamic, friendly working environment, a full induction programme and an individual personal development plan to guide your development within the role.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale University Local Health Board is situated in the vibrant easily accessible capital of Wales which combines the best of city life, coast and countryside.&lt;/p&gt;\n&lt;p&gt;Boasting affordable housing, high performing schools and excellent sporting and cultural venues, Cardiff has been voted the best place to live in the UK.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Senior Nurse Manager Mary Morgan on 029 21 824979/02921 832610. mary.morgan4@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hafan Y Coed, Llandough, Cardiff", "postalCode": "CF64 2LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4506", "longitude": "-3.19934"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258468", "validThrough": "2020-11-19T23:59:59+0000"}