{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 per annum incl. of LW"}}, "datePosted": "2020-11-03T17:30:44+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust is one of the UK’s largest and busiest teaching hospitals with over 1.5 million patient contacts a year and more than 13,000 staff based across five main sites in South East London and Kent.&lt;br /&gt;&lt;br /&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;br /&gt;&lt;br /&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;br /&gt;&lt;br /&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Consultant Haematologist in General &amp; Consultative Haematology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time post providing 10 Programmed Activities (PAs) with an on call commitment (1:10). The postholder will be working within the multi–disciplinary Haematology team to provide and develop General and Consultative Haematology services.&lt;/p&gt;\n&lt;p&gt;This post covers the General Haematology service, including autoimmune cytopenias, haemolytic anaemias, haematinic disorders and other general haematological conditions. There are interfaces with many disciplines including general and specialist medicine, obstetrics, renal, liver, neurosciences, cancer, and surgery. The appointee will help develop and deliver benign haematology services, with the option to develop specialist services as per their interest and experience.&lt;/p&gt;\n&lt;p&gt;The post holder will provide telephonic and digital advice to GPs, triage referrals electronically and lead the management of Advice and Guidance as well as Consultant Connect services for the department.&lt;/p&gt;\n&lt;p&gt;The post holder will have a major training role for haematology trainees at King’s, with a particular focus on supporting laboratory and consultative haematology aspects of training at King’s. The post holder will supervise the registrars receiving inpatient referrals for haematology advice and will be expected to help develop a robust electronic referral system and tracking of follow up. Additionally, the post holder will lead on supervision of the registrar/biomedical scientist reporting of routine blood films.&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the GMC and hold a Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent to be eligible for interview.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years), therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975, and as such, it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Professor Roopen Arya, Clinical Director&lt;/p&gt;\n&lt;p&gt;roopen.arya@nhs.net, 020 3299 3570&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 26/11/2020, midnight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AAC: Interview Date: 09/12/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Consultant Haematologist with a Special Interest", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254934", "validThrough": "2020-11-26T23:59:59+0000"}