{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-10-28T15:47:51+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For applicants within the Dorset ICS (for those working in NHS, Primary Care or social care in Dorset) only&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;Are you passionate about making a difference? Interested in helping NHS and social care providers growing their most valuable asset, their workforce? Looking for a Project Officer role like no other? This could be the role for you and the opportunity you&#39;ve been looking for.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The NHS and local authorities are working together to provide sustainable health and care services for our population in Dorset. The mechanism for driving this work forward is through our Integrated Care System and one of the biggest challenges is workforce. Nationally and locally there is a shortage of clinical and care staff to recruit from and the ‘Leading and Working Differently’ portfolio is one of the portfolios within our Integrated Care System and our dedicated Workforce Delivery Team and Primary Care Training Hub have been established with a mandate to work with and on behalf of the individual organisations to improve the retention, attraction, recruitment and development of our current and future NHS and care workforce.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As one of the first Integrated Care System teams in Dorset, we are breaking new ground and challenging tradition by working with others to identify and overcome barriers and opportunities. Our workforce is our biggest asset therefore we must involve them in the changes that we make, find new ways to retain and develop our people whilst attracting new people to work with us, including those who may not traditionally have chosen a career in health or care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a full time Project Support Officer to join us in our diverse and dynamic team, supporting a variety of partners to enhance their workforce. You will work closely with partners across the NHS and care sector providing project support linking with workforce leads to understand and enhance their workplace training and offer. This role is particularly weighted to engagement with Primary Care. This is a 12 month fixed term or 12-month secondment opportunity.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In order to be successful in this position, you will need to have proven experience pf project management, be able to demonstrate excellent communication and facilitation skills, be able to multi task and prioritise workload whilst providing high level of support to a variety of partners within the Dorset ICS. You&#39;ll need to be agile and able to think differently, be creative and work within specific parameters in order to meet objectives and milestones.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You&#39;ll be comfortable with working with a wide range of partners, matrix management and using your own initiative, whilst also experienced at keeping projects progressing against specific plans and timelines.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll be passionate about making improvements, about collaborating to deliver the best results and building the workforce for the future.&lt;/p&gt;\n&lt;p&gt;This role will be based in West Moors and travel to other sites across Dorset may be required. Due to the current Covid-19 restrictions you will be required to work remotely in the first instance. The Our Dorset Workforce Development Team and Primary Care Training Hub support the primary care, hospital, community and social care providers within Dorset along with external partners such as education providers and Health Education England. The priority areas of support include workforce planning, career support, recruitment and retention, education and development of new roles.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Moors", "postalCode": "BH21 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8374", "longitude": "-1.88272"}}, "title": "Project Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247263", "validThrough": "2020-11-15T23:59:59+0000"}