{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a. pro rata"}}, "datePosted": "2020-11-04T13:01:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Acute Neonatal Transfer Service (ANTS) for the East of England is one of the busiest neonatal transfer teams in the UK providing emergency and elective transfers 24/7, 365 days a year.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;This post offers you comprehensive experience in all aspects of neonatal transport medicine. You will work as part of a busy, dedicated, neonatal transport service which completes over 1200 transfers per year (&gt;600 emergency transfers). In addition to the clinical experience gained, this post is ideal if you wish to develop your skills in logistical planning, prioritisation and trouble-shooting. You will also be encouraged to undertake quality improvement projects and to develop your teaching skills by involvement in outreach visits and the local education programme and simulation training. &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;This is an exciting time to join the team as Funding of £128m for a new children’s hospital in Cambridge to open in 2023 was announced in 2018. Plans for a new regional Paediatric and Neonatal care retrieval service are now well advanced.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;As a member of the tier 2 rota there is an expectation of leading emergency transfers, with consultant support by telephone. You will need to have experience as an ANNP with independent prescribing qualifications. Freedom to act and with competence is essential to being successful and safe in the role. It will be necessary to manage complex transfers using professional judgement, safe decision making and discretion to ensure the best outcomes for the patient, family and colleagues. There will also be times where you will be required to act in a nursing role or as a single clinician on transfer. As a member of the senior team you will have a professional responsibility to develop other staff, the service and the parent experience by engaging in educational and governance activities. You must be flexible with your approach and time.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Strong leadership and professionalism are key qualities required to successfully role model.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 15 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held in the week commencing 30 November 2020&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Sajeev Job&lt;br /&gt;Job title:  ANTS Clinical Lead&lt;br /&gt;Email address:  sajeev.job@addenbrookes.nhs.uk&lt;br /&gt;Telephone number:  01223 274274&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Senior ANNP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255946", "validThrough": "2020-11-15T23:59:59+0000"}