{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-16T12:02:11+0100", "description": "&lt;p&gt;Applications are invited from appropriately qualified and experienced candidates in Paediatric Surgery. The post has arisen due to planned expansion of the Department. We have an established team of thoracic, upper &amp; lower GI, oncology and endocrine paediatric surgeons and are looking for enthusiastic applicants to complement other members of the Department. There is one substantive post available. The successful candidate will be expected to develop a sub specialty interest in lower gastrointestinal surgery to compliment the clinical requirements of the team. Applicants will be invited to spend a day in the department to meet the team.&lt;/p&gt;\n&lt;p&gt;The new Royal Manchester Children’s Hospital, a state of the art facility, opened in June 2009 as part of a £0.5 billion hospital development comprising new facilities for the Royal Eye Hospital, the Dental Hospital and Manchester Royal Infirmary. The hospital provides children’s emergency, secondary and regional tertiary services.&lt;/p&gt;\n&lt;p&gt;The Department of Paediatric Surgery provides a secondary service, together with a busy tertiary service which forms a large proportion of our workload. We are co-located with St Mary’s Hospital which has one of the largest Neonatal units in the UK.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for the successful applicant/s to contribute to the service at the Royal Manchester Children’s Hospital.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to apply for an Enhanced Criminal Records Bureau Disclosure.&lt;/p&gt;\n&lt;p&gt;Interested applicants should complete an application form via the NHS jobs portal.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Ross CraigieJob titleConsultant Paediatric SurgeonEmail addressross.craigie@mft.nhs.ukTelephone number0161 701 2194Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information, please contact Mr Neil Bateman, Clinical Lead on 0161 701 5309 Mr Paul Farrelly, Specialty Lead on 0161 701 2194&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Manchester Children&#39;s Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Consultant Paediatric Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230031", "validThrough": "2020-11-08T23:59:59+0000"}