{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-26T14:01:18+0000", "description": "&lt;p&gt;Buckinghamshire NHS Trust is delighted to announce an opportunity for a Physiotherapy Community Practitioner Band 6 to work in our Rapid Response &amp; Intermediate Care Team based at William Rathbone House Stoke Mandeville Hospital Aylesbury HP21 8AL&lt;/p&gt;\n&lt;p&gt;The service promotes an integrated approach working with nursing and social care colleagues to provide care for patients in the community setting The team supports rapid response to prevent hospital admissions, rehabilitation, and end of life care. In addition you will be working with colleagues in the acute to facilitate timely discharges from hospital.&lt;/p&gt;\n&lt;p&gt;You should have a wide range of clinical expertise within the NHS ideally with experience of working in a community multidisciplinary team environment and have managed healthcare assistants&lt;/p&gt;\n&lt;p&gt;As an expert clinical resource for the team you will be expected to support staff in identifying and developing their knowledge and skills. You must be innovative in your approach and willing to work with other members of the community team to ensure high quality service delivery.&lt;/p&gt;\n&lt;p&gt;In order to respond to the healthcare needs of the local population the teams operate 7 days a week ensuring the delivery of a service which can react to the patients’ needs as and when required. The shifts for Rapid Response and Intermediate care Case Managers will be between the hours of 8 am - 8 pm including weekend and bank holiday working as part of the rota. The successful candidates will be expected to work within these shift patterns.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to supporting ongoing education of Allied Health Professionals and there are opportunities for staff to progress their careers with our leadership programmes.&lt;/p&gt;\n&lt;p&gt;You will need to have a full driving license and access to a car for work purposes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Hallett, RRIC Clinical Lead North&lt;/p&gt;\n&lt;p&gt;Email address : h.hallett@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 07816174032&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Rathbone House, Stoke Mandeville Hospital, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "RRIC Community Practitioner Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242800", "validThrough": "2020-11-09T23:59:59+0000"}