{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32145", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,145 Incl Fringe HCAS"}}, "datePosted": "2020-11-02T18:16:14+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;RECONNECT&lt;/strong&gt; – care after custody for women leaving prison&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Surrey and Borders Partnership Foundation Trust, working in partnership with Catalyst and Barnardo’s, are proud to be the preferred provider of Liaison and Diversion services to the Surrey community.&lt;/p&gt;\n&lt;p&gt;Surrey will be utilising its new Liaison and Diversion Service (L&amp;D) contract to deliver Reconnect services. With the L&amp;D service, people of all ages passing through the criminal justice system are assessed and those with mental health, learning disability, substance misuse and other vulnerabilities are identified as soon as possible in the justice pathway. Identified individuals are provided with and supported to access appropriate services including, but not limited to, mental and physical health care, social care, substance misuse treatment and safeguarding.This is an exciting opportunity for someone who is willing to be part of a developing innovative team working to support females leaving prison.&lt;/p&gt;\n&lt;p&gt;Our vulnerabilities service seeks to support a variety of people who have come into contact with the criminal justice system to ensure person centered, focused and community-based interventions which will improve health and social care outcomes whilst reducing offending and supporting the best possible decision making within criminal justice partnerships.&lt;/p&gt;\n&lt;p&gt;Our service has been nationally recognised for its approaches and for its proactive application of national guidance and we intend to continue our pursuit of being the best provider of liaison and diversion services in the country. Because of continued investment our collaborative is making exciting changes which will benefit our community in new and different ways. This well-resourced, well-staffed and nationally recognised team is seeking a Reconnect Liaison and Diversion Practitioner to work as part of the team to improve access to health and support services for vulnerable individuals who are leaving prison&lt;/p&gt;\n&lt;p&gt;You will work as part of the Specialist Services Division with peers in Liaison Psychiatry, Forensic Outreach Liaison Services, Perinatal and FIND services and in collaboration with our wider Trust commitment to inclusivity.&lt;/p&gt;\n&lt;p&gt;They will also use their unstoppable positivity to raise the profile of the service and to ensure that, through excellent partnership working, we improve health and social care outcomes for people using this service. The postholder will be flexible enough to put the needs of the people who use the service at the forefront of their decision making, they will be confident enough to achieve our Trust&#39;s visions and values consistently and they will be committed enough to ensure that we achieve not only the national standards for Liaison and Diversion, but also that we continually strive to exceed all expectations.&lt;/p&gt;\n&lt;p&gt;The role requires both an enhance DBS clearance and Surrey Police Clearance.&lt;/p&gt;\n&lt;p&gt;For more information on L&amp;D Services nationally please visit NHSE&#39;s Health and Justice Commissioning webpages.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Sarah Truran, Service Manager for further details on this role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details please see the Job Description and Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey Wide", "postalCode": "GU2 7LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2351", "longitude": "-.584444"}}, "title": "RECONNECT - Liaison and Diversion Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253049", "validThrough": "2020-12-13T23:59:59+0000"}