{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-03T13:16:00+0000", "description": "&lt;p&gt;We are looking for Paediatric surgical nurses to join our committed and evolving ambulatory team, with a focus on caring for our children, young people and their families through their elective surgical journey. If you are an enthusiastic and motivated Paediatric Nurse, enjoy working in a fast pace environment and are keen to learn new skills we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are currently expanding our nursing team to provide a dedicated service for Paediatric day surgery including ENT, Orthopaedics, Urology, Ophthalmology and Gastroenterology.&lt;/p&gt;\n&lt;p&gt;We have a new Children’s Surgical Day Unit and Woodlands Ambulatory Unit at Tunbridge Wells Hospital and day surgery is also carried out on Riverbank Ambulatory unit at Maidstone Hospital. The day surgery units are open Monday to Friday only from 0700-1930, shift patterns are flexible and can include short shifts.&lt;/p&gt;\n&lt;p&gt;Staff will be required to work on both of our sites when required and if no surgery is carried out then you can develop key assessment skills on our ambulatory units which will compliment your surgical role. Site preference can be taken into account however some movement will be required dependent on service need&lt;/p&gt;\n&lt;p&gt;If you would like any further information please do not hesitate to contact Michelle Wickens Ambulatory Ward Manager and Lead for Paediatric Surgery on 07523942263 or email me on michellewickens@nhs.net.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Wickens, Paediatric Ward Manager and Paediatric Surgical Lead, michellewickens@nhs.net, 07523942263&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells Hospital", "postalCode": "TN2 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Paediatric Surgical Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254102", "validThrough": "2020-11-17T23:59:59+0000"}