{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-£110,683 per annum pro-rata"}}, "datePosted": "2020-11-05T11:31:05+0000", "description": "&lt;p&gt;Applications are invited for a Locum Consultant Anaesthetist with a specialist interest in General Anaesthesia at Cambridge University Hospitals NHS Foundation Trust (CUH) to commence as soon as possible for 12 months.&lt;/p&gt;\n&lt;p&gt;The successful candidates will join an expanding, innovative and dynamic department of 85 Consultants, 40 Trainees and 20 Senior Clinical Fellows/Clinical Fellows, providing anaesthetic services in this thriving, modern teaching hospital. Addenbrooke’s not only provides a broad range of medical services for people living in the Cambridge area but is also a regional/supra-regional referral centre for a number of specialties including cancer surgery, neurosurgery, transplantation, plastic surgery, vascular surgery and paediatrics. As a world-renowned teaching hospital, there is unparalleled capacity for teaching and research including involvement in the high fidelity simulation centre, and research projects within the department as well as the wider biomedical campus.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a growing team of general Anaesthetists who support a large range of services within this large tertiary hospital. The general anaesthetic group are a diverse range of professionals with subspecialty interests ranging from major general, oncology, trauma &amp; orthopaedics, vascular, and complex airway.&lt;/p&gt;\n&lt;p&gt;The on-call role currently involves an orthopaedic trauma list during the evening once a week, though this may change due to service needs or deficiencies in other rotas.&lt;/p&gt;\n&lt;p&gt;Applicants will be fully registered with the GMC and have a CCT (or equivalent) in Anaesthesia or be within six months of receiving a CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013).&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Dr Rebecca Owen&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Further information, in the first instance, may be obtained by contacting Dr Rebecca Owen, Subspecialty Lead for General Anaesthesia; Dr Brock Andreatta, Clinical Lead for Anaesthesia or Dr Hemantha Alawattegama, Clinical Director for Perioperative Services , via the Anaesthetics Department on 01223 216292 or via e-mail at rebecca.owen@addenbrookes.nhs.uk, brock.andreatta@addenbrookes.nhs.uk or hemantha.alawattegama@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Locum Consultant Anaesthetist (Specialist in General)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257454", "validThrough": "2020-11-25T23:59:59+0000"}