{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 inc fringe HCA"}}, "datePosted": "2020-10-05T16:04:42+0100", "description": "&lt;p&gt;A unique opportunity has arisen within the east locality community teams. We have 2 Community Mental Health Recovery Service (CMHRS) manager posts; a permanent and a 9 month secondment opportunity.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced, personable and credible manager to support the CMHRS teams through the current community transformation. We are seeking an enthusiastic person, who has strong leadership and clinical experience to support the busy CMHRS teams.&lt;/p&gt;\n&lt;p&gt;This role provides you with the opportunityto join a skilled, experienced and diverse leadership team focusing on improving mental health services for our communities.&lt;/p&gt;\n&lt;p&gt;The post holder will support the delivery of operational and strategic duties with the day to day running of the service. This role will suit someone who is dynamic, flexible with a ‘can do’ attitude and has an appetite to expand their leadership and operational managerial skills. In return you will benefit from working with an experienced group of managers, as well as peer support and supervision. The exposure to development opportunities will support your future career development.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill, Surrey", "postalCode": "RH1 1TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2396", "longitude": "-.17157"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213498", "validThrough": "2020-11-11T23:59:59+0000"}