{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on skills and experience"}}, "datePosted": "2020-11-03T15:36:19+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;WE ARE RECRUITING FOR AN ADVANCED CLINICAL PRACTICE MANAGER IN SCARBOROUGH &lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;A fantastic opportunity and a fresh, rewarding challenge has arisen to join Central Healthcare in Scarborough as a Manager of the Advanced Clinical Practice Team.&lt;/p&gt;\n&lt;p&gt;You will provide visible clinical leadership and operational management to the Advanced Clinical Practice Team, delivering an effective and quality driven service to Practice patients. You will train, supervise, monitor and manage the performance of the Advanced Clinical Practice Team, the systems and processes required for the team to function efficiently and delegate duties where appropriate.&lt;/p&gt;\n&lt;p&gt;As a clinical practitioner acting within your professional boundaries, you will work autonomously, enabled by a collaborative and supportive working relationship with a designated clinical supervisor. You will deliver safe, effective clinical decision making and expert quality care, including assessment, diagnosis, clinical management and evaluation to the Practice population. You will have the attitude, skills and knowledge base to deliver quality holistic care and treatment. You will work collaboratively to meet the needs of patients, ensuring the highest standards of care, supporting the delivery of policy and procedures.&lt;/p&gt;\n&lt;p&gt;You may be a Registered Nurse, Paramedic or Physiotherapist, qualified with an appropriate Master’s Degree in Advanced Clinical Practice relevant to Primary Care or those in training.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, flexible and reliable individual who is passionate about patient care and safety. You will have the ability to communicate effectively with clinicians, patients and support staff. You will be a highly valued member of the team, receiving ongoing personal development and training opportunities.&lt;/p&gt;\n&lt;p&gt;For more information about Central Healthcare, please visit out website. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability &lt;strong&gt;after&lt;/strong&gt; candidates are invited to interview and &lt;strong&gt;only&lt;/strong&gt; if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO11 1UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2773", "longitude": "-.409719"}}, "title": "Advanced Clinical Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254592", "validThrough": "2020-11-24T23:59:59+0000"}