{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "60000", "unitText": "YEAR", "value": "£60,000 + bonuses"}}, "datePosted": "2020-10-27T13:16:08+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;General Manager – Family Practice Group &amp; Brigstock Skin &amp; Laser Centre&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;£60,000 + Bonuses&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will be passionate about delivering the finest customer service in a small group of services that include NHS general practice and private aesthetic services. You will have exacting standards and a determined approach to working with the other members of the leadership team in the expansion of these successful CQC registered services, maintaining their excellent reputations. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will be an experienced PMS/GMS general practice manager searching for your next career move. You will be closely coached and developed by an established entrepreneur with a business portfolio which includes hospitality, property and other NHS health care services. Previous business success has been driven in part by an ethos which focusses on the personal and professional growth of all team members and will focus on enabling you to reach your personal and professional goals. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will build upon the existing scalable reporting and operational processes that deliver exacting standards and an excellent reputation with commissioners, patients, clients and CQC inspectors. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will be taking charge of two established and enthusiastic operational teams who deliverthe success of the services. Your role as the registered manager of these services will include optimising standards of service, efficiency and compliance. You will be rewarded through, bonuses that reflect your successful delivery of these. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As General Manager you will be trusted to deliver this growth through:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Maximising the revenue and profitability of the business by driving performance and efficiency through the delivery of robust systems and reporting processes.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Leading, motivating and managing your direct reports to deliver consistently high levels of performance&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Delivering high quality, training and up-skilling of the team &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Delivering key strategic objectives as identified within regular quarterly and annual meetings&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Delivering exceptional quality customer service.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Testing and measuring results to enable the development and enhancement of new and existing processes and procedures.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Maintain excellent visibility of sales, revenue and operational activity though effective and streamlined reporting to improve performance.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Job requirements&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Educated to degree level with at least 5 years&#39; experience gained within the General Practice.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Evidence of delivering and successful CQC inspections&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Competent using IT systems including EMIS, Gmail; My Drive; Word; Excel and ideally ClinicSoftware&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Excellent organisational skills&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;An ambitious can-do solution focused attitude&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;If you fulfil the above criteria and looking for your next challenge, please apply for this role.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brigstock Family Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135454"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thornton Heath", "postalCode": "CR7 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3973", "longitude": "-.103387"}}, "title": "General Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244685", "validThrough": "2020-11-10T23:59:59+0000"}