{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 £37,570 to £43,772 pa"}}, "datePosted": "2020-10-06T14:45:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist 0.8 WTE / 30 hours Band 8a &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newly qualified Clinical Psychologists are also able to apply for this post on a Band 7 preceptorship (37.5 hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Clinical Psychologist to join our busy community services for children, young people and their families. We have the option of appointment to a part-time (30 hours) 8a post for suitably qualified and experienced candidates, or appointment to a Band 7 preceptorship (37.5 hours) for a newly qualified Clinical Psychologist. We will consider applications from current final year clinical psychology trainees qualifying in 2020.&lt;/p&gt;\n&lt;p&gt;The post will be based at: &lt;strong&gt;Whitegate Health Centre, Blackpool, FY3 9ES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role is within:&lt;strong&gt; Blackpool Children’s Psychological Service (CPS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The service is co-located with other Blackpool children’s services (including Specialist CAMHS and Looked After Children).&lt;/p&gt;\n&lt;p&gt;Clinical Psychologists in CPS work with a range of presentations including: the psychological impact of Physical Health difficulties, issues arising from Autism Spectrum Conditions, Emotional and Behavioural difficulties and/or Trauma.&lt;/p&gt;\n&lt;p&gt;We support our staff to deliver high quality and innovative psychological solutions with service-users through consultation, parent workshops, individual, systemic/family, and group work. There will be opportunities to further develop areas of clinical interest relevant to the employed role. Staff working within our services have benefitted from a range of development opportunities including in-house training alongside colleagues and specific therapies training and supervision (e.g. EMDR, VIG, Thera play, DDP).&lt;/p&gt;\n&lt;p&gt;There will be ample opportunity for post-qualification support, supervision and consolidation of core competencies alongside more experienced colleagues both locally and across the region. All clinical psychologists have an agreed Job Plan which protects their core clinical commitments and allocated time for agreed projects. Newly qualified clinical psychologists will also be offered a place on our cross-specialty in-house support and CPD programme.&lt;/p&gt;\n&lt;p&gt;There will also be opportunities to support the broader aims of leadership activity through indirect work, delivering training, and service development/audit activities. Where required, we will also support staff to develop competencies in clinical supervision as part of their professional development plan. We have good links with the North West Clinical Training courses and encourage staff to offer core and specialist placements to trainees.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Lancashire &amp; South Cumbria NHS Foundation Trust due to a regional service re-design in line with the ‘Thrive’ model. Thrive places service-users at the heart of service-delivery with a focus on needs-led services and shared decision-making.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Julie Warburton, Consultant Clinical Psychologist Julie.warburton@lancashirecare.nhs.uk&lt;/p&gt;\n&lt;p&gt;Jennie Wynn, Team Leader – Blackpool, Fylde and Wyre jennie.wynn@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CAMHS Community Psychology Blackpool (MH), BLACKPOOL", "postalCode": "FY3 9ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.813", "longitude": "-3.0346"}}, "title": "Clinical Psychologist - Band 7 Preceptorship to 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215084", "validThrough": "2020-11-17T23:59:59+0000"}