{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £43,772 per annum"}}, "datePosted": "2020-11-05T11:46:10+0000", "description": "&lt;p&gt;&lt;strong&gt;2020 is the Year of the Nurse – why not make it your year starting with a career in Critical Care at the William Harvey Hospital?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a fantastic career opportunity in forward thinking critical care environment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can even offer a relocation package.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a full time opportunity for a Band 7 ward manager within the Critical Care department at The William Harvey Hospital in Ashford, Kent.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on delivering consistently high standards of holistic care. This is reflected in our CQC reports, ICNARC data, performance metrics and feedback from patients, relatives and visitors to our unit.&lt;/p&gt;\n&lt;p&gt;We have a busy, mixed level unit admitting emergency and elective patients from a variety of specialities. These include maxillo-facial surgery and pPCi covering Kent. We are excited to announce that we are expanding to 24 beds in a new purpose built Intensive Care unit within the next 6 months.&lt;/p&gt;\n&lt;p&gt;We are a friendly, supportive and dynamic team with a strong commitment to professional development. Critical Care is fully committed to audit and research and provides a dynamic environment conducive to gaining additional knowledge and skills.&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic, energetic, and innovative and self- motivated ward manager to join our well established and diverse team. As a ward manager you will be expected to act and lead our large workforce, to set and maintain the high clinical standards we all aspire to. The ideal candidate will have had minimum 2 years as Band 6 experience as and will need to demonstrate a pro-active and adaptive approach to leadership and management with a positive mind-set and hold an interest in working within a fast moving unit. They must be a good and effective communicator, who can demonstrate problem solving skills with the ability to work under pressure, managing staff and delivering patient focused care. They will be able to demonstrate flexibility to meet the varied demands of the role as required.&lt;/p&gt;\n&lt;p&gt;There are excellent developments and educational opportunities .As a leader it’s important that we develop the right skills, the right set of behaviours and culture in order for us to motivate and engage our colleagues.&lt;/p&gt;\n&lt;p&gt;At EKHUFT the learning and development team for the trust, support our leaders through each step of their journey, from the first manage-ment role and beyond.&lt;/p&gt;\n&lt;p&gt;We will offer both classroom based learning and bespoke advice.&lt;/p&gt;\n&lt;p&gt;. Applicants must have:&lt;/p&gt;\n&lt;p&gt;· Critical care course&lt;/p&gt;\n&lt;p&gt;· Extensive clinical leadership/team management experience&lt;/p&gt;\n&lt;p&gt;· Expert skills in caring for both Level 2 and Level 3 patients&lt;/p&gt;\n&lt;p&gt;· A Degree or equivalent level of education and experience&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· People feel cared for as individuals&lt;/p&gt;\n&lt;p&gt;· People feel safe, reassured and involved&lt;/p&gt;\n&lt;p&gt;· People feel that we are making a difference&lt;/p&gt;\n&lt;p&gt;· People feel teamwork, trust and respect sit at the heart of everything we do&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:n&lt;/p&gt;\n&lt;p&gt;Anna Reilly, Ward Manager on 01233 633331 ext 7236114 or anna.reilly@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Ward Manager Critical Care Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257500", "validThrough": "2020-11-19T23:59:59+0000"}