{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum (YC73)"}}, "datePosted": "2020-10-30T11:31:51+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Be part of an ambitious and forward thinking Acute Medicine service&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following recent successful recruitment, these new appointments afford an exciting opportunity to join a rapidly developing and expanding Acute Medicine Team. The Acute Medicine Service currently has eight Consultants supported a large junior medical team as well as a team of 6 Advanced Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;The posts offer 10 programmed activities with additional programmed activities available on agreement. The new appointees would be expected to complement the existing services which provide rapid and high quality senior assessment and management for patients referred to the Medical Team from the Emergency Department or by their GP.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit consists of 48 beds with a 4 bedded area for Enhanced Care provision for patients, with an enhanced nurse-patient ratio. There is also a co-located 8 cubicles and 6 trolley assessment area for Assessment as well as provision of Ambulatory Emergency Care. We also provide follow up for patients in the AMU Outpatient Clinic.&lt;/p&gt;\n&lt;p&gt;The Trust and Acute Medicine Team are committed to education and training. We are consistently highly rated in all domains of the GMC Annual Trainee Survey. There is a well-developed teaching/training programme with excellent postgraduate facilities.&lt;/p&gt;\n&lt;p&gt;This post will be subject to an Enhanced DBS disclosure with barred lists for adults and children.&lt;/p&gt;\n&lt;p&gt;Applicants must hold full registration with the GMC at the time of application.&lt;/p&gt;\n&lt;p&gt;Due to the short term nature of the role, the successful candidate must hold full registration with the GMC and have existing right to live and work in the UK, at the time of application. &lt;em&gt;Candidates who are not GMC registered or do not hold existing right to live and work in the UK, at the time of application will not progress through the shortlisting stage.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – Inspection August 2018 and March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: To be Confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Dr Ragit Varia, Clinical Director for Acute Medicine on 0151 426 1600 (Extension 1148).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston Hospital, Prescot", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Locum Consultant in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249963", "validThrough": "2020-11-26T23:59:59+0000"}