{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39169", "minValue": "36231", "unitText": "YEAR", "value": "£36,231 to £39,169"}}, "datePosted": "2020-11-05T14:38:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Nurse Specialist (fixed term)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated Clinical Nurse Specialists to join our new locality based care teams in the community - either on a permemant basis or for a fixed term contract of 6 or 12 months. Farleigh Hospice is a high performing organisation providing specialist palliative care, and end of life care for people with life limiting illness in the Mid Essex region, and we have undergone a significant clinical reorganisation to move to a locality-based model of community care. The localities are multidisciplinary, consist of a range of disciplines including nursing, therapy, medical, psychosocial, and care staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Based in a specific locality of Mid Essex, the extensive MDT will deliver holistic care to patients at all stages of end of life from ‘stable’ to ‘unstable, deteriorating and dying’ in line with the national palliative care classification. The team will also provide essential support to carers and family members.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be an empathetic nurse specialist with excellent communication skills, have a passion for service improvement within healthcare. You will build and maintain strong relationships with colleagues and other health professionals to deliver the best possible care for our patients ensuring Farleigh Hospice is as an integral part of the local health and care economy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be supported by a dedicated team and have access to excellent professional leadership.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return, we offer a great working environment, a competitive pay and benefit package, flexible working and a strong team to support you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are excited as we are about the role we look forward to hearing from you. Please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Heather Sach-Matthews at heather.sachmatthews@farleighhospice.org&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Dr Matt Sweeting, Director of Care, at matt.sweeting@farleighhospice.org&lt;/p&gt;\n&lt;p&gt;for an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Farleigh Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130116"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM1 7FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7765", "longitude": ".467758"}}, "title": "Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258140", "validThrough": "2020-11-22T23:59:59+0000"}