{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16900", "minValue": "13520", "unitText": "YEAR", "value": "£13,520 - £16,900 per session"}}, "datePosted": "2020-10-27T11:25:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Calling All Self-Employed GPs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group, along with other independent providers of healthcare services are working with the NHS in a collective effort to combat the crisis posed by COVID-19.&lt;br /&gt; &lt;br /&gt; In our collective response to COVID-19 Practice Plus Group, we are seeking applications from self-employed GPs to respond to increased demand in calls to our Out-of-Hours services.&lt;br /&gt; &lt;br /&gt; In particular, we are recruiting for face-to-face clinicians who can work in our primary care bases as well as conducting home visits to patients.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the largest provider of unscheduled care services in the UK and we proudly continue to lead the way with innovation in line with the vision of the NHS. This means we have a constant need to add to our bright and dynamic medical team to ensure we continue to fulfil the lives of our patients.&lt;br /&gt; &lt;br /&gt; We have permanent full or part-time and Self- Employed positions within our Worcester Out-of-Hours (OOH) service, working a minimum of 2 sessions a month on a rota basis and with locations in Worcester, Kidderminster, Redditch, Malvern and Evesham, we&#39;ve got something to suit you.&lt;br /&gt; &lt;br /&gt; If you are looking for flexible hours and want to help in this time of need, then we would be happy to discuss how working with us can fit around you and your other commitments.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The OOH service is open from 6.30pm – 8am Monday – Friday, and 24 hours over the weekends.&lt;br /&gt; &lt;br /&gt; The skill mix within the service is ANP and GP’s, incorporating urgent care, telephone triage, face-to-face appointments and home visits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are self-employed, then we can offer you...&lt;br /&gt; &lt;br /&gt; •Competitive pay rates&lt;br /&gt; •Flexible working hours&lt;br /&gt; •Working with a friendly and cohesive multi-disciplinary team&lt;br /&gt; •Supportive environment and senior leadership teams&lt;br /&gt; •Access to our bespoke learning system&lt;br /&gt; &lt;br /&gt; If you would like to come on board as salaried, then we can offer you...&lt;br /&gt; &lt;br /&gt; •Competitive pay rates&lt;br /&gt; •5 Days study leave (pro-rata)&lt;br /&gt; •33 days annual leave (pro-rata, including bank holidays)&lt;br /&gt; •Company Pension Scheme&lt;br /&gt; •2x Life Assurance&lt;br /&gt; •Contribution towards Eye test and Glasses.&lt;br /&gt; •Cycle to work scheme – offering discounts rates and payment plans of bicycles and equipment&lt;br /&gt; •Practice Plus Group perks –offering you discounts and cash back with large retailers.&lt;br /&gt; •Annual employee recognition award ceremony&lt;br /&gt; •Employee assistance programme, including support for you and your family&lt;br /&gt; •Occupational health support&lt;br /&gt; •Access to our bespoke e-learning system&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Be on the GMC Register&lt;br /&gt; •Be on the GP National Performers List with a valid CCT&lt;br /&gt; •Experience &amp; confidence in managing acute and chronic presentations for both adult and pediatric patients.&lt;br /&gt; •Evidence of continuing professional development&lt;br /&gt; •Ability to maintain and monitor high standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an organisation, Practice Plus Group is at the cutting edge of service development underpinned by a commitment to developing strong and effective leaders and embedding quality improvement methodologies. There is a strong track record of career progression within the organisation.&lt;br /&gt; &lt;br /&gt; We have over 17 years’ experience of delivering full GP out of hours services across England. And we were one of the first providers to set up an NHS exemplar site, based in West London, and have become the largest provider of full out of hours services in the country covering over eight million patients.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to receipt of satisfactory references and a DBS check.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is committed to creating a diverse environment and we are proud to be an equal opportunity employer.&lt;br /&gt; &lt;br /&gt; If you&#39;d like to learn more, arrange an informal visit to the service or have any questions please contact Charlie Allen - Charlie.allen@practiceplusgroup.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR1 1HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1973", "longitude": "-2.22192"}}, "title": "General Practitioner - Worcestershire OOH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244209", "validThrough": "2020-12-31T23:59:59+0000"}