{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 - £49,036"}}, "datePosted": "2020-10-26T17:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Academic Clinical Fellow in Dental Core Training&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration: Up to 3 Years&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 15th January 2021 (subject to change)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Posts available: 2 x Bristol&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grades: DCT1, DCT2, DCT3 (dependent on previous experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bristol Dental School are seeking talented, enthusiastic dentists who are dedicated to developing a clinical academic career. These posts provide a unique opportunity for dentists with curiosity, intelligence and commitment. The ideal candidate(s) will have a strong record of academic achievement, ideally with some research experience (although not essential) and will be committed to applying for external fellowship funding for a PhD. The successful applicant(s) will be supported and trained to prepare their fellowship application.&lt;/p&gt;\n&lt;p&gt;These National Institute for Health Research Academic Clinical Fellow (NIHR ACF) posts will be split between 75% clinical development and 25% research, for up to 3 years. The clinical component will equate to Dental Core Training post and tailored to prepare the post-holder for subsequent specialty training if required.&lt;/p&gt;\n&lt;p&gt;Applicants must ensure they meet the criteria set out in the NIHR ACF person specification in addition to the national DCT person specifications. All person specifications can be found under documents along with job descriptions on Oriel.&lt;/p&gt;\n&lt;p&gt;Applicants will need to ensure they have applied via national recruitment at either DCT1, 2 or 3 for clinical benchmarking.&lt;/p&gt;\n&lt;p&gt;Applicants must be fully GDC registered, hold BDS/equivalent and committed to developing an academic career.&lt;/p&gt;\n&lt;p&gt;Applicants should note that all training programmes are equally open to those who may, either from the outset or subsequently, wish to train less than full time.&lt;/p&gt;\n&lt;p&gt;If your employment is subject to immigration control, you should visit the HEE website for Specialty Training for information about how this will affect your application. In some cases applications will not be considered, or only once the resident labour market test can be satisfied.&lt;/p&gt;\n&lt;p&gt;Please note that there is a strict application policy that applications cannot be accepted after the deadline.&lt;br /&gt; &lt;br /&gt;Tips for submitting an application:&lt;br /&gt;• On completion save and re-open the application and then check prior to pressing the submit button. This will allow you time to review your completed application and check for any discrepancies.&lt;br /&gt;• Submit your application no later than 30 minutes before the deadline as there is a strict policy that applications cannot be accepted after the deadline.&lt;br /&gt;• If you are in the process of completing an application at the point of closure a warning message will appear and you will not be able to submit the application or retrieve any of the data input.&lt;br /&gt;Please refer to the Job Description and ACF person specification prior to starting your application.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England South West", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS159QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4574", "longitude": "-2.50605"}}, "title": "ACF Dental Core Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243585", "validThrough": "2020-11-24T23:59:59+0000"}