{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive"}}, "datePosted": "2020-10-20T08:45:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist Band 7, Permanent, Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an enthusiastic and skilled clinical psychologist to work full time within the Specialist Health Conditions Stream of paediatric psychology, linked to the gastroenterology team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work in a small team of psychologists to provide a psychology service to patients under the care of the gastroenterology team. The role includes a mixture of inpatient and outpatient work. The role of psychology is highly valued by the gastroenterology team and close working with the gastroenterology MDT will be a key part of the role.&lt;/p&gt;\n&lt;p&gt;The clinician will work with children with chronic gastrointestinal conditions (for example Inflammatory Bowel Disease, Complex Constipation, Intestinal Failure, Paediatric Intestinal Pseudo-Obstruction). There is also work with children with functional symptoms of pain or nausea. We offer support in areas such as feeding difficulties, anxiety, symptom management, identity and adjustment to chronic illness.&lt;/p&gt;\n&lt;p&gt;The postholder will also be expected to work with some flexibility within psychological services, including carrying out some clinical work in other specialties according to service need. The successful candidate will join a large, supportive team of psychologists working across Great Ormond Street Hospital and will be able to access the learning and opportunities that come with being part of a large psychology service at a leading children’s hospital.&lt;/p&gt;\n&lt;p&gt;Please see the job description and person specification for further details. Interested applicants are strongly advised to call Dr Dawn Cutler, Principal Clinical Psychologist to discuss the post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Clinical Psychologist (Band 7) - Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233487", "validThrough": "2020-11-08T23:59:59+0000"}