{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001  per annum"}}, "datePosted": "2020-10-20T11:46:51+0100", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Be at the centre of a digitally-enabled future where Digital is acknowledged as a core pillar in MFT’s strategy in particular around research, innovation and the use of data to drive transformation programmes.&lt;/p&gt;\n&lt;p&gt;MFT is embarking on a new clinical strategy where Information Governance is core to achieve the changes to patient care and experience.&lt;/p&gt;\n&lt;p&gt;An exciting and challenging role within the Group Informatics Information Governance (IG) team, you will be a dynamic, forward thinking individual with innovative solutions to deliver, implement and embed a robust IG framework to ensure compliance with legal, regulatory and Trust requirements.&lt;/p&gt;\n&lt;p&gt;You will need to be highly motivated to lead and provide an exceptional proactive Information Governance service which supports our Health Professionals and other staff in the processing of personal data legally, securely, efficiently and effectively in order to deliver the best possible service.&lt;/p&gt;\n&lt;p&gt;Working in a challenging environment you will be required to be flexible and imaginative with your approach and you will need excellent communication skills with the ability to explain complex details to all levels of staff&lt;/p&gt;\n&lt;p&gt;Development and training on current and future Information Governance guidance and legislation will be provided. Staff undertake yearly appraisals and are encouraged to actively own and participate in the development of their personal development plan.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLois CritchleyAdditional contact information&lt;span&gt;Lois Critchley, Informatics Head of Governance via email: lois.critchley@mft.nhs.uk or tel: 0161 276 6874&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cobbett House, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Information Governance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234235", "validThrough": "2020-11-08T23:59:59+0000"}