{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-22T18:30:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Gastroenterology (Luminal) with General Medicine Consultant Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This advertisement is for a new post within the department of gastroenterology at the NNUH including the Quadram Institute. We are looking to attract a high-quality applicant with an interest in upper or lower Gastrointestinal disease, nutrition, endoscopy and general internal medicine. As a large and growing department, we can accommodate a range of sub-specialist interests (see below), including research, education and training. We are supportive of those applicants who are looking for part time and or a post-retirement post.&lt;br /&gt;&lt;br /&gt;This post have arisen due to the need for a significant expansion of our outpatient luminal GI service and a growing need to increase our upper and lower GI endoscopic provision in alignment with the opening of our brand-new state of the art endoscopy unit in the Quadram Institute, a need to increase our out-patient services and a need to support medical admissions to the hospital together a drive to increase our academic profile and support the wider STP (Sustainability and Transformation Partnership) in Norfolk and Waveney. &lt;br /&gt;&lt;br /&gt;This post has been deliberately left reasonably open to allow candidates, following discussion with the department to develop their own subspecialist interests whether that be clinical, endoscopic, nutrition, physiology, research, or some combination of the above.&lt;/p&gt;\n&lt;p&gt;A candidate who is unable for personal reasons to undertake the duties of a whole-time post will receive equal consideration. For consultants wishing to move from existing posts we offer flexible working opportunities.&lt;/p&gt;\n&lt;p&gt;If such a candidate is appointed to this post, job plan and timetable will be modified as appropriate in consultation with the gastroenterology and GI endoscopic Service director.&lt;/p&gt;\n&lt;p&gt;We welcome all applications irrespective of age, disability, gender, sexual orientation, race or religion. Additionally, people with disabilities will be offered an interview providing they meet the minimum criteria for the post. The Trust operates job sharing and a flexible working programme.&lt;/p&gt;\n&lt;p&gt;AAC panel date will be 30th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Prof Alastair Watson Alastair.watson@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk &amp; Norwich University Hospital Foundation Trust, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Gastroenterology (Luminal) with General Medicine Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239572", "validThrough": "2020-11-19T23:59:59+0000"}