{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-05T11:15:19+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Porter&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity has arisen for a UEC Porter band 2 with the Urgent &amp; Emergency Care Department. The post will include weekend and out of hours.&lt;/p&gt;\n&lt;p&gt;The Clinical Business Unit is seeking enthusiastic members of staff to join the Urgent &amp; Emergency Care Team. We have a professional and dedicated team committed to providing a first class service to our patients and clinical users.&lt;/p&gt;\n&lt;p&gt;Responsible to the Departmental Coordinator, the main duties of the post will be to carry out a full range of Portering duties within the hospital, which will include the movement of patients and the transportation of equipment, furniture, linen, waste and medical gases and to respond to emergency calls such as fire alarms and crash calls and any other ad hoc tasks. Duties also include the undertaking of some cleaning tasks maintaining a high standard of cleanliness in line with Trust cleaning protocols.&lt;/p&gt;\n&lt;p&gt;We are a busy department working 24 hours a day across 7 days per week, and the successful candidate will be required to work evenings and weekends on a rotational basis.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for the successful candidate to develop their interpersonal skills and to further develop their experience in a supportive environment within a forward thinking Trust.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Healthcare environment is desirable but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Porter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257388", "validThrough": "2020-11-13T23:59:59+0000"}