{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-26T14:01:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like to be part of a dynamic team delivering high quality Acute Medical Care? Do you have an appetite for acute and ambulatory medicine? Do you get a buzz from achieving in the face of adversity? Are you up for a challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the answer to the above questions is a resounding “Yes”, then why not join the Acute Medical Team at the Royal Lancaster Infirmary, a part of the University Hospitals of Morecambe Bay Trust (UHMBT), where you will provide key medical interventions and investigations in both the inpatient Acute Medical Unit and the Ambulatory Care Unit.&lt;/p&gt;\n&lt;p&gt;We are offering an opportunity for an enthusiastic and committed Consultant to join a forward thinking team and be part of the redesign and remodeling of the workforce whilst also being able to enjoy a lifestyle which could be either city, coastal or rural based, Areas of recognised natural beauty such as the Lake District and Yorkshire Dales National Parks are both within easy commute of the historic city of Lancaster, which itself possesses two thriving universities with a medical school, renowned secondary education at both the Lancaster Royal Grammar School and the Lancaster Girls Grammar School and a city with a vibrant, multi-cultural way of life. The local area offers choice and for those keen to maintain ties further afield, the city is just two and a half hours from London and Glasgow by direct rail transfer and just one hour’s drive from Manchester and Liverpool, with all these destinations offering international travel options.&lt;/p&gt;\n&lt;p&gt;This new Consultant post is based at the Royal Lancaster Infirmary, which is in the centre of the City.&lt;/p&gt;\n&lt;p&gt;Our department has a workload to keep you interested and challenged, but still give you time to talk to your patients properly, and undertake the practical procedures that interest you as an Acute Physician, which will enhance patient care. The department is staffed with a good skill mix which consists of Consultants, SAS Doctors and Junior Doctors. In addition there is a strong nursing team including an evolving team of Advanced Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;This post is available Full Time 10PA&#39;s up to a maximum of 12PA&#39;s, or Part Time.&lt;/p&gt;\n&lt;p&gt;In addition, UHMBT has a keen interest and extensive involvement in Medical and Dental Education at both Undergraduate and Postgraduate levels. We work in partnership with Lancaster Medical School, and Health Education North West to provide quality education and training which meets the requirements of these regulatory bodies as well as the Trust’s high standards of patient care. We are the lead NHS organisation and take responsibility throughout the five years of the degree for the provision of acute practice placements and medical students from Lancaster Medical School spend time on attachment to the department.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for the right candidate to support the further development of Acute Medicine in this area.&lt;/p&gt;\n&lt;p&gt;We are open to accommodating individuals who may be interested in a dual post with another specialty, as we are a forward-thinking organisation that appreciates that there is much benefit from having clinicians with experience from multiple specialties, so that clinical strengths are shared and there is cross-over of skills.&lt;/p&gt;\n&lt;p&gt;We will offer an attractive relocation package for the right candidate.&lt;/p&gt;\n&lt;p&gt;Interview expenses will be paid from point of entry to the UK.&lt;/p&gt;\n&lt;p&gt;You must either be on the GMC Specialist Register with a license to practice in Acute Medicine or be within six months of obtaining your CCT award (or equivalent) at the time of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Vallely, Service Manager - 01524 518684 - Richard.vallely@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Yunus Seth - Clinical Lead - Yunus.seth@mbht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Consultant - Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242797", "validThrough": "2020-11-25T23:59:59+0000"}