{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive - depending on experience and skills"}}, "datePosted": "2020-11-05T17:07:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Primary Care Network Prescribing Pharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Role:&lt;strong&gt;PrescribingPharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Location:&lt;strong&gt;AT Medics Newham Central Primary Care Network (PCN) Sites&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary:&lt;strong&gt;Competitive - depending on experience and skills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hours:&lt;strong&gt;Full Time (37.5 hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AT Medics Newham Central PCN is delighted to offer a position for a Prescribing Pharmacist who wants to make a difference, the opportunity to join our network of 3 GP Practices in Newham. We see the role of the Pharmacist as critical within General Practice. As one of the first joint posts across the PCN, the Pharmacist will be in a unique position, to help shape our longer-term strategy.&lt;/p&gt;\n&lt;p&gt;Across the Practices we have a rich diversity of staff, including GP’s, Physician Associates, Advanced Nurse Practitioners, Nurses, Healthcare Assistants and Practice based Clinical Pharmacists.&lt;/p&gt;\n&lt;p&gt;The Network is seeking to recruit a Clinical Pharmacist to further improve the already excellent quality of service offered to the local population. The practice populations of the three Practices (Essex Lodge Surgery, Boleyn Road Practice, Lucas Avenue Practice) are diverse and this provides an interesting variety of work for anyone hoping to join our Network. Within the first year we would be looking for the pharmacist to work across the Network to achieve joint aims for all three practices, as well as possibly looking at individual work within the practices. This would then be built on in future years. The role is diverse and will likely evolve depending on the needs of the PCN and the ability of the post holder. You can expect the role to include telephone and face to face consultations, repeat prescribing (where applicable), medication reconciliation, audits, high risk medicine monitoring, CQC preparation, implementation of local/national guidelines and general quality improvement across the region of the PCN.&lt;/p&gt;\n&lt;p&gt;AT Medics Newham Central PCN will host this role because of their expertise in developing and managing Pharmacists. With over 35 substantive Clinical Pharmacists working across 30 GP Practice surgeries, the organisation has a proven track record in training and developing pharmacists within Primary Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate for this exciting role will likely possess the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• GPhC registered Pharmacist&lt;/p&gt;\n&lt;p&gt;• A ‘can do’ attitude with a real desire to improve patient care and be self-motivated&lt;/p&gt;\n&lt;p&gt;• Ability to work well independently and as part of a team&lt;/p&gt;\n&lt;p&gt;• Excellent communication skills both verbally and written and with a good team ethic&lt;/p&gt;\n&lt;p&gt;• Willingness and ability to develop clinically&lt;/p&gt;\n&lt;p&gt;• Flexibility over hours to suit a working rota&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return, the PCN offers:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• An excellent salary depending on experience&lt;/p&gt;\n&lt;p&gt;• Fantastic career prospects and genuine opportunities for career development&lt;/p&gt;\n&lt;p&gt;• Excellent bespoke GP-Director led Pharmacist training programme (Pharmacist Development and Support Programme – PDS developed and delivered by AT Medics)&lt;/p&gt;\n&lt;p&gt;• Access to AT Medics bespoke learning library which includes training videos, e-learning modules/MCQs etc.&lt;/p&gt;\n&lt;p&gt;• 5 weeks annual leave&lt;/p&gt;\n&lt;p&gt;• CPD paid leave (1 week)&lt;/p&gt;\n&lt;p&gt;• Annual Clinical Assessment and OSCE exam - developing competencies&lt;/p&gt;\n&lt;p&gt;• In-house CPD training sessions tailored to the needs of our Pharmacists&lt;/p&gt;\n&lt;p&gt;We are keen to acquire the best talent to ensure our PCN delivers the commitments made in the Long-Term Plan.&lt;/p&gt;\n&lt;p&gt;You are advised to apply as soon as possible. Please note that this vacancy may close before the advertised closing date if sufficient suitable applications are received. If you have not heard from us within 4 weeks of the closing date you should assume you have not been shortlisted but we would like to thank you for your interest in our Primary Care Network.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "AT Medics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E13 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5363", "longitude": ".030789"}}, "title": "PCN Prescribing Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258672", "validThrough": "2020-11-19T23:59:59+0000"}