{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Equivalent Band 5"}}, "datePosted": "2020-10-12T11:02:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Pre-assessment | Surgical Wards| Equivalent Band 5 | Methley Park | Flexible working hours full time– No nights, Flexible hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to growth of service; Spire Methley Park Hospital has an exciting opportunity for an experienced Nurse to join our fantastic Pre-Assessment unit. Working within a small team, you will use your Clinical skills to provide pre-assessment of our surgical patients. This is a unique role and we’re happy to train Community or Medical Nurses for the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Methley Park Hospital situated in Methley in South Leeds, has recently completed a 7.6 million refurbishment, which included a new theatre equipped with cutting-edge technology enabling us to carry out complex surgery across a variety of clinical specialties. At Spire Methley Park Hospital caring for our patients is at the heart of what we do. We provide expert medical care in our modern, well-equipped hospital for all of our patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Successful nurse will pre-asses all planned surgical patients and work within the inpatient and day-case units. You will review and interpret patient questionnaires to provide the appropriate assessment and manage an individual caseload, present information to patients and communicate and build solid working relationships with consultants&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 3-5 years clinical nursing experience – Hospital, community or medical.&lt;/li&gt;\n&lt;li&gt;Have a range of nursing skills supported by professional and clinical knowledge.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little on grace.little@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Methley", "postalCode": "LS26 9HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7405", "longitude": "-1.42333"}}, "title": "Pre-assessment Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222009", "validThrough": "2020-11-12T23:59:59+0000"}