{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T08:30:17+0000", "description": "&lt;p&gt;The post is fixed term for 12 months due to funding&lt;/p&gt;\n&lt;p&gt;We are currently looking for an enthusiastic, motivated and suitably qualified HCPC registered Biomedical Scientist who is experienced in Blood Transfusion Science, to apply for the Band 7 post of Blood Transfusion Section Manager within the Blood Sciences Department at Prince Philip Hospital, Llanelli.&lt;/p&gt;\n&lt;p&gt;You will be working using your professional skills as an active team member providing advice and support to healthcare colleagues to promote the safe and effective use of blood transfusion.&lt;/p&gt;\n&lt;p&gt;You will take responsibility for the day-to-day running of the Blood Transfusion section of the Blood Sciences Laboratory, as well as working with the Health Board Blood Transfusion Team and be an active member of the HDUHB Transfusion Leads Committee and Blood Transfusion Group.&lt;/p&gt;\n&lt;p&gt;Duties will include direction of day-to-day operations of the Blood Transfusion Department, ensuring UKAS and BSQR compliance, compliance with policies and training programmes, and involvement in the resolution of human resource issues.&lt;/p&gt;\n&lt;p&gt;You will be involved in developing and implementing policies, clinical audit and education of laboratory staff.&lt;/p&gt;\n&lt;p&gt;The Blood Transfusion Laboratory is currently equipped with the Ortho Vision automated blood grouping system.&lt;/p&gt;\n&lt;p&gt;The department operates a contractual shift pattern supporting Round the Clock Services, and out of hours working on the Haematology/ Blood Transfusion rota will be part of your role.&lt;/p&gt;\n&lt;p&gt;The Haematology laboratory is equipped with Siemens ADVIA 2120 Full Blood Count analysers, and CS2500 Sysmex Coagulation analysers.&lt;/p&gt;\n&lt;p&gt;Effective organisational and communication skills are essential and you must have the ability to work and manage a team efficiently.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnn MannAdditional contact information&lt;/p&gt;\n&lt;p&gt;Mrs Ann Mann, Blood Science Laboratory Manager PPH&lt;/p&gt;\n&lt;p&gt;Tel No. 01554 783069&lt;/p&gt;\n&lt;p&gt;email: anne.mann@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Dylan Jones , Blood Science Service Manager.&lt;/p&gt;\n&lt;p&gt;Tel No. 01267 227468&lt;/p&gt;\n&lt;p&gt;email: Dylan.jones2@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Philip Hospital, Llanelli", "postalCode": "SA14 8QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6916", "longitude": "-4.136"}}, "title": "Blood Transfusion Section Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245736", "validThrough": "2020-11-08T23:59:59+0000"}