{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44412", "minValue": "44412", "unitText": "YEAR", "value": "£26.42 per hour + accrued holiday pay"}}, "datePosted": "2020-11-03T11:36:57+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for someone with strong business intelligence background with a genuine interest in health care&lt;/strong&gt; &lt;strong&gt;to help provide the support for Informatics Department as Strategic Analyst.&lt;/strong&gt;&lt;strong&gt;           &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, &lt;strong&gt;Buckinghamshire Healthcare NHS Trust&lt;/strong&gt; is the place for you. &lt;/p&gt;\n&lt;p&gt;We have placement opportunity available for a &lt;strong&gt;temporary&lt;/strong&gt; &lt;strong&gt;Senior Strategic Analyst &lt;/strong&gt;available at &lt;strong&gt;Trust HQ.&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Informatics Department&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Aylesbury, HP20 1DS &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay:&lt;/strong&gt; £26.42 per hour plus accrued holiday pay &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have identified the need to substantially enhance the capacity, capability, and leadership of our Business Intelligence service. We’re seeking a skilled and knowledgeable Senior Strategic Analyst to help us to develop and deliver high quality business intelligence and analytics to inform the decision making ability of clinicians, staff and managers at all levels of the organisation as they manage the complex challenges presented by COVID-19, service recovery and ICP/ICP developments.&lt;/p&gt;\n&lt;p&gt;You will be responsible for communicating analytical, statistical, and epidemiological results and issues to a wide range of internal and external staff. Based on your analyses you will guides colleagues on suitable courses of action and will therefore need to be able to convey statistical concepts clearly. As part of this you will develop and deliver formal, complex statistical presentations to large groups.&lt;/p&gt;\n&lt;p&gt;As such you will need an in-depth specialist knowledge of statistics and epidemiological information, analysis and the use of information across the NHS, which you’ll have acquired through a master’s degree or the equivalent amount of experience.  You will need a good awareness of national policy and strategies in the realm of Business Intelligence, digital, and Public Health Management.&lt;/p&gt;\n&lt;p&gt;The working hours for this role are &lt;strong&gt;part time &lt;/strong&gt;and you would be required to work within &lt;strong&gt;Monday to Friday, 9:00 – 17:00&lt;/strong&gt;. Hours and days required for working will be appointed after mutual agreement.&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note, this role is based on site with some remote working. You must be able to attend on site when needed.&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;Do you have the following skills …?&lt;/p&gt;\n\n\n\n\n\n&lt;ul&gt;\n&lt;li&gt;PRINCE II qualification or equivalent&lt;/li&gt;\n&lt;li&gt;Busines Analysis / Strategic Analysis experience on senior level&lt;/li&gt;\n&lt;li&gt;In-depth specialist knowledge of statistics information (preferably from health care environment)&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Flexible approach – ability to combine on site and remote working (you must be able to attend on site office when needed)&lt;/li&gt;\n&lt;li&gt;Good knowledge of Project Management and staff management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n\n\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aylesbury", "postalCode": "HP20 1DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8203", "longitude": "-.791749"}}, "title": "Senior Strategic Analyst - business intelligence", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253776", "validThrough": "2020-11-17T23:59:59+0000"}