{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T15:16:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Renal Transplant Surgeon&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a replacement post for a consultant transplant surgeon within the Nephrology and Renal Transplant Service of the Renal, Respiratory and Cardiovascular Clinical Management Group, University Hospitals of Leicester currently based at Leicester General Hospital. You will be part of a team comprising of four senior surgical members (3 consultants and 1 associate specialist) providing services for patients requiring renal transplantation and vascular/peritoneal access&lt;em&gt;.&lt;/em&gt; The transplantation service is traditionally surgically led, but relies heavily on a team approach and the surgical staff work in conjunction with Consultant Nephrologists and Consultant Anaesthetists and allied team members with responsibility for the transplantation programme&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join the team in Leicester as they plan to relocate to the Glenfield Hospital site in July 2021. Last year the unit performed 143 kidney transplants, 49 of which were from live donors. The Leicester Transplant team was the 1st in the UK to commence live donor renal transplants in May after all centres had paused the service due to the pandemic and have completed over 100 transplants since the beginning of 2020.&lt;/p&gt;\n&lt;p&gt;Ideally an experienced transplant surgeon – with extensive skills and experience in vascular access surgery. The appointee will be expected to work closely with allied team members to develop the vascular access services. In addition you will be expected to be part of both deceased donor and live donor transplant services.&lt;/p&gt;\n&lt;p&gt;Applicants must already be on the GMC specialist register or within 6 months of the interview date have a certificate of completion of specialist training.&lt;/p&gt;\n&lt;p&gt;As this post is regulated by the Protection of Children Act 1999, The Criminal Justice Courts Act 2000 and / or the Care Standards Act 2000 an enhanced disclosure by the Disclosure and Barring Service (DBS) will be undertaken&lt;/p&gt;\n&lt;p&gt;The successful appointee will be expected to participate in undergraduate and postgraduate teaching and clinical audit. They will be required to undertake management duties and work in a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The University Hospitals of Leicester NHS Trust consists of three acute teaching hospitals serving the population of Leicestershire. It is fully committed to Continuing Medical Education for consultants.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester General Hospital, Leicester", "postalCode": "LE5 4PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6301", "longitude": "-1.08288"}}, "title": "Consultant Renal Transplant Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245156", "validThrough": "2020-11-24T23:59:59+0000"}