{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42417", "minValue": "31310", "unitText": "YEAR", "value": "£31,310 - £42,417 per annum DOE"}}, "datePosted": "2020-11-02T15:36:42+0000", "description": "&lt;p&gt;&lt;span&gt;We’re inviting applications for the permanent role of (Nurse/Pharmacist) Independent Non-Medical Prescriber to enhance our busy, dynamic and innovative team in South Devon.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re looking for a highly motivated, dynamic and solution focussed individual that can therapeutically engage our service users in order that they can move through their recovery. Experience of working within substance misuse services is desirable but not essential, as our Clinical Leads are able to provide you with structured training and support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role provides an exciting opportunity to work within our community adult service. There are excellent opportunities for professional development through access to CPD, networked peer groups, regular clinical supervision, and fully supported appraisal and revalidation structures. Further opportunities also exist for clinicians to influence practice in their areas of interest and expertise. We support flexible working including new digital working arrangements where it offers improvements in the care of our service users. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to join our team, supporting service delivery and care to patients within the service, we would love to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About EDP&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EDP Drug &amp; Alcohol Services is a thriving charity providing services across Devon and Dorset, in the community and within prisons.&lt;em&gt; We &lt;/em&gt;provide a welcoming, accessible, flexible and outward-looking service, supporting people to build healthy lifestyles, healthy relationships, healthy families and healthy communities. Our model is an integrated one where clinicians and non-clinicians work closely together to provide a holistic package of care and the service works closely with other organisations across the system to better support people with complex lives.Our clinical service delivery includes opioid substitute therapy, detoxification from drugs and alcohol, blood borne virus interventions and nurse-led health care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EDP can offer you a real opportunity for new, challenging and highly rewarding experiences. In return for your commitment and enthusiasm, we offer a comprehensive training &amp; development programme, a generous leave package, pension scheme, and a positive, friendly working environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;&lt;span&gt;EDP is committed to safeguarding and promoting the welfare of vulnerable adults and expects all employees and volunteers to share this commitment.  Candidates are subject to additional checks including DBS (to the appropriate level) and prison vetting – details will be specified as part of the vacancy details. Outcomes of these additional checks will be considered before any offer/appointment is confirmed.&lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "EDP Drug and Alcohol Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbot", "postalCode": "TQ12 1GJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5287", "longitude": "-3.60835"}}, "title": "Independent Non-Medical Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252667", "validThrough": "2020-11-12T23:59:59+0000"}