{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112"}}, "datePosted": "2020-11-06T10:31:02+0000", "description": "&lt;p&gt;We&#39;re currently not hiring overseas nurses - must have NMC Registration.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit has an exciting opportunity for both experienced and newly qualified Nurses who are caring, enthusiastic and driven to join this experienced and friendly team.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit is a high paced, diverse unit consisting of 3 areas; Acute Medical Ward, Acute Decision Unit and Ambulatory Emergency Care.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be highly motivated and demonstrate the ability to provide the highest standard of safe, effective care to their patients. It will be essential for them to be able to work as part of a successful multidisciplinary team, adapting to changing situations, thinking quickly and acting with compassion and empathy.&lt;/p&gt;\n&lt;p&gt;Come and join our friendly team in a trust rated OUTSTANDING and expand your knowledge and clinical skills in a diverse and exciting environment. You will be fully supported by the Trust, the Ward Manager and the ward team in your development.&lt;/p&gt;\n&lt;p&gt;There is a Band 6 learning lead who works across all 3 areas in the Acute Medical Unit (AMU) who supports all new starters. They work alongside new members of team during the induction process and helps develop the ward team of all bands with their continued professional development. The learning lead for AMU has been developed to support staff to become more confident in delivering high standards of care. The learning lead will meet with you regularly and will work closely with the learning and development team in order to support a coordinated approach to education, training and professional development. This is a unique role and having this learning experience for new starters is only present on a few areas around the trust creating a brilliant learning environment here on AMU. All new starters will receive an induction pack with a detailed plan of training available and development specifically for acute medicine.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire HawkinsJob titleSenior HR AdvisorEmail addressclaire.hawkins@swft.nhs.ukTelephone number07887628247Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you like any further information or would like to arrange an informal visit please contact Cheryl Markham, Oken Ward 01926 495321 ext 4794, &lt;/strong&gt;&lt;strong&gt;cheryl.markham @swft.nhs.uk&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alternatively, please contact Claire Hawkins (Senior HR Advisor - Resourcing) on 01926 495321 ext 8437 or email &lt;/strong&gt;&lt;strong&gt;Claire.hawkins@swft.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Nurse - Acute Medical Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259222", "validThrough": "2020-11-22T23:59:59+0000"}