{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "35000", "unitText": "YEAR", "value": "£35,000 to £50,000pa DOE"}}, "datePosted": "2020-11-04T16:43:06+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;NHS Benchmarking Network Project and Quality Improvement Manager&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Employer: Benchmark Management Consulting Ltd&lt;/p&gt;\n&lt;p&gt;Location: Manchester&lt;/p&gt;\n&lt;p&gt;Salary: £35,000 to £50,000 pa, negotiable depending on skills and experience&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the role&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced and enthusiastic individual to deliver successful benchmarking projects and national clinical audits for the NHS benchmarking Network. A unique opportunity to make a difference, you will work with participants and stakeholders to articulate how project and audit data can be utilised for quality improvement.&lt;/p&gt;\n&lt;p&gt;Working closely with the analytics and technology teams and drawing on the NHS knowledge and experience of other team members, you will be given responsibility for delivery of a number of projects and audits across a variety of healthcare sectors.&lt;/p&gt;\n&lt;p&gt;With a background in delivering healthcare improvement work, you will demonstrate service redesign, quality improvement and change management skills. Central to the role will be an enthusiasm for working with data to generate intelligence and insight for a variety of audiences to underpin improvement work.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About us&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Benchmark Management Consulting runs the NHS Benchmarking Network, a member organisation that develops and delivers national benchmarking and data analytics projects for the NHS. As the leading benchmarking network for health and social care intelligence in the UK, we are proud to support our clients to improve NHS services and deliver the NHS Long Term Plan. In addition to a core annual work programme for members, we also undertake projects and audits commissioned by central NHS bodies such as NHS England &amp; Improvement, Department of Health and Social Care, Health Education England and Healthcare Quality Improvement Partnership.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About you&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;degree level education with a minimum BA/BSc 2:2&lt;/li&gt;\n&lt;li&gt;experience of working in healthcare/NHS&lt;/li&gt;\n&lt;li&gt;experience of project management (Prince2 desirable)&lt;/li&gt;\n&lt;li&gt;quality improvement skills, experience of delivery, and thorough understanding of the application of quality improvement methodology. Relevant QI qualification desirable.&lt;/li&gt;\n&lt;li&gt;experience of use of data analysis and enthusiasm for using intelligence and insight to underpin improvement&lt;/li&gt;\n&lt;li&gt;strong evidence of successful team working&lt;/li&gt;\n&lt;li&gt;evidence of ability to meet project deadlines and targets&lt;/li&gt;\n&lt;li&gt;ability to engage with senior management level clients with credibility&lt;/li&gt;\n&lt;li&gt;ability to present to a large audience with confidence and clarity&lt;/li&gt;\n&lt;li&gt;self-motivation and ability to operate independently.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M22 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3674", "longitude": "-2.26518"}}, "title": "NHS Benchmarking Network Project and Quality Improvement Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256685", "validThrough": "2020-12-03T23:59:59+0000"}