{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-10-28T10:39:30+0000", "description": "&lt;p&gt;An exciting opportunity has arisen at Leicestershire Partnership NHS Trust whereby we are seeking an individual to assist the clinical category team within this large non-acute Trust.&lt;/p&gt;\n&lt;p&gt;We have the ambition to become a best in class, non-acute procurement team, following best practice, national initiatives, and seeking proactive collaborations. In order for us to achieve this, we are looking for bright, enthusiastic and dynamic individuals to join the LPT procurement team.&lt;/p&gt;\n&lt;p&gt;As a procurement professional, you will have the skills and determination to make a real difference when it comes to supporting the Trust’s procurement function. This is an exciting opportunity for someone who has an interest in buying, procurement and the Supply Chain and would really like to make a difference in the NHS.&lt;/p&gt;\n&lt;p&gt;Reporting to the Clinical Category Manager, you will be responsible for managing your own portfolio of projects to achieve value for money supply arrangements whilst adhering to procurement rules and Trust governance. You will also provide cover at times to the Supplies Function as they respond to the covid demand.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to build strong working relationships at various levels within the Trust and manage stakeholder expectations as well as develop and promote the function to all.&lt;/p&gt;\n&lt;p&gt;The role will be based at County Hall, Glenfield, Leicester and the applicant will need to be comfortable with home-working in the current climate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Agile Working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We recognise the need to develop modern working practices to enable employees to maximise their performance and productivity whilst maintaining a good work life balance. To this aim the Trust has adopted an Agile working methodology as outlined within the Trust Agile working Policy.&lt;/p&gt;\n&lt;p&gt;The post advertised falls under the Trust’s Agile working methodology, so if successful you will be appointed as an Agile Worker, and will need to work to the Trusts Agile working policy. Talk to the recruiting manager about what this means in practice for you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 8RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6557", "longitude": "-1.188"}}, "title": "Band 5 Category Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246130", "validThrough": "2020-11-14T23:59:59+0000"}