{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (*Indicative)"}}, "datePosted": "2020-10-28T14:52:16+0000", "description": "&lt;p&gt;An exciting position for a Lead Paramedic L&amp;D (Previous PPEd title) has arisen within the North &amp; East Devon County area of the Trust.&lt;/p&gt;\n&lt;p&gt;This role provides a stable, supportive environment for staff to develop. Your role is the key to unlocking potential. You are expected to be excellent role models and to act as an ambassador of the paramedic profession, helping to inspire and develop staff.&lt;/p&gt;\n&lt;p&gt;The role is considered a career pathway to the Learning &amp; Development department and as such, a Lead Paramedic L&amp;D should have a passion for education and also have a desire to become part of the Learning &amp; Development team.&lt;/p&gt;\n&lt;p&gt;This position will be self rostered in East Devon on a Relief basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lead Paramedic L&amp;D will support staff undergoing restrictions of practice by working frequent operational shifts as part of a crew in order to monitor their progress on their individual development plan.&lt;/p&gt;\n&lt;p&gt;They will co-ordinate, and assist with, the Learning &amp; Development department, identifying training needs, developing staff and implement action plans set by Learning and Development Officers (LDOs).&lt;/p&gt;\n&lt;p&gt;Lead Paramedic L&amp;D’s will also support new joiners and work with them on their early operational shifts following the Trusts formal induction and preceptorship packages to ensure that new staff are supported appropriately.&lt;/p&gt;\n&lt;p&gt;Lead Paramedic L&amp;D’s will monitor and review Newly Qualified Paramedics (NQP’s), including reviewing the NQP portfolio during the first 6 months of the consolidation of learning period as set out by the trusts NQP process.&lt;/p&gt;\n&lt;p&gt;Produce written reports on a range of issues including student progress and compliance.&lt;/p&gt;\n&lt;p&gt;Maintain confidentiality in line with service policy and ensure compliance with Data Protection Act/GDPR.&lt;/p&gt;\n&lt;p&gt;Any other reasonable operational assessment and/or support of operational staff as required by Learning and Development Officers or Clinical Training Managers.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;*Please note that this role is currently going through the Job Evaluation process and advertised as indicative, and therefore may be subject to change.&lt;/em&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121045.png", "name": "South Western Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121045"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Devon Stations", "postalCode": "EX2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7202", "longitude": "-3.46476"}}, "title": "Lead Paramedic L&amp;D (INTERNAL ONLY)(Previously PPEd Title)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247057", "validThrough": "2020-11-08T23:59:59+0000"}