{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-10-23T14:31:27+0100", "description": "&lt;p&gt;This post is part of the development of an Enhanced Community Service-Positive Behaviour Support Pathway by Northumbria Healthcare NHS Trust. It is a new and exciting opportunity to establish and promote provision into this pathway. The ideal candidate will have an understanding of National and Local Policies relating to the management of people Learning disability and experience of working with people who present with behaviour that challenges as well as experience of working within a PBS framework. They will be passionate about working in collaboration with service users, their family, carers and professional colleagues in order to enhance health and well-being, and to prevent or reduce behaviour that challenges.&lt;/p&gt;\n&lt;p&gt;As an integral part of North Tyneside Community Learning Disability Team, the post holder will work into community with families and carers and inpatient settings to facilitate safe discharges. They will be solely responsible for a personal caseload including provision of assessment and individually tailored Positive Behavioural Support (PBS) plans. The post holder will provide support and advice for colleagues on issues related to PBS needs and will enable team members and settings to develop their processes, resources and skills to meet the needs of patients.&lt;/p&gt;\n&lt;p&gt;The post holder will be welcomed as a member of the friendly, community learning disabilities team in Northumbria Healthcare NHS Trust offering regular team meetings, robust support and supervision, and a commitment to continued professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Learning Disability Nurse&lt;/li&gt;\n&lt;li&gt;Mentorship Qualification or relevant equivalent qualification (essential requirement for post, expectation this will be completed within an 18 month period)&lt;/li&gt;\n&lt;li&gt;R.N.M.H/R.N.L.D. Qualification&lt;/li&gt;\n&lt;li&gt;Evidence of ongoing professional development&lt;/li&gt;\n&lt;li&gt;Knowledge of National and Local Policies relating to the management of people Learning disability&lt;/li&gt;\n&lt;li&gt;Experience working with people who present with challenging behaviours and experience of working within a PBS framework.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Teaching Qualification&lt;/li&gt;\n&lt;li&gt;Experience working in the community setting&lt;/li&gt;\n&lt;li&gt;Experience of multi-agency working.&lt;/li&gt;\n&lt;li&gt;Experience working with children and adults&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post will be based with the Community Learning Disability Team in North Tyneside but the post holder will be required to work in a range into a range of settings in North Tyneside.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Oswell - Senior Community Nurse&lt;/p&gt;\n&lt;p&gt;clare.oswell@northumbria-healthcare.nhs.uk&lt;/p&gt;\n&lt;p&gt;0191 643 2487&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Oxford Centre, North Tyneside", "postalCode": "NE12 8LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0116", "longitude": "-1.5865"}}, "title": "Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240947", "validThrough": "2020-11-08T23:59:59+0000"}