{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25265", "minValue": "25265", "unitText": "YEAR", "value": "£15.03 per hour + Enhancements"}}, "datePosted": "2020-10-20T12:03:30+0100", "description": "&lt;p&gt;&lt;strong&gt;We are looking for a Bank Registered Mental Health Nurse / Registered Learning Disability Nurse (RMN/ RNLD) to join our dynamic and forward thinking team at Cygnet Hospital Beckton, on a flexible basis. You will have the opportunity to develop skills across specialties such as DBT and a range of other psychosocial interventions, as well as enhance your overall career pathway all under one roof. You will be provided ongoing training and support, ensuring that staff working within the service are able to build and strengthen their career goals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Cygnet Hospital Beckton is a specialist service for women, situated in the East End of London. We provide a comprehensive service across four specialist wards; PICU, Tier 4 Personality Disorder, Learning Disorder and Complex Personality Disorder service for women with complex mental health needs. The Hospital was inspected by the CQC less than one year ago and has with a “Good” overall CQC rating. This is a forward-thinking hospital with a drive for innovation and creative thinking; we are looking for staff who share our passion for new ideas and are willing to drive for sustained high quality care delivery as part of a supportive team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Apply now to enjoy flexibility while reaping the rewards of providing outstanding care – and making a huge difference to our service users and their families.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To co-ordinate and provide care and treatment to an identified group of patients without direct supervision&lt;/li&gt;\n&lt;li&gt;Take responsibility for the development and delivery of evidence based practice, ensuring that it supports and reflects service user individual needs, Company objectives and professional guidance.&lt;/li&gt;\n&lt;li&gt;Participate as an active multi-disciplinary team member, making an appropriate contribution to team processes through the use of clinical assessment tools&lt;/li&gt;\n&lt;li&gt;Produce written reports based on your nursing assessments and observations&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge and promote nursing&lt;/li&gt;\n&lt;li&gt;Manage ward activities, ensuring the daily plan is followed and meets the requirements of patients and staff&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals&lt;/li&gt;\n&lt;li&gt;Work closely with the management team to develop the service, audit, and improve quality Act up for the Clinical Team Leader during absences as required&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £15.03 per hour + Enhancements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monday – Friday Days/Nights - £15.03 including A/L Allowance&lt;/li&gt;\n&lt;li&gt;Weekend Days/Nights - £17.92 including A/L Allowance&lt;/li&gt;\n&lt;li&gt;Bank Holidays - £24.27 including A/L Allowance &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Plus&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an experienced RMN/RNLD with a current Pin Number, you’ll have…&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;A good understanding of the Mental Health Act 1983 and latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to deputise in a clinical lead role&lt;/li&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;li&gt;Experience with the client group&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care &lt;/strong&gt;has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Apply now to enjoy excellent career prospects while reaping the rewards of making a difference to others – every day!&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beckton", "postalCode": "E6 6ZB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5138", "longitude": ".064697"}}, "title": "Bank Registered Mental Health/ Learning Disability Nurse (RMN/ RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234294", "validThrough": "2020-11-20T23:59:59+0000"}