{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 £45,780 - £51,393 Pa inc HCAS +1"}}, "datePosted": "2020-11-02T17:01:00+0000", "description": "&lt;p&gt;We are looking to recruit a highly motivated Band 7 Highly Specialist Cardiac Physiologist to work as part of our cardiac investigations team. We are a friendly, education minded department looking to support your continuing development and ongoing CPD.&lt;/p&gt;\n&lt;p&gt;A 15% recruitment and retention premium (RRP) will be added to your basic salary in addition to high cost living allowance (HCA). An application to increase to this RRP has also been made. Opportunities to participate in weekday and weekend waiting list initiative and private work at enhanced rates are also frequent.&lt;/p&gt;\n&lt;p&gt;You will be required to hold a BSc Cardiac Physiology/Healthcare Science (Cardiology) or AHCS Certificate of PTP Equivalence or RCCP registration. Postgraduate qualification in CRM, EP or Echo such as BHRS/IBHRE/EHRS/BSE accreditation is essential. &lt;br /&gt;&lt;br /&gt;St. George’s Hospital is the provider of one of the largest specialised cardiology services in London. The cardiac physiology service at St George’s performs over 50,000 cardiac investigations and procedures per year including complex PPM/ICD implants and follow-ups, a large EP service performing VT, AF and SVT ablation, a well-established TAVI program and a long standing PCI service including a 24/7 PPCI service and thriving CTO program.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Alexander Grimster - Principal Cardiac Physiologist (Heart Rhythm &amp; Intervention)&lt;/p&gt;\n&lt;p&gt;Alexander.Grimster@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt;0208 725 1387&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s University Hospitals NHS Foundation Trust, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Highly Specialised Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252963", "validThrough": "2020-11-16T23:59:59+0000"}