{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-10-28T13:46:36+0000", "description": "&lt;p&gt;An exciting opportunity for Registered Nurses to join our friendly team at the Fulbrook Centre. The Fulbrook Centre has 2 older adult mental health inpatient wards. We are interested in hearing from dual or mental health registered staff. If you are a preceptee we would be able to facilitate rotation across the three wards and include the option of time with a CMHT, to enhance your first year of practice.&lt;/p&gt;\n&lt;p&gt;The Older Adult mental health wards provide acute psychiatric assessment and treatment for Oxfordshire patients with either a functional and/or organic illness. Our staff are also expected to have strong skills regarding physical comorbidities. We are working towards the recovery model, have achieved our QNOAMHS accreditation and received a good rating from CQC.&lt;/p&gt;\n&lt;p&gt;There is scope for learning with our further education partners and the opportunity to take part in research with our Research partners and with our ward Psychologist including enhancing physical health care, working with carers and managing Violence and aggression. We are looking for energetic and enthusiastic staff with a passion for working with older people.&lt;/p&gt;\n&lt;p&gt;Applicants should have an ambition to care for older people with both mental and physical health illness and a can do attitude and enthusiasm to improve the outcomes for the Older Adult Mental Health client group.&lt;/p&gt;\n&lt;p&gt;Our Trust offers short term accommodation solutions for those looking to relocate to the area, and we can offer full time, part time and flexible working arrangements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul McCannEmail addressPaul.McCann@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fulbrook Centre - Sandford Ward, Oxford", "postalCode": "OX3 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.751", "longitude": "-1.21598"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246826", "validThrough": "2020-11-11T23:59:59+0000"}