{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a inc of HCA"}}, "datePosted": "2020-11-04T10:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Guys and St Thomas’ NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wheelchair Services – Specialist Wheelchair Therapist - Occupational Therapist / Physiotherapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to make a difference to the quality of life of wheelchair users?&lt;/p&gt;\n&lt;p&gt;Are you an organised person with the ability to problem solve?&lt;/p&gt;\n&lt;p&gt;Guys and St Thomas’ Wheelchair Service is a dynamic multi-disciplinary team made up of Occupational Therapists, Physiotherapists, Rehabilitation Engineers, Technical Instructors and Administrators. We are seeking an enthusiastic and motivated Occupational Therapist or Physiotherapist to join the team at GSTT Wheelchair Service. This could be a band 5 looking to progress to a Band 6 post, or a Band 6 looking to develop skills in a new area.&lt;/p&gt;\n&lt;p&gt;The Wheelchair Service provides a comprehensive wheelchair, posture and seating service to the local population of Lambeth, Southwark and Lewisham. Whilst the service is primarily provided through clinics at the Bowley Close Rehabilitation Centre, Crystal Palace, a large proportion of this post will be undertaking community visits.&lt;/p&gt;\n&lt;p&gt;Previous wheelchair service experience is not required but a clinical background in either neurology, paediatrics or community work would allow you to utilise transferable skills. Development of knowledge in the equipment used will be well supported by the senior clinical and engineering team. A position with the team offers an opportunity to develop your clinical skills in all areas of postural and mobility assessments and related equipment prescription. A flexible but organised approach is required to meet the varied needs of the client group. The service is provided to paediatric and adult clients. Clinicians within the Wheelchair Service are responsible for the assessment and prescription of paediatric buggies, standard and active user wheelchairs, specialist wheelchairs, powered wheelchairs, associated postural seating and custom made seating.&lt;/p&gt;\n&lt;p&gt;GSTT Wheelchair Service is unique in that we manufacture our own customised seating and undertake speciality controls assessments. The service is part of a Regional Rehabilitation Centre and as such we work very closely with the Assistive Communication Service, Prosthetics and Orthotics Services. We are an innovative and dynamic team that can support your training needs through our in-service training programme and attendance to relevant external course&lt;/p&gt;\n&lt;p&gt;For an informal visit or more information about the post please contact Suzanna Shari, Highly Specialist Occupational Therapist on 020 3049 7760.&lt;/p&gt;\n&lt;p&gt;Closing Date : 22nd November at Midnight&lt;/p&gt;\n&lt;p&gt;Provisional Interview Date : 11th December&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Rhianydd Evans&lt;/p&gt;\n&lt;p&gt;Job title: Wheelchairs Therapist&lt;/p&gt;\n&lt;p&gt;Email address: Rhianydd.Evans@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 3049 7760&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Rhianydd Evans- 020 3049 7760.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bowley Close Rehabilitation Centre, Crystal Palace, London", "postalCode": "SE19 1SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4221", "longitude": "-.078372"}}, "title": "Wheelchair Service Occupational Therapist / Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255283", "validThrough": "2020-11-22T23:59:59+0000"}