{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-02T20:15:25+0000", "description": "&lt;p&gt;Are you ready for a challenge? Do you want to lead a highly successful team? Applications are invited from an experienced, motivated and independently minded clinical infection prevention and control leader who is able to act on their own initiative, adopting a values led ‘can do’ leadership style within a climate of constant change and uncertainty. Under the leadership of the Director of Infection Prevention and Control and Director of Nursing and Quality, the post holder will develop and manage the strategic direction, operational performance, quality, care and compassion of services.&lt;/p&gt;\n&lt;p&gt;You will take responsibility for leading the infection prevention and control service working closely with the DIPC. Focusing on development of the service including; surveillance, auditing, investigation, prevention and control of infection, you’ll enable us to provide a safe environment for patients, staff and visitors to the Trust. You will lead the team in the development of a high quality, infection prevention and control service; ensuring robust systems are in place to facilitate all staff in provision of high standards of practice and directly supporting the clinical management teams.&lt;/p&gt;\n&lt;p&gt;The post holder will have managerial experience in leading professional teams, and will possess leadership skills to deal competently with complex issues in ensuring that professional standards and policy are upheld, implemented and performance managed. A positive and flexible style and approach is necessary and you must be a team player, able to manage and motivate staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Joanne Dilley&lt;/p&gt;\n&lt;p&gt;Job title Associate Director of Nursing&lt;/p&gt;\n&lt;p&gt;Email address jo.dilley@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07870905052&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Lead Nurse Infection Prevention &amp; Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253079", "validThrough": "2020-11-16T23:59:59+0000"}