{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47068", "minValue": "47068", "unitText": "YEAR", "value": "up to £28 per hour"}}, "datePosted": "2020-10-29T13:37:18+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the passion to make a difference to patients who have an urgent care need and are unable to attend their GP? Are you looking to add extra skills to your portfolio? If so, look no further, as we could have the job for you!&lt;br /&gt; &lt;br /&gt; An exciting opportunity has arisen for an Urgent Care Practitioner (UCP) to join the Surrey out of hours (OOH) service on a bank basis.&lt;br /&gt; &lt;br /&gt; The Surrey OOH service provides advice, information and treatment for NHS patients who become unwell during the out-of-hours period when their own GP surgery is closed.&lt;br /&gt; &lt;br /&gt; The OOH’s operates out of a number of existing primary care centres throughout Surrey so we can offer you shifts at the primary care centres that are closest to you.&lt;br /&gt; &lt;br /&gt; We are specifically looking for UCPs to work at the locations below:&lt;br /&gt; &lt;br /&gt; •Epsom General Hospital, Epsom&lt;br /&gt; •Royal Surrey Hospital, Guildford&lt;br /&gt; •Woking Community Hospital, Woking&lt;br /&gt; &lt;br /&gt; The skill mix within these services is UCP, ANP and GP’s incorporating urgent care, telephone triage, face to face appointments and home visits.&lt;br /&gt; &lt;br /&gt; As part of this job, you&#39;ll see, treat (within your clinical scope, using PGDs) and discharge patients of all ages that present minor illnesses or minor injuries face-to-face when you&#39;re doing a home visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order for you to be considered for the job, as a minimum we are looking for you to:&lt;br /&gt; •Be a qualified General Nurse or Paramedic with valid PIN Number.&lt;br /&gt; •Have a further qualification in Urgent Care or equivalent (patient level 6 assessment)&lt;br /&gt; •Have post registration experience of working in either; A&amp;E, Primary Care or Minor Injuries/Illness&lt;br /&gt; Units&lt;br /&gt; •Have evidence of administering medications using PGD’s&lt;br /&gt; &lt;br /&gt; It would be nice for you to have any one of the below, although these are not essential:&lt;br /&gt; •Have a knowledge of local primary care services&lt;br /&gt; •Have a full complete understanding of the medico-legal aspects of the role&lt;br /&gt; •Have basic IT skills&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary &amp; Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have bank and self-employed jobs available and we’re ideally looking for UCPs who can work on weekends.&lt;br /&gt; &lt;br /&gt; Our shifts are between 6 – 12 hours on either day, however as this is a bank/self-employed position you have the flexibility to work when it’s best for you.&lt;br /&gt; &lt;br /&gt; We can offer you:&lt;br /&gt; •A competitive salary&lt;br /&gt; •Regional/national opportunities&lt;br /&gt; •Free online and face-to-face training&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information &amp; Application Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Once you have pressed apply to this job, you will be contacted by Karla, who sits within our recruitment team by phone or email.&lt;br /&gt; &lt;br /&gt; If you have been shortlisted, the recruiter will submit your CV to the hiring manager who will in turn arrange an interview with you if they feel that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;If you would like to talk to one of our friendly recruiters for further information or for a full, comprehensive job description, please contact Karla Smith.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to receipt of satisfactory references and a DBS check.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is committed to creating a diverse environment and we are proud to be an equal opportunity employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking", "postalCode": "RH4 1SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2348", "longitude": "-.324379"}}, "title": "Urgent Care Practitioner (OOH) - Surrey", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248519", "validThrough": "2020-11-25T23:59:59+0000"}