{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36460", "minValue": "29590", "unitText": "YEAR", "value": "£29,590.20 - £36,460.48 with £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:42:35+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition&lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Kneesworth House offers purpose built services with medium secure, low secure, and both locked and open rehabilitation opportunities.&lt;/p&gt;\n&lt;p&gt;The wide range of care settings maximises the opportunity for patients to have step down pathways and move easily between care settings to whatever level of security is most appropriate for their care. In addition to ward-based living and activity areas there is patient engagement opportunity in varied occupational therapy facilities. Patients here report high levels of satisfaction. Four residential houses afford a clear step down pathway for patients.&lt;/p&gt;\n&lt;p&gt;Services&lt;br /&gt;Medium, Low Secure, Locked Rehabilitation and Open Rehabilitation as well as community houses / residential services for men and for women.&lt;/p&gt;\n&lt;p&gt;Patient Group&lt;br /&gt;Women with mental illness; Men with mental illness, personality disorder or mild learning disability.&lt;/p&gt;\nMain Duties:\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with mental illness and personality disorder&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/li&gt;\n&lt;li&gt;At a more senior level, you’ll also need to lead shifts as well as mentoring and supporting student nurses and other members of the team&lt;/li&gt;\n&lt;/ul&gt;\nTo be successful, you’ll need:\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;li&gt;The drive to continually push your own personal learning and development&lt;/li&gt;\n&lt;/ul&gt;\nIn return for your expertise and hard work, we offer a wide range of benefits including:\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Sign on bonus - £5,000 Welcome to Priory – &lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum\n&lt;ul&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000&lt;/li&gt;\n&lt;li&gt;To be repaid if individual does not complete probation &amp; leaves&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royston", "postalCode": "SG8 5JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0781", "longitude": "-.03059"}}, "title": "Registered Nurse (RMN/ RNLD) With £5k Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225769", "validThrough": "2020-11-13T23:59:59+0000"}