{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22450", "minValue": "22450", "unitText": "YEAR", "value": "Up to £22,450"}}, "datePosted": "2020-11-03T15:47:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we know that recovering from drug or alcohol misuse is an individual journey – one that often requires different resources and different interventions for different people. Our goal is to deliver coherent, accessible and person-centred services tailored to complex individual needs, from clinical treatment through to housing support, employment and integration back into the community via the new integrated Drug and Alcohol services across East Kent.&lt;/p&gt;\n&lt;p&gt;Have you got what it takes to walk that journey with our service users? Then you could now help shape the success of this exciting initiative as a Families Worker in Medway.&lt;/p&gt;\n&lt;p&gt;Running services on a not-for-profit basis, we invest every penny back into our care and our people. Develop your skills and career and take in this key role in our Medway service and help to make a big difference in your local community.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In this key role you will engage with and support individuals who have substance misuse support needs, facilitating their access to, and completion of, appropriate treatment and interventions. Specifically this role will entail working with two cohorts of individuals, families with multiple members who have substance misuse concerns and families with a member in treatment who also require support around carer concerns. You will work as part of the team, manage a caseload and ensure you and your team delivers high levels of performance through its people in a way that realises their potential, by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering on your own role performance commitments and seek to maximise own learning and potential, by seeking guidance, support, coaching and training and capitalising on the range of development opportunities provided by Turning Point in accordance with your Skill Profile.&lt;/li&gt;\n&lt;li&gt;Providing effective induction, coaching, development, of individuals with families who require support and interventions&lt;/li&gt;\n&lt;li&gt;Ensure the effective flow of information within the team, with managers and external parties by passing on and seeking information required, raising unresolved concerns and taking an active interest in TP&#39;s internal communications.&lt;/li&gt;\n&lt;li&gt;Ensure you and your team carry out day to day tasks in accordance with stated policies, procedures and regulations to assist the service achieve its compliance obligations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be able to work to build networks with Social Services and attend meetings that require you to support the individual and family and work to make decisions to reduce harm and risk.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a confident communicator who can prioritise a changing workload and provide high quality support whilst working within Covid safe processes. Comfortable talking to service users in their own environments, you will be focused on maintaining confidentiality, gathering information and you will be able to meet deadlines under pressure. You must be a superb organiser and supportive team player with keen attention to detail, impressive administration skills and a good understanding of Microsoft Office, including Excel spread sheets and other information databases.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatham", "postalCode": "ME4 4NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3792", "longitude": ".533888"}}, "title": "Families Worker - Medway", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254657", "validThrough": "2020-11-17T23:59:59+0000"}