{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 - £31,365 - £37,890"}}, "datePosted": "2020-10-29T12:01:02+0000", "description": "&lt;p&gt;&lt;strong&gt;1.0 wte Band 6 CAMHS NURSE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have a full-time substantive post available within our CAMHS Worthing West Sussex Community team. The team is based at Worthing Hospital.&lt;/p&gt;\n&lt;p&gt;Community CAMHS is crucial in providing assessment and treatment for young people in Sussex. You would be working with a range of conditions including;&lt;/p&gt;\n&lt;p&gt;Depression, Anxiety ,OCD, ADHD and ASC. We also provide a duty service for those in acute distress. CAMHS experience is preferable for this role however please call to discuss if you do not have CAMHS experience. We would need to demonstrate how your skills set is applicable for working collaboratively with children, young people, families and careers . You will need to have excellent engagement skills and assessment skills.&lt;/p&gt;\n&lt;p&gt;You will need to be creative and able to manage your own diary.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be joining a vibrant, dynamic, self-directed and high functioning team. If you enjoy working with young people who present&lt;/p&gt;\n&lt;p&gt;with a variety of different mental health and social needs, and you can manage complex cases and systems, we would welcome your application. You would have&lt;/p&gt;\n&lt;p&gt;access to regular team and individual supervision and we would support your training needs.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate enthusiasm, commitment, flexibility and responsiveness ensuring safe and timely care for young people and their families.&lt;/p&gt;\n&lt;p&gt;Do you want a career in a trust with a 2020 vision of achieving outstanding care and treatment you can be confident in? With a vision that includes becoming the employer of choice? Where our values guide how we do this?&lt;/p&gt;\n&lt;p&gt;As one of the largest providers of children and young people&#39;s mental health, our Care Delivery Service (CDS) provides care across Sussex and Hampshire. Supported by our Clinical Academic Group (CAG) we work to put research, innovation and learning into practice.&lt;/p&gt;\n&lt;p&gt;You will be part of a strong multidisciplinary team, receiving high standards of supervision.&lt;/p&gt;\n&lt;p&gt;Our services build on our CYP-IAPT learning and &#39;deliver with and deliver well&#39; and we have built the infrastructure to sustain this with our collaborative work with our service users who help shape our transformation with their lived experience. Our psychology and intern infrastructure support the meaningful use of the service wide outcome measures framework.&lt;/p&gt;\n&lt;p&gt;Our offer is for a career not just a job, in a team and a trust committed to delivering the best care possible to the community whilst being committed to the wellbeing of its staff - and endeavouring to show this by how we do, what we do - that our staff are our greatest asset and that staff wellbeing is a key priority.&lt;/p&gt;\n&lt;p&gt;We encourage you to make contact with the service before applying. Please contact Jo Shephard, West Sussex Coastal Locality Manager on 07979 620466.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worthing Hospital, Worthing  West Sussex", "postalCode": "BN11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8167", "longitude": "-.364296"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248233", "validThrough": "2020-11-12T23:59:59+0000"}