{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44924", "minValue": "44924", "unitText": "YEAR", "value": "Up to £44924.88 per annum DOE"}}, "datePosted": "2020-10-23T14:13:04+0100", "description": "&lt;h1&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Are you looking to work for a company that offers support and development opportunities? If so, then this could be the role for you!&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Benefits...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The salary range for this role is up to £44,924.88 per annum – dependent on experience. &lt;br /&gt;&lt;br /&gt;We offer a variety of benefits including:&lt;br /&gt;&lt;br /&gt;Training and development opportunities&lt;br /&gt;Company contributory pension scheme&lt;br /&gt;25 days annual leave plus 8 bank holidays&lt;br /&gt;Staff well-being&lt;br /&gt;Access to bank hours&lt;br /&gt;CPD and re-validation support&lt;br /&gt;Cycle to work scheme as well as online retail discounts and other onsite benefits&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the role...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Senior Nurse you will work as part of an integrated healthcare team, utilizing your clinical expertise, decision making and problem solving skills to provide skilled and evidence based nursing care for patients in the prison. You will work within your scope of practice, in accordance with Practice Plus and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What do we need from you so you can do the role?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will need to be registered with the NMC and be able to demonstrate professional development.&lt;br /&gt;&lt;br /&gt;Experience withing a primary care environment is beneficial and experience within a secure environment will also be a bonus.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More Information..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a full-time role, working 37.5 hours per week. The salary for this role is up to £44,044 per annum - dependent on experience.&lt;/p&gt;\n&lt;p&gt;This position has the possibility of Part time hours and Job Share hours.&lt;br /&gt;&lt;br /&gt;We welcome informal visits by appointment so please do contact us for more information and to arrange this.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W12 0AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.516", "longitude": "-.239422"}}, "title": "Senior Primary Care Nurse - HMP Wormwood Scrubs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240859", "validThrough": "2020-11-06T23:59:59+0000"}