{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-19T16:37:16+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking for a career in one of the UK’s most respected mental health and learning disability trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping those with mental health &amp; learning disability problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; This is an exciting opportunity to join the Adult Services Directorate as a Business Administrator / PA.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an experienced and dynamic Personal Assistant to provide comprehensive administrative and secretarial services on a fixed term contract / secondment opportunity for 9 months to the Health and Social Care Manager and Community Service Manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£21,892 - £24,157 per annum pro rata (Band 4)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 22.5 hours per week (3 days) Wednesday - Friday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information about this role please contact Maggie Collings&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;email. maggie.collings@nhs.net  or Phone: 01392 388211&lt;/p&gt;\n&lt;p&gt;(This is a fixed term contract for 9 months. For current NHS employees, this post could be a secondment opportunity.)&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;You will be required to have excellent organisational abilities, particularly in managing diaries, be able to formulate agendas, take accurate minutes and generate reports, have good interpersonal skills, and the ability to communicate effectively working as part of the team and independently.&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate good IT skills and be experienced with all Microsoft Office programmes.&lt;/p&gt;\n&lt;p&gt;You will be experienced in a PA, or secretarial role providing a full spectrum of administrative and office management duties.&lt;/p&gt;\n&lt;p&gt;When considering applying for this post, it is important you read the Job Description and Person Specification to ensure that you fulfil the criteria.&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Your base will be in Newton Abbot, however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive.&lt;/p&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbot", "postalCode": "TQ12 4PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5326", "longitude": "-3.59137"}}, "title": "Business Administrator / PA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233201", "validThrough": "2020-11-12T23:59:59+0000"}