{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T10:01:41+0000", "description": "&lt;p&gt;Contract type: permanent&lt;/p&gt;\n&lt;p&gt;Hours: 37.5 hours/week&lt;/p&gt;\n&lt;p&gt;This post is responsible for the Management and Leadership of the Clinical Governance Team within the Pharmacy Department. The Clinical Governance Team works to ensure the safe and effective management of medicines throughout the Trust.&lt;/p&gt;\n&lt;p&gt;As the Principal Pharmacy Technician in Clinical Governance, you will review policies and procedures to ensure that they reflect national and best practice standards and improve efficiency and patient safety. You will listen to and understand the local picture and ensure that policies and procedures are workable and are implemented effectively. You will design and conduct Audits which assess the effectiveness of medicines management processes. You will also deliver education and training that promotes compliance with processes and improves patient safety.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Principal Pharmacist in Clinical Governance to develop the service and shape the clinical governance agenda for medicines throughout the Trust. You will lead on various medicines management improvement projects throughout the Trust. You will also work closely with the dispensary team, clinical teams and quality assurance team to ensure effective governance across pharmacy services.&lt;/p&gt;\n&lt;p&gt;To apply for this position, you must be a pharmacy technician with a BTEC/NVQ Level 3 in Pharmacy Services or equivalent recognised qualification and be registered with the General Pharmaceutical Council. Experience of working in clinical governance, managing projects and managing staff would also be an advantage.&lt;/p&gt;\n&lt;p&gt;The successful candidate for this post must have good communication and interpersonal skills, be able to problem solve, organise and manage their own time effectively and have a good attention to detail. You should also be positive about the extended role of pharmacy technicians and be keen to develop yourself and the work of the team. You also will participate in the weekend and bank holiday rota, the locking up rota and may be required to work at other sites within the Trust on occasion.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw.  In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatalie BryarsJob titlePrincipal PharmacistEmail addressnatalie.bryars@york.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Principal Pharmacy Technician Clinical Governance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249596", "validThrough": "2020-11-15T23:59:59+0000"}