{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata part time"}}, "datePosted": "2020-11-02T08:16:22+0000", "description": "&lt;p&gt;The Oxford Centre for Genomic Medicine (OxGEM) seek an organised, enthusiastic and compassionate NMC registered nurse or Allied Healthcare Professional who is looking to take up a new role as a Genomic Practitioner/Genomic Nurse Practitioner. The post holder will have consent discussions with patients and their close relatives, to facilitate Whole Genome Sequencing (WGS) for patients living with rare conditions who have not had a diagnoses, often for years or decades. The aim of WGS is to shorten the patient odyssey, helping patients and families receive a diagnosis in weeks rather than years, and to connect them with the correct healthcare professionals and treatments to ensure they are looked after according to their precise need.&lt;/p&gt;\n&lt;p&gt;The successful post holder will have sustained discussions with children and their parents, or adult patients and their close relatives, sensitively imparting information about WGS and providing answers to questions and concerns, to facilitate informed consent. The post holder will work closely with other team members (genetics professionals, project managers and clinical support colleagues) to ensure a smooth patient experience and WGS testing pathway.&lt;/p&gt;\n&lt;p&gt;The post holder will educate her health professionals in OUH Trust and in hospitals across our region, to help them acquire the necessary skills for integrating WGS testing into their mainstream speciality. Training and support will be provided.&lt;/p&gt;\n&lt;p&gt;The post meets the requirements to maintain NMC registration, but does not fulfil the requirements as a training post for GCRB registration as a Genetic Counsellor.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date 22nd November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Planned interview date 3rd December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarbara StaynerJob titleConsultant (Lead) Genetic CounsellorEmail addressBarbara.Stayner@ouh.nhs.ukTelephone number01865 225 931Additional contact information&lt;/p&gt;\n&lt;p&gt;Covid Safe/Socially distant phone and virtual visits (e.g. MS Team) welcome prior to interview&lt;/p&gt;\n&lt;p&gt;Interested applicants can also contact:&lt;/p&gt;\n&lt;p&gt;Dr Jude Craft Jude.Craft@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Jo Lowndes Jo.Lowndes@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;For information about the position&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Orthopaedic Centre/Ward C/Oxford Centre for Genomic Medicine, Oxford", "postalCode": "OX3 7HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7537", "longitude": "-1.21078"}}, "title": "Genomic Practitioner/Genomic Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251296", "validThrough": "2020-11-22T23:59:59+0000"}