{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "1076681", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 1 PA for lead role"}}, "datePosted": "2020-10-21T16:16:15+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;CONSULTANT IN STROKE MEDICINE&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;40 hours plus 4 hours Stroke Lead Role and Stroke Specific on call.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Chesterfield Royal Hospital is a friendly District General Hospital with the beautiful Peak District on it’s doorstep. This post presents a great opportunity to live and work in some of the finest landscape this country has to offer.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Major cities such as Sheffield, Leeds, Nottingham and Derby are all within an hour’s train journey, and local airports include East Midlands, Manchester and Leeds Bradford, with London within a couple of hours drive.&lt;/p&gt;\n&lt;p&gt;There are excellent schools in the local area, only a few minutes from the hospital, as well as nursery childcare on-site&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for a Lead Consultant Stroke Physician at Chesterfield Royal Hospital NHS Foundation Trust. As Stroke Lead you must be a visionary and hands on leader who possesses excellent management and mentoring skills, has the gravitas to influence and the creativity to innovate alongside a demonstrable track record of leading.This is a replacement post. The successful candidate will be based at Chesterfield Royal Hospital and will join the current team of 1 consultant, and 1 Associate Specialist delivering Stroke services to the population of North Derbyshire (approximately 400,000). The Stroke team is supported by, two Clinical Nurse Specialists and an ACP with a further ACP in training at present.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Stroke Unit is a modern purpose built stroke facility with a hyper acute stroke unit, acute beds and rehabilitation beds on site. The Stroke team is part of the South Yorkshire network and refers patients to Sheffield Teaching Hospitals for thrombectomy. .Thrombolysis Cover is provided in house with out of hours cover provided by a Network Thrombolysis telemedicine rota. On call commitment will be Stroke Specific and exact commitment is being reviewed as part of our 7 days services plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a close-knit, supportive and friendly organisation where each of our 4200 members of staff are valued. We strongly believe that our employees are our greatest asset and so through Listening into Action (LiA), QSIR (Quality Service Improvement and Re-design), Human Factors and our Leading the Chesterfield Way leadership framework we engage our teams and empower everyone at all levels to initiate and bring about real improvements in our care. The Stroke Team are strongly supported at trust executive level.&lt;/p&gt;\n&lt;p&gt;Applicants would be expected to have a broad range of experience in stroke medicine. Applicants must have full GMC registration, MRCP and ability to work at Consultant Level in Stroke Medicine.&lt;/p&gt;\n&lt;p&gt;Interested candidates should contact&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma WelchJob titleClinical Lead Specialty MedicineEmail addressemmawelch1@nhs.netTelephone number01246 516417Additional contact information&lt;/p&gt;\n&lt;p&gt;Mansur Reza&lt;/p&gt;\n&lt;p&gt;Divisional Director&lt;/p&gt;\n&lt;p&gt;Medicine &amp; Emergency Care&lt;/p&gt;\n&lt;p&gt;01246 512455&lt;/p&gt;\n&lt;p&gt;mansur.reza@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124072.jpg", "name": "Chesterfield Royal Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124072"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterfield Royal Hospital, Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "Lead Stroke Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237242", "validThrough": "2020-11-29T23:59:59+0000"}