{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62286", "minValue": "59678", "unitText": "YEAR", "value": "£59,678 - £62,286 per annum"}}, "datePosted": "2020-10-27T13:45:46+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Public Health England provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health. It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally, independent manner.&lt;/p&gt;\n&lt;p&gt;This post is primarily the TB Unit is within the Tuberculosis, Acute Respiratory, Gastrointestinal, Zoonotic/ Emerging Infections and Travel (TARGET) Division of the PHE National Infection Service based on the Colindale site. The TB Unit brings together microbiological, clinical infection and epidemiological expertise with the aim of working with others to reduce the disease burden and associated health inequalities with TB and other mycobacterial infections in the population. The post holder will be a senior member of the Tuberculosis Unit and will head a specialist scientific service, with line-management responsibility for a range of staff including senior scientists, a database manager, and information officers. The principal responsibility of the post holder will be to provide leadership and expertise to deliver and further develop high quality surveillance, analytical and epidemiological services across the TB Unit for M tuberculosis and other mycobacterial infections. They will work to the direction of the Unit Head and in close partnership with other senior members of the Unit including the Clinical Team, the National Mycobacterial Reference Service, Field Service and Health Protection.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Grace Smith by email: Grace.Smith@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGrace SmithJob titleConsultant MicrobiologistEmail addressgrace.smith@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale, London", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "TB Unit Principal Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244777", "validThrough": "2020-11-10T23:59:59+0000"}