{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-14T09:07:53+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Specialist Occupational Therapist - Band 6&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;30.0 hours per week - part time&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Have you a passion for rehabilitation and long term condition management?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a unique band 6 Specialist Occupational Therapist position working as part of our skilled Dent View Rehabilitation Centre. The centre specialises in supporting those with long term conditions, frailty and falls management. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will maintain a complex caseload of both community and outpatient clinic patients offering specialist assessments and completing client centred rehabilitation programmes. You’ll need to be flexible in terms of service demands but your work will be a mixture of clinic, community and at times, acute ward settings. You’ll be the type of specialist clinician that has a can-do attitude, can use innovative solutions to help support people in their own homes with an array of clinical skills, rehabilitation, resource &amp; network knowledge to empower patients to enjoy their lives to their potential. You’ll facilitate client centred health and wellbeing goals based on a strong activity focus. This post offers a superb opportunity to really make a long term positive difference to the lives of your patients. You’ll have a varied community caseload that will challenge your skills as a Specialist Occupational Therapist in both innovative &amp; modern approaches to your evidence based interventions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are keen to hear from candidates with a wide spectrum of experience across a number of specialist settings that will inform your complex and varied caseload. We have a great network of support and development opportunities to the right candidate alongside offering a robust induction. This post is worked part time but there is scope to be flexible with how the hours of work are structured. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is supported by strong links to our #WestOTNetwork of health, community and adult social care practitioners collaborating on shared development, training and high quality patient care. We are really proud of the high quality work that the Dent View Rehabilitation Centre does, however the location of the post offers stunning coastal, mountain and Lakeland scenery, added to that a vibrant friendly community that is sure to be very attractive to the perfect prospective Specialist Occupational Therapist we need. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Healthcare Professionals returning to practice, moving into new roles or changing clinical environments, may access an agreed preceptorship period.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These schemes are subject to availability&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitehaven, Cumbria", "postalCode": "CA28 8JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5302", "longitude": "-3.56318"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225417", "validThrough": "2020-11-11T23:59:59+0000"}