{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum/pro-rata"}}, "datePosted": "2020-11-03T16:16:30+0000", "description": "&lt;p&gt;The post holder will be responsible for leading the business change elements of the EPMA Programme across the Trust, including stakeholder management, clinical improvement processes, clinical benefits realisation.&lt;/p&gt;\n&lt;p&gt;The EPMA Programme is a high-profile, large-scale, highly technical, system implementation and clinical transformational programme which will impact the majority of services within the Trust. It also forms a key deliverable within the Trusts GDE Programme.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a clinician who has a clear understanding of operational delivery of Mental Health Services, experienced in clinical service change and transformation projects and able to establish and articulate the strategic vision. Being driven and adaptable are essential characteristics for this role, this is a unique opportunity to shape the future pathway of a major Trust project as the system is implemented, ensuring key benefits are delivered.&lt;/p&gt;\n&lt;p&gt;The post holder will lead, manage, advise and develop a combined team made up from operational staff, other Service Change Managers and project support staff and internal and external stakeholders.&lt;/p&gt;\n&lt;p&gt;The post is 1 year fixed term but with the opportunity to extend for the right candidate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Alison Corfield Job title Head of Clinical Systems Email address alison.corfield@oxfordhealth.nhs.uk Telephone number 07500103006&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Littlemore Mental Health Centre, Oxford", "postalCode": "OX4 4XN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7175", "longitude": "-1.22952"}}, "title": "EPMA Clinical Service Change Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254750", "validThrough": "2020-11-25T23:59:59+0000"}