{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-07T11:25:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse Nights | Wards | Band 5 | Farnham | Full time | Joining bonus available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Clare Park Hospitalis looking to recruit experienced and committed Night Nurses to join our surgical teams. Working with a wide variety of specialisms you will be able to develop your clinical skills in a modern and supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Most important is that our Nurses are experienced in an acute setting and are willing to learn new procedures and techniques under expert supervision. We are keen to promote from within the Spire network, so if you are looking for a long-term career with advancement opportunities you will find them at Spire.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Hospital covers a wide variety of surgical procedures, you will support in assessing patient’s health and well-being across a complex and changing caseload, assisting in the delivery of care to meet the patient’s needs. You will be available to work night shifts only and will actively promote best practice and contribute towards quality improvements, collect collate and organise data, interpret all of the information and make a justifiable assessment, making this available to relevant others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a Registered Nurse and be used to working in teams with minimum supervision. Competence across a range of skills, supported by professional and clinical knowledge acquired through state registration and additional training is also desirable. You must be available to work a pattern of night shifts only.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform – discount and cashback for over 100 retailers&lt;/li&gt;\n&lt;li&gt;Free annual Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Farnham", "postalCode": "GU10 5XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2251", "longitude": "-.847085"}}, "title": "Staff Nurse Nights", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216208", "validThrough": "2020-11-07T23:59:59+0000"}