{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16372", "minValue": "16372", "unitText": "YEAR", "value": "£9.74 per hour (incl HCAS)"}}, "datePosted": "2020-11-04T14:46:33+0000", "description": "&lt;p&gt;&lt;strong&gt;At Frimley Health, not only is the nature of the work we do is important, everyone has an important role to play, from caring for vulnerable people to providing best patient experience within the communities we serve.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are you looking for an opportunity to make a difference and work in a fast paced, highly rewarding department, our Housekeeping team at Frimley Park Hospital is recruiting a number of Bank Housekeepers to help maintain high standards of cleanliness and a pleasant environment for all patients, visitors and staff.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be enthusiastic and willing to work hard as part of team, as well as confident to carry out individual duties. You will be interacting with a high number of patients each day, playing a vital part in making their stay as comfortable as possible and raising spirits with a friendly and compassionate service.&lt;/p&gt;\n&lt;p&gt;On a typical day as a Housekeeper you can expect to clean a large variety of patient and public facing areas, take part in waste collection, carry out replenishment of supplies on hospital wards, and assist the catering team in serving food and drinks as needed; all while respecting patient privacy and confidentiality.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, you will be required to adhere to departmental standards and ensure processes comply with statutory regulations. You will also act at all times in a manner that upholds the Trust’s values, working as part of a team to ensure efficiency and excellent customer care. Housekeeping/cleaning experience is desirable but this is not essential, as full training will be given.&lt;/p&gt;\n&lt;p&gt;As a member of the bank team, you will be able to choose when to work to fit around your lifestyle. Example shift times available are: 7am-3pm or 5pm-9pm&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process you will complete a Maths and English assessment, in order to progress to interview you will need to pass this.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park Hospital, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Bank Housekeeper", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256287", "validThrough": "2020-11-18T23:59:59+0000"}