{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T14:46:21+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM FOR 6 MONTHS DUE TO THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting, unique opportunity has arisen to support clinical and non-clinical health care workers, patients and members of the public with Covid-19 safety measures. The COVID Safety Advisor will be a highly visible “champion” and accessible at the point of care to support, monitor and provide PPE specific information to maintain staff and patient safety. A main part of the role will be to ensure staff, patients and members of the public visiting are safe within the hospital setting, which will include the monitoring of social distancing, hand hygiene and PPE in line with national guidance.&lt;/p&gt;\n&lt;p&gt;COVID Safety Advisor’s must be approachable to provide factual reassurance to staff and visitors to ultimately give confidence that safety is of the highest priority and to advise and educate on COVID-19 safety measures&lt;/p&gt;\n&lt;p&gt;This is a 6 month fixed term contract, providing daily cover at hospital sites across the Health Board including Royal Gwent, Grange University, Nevill Hall, Ysbyty Ystrad Fawr and Ysbyty Aneurin Bevan Hospitals. Flexibility to ensure cover of the hospital sites is desirable and part-time hours will be considered. Applications for a secondment to this post need to be agreed with current line managers.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rhian Lewis - Project Manager&lt;/p&gt;\n&lt;p&gt;rhian.lewis2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01873 732048&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Multiple sites across the Health Board, Healthboard wide", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Covid Safety Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258165", "validThrough": "2020-11-12T23:59:59+0000"}