{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 p.a. pro rata inclusive of Outer"}}, "datePosted": "2020-11-02T15:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Medicines Optimisation Pharmacy Technician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Central and North West London NHS Foundation Trust is a Top Employer Award Winner and works in partnership to provide responsive and dependable primary care, mental health, learning disabilities and substance misuse services to the diverse and culturally rich communities we serve&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an enthusiastic and motivated band 5 Medicines Optimisation Pharmacy technician to join our Medicines Optimisation Team based at IRC Heathrow. The service is part of Central and North West London (CNWL) NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;IRC Heathrow currently operates an electronic prescribing system within the healthcare department. The successful candidate will have a BTEC/NVQ Level 3 in Pharmaceutical sciences, experience in a secure environment is desirable but not a requirement. You will be able to demonstrate your competency and pharmacy practice skills by use of a practice portfolio. The successful candidate will demonstrate good organisation and prioritisation skills.&lt;/p&gt;\n&lt;p&gt;You will must have good communication and time management skills. You will be responsible for contributing towards efficient medicines management systems to ensure safe and secure handling of medicines.&lt;/p&gt;\n&lt;p&gt;You must have exceptional interpersonal skills and a non-judgemental approach to liaise with service users who present with a wide range of complex health needs.&lt;/p&gt;\n&lt;p&gt;In addition you will work alongside a multidisciplinary staff team in an environment which is challenging and fast paced. You will be required to work alone without direct supervision at times so you should be able to use your initiative to solve problems in a methodical manner which supports the service users and day to day operations of the service. The team comprises of a Specialist Pharmacist and Pharmacy Technicians.&lt;/p&gt;\n&lt;p&gt;You will be encouraged and supported in developing your skills, participate and attend CNWL Trust Pharmacy continuing education meetings and senior technician meetings. The Trust has a strong commitment to advancing pharmacy practice and embedding effective medicines management systems into patient care. CNWL strives to develop services and medicines management is an integral part of this growth and development&lt;/p&gt;\n&lt;p&gt;Due to security requirements you may have to complete additional clearance checks including for counter terrorism.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlphonsus NwakanmaJob titleSpecialist PharmacistEmail addressalphonsus.nwakanma@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "IRC Heathrow, West Drayton", "postalCode": "UB7 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4831", "longitude": "-.483529"}}, "title": "Medicines Optimisation Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252703", "validThrough": "2020-11-16T23:59:59+0000"}