{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 £40,037 - £74,661"}}, "datePosted": "2020-11-04T13:46:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Department of Acute Medicine&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;University Hospital of North Midlands&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Medicine Division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Certificate of Eligibility of Specialist Registration (CESR) Rotations in Acute Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic individuals to join our expanding and dynamic Acute Medicine team. We are advertising Acute Medicine-specific CESR rotations based at University Hospitals of North Midlands. These are middle grade level posts offered as specialty doctor contracts. They are intended to provide the clinician with the support and training required to successfully complete all aspects of the CESR process.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are a popular middle grade training centre within the West Midlands Deanery with 4 Acute Medicine ST3-7 trainees and 5 specialty doctors on CESR rotations already attached to our department. The post holder will gain a wide range of experience in all aspects of work within the Acute Medicine Department. During this time the post holder will work primarily in the Acute Medical Unit (AMU) and in the Ambulatory Emergency Centre (AEC) as well as providing support to our Short Stay Unit (SSU).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There will be support given to obtain competencies as per AIM and GIM curriculum including specialty experience in Intensive Care Medicine, Respiratory Medicine, Cardiology, Elderly Care, Infectious Diseases and other areas that are relevant to the respective training curriculum. Regular training sessions to achieve core knowledge will be arranged (includes study leave and funding for required courses e.g. ALS). There is time specifically set aside for academic work education, audit and management development – this will form 1 session per week for supporting professional activities. The post holder will be allocated a Mentor/Clinical supervisor from amongst the Consultant body and there is a robust system of appraisal.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You must have wide experience in General (Internal) Medicine and be comfortable in the initial assessment and on-going treatment of acutely ill adult medical patients with a wide variety of pathology. You will work under Consultant supervision and within a dedicated team at all times. As a university hospital and a major tertiary centre we offer a large variety of sub specialty services providing an excellent learning environment.&lt;/p&gt;\n&lt;p&gt;Our current services include a state of the art and well performing Ambulatory Emergency Care (AEC) unit, 65 bed AMU and 22 bed SSU at RSUH and a 30 bed AMU at our County site. Our modern AMU’s feature higher monitoring units as well as ultrasound facilities. &lt;/p&gt;\n&lt;p&gt;In October 2018 we launched a pioneering Acute Medical Rapid Assessment (AMRA) service at the RSUH site. Located within the Emergency Department, the AMRA service has its own dedicated Acute Physicians, junior doctors and nurses who facilitate early consultant input for patients referred by the Emergency Department. The service is supported by a dedicated ward, co-located to the SSU and AMU, and complements our existing ambulatory care service by enhancing our same day discharge pathways. This service has resulted in up to 40% additional admission avoidance for ED referred patients and has attracted interest from many centres outside our region.&lt;/p&gt;\n&lt;p&gt;The Trust is a University Teaching Hospital with its own Medical School and has a newly built Academic Complex. We have modern diagnostic facilities and have been substantially expanding our current acute medical services through a 2 million pound investment including a brand new state of the art Ambulatory Emergency Care (AEC) centre at the RSUH site. Work will include sessions across the trust at both our RSUH and County sites providing the post holder with a n excellent mix of tertiary centre and DGH experience.&lt;/p&gt;\n&lt;p&gt;The Department has a high commitment to the training and development of its entire staff. Junior doctor training is a high priority and the programme has consistently gained excellent feedback from our trainees of all grades and there is also an in-house education programme. There is an on-going programme of audit covering a range of subjects.&lt;/p&gt;\n&lt;p&gt;You will be working in a well-supported tertiary centre environment benefiting patients across our sites. There are established pathways in place streaming select acute patient groups directly into specialised services inc. primary PCI for STEMI’s, a Frail Elderly assessment unit, direct Renal, Neurology and Haematology/Oncology admissions and an Acute Stroke unit providing 24/7 thrombolysis and invasive vascular interventions. We operate a pioneering level of 7 day Consultant cover across all medical sub-speciality departments.&lt;br /&gt;&lt;br /&gt;The University Hospitals of North Midlands are based in Stoke on-Trent, Staffordshire. There are excellent rail and road links being situated on the M6 motorway. Birmingham and Manchester are within easy travelling distance. &lt;/p&gt;\n&lt;p&gt;Staffordshire adjoins Cheshire, Derbyshire and Leicestershire, the West Midlands and Shropshire, and is part of the National Forest and Peak District National Park. Cannock Chase is within the County an area of outstanding Natural Beauty. There are 2 local universities and a number of high performing schools and colleges (including a number of independent and grammar schools). The area boasts affordable housing within easy commute to either of the main hospitals..&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In order to be considered applicants must have FULL GMC Registration, Advanced Life Support and have previous experience of working in the NHS or equivalent.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Participation in some out of hours work will be expected and this will be re numerated as per terms and conditions set out in the specialty doctor contract.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For informal enquiries please contact &lt;/p&gt;\n&lt;p&gt;Dr Zia Din, Deputy Divisional chair Medicine RSUH/County Hospital      01782 674411&lt;/p&gt;\n&lt;p&gt;Dr Sven Lehm, Clinical Lead Acute Medicine, RSUH       01782 674411&lt;/p&gt;\n&lt;p&gt;Dr Raghava Reddy, Clinical Lead Acute Medicine County Hospital      01785 257731&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Sven Lehm, Clinical Lead for Acute Medicine on 01782 (674411).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke on Trent/Stafford, Stoke on Trent/Stafford", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "CESR Specialty Doctor Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256057", "validThrough": "2020-11-18T23:59:59+0000"}