{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T09:15:36+0000", "description": "&lt;p&gt;Are you outgoing, highly motivated and want to make a real difference to patient care and experience then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen for a Band 6 Mental Health Nurse, Occupational Therapist or Social Worker to join the Bed Management Team who will be based in Leyland.&lt;/p&gt;\n&lt;p&gt;This is a challenging, varied role, where you will use your clinical, operational and organisational expertise to the full. You will also provide advice, support and information, ensuring efficient streamlining of a patients journey to facilitate “Right Patient, Right Bed”.&lt;/p&gt;\n&lt;p&gt;In doing this the right candidate will have a desire to optimise patient flow and discharge pathways, working closely with multi-disciplinary colleagues. There is a requirement for clinical experience in the acute mental health settings with a desire to improve the patient experience and journey.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work independently using initiative, and applying a high degree of confidentiality to all of their work. The right candidate must be able to demonstrate good interpersonal and communication skills, manage competing demands and organise their own work to meet deadlines in order for the smooth operation of the Bed Management service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be part of a team providing cover 7 days per week 24 hours per day. You must be computer literate with an eye for detail and demonstrate excellent communication skills. It is essential to be able to work both autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt;This is the perfect opportunity for those who are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference to our patients’ health care within the Trusts Bed Management Team and Wider Flow and Capacity Service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Davies on 07790 388116&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leyland House, Leyland, Leyland", "postalCode": "PR26 6TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.708", "longitude": "-2.69733"}}, "title": "Clinical Bed Manager Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251380", "validThrough": "2020-11-23T23:59:59+0000"}