{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-03T14:01:26+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Clinical Effectiveness Team at LYPFT, which supports the Trust with Clinical Audits, NICE Guidance, and Service Evaluations.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a Band 5 full-time (37.5 hours) highly motivated and enthusiastic Clinical Effectiveness Facilitator to join our team. The post holder will primarily focus on supporting the delivery of Service Evaluation projects across the Trust. This includes supporting teams with the design, data collection and analysis, and report writing. There will also be the opportunity to work on Trust-wide projects. Furthermore, there is an opportunity to extend the role at the end of the 12 month period.&lt;/p&gt;\n&lt;p&gt;The team itself is based at the Mount; however the role will cover the entire Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to effectively communicate and engage with clinical teams at all levels, be proficient in both qualitative and quantitative data analysis, and have knowledge of research design methodologies.&lt;/p&gt;\n&lt;p&gt;For further information please contact: Vishal Sharma – Knowledge and Evaluation Lead (vishal.sharma2@nhs.net).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Mount, Leeds", "postalCode": "LS2 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8042", "longitude": "-1.55908"}}, "title": "Clinical Effectiveness and Improvement Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254243", "validThrough": "2020-11-17T23:59:59+0000"}