{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 pa inc HCA"}}, "datePosted": "2020-11-06T10:30:55+0000", "description": "&lt;p&gt;Would you like to join our dynamic team of Paediatric Nurses in our Children’s Emergency Department?&lt;/p&gt;\n&lt;p&gt;We are a friendly dedicated team of Paediatric Nurses and Paediatric consultants. The department is committed to continuous improvements in the service and benefits from having a Paediatric Emergency Nurse Practitioner and Advance Nurse Practitioner service. The Children’s Emergency Department provides nursing care and support to children and young people aged 0-15 years in a purpose built environment. It is co-located to A&amp;E and has its own designated 2 bedded resuscitation area within the unit &amp; is part of the London Major Trauma Network. We have also added a brand new Paediatric Assessment Unit which is co-located to CED to provide care for patients referred by the GP and short stay admissions.&lt;/p&gt;\n&lt;p&gt;Paediatrics achieved an overall ‘Good’ rating in our 2017 CQC inspection, providing outstanding pathways of care, and innovations within the Children’s Emergency Department. Our most recent inspection in 2020 under Emergency Care we also received a ‘Good’ rating showing we work as part of an exciting and dynamic multidisciplinary team which includes Paediatricians, Emergency clinicians, Emergency Nurse Practitioners and Advanced Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a motivated and enthusiastic band 5 paediatric nurse with experience and a passion for emergency or acute paediatric care. The post holder should be a registered children’s nurse, have excellent communication skills and be keen to promote clinical excellence within our team.&lt;br /&gt;&lt;br /&gt;We are dedicated to supporting the development of our paediatric nurses within our service and offer continuing professional development including Trauma Team Member, Burns care, PILS/APLS, Venepuncture and cannulation and progression to Band 6. New starters have a supernumerary period on commencing the post and will be allocated a mentor alongside the practice educator to support you. The trust also has a well-established preceptorship programme which you will be part of which will also see you qualify as a student Supervisor by the end of your first year with us. &lt;br /&gt;&lt;br /&gt;*Please note that this vacancy is for registered paediatric nurses only*&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Mitchell, on 01923 217564 or jennifer.mitchell8@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 5 - Staff Nurse, Children&#39;s Emergency Department, CED", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259218", "validThrough": "2020-11-22T23:59:59+0000"}