{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £39,681 incl. Fringe HCAS"}}, "datePosted": "2020-10-26T13:29:48+0000", "description": "&lt;p&gt;We are currently in the process of looking for a Band 5 - 6 Developmental Community Mental Health Nurse for Reigate Community Mental Health Recovery Service.&lt;/p&gt;\n&lt;p&gt;We welcome newly qualified applicants or those approaching qualification as well as those who would like to develop their skills and work within a different setting. We offer a comprehensive support package with our experienced nursing staff to complete a specific set of competancies to enable you to develop into a competent band 6 community mental health nurse.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to demonstrate a high level of commitment, motivation and knowledge working with people with severe and enduring mental health problems. You will also need to demonstrate clinically effective care management skills and interventions in accordance with the Care Programme Approach.&lt;/p&gt;\n&lt;p&gt;You will be required to hold care co-ordinator responsibility for a number of service users. You will need to demonstrate excellent communication skills and be able to work collaboratively with a multidisciplinary team. You will be committed to the delivery of a high quality service, working both independently and as part of a well established, innovative and recovery-focused team in meeting the needs of service users and their carers.&lt;/p&gt;\n&lt;p&gt;In return you will have a fulfilling and varied role within a friendly and supportive team. You will receive active management support and opportunities for personal and professional development.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The candidate must have a full and valid driving licence and access to a vehicle for work purposesdue to the community element of this role and the large geographical area that this post covers.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gatton Place, St Matthew&#39;s Road, Redhill, Surrey, RH1 1TA", "postalCode": "RH1 1TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2396", "longitude": "-.17157"}}, "title": "Community Mental Health Nurse (B5/6 Developmental Role)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242652", "validThrough": "2020-11-12T23:59:59+0000"}