{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7 rate"}}, "datePosted": "2020-10-23T12:20:45+0100", "description": "&lt;p&gt;The RLHIM (The Royal London Hospital for Integrated Medicine) are seeking Band 7 Cognitive Behavioural therapists.&lt;/p&gt;\n&lt;p&gt;The Royal London Hospital for Integrated Medicine (RLHIM) is part of UCLH (University College London Hospitals NHS Foundation) Trust and is Europe’s largest public sector Centre for integrated medicine.&lt;/p&gt;\n&lt;p&gt;The hospital offers a range of therapies which are integrated into the NHS and with conventional medicine. All clinics are led by doctors and other healthcare professionals who have received additional training in complementary medicine&lt;/p&gt;\n&lt;p&gt;Essential Requirements&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Right to work in the UK&lt;/li&gt;\n&lt;li&gt;A minimum of 6 months experience working within the NHS&lt;/li&gt;\n&lt;li&gt;Ability to work under pressure&lt;/li&gt;\n&lt;li&gt;Able to communicate accurately and effectively&lt;/li&gt;\n&lt;li&gt;Experience in working with complementary medicines would be welcomed but not necessary. Having an interest in working with complementary medicine will be helpful.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Job purpose;&lt;/p&gt;\n&lt;p&gt;1.) To be a key member of the RLHIM Psychological therapies and AHP teams&lt;/p&gt;\n&lt;p&gt;2.) To provide highly specialist outpatient cognitive behavioural psychotherapy assessment and treatment to a range of appropriate patients with chronic physical health conditions Specifically chronic Fatigue Syndrome, Fibromyalgia Syndrome and irritable bowl syndrome&lt;/p&gt;\n&lt;p&gt;3.) To act in consultative capacity in matters relating to cognitive behavioural psychotherapy to RLHIM medical&lt;/p&gt;\n&lt;p&gt;4.) To act as an education resource to RLHIM Staff relating to the range of patients treated&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in this role, please apply online today and attach your CV.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "60 Great Ormond Street  London", "postalCode": "WC1N 3HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5217", "longitude": "-.121373"}}, "title": "Bank Cognitive Behavioural Therapist band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240513", "validThrough": "2020-11-23T23:59:59+0000"}