{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-26T14:30:11+0000", "description": "&lt;h1&gt;Research Administrator&lt;/h1&gt;\n&lt;p&gt;Royal Papworth is the UK’s largest specialist cardiothoracic hospital providing a full range of adult services in cardiology, cardiac surgery, thoracic surgery and respiratory medicine. We are the country’s main heart and lung transplantation centre with an international reputation for innovation and research excellence.&lt;/p&gt;\n&lt;p&gt;We currently have a vacancy for a Research Administrator to work within Papworth Trials Unit Collaboration (PTUC). The main duties of the post include; supporting a variety of administrative duties undertaken on a Royal Papworth Sponsored multi-centre study. A large portion of this role will involve conducting health related questionnaires by telephone with patients consented to the study on a daily basis.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Other duties include inputting information onto electronic databases, organising meetings, filing and typing as well as any other office duties in a confidential environment. In addition, the role requires liaising with researchers (internal and external) to obtain necessary documentation and managing correspondence. You will be expected to be able to interact with members of the public, external NHS employees and organisations, and colleagues in a professional manner, communicating confidential information in written, verbal and electronic formats.&lt;/p&gt;\n&lt;p&gt;This post will be based at Royal Papworth House offices in Huntingdon but on occasion will involve travel to the hospital for meetings.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding the post contact Trial Manager, Melissa Earwaker 01223 639 712&lt;/p&gt;\n&lt;p&gt;** We reserve the right to close this vacancy once sufficient applications have been received**&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Cambridge Biomedical Campus, Papworth Road, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Research Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242891", "validThrough": "2020-11-30T23:59:59+0000"}