{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T11:31:52+0000", "description": "&lt;p&gt;Are you a registered healthcare professional who is passionate about education? Do you want to help mould the clinicians of the future? Do you enjoy using creative teaching strategies to promote and evaluate learning?&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to become an integral part of the well-established Medical Education Team. You will contribute to the undergraduate and postgraduate programmes delivered by the team as well as influence the shaping of multi-disciplinary simulation based education at CNTW.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to be creative, innovative using technology to enhance training and education.&lt;/p&gt;\n&lt;p&gt;Professional healthcare registration is essential and the post holder will need to be passionate about multi-disciplinary education and training with extensive educational experience. You must be confident in training colleagues of all grades and disciplines, and experience of delivering both classroom-based and in-situ simulation would be an advantage.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work across the Trust supporting the delivery of the current programmes. As well as training and supporting teams in developing an understand of the purpose of simulation, coordinating, evaluating and delivering simulation based education, supporting the development of scenarios that will enhance quality and safety of patient care, facilitating education in debriefing, clinical skills and team work.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Valerie Tippins  Job title: Simulation and Educational Development Lead&lt;/p&gt;\n&lt;p&gt;Email address: val.tippins@cntw.nhs.uk &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Bruce Owen, Director of Medical Education, bruce.owen@cntw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Nicholas Hospital, Gosforth", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Simulation and Education Development Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253752", "validThrough": "2020-11-17T23:59:59+0000"}