{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8a/b dependent on experience"}}, "datePosted": "2020-10-20T14:00:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Interim Pharmacy Manager | Pharmacy | Band 8a/b dependent on experience | Bristol | Full Time, No Nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Bristol has an exciting opportunity for an Interim Pharmacy Manager working 37.5 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With 76 beds and 5 operating theatres and the only private hospital in the South West with an Intensive Care Unit, Spire Bristol Hospital has been providing excellent care, expertise and knowledge in a supportive and progressive environment for over 32 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide an exemplary pharmacy service in accordance with current legislation, accepted professional and ethical standards and clinical requirements.&lt;/li&gt;\n&lt;li&gt;Be responsible for leading, motivating and effectively managing the pharmacy team by providing excellent clinical and managerial leadership.&lt;/li&gt;\n&lt;li&gt;To provide advice and support to consultants, other clinicians and patients ensuring the safe, appropriate and cost-effective use of medicines.&lt;/li&gt;\n&lt;li&gt;To advise the hospital and its departments on the safe management of medicines, ensuring compliance with current legislation and professional standards.&lt;/li&gt;\n&lt;li&gt;To promote a multidisciplinary, patient focused approach to the delivery of an efficient, high quality healthcare service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be GPHC registered - your registration should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 5 years Pharmacy experience.&lt;/li&gt;\n&lt;li&gt;Experienced manager with HR experience and an excellent understanding of clinical governance&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care, Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 or email carly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Interim Pharmacy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234652", "validThrough": "2020-11-20T23:59:59+0000"}