{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26896", "minValue": "26896", "unitText": "YEAR", "value": "£16.00 per hour"}}, "datePosted": "2020-10-14T10:26:26+0100", "description": "&lt;h2&gt;Want to make money on the side, on top of your normal job? Want to make your own hours? Want to give the Private sector a go?&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;In 2019, we understand that some people don’t just want 1 job or 1 source of income. We understand that some people want the flexibility to work the hours they want. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Our Bank/Casual roles offer all of this, along with weekly pay and a full induction when you start.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mildmay Oaks is a low secure and locked rehabilitation service for men with learning disability and autism spectrum disorder, and for women with learning disability.&lt;/p&gt;\n&lt;p&gt;We are 2 minutes from Winchfield Train Station and we offer a taxi service in the winter to and from the station.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a quality of care to each individual that is of a high standard, being sensitive to individual abilities, respecting privacy and catering for social, emotional, religious and cultural needs whilst encouraging a comprehensive programme of ordinary living with an emphasis on self-help skills.&lt;/li&gt;\n&lt;li&gt;Participating in the assessment of changing care needs and in the development, implementation and evaluation of programmes of care in line with agreed policies and procedures.&lt;/li&gt;\n&lt;li&gt;Participating in the key worker system.&lt;/li&gt;\n&lt;li&gt;Discussing and agreeing on care programmes with other community services.&lt;/li&gt;\n&lt;li&gt;Fostering good relations and lines of communication with other disciplines/services/agencies involved with individuals’ care.&lt;/li&gt;\n&lt;li&gt;Keeping abreast of developments and current trends when caring for people who have a Learning Disability/Mental Health Problem/behaviours that challenge.&lt;/li&gt;\n&lt;li&gt;Ensuring that the NMC standards for drug administration, storage and handling of medication are adhered to.&lt;/li&gt;\n&lt;li&gt;Developing, maintaining and enhancing relationships between parents, relatives and friends of the service users and staff at the home.&lt;/li&gt;\n&lt;li&gt;Promoting access to an independent advocacy for the individual.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hook, Hampshire", "postalCode": "RG27 8BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2921", "longitude": "-.912542"}}, "title": "Bank Staff Nurse (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225704", "validThrough": "2020-11-13T23:59:59+0000"}