{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro rata"}}, "datePosted": "2020-10-28T15:31:38+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a permanent part time, 30 hours, Band 6 Specialist Learning Disability Practitioner within the New Forest Specialist Child &amp; Adolescent Mental Health Team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a core qualification in one of the following fields of practice, Nursing (Mental Health, Learning disability, Paediatric), Occupational Therapy, Social Work or Education, and must have experience of working within learning disability and mental health services, and some experience of working with and assessing for Neurodevelopmental disorders.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit someone who is highly motivated with a passion for working creatively and collaboratively with children and young people with a learning disability, and their families, who present with severe and complex mental health problems. The role will require the successful applicant to hold a case load of young people with learning disabilities with a mental health need and/or a complex behavioural presentation, to provide specialist assessment and interventions including Positive Behaviour Support approaches, anxiety management, adapted CBT and systemic interventions. The successful applicant will develop strong therapeutic working relationships with families, children’s services, local schools and short break providers to ensure the mental health and complex needs of the young people are met. There will be an expectation to support the wider team with some generic CAMHS work.&lt;/p&gt;\n&lt;p&gt;Candidates should be able to demonstrate a good level of autonomy, initiative and an ability to work with a range of different presenting needs. The post holder will be required to take on other identified responsibilities suitable for the banding within the wider team such as duty and urgent assessment.&lt;/p&gt;\n&lt;p&gt;The post-holder will have an opportunity to be part of a subset of clinicians within the New Forest team who have specialist interests and roles in Neurodevelopmental Conditions. The role will include across county access to clinical and peer supervision with the virtual specialist LD practitioners within Hampshire CAMHS, with the expectation to lead initiatives for LD patients within the local team.&lt;/p&gt;\n&lt;p&gt;If you enjoy being a part of a team, are creative, seeking a new challenge and want to make a positive difference to the lives of children &amp; young people and their families, then we would be delighted to hear from you.&lt;/p&gt;\n&lt;p&gt;Excellent support is available including New to CAMHS training, opportunities to access specialist training and regular supervision. Although this is a Band 6 post, we are open to newly qualified or recently qualified practitioners to apply, and for the right candidate we would be prepared to support through preceptorship and/or a developmental post&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Michelle Jarvis&lt;/p&gt;\n&lt;p&gt;Job title Team Manager&lt;/p&gt;\n&lt;p&gt;Email address SPNT.NewForestCAMHS@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02380 743000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashurst Child and Family Centre, New Forest, Hampshire", "postalCode": "SO40 7AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8921", "longitude": "-1.52262"}}, "title": "CAMHS Clinician - learning disability and neurodevelopment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247199", "validThrough": "2020-11-15T23:59:59+0000"}