{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T13:46:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Permanent - Band 5 Flexible Working Nurse at Dewsbury &amp; District Hospital or Pinderfields Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an Adult Registered Nurse who is looking for flexible working arrangements with a supportive, understanding employer? Come join our outstanding nursing team working at Dewsbury &amp; District Hospital or Pinderfields Hospitals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Mid Yorkshire NHS Hospitals, we realise that many Registered Nurses have busy and demanding commitments outside of their working life and are unable to commit to the traditional shift patterns. With this in mind, we are proud to be able to offer a variety of flexible working options working as a ‘Suits You Nurse’ at Dewsbury &amp; District Hospital or Pinderfields Hospital.&lt;/p&gt;\n&lt;p&gt;Whatever your availability, whether it is for &lt;strong&gt;certain shifts or set days&lt;/strong&gt;, we offer guaranteed employment, full time or part time, to suit your requirements.&lt;/p&gt;\n&lt;p&gt;If you are wanting&lt;strong&gt; a fixed term contract&lt;/strong&gt; for an extended period with a defined start and end date. You tell us what shifts suit you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to just work term time&lt;/strong&gt;? We can offer a permanent contract where paid/unpaid leave can be taken during school holidays or other defined periods. You tell us what shifts suit you&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Retire and Return – &lt;/strong&gt;Have you retired as a nurse but &lt;strong&gt;want to return. &lt;/strong&gt;Tell us what shifts you want to work that will suit you.&lt;/p&gt;\n&lt;p&gt;If you are &lt;strong&gt;unable to commit to traditional shift times and patterns&lt;/strong&gt; - we can accommodate flexible hours such as later start times and/or earlier finish times e.g 9:30am - 15:00pm. You tell us what shifts suit you.&lt;/p&gt;\n&lt;p&gt;Working at either Dewsbury &amp; District Hospital and Pinderfields Hospital, you will be supported to work in friendly teams by caring Ward Managers and Clinical Matrons with a passion for high standards.&lt;/p&gt;\n&lt;p&gt;Development of our staff is key to running our service effectively, and we will invest our time in your professional development. If you are currently working outside of the NHS or in secondary care you will receive training and comprehensive support to get you off to a flying start.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All you need to do is tell us what suits you. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield/Dewsbury", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Registered Nurse - Suits You Shifts", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244794", "validThrough": "2020-11-15T23:59:59+0000"}