{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "36329", "unitText": "YEAR", "value": "£36,329 - £44,503 per annum (pro rata)"}}, "datePosted": "2020-11-03T11:00:56+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Reference Number&lt;/strong&gt;: 919-AW-19223750-EXT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;: Fixed term&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working pattern&lt;/strong&gt;: 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AFC Band 7: £37,570 - £43,772 per annum pro rata&lt;/p&gt;\n&lt;p&gt;Civil Service Grade SEO: £36,329 - £42,481 per annum pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Scheme&lt;/strong&gt;: Civil Service Grade SEO or Agenda for Change Band 7Administrative &amp; Clerical or Clinical as per spec&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty/Function:&lt;/strong&gt; Screening &amp; Immunisation Coordinator&lt;/p&gt;\n&lt;p&gt;Please note that there are two potential sets of criteria in order to fulfil this role. The criteria for the clinical post are available by accessing the Job Description link and the non-clinical via the Person Specification link. Should you be successful in applying for this post, you will be offered the terms and conditions that correspond to the person specification and criteria that you meet.&lt;/p&gt;\n&lt;p&gt;Clinical roles are part of the PHE Clinical Ring Fence and as such are offered under analogous NHS Terms and Conditions. Non-clinical roles are offered under PHE Terms and Conditions.&lt;/p&gt;\n&lt;p&gt;The role of the Screening and Immunisation Coordinator is to support the commissioning of consistently resilient, high quality national screening and immunisation programmes for the population of Kent and Medway&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, outcome focused person who has good knowledge of immunisation or screening programmes and/or experience of supporting the commissioning of other public health programmes. You will be committed to improving screening and immunisation services for the population. You will have the ability to develop and sustain excellent working relationships with a range of stakeholders across the NHS and local public health system.&lt;/p&gt;\n&lt;p&gt;You will be employed by Public Health England and will receive your professional leadership and have your professional development needs met through this route and work very closely with public health commissioners in NHS England. Our team is embedded in NHS England to provide specialist public health support to their commissioning responsibilities for screening and immunisation programmes.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Folkestone Dover or home working", "postalCode": "CT20 1JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0826", "longitude": "1.1814"}}, "title": "Screening &amp; Immunisation Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253591", "validThrough": "2020-11-17T23:59:59+0000"}