{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096 - £110,683 per annum"}}, "datePosted": "2020-10-13T11:16:32+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist – Upnor ward, Priority House, Maidstone&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£82,096- £110,683 per annum, plus 0.5PA for on-call and 3% (of a 10 PA salary) Category A availability supplement. This is pro rata for part time staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that you will be required to submit an application form for each post you are interested in applying for.&lt;/p&gt;\n&lt;p&gt;Welcome to Kent and Medway NHS and Social Care Partnership Trust (KMPT) and the new career choice you have (or did not realise you have) been looking for.&lt;/p&gt;\n&lt;p&gt;COVID-19 has brought with it many challenges but it has also shown us other ways of effective working that look set to be adopted moving forward.&lt;/p&gt;\n&lt;p&gt;This includes &lt;strong&gt;home working&lt;/strong&gt; and the smart use of technology for both appointments with service users and staying connected to colleagues. Talk to us about how that could make a difference in your life.&lt;/p&gt;\n&lt;p&gt;As well as a new hire bonus (£15,000*) and financial support for relocation (up to £8,000*), &lt;strong&gt;we want to understand what flexibility means to you&lt;/strong&gt;. Is it a nine-day fortnight or condensed hours? Do you have caring responsibilities? Is there a certain day you cannot work for personal reasons? Talk to us.&lt;/p&gt;\n&lt;p&gt;We are stronger in our diversity with 52 nations represented and &lt;strong&gt;we want the real you to turn up at work&lt;/strong&gt;; it is an environment where you are encouraged to be yourself.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I can feel a real shift in feeling safer to speak up @kmptnhs We are getting better at listening without judgement. We are getting better at resisting the urge to jump to action. The networks (BAME, Faith, (dis)Ability and LGBTQ+) are reducing the effects of isolation and broadening views #stilllistening” &lt;/em&gt;- Celina on Twitter&lt;/p&gt;\n&lt;p&gt;We are all responsible for the evolving culture and the movement is tangible.&lt;/p&gt;\n&lt;p&gt;*Subject to conditions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information specific to the post&lt;/strong&gt;&lt;br /&gt;This is a 10 PA per working week post within one of the three general younger adult acute inpatient wards based at Priority house in Maidstone. The hospital also has a ward for older adults with mental health diagnoses, including dementia. All of the wards on site admit informal and detained patients.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for medical leadership and work collaboratively with other members of the MDT to deliver quality care to patients on the ward. The office base will be undertaken within Priority House.&lt;/p&gt;\n&lt;p&gt;The wards are staffed by an experienced multidisciplinary team of dedicated staff, who assess and treat patients with wide range of psychiatric disorders. Treatment is achieved in a safe and secure environment using strategies including pharmacological, psychological, occupational and biological. Active participation in formulating individualised care plans and communication with families and carers is encouraged. There are 4-5 admissions per week and the average length of stay is 32 days.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have MRCP or equivalent and be on, or within six months of inclusion on, the Specialist Register and be fully registered with the GMC, as well as Approved Clinician and S12 approval under the Mental Health Act.&lt;br /&gt;&lt;br /&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;/p&gt;\n&lt;p&gt;Please note that due to the current circumstances and travel restrictions in place, all interviews will be conducted via video link using Life Size on 30th November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re #KMPTProud &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please call Catharine Blackman on 01622 724133 or email catharine.blackman@nhs.net to make an appointment to speak to Executive medical director Dr Afifa Qazi or Deputy medical director, Rosarii Harte and click on the attached links to find out more.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Vijay DelaffonJob titleInterim Assistant Medical DirectorEmail addressvijay.delaffon@nhs.netTelephone number07833402793&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priority House, Maidstone", "postalCode": "ME16 9PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2734", "longitude": ".486413"}}, "title": "Consultant Psychiatrist - Upnor Ward, Maidstone", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223991", "validThrough": "2020-11-08T23:59:59+0000"}