{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-06T14:30:51+0000", "description": "&lt;p&gt;Brighton &amp; Sussex University Hospitals Trust is recruiting for its busy centralised Booking Service for its elective outpatient care. The overall aim of the Booking Centre is to improve the efficiency of the service and the quality of the patient experience and has five key objectives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring all patient appointments are booked on receipt of referral and triage;&lt;/li&gt;\n&lt;li&gt;Ensuring patients are assigned to the right clinic first time;&lt;/li&gt;\n&lt;li&gt;Ensuring an efficient telephone service is maintained;&lt;/li&gt;\n&lt;li&gt;Minimizing short notice cancelled clinics and optimising clinic capacity;&lt;/li&gt;\n&lt;li&gt;Introducing a patient focused booking program.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for experienced Booking Clerks to assist the Operational Services Manager to deliver a gold standard booking service for our patients and a gold standard clinical administration service for our clinical teams.&lt;br /&gt;&lt;br /&gt;You will have experience of working in a high volume patient / customer contact center, ideally in an acute hospital environment.&lt;br /&gt;&lt;br /&gt;The responsibilities of the role will range from the registration of new patients, handling GP and patient queries for clinics, making appointments, such as full and partially booked appointment, using Trust systems .&lt;/p&gt;\n&lt;p&gt;Main duties will be answering telephone calls from patients or GPs wishing to make or change appointments or making general enquiries. you will be required to work within a team to deliver an improved service for patients and to maximise efficiency.&lt;/p&gt;\n&lt;p&gt;This post has been identified as suitable for a job share and for this reason we would welcome applications from those interested in part time hours. Please identify this preference within the Supporting Information section of your application form.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Ashton&lt;/p&gt;\n&lt;p&gt;Job title Deputy Operational Manager&lt;/p&gt;\n&lt;p&gt;Email address Sarah.Ashton2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 696955 x63961&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital / Elliott House, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Outpatient Booking Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260122", "validThrough": "2020-11-22T23:59:59+0000"}