{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum inc of HCAs"}}, "datePosted": "2020-11-02T09:15:49+0000", "description": "&lt;p&gt;I am Gurpreet Brar the named Nurse for Safeguarding at Frimley Health NHS Foundation Trust Wexham Park. We are currently seeking to appoint a Learning Disability Nurse, who is a passionate, dedicated, and confident individual, like yourself, with significant experience in learning disability nursing.&lt;/p&gt;\n&lt;p&gt;The applicant will be passionate and keep the interests of the person you are working with at the heart of what you do. You will have good communication skills, helping others in communicating with vulnerable patients with learning disabilities. Also, you will work well as part of a team and have the responsibility to make decisions. The successful applicant will be committed to ensuring that all patients with a learning disability receive excellent, person centered care at all points of their care pathway, in line with Trust policy and practice.&lt;/p&gt;\n&lt;p&gt;This will be an excellent opportunity to bring the specialist knowledge and skills of learning disability nursing into practice. This is a highly specialist operational role with clear corporate responsibility. You will work as part of the wider multidisciplinary and interagency team and will be supported to lead on the delivery of our transformation plan, across domains which include the NHI Improvement standards, LeDeR programme and policy development.&lt;/p&gt;\n&lt;p&gt;The position will be based at Wexham Park Hospital, however there is the expectation to travel across all sites where necessary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Gurpreet Brar&lt;/p&gt;\n&lt;p&gt;Telephone number 0300 615 1399&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham Park Hospital, Slough", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251389", "validThrough": "2020-11-16T23:59:59+0000"}