{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Dietitian Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a motivated Specialist Band 6 Paediatric Dietitian with excellent communication and organisational skills to work 5 days per week at Hull University Teaching Hospital. We are an experienced team of 5 paediatric Dietitians and a paediatric dietetic assistant practitioner. Previous experience of paediatric skills would be desirable, however candidates that can show suitable transferable skills would be considered. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our service covers a wide range of conditions for both in and outpatients. Services include: &lt;/strong&gt;Cystic Fibrosis, diabetes, neonates, complex allergy, first line metabolic, neurology, tube feeding, gastroenterology, and surgery. If you have an interest in any of these areas not included in the current role there may be opportunities to experience more specialist areas in the future. We support development opportunities were possible.&lt;/p&gt;\n&lt;p&gt;This post would cover 3 days in and outpatient work. Clinics include allergy, failure to thrive, gastroenterology, neurology and a range of tube fed children from preterm to 18 years. The remaining two days will provide dietetic support to our Type 1 diabetic patient, after the Service peer review in 2019 we secured 1.6wte to support our diabetes service. The successful candidate will be supported by great working relationships within the Paediatric multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are a very supportive team, have regular team meetings and allocated CPD time. We will provide training for the successful candidate with a competency package, tutorials, shadowing opportunities and allocated time to complete this.&lt;/p&gt;\n&lt;p&gt;The dietetic department at Hull University Teaching Hospitals is a large team (40.7 wte) providing a number of specialist services. Support is provided from a well sourced admin team and clinical assistants and we provide B and C placement student training. We have high profile in our organisation and are responsible for regular monitoring of Trust nutrition standards and run a number of education sessions for nursing and medical staff. We offer a range of management and clinical development opportunities and participation in audits and education is strongly encouraged. All applicants must be HCPC registered. The post holder may be required to work weekends in the future.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE: In cases where a vacancy receives a high number of applications, we may bring the closing date forward. You are therefore advised to submit your completed application as early as possible.&lt;/p&gt;\n&lt;p&gt;Applicants should note that from 1st December 2013 all new appointments to Hull University Teaching Hospitals (excluding Medical Staffing appointments) are subject to the completion of a satisfactory 6 month probation period. In addition, the Employment Probation Policy is attached to all adverts on NHS Jobs as part of the job pack, in order that prospective candidates are aware of the need to complete a 6 month probation period and also the details of how the policy operates.&lt;/p&gt;\n&lt;p&gt;Hull was the City of Culture from 2017. It is a modern city with a number of established developments including the marina, the Deep, St Stephens Shopping &amp; Leisure Centre and Hull Truck Theatre. There are good transport links via road and rail and with Europe via ferry and the nearby Humberside airport. The beautiful Yorkshire coast and countryside is on the doorstep. Hull offers affordable accommodation and good leisure facilities.&lt;/p&gt;\n&lt;p&gt;For further details / informal contacts:&lt;/p&gt;\n&lt;p&gt;Jac Davey&lt;/p&gt;\n&lt;p&gt;Team Leader / Paediatric Dietitian&lt;/p&gt;\n&lt;p&gt;jacqueline.davey@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;Sarah.goodwin@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull University Teaching Hospitals, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Specialist Paediatric Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253390", "validThrough": "2020-11-17T23:59:59+0000"}