{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum (pro rata)"}}, "datePosted": "2020-11-04T09:15:35+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is the leading Trust for teaching, research and specialist services in the North West of England. We provide an extensive range of district general hospital services to the local population of central Manchester and tertiary and specialist services to patients from across the North West and beyond.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the highly respected children&#39;s Speech and Language Therapy Service.&lt;br /&gt;&lt;br /&gt;You will work across two teams and will play a vital role supporting clinicians. Duties will include coordinating training, referral management, typing, supporting clinicians in managing patient groups, liaising with clinicians/professionals across other services, activity reporting to commissioners.&lt;br /&gt;&lt;br /&gt;This is an opening for an enthusiastic and confident individual who enjoys communicating with others and utilising their excellent organisation and administrative skills. We are looking for someone with a positive, can do attitude, who is team focused and wants to learn and get involved. You will need to have a good knowledge of Microsoft Office packages and very good IT skills. &lt;br /&gt;&lt;br /&gt;In return, you will receive an induction programme, full training and have the opportunity for ongoing learning and development.&lt;/p&gt;\n&lt;p&gt;A car driver is essential for this role as you will be required to work over multiple sites.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan MeredithJob titleOperational Service Manager/Admin Cluster LeadEmail addresssusan.meredith@mft.nhs.ukTelephone number01615370426Additional contact information&lt;/p&gt;\n&lt;p&gt;Jayne Macdonald&lt;/p&gt;\n&lt;p&gt;Administration and Business Support Manager&lt;br /&gt;jayne.macdonald@mft.nhs.uk&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Levenshulme Health Centre, Manchester", "postalCode": "M19 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4464", "longitude": "-2.18852"}}, "title": "SLT Administrator - Sure Start/Core", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255157", "validThrough": "2020-11-11T23:59:59+0000"}