{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-10-05T09:59:19+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Specialist Community Public Health Nurse (School Nurse) &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Band: &lt;/strong&gt;6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary scale: &lt;/strong&gt;£31,365 - £37,890&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Various hours/Part-time/Full-time&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract type: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt; Bedfordshire&lt;/p&gt;\n&lt;p&gt;We are looking to recruit experienced, highly motivated, enthusiastic, forward thinking School Nurses to join our School Nursing Service.&lt;/p&gt;\n&lt;p&gt;The post holders will work in collaboration with the Locality Team Manager, Locality Clinical Lead and Locality Safeguarding Lead in the delivery of the Healthy Child Programme, actively promoting and improving health outcomes by addressing inequalities and inequities in health care for a defined population. You will work within a skill mix team across the 0-19 service and in collaboration with colleagues to facilitate a culture of learning and reflective practice, Building Community Capacity through improved partnership working with GPs, Education, parents and a variety of voluntary and statutory partners.&lt;/p&gt;\n&lt;p&gt;All staff have a responsibility for safeguarding children and vulnerable adults and promoting their welfare, and for ensuring they are aware of the specific duties relating to their role. This role will require an Enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;Please note all our recruitment is carried out through NHS Jobs, so you are advised to regularly check your emails (including junk folders) for any correspondence (interview letter and any other type of correspondence) relating your application for this post.&lt;/p&gt;\n&lt;p&gt;Successful applicants to posts at band 6 or above for which a DBS check is required, will be asked to pay for this as a condition of their job offer (£44.00 for an Enhanced Check or £27.00 for a Standard Check). This payment will be deducted from their first month’s salary unless a longer pay back period is agreed with the appointing manager.&lt;/p&gt;\n&lt;p&gt;This will not apply to successful applicants who are registered with the DBS Update Service and is in possession of the disclosure certificate, for whom an online status check will be undertaken.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are able to travel effectively and independently on a daily basis to and from the base, clients’ homes and other venues around the geographical area whilst transporting equipment. If necessary, adjustments can be considered, in accordance with the Disability Discrimination Act.&lt;/p&gt;\n&lt;p&gt;For further enquiries, please contact:&lt;/p&gt;\n&lt;p&gt;Melanie Hayes&lt;/p&gt;\n&lt;p&gt;0-19 Service Manager&lt;/p&gt;\n&lt;p&gt;Tel: 07415 200843&lt;/p&gt;\n&lt;p&gt;Melanie.hayes3@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedfordshire (South Bedfordshire Locality)", "postalCode": "MK43 7PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1904", "longitude": "-.533987"}}, "title": "Specialist Community Public Health Nursing (School Nurse)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212098", "validThrough": "2020-11-08T23:59:59+0000"}