{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T13:46:06+0000", "description": "&lt;p&gt;Would you like to be part of a friendly, proactive and innovative service working to promote a seamless experience for people who use mental health services locally and their friends and family who support them? Look no further.&lt;/p&gt;\n&lt;p&gt;Our team has received national recognition for innovation and improving access to mental health support in the community. The team is cited in the new NHS &#39;Community Mental Health Framework for Adults and Older Adults&#39; (2019) document as an example of a team demonstrating &#39;Innovative ways of working&#39; (pg 19). We were also featured as a case study example of improving access to mental health support in the Royal College of Occupational Therapy strategy document, &#39;Getting my Life back: OT promoting mental health and well-being in England&#39; (2018 pg 14-15). We promoted our service with our service users at an event for MPs in London in 2018, organised by the RCOT to raise awareness of mental health issues.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated, energetic and creative clinician with relevant mental health experience and professional qualification ideally an Occupational Therapist. However applications from Social Workers, RMNs and other appropriately qualified Band 6 clinicians are also welcomed. This is an opportunity to join the team in Horsham and contribute to the further development of our service in the locality. The post is within the Pathfinder clinical service working with Pathfinder West Sussex to offer a more integrated mental health support service outside of the NHS.&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of a small team of clinically trained staff working within Pathfinder West Sussex closely with 3rd sector providers to offer clinical intervention and support to people with mental health difficulties. The role will build on clear pathways between 3rd sector and NHS mental health services working in the innovative partnership alliance, Pathfinder West Sussex, officially launched in May 2018.&lt;/p&gt;\n&lt;p&gt;The post holder will provide clinical/psychological support for individuals accessing Pathfinder West Sussex services and those requiring support in their discharge from NHS mental health services. Interventions include individual work and groups, Recovery College and other courses with Pathfinder partners . The focus of interventions will be on supporting transitions between NHS and 3rd Sector mental health services and offering timely proactive, preventative support.&lt;/p&gt;\n&lt;p&gt;Experience of community and partnership working is required along with the ability to work as part of a wider whole system, enabling and finding solutions together and being able to work flexibly and creatively in a developing service within a specific locality.&lt;/p&gt;\n&lt;p&gt;The team covers West Sussex and this post will be covering the Horsham area with an expectation to provide geographical cross cover if required.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion please contact Jenny Edge, Service Manager on 07554114329 Patricia Mendes, Team Leader 07471031999. If you would like to speak to a Pathfinder clinician currently in post please contact Emma Lewington RMN 07738 758486 or Mairead Blessington OT 07393235020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Park House, Horsham", "postalCode": "RH12 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0643", "longitude": "-.324102"}}, "title": "Pathfinder Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246806", "validThrough": "2020-11-11T23:59:59+0000"}