{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T10:16:29+0000", "description": "&lt;p&gt;At Sandwell and West Birmingham NHS Trust we are looking for dynamic, enthusiastic staff to join us and be the best in the region, supporting the move to our brand new acute site, The Midland Metropolitan University Hospital in 2022.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated nurses who are committed and compassionate.&lt;/p&gt;\n&lt;p&gt;In return you will be fully supported to develop through internal and external courses alongside competency based ward assessments. Along your journey you will be supported by a buddy and team leader to facilitate your transition into our team. If this sounds like the place you want to be then please come join us to start your exciting journey. We have vacancies in some of our areas and rotation across areas as well. We can offer you:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children’s’ Emergency Care Unit (CECU based at City Hospital):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a brand new unit which has six ED and six PAU beds in the same area. There are staff from both areas working alongside each other to support the best pathways for children attending in an emergency. It is the ideal location to learn paediatric and ED skills. Due to COVID-19 pandemic, the area is split into two areas, to treat positive and negative COVID-19 patients separately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lyndon 1:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lyndon one is a 25 bedded inpatient ward with two allocated HDU beds. We specifically cater for children aged from 0-11 years, although we will treat youngsters aged up to 16 years if they require HDU care. We look after children suffering from a variety of illnesses, who need inpatient care.&lt;/p&gt;\n&lt;p&gt;We look after children requiring CPAP, High flow oxygen and provide tracheostomy care amongst many other conditions. You will be fully supported to develop within HDU care through internal and external courses alongside competency based ward assessments. It is the ideal area to gain or improve your HDU skills.&lt;/p&gt;\n&lt;p&gt;For a virtual tour and to meet the staff, check out the YouTube video in the link.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lyndon Ground:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an 18 bed PAU which also houses an inpatient adolescent area. This is a good area to increase knowledge of adolescent and CAMHS patients. This is a non-COVID area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Priory Ground and Children’s outpatients (OPD):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a cross site team which covers OPD, investigations and day surgery. We work closely with our long term patients and their families for continuing care needs. You will have the opportunity to develop skills in phlebotomy, venepuncture, skin testing and specialist investigations tests and treatments. You will undertake assessment of patients pre-operatively and be involved in care pathway for surgical treatment with a variety of specialities. Whilst you are working with us, the team will support you in completing competencies. We are operational Monday to Friday with a variety of shifts.&lt;/p&gt;\n&lt;p&gt;We also have exposure to paediatric ophthalmology emergency and surgery.&lt;/p&gt;\n&lt;p&gt;If you feel we could help you to move forward in your career please contact us for an informal chat by calling our nursing leads below.&lt;/p&gt;\n&lt;p&gt;CECU: Marie Hinks 0121 507 4467. &lt;br /&gt;Lyndon 1: Jo Wright 0121 507 3326.&lt;br /&gt;Lyndon Ground: Avnash Nanra 0121 507 3160&lt;br /&gt;Priory Ground: Fatema Amujee 0121 507 3731&lt;br /&gt;Paediatric Matron Bren Taylor 0121 507 2915&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Bren Taylor Job title Paediatric MatronTelephone number 0121 507 2915&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham NHS Trust, Sandwell and West Birmingham", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Staff Nurse - Paediatrics Open Day", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255349", "validThrough": "2020-11-15T23:59:59+0000"}