{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-16T15:31:35+0100", "description": "&lt;p&gt;Blackpool Teaching Hospitals are looking for highly motivated and committed Band 5 Staff Nurses to work on the Gastroenterology ward, and we are keen to welcome nurses with a passion for this specialty.&lt;/p&gt;\n&lt;p&gt;This is a busy and fast paced ward with a bed capacity of 28 for both male and female patients. We work closely together, alongside a dedicated Clinical Matron and Medical team as well as having very close links to the Endoscopy Unit all with the aim to provide the highest standard of care to this client group.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals with a can do, positive attitude that have the ability and desire to work within our friendly ward teams. The nursing staff work closely with other members of the multi-disciplinary team and pride themselves on delivering a high standard of care and effective discharge planning for our patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a genuine desire to become part of this team and care for the patients within the gastroenterology ward. They will demonstrate excellent communication skills and act as role model to the rest of the team and the nursing students who are frequently placed on the ward&lt;/p&gt;\n&lt;p&gt;Commitment to undertake ongoing in-service training and development is essential. You should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our defined preceptorship programme. The ward seeks to provide a friendly environment in which all team members are supported. There is opportunity for further development within the fields of acute medicine and Gastroenterology through a variety of in-house training and University links.&lt;/p&gt;\n&lt;p&gt;If you are motivated to deliver high standards of care and have the personal qualities and characteristics as outlined in the Trust Values then this could be the post for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleRecruitment SisterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Victoria Drake - Ward Manager&lt;br /&gt;Telephone Number: 01253 953451&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Gastroenterology Ward 12", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230884", "validThrough": "2020-11-15T23:59:59+0000"}