{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-13T12:46:15+0100", "description": "&lt;p&gt;Cancer care at University Hospital Southampton NHS Foundation Trust (UHS) is expanding specialist and advanced treatments for cancer, and we’re looking for nurses with the drive and passion to take these forward. You‘ll need to have experience of working in an acute care setting and an understanding of current acute health service issues.&lt;/p&gt;\n&lt;p&gt;We’re looking for highly motivated and enthusiastic nurses with a genuine interest in cancer care, along with a commitment to continuous learning, teamwork and mutual support. If you have a strong focus on patient care and are able to work inter-professionally across boundaries and support junior colleagues in their development then we’re keen for you to join our team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR CARE GROUP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our care group cares for acutely unwell cancer patients, those having adverse side effects to treatment and palliative patients. All areas work with a wide multidisciplinary team including doctors, physiotherapists, and cancer nurse specialists to put patients’ specific needs at the heart of their care. We work closely with the research teams within the hospital and university to provide trials for cancer patients.&lt;/p&gt;\n&lt;p&gt;Undergoing cancer treatment is never going to be easy but we are working hard to make sure our patients and their families have the most positive experience possible with us as part of our Trust vision – patients first, working together, always improving.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The cancer care unit cares for patients from a wide geographical area ranging in age from 16 upwards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C3 CHEMOTHERAPY DAY UNIT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Provides ongoing care for oncology patients in a day unit setting, including outreach centres at Lymington Hospital and Countess Mountbatten House. You will be working with the wider multidisciplinary team in supporting patients throughout their cancer journey including new patients, patients receiving chemotherapy and/or radiotherapy, and routine follow-up patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C4 CLINICAL ONCOLOGY WARD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 23 bedded clinical oncology ward and offers a wide range of treatments including radiotherapy, iodine and high dose radiotherapy treatments, chemotherapy and diagnostic procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C7 HAEMATOLOGY AND TEENAGE AND YOUNG ADULT (TYA) DAYCASE UNIT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Patients attend for chemotherapy, immunotherapy, transfusions and other infusional therapies. C7 also includes the apheresis service that performs autologous and sibling stem cell harvests, plasma exchanges and extracorporeal photopheresis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 21 bedded ward that provides intensive chemotherapy to patients with haematological disorders. It is the regional bone marrow transplant service for this area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;D2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 20 bedded haematology ward delivering care to both malignant and non-malignant conditions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;D3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 22 bedded medical oncology ward. Takes both elective and emergency admissions and is involved in administering the majority of inpatient chemotherapy to a variety of tumour sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TEENAGE YOUNG ADULT (TYA) UNIT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A six bedded ward caring for cancer patients from the age of 16–24, treating both haematology and oncology patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer opportunities to enhance your skills and be part of a forward thinking and supportive multi professional team. Competency in intravenous therapy and chemotherapy administration is desirable but not essential. If you do not have these skills you will be offered training to support you to develop these skills.&lt;/p&gt;\n&lt;p&gt;You’ll receive an individualised induction programme when you first start to visit all the different areas within the department. In the future, we are hoping to develop a rotational programme.&lt;/p&gt;\n&lt;p&gt;Working within cancer care will provide you with an excellent opportunity to develop your clinical skills whilst enhancing your knowledge of oncology and haematology. You’ll be supported and encouraged to further develop your nursing career.&lt;/p&gt;\n&lt;p&gt;Cancer care has a highly motivated and supportive education team who drive staff development forward. There are opportunities to develop your knowledge in cancer care nursing by attending the Wessex Cancer Alliance chemotherapy course and the ‘Fundamentals of Cancer Care’ course, developed by our own education team.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working where the needs of the service allow and you’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / &lt;span&gt;informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Lisa Attrill&lt;/p&gt;\n&lt;p&gt;Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;lisaattrill@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381204488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff nurse - cancer care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224347", "validThrough": "2021-01-13T23:59:59+0000"}