{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum (pro-rata for part time)"}}, "datePosted": "2020-11-03T11:01:20+0000", "description": "&lt;p&gt;Are you an experienced qualified sports rehabilitation specialist looking for a new role?&lt;/p&gt;\n&lt;p&gt;Are you a good communicator with a positive and caring attitude?&lt;/p&gt;\n&lt;p&gt;If so, this could be the role for you.&lt;/p&gt;\n&lt;p&gt;DMS Whittington Lichfield are looking for a Band 5 Exercise Rehabilitation Instructor (ERI) to sustain and improve the training and operational effectiveness of injured Service personnel, accelerating their return to optimal physical capacity, whilst influencing their psychological and social health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be working within the Defence Medical Rehabilitation Programme (DMRP) to provide a high standard of exercise-based rehabilitation including highly specialist work in the musculo-skeletal/sports and training injury, meeting Standards for Better Health by using a multidisciplinary approach.&lt;/li&gt;\n&lt;li&gt;You will provide a positive caring environment, in which patients can expect a high-quality professional service.&lt;/li&gt;\n&lt;li&gt;Providing full support to the line manager in ensuring the provision of a comprehensive and professional rehabilitation service for entitled personnel. This will include undertaking highly skilled and specialist work, peer review and support to Junior/other ERI’s working within the Unit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Knowledge, Training and Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;BSc(Hons) Sports and Exercise Rehabilitation or Sports Therapy and must be a Full Graduate Member of BASRaT and be entitled to the title Graduate Sports Rehabilitator.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Joint Service Exercise Rehabilitation Instructor qualification (JSERI).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc(Hons) in Physiotherapy and be registered with the Health and Care Professions Council (HCPC).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and maintain your own personal, service and professional standards at the highest attainable levels. Professionally this includes the following:&lt;/li&gt;\n&lt;li&gt;To perform appropriate clinical assessments and to design and implement safe and progressive exercise treatment schedules for all patients after the MO/Physiotherapist/Clinical Team Manager (DMRC only) has made a diagnosis.&lt;/li&gt;\n&lt;li&gt;To communicate effectively with patients to ensure informed consent for treatment, good understanding of their conditions and maximise their rehabilitation potential.&lt;/li&gt;\n&lt;li&gt;You will keep a record of all specific treatments given and a record of individual patient’s progression/regression in respect of such treatments on Defence Medical Information Capability Programme (DMICP).&lt;/li&gt;\n&lt;li&gt;The ERI is to report any finding to the Medical Officer (MO)/Physiotherapist.&lt;/li&gt;\n&lt;li&gt;Ensure that high standards of confidentiality, recording, filing and storage of patient notes and statistical information are achieved and maintained in accordance with local policy.&lt;/li&gt;\n&lt;li&gt;Ensure attendance at specialist/review clinics, provide an update of each patient to the clinical lead for the patient/group and the provision of progress and other clinical reports, as directed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Personal Attributes&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clinical reasoning, assessment and treatment planning for patients referred to the Unit.&lt;/li&gt;\n&lt;li&gt;Good analytical skills and problem-solving ability.&lt;/li&gt;\n&lt;li&gt;Ability to work under pressure and to organise workload to ensure timelines are met.&lt;/li&gt;\n&lt;li&gt;Ability to communicate well, at all levels, verbally and in writing.&lt;/li&gt;\n&lt;li&gt;Ability to work well as a member of a multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;Be responsible for organising and planning own clinical workload and organising cover at times of staff shortage. Involves making short term adjustments to plans daily.&lt;/li&gt;\n&lt;li&gt;Identify the resources required for effective service delivery within the department and where appropriate contribute to business planning/ strategy.&lt;/li&gt;\n&lt;li&gt;Be a highly effective communicator demonstrating skills in negotiation, mediation, empathy, reassurance and the ability to motivate others.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;Access to Gym&lt;/li&gt;\n&lt;li&gt;Hairdresser, Barber&lt;/li&gt;\n&lt;li&gt;Costa Cafe&lt;/li&gt;\n&lt;li&gt;Convenience Store&lt;/li&gt;\n&lt;li&gt;On site canteen&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Key Skills Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB5 – Provision of Care&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK1 – Information Processing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DMS Whittington, Lichfield Staffordshire", "postalCode": "WS14 9PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6613", "longitude": "-1.77514"}}, "title": "Band 5 Exercise Rehabilitation Instructor (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253608", "validThrough": "2020-11-24T23:59:59+0000"}