{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907- £30,615 pro rata"}}, "datePosted": "2020-10-23T10:15:58+0100", "description": "&lt;p&gt;Calling all qualified band 5 nurses whom are hard-working, enthusiastic and have a thirst to learn new skills.&lt;br /&gt;&lt;br /&gt;The Pendleton Suite, Sub-Acute Care facility, is a brand new and exciting development under which sits within Integrated Care. It aims to focus on nurse led care for patients who are ready to go home. Our patient groups cover all specialities within the trust and require complex discharge planning. The unit allows nursing staff to develop a broad depth of discharge planning skills whilst working with the multidisciplinary team, We have close working relationships the therapy teams and patient pathway managers based on The Pendleton Suite.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At Salford Care Organisation we are committed to excellence, in both the services we provide our patients and the support we give our staff.&lt;br /&gt;&lt;br /&gt;That’s why we need you!&lt;br /&gt;&lt;br /&gt;* Care to make a difference?&lt;br /&gt;* Do you want to be part of this specialist unit?&lt;br /&gt;* Are you committed to delivering high quality patient care?&lt;br /&gt;* Do you enjoy working in a supportive and skilled team?&lt;br /&gt;* Want to expand your knowledge and skills in various backgrounds within a hospital setting?&lt;br /&gt;&lt;br /&gt;You will have a good knowledge base, excellent communication skills, be flexible and have a positive attitude. With appropriate experience in managing patients care from admission to discharge, a flexible approach and an ability to apply previous knowledge to differing situations.&lt;br /&gt;&lt;br /&gt;You will need to have knowledge of the potential discharge solutions available in the community.&lt;br /&gt;&lt;br /&gt;You will deliver excellent care to our clients as part of a large dynamic and developing team. This is an exciting time for The Pendleton Suite, we pride ourselves on providing high quality, safe, clean and personal care every time to our patients. The Pendleton Suite provides care and completes the patient journey providing services for 25 patients.&lt;br /&gt;&lt;br /&gt;Applicants with a passion for caring, non-judgmental and inclusive attitude who are committed to the delivery of safe, high quality excellent care to patients are welcomed.&lt;br /&gt;&lt;br /&gt;If you relate to the above qualities and are looking for a new challenge within a busy yet friendly environment, then we’d like to invite you to join our team and be a part of our journey to success.&lt;br /&gt;&lt;br /&gt;In return we offer great opportunities, support, education, laughter, leadership, growth and most importantly an innovative place to work where shared learning and quality care are key.&lt;br /&gt;&lt;br /&gt;We strongly recommend an informal chat and/or visit.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, sexual preference, disability, nationality, religion, marital status, social background or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Adrian Edwardson&lt;/p&gt;\n&lt;p&gt;0161 206 4133&lt;/p&gt;\n&lt;p&gt;adrian.edwardson@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Deborah Walker&lt;/p&gt;\n&lt;p&gt;0161 206 4216&lt;/p&gt;\n&lt;p&gt;Deborah.Walker@srft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Manchester", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Qualified Nurse - Pendleton Suite", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240000", "validThrough": "2020-11-08T23:59:59+0000"}