{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-23T16:01:24+0100", "description": "&lt;p&gt;There are exciting opportunities for enthusiastic Band 5 Nurse’s, to work in the North Locality (Rothbury, Northumberland). You will develop invaluable community experience which will enhance your professional practice. Northumbria Healthcare Community Services covers a large geographical area with an urban/rural mix. Opportunities are available for personal and professional development. You need to be a team player, but able to work autonomously with the ability to deliver high quality care to a diverse patient population. Excellent communication and interpersonal skills are necessary. Palliative care skills would be advantageous. In service training will be given. Must be able to meet the transport requirements Please note: adherence to ‘Working Time Directive’ essential.&lt;/p&gt;\n&lt;p&gt;Essential Requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;State Registration on Part 1 of the 3 part NMC register&lt;/li&gt;\n&lt;li&gt;Additional clinical qualifications or equivalent derived through experience would be advantageous but newly qualified nurse can also apply.&lt;/li&gt;\n&lt;li&gt;Registered Mentor / Equivalent. This can be completed within 18 months of starting in post.&lt;/li&gt;\n&lt;li&gt;Newly qualified staff will be required to undertake the Trust preceptorship programme within the first year in post.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post will be based with an individual team within the North Locality - Rothbury but the post holder may be required to work at other sites within the Trust.&lt;/p&gt;\n&lt;p&gt;The post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The post will be subject to a Disclosure and Barring Service (DBS) check. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Northumbria Healthcare NHS Foundation Trust is committed to ensuring a safe and high quality of patient care underpinned by our Trust values. It is expected that all employees demonstrate their commitment to these in their daily activity. In addition to this you may be asked ‘Values-based interview questions at interview.&lt;/p&gt;\n&lt;p&gt;All newly qualified staff, staff returning to practice after an extended break or staff working for the NHS for the first time, will be expected to undertake the Northumbria Healthcare NHS Foundation Trust Preceptorship Programme. This is a level 6 Accredited Work Based Learning Programme delivered in association with Northumbria University and full participation is mandatory.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Philomena Hollinghurst&lt;/p&gt;\n&lt;p&gt;Clinical Neighbourhood Matron&lt;/p&gt;\n&lt;p&gt;07786915718&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rothbury", "postalCode": "NE65 7RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.3066", "longitude": "-1.9141"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241212", "validThrough": "2020-11-09T23:59:59+0000"}