{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-29T14:06:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Operations Manager – Band 8b – Women and Children – 37.5 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced, passionate and highly motivated Senior Operations Manager to join our Trust within Women and Children’s Services supporting the Paediatric, Gynae and Maternity teams.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a key player in supporting the day to day operational management of your services and will be joining us at an exciting time where we are looking at further developments; pathways and indeed a new hospital build in the near future.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly visible and credible manager who possess strong leadership qualities in the development and provision of a comprehensive high quality, patient centred care service. They will need to be creative in your approach to problem solving and be responsive in your management style. Experience of managing challenged RTT pathways would also be an advantage.&lt;/p&gt;\n&lt;p&gt;The post holder will need to demonstrate a track record of strong interpersonal skills, be able to influence and motivate others with the ability to successfully guide people through complex change. Being able to think innovatively and to communicate effectively with a wide range of staff across departments is essential.&lt;/p&gt;\n&lt;p&gt;If you have the necessary skills, experience and qualities to help us to put patients first, please contact Michelle O’Donnell, Associate Director of Operations on 01284 713967, or email michelle.o’donnell@wsh.nhs.uk (for an informal discussion or to arrange a visit.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site. The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital. Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply. Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Senior Operations Manager - Band 8b- Women and Children", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248634", "validThrough": "2020-11-12T23:59:59+0000"}