{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36069", "unitText": "YEAR", "value": "£36,069 to £42,712 per annum inc HCAs"}}, "datePosted": "2020-11-04T09:30:40+0000", "description": "&lt;p&gt;&lt;strong&gt;CMH ACAD/ MAIN THEATRES NEEDS YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a self-motivated, forward thinking, flexible Band 5 Theatre Nurse with solid clinical skills and Operating Theatre Nursing Knowledge looking for Band 6 position?&lt;/strong&gt;We are looking for a friendly, enthusiastic and hard working person to work on our CMH Main Theatres. We have three theatres offering a wide range of specialities in acute and elective surgery.&lt;/p&gt;\n&lt;p&gt;The post holder will be a nurse holding either ENB 176/183 or equivalent. You will have proven experience in Orthopaedic surgery, General Surgery and Urology Surgery. A speciality interest in &lt;strong&gt;Orthopaedic Implant Surgery would be advantageous &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be able to monitor the use of equipment and resources, ensuring cost effectiveness. A teaching qualification is also essential.&lt;/p&gt;\n&lt;p&gt;Duties involve organising and prioritising your work load in theatre. You must excellent communicator as you will have excellent professional colleagues where results and positive achievements will be crucial. Exceptional personal and organisational attributes in this role. The ability to supervise and coach junior staff will also be necessary as will focus to delivering the service to our patients.&lt;/p&gt;\n&lt;p&gt;Post involves late duty.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to organise and oversee the day to day delivery of the orthopaedic service. The successful candidate will be expected to work clinically a lot of their working week. The selected candidate will be enthusiastic, motivated, and will be able to work within high pressured environments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Central Middlesex Hospital Operating is located in the new building with 3 modern theatre suites for major elective orthopaedic, , general, and Urology and trauma surgery. The well-equipped recovery room consists of 5 bays providing immediate post-operative and high dependency care mainly for in patients.&lt;/p&gt;\n&lt;p&gt;ACAD Operating Theatres department is in housed within ACAD ( Ambulatory Care and Diagnostics) ACAD center comprises six operating theatres, supporting Generaland Breast Surgery, Urology, OMFS, ENT and Ophthalmology surgery and 16 bed offering 24 hours care Monday to Friday.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rose Amankwaah on 020 8963 8872 or Sister Jayanthy John on 020 8453 2075&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central Middlesex Hospital, London", "postalCode": "NW10 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5316", "longitude": "-.269746"}}, "title": "Perioperative Senior Staff Nurse Theatres/ SODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255192", "validThrough": "2020-11-18T23:59:59+0000"}