{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-11-06T11:47:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Patient Safety Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you highly motivated registered healthcare professional passionate about patient safety?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Patient Safety Manager to work in our newly established Patient Safety Directorate. This will be a key role in helping us implement the NHS Patient Safety Strategy as well as supporting us to continuously learn and improve safety within the Trust on a day to day basis.&lt;/p&gt;\n&lt;p&gt;As the Patient Safety Manager you will manage the Trust Corporate Patient Safety Team to work with staff of all grades across the Trust to actively promote, develop and secure a patient safety culture.&lt;/p&gt;\n&lt;p&gt;We are looking for a committed and confident individual with excellent communication skills, who will be responsible for co-ordinating compliance with serious incident investigations, duty of candour and other areas of patient safety, to ensure the Trust achieves sound learning for improvement and compliance. In turn, you will need to be able to work with minimum supervision, have good experience and knowledge of Patient Safety processes including the National Serious Incident Framework.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on our journey of continuous Quality Improvement and actively support members of the Trust to participate in our (Quality, Service Improvement &amp; Redesign (QSIR) Programme.&lt;/p&gt;\n&lt;p&gt;We are passionate about promoting good mental health and wellbeing. We strive to use the expertise and resources within our organisation, and through our partnerships, to deliver high quality services that are safe and focused on people&#39;s recovery. Our staff are pivotal in everything we do and we are committed to involving them fully in the development of the Trust and our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Please note due to high volume of applications for some posts, this post may close before the displayed closing date. We recommend that you apply for this role as soon as possible***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;David Barron - Head of Patient Safety and Clinical Effectiveness&lt;/p&gt;\n&lt;p&gt;Email address: david.barron@qehkl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01553 613758&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital NHS FT, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Patient Safety Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259507", "validThrough": "2020-11-20T23:59:59+0000"}