{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 pa plus HCAS"}}, "datePosted": "2020-11-04T15:30:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Psychiatric Nurse &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;We will consider applications from band 5 as a development post &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a fun dynamic, supportive team with a good reputation of high quality delivery of care/standards due of our team ethos and approach to working.&lt;/p&gt;\n&lt;p&gt;We are a recovery support team and provide support in the community to people with severe and enduring mental illness.&lt;/p&gt;\n&lt;p&gt;We are a multi disciplinary team which consists of nurses, Dr’s and Recovery and support workers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To undertake the role of care co-ordinator in the assessment, development and delivery of package of care to people suffering from severe and enduring mental illness. Working as part of the multi disciplinary team you will work with individuals and their families or carers providing support, education, family work and evidence based interventions aimed towards promoting recovery. You will work with people aged 18 and upwards in a service which aims to work with other agencies including primary care to raise awareness of mental health and to reduce the length of time people remain untreated.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To supervise, instruct and teach junior and unqualified staff and students&lt;/li&gt;\n&lt;li&gt;To undertake duties designed to extend clinical and managerial expertise as delegated by the manager when required.&lt;/li&gt;\n&lt;li&gt;To provide a full care management service to clients and their carers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We based in the bustling Wallington high street in Sutton, which is a lovely suburb with lots of green spaces and great places to eat and relax. Wallington has great transport links excellent amenities and parking.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee Health Centre East, Wallington", "postalCode": "SM6 0EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3574", "longitude": "-.150294"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256437", "validThrough": "2020-11-11T23:59:59+0000"}