{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-26T16:30:40+0000", "description": "&lt;p&gt;We have an exciting opportunity for the right people to help implement a new lower limb pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, team players who are not scared of a new challenge and have knowledge and skills in the management of lower limb disease.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This job will be rewarding for an efficient, well-motivated and enthusiastic team member. You will join the lower limb team providing a wide range of nursing care and clinical interventions to patients who have sign and symptoms of lower limb disease across North East Essex. Preventing this condition from getting worse and improve quality of life. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will involve providing a wide range of practical care duties including wound dressings and compression bandaging under the guidance of the senior leg ulcer nurse. &lt;/p&gt;\n&lt;p&gt;You will participate in the delivery of complex care supported by a wide range of clinical competencies to carry out the delegated treatment required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will require close working with patients and carers to promote health, self-management and prevent hospital admissions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate must have evidence of experience working within a health care setting managing lower limb disease, dealing with members of the public and adults with health needs, being able to undertake a wide range of clinical observations and wound care procedures.   Excellent communication and organisational skills along with experience of previous team work and an ability to work using your own initiative are essential.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A positive ‘can do’ attitude is essential along with the ability to demonstrate leadership, interpersonal and communication skills. Also you will be required to demonstrate efficient ways of working to manage lower limb disease.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post requires flexibility to be able to cover 7 days a week.  Shifts are worked to cover a 24 hour service (as and when required). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A full UK driving licence and access to a vehicle is essential in order to travel to clinics.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have the knowledge, experience and passion to improve the management of lower limb disease we would like to hear from you. This role could be right for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested and would like to know more about the post please contact &lt;/p&gt;\n&lt;p&gt;Louise Bolton on 07983544451 (louise.pingram@acecic.nhs.uk)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions,    cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;ACE is commissioned to provide a number of services including Community based health services (Care Closer to Home). We have been advised by North East Essex Clinical Commissioning Group that this contract will be provided by another organisation after 30&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; June 2021. This is not as a reflection of ACE but due to the Commissioner wanting to make changes to the way the service is delivered. At the present time we don’t know who the new provider will be but the CCG is working to determine this by the end of 2020. This change does not affect our ability to recruit and should you be employed at the end of June 2021 you will transfer to the new provider on the same terms and conditions  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working for ACE puts you right at the heart of all North Essex has to offer. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within Tendring you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK!  Within a stone’s throw of Tendring is Colchester – Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after locations. In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester/Tendring", "postalCode": "CO15 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8041", "longitude": "1.16672"}}, "title": "Tissue Viability Associate Practitioner, Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243414", "validThrough": "2020-11-09T23:59:59+0000"}