{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-28T09:46:50+0000", "description": "&lt;p&gt;An Exciting opportunity has arisen for an experienced and committed Clinical Psychologist within the Learning Disability Team within Warrington Borough to support the development of our Enhanced Intensive Support (EIS) function of our team .&lt;/p&gt;\n&lt;p&gt;This is a fixed term post or secondment until 31st March 2021 due to short term funding.&lt;/p&gt;\n&lt;p&gt;If you are applying for this as a secondment please ensure you have your current managers approval prior to applying.&lt;/p&gt;\n&lt;p&gt;The post holder will support the teams Principle Psychologist to provide strategic and clinical leadership for the delivery of the EIS function within our team.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with the clinical skills to work with service users with a learning Disability, providing assessment, formulation and therapeutic interventions to people with a learning Disability, with complex presentations, including people with behaviours of concern, autism and forensic difficulties and to their support systems. , both individually and in group format and to support the work of colleagues.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join with the teams principle Psychologist and assistant psychologist and work as part of the wider disciplinary MDT which include Nurses, Physiotherapist, Occupational Therapist, Speech and Language Therapists and a consultant Psychiatrist&lt;/p&gt;\n&lt;p&gt;We are looking for an confident individual who will be able to manage referrals and hold a caseload. The role will include working with adults with complex physical health needs, complex behaviour&#39;s utilising Positive Behavioural support and/or mental health needs alongside their learning disability. The post also involves enabling and supporting people with learning disabilities to access mainstream services. Experience of working within Learning Disabilities services is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;The post holder will also demonstrate an attitude which respects and values service users’ choice and works alongside them and their carers to ensure they are at the Centre of care planning.&lt;/p&gt;\n&lt;p&gt;We are also committed to supporting personal and professional development and you will be offered a yearly Personal development review and planning work objectives&lt;/p&gt;\n&lt;p&gt;Our core operational hours are between 9am – 5pm Monday to Friday. Applicants must be able to be flexible with their working patterns to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Boswell - Clinical lead/Strategic Health Facilitator (RNLD)&lt;/p&gt;\n&lt;p&gt;Rachel.Boswell@nwbh.nhs.uk / 01744 457 278&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hollins Park, Warrington", "postalCode": "WA2 8WA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4284", "longitude": "-2.60844"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245889", "validThrough": "2020-11-16T23:59:59+0000"}