{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-20T15:46:54+0100", "description": "&lt;p&gt;&lt;strong&gt;We are pleased to offer an exciting career opportunity for either an experienced Band 5 Physiotherapist, looking for a Band 6 post or an existing Band 6 physiotherapist who is looking to specialise in the Community setting, to join the King’s Lynn and Coastal therapy team within West Norfolk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a dynamic, forward- thinking team, with a strong focus on supporting patients to remain as independent as possible within their own homes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our caseloads are varied, offering patient-centered therapy with the focus on assisting patients to building on their current strengths and abilities, using a health coaching model approach.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We assess and treat general rehabilitation patients discharged from hospital or who have had a recent decline, to assist them to regain maximal functional ability. The team provides falls management interventions, assessment of frailty patients, health promotion and prevention, supporting palliative patients and preventing admission to hospital. Therapy is home based and we do support people whose home is within a care home environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Yoou would be responsible for supporting Band 5 and Band 4 Staff within the team. They themselves would be provided with supervision by the Physiotherapy Clinical Lead. We actively encourage staff to take physiotherapy students from the nearby university.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our team consists of 3 OT’s, another Band 6 physiotherapist, 7 Band 4 Community Assistant Practitioners and the Band 7 Clinical Lead Physiotherapist. The therapy team are part of the integrated King’s Lynn and Coastal PCN team supported by nurses, matrons and the teams Clinical Operations Manager. We have strong links with secondary care, social care and specialist services within the area.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan MorvanJob titleClinical Operations ManagerEmail addresssusan.morvan@nchc.nhs.ukTelephone number07495 649815Additional contact information&lt;/p&gt;\n&lt;p&gt;Cath Metcalfe - Clinical Lead - Physiotherapist, 07771 555032, Catherine.Metcalfe@nchc.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James Clinic, Kings Lynn", "postalCode": "PE30 5NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7492", "longitude": ".410179"}}, "title": "Community Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235121", "validThrough": "2020-11-08T23:59:59+0000"}