{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Agenda for change"}}, "datePosted": "2020-10-01T12:47:26+0100", "description": "&lt;p&gt;&lt;strong&gt;Candidate Highlights :- Band 6 Physiotherapist (Community)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HCPC Registration | B. Sc Physiotherapy |Location :- Hertfordshire |&lt;/p&gt;\n&lt;p&gt;It is a requirement to have a valid, full UK driving licence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Characteristics/Skills needed :-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Physically fit |Good listeners |Able to motivate people |Calm and understanding |Able to follow procedures |Able to use gym equipment |Willing to demonstrate exercises |Willing to work alone or in a team |Happy to be hands-on with patients |Happy to talk to and work with groups.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB PURPOSE SUMMARY:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To deliver a complex package of high quality healthcare including assessment, diagnosis, treatment and advice to patients with various needs – including orthopaedics, care of the elderly, neurology. To provide expert advice, guidance and information to health and social care professionals, carers, and relatives. To deputise for the Lead Therapist as necessary.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MAIN DUTIES and RESPONSIBILITIES:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Patient / Customer Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be professionally and legally responsible and accountable for, all aspects of your own work. To ensure a high standard of clinical care for the patients under your management&lt;br /&gt;&lt;br /&gt;To be actively involved in patient discharge planning&lt;br /&gt;&lt;br /&gt;To assess and manage clinical risk within own patient caseload.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Management and Leadership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be responsible for the safe and competent use of all equipment, appliances and aids used. To ensure all equipment is safe for its purpose prior to use.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Communication and Relationship Building&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To communicate complex patient related information effectively and appropriately with other members of the multi-professional team about patient issues in order to facilitate a team approach to patient care.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Information Management&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To collect data and statistics as directed.&lt;br /&gt;&lt;br /&gt;To participate in the evaluation of clinical and current practices through audit and critical appraisal&lt;br /&gt;&lt;br /&gt;To ensure a good working knowledge of national and local standards and monitor quality as appropriate.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;General&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To maintain own clinical professional development (CPD) by maintaining and developing current knowledge of evidence based practice. To maintain a portfolio which demonstrates personal development and shows evidence of reflective practice. To develop and enhance skills and incorporate them as necessary into every day practice&lt;br /&gt;&lt;br /&gt;It is essential that the post holder is a car owner/driver&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EFFORT, PHYSICAL SKILLS and WORKING CONDITIONS:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Physical skills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Car driver Skilled therapeutic handling of people&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Physical effort&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Manual handling of patients and equipment - frequent short periods Therapeutic handling of people - frequent short periods Working on the floor - frequent short periods Working in inadequate space e.g. side room - frequent short periods&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental effort&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Writing detailed reports to outside agencies - occasionally Interruptions to work, expectations to respond quickly to problems arising - frequently Flexibility to cover other areas in incidences of staff shortages - occasionally.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emotional effort&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dealing with aggressive/ challenging behaviour - occasionally Dealing with death / bereavement - regularly Long term relationships with patients and families - daily Dealing with patients with serious illnesses which are potentially life limiting and/or life threatening - regularly&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working conditions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dealing with body fluids e.g. saliva, sputum, urine and unpleasant body odours - daily Working in potentially infectious environment. Taking responsibility for our own role in infection control both for our own protection and the protection of the patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Supplementary Information:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Equality and Diversity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is committed to eliminate racism, sexism and forms of discrimination. The Trust will not discriminate on grounds of age, colour, disability, ethnic origin, gender, gender reassignment, culture, health status, marital status, social or economic status, nationality or national origins, race, religious beliefs, or non beliefs, responsibility for dependants, sexuality, trade union membership or hours of work.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Mobility / Flexibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The normal place of work for the post is as stated above, but as a term of employment post holders may be required to work from any of the Trust&#39;s establishments.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Health and Safety at Work&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In accordance with the Management of Health and Safety at Work Regulations 1992 (as amended) and other relevant Health and Safety legislation, staff have a duty to take responsible care to avoid injury to themselves and others by their work activities and to co-operate in meeting statutory requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Infection Control&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employees must be aware that preventing healthcare acquired infections and infection control is the responsibility of all staff. Clinical procedures should be carried out in a safe manner by following best practice and infection control policies.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Data Protection and Confidentiality&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employees must maintain confidentiality when dealing with sensitive material and information and be aware of the Caldicott principles, the Data Protection Act 1998 and the Human Rights Act 1998. The protection of data about individuals is a requirement of the law and if any employee is found to have permitted unauthorised disclosure, the Trust and individual may be prosecuted. Disciplinary action will be taken for any breach.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;No Smoking Policy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust operates a smoke free policy which means that smoking is not allowed anywhere on Trust sites including buildings, car parks and entrances.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Safeguarding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The above duties and responsibilities are intended to represent current priorities and are not meant to be an exhaustive list. The post holder may from time to time be asked to undertake other duties and responsibilities commensurate with the grade. Any changes to this job description to take account of changing service needs will be made in discussion with the post holder.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire", "postalCode": "HP2 4TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7556", "longitude": "-.425633"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916208554", "validThrough": "2020-12-31T23:59:59+0000"}