{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-06T11:24:11+0000", "description": "&lt;p&gt;Whether your background is in pharmaceutical manufacturing or any other medical quality management or auditing field; few organisations offer the impact of NHS Blood and Transplant. You’ll work with teams the length and breadth of the country to implement ever-improving best practices. In doing so, making sure our cutting edge Advanced Therapy Medicinal Products are as safe as possible.&lt;/p&gt;\n&lt;p&gt;As you’d expect, our quality management and compliance systems are crucial to our success. You’ll be their champion: keeping licenses up to date, helping teams follow guidelines, recording and reporting on evidence, and managing audits. Anything and everything that keeps us working in the most efficient and safest way.&lt;/p&gt;\n&lt;p&gt;There’ll be some time behind a desk; but this is really a people-centric role. We’ll expect you to meet teams, government agencies and regulators, develop tailored solutions and respond to any incidents.&lt;/p&gt;\n&lt;p&gt;A background in pharmaceutical or medical quality management would be advantageous and, ideally, a relevant post-graduate qualification (or equivalent). It’s important you’re also a consummate professional who can build strong relationships and ask the right questions while keeping an objective view of the work.&lt;/p&gt;\n&lt;p&gt;This advert will close at midnight on Sunday 22nd November&lt;/p&gt;\n&lt;p&gt;The interview date for this position will be week commencing W/c 30 November 2020&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact tracey.miller@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Take charge of your career and apply now.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2SG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4528", "longitude": "-1.93523"}}, "title": "Assistant Quality Assurance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259405", "validThrough": "2020-11-22T23:59:59+0000"}