{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142 per annum"}}, "datePosted": "2020-11-03T16:00:39+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the Home Enteral Feeding team based within the Dietetic Department at the City Hospital . The Home Enteral feeding team consists of 20 dietitians , dietetic assistants , nurses and a home enteral feeding coordinator to deliver an essential service to patients in a variety of community settings who require nutritional support via feeding tubes and devices. The service covers both adult and paediatric patients.&lt;/p&gt;\n&lt;p&gt;As the Team Administrator your role will be to ensure that a comprehensive administrative service is available within the HEF team. You will be required to undertake routine and ad-hoc administration tasks in line with the needs of the service. You will need to work both with team colleagues and be able to work autonomously, you will be required to prioritise your own workload and work within a diverse, dedicated team. This will require an often reactionary approach along with the ability to identify and make suggestions for improvement and the willingness to implement new ideas to enable efficient ways of working across the team.&lt;/p&gt;\n&lt;p&gt;You will require strong communication skills as this role entails liaising with a wide range of individuals including patients, members of the public, managers, and clinical staff.&lt;/p&gt;\n&lt;p&gt;This post will require you to work in an office environment whereby members of the team will work on a rotational basis in the office and remotely .&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a person with good ICT skills, sound communication skills - both written and verbal with the ability to be self-motivated and organised along with possessing a methodical approach.&lt;/p&gt;\n&lt;p&gt;Previous NHS experience and qualifications in nutrition or healthcare would be an advantage and a desire to develop skills and experience to support excellent patient care.&lt;/p&gt;\n&lt;p&gt;We are committed to continuing professional development for all our staff through a range of opportunities that include recognised training courses, involvement in service development and audit. We have close links with the University of Nottingham, and take student dietitians for A, B and C placements.&lt;/p&gt;\n&lt;p&gt;Nottingham is a friendly city with excellent leisure facilities, shops and beautiful countryside within easy reach. It has first rate transport links with its close proximity to East Midlands Airport and train services, and a tram link directly to the hospital.&lt;/p&gt;\n&lt;p&gt;For further information please contact Zoe Mark or Hannah Meanwell on 01115 9691169 ect 74008&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHannah MeanwellJob titleTeam Leader HEFEmail addresshannah.meanwell@nuh.nhs.ukTelephone number0115 9691169ext 74008Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Zoe Mark ext 74008&lt;/p&gt;\n&lt;p&gt;Hannah Meanwell ext 74008&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "HEFT Administrator Dietetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254700", "validThrough": "2020-11-17T23:59:59+0000"}