{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa, based on full time hours"}}, "datePosted": "2020-11-02T11:30:20+0000", "description": "&lt;p&gt;Right now is an exciting time to join our CAMHS service as it continues to expand! Leigh House is an acute adolescent psychiatric service, providing both residential and day care for up to 21 young people aged between 12 and 18. Set in its own grounds, Leigh House is an award winning purpose built hospital which provides a comprehensive treatment program for young people experiencing acute mental illness, such as depression and psychotic disorders. Leigh House also has particular expertise in the management of young people suffering from anorexia nervosa.&lt;/p&gt;\n&lt;p&gt;As a staff nurse you will be a vital part of our multi-disciplined team helping us to deliver high standards of care to the young people we care for. Your day will be very varied and include supporting our young people through completion of nursing assessments, evaluation of care, contributing to ward reviews, training and development of junior staff and ensuring a high standard of nursing care is maintained through supervision. This post is also available to newly qualified staff and you will be offered a comprehensive preceptorship when you come to join us&lt;/p&gt;\n&lt;p&gt;Our staff say: &lt;em&gt;“The team are so supportive and everyone is listened to, it’s a fun and lovely place to work.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We would love for you to come and see just how special Leigh House is. You can make an appointment by contacting &lt;strong&gt;Charlotte Miller, Clinical Ward Manager on 02382 310 100&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***********£2,500 ‘Golden Hello’ Payment***********&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Awarded with this vacany!&lt;/p&gt;\n&lt;p&gt;Apply now and, if you are successfully recruited, you will receive £2,500&lt;strong&gt; – Does not apply to current HIOW NHS Staff&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO21 1HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0624", "longitude": "-1.28354"}}, "title": "Mental Health Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251780", "validThrough": "2020-11-16T23:59:59+0000"}