{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-27T16:31:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an innovative and proactive individual who would like to make a real difference in battling the impact of COVID 19 by improving patient care and safety? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting and challenging opportunity has arisen for two Safety Practitioners to join the safety team in Somerset Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The disruption brought about by COVID 19 has brought new safety challenges and these roles will be tasked to address these using innovate ideas and quality improvement.&lt;/p&gt;\n&lt;p&gt;Based (in the first instance) in the acute trust, Musgrove Park hospital, these two roles will work as part of a wider safety team supporting ward staff to ensure the highest level of patient safety.&lt;/p&gt;\n&lt;p&gt;Within the role you will work in the ward environments alongside the ward team. You will work on a number of projects with the ward staff to directly improve patient care. In delivering these projects you will be directly involved in delivering the trusts safety agenda and influencing its future direction.&lt;/p&gt;\n&lt;p&gt;These posts will be very well supported by a multidisciplinary team and there will be plenty of opportunity for learning new skills and development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Musgrove Park Hospital is in the heart of beautiful Somerset. Here, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for enthusiastic candidates who has experience of adult inpatient care.&lt;/li&gt;\n&lt;li&gt;We are also looking for individuals with strong clinical skills and experience with exceptional communication skills.&lt;/li&gt;\n&lt;li&gt;An understanding of QI and safety methodologies would be desirable but full training and comprehensive support will be provided.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If the sound of this excites and interests you then we would love to hear from you! We welcome informal calls if you would like to know more about this great opportunity …&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Pippa Richards, Patient Safety Lead Nurse&lt;/p&gt;\n&lt;p&gt;pippa.richards@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;07775 037013&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Safety Practitioner, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245431", "validThrough": "2020-11-08T23:59:59+0000"}