{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-06T11:00:24+0000", "description": "&lt;p&gt;NHS continuing healthcare (CHC) means a package of ongoing care that is arranged and funded solely by the NHS where the individual has been found to have a ‘Primary Health Need’ as set out in the ‘National Framework for NHS Continuing Healthcare and NHS-Funded Nursing Care’. We are proud of our CHC team who are committed to being the best and delivering the highest quality CHC service to the people of Barnsley in line with best practice. Band 6 CHC nurse will work as part of the team as well as autonomously ensuring that they meet the main job responsibilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• Facilitating Continuing Healthcare/Funded Nursing Care assessments and reviews for patients across all aspects of care this includes appeals and retrospective assessments. This necessitates a high level of assessment skills and requiring tact, diplomacy and the ability to liaise effectively with colleagues, health care professionals, patients&#39; carers and family members. The post holder will require Registered Nurse qualification.&lt;/p&gt;\n&lt;p&gt;• The timely review of all Continuing Healthcare/Funded Nursing Care patients functioning as a central point for referral, assessment and support. This will contribute to the maintenance of the appropriate level of funding support, the accuracy of the Continuing Healthcare client database and the commissioning of appropriate continuing healthcare funded packages of care to meet the identified care needs of individual patients deemed eligible for support&lt;/p&gt;\n&lt;p&gt;• Undertake complex and detailed information analysis of specific records requiring high levels of concentration&lt;/p&gt;\n&lt;p&gt;• Facilitating smooth patient flow across all aspects of the patient’s journey including liaison with primary care, secondary care, community venues and specialist services.&lt;/p&gt;\n&lt;p&gt;• Update, maintain, organise, gather and analyse information to predict/meet future organisational and team needs by identifying best professional practice.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Barnsley Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128235"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S75 2PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5592", "longitude": "-1.49744"}}, "title": "CHC Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259318", "validThrough": "2020-11-20T23:59:59+0000"}