{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-21T14:32:09+0100", "description": "&lt;p&gt;Would you like to work in a dynamic, friendly palliative care team as a Consultant in Palliative Medicine with a focus on community palliative care? These are new posts developed to support patients at home as part of a wider specialist palliative care offer. The specialist palliative care community nursing services at LOROS and Leicestershire Partnership NHS Trust are currently aligning and this is an exciting opportunity to influence and support this development.&lt;/p&gt;\n&lt;p&gt;There are two posts (14 PAs between them), one also leading on post-graduate education at LOROS, the other supporting the development and delivery of undergraduate medical training. There are opportunities to be trained in and involved in simulation and communication skills training. LOROS has excellent education facilities in its Professional Development Centre and is the University of Leicester affiliated Hospice.&lt;/p&gt;\n&lt;p&gt;The posts will be based at LOROS Hospice and post-holders will undertake outpatient clinics, home visits and support community staff.&lt;/p&gt;\n&lt;p&gt;The Palliative Medicine Department extends across UHL and LOROS, and is keen to support education, research and development and will support the appointee to take part in such activities.&lt;/p&gt;\n&lt;p&gt;The LOROS strategic plan includes increasing access to specialist palliative care for patients in the community and there will be the opportunity to be involved in service development.&lt;/p&gt;\n&lt;p&gt;UHL has strategic objectives which include building a world class reputation in research, education and training relevant to the diverse population in Leicester, delivering an excellent patient experience and ensuring UHL is fit for purpose.&lt;/p&gt;\n&lt;p&gt;As one of the very largest NHS Trusts in the country, our contribution to our communities goes way beyond direct health; we are the largest employer in our region, we educate and train the staff of the future, we push research boundaries and with our £1bn turnover we are an economic engine for the wider East Midlands and beyond.&lt;/p&gt;\n&lt;p&gt;This is particularly exciting time for Leicester’s Hospitals. We have been given £450m by the Government to provide a host of new facilities and reconfigure services between our three main sites. Flagship projects include a new Children’s Hospital, a new Maternity Hospital, a new Treatment Centre and two new Intensive Care Units. Equally importantly, we are going “paperless”, with a £12m investment in our NerveCentre computer system to help our team deliver world class care.&lt;/p&gt;\n&lt;p&gt;We want to continue to improve everything that we do, so that we can achieve our Vision: Caring at its best for every patient, every time. Our Quality Strategy, &lt;strong&gt;“Becoming the Best”,&lt;/strong&gt; describes how we are doing that in a determined, targeted and systematic way, with our staff the champions of change and our patients not just beneficiaries but partners.&lt;/p&gt;\n&lt;p&gt;In becoming part of our team you too can show your commitment to the delivery of high quality services to patients with our Trust values.&lt;/p&gt;\n&lt;p&gt;As this post is regulated by the Protection of Children Act 1999, The Criminal Justice Courts Act 2000 and / or the Care Standards Act 2000 an enhanced police criminal records disclosure will be requested by the Trust in the event of a successful application.&lt;/p&gt;\n&lt;p&gt;We are looking to interview week commencing the 7th of December 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you wish to discuss these posts or arrange a visit please contact:&lt;/p&gt;\n&lt;p&gt;Dr Luke Feathers, LOROS Medical Lead, on Tel (0116) 231 8437&lt;/p&gt;\n&lt;p&gt;Dr Barbara Powell, LOROS Undergraduate Training Lead&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Rosie Bronnert, Head of Service, 0116 256 3540.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LRI, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Consultant in Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236879", "validThrough": "2020-11-18T23:59:59+0000"}