{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38890 - £44503"}}, "datePosted": "2020-10-19T08:18:03+0100", "description": "&lt;p&gt;&lt;strong&gt;About the opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role of our organisation is to contract a wide range of health care services which fulfil the varying needs of those in our community.&lt;/p&gt;\n&lt;p&gt;NHS Kernow Clinical Commissioning Group (CCG) is looking to recruit a Band 7 Infection, Prevention, Control (IPC) Nurse to join the IPC team, which is part of the wider Nursing and Quality directorate.&lt;/p&gt;\n&lt;p&gt;If you are a registered healthcare practitioner with experience or a qualification in infection, prevention and control, who is looking to use their knowledge and skills across the whole range of health and social care settings, then look no further than this opportunity to work across the stunning coastal county of Cornwall.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your role will include surveillance, monitoring and investigation of alert organisms. You will conduct, support, and collate audits of IPC practice in addition to providing advice support and education to health and social care providers including GPs and Care Homes. You will require excellent organisational and communication skills to enable you to work collaboratively with primary, community and secondary care providers.&lt;/p&gt;\n&lt;p&gt;This post is based in St Austell although staff are currently working from home due to the pandemic. However, elements of the role may require you to travel to other locations across the county of Cornwall to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;This is a full-time, fixed term post at present with some flexibility around hours. Job Share and Secondment opportunities will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate is likely to have completed, or is currently studying for, an IPC qualification, or have a good level experience of IPC, gained in a specialist role.&lt;/p&gt;\n&lt;p&gt;The post requires travel to different sites and it is essential that the successful candidates have the ability to commute between locations.&lt;/p&gt;\n&lt;p&gt;You will have excellent organisational skills and a working knowledge of MS office packages such as Word, Excel, Outlook, Excel etc., alongside excellent communication skills both written, face-to-face and over the telephone.&lt;/p&gt;\n&lt;p&gt;You will be an ambassador for NHS Kernow, promoting the importance of improving people’s health and wellbeing, and making sure services are safe and effective, and delivered in ways that improve people’s experiences and outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the NHS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return you will be part of a system that is pioneering change in the Health Service, and alongside every team member, you will help us to achieve our goals.&lt;/p&gt;\n&lt;p&gt;You can look forward to excellent benefits including discounts in store and online, optional pension and life assurance, flexible working options, salary sacrifice vehicles/ cycles/ child care vouchers, two days pro rata to undertake volunteering, coaching and mentoring opportunities, as well as fantastic opportunities to develop your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date&lt;/strong&gt;: 12th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date&lt;/strong&gt;: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For more information, or to request support with the recruitment process, please contact Lisa Johnson, Head of Public Health Nursing, 07789922033, lisa.johnson23@nhs.net&lt;/p&gt;\n&lt;p&gt;NHS Kernow is an equal opportunities employer. This means we are committed not to discriminate against any employee or job applicant because of any protected characteristic.&lt;/p&gt;\n&lt;p&gt;We believe in a workplace which is truly equal and strive to make this the most fair and equitable workplace for all. NHS Kernow values diversity and promotes equality. We welcome applications from people who identify as lesbian, gay, bisexual and/or trans/transgender (LGBT+).&lt;/p&gt;\n&lt;p&gt;We are a Disability Confident employer; committed to recruiting and retaining people with disabilities. There is a guaranteed interview scheme (GIS) for candidates with disabilities who meet the minimum selection criteria; subject to volume of applicants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa JohnsonJob titleHead of Public Health NursingEmail addresslisa.johnson23@nhs.netTelephone number07789922033&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128400.jpg", "name": "Kernow Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Usually St Austell curently home based due to pandemic., St Austell", "postalCode": "PL25 5AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3397", "longitude": "-4.79474"}}, "title": "Infection Prevention and Control Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231527", "validThrough": "2020-11-12T23:59:59+0000"}