{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 Incl Fringe HCAS"}}, "datePosted": "2020-10-30T12:11:01+0000", "description": "&lt;p&gt;Due to promotion, we are seeking a Mental Health Nurse, Social Worker or Occupational Therapist to join the CAMHS Community Crisis Team in the NorthWest Surrey Area (Chertsey). This post is for 37.5 hours per week but consideration would be given to candidates who are able to work 22.5 hours + per week.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing assessments and interventions for children and young people who are in mental health crisis.&lt;/p&gt;\n&lt;p&gt;We have expanded our offer to include group work to help young people following their presentation in crisis in the area of deliberate self harm - DBT skills training is available to facilitate this group.&lt;/p&gt;\n&lt;p&gt;The key function of the role is to work in the team providing a 7 day week crisis intervention service, which offers assessments to children, young people and their families presenting in crisis in both local A&amp;E departments, Paediatric wards and Community CAMHS Bases. Our operational hours are 9am – 5pm Monday – Sunday inc Bank Holidays. There is one late shift to 8pm once every 2 weeks. Our rota system allows for flexibility in working however unsocial and weekend shifts will be expected.&lt;/p&gt;\n&lt;p&gt;The successful candidate will hold an appropriate professional registration with NMC or HCPC. Experience and competence in working with vulnerable people in crisis is essential. Experience of working with children and young people is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;These posts offer a structured career progression with recognised training packages: including modules in Crisis intervention with young people, DBT skills.and the opportunity to join the national CYPIAPT programme.&lt;/p&gt;\n&lt;p&gt;There has never been a better time to join our developing and dynamic Crisis Intervention service; set within our friendly and supportive teams we encourage enthusiastic applicants to apply&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey", "postalCode": "KT16 9FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3897", "longitude": "-.507488"}}, "title": "Crisis Intervention Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250100", "validThrough": "2020-11-22T23:59:59+0000"}