{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T10:46:31+0000", "description": "&lt;p&gt;Applications are invited for a full-time (10 PA) locum Consultant in Neonatal Medicine at the Luton and Dunstable University Hospital. Since April 2020 we have been part of the Bedfordshire Hospitals NHS Foundation Trust with 2 sites, one in Bedford which has a Special Care Unit and the Luton and Dunstable site which has a Neonatal Intensive Care Unit.&lt;/p&gt;\n&lt;p&gt;The post is based entirely at the Luton and Dunstable site and is available from November 2020 and is for a period of 6 months with the potential to extend.. The successful applicant will join an enthusiastic, innovative and friendly team of Neonatal consultants delivering family centred, safe and high quality clinical services leading to excellent outcomes in a busy tertiary Neonatal Intensive Care Unit. The Neonatal Intensive Care Unit at the Luton and Dunstable Hospital is the Lead unit for Bedfordshire and Hertfordshire and one of 3 tertiary Neonatal Intensive Care Units in the East of England Neonatal Operational Delivery Network accepting in-utero and ex-utero transfers from a wide geographical area. We have close links with the rest of the Network including the other two NICU’s. We currently have 19 ITU/HDU cots and a total of 37 cots. A new expanded Neonatal Unit is planned to open on the Luton and Dunstable Hospital site in 2024.&lt;/p&gt;\n&lt;p&gt;We have a team of 12.75 WTE Consultants in Neonatal Medicine providing a mixture of resident and non-resident out of hours cover. The successful candidate will join the rest of the consultant team in rotating through a rolling rota of attending weeks covering the Intensive Care Unit or Delivery Suite/Postnatal wards and in performing regular Neonatal out-patient clinics. The candidate will join colleagues in delivering an average of 22 hours a day of consultant presence on the NICU by contributing to on-site out of hours cover by working 5 resident evening shifts in 6 weeks (Mon-Fri), one weekend (2 long days) in 6 weeks and 2 resident night shifts in 6 weeks. The post does not currently include any non-resident on-call duties (this may be subject to change). When resident on site in the evening, at weekends, or overnight this is in addition to a minimum of one or two ST4+ level doctor (tier 2 cover) and one ST1-3 level doctor (tier 1 cover), with additional non-resident on-call support for periods of high activity. Through these innovative working patterns the Luton and Dunstable Neonatal Unit has achieved a consistently high number of hours per day of consultant presence to support doctors in training and deliver high quality, safe neonatal care.&lt;/p&gt;\n&lt;p&gt;We are a friendly, dynamic and supportive multidisciplinary team and are looking for an appointee who can work with us to maintain this ethos whilst helping us to expand and further improve the care of the Newborn in Bedfordshire and Hertfordshire. We regularly contribute to multicentre clinical trials and are keen to continue to expand our portfolio of clinical trials and contribution to neonatal research therefore applicants with previous research experience are encouraged to apply.&lt;/p&gt;\n&lt;p&gt;The Hospital has easy access to central London and the rural Chilterns. The rural areas include many attractive villages and towns within easy reach of the Hospital including St Albans and Harpenden. Excellent schools are found nearby. There is also very good access to the Midlands and London by road using the M1 or A1, or by rail to one of Luton’s three stations. A direct link using the new ‘Busway’ takes passengers from Luton Train station just 7 minutes to reach a stop within a short walking distance of the hospital. London Luton Airport is within fifteen minutes drive from the hospital&lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered on the UK General Medical Council’s Specialist Register. Specialist Registrars may apply if their CCT date is prior to the date of commencement in post.&lt;/p&gt;\n&lt;p&gt;The appointment will be subject to an Enhanced Disclosure and Barring Service Check for the successful candidate prior to commencement.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr J Birch Clinical Director and Consultant in Neonatal Medicine Telephone number 01582 497109&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Locum Consultant in Neonatal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249785", "validThrough": "2020-11-13T23:59:59+0000"}