{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "20000", "unitText": "YEAR", "value": "£20,000 - £28,000"}}, "datePosted": "2020-10-30T14:09:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Oxfordshire Roads to Recovery Service is an integrated Community Drug and Alcohol Service that provides extensive support across the county. Our Recovery Hubs are based in Oxford, Banbury, Witney, Didcot and we also deliver substantial community services across the County. Turning Point Oxfordshire is a highly performing service and we have been awarded ‘Outstanding’ rating by CQC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people across the UK with substance misuse issues. As a FamiliesWorker, you&#39;ll make a real difference to family members&#39; and significant others&#39; who are affected by the substance misuse and those close to them.You&#39;ll develop personal, flexible and realistic support packages that will improve outcomes for families involved in Children Social Care. Passionate about people, you&#39;ll enjoy the scope and support to enhance your own life too, as you make the role yourown as part of a friendly and multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for family workers to expand our successful multi-agency working within Oxfordshire Children Social Care as we move towards a Safeguarding Plus service delivery model. You will be responsible for developing strength-based recovery plans with families that are; comprehensive, family-centred and provide a wide range of solution focused interventions that deliver clear positive outcomes for families. Naturally, we also look for Families Workers with excellent communication skills and a professional qualification would be advantageous. We provide extensive training to develop your understanding / skills and will be willing to invest in the right candidates for the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You may have experience of the substance misuse sector or may have transferable skills and be looking for a change. Having handled a significant caseload in a busy environment, you&#39;ll have an understanding of substance misuse and the recovery agenda. Naturally, we look for our Families Workers to have excellent communication skills and an ability to be flexible and take on an extremely varied role.&lt;/p&gt;\n&lt;p&gt;We want to invest in you,train you and support you to secure a future with a sector leader. So, you&#39;ll need to be highly motivated with big ambitions and even bigger potential.&lt;/p&gt;\n&lt;p&gt;Ability to travel around Oxfordshire, including some rural setting would be advantageous with access to your own transport is preferred.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from&lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire (Oxford, Banbury, Didcot, Witney)", "postalCode": "OX4 1DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7491", "longitude": "-1.23774"}}, "title": "Families Worker - Roads to Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250485", "validThrough": "2020-11-30T23:59:59+0000"}