{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata if part time"}}, "datePosted": "2020-11-02T10:31:55+0000", "description": "&lt;p&gt;An Elective Surgical Unit has opened in Withybush General Hospital .&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for staff to work in a Green - COVID-19 ‘free’ environment. This means patients who come to the Unit will have self-isolated for 2 weeks and tested for Covid 72 hours prior to their surgery. It is a secure Unit and access via a swipe card is required. Staff do not leave the Unit during the day unless absolutely necessary e.g. patients needing to be escorted for essential diagnostics. The plan is for the Unit to reduce the foot fall to protect the patients and build their trust whilst keeping them as safe as possible before, during and after their operations to protect them from Covid 19.&lt;/p&gt;\n&lt;p&gt;The Unit feels very calm and organized and so far we have had excellent feedback from patients stating they feel safe and protected and well cared for. We have 14 beds and an environment to social distance to enhance patient safety. RN to patient ratio is 1 to 7 enabling time to communicate and look after this Multi-Speciality group of patients. &lt;br /&gt;Patients being admitted currently include Surgical and Gynaecology but strategic plans are being considered to also include orthopaedic cases. There are a mixture of day cases and longer stay.&lt;/p&gt;\n&lt;p&gt;This Unit offers great opportunities to expand your current skills and provide new learning if you have not has surgical experience in your career to date. We are also undertaking a scoping exercise to set up an area on the Unit for patients requiring higher acuity to be cared for if needed post operatively such as Colorectal Patients. This area would be staffed to a ratio of 2 patients to 1 RN and full training will be provided. &lt;br /&gt;You will be supported by the 2 Unit Sisters and all the staff currently working on the Unit so please apply even if you don’t have surgical experience, or you are newly qualified Registered Nurse.&lt;/p&gt;\n&lt;p&gt;You will be part of a team that is encouraging patients to be as independent as possible and build up their physical fitness to ensure they go home as optimally fit as possible after their surgery and hospital admission.&lt;/p&gt;\n&lt;p&gt;Withybush General Hospital is situated in the heart of Pembrokeshire which is renowned for its outstanding coastal beauty. There are many bustling towns with cafes, bars and restaurants. &lt;br /&gt;We pride ourselves on providing excellent care for both our own population and the visiting tourists to our county.&lt;br /&gt;The ability to speak Welsh is desirable for this post but English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSheila JonesJob titleSenior SisterEmail addresssheila.jones@wales.nhs.ukTelephone number01437773304&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Withybush General Hospital, Haverfordwest", "postalCode": "SA61 2PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8127", "longitude": "-4.9651"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251586", "validThrough": "2020-11-11T23:59:59+0000"}