{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "In line with TPD&#39;s sessional payment"}}, "datePosted": "2020-10-29T12:31:26+0000", "description": "&lt;p&gt;HEE London is seeking to recruit a Deputy Head of School for Medicine on a part-time secondment basis.&lt;/p&gt;\n&lt;p&gt;There is 1 DHoS Head of School vacancy available at 2 PA.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the overall quality, management and supervision of the programmes within their School. They will be responsible for ensuring all programmes meet the standards defined by HEE EM, the GMC and Royal College. They will work closely with Health Education England medical educators, other Heads of Schools, Directors of Medical Education/Clinical Tutors, Training Programme Directors and APDs to ensure that each trainee is able to access a comprehensive range of experiences which will enable them to cover the speciality curricula.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to maintain a clinical commitment. It is essential that you have a medical degree, membership/fellowship of the relevant Royal College/Faculty and have a current substantive contract as an NHS Consultant in a relevant specialty. In addition you should possess excellent leadership skills and meet professional requirements for Continuing Professional Development and Revalidation and make a wider professional contribution through academic and managerial responsibilities.&lt;/p&gt;\n&lt;p&gt;The post is for 3 years in the first instance. The post holder will be expected to work across the full geography of HEE London.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post is offered on a secondment basis and all candidates are reminded that if they are successful, they are responsible for securing written agreement from their Trust/Practice for release from clinical work for the specified number of PAs/sessions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew DeanerJob titleHead of School of MedicineEmail addressAndrew.Deaner@hee.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stewart House, Russell Square, London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Deputy Head of London School of Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248334", "validThrough": "2020-11-12T23:59:59+0000"}