{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £38,890 - £44,503 p.a. (pro rata"}}, "datePosted": "2020-11-02T16:16:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Trainee Nurse Practitioner in Cardio-Thoracic Surgery (Full-time)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to work in a challenging but rewarding environment and are you able to prioritise and manage your own workload whilst also working as part of a team? We are seeking dynamic, pro-active, highly motivated, and experienced cardio-thoracic surgical nurses with excellent organisational skills to join our team. You will need to demonstrate excellent clinical and communication skills and be able to work autonomously as well as working effectively within the multi-disciplinary team. You will be able to demonstrate a true passion for this speciality and strive to deliver excellent care to patients throughout their journey, working closely with other members of the cardio-thoracic multi-disciplinary team. You will also have a desire to develop and improve service delivery, an enthusiasm to maintain and improve your own knowledge and skills and a willingness to educate and develop other health care professionals caring for cardio-thoracic surgical patients.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust is a major acute teaching Trust that has built an enviable international reputation on five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity. The Trust is recognised as a centre of clinical excellence in cardiac, aortic and thoracic surgery and heart and lung transplantation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren ParkerJob titleLead Nurse Cardiac ServicesEmail addresskaren.parker@mft.nhs.ukTelephone number0161 291 5364Additional contact information&lt;/p&gt;\n&lt;p&gt;Elaine Brazil Matron Cardiac Surgery &amp; Transplant 0161 291 2090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Trainee Nurse Practitioner  - Cardiothoracic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252795", "validThrough": "2020-11-16T23:59:59+0000"}