{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-03T15:46:43+0000", "description": "&lt;p&gt;Gynaecology Ward&lt;/p&gt;\n&lt;p&gt;Band 6 Deputy Ward Sister&lt;/p&gt;\n&lt;p&gt;(with special interest in staff education and development)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you an experienced registered nurse with a passion for women’s health?&lt;/p&gt;\n&lt;p&gt;Do you have a desire to teach and inspire others? Are you a role model who wants to demonstrate evidence-based practice? Would you like to share your knowledge and assist others in developing their professional career in caring for Gynaecology patients? Are you keen to assist with the management and improvement of clinical nursing staff?&lt;/p&gt;\n&lt;p&gt;If you answered yes to the above questions then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;The Gynaecology Ward is looking for a Deputy Ward Sister with a special interest in education. Your role will focus significantly on learning and development, giving you the opportunity to educate staff in a clinical setting whilst also working clinically within the nursing team. You will work primarily on the Gynaecology Ward but will also be expected to network and support staff across the Gynaecology directorate.&lt;/p&gt;\n&lt;p&gt;Working in collaboration with the Practice Development Nurse and Ward Manager to enhance the improvement of nursing staff, your educational skills and knowledge will be developed by the Gynaecology and divisional education teams, who will coach you within this specialised area of professional education.&lt;/p&gt;\n&lt;p&gt;We are looking for a professional and enthusiastic individual who can patiently work alongside staff, developing confidence and competence in a range of clinical skills. Excellent communication skills, an ability to critically analyse research and provide evidence-based teaching sessions are vital. As a member of the Gynaecology Ward senior team it is essential that you enjoy working within a team where by you can contribute and discuss a range of ideas and desired outcomes, while being able to deliver these independently, with the shared goal of delivering safe, excellent care to our patients and their families.&lt;/p&gt;\n&lt;p&gt;Informal visits and discussions are welcomed. Please contact Kat Proffitt (Practice Development Nurse) or Holly Attle (Ward Manager) for further information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 17-Nov-2020&lt;/p&gt;\n&lt;p&gt;Planned Interview date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatherine ProffiittJob titlePDNEmail addresskatherine.proffitt@ouh.nhs.ukTelephone number01965-222001/002&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe and Horton, Headington", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Deputy Ward Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254635", "validThrough": "2020-11-17T23:59:59+0000"}