{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-29T10:31:35+0000", "description": "&lt;p&gt;The Performance Analytical Team consists of three central analytical teams and seven regional teams. The East of England Performance Analytical Team are looking to recruit a Senior Analytical Manager. As a team, we are responsible for the collection, reporting and analysis of information about NHS operational activity and performance, and our team works with Regional Directors, Directors of Performance and many other directorates across the region to bring analysis to decision making. Examples of work include:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing performance metrics to understand how patients experience the NHS – for example analysing statistics on A&amp;E 4hr performance and considering options for any replacement. This also includes putting in processes for monitoring and identifying reasons for its variation.&lt;/li&gt;\n&lt;li&gt;Assisting with how the NHS plans for its delivery of services – enabling the annual planning round, working with regional Sustainability and Transformation Partnerships to help complete the required stages for planning. This includes producing analysis of their results to ensure that plans are cohesive and realistic.&lt;/li&gt;\n&lt;li&gt;Deep dive pieces of analysis – these are multiple and varied in their topic and method applied. Previous areas include modelling the impact of COVID on waiting times for treatments, and where to locate NHS Nightingale sites.&lt;/li&gt;\n&lt;li&gt;Projecting demand for NHS services and required capacity over the course of the year and future years. For example, how might services such as changing outpatient appointments from face to face to video affect the required capacity and what other impacts (positive and negative) might this change in service have.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Senior Analytical Manager the post holder will work as part of a dynamic analytical community supporting managers and staff across all of NHS England and NHS Improvement’s functions.&lt;/p&gt;\n&lt;p&gt;The post holder will form part of a team of senior analytical managers within the Performance Analysis team, which will provide strategic analysis for insight into NHS performance and evidence to support decision-making. The post holder is responsible for providing professional expertise to the outcome of the business processes for the Department or Directorate.&lt;/p&gt;\n&lt;p&gt;The post holder will define current processes, facilitate discussions and advise colleagues as to how best practice might be adopted in the definition of future processes, document those processes as they are agreed and oversee their delivery.&lt;/p&gt;\n&lt;p&gt;With minimal supervision, the Senior Analytical Manager will deliver a high quality data analytics service to NHS business teams using extensive knowledge of NHS data and business processes, and excellent technical skills in data management, business intelligence and analytics such as data modelling, data visualisation, data blending, statistical software, with a focus on building self-service analytics solutions which will allow business users to analyse data themselves.&lt;/p&gt;\n&lt;p&gt;In particular the post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrate significant experience and understanding of a breadth and depth of analytical methods (i.e. economics, statistics, social research, health related disciplines and operational research techniques) and their application, to provide timely analysis and intelligence to a standard which reflects current best practice;&lt;/li&gt;\n&lt;li&gt;Structure problems and develop appropriate analytical solutions, analysing and triangulating data in innovative ways, and adapting approaches to deal with ambiguity. Deploy analytical judgement in dealing with complex problems or missing data;&lt;/li&gt;\n&lt;li&gt;Take a practical approach to providing advice, giving persuasive explanations of complex concepts orally and in writing to a range of audiences, in a clear and accessible manner;&lt;/li&gt;\n&lt;li&gt;Have good project management skills, including the ability to plan, manage and deliver a portfolio of projects, juggle competing priorities and tight deadlines for self and team, and work autonomously to drive own work programme and that of team members. Anticipate and proactively manage delivery risks, quality assure and be accountable for team’s products;&lt;/li&gt;\n&lt;li&gt;Work with other team leaders to develop and manage all staff in the analytical team, providing appropriate coaching and support;&lt;/li&gt;\n&lt;li&gt;Build and manage collaborative relationships across the health system, including internal and external policy and analytical teams, providers and clinical experts, and challenging external partners and stakeholders, to ensure analyses are relevant to their needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jonathan Dickens&lt;/p&gt;\n&lt;p&gt;Senior Analytical Lead&lt;/p&gt;\n&lt;p&gt;jonathan.dickens@nhs.net&lt;/p&gt;\n&lt;p&gt;07919 540343&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NHS England, Leicester/Cambridge", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Senior Analytical Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247914", "validThrough": "2020-11-15T23:59:59+0000"}