{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T16:01:26+0100", "description": "&lt;p&gt;Our busy Critical Care Unit is located in the famous silk town of Macclesfield which is situated within the beautiful surrounding countryside of the Peak District National Park in Cheshire, and within easy reach of Manchester, Liverpool and Staffordshire. The Unit is based in our 280 bedded District General Hospital.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of our critical care dedicated workforce. We are a dynamic and progressive department that places patient centered care at the core of it ethos.&lt;/p&gt;\n&lt;p&gt;As an expert Critical Care Nurse with the appropriate skills to effectively manage the Critical Care Unit on a daily basis, you will also be responsible for the assessing, planning, implementing, delivering and evaluating, skilled practical patient cantered care to the critically ill patients and their families.&lt;/p&gt;\n&lt;p&gt;As a committed and motivated individual who wishes to develop their career within Critical Care, you will be encouraged to pursue your educational needs that will be guided by our Practice Educator and supported by an individualised development pathway. This bespoke package will include the opportunity to achieve leadership skills in order to further develop your skills and knowledge.&lt;/p&gt;\n&lt;p&gt;Our fantastic team, during a global pandemic, were able to achieve Team of the Month, which is recognition from our colleagues and Executives throughout the trust that demonstrates our one team approach and commitment to patients and colleagues.&lt;/p&gt;\n&lt;p&gt;The requirements for application include NMC registration and desire to succeed in a challenging but exciting environment&lt;/p&gt;\n&lt;p&gt;The post holder must be flexible to commit to internal rotation of days and nights on a regular basis. &lt;strong&gt;Permanent, secondment, fixed term and flexible working contracts are all options that you may wish to explore and all will be considered for the right candidate. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is Permanent.&lt;/p&gt;\n&lt;p&gt;Hours per week: Various hours are available including full time (37.5 hrs) and part-time.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Hayes Job title Senior Sister Email address sarah.hayes13@nhs.net Telephone number 01625 661760&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Sister / Shift Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241214", "validThrough": "2020-11-08T23:59:59+0000"}