{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T12:01:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Estates Operations Manager &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following a review of the Estates Department Management structure, we are developing a team of 2 Estates Operations Managers at Lincoln County Hospital). The post holders will be responsible for the operations and maintenance of the Building Fabric, Grounds &amp; Gardens and Engineering systems and plant.&lt;/p&gt;\n&lt;p&gt;The Estates Department provides support services to more than 600 beds. The site is very busy and consists of a mix of new and older buildings. This is a challenging time and an excellent opportunity to join a team of Estates Management Professionals.&lt;/p&gt;\n&lt;p&gt;Duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identification of maintenance requirements and the preparation of programmes of work&lt;/li&gt;\n&lt;li&gt;Planning and managing improvement works and minor projects including feasibility studies, preparation of specifications, quotation and tender documents.&lt;/li&gt;\n&lt;li&gt;Ensure compliance with all relevant legislation&lt;/li&gt;\n&lt;li&gt;Delegated responsibility for a revenue maintenance budget&lt;/li&gt;\n&lt;li&gt;Actively engage in the introduction a new PPM system that is aligned to SFG20&lt;/li&gt;\n&lt;li&gt;Direct line responsibility for the directly employed Estates workforce at Lincoln County Hospital&lt;/li&gt;\n&lt;li&gt;Developing specifications and tendering works and maintenance packages to meet with the Trust&#39;s standing financial instructions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates will have served an apprenticeship or undertaken other suitable training in an engineering environment. Ideally, candidates will have attained a BTEC HNC or equivalent in Engineering.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate significant experience in the maintenance of plant and services.&lt;/p&gt;\n&lt;p&gt;Consideration will be given to candidates who present a strong application but who do not hold the relevant qualifications and who are willing to undertake an appropriate course of study to obtain them.&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate a flexible approach, the ability to organise and plan work, problem solve, work on your own initiative, be able to take “ownership” of key areas of work and be an effective communicator.&lt;/p&gt;\n&lt;p&gt;Previous experience in the management of Direct Labour and Contractors is desirable.&lt;/p&gt;\n&lt;p&gt;The Trust is introducing increased flexibility towards employee’s hours of work. Currently a Monday to Friday work pattern 8.00 a.m. – 4.00 p.m. applies and will be followed for the purpose of site familiarisation. There will then be an expectation and requirement for the successful applicant to work an extended pattern of flexible hours consistent with moves towards 24/7 working.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to provide a ‘return to work’ commitment outside of normal working hours and must be prepared to participate in an ‘on-call’ rota.&lt;/p&gt;\n&lt;p&gt;We offer an induction programme to familiarise you with the work and the site, appropriate in service training where necessary, uniform, final salary pension scheme and opportunity for career development&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to develop a management partnership to lead the Estates Department in achieving compliance and introducing a new PPM system.&lt;/p&gt;\n&lt;p&gt;This posts offers the opportunity to develop your management skills in a busy Estates Department and specifically take the lead in the operation and maintenance of the electrical systems and equipment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatt SmithJob titleHead of EstatesEmail addressmatt.smith@ulh.nhs.ukTelephone number07786 027363&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Greetwell Road, Lincoln, LN2 5QY, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Estates Operations Manager - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242321", "validThrough": "2020-11-09T23:59:59+0000"}