{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80000", "minValue": "80000", "unitText": "YEAR", "value": "80,000"}}, "datePosted": "2020-11-02T08:54:59+0000", "description": "&lt;p&gt;The Priory Hospital Cheadle Royal has 14 different wards and cares for 149 patients. Each unit has a dedicated Multi Disciplinary Team which includes a Consultant Psychiatrist, Speciality Doctor, Ward Manager, Psychologist, Occupational Therapist and support services. Our primary aim is to support and care for our patients.&lt;/p&gt;\n&lt;p&gt;Specialist CAMHS services at the Priory Hospital Cheadle Royal offers admission to young people aged between 13 and 18 years with complex presentations. All CAMHS beds are funded by NHSE. The CAMHS services comprises of General Acute unit (GAU), Psychiatric intensive care unit (PICU) and Low Secure unit.&lt;/p&gt;\n&lt;p&gt;The Young People’s Service is made up of 3 wards; Meadows, Orchard and Woodlands.&lt;/p&gt;\n&lt;p&gt;Meadows PICU is a 10 bed child and adolescent mixed psychiatric intensive care unit offering assessment and treatment to young people, male and female up to 18 years of age and with complex care needs.&lt;/p&gt;\n&lt;p&gt;Orchard is a 15 bed acute admissions/treatment ward for young people up to 18 years old with a range of mental health presentations including eating disorders.&lt;/p&gt;\n&lt;p&gt;Woodlands is a 10 bed low secure therapeutic service for adolescent girls aged between 13 and 18 years of age, all of who have a diagnosis of Emergent Personality Disorder and enduring high-risk behaviours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a specialty grade doctor working on our CAMHS wards, you will work alongside the experienced multidisciplinary team in aspiring to provide excellent bespoke care to enable our patients to fulfil their recovery goals and work towards discharge to the life they want. The Specialty Doctor has a key role in working cohesively with a supervising consultant, nursing team and wider MDT to deliver best outcomes for complex group of young people with challenging presentations.&lt;/p&gt;\n&lt;p&gt;Due to the specialist nature of this service, the Specialty Doctor has a key role in providing evidence-based assessment and treatment under direct supervision and support from the consultant. We have a national reputation for offering treatment for complex and challenging presentations in all our service users.&lt;/p&gt;\n&lt;p&gt;The post-holder reports to the supervising consultant and is expected to have formal supervision at a frequency compatible with Priory policy, and to be a member of a peer group within Priory. Given the acuity and high turnover, post holder will be be expected to take initiative within the remit of their role.&lt;/p&gt;\n&lt;p&gt;Working hours are 37.5 hours per week, which conventionally runs from 9am to 5pm and there is an on call requirement of 1:10.&lt;/p&gt;\n&lt;p&gt;It is expected that the post-holder will display flexibility around working hours if matters of clinical safety require this. Funding is available centrally for courses and conferences in line with requirements of your CPD. There is specified study leave for achieving PDP in line with CPD. Attendance at doctors meetings on site or within Priory is expected and encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Other benefits you can expect upon joining our Cheadle Royal Hospital include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave (plus 8 Bank holidays) increasing with length of service&lt;/li&gt;\n&lt;li&gt;Birthday leave&lt;/li&gt;\n&lt;li&gt;Free on site parking&lt;/li&gt;\n&lt;li&gt;Subsidised meals&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Priory Perks discount portal&lt;/li&gt;\n&lt;li&gt;Dedicated career pathway&lt;/li&gt;\n&lt;li&gt;Enhanced sick pay and maternity pay after 1 years service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "SK8 3DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.375", "longitude": "-2.22149"}}, "title": "Speciality Doctor (CAMHS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251357", "validThrough": "2020-11-30T23:59:59+0000"}