{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-29T11:15:21+0000", "description": "&lt;p&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/p&gt;\n&lt;p&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/p&gt;\n&lt;p&gt;• Integrated pathways across the health and care system&lt;br /&gt;• Innovative new roles&lt;br /&gt;• Training to up skill our workforce&lt;/p&gt;\n&lt;p&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/p&gt;\n&lt;p&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/p&gt;\n&lt;p&gt;2 posts Band 4 Rehabilitation after Critical Illness (RaCi) UHND and DMH&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the RACI (Rehabilitation After Critical Illness) Team in CDDFT. We are recruiting to two posts, one based at UHND and one based at DMH. We are looking for a highly motivated individual who has the skills to work holistically across the specialities of physiotherapy and occupational therapy, speech and language therapy and dietetics.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the multidisciplinary team, all working towards the joint goal of improving the function of patients who are recovering from critical illness. The purpose of the RACI team is to provide their clients with the support they need to achieve their individual goals whilst in the acute hospital and in the community setting.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible to the senior physiotherapist, SALT or dietician in the team either at UHND or DMH. We are looking for a candidate who is highly skilled in the rehabilitation of patients with complex long term conditions, respiratory conditions and critical illness. They require excellent communication skills in order to be able to motivate patients of all levels of function, cognition and psychological condition. We are looking for a highly organised individual who is able to carry out administrative duties, effectively manage their time and work autonomously within the set guidelines from their seniors.&lt;/p&gt;\n&lt;p&gt;The post holder will carry out their duties, over a 7 day service mainly at the acute hospital site at UHND or DMH. There is also an expectation for the post holder to be able to travel to a community location to provide an outpatient clinic as part of the RACI team&lt;/p&gt;\n&lt;p&gt;Please contact Jessica Mansfield for more information regarding the post at UHND, Jessica.mansfield@nhs.net.&lt;/p&gt;\n&lt;p&gt;Please contact Kelly Huitson for more information regarding the post at DMH, khuitson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington Memorial Hospital x 1, University Hospital of North Durham x 1", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Associate Practitioner in Rehabilitation Therapy (RACI)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248033", "validThrough": "2020-11-12T23:59:59+0000"}