{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum + 5% HCAS"}}, "datePosted": "2020-10-29T11:46:41+0000", "description": "&lt;p&gt;The physiotherapy team at the Princess Alexandra Hospital is an exciting and innovative team who provide on-going care to a broad range of patients. These range from those who are critically unwell, to those who need minimal rehabilitation or assessment and advice.&lt;/p&gt;\n&lt;p&gt;The settings covered by the physiotherapy department include the emergency department, Orthopaedics, medicine, respiratory, musculoskeletal outpatients and critical care. As a team we regularly communicate to support the day to day running of the department – we work closely between rotations to support each other through training, staffing and career opportunities.&lt;/p&gt;\n&lt;p&gt;You will already have had experience working as a band 5 physiotherapist and this role will allow you to further develop your clinical skills whilst managing more junior staff. You will be supported to do this by your team lead. You will also be involved in the day to day running of the team and training of others. You will have the ability to work independently whilst taking into account the responsibilities of the team. There will also be the requirement for the successful candidate to take part in MDT working and representing the team in the absence of the senior.&lt;/p&gt;\n&lt;p&gt;Experience of working in the acute setting is desirable with a minimum of 18 months band 5 experience. This is the ideal opportunity for the right candidate to broaden their skills to work as part of a dynamic and supportive physiotherapy team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatie SilkJob titleInterim Head of TherapiesEmail addresskatiesilk@nhs.netTelephone number01279827200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Alexandra Hospital NHS Trust, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Band 6 Rotational Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248175", "validThrough": "2020-11-12T23:59:59+0000"}