{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-22T12:00:47+0100", "description": "&lt;p&gt;An opportunity has arisen to join the acute, dietetic team at Mid Cheshire Hospital NHS Foundation Trust as a band 6 dietitian working in surgery, gastroenterology and critical care. This post has scope for clinical development following band 5 experience in a supportive  team, within the Central Cheshire Integrated Care Partnership dietetic service of 30 acute and a community dietitians&lt;/p&gt;\n&lt;p&gt;This full-time fixed term post until March 2022 is based at Leighton Hospital.  It has been created to cover  maternity leave. The post holder will be a key member of the surgical, gastroenterology and nutrition multi-disciplinary teams, providing specialist dietetic service to complex medical, gastro/surgical and following training, support cover for critical care inpatients. There will also be responsibility for an outpatient clinic mainly working with patients with IBD, IBS, liver disease, pancreatic insufficiency and pre and post-surgical nutritional issues.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience in oral, enteral and ideally parenteral nutritional support, but clinical supervision and support will provided to develop specialist skills.  The post holder will support the training, mentoring and development of junior dietetic staff and students.&lt;/p&gt;\n&lt;p&gt;This post sits within a supportive clinical team comprising of two other band 6 and two band 7 dietitians in gastroenterology, surgery and critical care, in addition to the wider team of junior and specialist dietitians and support staff. The department places a strong emphasis on clinical and peer support and supervision and has a well-established program facilitating the training of dietetic students on placements.&lt;/p&gt;\n&lt;p&gt;The post is subject to an enhanced Disclosure and Barring service check&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Band 6 Dietician (Fixed Term)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238297", "validThrough": "2020-11-12T23:59:59+0000"}