{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-22T14:30:38+0100", "description": "&lt;p&gt;Posts available:&lt;br /&gt;Horncastle – 2x Part Time and 1x Full Time&lt;br /&gt;Boston – 1x Full Time&lt;br /&gt;Grantham – 1x Part Time&lt;/p&gt;\n&lt;p&gt;Healthy Minds Lincolnshire provides early and preventative emotional wellbeing interventions for children, young people and their families across Lincolnshire. First established in 2017, the service has provided intervention, advice or guidance to over 5,500 children &amp; young people across the County.&lt;/p&gt;\n&lt;p&gt;The service also staffs the Here4You Line – a supportive phone line for professionals, children, young people and their families, which provides signposting, advice and self-referral.&lt;/p&gt;\n&lt;p&gt;We are advertising for an exceptional Practitioner to join our team. This role will provide support via liaison &amp; consultation to education providers and universal services. It will also involve leading evidence based groups &amp; workshops to children &amp; young people and parents/carers, as well as brief 1-1 interventions. Healthy Minds Lincolnshire prides itself on its dynamic approaches to supporting children, young people, parents/carers and professionals, and seek those eager to bring creativity &amp; passion to the service.&lt;/p&gt;\n&lt;p&gt;Healthy Minds Lincolnshire work with children and young people on a variety of emotional wellbeing needs including but not limited to: anxiety, low mood, self-harm, self-esteem, and anger.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be able to provide excellent clinical &amp; management supervision to Band 4 Practitioners within the team, with the ability to inspire and develop staff to their full potential.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for motivated and highly organised individuals with a passion for children and young people’s emotional wellbeing to help shape the Healthy Minds Lincolnshire service.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be able to travel around this large rural county and will be able to work flexibly according to the needs of the service. The successful applicant will need to have knowledge and experience of delivering evidence based therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to be familiar with children’s safeguarding procedures in Lincolnshire and demonstrate good working relationships with other professionals to enable the provision of holistic care to children, young people and their families. Knowledge and understanding of local and national children &amp; young people’s mental health initiatives is desirable.&lt;/p&gt;\n&lt;p&gt;As well as having skills and knowledge in mental health care, it is possible that the successful applicant will have experience of working in education and/or social care. This is also an ideal opportunity for practitioners who hold a post graduate or graduate certificate in psychological wellbeing.&lt;/p&gt;\n&lt;p&gt;There are well established links between all of the community based Children and Young People’s Mental Health Services and partner organisations.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countywide", "postalCode": "LN1 1EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2434", "longitude": "-.558171"}}, "title": "Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238898", "validThrough": "2020-11-15T23:59:59+0000"}