{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87103", "minValue": "70794", "unitText": "YEAR", "value": "£70,794-£87,103 Per Annum (pro rata for part time)"}}, "datePosted": "2020-11-04T14:04:09+0000", "description": "&lt;p&gt;Are you a General Practitioner with a drive for delivering excellent care? Are you looking to move into an exciting and rewarding role? If you are, we have the ideal opportunity for a Civilian Medical Practitioner (CMP) at Cawdor Barracks, Brawdy, Pembrokeshire.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide primary and occupational healthcare in line with General Medical Council standards to ensure our objectives to optimise patient care are met.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly team to provide a first-class medical service for military personnel. The working environment is welcoming, inclusive and supportive, and you will be valued for the skills you bring.&lt;/p&gt;\n&lt;p&gt;The role of Defence Primary Healthcare (DPHC) is to provide and commission a safe, effective and efficient healthcare service for entitled personnel contributing to the maximisation of Service personnel fit for task. This is achieved through the provision of an occupationally aware primary healthcare service which includes dental, rehabilitation and mental healthcare services.&lt;/p&gt;\n&lt;p&gt;The duties of the successful candidate will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing general healthcare to all entitled service personnel.&lt;/li&gt;\n&lt;li&gt;Providing advice to the Commanding Officer on Medical, Occupational Health and H&amp;SW Act matters.&lt;/li&gt;\n&lt;li&gt;Actively promoting Occupational Health and Preventative Medicine, paying close attention to the vaccination state of service personnel.&lt;/li&gt;\n&lt;li&gt;Carrying out specific medical examinations, such as: Occupational Diving, LGV, Fit for Course/Detention and Reviews when required by the Commanding Officer or other Authority.&lt;/li&gt;\n&lt;li&gt;Liaising with welfare agencies, secondary care services and other external agencies as appropriate to ensure comprehensive patient care&lt;/li&gt;\n&lt;li&gt;Issuing a protocol concerning the professional standards required from supporting medical/nursing staff and detailing the treatment and medicines that may be given without prior reference to a doctor.&lt;/li&gt;\n&lt;li&gt;Providing appropriate preventative medical advice to both individuals and chain of command, including matters of sexual health, travel medicine, drug and alcohol misuse, and specific pre-deployment issues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please refer to the attached Job Description &amp; Person Specification for a full description of duties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required Qualifications and Memberships:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Practitioner with a license to practise.&lt;/li&gt;\n&lt;li&gt;Current GMC registration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current UK driving license&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The selection at sift stage will be CV based. At interview, you will be tested against the following Civil Service Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Managing a Quality Service&lt;/li&gt;\n&lt;li&gt;Delivering at Pace&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cawdor Barracks, Brawdy, Pembrokeshire", "postalCode": "SA62 6NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8787", "longitude": "-5.12914"}}, "title": "Civilian Medical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256141", "validThrough": "2020-11-26T23:59:59+0000"}