{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 p.a. inclusive of HCA"}}, "datePosted": "2020-10-26T10:47:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Guy’s &amp; St Thomas NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Guy’s and St Thomas’ NHS Foundation Trust &lt;/strong&gt;comprises two of London’s best known teaching hospitals with a long history of high quality care, clinical excellence and innovation, Evelina London Children’s Hospital and community services in Lambeth and Southwark.&lt;/p&gt;\n&lt;p&gt;We are among the UK’s busiest, most successful foundation trusts. We provide a full range of local hospital and community services for people in Lambeth and Southwark, as well as specialist care for patients from further afield, including cancer, renal and cardiothoracic services.&lt;/p&gt;\n&lt;p&gt;We have one of the National Institute for Health Research’s (NIHR) biomedical research centres, established with King’s College London in 2007, as well as dedicated clinical research facilities.&lt;/p&gt;\n&lt;p&gt;We have around 17,100 staff, making us one of the biggest employers locally. We aim to reflect the diversity of the local communities we serve and continue to develop new and existing partnerships with local people, patients, neighbouring NHS organisations, local authorities and charitable bodies and GPs.&lt;/p&gt;\n&lt;p&gt;We strive to recruit and retain the best staff as the dedication and skills of our employees lie at the heart of our organisation and ensure that our services are high quality, safe and patient focused.&lt;/p&gt;\n&lt;p&gt;In its 2019 inspection report the Health Care commission (CQC) rated Guy’s and St Thomas’ NHS Trust ‘Good’ with rating of ‘Outstanding&#39; for providing ‘Care’ to our patients and ‘Well led’.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Pharmacy Clinical Trials Department Service for adult patients at GSTT manages one of the largest clinical trials’ portfolios in the country managing over 500 studies and acting as Central Pharmacy for many GSTT sponsored studies.&lt;/p&gt;\n&lt;p&gt;The department has advanced capabilities for managing studies involving Investigational Medicinal Products (IMPs) ranging from traditional drug molecules to Advanced Therapies Investigational Medicinal products (ATIMPs) such as cell therapies.&lt;/p&gt;\n&lt;p&gt;The post holder will work in the pharmacy department. They will facilitate the management and dispensing of clinical trial medicines for Trust patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatalie Palmer &amp; Jinny YooJob titleSenior Clinical Trials Pharmacy TechnicianEmail addressnatalie.palmer@gstt.nhs.ukTelephone number020 7188 8315Additional contact information&lt;/p&gt;\n&lt;p&gt;Natalie Palmer -Senior Clinical Trials Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Natalie.Palmer@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;AND&lt;/p&gt;\n&lt;p&gt;Jinny Yoo- Senior Clinical Trials Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;JinSun.Yoo@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;020 7188 8315 (Guy&#39;s) and 020 7188 7188 ext: 54679 (St Thomas&#39; site)&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, Central London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Senior Pharmacy Assistant, Clinical Trials (Maternity Leave Cover)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242080", "validThrough": "2020-11-09T23:59:59+0000"}