{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "60000", "unitText": "YEAR", "value": "Up to £60,000 (Pro-Rata)"}}, "datePosted": "2020-11-06T07:13:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;strong&gt;: Highly Specialist Clinical &lt;/strong&gt;Psychologist&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Salary/Benefits&lt;/strong&gt;: Generous package available up to £60,000 depending on the level of experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time:&lt;/strong&gt;40 hours per week (Part time will be considered)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Based across Purbeck View School, Swanage &amp; Cambian Wing College, Bournemouth&lt;/p&gt;\n&lt;p&gt;We all know that the Coronavirus is changing the way we go about our everyday lives but, at The Cambian Group, there is one thing that doesn’t change – our absolute commitment to the children and young people in our care.&lt;/p&gt;\n&lt;p&gt;We are making sure that the support we offer is constant, reliable and of the highest quality and it is our fantastic staff who are making this happen.&lt;/p&gt;\n&lt;p&gt;Amidst all the uncertainty, as everything we do changes, how about changing your story too and, in turn, help to change the lives of our children and young people?&lt;/p&gt;\n&lt;p&gt;The Cambian Group, the UK’s largest provider of specialist services in education, mental health rehabilitation, and learning disabilities, is looking for a dedicated, caring individual to join the company as a psychologist.&lt;/p&gt;\n&lt;p&gt;We offer excellent training and career progression opportunities as well as a variety of staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will involve the assessment, formulation and treatment of the young people’s psychological needs. You will be part of a multi-disciplinary team that includes speech and language therapists, occupational therapists, nursing, psychiatry, care and education. As a senior member of the therapy team, the post-holder will be expected to contribute to service development and work closely with other psychologists within the region to continually improve service provision&lt;/p&gt;\n&lt;p&gt;Full induction training is given. You will also learn from some of the most dedicated and inspirational people in our profession and just like our young people you will be learning all the time through our on-going mentoring and support.&lt;/p&gt;\n&lt;p&gt;Dependant on your experience you may be required to supervise other Mental Health Practitioners, Clinical Psychology Trainees, Healthcare Students, and Assistants.&lt;/p&gt;\n&lt;p&gt;In addition to your consultation role to the homes you will also be providing specialist assessments of children and young people within the residential setting and creating regular psychological reports.&lt;/p&gt;\n&lt;p&gt;These assessments will inform your input to the care homes and also to the children who may require you to offer direct 1-1 long term therapy.&lt;/p&gt;\n&lt;p&gt;Further duties are described in the attached Job Description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Candidate profile&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will be excited by the Cambian vision and values and will relish an opportunity to make a difference. You will need to be a clear communicator, well organised, confident and capable of managing a complex caseload in a demanding environment. Experience of supervising others and providing training to multi-disciplinary staff is required.&lt;/p&gt;\n&lt;p&gt;Learning Disability and/or CAMHS experience preferred.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have to meet the person specification in order to be offered this post. Cambian is committed to Safeguarding and protecting the young people and service users within our care. All candidates will be subject to an enhanced DBS check and reference checks. Cambian is an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanage", "postalCode": "BH19 1PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6144", "longitude": "-1.96253"}}, "title": "Highly Specialist Clinical Psychologist - Cambian Purbeck View School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258854", "validThrough": "2020-11-20T23:59:59+0000"}