{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro-rata"}}, "datePosted": "2020-10-29T10:31:32+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and dynamic person with excellent communication skills, both with groups and individual, who wishes to grow and develop their skills in Diabetes. You will work closely with the Lead Community Specialist Diabetes Dietitian, Dietetic assistant, Secondary Diabetes Specialist Dietitian, Specialist Diabetes nurses and Diabetes Educators.&lt;/p&gt;\n&lt;p&gt;Training will include DESMOND, Type 2 diabetes management, Weight management (ESTA programme) and behavioural changes as needed.&lt;/p&gt;\n&lt;p&gt;You will work as an integral part of the diabetes MDT, which includes nursing, podiatry, primary care health care professional.&lt;/p&gt;\n&lt;p&gt;You will be working mainly in North and Mid-Bedfordshire, across the wider Bedfordshire community in clinics, care homes and in a range of community sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Quote from the previous post holder: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“I have loved the variety that this role has brought. From training health care professionals to joint clinics with DSNs to group education sessions with patients with type 2 diabetes, it’s always interesting. The ICDS and diabetes education teams are brilliant teams to be part of and learn from.”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What about the department I will join?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be based at Bedford Hospital and you will be part of the Integrated Community Diabetes Team. You will also have close links with the Dietetics department, which includes acute, gastroenterology, oncology and paediatric dietetic teams. The Nutrition and Dietetic Team is an integrated acute and community team. There is an experienced team of staff to mentor and support you.&lt;/p&gt;\n&lt;p&gt;Although we have a very strong learning and development function, we appreciate you will need to have acquired some skills and experience from your career you will require in order for your time with us to be a real success. These can be found in the Person and Job Description attachment on NHS Jobs. However we have highlighted three of them below:&lt;/p&gt;\n&lt;p&gt;1. You should be an excellent communicator.&lt;/p&gt;\n&lt;p&gt;2. Organisation skills and an ability to prioritise your caseload/training sessions and balance the development aspect of the role with the clinical demands.&lt;/p&gt;\n&lt;p&gt;3. Knowledge of the evidence base for dietary interventions in the management of type 2 Diabetes.&lt;/p&gt;\n&lt;p&gt;A very good working knowledge of Microsoft Office, Excel, Word, Powerpoint and Outlook is essential. Knowledge of social media would also be advantageous. Due to the nature of this role, strong organisational skills and self-motivation are vital.&lt;/p&gt;\n&lt;p&gt;The post is part-time, 30 hours per week, which will be worked over 5 days and will include the occasional Saturday and evening with a day in lieu being given the week before or after. You need to be HCPC registered.&lt;/p&gt;\n&lt;p&gt;The post will be based at Bedford Hospital, but will involve travel throughout Bedfordshire; therefore a car owner/user is essential for this role.&lt;/p&gt;\n&lt;p&gt;If you’d like to find out more about joining the team, please contact Marielle Valette, Lead Diabetes Dietitian 01234 792 313 or work mobile on 07884 547 789. Or Emma Hoggins, Nutrition and Dietetic Manager on 01234 795 965 or 07826 903254&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Find us on Twitter @BedfordRDs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital NHS Trust, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Community Diabetes Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247912", "validThrough": "2020-11-07T23:59:59+0000"}