{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:01:18+0000", "description": "&lt;p&gt;Do you want to part of an exciting new project?&lt;/p&gt;\n&lt;p&gt;Are you an organised, engaging and resourceful registered nurse who works in or alternatively is interested in moving into an education environment in the next phase of your career? If so, this unique opportunity may be for you. We invite applications in the role of Practice Education Facilitator also known as PEF to join our Nurse Education Team as a key member of the newly formed Education Quality Team.&lt;/p&gt;\n&lt;p&gt;The successful appointee will work closely with the newly appointed Matron for Education Quality. We envisage this post will play a pivotal role in the development of a high quality curriculum within a Virtual Learning Environment (VLE) to provide ongoing accessible Continuing Professional Development (CPD) for all non-medical staff. You will support subject matter experts with co-writing and curriculum design and participate in quality assurance processes.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend team meetings to share good practice and provide cross cover ensuring a high quality standardised approach to all online and face to face education within Nurse Education.&lt;/p&gt;\n&lt;p&gt;The role-holder will provide a key link between subject matter experts and the Matron for Education Quality.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic forward thinking practitioner with a commitment to the blended learning initiative to develop the VLE content. Ideally you will have a knowledge of education package development that transfers to the online setting.&lt;/p&gt;\n&lt;p&gt;Whilst the post is based at New Cross Hospital there is a requirement for the post holder to support education across the organisation.&lt;/p&gt;\n&lt;p&gt;If you want to be part of this exciting online project to drive up standards of patient care then this post is for you.&lt;/p&gt;\n&lt;p&gt;For further information please contact: Head of Nurse Education- Catherine Wilson on C.wilson12@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine WilsonJob titleHead of Education- NursingEmail addressc.wilson12@nhs.netTelephone number01902 447299 Internal:8223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Wolverhampton NHS Trust- Newcross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Practice Educator Facilitator for Education Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254238", "validThrough": "2020-11-17T23:59:59+0000"}