{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615"}}, "datePosted": "2020-11-03T08:31:37+0000", "description": "&lt;p&gt;Don’t worry about the past, focus on the future. Your future. Do you have a passion to care for people? If you want to care for others and are looking for a rewarding career where you can make a difference then we want you.&lt;/p&gt;\n&lt;p&gt;We would like to welcome you to apply to work at Bradford Teaching Hospitals NHS Foundation Trust whether you are newly qualified or an experienced nurse. We will be holding skype interviews on the 3 and 4th December 2020.&lt;/p&gt;\n&lt;p&gt;You will receive exceptional clinical skills training, preceptorship and support. We will also be able to talk to you about career development and progression within the Trust. Bradford Teaching Hospitals NHS Foundation Trust prides itself on the support offered to both new and experienced nurses looking to start or continue their career in nursing.&lt;/p&gt;\n&lt;p&gt;There are a variety of staff nurse posts offering a supportive and nurturing environment, assisting the transition from student to autonomous practitioner and supporting you to progress further in your nursing career.&lt;/p&gt;\n&lt;p&gt;We’re also keen to hear from you if you are interested in joining our nurse bank.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining us please submit an application form for Staff Nurse post at Bradford Teaching Hospitals NHS Foundation Trust in response to this advert. You will then be invited to attend an interview (skype due to current restrictions), where you can discuss any preference for speciality and talk to us about working at Bradford Teaching Hospitals NHS Foundation Trust.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120952.JPG", "name": "Bradford Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120952"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD9 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8059", "longitude": "-1.79488"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253159", "validThrough": "2020-11-23T23:59:59+0000"}