{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T09:00:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Secure and Forensic Services, be a part of the patient journey and make a difference!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of an exceptional forensic health care team in the South of England. So proud are we with what we do we are currently about to undergo a strategic Quality Improvement (QI) systematic process to improve upon the good practice we already deliver. To do this we have the support of senior managers in the Trust who can already see the potential in our service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to be a part of something big? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Something innovative ? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A service that raises standards of care ?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Well why you don’t call the ward manager for an informal chat or to arrange a shadow day where you can see some of the excellent work we already do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a vacancy for a Band 6 Registered Mental Health Charge Nurse on Blossom Ward Woman’s Medium Secure Ward within the Hellingly Centre.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Hellingly Centre has been overall rated as “good”, with “outstanding” on the caring domain by the CQC, we now strive towards achieving outstanding in all 5 domains, we aim to do this by prioritising people and by recruiting highly skilled and knowledgeable staff whom are passionate about providing a high standard of patient care.&lt;/p&gt;\n&lt;p&gt;We need Staff Nurses who are able to create secure attachment relationships, and earn the trust and respect of patients who are likely to have had adverse experiences of authority figures. You will not be put off by rejection, and will see this as part of the process of building a therapeutic alliance.&lt;/p&gt;\n&lt;p&gt;Central to the role of Staff Nurse is your ability to maintain the ward ethos at all times. You will achieve this through your supervision of junior staff, clinical work, participating in staff meetings and patient meetings, as well as through experiencing quality managerial supervision and appraisals. We have also developed an ambitious training plan to equip you with everything you will need for your future career pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A role that will give you autonomy and leadership in the clinical area.&lt;/li&gt;\n&lt;li&gt;A role that will give develop your ability to resolve complex clinical dilemmas within a challenging clinical environment.&lt;/li&gt;\n&lt;li&gt;The opportunity to be part of a unit that not only prioritises people but works and demonstrates least restrictive practice by maintaining low levels of enhanced observations and low levels of other restrictive practices.&lt;/li&gt;\n&lt;li&gt;A competitive nhs nurse salary with enhancements for unsociable hours.&lt;/li&gt;\n&lt;li&gt;We will encourage learning and development and will support you to learn and gain additional skills which will enhance your role and job satisfaction.&lt;/li&gt;\n&lt;li&gt;Opportunities for further development and progress, we prepare and support you for your next role, within the role you will be working with senior nurses at times.&lt;/li&gt;\n&lt;li&gt;A supportive, knowledgeable and experienced leadership team within the centre.&lt;/li&gt;\n&lt;li&gt;A roster system that allows staff to request shifts to enhance work life balance.&lt;/li&gt;\n&lt;li&gt;A Trust induction as well as a focussed Forensic induction.&lt;/li&gt;\n&lt;li&gt;A ward that has a reputation for an excellent student nurse practice placement.&lt;/li&gt;\n&lt;li&gt;An experienced multi-disciplinary team to offer further clinical support to patients.&lt;/li&gt;\n&lt;li&gt;A working location that is beautiful and calming and with access to plentiful free parking.&lt;/li&gt;\n&lt;li&gt;Free gym access, shower facilities included.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you want to be part of a first class service and nurse leadership team we want to hear from you !&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post offers the Trust&#39;s £2000 Golden Hello for band 5 or 6 Nurses, or a relocation package up to a maximum of £2000 (subject to terms and conditions).&lt;/p&gt;\n&lt;p&gt;We are also aware that nationally there is a current shortage of RMNs which is why we want you to choose us. We have introduced the Hard to Recruit Premium for our band 5 and band 6 nurses. This supplement will follow the principles of Agenda for Change and will be based on the Fringe Allowance, which is 5% of salary or a minimum of £951 and a maximum of £1,649.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Loraine Hamilton - Matron&lt;/p&gt;\n&lt;p&gt;01323 444193&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Secure and Forensics, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239752", "validThrough": "2020-11-08T23:59:59+0000"}