{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/ £26,970/ £27,416/ £30,615"}}, "datePosted": "2020-10-15T18:35:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 5 Mental Health Facilitator&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for registered Mental Health Nurses to join our mental health facilitator team. The team works within Primary care and there are a number of posts within both the city and county PCN&#39;s.&lt;/p&gt;\n&lt;p&gt;Mental Health Facilitators are involved in improving long term outcomes for patients with mental health problems and you will be supporting primary care to carry out annual mental health reviews for patients and work towards achieving national targets set by NHS England.&lt;/p&gt;\n&lt;p&gt;This will also involve the assessment and promotion of good physical health outcomes for this group of patients .You will also be involved in the future development of the service and collaborative working between primary and secondary care services. This will involve assessment of mental health problems and the delivery of short term recovery orientated support to individuals aged 16 and over, of all cultural backgrounds.&lt;/p&gt;\n&lt;p&gt;Part of the role involves sign posting to other agencies and you will need to work closely with other healthcare professionals. As the post holder, you will also be expected to be flexible, adaptable to ongoing changes, participate in data collection and contribute to the improvement of the service.&lt;/p&gt;\n&lt;p&gt;You will need to be a driver and have a full driving licence and access to your own transport.&lt;/p&gt;\n&lt;p&gt;For more information please contact Emma Day, Team Manager, on 0116 2255700 or Emma.Day@leicspart.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LLR", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 5 Mental Health Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229214", "validThrough": "2020-11-20T23:59:59+0000"}