{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43000", "minValue": "33500", "unitText": "YEAR", "value": "£33,500 - £43,000 per annum"}}, "datePosted": "2020-10-22T13:28:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you want to be part of an exciting and innovative project focusing on the care of the older person with complex needs and frailty? If so we would like to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St. Luke’s Hospice are working in collaboration with Basildon and Brentwood Primary Care Networks (PCNs) developing a new service and enhancing the care for the older person within primary care. The role offers the opportunity for an experienced and knowledgeable specialist practitioner to join our team. This role will be based in Primary Care within member practices across the PCN.&lt;/p&gt;\n&lt;p&gt;The role requires a motivated practitioner with experience and knowledge of Primary and/or Community Care and the management of long term conditions. The post holder will be required to demonstrate a proactive approach to the provision of safe, effective and comprehensive support for older people living with complex needs/frailty.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to work as part of a PCN collaborating both with the general practice teams within the designated PCN and the Network Aligned Multi-disciplinary Team made up of community health (physical and mental) nurses and therapists, social care professionals and representatives of the voluntary sector.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible to the Assistant Director of Care and Quality at the Hospice but will be required to work closely with the Clinical Leads of the Primary Care Networks on the delivery of all elements and outcomes of the project. They will also demonstrate leadership and model best practice, around the maintenance of optimum support for the target population, to clinicians and care professionals within the teams they work with, as well as the wider Hospice and community workforce.&lt;/p&gt;\n&lt;p&gt;The person would be expected to possess excellent communication and interpersonal skills and have the ability to influence others in the provision of high quality standards of care for patients, their families and carers at all times, through innovative service delivery.&lt;/p&gt;\n&lt;p&gt;The post holder will require a high degree of professional autonomy and will need to be able to make critical judgments using expert knowledge, skills and experience in order to provide the highest standard of holistic care including complex symptom management to this patient population.&lt;/p&gt;\n&lt;p&gt;This post offers excellent opportunities for the candidate with regards to on-going self-development and access to further education.&lt;/p&gt;\n&lt;p&gt;A valid, clean driving license and use of own vehicle is essential.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this job opportunity or arrange an informal visit please contact Tracy Cunningham, Assistant Director of Care and Quality on:&lt;/p&gt;\n&lt;p&gt;tracycunningham@stlukeshospice.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St Luke's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132494"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Primarily based within the Primary Care Networks with integration at St. Luke’s Hospice Basildon", "postalCode": "SS16 5NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5613", "longitude": ".451789"}}, "title": "Advanced Practitioner for Older People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238663", "validThrough": "2020-11-06T23:59:59+0000"}