{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-£110,683+£2,162 per annum pro rata"}}, "datePosted": "2020-10-29T11:54:21+0000", "description": "&lt;p&gt;An opportunity has arisen for a part time consultant role in the Westminster Older Adults combined CMHT and HTT within CNWL NHS Foundation Trust. This will be a 5 session consultant role, offered initially on a 1-year fixed term contract from &lt;strong&gt;January 2021&lt;/strong&gt; (although timescales are up for negotiation). The post is a job share with the other substantive consultant within the team. The team is a well-established and well-regarded service offering mental health assessment and treatment to older adults throughout the entire borough of Westminster and is based near Victoria station with all the amenities and transport links afforded by Central London. The service is unique in offering an integrated CMHT and HTT function, allowing for smooth transition for patients experiencing a mental health crisis and is fully integrated with social services.&lt;/p&gt;\n&lt;p&gt;The post would be suitable for trainees completing their training consultants looking for a part time role. A CCT in old age psychiatry would be desirable, but the post may also suit applicants with general adult training who have an interest in older adults’ mental health.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role, please contact Alex Bailey on alex.bailey@nhs.net to arrange a further discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vauxhall Bridge Road", "postalCode": "SW1V 1DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4933", "longitude": "-.138736"}}, "title": "Consultant Psychiatrist in Old Age Psychiatriy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248199", "validThrough": "2020-11-19T23:59:59+0000"}