{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T15:46:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Practitioner in the Personality Disorders Hub &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; (open to qualified nurses, occupational therapists, and social workers) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 (full time, 12 Month-Fixed Term) Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work for an Outstanding NHS Trust, and an innovative and supportive service that is highly committed to decreasing stigma associated with personality difficulties, promoting optimism about recovery, and increasing access to evidence-based interventions? An exciting opportunity has arisen for qualified mental health practitioners to join the Northamptonshire Personality Disorder hub.&lt;/p&gt;\n&lt;p&gt;The Northants Personality Disorder Hub is a countywide specialist service that provides a Dialectical Behaviour Therapy (DBT) programme at two locations across the county, and leads on the delivery of Structured Clinical Management (SCM) across general mental health services. The service frequently delivers training to community and inpatient teams in order to enhance the capabilities of staff and promote the use of structured and psychologically-informed interventions across the Trust. It also has a growing Lived Experience Advisory Panel (LEAP) that is involved in promoting hope, improving services, and co-developing and delivering staff training.&lt;/p&gt;\n&lt;p&gt;The post holder will operate as a lead facilitator and coordinator of the service’s Understanding and Managing Emotions (U&amp;ME) groups within the Trust’s Urgent Care and Assessment Team (UCAT). U&amp;ME is an 18-week group-based skills development programme that aims to help individuals to learn a broader range of strategies for managing their emotions and be more effective in relationships. The group uses Dialectical Behaviour Therapy (DBT) materials and was developed to meet the needs of individuals who would have traditionally fallen through the gap between primary and secondary care services. This post will give the successful candidate the opportunity to work within UCAT (based in the South of the county) whilst being supported in their role by colleagues within the Personality Disorder Hub (e.g. being line-managed and supervised by the specialist service, attending/contributing to professional development activities within the Hub, and delivering staff training with other members of the team).&lt;/p&gt;\n&lt;p&gt;The post holder will primarily work within a multidisciplinary team to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide assessment to clarify individuals’ presenting difficulties and suitability for the U&amp;ME programme&lt;/li&gt;\n&lt;li&gt;Provide lead facilitation of group programmes within half of the county&lt;/li&gt;\n&lt;li&gt;Provide on-going support and direction to co-facilitators&lt;/li&gt;\n&lt;li&gt;Work in collaboration with colleagues within the Personality Disorder Hub to continue to develop the provision. The role will be accountable for ensuring effective needs assessment, development of group content that is responsive to the needs of service users and referring services/populations, and routine evaluation of the programme that demonstrates its outcomes/benefits beyond immediate clinical activity.&lt;/li&gt;\n&lt;li&gt;Assist colleagues in UCAT in developing treatment plans, the early identification of personality difficulties and providing guidance regarding appropriate onward referral and access to interventions across the personality disorder pathway.&lt;/li&gt;\n&lt;li&gt;Co-deliver training/education packages to enable colleagues in UCAT to deliver effective short-term interventions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience of working with people with personality difficulties and the ability to lead group-based interventions is required, as well as excellent collaboration and team-working skills, and a commitment to reduce exclusion and stigma for this client group and improve services.This post will give the successful candidate the opportunity to develop their capabilities under regular supervision and within a supportive and highly motivated multidisciplinary team that is led by a Consultant Clinical Psychologist.&lt;/p&gt;\n&lt;p&gt;The team comprises staff from a range of professional backgrounds (i.e. nursing, occupational therapy, and clinical psychology) and staff are supported to maintain professional links. There are also a range of development opportunities due to the service’s role in training others, its strong internal CPD programme and commitment to reflective practice, and the integrated nature of Psychology Services across NHFT.&lt;/p&gt;\n&lt;p&gt;The Northants Personality Disorder Hub is based in Northampton and the role will involve being located in the Northampton UCAT base. Travelling and some cross over working across the north and south of the county will be involved; applicants will be expected to hold a valid UK driving licence and the use of a car. Applications for part-time hours will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Bandana DattaJob titleSenior Clinical PscyhologistsEmail addressBandana.Datta@nhft.nhs.ukTelephone number01604 658834Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed – please contact Dr Bandana Datta, Senior Clinical Psychologist on 01604 658834 or 07564 851371&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Campbell House, Northampton", "postalCode": "NN1 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2411", "longitude": "-.896195"}}, "title": "Specialist Practitioner in the Personality Disorders Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247241", "validThrough": "2020-11-11T23:59:59+0000"}