{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-28T17:15:12+0000", "description": "&lt;p&gt;We are looking for a highly motivatedpaediatricstaff nurse to join ourOutpatient team. The successful candidate will be based in Outpatients in our child friendly hospital in the park and will work in collaboration with dynamic multi-professional teams.&lt;span&gt;Some of our specialities include general paediatrics, endocrinology, diabetes, rheumatology, allergy, respiratory, gastroenterology, neurology, cardiology, ophthalmology, paediatric surgery, urology, orthopaedics, plastics, spinal, gynaecology and ENT.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This makes Outpatients a greatopportunity forexposure to a range of clinical specialitiesfor paediatric nurses who wish to broaden their experience of multiple specialities and as an opportunity to decide which specialty they may want to pursue in their future career.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Youwill possess excellent communication skills and have experience of team and autonomous working. Competency in Paediatric phlebotomy is highly desireable for this post, howeverfull training will be provided for candidates without this skill. A full preceptorship and clinical competency package will be offered to the successful candidate.&lt;/p&gt;\n&lt;p&gt;A kind and caring nature, accompanied by a commitment to deliver care to the highest standard to promote a positive patient experience is essential for this post.&lt;/p&gt;\n&lt;p&gt;The position is permanent, 37.5 hours per week andthe post holder will be expected to work flexibly across the 5 day working weekbetween the Outpatient opening times of 08:00-18:00 according to service needs. For further information about this vacancy please contact Andrea Williams Nurse Manager (0151 228 4811 ext 3765)&lt;span&gt;or Clinic Manager Christine Jackson (0151 228 4811 ext 2420)&lt;/span&gt; &lt;span&gt;Clinic Manager Marie Monk (0151 228 4811 ext 2206)&lt;/span&gt; &lt;span&gt;Clinic Manager Julie Dwyer (0151 228 4811 ext 2778)&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247471", "validThrough": "2020-11-12T23:59:59+0000"}