{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43041", "minValue": "33222", "unitText": "YEAR", "value": "33,222.00 to 43,041.00"}}, "datePosted": "2020-11-02T16:30:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Immunisation Team Leader&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Virgin Care, we’ve created a working environment whereeveryone can really feel the difference.&lt;/p&gt;\n&lt;p&gt;It’s the kind of place where nothing’s too much trouble. Where our serviceis seamless. Where you’ll feel empowered, listened to, valued and where we’llsupport you to bring your best self to work every day. And that’s just the beginning.&lt;/p&gt;\n&lt;p&gt;Since 2006, we’ve delivered innovative and refreshing health and socialcare services to millions of people by developing ourown unique approach where ourservice users are at thecentre of everything we do. And right now, we’re looking fora&lt;strong&gt;Team Leader&lt;/strong&gt;tojoin ourImmunisation serviceto help us continue to change things for the better.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a permanentpart time (22.5 hours per week) position tooperationally managethe immunisation service across Devonareabased at one of the offices acrossDevon (to be agreed at interview).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with colleagues in NHS England andPublic Health, as well as partners in the multiagency arena.You’ll care forpatientsand their families in the way thatyou believe is best, delivering our high service standards, sharing bestpractice, and actively improving the way we work.&lt;/p&gt;\n&lt;p&gt;Evidence of leadership skillswill be required along with strong communication and organisation skills, and a flexible approach will ensureyou deliver positive experiences topatientsat every stage of theirhealthcare journey. Essential to this role isNMC registrationalong with 2 years post registration experience at Band 6 level or above.&lt;/p&gt;\n&lt;p&gt;But what’s in it for you? Well, we offer a competitive salary andNHSpension, lots of training and development, great perks including being part of theVirgin Tribe giving access to exclusive offers as well asdiscounts on Virgin products and services,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contactCharlotte ForwardonCharlotte.Forward@virgincare.co.ukor07976 751729for further information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Virgin Care are committed to equal opportunities and welcome a broad diversity of talent to apply.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Devon", "postalCode": "EX2 4NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7195", "longitude": "-3.51201"}}, "title": "Immunisation Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252857", "validThrough": "2020-11-16T23:59:59+0000"}