{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-04T15:01:14+0000", "description": "&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and wellbeing. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;We require an Administrator within the Psychological Wellbeing Service (PWS) based at Chesterton Medical Centre, Cambridge.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to provide a comprehensive administrative service within the team supporting a range of clinical staff. Duties will include covering the telephones, booking appointments for clinicians and with patients over the telephone, processing referrals, maintaining waiting lists, typing of minutes and other general administrative duties.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with strong administrative skills including strong IT including knowledge of Teams and One Note, you will also have excellent communication skills. We have a large supportive team and require someone who has experience of working in a clinical setting. The ability to travel to other Trust sites may be required to provide cross cover at other PWS sites.&lt;/p&gt;\n&lt;p&gt;As part of this role and if you meet the eligibility criteria there will be the opportunity to complete a Level 2, 3 or 4 Apprenticeship qualification in Business and Administration. As part of the apprenticeship you will achieve a national recognised qualification and gain experience in administration in a health care setting. An apprenticeship is a framework of qualifications made up of an NVQ, Technical Certificate and Functional Skills in Mathematics and English. Undertaking an apprenticeship qualification is a great way to progress onto the next step on your career pathway.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Alice Cormie - Senior Administrator -Alice.Cormie@cpft.nhs.uk - 01223 458894&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Psychological Wellbeing Service, Cambridge", "postalCode": "CB4 1PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2194", "longitude": ".135919"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256344", "validThrough": "2020-11-11T23:59:59+0000"}