{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109749", "minValue": "95826", "unitText": "YEAR", "value": "£95,826 - £109,749 pa in HCAS plus on call"}}, "datePosted": "2020-11-02T16:16:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Deputy Chief Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are passionate about healthcare and focused on professionalism and excellence? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you ready to join a high performing senior nursing team working towards outstanding care for patients?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to make a difference and be part of an exciting leadership team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an exceptional nurse leader to join us and help shape the future of our committed and dedicated Nursing and AHP staff; building on the great work already started.&lt;/p&gt;\n&lt;p&gt;This role is additional to the Deputy Chief Nurse already in post. Working with the Chief Nurse and Deputy you will be instrumental in helping to further develop the nursing and AHP strategies and develop systems to grow and retain the workforce; building new roles and attracting new people to join our friendly caring teams.&lt;/p&gt;\n&lt;p&gt;This role will particularly focus on supporting the Chief Nurse to further refine governance and reporting structures in the Nursing/Midwifery and AHP workforce and develop and implement robust monitoring systems, to demonstrate excellence in clinical care. The post holder will also have oversight of the trust’s temporary nurse/midwifery/AHP workforce&lt;/p&gt;\n&lt;p&gt;You will need an eye for detail and be passionate about fundamental nursing standards. If you think you are up to a challenge and want to work in a rewarding environment, we would like to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Carshalton/Epsom", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Deputy Chief Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252808", "validThrough": "2020-11-16T23:59:59+0000"}