{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T13:16:13+0000", "description": "&lt;p&gt;An opportunity has arisen for Band 6 Senior Staff Nurse vacancies within the Assessment Unit at Cardiff and Vale UHB.&lt;/p&gt;\n&lt;p&gt;The Combined Assessment Unit is a 27 trollied area, which consists of a high care area, an ambulatory area for specialty patients and a Medical Emergency Ambulatory Care Unit for GP referrals. The unit assesses patients of all specialties including medical, surgical, renal and cardiology. Patients that attend the unit are referred from multiple sources including the Emergency Unit and Primary Care.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from qualified Level 1 Registered Nurses who have significant nursing experience and can demonstrate substantial knowledge within this field of expertise.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to manage flow within specific areas of the Assessment Unit and develop skills around managing the unit as a whole, providing effective leadership and management of the nursing team in an environment which is complex and pressurised.&lt;/p&gt;\n&lt;p&gt;You will require excellent communication and clinical skills, significant evidence of CPD and show passion and enthusiasm for working in Acute Medicine.&lt;/p&gt;\n&lt;p&gt;This is a wonderful career opportunity to further enhance both managerial and clinical skills. If you welcome change, innovation in a challenging but rewarding environment we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this further, visit or undertake a shadow shift, please contact the unit manager, Sister Elinor Gerrard on 02920742323.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University hospital of Wales, Cardiff", "postalCode": "CF14 3UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.499", "longitude": "-3.19007"}}, "title": "Senior Staff Nurse, AU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257829", "validThrough": "2020-11-19T23:59:59+0000"}