{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro rata"}}, "datePosted": "2020-11-03T09:00:15+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Bank Physiotherapist&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;Are you looking for a change of area or simply need more flexibility to manage your work/life balance? Then working for the Trust Bank may be just the answer!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust Bank are looking for Registered Physiotherapists to join the Trust Temporary Staffing Bank.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Torbay and South Devon NHS Foundation Trust is an Integrated Care Organisation, which means that the health and care community works together to deliver more integrated care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust Bank provides cover to Torbay Hospital, community health services and adult social care. The Trust runs Torbay Hospital, five community hospitals and provides health and social care in Dawlish, Teignmouth, Totnes, Dartmouth, Torbay, Newton Abbot, Ashburton, Bovey Tracey and the surrounding area.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The Trust Bank matches when you want to work with the requirements of service and includes acute clinical environments, domiciliary care, adult residential and day care, learning disability services and community hospitals.&lt;br /&gt; &lt;br /&gt; It is essential that you can be flexible in your work availability as this increases the chances of us matching shift requirements to your availability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will be reliable, self motivated and able to work as a member of a team to provide high level patient care in a variety of clinical settings in both the acute and community-based hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are looking for flexible work that can fit around your other commitments, then this could be just what you&#39;re looking for. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service we offer:&lt;/p&gt;\n&lt;p&gt;         Competitive pay&lt;/p&gt;\n&lt;p&gt;         First choice of available shifts&lt;/p&gt;\n&lt;p&gt;         Paid annual leave&lt;/p&gt;\n&lt;p&gt;         Access to the NHS pension scheme&lt;/p&gt;\n&lt;p&gt;         Free training and development opportunities&lt;/p&gt;\n&lt;p&gt;         Experience gained by working on various wards across the Acute Hospital and    Community Hospitals&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;How to join the Trust Bank:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Registration follows a rigorous recruitment process following NHS Employment Check Standards.  The length of time it will take depends on your availability to attend and complete the interview process, the time taken to receive your references and DBS disclosure. We need your help in working with us to keep this duration to a minimum.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;YOU book your interview&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;YOU complete the Occupational Health and DBS forms&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;YOU attend your assessment day, which includes an interview, knowledge assessment, identity and eligibility to work document checks&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;YOU tell your referees that we will be contacting them to obtain references and ask them to reply quickly&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;WE contact your references&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;WE complete Occupational Health checks&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;YOU receive your DBS disclosure and submit to us&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You complete your practical mandatory training&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;WE send you details on how to book shifts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We will confirm registration once all employment checks are completed&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you would like further information please contact our Recruitment Team and we would be happy to answer any queries you have.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Students who are due to qualify and are awaiting HCPC Registration are welcome to apply for this post. Please state yes when asked if HCPC registered and select the option awaiting registration to demonstrate student status.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TORQUAY", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Bank Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253195", "validThrough": "2020-11-30T23:59:59+0000"}