{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-19T16:00:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse (Band 5)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;3 part time permanent posts available 2 x 30 hours 1 x 32 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Band 5 Registered Nurses to join our dynamic, highly skilled newly merged team within Older Peoples Mental Health and Frailty wards&lt;/p&gt;\n&lt;p&gt;Two multidisciplinary wards, where you can be an autonomous practitioner whilst working alongside consultants, therapists and social workers have temporarily begun working together in one environment to provide holistic and joint up care for our patient groups. Windermere Lodge and Coniston Lodge are based at the Tickhill Road Hospital site and specialize in the assessment and treatment of patients diagnosed with Dementia/Alzheimer’s disease, patients diagnosed with a functional disease and also the new development of our frailty model that encompasses all age adults who meet our frailty pathway.&lt;/p&gt;\n&lt;p&gt;You will need or be supported to use clinical skills, assessment skills, and be able to plan and co-ordinate the patients care. You will have named nurse responsibilities and be fully involved in multidisciplinary meetings.&lt;/p&gt;\n&lt;p&gt;As part of your continuous professional development we will support your career pathway either into management, specialist practitioner, nurse prescribing, managing long term conditions and mentorship.&lt;/p&gt;\n&lt;p&gt;Other benefits of coming to work with us are free staff car parking and opportunities to rotate to other wards and to join our extensive nurse bank.&lt;/p&gt;\n&lt;p&gt;If you are committed to the delivery of quality services, communicate effectively and enjoy working as part of a dynamic, forward thinking multi-disciplinary team we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cheryl Kitchin Ward Manager – 01302 798026 Windermere Lodge&lt;/li&gt;\n&lt;li&gt;Email cheryl.kitchin@nhs.net&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 8QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4948", "longitude": "-1.14598"}}, "title": "Staff Nurse (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233041", "validThrough": "2020-11-14T23:59:59+0000"}