{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28526", "minValue": "28526", "unitText": "YEAR", "value": "£16.97 Per Hour"}}, "datePosted": "2020-10-28T10:37:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title:Complaints Investigation Officer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt;Nottingham University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Queen&#39;s Medical Centre, Derby Rd, Lenton, Nottingham NG7 2UH&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift pattern:&lt;/strong&gt;9am-5pm weekdays but there will be flexibility in the working pattern to support delivery of the role requirements&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration&lt;/strong&gt;: 5 Months subject to review&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rate per hour: £16.97 Per Hour + Accrued holiday pay&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Nottingham University Hospitals NHS trust was Rated ‘Outstanding’ in ‘Well Led’ by the CQC and is home to some of the world’s leading clinicians and experts&lt;/p&gt;\n&lt;p&gt;Are you a person passionate about health care and want to make a difference?&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a &lt;strong&gt;Complaints Investigation Officer &lt;/strong&gt;at Nottingham University NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To manage a complaint investigation caseload, supporting Senior Complaints Coordinators in sharing current investigation workload.&lt;/li&gt;\n&lt;li&gt;To support Divisional Nurses, Matrons and Clinical Teams to expedite complaint investigations and local reviews. This may involve supporting meetings with staff to undertake a review of clinical records, producing a chronology and timeline of events, and supporting the gathering of evidence e.g. staff statements within the investigation process.&lt;/li&gt;\n&lt;li&gt;To co-ordinate complaint investigations in line with our 4C’s policy and local complaints resolution processes.&lt;/li&gt;\n&lt;li&gt;To act as a conduit between the complaints team and operational services, providing complaint investigation support by working in collaboration with investigators and Senior Complaints Coordinators.&lt;/li&gt;\n&lt;li&gt;To ensure complaint investigations are managed effectively and responded to within agreed timescales.&lt;/li&gt;\n&lt;li&gt;To facilitate meetings with bereaved families providing effective family liaison support.&lt;/li&gt;\n&lt;li&gt;To complete the typing, quality checks, review, and finalisation of complaint response letters within agreed timescales before Senior Management/ Executive review.&lt;/li&gt;\n&lt;li&gt;Work with the Complaints Senior Coordinators and Managers to identify and build their caseload&lt;/li&gt;\n&lt;li&gt;To effectively manage a complaints investigation caseload to support Divisional Nurses, Matrons and Clinical Teams to expedite complaint investigations and local reviews. This may involve supporting meetings with staff to undertake a review of clinical records, producing a chronology and timeline of events, and supporting the gathering of evidence e.g. staff statements within the investigation process&lt;/li&gt;\n&lt;li&gt;Work autonomously and in partnership with others on complex and multifaceted&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over&lt;strong&gt;£70 million&lt;/strong&gt;each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Complaints Investigation Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246122", "validThrough": "2020-11-13T23:59:59+0000"}