{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-30T16:16:24+0000", "description": "&lt;p&gt;We are offering the opportunity to the right candidate to compliment our very successful integrated community team for a 1 year secondment in the post of Therapy Manager. You will operationally manage a team of Occupational Therapists ( OT), Physiotherapists ( PT) , Rehabilitation support workers, supported by your clinical leadsfor OT, PT and UCR/Frailty. You will work closely with the Community Services manager (CSM) with the opportunity to lead on projects/initiatives both within Therapy and the wider Primary Care Network as appropriate.&lt;/p&gt;\n&lt;p&gt;Our Therapy team forms part of the integrated health and social care team comprising of Urgent Community Response, Health and Wellbeing coaches, Adult Social Care, Community Nursing and the inpatient ward at Exmouth Community Hospital.&lt;/p&gt;\n&lt;p&gt;We are requiring an HCPC registered Allied Health Professional (OT/PT) with experience of working within integrated community services, an awareness of the integration agenda and current drivers within community health and social care. You will be able to demonstrate operational management experience on which you wish to build, together with advanced skills in emotional intelligence – with the ability to understand people, motivate and work alongside to deliver an effective and timely service with well trained, prepared and happy staff. You will be effective in empowering your team leads and promoting innovative ways of working and seek opportunities “outside the box”.&lt;/p&gt;\n&lt;p&gt;If you believe you meet the specification, we would be keen to hear from you.&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;(This is a fixed term contract for 12 months.  For current NHS Employees this post could be a secondment opportunity)&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exmouth", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Therapy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250892", "validThrough": "2020-11-13T23:59:59+0000"}