{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52262", "minValue": "32712", "unitText": "YEAR", "value": "£19.46 - £31.09 per hour"}}, "datePosted": "2020-11-04T13:54:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Partnering Health Limited&lt;/strong&gt; has an exciting opportunity for a&lt;strong&gt; Senior Clinical Advisor &lt;/strong&gt;to join the team based in Whiteley&lt;strong&gt;. &lt;/strong&gt;You will join us on a part time, permanent basis and you will receive a highly competitive salary&lt;/p&gt;\n&lt;p&gt;Partnering Health Limited is an established healthcare company dedicated to offering quality solutions and services to NHS and private healthcare partners. All our staff work hard to deliver exceptional patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Senior Clinical Advisor role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Clinical Practitioner at Partnering Health Limited (PHL), and as an integral team member, your role is accountable for assessing callers with a wide spectrum of complex clinical conditions, providing safe and effective advice and information, including home care management and onward referrals as appropriate. Ensuring the delivery of a high standard of care and respect in providing quality, evidence-based health care to meet the immediate needs of the patient.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Clinical Advisor&lt;/strong&gt; &lt;strong&gt;Key Accountabilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Possess strong clinical skills and sound judgement appropriate to the demands of the service which will be underpinned by experience and theoretical knowledge. Exercise a high degree of professional autonomy, critical judgement and refer to other members of the multidisciplinary team as appropriate.&lt;/li&gt;\n&lt;li&gt;To undertake telephone clinical assessment, providing advice and, if necessary, onward referral to the appropriate agency/professional, for people with a wide range of conditions.&lt;/li&gt;\n&lt;li&gt;To critically analyse complex information alongside professional skills, knowledge and experience. To negotiate with patients the most appropriate course of action to meet their immediate health needs.&lt;/li&gt;\n&lt;li&gt;To competently deal with emergency situations and initiate emergency care when presented with life-threatening conditions, ensuring an immediate response from the emergency services.\n&lt;ul&gt;\n&lt;li&gt;Provide and administer required treatment and involve other medical staff as necessary.&lt;/li&gt;\n&lt;li&gt;Undertake non-medical prescribing as and when appropriately trained in conjunction with telephone triage.&lt;/li&gt;\n&lt;li&gt;Actively participate in investigation of incidents, complaints or accidents as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Clinical&lt;/strong&gt; &lt;strong&gt;Advisor&lt;/strong&gt; &lt;strong&gt;Skills and Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered with NMC / HCPC or other suitably qualified healthcare professional&lt;/li&gt;\n&lt;li&gt;At least three year post-qualified&lt;/li&gt;\n&lt;li&gt;At or working towards Degree qualification / or equivalent experience&lt;/li&gt;\n&lt;li&gt;Experience of working in one or more of the following settings: Primary Care; Ambulance Service; Community; OOH; NHS 111; other urgent care services&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills – written, verbal (Particularly listening skills)&lt;/li&gt;\n&lt;li&gt;Clear understanding of Professional responsibility and accountability&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Salary: £25.26 - £31.09 depending on hours and shifts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiteley", "postalCode": "PO8 8DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8939", "longitude": "-1.01816"}}, "title": "Senior Clinical Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256085", "validThrough": "2020-11-18T23:59:59+0000"}