{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 p.a inc with Fringe HCAS"}}, "datePosted": "2020-11-04T14:46:40+0000", "description": "&lt;p&gt;This post offers a very exciting opportunity to contribute to the establishment of a high quality multidisciplinary perinatal mental health service within our female prison service. This service will be made up of Consultant Psychiatry, Occupational therapy, Nursing and Clinical Psychology. This service aims to offer mental health assessment and treatment to women during pregnancy, who give birth while in custody and those who reside with their infants on the Mother &amp; Baby Unit at HMP Bronzefield. There will be a strong focus on trauma-informed psychological approaches and there will be opportunity for direct clinical work as well as working with system around the women in the perinatal period.&lt;/p&gt;\n&lt;p&gt;We are keen to recruit a confident and compassionate Occupational Therapist with experience of working with women with complex needs in the perinatal period. We want to see someone who will work well with a range of professions, both within the MDT and with the wider prison staff, midwifery services and voluntary organisations.&lt;/p&gt;\n&lt;p&gt;Experience of working in perinatal services or CAMHS would be advantageous. In addition, awareness and experience of working with child loss and separation would be of value.&lt;/p&gt;\n&lt;p&gt;The service will operate across 4 women’s prisons, (HMP Bronzefield, HMP Send, HMP Downview and HMP East Sutton Park).&lt;/p&gt;\n&lt;p&gt;This post will primarily be based at HMP Bronzefield but travel between sites will be part of the role. The post attracts HCAS.&lt;/p&gt;\n&lt;p&gt;It is anticipated interviews will be via videoconferencing (Zoom) date to be confirmed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma HolmesJob titleHead Occupational Therapist for Offender CareEmail addressemma.holmes6@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Emma Holmes, Head Occupational Therapist for Offender Care emma.holmes6@nhs.net or Dr Christy Pitfield, Senior Clinical Psychologist christypitfield@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Bronzefield, Ashford", "postalCode": "TW15 3JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4338", "longitude": "-.481175"}}, "title": "Occupational Therapist - Perinatal Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256294", "validThrough": "2020-12-02T23:59:59+0000"}