{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-05T16:01:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse - Emergency Department - various hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Stockport NHS foundation Trust we are proud that we care for our people as much as our patients , whether you’re a student nurse or already qualified and looking to return to the profession, we’d love you to join us within our Emergency Department here at Stepping Hill hospital.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our hardworking and dynamic nursing team in the Emergency Department where every day is different, and always something new to learn. Here at SFT we have both adult and paediatric services. We are a Multidisciplinary team with our own Advanced Clinical Practitioner and Emergency Nurse Practitioner team.&lt;/p&gt;\n&lt;p&gt;As a staff nurse at SFT you’ll be expected to work within the NMC code of Professional Conduct working throughout the department in Majors Assessment, Minors, our Rapid Assessment Unit (Ambulance Triage) and Resuscitation to ensure that all our patients are seen efficiently and effectively, meeting all their clinical needs within the 4 hour target.&lt;/p&gt;\n&lt;p&gt;We show our commitment to our teams through excellent development and progression opportunities, starting with a comprehensive Induction programme, so we’re proud to nurture and support our nurses to provide the very best care. In return, you’ll deliver our values, we care, we respect and we listen. &lt;br /&gt;&lt;br /&gt;You will be part of a dynamic and friendly team who together strive to achieve the best patient outcomes and deliver the highest standard of care to all of our patients.&lt;br /&gt;&lt;br /&gt;To succeed, you will need to be committed to delivering high quality, patient focused care with pride and respect, have excellent interpersonal skills and be able to provide evidence of personal and professional development. &lt;br /&gt;&lt;br /&gt;For newly qualified nurses the Trust has a robust preceptorship programme and you will receive excellent opportunities for development. Along the way, you will be supported by in-house clinical educators and a dedicated senior nursing team who will oversee your training needs, supported by the wider divisional education team.&lt;/p&gt;\n&lt;p&gt;SFT is committed to promoting equality of opportunity, celebrating and valuing diversity and eliminating any form of unlawful discrimination across our workforce, ensuring our people are truly representative of the communities we serve.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Philippa Oliver / Leanne Mulholland - Matron - 0161 914 5826&lt;/p&gt;\n&lt;p&gt;Phillipa.Oliver@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;Leanne.Mulholland@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;Anya Dykins - Lead Nurse - 0161 914 4142&lt;/p&gt;\n&lt;p&gt;anya.dykins@stockport.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Registered Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258486", "validThrough": "2020-11-12T23:59:59+0000"}