{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-11-05T20:30:24+0000", "description": "&lt;p&gt;We are looking for an exceptional Business Manager to join the Surgery Divisional Management team at The Royal London Hospital.&lt;/p&gt;\n&lt;p&gt;The post sits within the largest and most complex directorate in one of the largest and most complex Trusts in the country, this is both a challenging and exciting place to work. While we face the same financial and performance pressures as all NHS Trusts, we are undertaking significant projects to improve healthcare delivery through the We Improve Programme.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the effective and efficient operation of the Divisional office, including diary management, secretarial support, report and presentation writing. You will also have the opportunity to lead on improvement projects within the Divisional Management Team. You will be dealing with a variety of teams across the organisation and will need to be able to prioritise effectively. You will have exceptional organisation skills and be able to meet competing deadlines.&lt;/p&gt;\n&lt;p&gt;Reporting into the Divisional Manager and working closely with the Divisional Management Team, you will support teams in delivering high quality services, provide an excellent experience for our patients and meet our regulatory and operational performance targets. &lt;br /&gt;&lt;br /&gt;This is an excellent opportunity in a high profile organisation providing stretch, development and challenge for the successful candidate. The roles are well supported by both the Divisional Manager and Divisional Director as well as the wider management team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Christopher Kennedy &lt;br /&gt;Divisional Manager – Surgery, Peri-operative Medicine, Critical Care and Dental&lt;br /&gt;christopher.kennedy2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Business Manager - Surgery Division", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258804", "validThrough": "2020-11-19T23:59:59+0000"}