{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum (pro rata)"}}, "datePosted": "2020-10-23T15:46:05+0100", "description": "&lt;p&gt;We have exciting opportunities for a Band 6 Occupational Therapist within our Community Hospital Frailty team. The role will cover frailty, general medicine, older person’s medicine and palliative care.&lt;/p&gt;\n&lt;p&gt;We are looking for Occupational Therapists who are keen to gain clinical experience as a Band 6 within a forward thinking and supportive Adult Therapy Service you will be part of a well led, dynamic and friendly team consisting of Occupational Therapists, Physiotherapists and Therapy Assistants, who constantly strive for integrated working – optimizing patient care and team morale. The team works together to achieve both positive patient experience and outcomes.&lt;br /&gt;&lt;br /&gt;As part of an integrated therapy service you may report to a Band 7 Physiotherapist or Occupational Therapist team lead in your clinical area. In all areas you will be able to access senior OT professional support and opportunities for clinical and professional training and development. There will be opportunities to enhance skills in cognitive and behavioural assessments as part specialist occupational therapy training.&lt;br /&gt;&lt;br /&gt;Working as an autonomous clinician and as an integral part of the Multidisciplinary team (MDT) you will be responsible for assessing patients, discussing patient agreed goals and expectations, deliver highly skilled treatments and provide education for patients and carers. You will also be responsible for ensuring safe and timely discharges for patients in each of the clinical areas.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will be confident with appropriate NHS experience, clearly able to demonstrate a desire to actively participate in all aspects of the role. They must be willing and able to lead on various elements of the work in this exciting and demanding acute area of OT. The successful candidate must be an effective team player with excellent communication and organizational skills. They will be able to demonstrate clear clinical reasoning and have the ability to explain their decisions and actions in a way that all concerned will be able to understand. They must also be able to demonstrate evidence of recent learning and examples of continued professional and clinical development.&lt;br /&gt;&lt;br /&gt;The role will enable the development of a broad range of skills to support your career progression. Band 6 level role will provide you with a well-rounded set of clinical skills and an opportunity to promote the value and positive impact Occupational Therapy can have on people’s lives. Many OT skills are transferable between clinical settings therefore increasing both your career prospects in the future: we actively encourage and support succession from Band 6 to Band 7 Occupational Therapist. &lt;br /&gt;&lt;br /&gt;As a service we offer:&lt;br /&gt;&lt;br /&gt;• Regular supervision&lt;br /&gt;• Opportunities for professional &amp; personal development&lt;br /&gt;• Service Development opportunities&lt;br /&gt;• In-service training &amp; post graduate education&lt;br /&gt;• Clinical Supervision&lt;br /&gt;• Multidisciplinary team and uni-profession meetings&lt;br /&gt;• Flexible Working&lt;br /&gt;• Good multidisciplinary working&lt;br /&gt;• Regular staff integration and social events and Therapy Staff recognition awards.&lt;br /&gt;• NHSP Bank work opportunities&lt;/p&gt;\n&lt;p&gt;*MSE offer NHS Fringe Allowance and hospital accommodation for applicants wishing to relocate is available subject to availability.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Diane Parkins&lt;/p&gt;\n&lt;p&gt;Professional Lead Occupational Therapist&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Email address:&lt;/p&gt;\n&lt;p&gt;diane.parkins@btuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDiane ParkinsJob titleIntegrated therapy leadEmail addressdiane.parkins@btuh.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Occupational Therapist Frailty at Brentwood Community Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241167", "validThrough": "2020-11-06T23:59:59+0000"}