{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-14T10:15:22+0100", "description": "&lt;p&gt;Would you like to work with a dedicated multidisciplinary mental health team based in the beautiful New Forest? Are you someone who wants to deliver the best possible care and be part of a service committed to supporting its staff, patients and carers? If so, then we have the job opportunity you are looking for and would love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a 1.0 wte Band 8a Principal Psychologist. The role will involve direct clinical work, team working and service development. You will undertake specialist psychological assessment, formulation and evidence-based interventions (both individually and in group) with people experiencing a range of complex mental health issues. The post is based at Waterford House in New Milton, though also involves close working with the New Forest East CMHT in Totton. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants should have previous experience of working in adult mental health teams in the NHS. Excellent communication skills are vital, together with the ability to provide psychological consultation, training and supervision. Knowledge and skills in providing psychological therapies with people who present with severe and enduring mental health difficulties, including psychosis and/or personality disorder, are also essential. The post could be considered as a preceptorship opportunity for the right applicant wishing to develop into an 8a role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining the South West Hampshire Psychological Therapies Team. We are a friendly and supportive team of clinicians, who pride ourselves on delivering high quality care and promoting recovery. You will receive regular supervision from a senior psychologist, as well as having opportunities for peer supervision. Continuing professional development is actively supported, with all staff encouraged to become accredited within at least one therapeutic modality. Within the service, we offer a range of interventions, including: Cognitive Behaviour Therapy (CBT), Dialectical Behaviour Therapy (DBT), Cognitive Analytic Therapy (CAT), Acceptance and Commitment Therapy (ACT), Compassion Focused Therapy (CFT) and Eye Movement Desensitization and Reprocessing (EMDR).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have strong links with the University of Southampton, particularly with the Doctoral Programme in Clinical Psychology, the MSc/Diploma in Cognitive-Behavioural Therapy for Severe Mental Health Problems and training courses for IAPT. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome informal enquiries and visits. If you would like to discuss the post in more detail, please email Dr Donna Rutherford (AMH Community Lead Psychologist) at donna.rutherford@nhs.net in the first instance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Forest West Community Mental Health Team, South West Hampshire Division", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Principal Clinical / Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225632", "validThrough": "2020-11-30T23:59:59+0000"}