{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907"}}, "datePosted": "2020-11-02T16:20:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; BAND 5£24,907 (post will be pro rata)&lt;br /&gt; Falls and Parkinson&#39;s Clinics Clara Cross Centre St Martins HospitalBath&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you aphysiotherapist looking for a part -time non rotational post in Falls and Parkinson&#39;s based inaCommunity Hospital in BathAre you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Band 5 Physiotherapistdelivering NHSservices with us you will receiveAfC 19/20 salary and terms and conditionsincluding an NHS pension We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers on Virgin Products such as holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have aphysiotherapy degree qualification, or equivalent, and be registered with the Health and Care Professions Council&lt;/p&gt;\n&lt;p&gt;As thePhysiotherapistyou willjoin a supportive and forward thinking multidisciplinary team which delivers a Falls Clinic and a Parkinsons clinic.&lt;/p&gt;\n&lt;p&gt;You will be supported by a senior physiotherapist and will also work with a rotational physiotherapist and support workers. You will carry out individual and group work, including exercise classeswhen thesituation allows. Remote working is used asrequired as you will work both in clinic and in patient’s homes - in turn,It is essential that you are able to drive and have access to a car for work.&lt;/p&gt;\n&lt;p&gt;Regular supervision and ongoing training are provided and this is an excellent opportunity to build specialist knowledge and skills in these clinical areas.&lt;/p&gt;\n&lt;p&gt;Working within theFalls andParkinson&#39;steam, asa Physiotherapist with Virgin Care you will use your experience to deliver excellent patient care and where appropriate guide others. Our role offers you a real opportunity to add value to the local community and broadenyour experience.&lt;/p&gt;\n&lt;p&gt;The rolewill also involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering of high quality, individualised, evidenced based care to all patients&lt;/li&gt;\n&lt;li&gt;To maintain accurate records in line with the Chartered Society of Physiotherapy standards&lt;/li&gt;\n&lt;li&gt;Maintaining confidentiality, privacy and dignity of patients&lt;/li&gt;\n&lt;li&gt;Learning, developing and adapting to change evidenced in CPD&lt;/li&gt;\n&lt;li&gt;Operating in a team and contributing to team decisions&lt;/li&gt;\n&lt;li&gt;Managing own caseload and prioritising&lt;/li&gt;\n&lt;li&gt;Teaching of patients, carers and peers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as an education in physiotherapy and a HPC registration, we are looking for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Motivation, adaptability and innovation&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly across specialities as need arises&lt;/li&gt;\n&lt;li&gt;Ability to carry out a range of assessments and procedures in order to make a clinical diagnosis (in relevant clinical speciality)&lt;/li&gt;\n&lt;li&gt;Ability to identify and set clinical goals with patient and / or carer&lt;/li&gt;\n&lt;li&gt;Use of clinical outcomemeasures and awareness of relevant ones for speciality&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contactRuth Sampsonand Christina RIng via email:vcl.bathnesfallsclinic@nhs.net&lt;/p&gt;\n&lt;p&gt;We plan to hold interviewson the20th Octoberso please let us know in your application if you won’t be available. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people inBath and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Falls and Parkinson&#39;s Clinics Clara Cross Centre St Martins Hospital Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252822", "validThrough": "2020-11-16T23:59:59+0000"}