{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267 pa plus HCAS"}}, "datePosted": "2020-11-05T21:45:13+0000", "description": "&lt;p&gt;Do you want to make a difference?&lt;/p&gt;\n&lt;p&gt;Yes?&lt;/p&gt;\n&lt;p&gt;Then come and join our dynamic 0-19 universal Teams in the vibrant and diverse London Borough of Barking and Dagenham.&lt;/p&gt;\n&lt;p&gt;We are looking for ambitious, enthusiastic and energetic Health Visitors to work within our North Locality based in Dagenham. We want candidates who share our values and our vision for high quality personalised Health Visiting Service.&lt;/p&gt;\n&lt;p&gt;We are part of an accountable care community and this aligns us with GP Services and other partners&lt;/p&gt;\n&lt;p&gt;We offer great opportunities for learning and development, providing a bespoke induction programme, preceptorship for the newly qualified Health Visitors and a commitment to supervision and appraisal.&lt;/p&gt;\n&lt;p&gt;The Health Visitors lead on the delivery of the Healthy Child Programme across the five mandated contacts working with a range of partner agencies and supporting the building community capacity agenda .&lt;/p&gt;\n&lt;p&gt;We also encourage applicants from the SCPHN Programme, qualifying in 2020.&lt;/p&gt;\n&lt;p&gt;In order to continue to develop and grow our service we offer;&lt;/p&gt;\n&lt;p&gt;An opportunity to work across our 0-19 service&lt;/p&gt;\n&lt;p&gt;The opportunity to work in an agile environment to deliver services across the borough;&lt;/p&gt;\n&lt;p&gt;We offer an attractive Outer London Supplement;&lt;/p&gt;\n&lt;p&gt;To be part of our many staff networks&lt;/p&gt;\n&lt;p&gt;We offer robust supervision and training to support your development.&lt;/p&gt;\n&lt;p&gt;Probationary Period&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;Assessment/Interview info&lt;br /&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;Starting with NELFT&lt;br /&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;High Cost Area Supplement – London&lt;br /&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,722 to a maximum of £4,743).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStella Kyei-KwatengJob titleTeam LeaderEmail addressstella.kyei-kwateng@nelft.nhs.ukTelephone number0300 300 1813Additional contact information&lt;/p&gt;\n&lt;p&gt;Stella Kyei-Kwateng&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;0-19 Integrated Children Services&lt;/p&gt;\n&lt;p&gt;West Locality&lt;/p&gt;\n&lt;p&gt;Thames View Health Centre&lt;/p&gt;\n&lt;p&gt;Bastable Avenue&lt;/p&gt;\n&lt;p&gt;Barking IG11 0LG&lt;/p&gt;\n&lt;p&gt;Phone: 0300 300 1813&lt;/p&gt;\n&lt;p&gt;stella.kyei-kwateng@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thames View/ Axe Street Barking, Barking and Dagenham", "postalCode": "IG11 0LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5279", "longitude": ".103903"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258816", "validThrough": "2020-11-19T23:59:59+0000"}