{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T08:45:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Closing date: 22nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and motivated Dietitian to join the Diabetes Specialist Service at Northumbria NHS Foundation Trust. This post will allow you the opportunity to develop your knowledge and skills in the specialist area of Diabetes.&lt;/p&gt;\n&lt;p&gt;You will join the friendly, established team of highly skilled Diabetes Specialist Dietitians and be based at Wansbeck General Hospital, working Trustwide in both primary care and a secondary care setting.&lt;/p&gt;\n&lt;p&gt;As a team we work in an extended role, delivering specialised care in Type 1 and 2 Diabetes, nationally recognised patient education programmes, training of other HCP’s and specialising in areas of diabetes including antenatal, insulin pump &amp; 16-25 services.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be delivering expert diabetes dietetics into both the Diabetes Service MDT and primary care clinics in both North Tyneside and Northumberland. They will act as an expert resource and as a valued link between services to optimise diet and lifestyle interventions as well as to advise on medication regimens where appropriate.&lt;/p&gt;\n&lt;p&gt;You must have excellent communication skills and be able to work both autonomously and as a valued part of the MDT. A further element of the role will also include acting as integral member of the MDT for Adult Weight Management Services throughout North Tyneside, delivering specialised skills in both a one to one and group setting. Please note, there may be an element of evening work. As a team we also participate in student training and clinical supervision.&lt;/p&gt;\n&lt;p&gt;This post would be appropriate for those who have not had previous exposure to Diabetes but who have a good sound knowledge of general dietetics. There will be opportunity to undertake training and shadowing to develop your competencies. We encourage participation in regular CPD activities and we hold regular departmental clinical supervision sessions allowing the opportunity to learn from training, case discussions and peer support. This post could also be offered as a progression from Band 5 to Band 6 over a period of approx. 6-12 months.&lt;/p&gt;\n&lt;p&gt;The provisions of Agenda for Change Annex 20 – Arrangements for Pay and Banding of Trainees, would apply whilst undertaking training in this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Cooper - Advanced Diabetes Dietitian&lt;/p&gt;\n&lt;p&gt;Joanna.Cooper@northumbria-healthcare.nhs.uk&lt;/p&gt;\n&lt;p&gt;01670 564025&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wansbeck General Hospital, Ashington", "postalCode": "NE63 9JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1843", "longitude": "-1.54662"}}, "title": "Specialist Diabetes Dietitian - Specialist Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258936", "validThrough": "2020-11-22T23:59:59+0000"}