{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-29T12:16:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Psychological Therapies Service, Broomfield Hospital&lt;/strong&gt;&lt;strong&gt;, &lt;/strong&gt;&lt;strong&gt;Chelmsford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Peadiatric Clinical psychologist, counselling psychologist, counsellor or psychotherapist. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7. Part time (22.5 hours per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Psychological Therapies Service is a hospital based service with a vibrant multidisciplinary team which includes clinical and counselling psychologists, counsellors, psychotherapists, mental health workers and administrators. It is a unique service, covering the whole spectrum of child and adult patient groups. The service also provides support for MSE staff which is crucial when delivering compassionate care. We are pleased to advertise this split post working as part of the child burns team providing inpatient and outpatient services as well as with the Children’s Burns Club.&lt;/p&gt;\n&lt;p&gt;The Children’s Burns Club supports children and their families following a burn injury, through a variety of targeted workshops, webinars, support groups, activity days and residential trips. The therapeutic work will vary depending on the type of event and attendees but could include facilitating a parent support group at one event, running a workshop on body image for teenagers at another, providing informal advice to parents as part of a day out, offering support and guidance to our team of volunteers, or even being on a climbing wall to help encourage a child to conquer their fears. It is a very different role, with unique challenges, but it is immensely rewarding.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and highly motivated candidate with HCPC registration or equivalent. We require a creative therapist who is keen to adapt to this more flexible way of working. The ideal candidate will be happy to work as part of a small dedicated team and have the opportunity to develop their own ideas for the service. In recent years the clubs excellent work, and in particular use of narrative therapy, has been presented at conferences for example. A displayed interest in the link between physical and psychological health and prior hospital based work would be an advantage.&lt;/p&gt;\n&lt;p&gt;Interview will be in two stages to give candidates a clear idea of the post and for us to experience them in both group and individual settings. The Stage 1 Group interview will be on Friday 27th November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Mandy Giles, Service Manager &amp; Consultant Clinical Psychologist 01245 51 6874&lt;br /&gt;Psychotherapy.Counselling@meht.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMandy GilesJob titleHead of psychological therapiesEmail addressPsychotherapy.Counselling@meht.nhs.ukTelephone number01245 516874&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Clinical Psychologist, Psychotherapist or Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248281", "validThrough": "2020-11-11T23:59:59+0000"}