{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-26T11:46:19+0000", "description": "&lt;p&gt;Salford Royal NHS Foundation Trust is a high performing trust that is aiming to be the safest organisation in the country. We have an ethos of safe, clean and personal every time. &lt;br /&gt;&lt;br /&gt;Exciting opportunities have arisen to join our newly established Surgical Triage Unit (STU). STU is a busy and fast paced 16 bedded unit. We are recruiting for Band 5&#39;s into full &amp; part-time posts . &lt;br /&gt;&lt;br /&gt;The STU provides a service for the rapid assessment and treatment of a variety of surgical, gynae &amp; urology complications. Once patients have been assessed they will be admitted to the unit , treated on the unit itself, or discharged home. Patients who are admitted to the unit usually stay up to 24/48 hours if they require further investigations they will be transferred to appropriate ward.&lt;/p&gt;\n&lt;p&gt;The unit accepts admissions 24 hours a day, seven days a week. Patients are admitted from A/E and direct referrals are taken from GP&#39;s. &lt;br /&gt;&lt;br /&gt;STU is fast paced unit with 16 beds and 3 assessment areas, with an ambulatory assessment area. We also have HOT Clinic facility and nurse lead clinics which are utilised on a daily basis.&lt;br /&gt;&lt;br /&gt;Are you enthusiastic and motivated, do you have a kind and compassionate attitude, with a desire to provide effective and efficient urgent and emergency care practice?&lt;/p&gt;\n&lt;p&gt;We need nurses who are open to change and who are committed to creative partnerships. You will need to be responsive to the fluctuating demands typical of the emergency environment and show a willingness to undertake extended roles.&lt;br /&gt;&lt;br /&gt;You must have excellent communication skills, be flexible and able to manage their time/workload effectively in a very busy environment&lt;br /&gt;&lt;br /&gt;This is an excellent opportunity for you to develop your assessment and prioritisation skills. We offer excellent support to new members of the team, with a full induction and ongoing personal development supported by the Nurse Practitioner and Ward Manager.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from newly qualified nurses with experience in any of the following fields: Emergency, General Surgery, and Urology &amp; Gynae.&lt;/p&gt;\n&lt;p&gt;Full time/ part-time which includes Early , Late and Long days 07-19:30 0r 11- 23:30 + Twilight nights , nights.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namekathleen ryanJob titleWard MatronEmail addresskathleen.ryan@srft.nhs.ukTelephone number0161 206 4933&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford royal foundation trust, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242260", "validThrough": "2020-11-09T23:59:59+0000"}