{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-13T09:30:45+0100", "description": "&lt;p&gt;An opportunity has arisen to appoint a Consultant Histopathologist within the department of Cellular Pathology at Kettering General Hospital. We would welcome applicants interested in either a substantive or NHS locum post.&lt;/p&gt;\n&lt;p&gt;The appointee will join an existing team of 7 Histopathologists. Each of the current consultants has a special area of interest and if the new appointee has a specialist area arrangements will be made to accommodate this.&lt;/p&gt;\n&lt;p&gt;Any candidate who is unable for personal reasons to work full-time will be eligible to be considered for the post. If such a person is appointed, modification of the job content will be discussed on a personal basis with the Trust in consultation with consultant colleagues.&lt;/p&gt;\n&lt;p&gt;The department is proactive in working with network partners in Leicester and Northampton in providing a high quality and efficient service.&lt;/p&gt;\n&lt;p&gt;Kettering has close links with University Hospitals Leicester with junior pathologists rotating through the department. The post-holder would be required to participate in training and education plus audit activities and also participate in relevant quality assurance schemes. Kettering is an old market town situated in the centre of England. It is set in attractive countryside and there is easy access to other major medical centres such as Oxford, Cambridge, Leicester, Birmingham, Nottingham and London.&lt;/p&gt;\n&lt;p&gt;The locality includes a mixture of rural and urban population centred in Kettering and serving the towns of Corby, Wellingborough and Rushden. There are a number of other smaller towns. The area offers a variety of housing types from village to town and has a good choice of schools. There is easy access to Leicester and other larger towns for theatre and a wide range of shopping. The surrounding countryside is unspoiled with easy access to amenities such as Rutland water. Kettering is well served by road and rail links with the A14 and the Midland Mainline (London St. Pancras 50 minutes), Eurostar direct trains to Paris and Brussels from St Pancras.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura AitkenEmail addresslaura.aitken2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223591", "validThrough": "2020-11-10T23:59:59+0000"}