{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on Experience"}}, "datePosted": "2020-10-05T16:00:14+0100", "description": "&lt;p&gt;An exciting opportunity for Clinical Pharmacists has arisen to join our two Primary Care Network teams.&lt;/p&gt;\n&lt;p&gt;Birmingham SmartCare Federation is a large organisation and we aspire to be a leading GP Provider Federation, run by clinicians for the benefit of our patients. We ensure close working with patients and staff to ensure that General Practice remains resilient, sustainable and independent to deliver high quality services for all of our patients. The work we do is challenging, interesting and hugely varied, reflecting the demographic mix of our patients.&lt;/p&gt;\n&lt;p&gt;The successful applicants will work closely with the existing clinical teams to deliver patient care working innovatively and collaboratively. This is an fantastic opportunity for the successful candidate to develop their clinical skills in a positive and excellence -focussed environment.&lt;/p&gt;\n&lt;p&gt;This post is offered as a fixed-term contract matching the current Primary Care Network funding guarantee but is anticipated to continue when this is renewed.&lt;/p&gt;\n&lt;p&gt;To be considered for this role you must have obtained an Independent Prescribing qualification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B38 9NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4031", "longitude": "-1.92237"}}, "title": "Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213469", "validThrough": "2020-12-31T23:59:59+0000"}