{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T14:47:03+0000", "description": "&lt;p&gt;We are a twenty strong team of geriatricians working across a large geographical area in varied, locally developed systems. We work in the community in MDTs, we have community hospitals and intermediate care rehabilitation settings, we have in-patient wards at our district general hospitals and an acute frailty unit at our emergency hospital. We also have a frailty team dedicated to the emergency department. We have a strong history of collaboration with our award winning orthopaedic department and we have recently started working with the general surgeons as part of the NELA project. We also run award-winning Falls and Parkinson’s services&lt;/p&gt;\n&lt;p&gt;Most members of our consultant body have very varied jobs involving some acute and sub-acute working each with clinical interest areas and many have additional local, regional or national roles in education/clinical leadership at BGS or RCP. About half of our team work less than full time.&lt;/p&gt;\n&lt;p&gt;Our trust is rated Outstanding by CQC and we were just announced as joint ‘Best Place to work’ in the NHS staff survey.&lt;/p&gt;\n&lt;p&gt;We are being asked to expand our influence in the care of frail older people across our local health economy and we want to expand our numbers to develop new ways of working. In the past two years we have started work in three community MDTs , opened a new intermediate care rehabilitation centre, started a surgical geriatrics service and moved our frailty service into the emergency department.&lt;/p&gt;\n&lt;p&gt;Our next steps include bolstering community facing work (including rapid access MDT clinics) and increasing provision of the falls and Parkinson’s service and looking at system development to support other teams to better care for their frailer inpatients.&lt;/p&gt;\n&lt;p&gt;We want to recruit consultants who are keen to be part of a successful team looking to develop outstanding services for our patients that are fit for the future and that cut across traditional boundaries of primary and secondary care and social care.&lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MRCP &lt;/li&gt;\n&lt;li&gt;Fully registered on the UK General Medical Council&#39;s Specialist Register or Specialist Registrars may apply if within 6 months of CCT at date of interview. &lt;/li&gt;\n&lt;li&gt;Full accreditation with the appropriate Royal College. &lt;/li&gt;\n&lt;li&gt;Full GMC Registration&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Northumbria Healthcare NHS Foundation Trust is committed to the highest standards of recruitment to ensure we attract and employ the very best of candidates. To meet this standard we have developed a detailed and thorough selection event for our shortlisted candidates.&lt;/p&gt;\n&lt;p&gt;The recruitment process for the vacancy you have applied for is based upon the following key elements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competency based recruitment interview&lt;/li&gt;\n&lt;li&gt;The completion of two behavioural / thinking style psychometric tests which will be validated as part of the recruitment interview&lt;/li&gt;\n&lt;li&gt;A clinical assessment which will be validated with you at the recruitment interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; Closing Date: 6th December 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Provisional Interview date: 12th January 2021&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Dr Francis Collin, Head of Service Geriatric Medicine, 0344 811 8111 Ext 32885, Francis.Collin@nhct.nhs.uk&lt;/p&gt;\n&lt;p&gt;Marcus Weatherly, General Manager, 0344 811 8111, Marcus.Weatherly@nhct.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide - base site to be confirmed", "postalCode": "NE27 0QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0205", "longitude": "-1.50819"}}, "title": "Consultant in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258192", "validThrough": "2020-12-06T23:59:59+0000"}