{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-16T14:46:19+0100", "description": "&lt;p&gt;An excellent opportunity has arisen for a proactive and self-motivated Senior Finance Manager to join the Finance Team on a permanent basis.&lt;/p&gt;\n&lt;p&gt;As a Senior Finance Manager you will have a lead role in providing a comprehensive finance and business support service focused on the CCG’s acute, mental health and continuing healthcare services.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have significant financial management experience within an NHS or local authority environment. You will have excellent inter-personal and communication skills with the ability to communicate complex financial issues effectively with both non-finance and finance staff. Experience of complex planning and management reporting are fundamental to the role&lt;/p&gt;\n&lt;p&gt;You will manage and lead a team of accountants, ensuring a robust and quality finance function. You will be flexible, able to prioritise workloads and able to cope with changing and conflicting demands.&lt;/p&gt;\n&lt;p&gt;Candidates should have a professional accountancy qualification and being CCAB/CIMA qualified is essential. The CCG also offers support for ongoing professional development.&lt;/p&gt;\n&lt;p&gt;NHS Stockport CCG is a clinically led organisation, responsible for making sure that more than 315 thousand people have access to quality healthcare. It is a key partner in designing and developing integrated healthcare and delivering on the vision for the future of the NHS.&lt;/p&gt;\n&lt;p&gt;The CCG is active in working with health and social care partners across the metropolitan boroughs to improve health and increase the quality of services as part of Greater Manchester’s devolved Health and Social Care Partnership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew KennedyJob titleAssistant Chief Fianance OfficerEmail addressandrew.kennedy1@nhs.netTelephone number07775005603&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128388"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stopford House, Stockport", "postalCode": "SK1 3XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.406", "longitude": "-2.15849"}}, "title": "Senior Finance Manager Performance and Delivery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230714", "validThrough": "2020-11-12T23:59:59+0000"}