{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-26T14:01:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you ready for a new challenge? &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Are you an aspiring future leader of the nursing workforce? &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;If the answer is yes, then this opportunity to become a Clinical Team Leader (RMN) on Thames Ward is just what you have been looking for.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic Band 6 Registered Mental Health Nurse to join our team on Thames Ward at St. Charles Hospital. We are looking for applicants who have completed their preceptorship, mentorship, working with adults with mental health problems and are able to lead a team, work creatively and effectively in the clinical environment.&lt;/p&gt;\n&lt;p&gt;Successful candidates will demonstrate progressive skills in leadership, supervision, clinical practice, service development, risk assessment and risk management. We are seeking nurses who are also friendly, approachable, compassionate and motivated with good communication skills. If you are committed to providing person centred care with a sound knowledge of best practice within Adult Inpatient Service, this could be the opportunity for you. We are an ambitious team and sit within a wider ambitious inpatient service, we would like somebody to help us to continue to strive for improvement and the best possible clinical outcomes.&lt;/p&gt;\n&lt;p&gt;Central and North West London (CNWL) NHS Foundation Trust is a forward thinking and dynamic NHS Trust with a real commitment to staff development to ensure the delivery of high quality, person-centred, recovery focused and compassionate care to service users. We value our staff and invest in them to ensure they have the right skills and competencies to deliver the highest quality of care.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;p&gt;An opportunity to work within the heart of London&lt;/p&gt;\n&lt;p&gt;Excellent progression through various career pathway opportunities&lt;/p&gt;\n&lt;p&gt;Support and guidance with Revalidation&lt;/p&gt;\n&lt;p&gt;Flexible working&lt;/p&gt;\n&lt;p&gt;On-going supervision and appraisals with optional coaching available&lt;/p&gt;\n&lt;p&gt;Tailored education and development programme.&lt;/p&gt;\n&lt;p&gt;Hidden Gem and annual award ceremonies&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lewis Webster&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address lewis.webster@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07747472702&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Lewis Webster - Ward Manager, Thames Ward - lewis.webster@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thames Ward, St Charles Hospital, London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Clinical Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242814", "validThrough": "2020-11-09T23:59:59+0000"}