{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Bank Band 5/6"}}, "datePosted": "2020-10-30T10:26:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Bank District Nurse&lt;br /&gt; BAND: BANK 5 / 6&lt;br /&gt; LOCATION: North East Somerset / Bath Twilight/OOH Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a caring, ethusiastica and flexibleCommunityNurse based in the Bath and North East Somerset (BANES) area?Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use serviceswould recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Qualified Nursedelivering NHS/Local Authority Health Careservices with us you will receive Band 5 or 6 bank rate depending on the previous experience.We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers on Virgin Products such as holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a valid NMC pin number and experience from Community/District Nursing setting, preferablyfrom the out-of-hours. You need to have skills to enable you totriageand respondto calls, prioritiseand delegateas appropriate. You have extended clinical skills including IV therapy, End of Life symptom control, Urinary Catheter management, fallsand Tissue Viability. These are required in order to respond to various different types of calls that you would receive as a twilight/OOH Bank Nurse between the core hours of 5pm and 10.30pm. You also need to have some leadership skills in orderto support and supervise the Health Care assistant working with you. A car driver and access to vehicle is essential in order to visit patients in their own homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working within the Bath or North East Somerset (NES) Twilight Team, you will provide assessment and intervention to house bound service users who are at risk of hospital admission or at the end of their life. You will work closely with the other twilight/OOHstaffon duty and with the OOH GP service. You would also be liaising with the day District Nursing staff when receiving referrals as well as hand overs.You will be basedin St Martins Hospital withBath Twilight Team andin Midsomer Norton/Keynsham Health Centre if working in NES side. The service is an on-call service however there might be some planned visits at times. Agood communicationskills are essential for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Katri Smart, Clinical Lead for OOH via email: Katri.Smart@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;You’re welcome to come in for an informal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in BANES and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Bank District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249719", "validThrough": "2020-11-13T23:59:59+0000"}