{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45639", "minValue": "32577", "unitText": "YEAR", "value": "£19.38 - £27.15"}}, "datePosted": "2020-11-03T08:47:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse – Band 5&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;Do you want first choice of shifts at a trust offering a range of highly specialist services to patients across East Suffolk &amp; North Essex? Do you want more flexibility and a better work-life balance?  Would you like to earn some extra money at top of band 5 rates?&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and enthusiastic Registered Nurses to join the NHSP staff bank at East Suffolk &amp; North Essex NHS Foundation Trust. You will have access to first choice of shifts to suit your lifestyle, with the opportunity to bring your skills to a leading trust, renowned for their friendly culture, person-centred care, specialist services and convenient location.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Providing acute hospital and community-based healthcare services to a population of around 730,000 people in the Ipswich &amp; Colchester Regions, why not join a dedicated team of over 15,000 staff who deliver outstanding care and work together to achieve the highest possible standards for their patients.&lt;/p&gt;\n&lt;p&gt; Be part of the Trusts shared visions:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a wide range of high quality, safe and accessible healthcare services&lt;/li&gt;\n&lt;li&gt;Recruit, retain and motivate skilled and compassionate staff, who are proud to act as ambassadors of the service they provide&lt;/li&gt;\n&lt;li&gt;Be the employer of choice in the South East of England&lt;/li&gt;\n&lt;li&gt;Listen, learn and innovate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working for NHSP at East Suffolk &amp; North Essex NHS Foundation Trust gives you the opportunity to work across a variety of wards, building rapport and improving your skills. Wards such as&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Respiratory&lt;/li&gt;\n&lt;li&gt;General Acute&lt;/li&gt;\n&lt;li&gt;Emergency Assessment Unit&lt;/li&gt;\n&lt;li&gt;Elderly Care/ Palliative&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Pay Rates&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;Days:  £19.38         Nights/Saturdays:  £22.46          Sundays/Bank Holidays:  £27.15&lt;/p&gt;\n&lt;p&gt;In return for your hard work and NHSP can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates  - &lt;/strong&gt;Work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt; &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 level in an acute hospital or Hospice environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with ESNEFT policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts, you choose when you want to work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information on the role or details on how to join NHS Professionals, simply get in touch with Anne-Marie Davies, Trust Recruitment Coordinator, annemarie.davies@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Registered Nurse - Ipswich Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253182", "validThrough": "2020-12-31T23:59:59+0000"}