{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 p.a. + L.W"}}, "datePosted": "2020-10-28T10:01:26+0000", "description": "&lt;p&gt;As part of the Royal Free London NHS Foundation Trust at &lt;strong&gt;Barnet Hospital&lt;/strong&gt; we are seeking to appoint an enthusiastic and quality driven consultant colleague to cover a 1 year period of maternity leave.&lt;/p&gt;\n&lt;p&gt;We have the support structure for you if this is your first post after completing training but also if you are an established consultant. We are a fantastic place to work and welcome all applications.&lt;/p&gt;\n&lt;p&gt;The Department of Health Services for Elderly People (HSEP) is a large, 22 consultant strong, vibrant and dynamic department which provides specialist geriatric assessment and treatment to frail, older patients from the front door to discharge as well as supporting frail, older people in the community. We are committed to providing specialist geriatric expertise throughout the patient journey.&lt;/p&gt;\n&lt;p&gt;The focus of this role is frailty at the front door. We are in the process of expanding our Acute Medical Unit, creating a front door frailty area, identifying further Same Day Emergency Care SDEC activity and designing those pathways whilst supporting a thriving medical short stay unit. Some flexibility is required due to Covid – 19 which has affected the ways in which we usually work. The appointee will also be on the general medical on-call rota.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of highly motivated physicians with a variety of speciality interests within geriatric medicine. The Department has expanded into new roles including developing frailty services and admissions avoidance schemes. We currently provide a number of specialty clinics including Falls, Parkinson’s disease, Continence and Tilt table clinics. The Acute Stroke Unit is run by 4 geriatricians with an interest in Stroke and who also provide daily TIA clinics. We have a well-developed Orthogeriatric service as well as surgical and cardiology liaison.&lt;/p&gt;\n&lt;p&gt;The department supports an enthusiastic cohort of junior doctors and uses quality improvement to develop and discover measureable sustainable improvements.&lt;/p&gt;\n&lt;p&gt;The appointee will be expected to be involved in all aspects of postgraduate and undergraduate training, including clinical supervision, formal and informal teaching and leading the undergraduate teaching and assessment programme. Medical students from University College Medical School are attached to the hospital during term time. The first cohort of Physicians Associate Students have started rotations through our unit and we are supportive of Advanced Care Practitioner roles within acute areas.&lt;/p&gt;\n&lt;p&gt;Barnet is a fantastic location close to the green belt; affordable accommodation in nearby Hertfordshire; good local schools; ability to achieve a flexible, enjoyable work life balance.&lt;/p&gt;\n&lt;p&gt;Our mission is to deliver world class care and expertise in our clinical services, underpinned by world class teaching and research and we will continue to measure our progress against our five governing objectives: excellent outcomes, excellent patient and staff experience, excellent value for taxpayer’s money, being safe and meeting our external duties, and building a strong organisation.&lt;/p&gt;\n&lt;p&gt;We welcome informal visits to our site. Please come and meet us.&lt;/p&gt;\n&lt;p&gt;Candidates must have substantial, demonstrable experience in General Internal Medicine and Geriatrics and must either be on the GMC specialist register or reasonably expect to be so within 6 months of interview.&lt;br /&gt;&lt;br /&gt;THE ROYAL FREE LONDON NHS FOUNDATION TRUST IS COMMITTED TO EQUAL OPPORTUNITIES&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr David Levy&lt;/p&gt;\n&lt;p&gt;Job title: Service Line Lead in Geriatric Medicine / Consultant&lt;/p&gt;\n&lt;p&gt;Email address: dlevy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, London", "postalCode": "EN5 2DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6466", "longitude": "-.193098"}}, "title": "Locum Consultant in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245943", "validThrough": "2020-11-11T23:59:59+0000"}