{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc HCAS"}}, "datePosted": "2020-11-03T15:31:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist (Band 6) Speech and Language Therapist (SLT) – Adult community, Camden&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated, flexible and enthusiastic Speech and Language Therapist to join our multi-disciplinary community rehabilitation team. Our office base is in St Pancras Hospital (close to the amenities and transport links of Kings Cross, Euston and Camden), and we see patients in the community across Camden, which is a vibrant and diverse London borough. Due to covid-19 we are also well-supported to work from home and deliver some sessions via video and telephone.&lt;/p&gt;\n&lt;p&gt;You will join our Camden Neurology and Stroke Service – a well-established and highly respected multidisciplinary team comprising speech and language therapists, physiotherapists, occupational therapists, clinical psychologists, and rehabilitation assistants. You will be committed to providing a goal-focused, evidence-based, specialist service to adults with acquired communication and swallowing difficulties. You will have a stimulating varied caseload working across three care pathways – Early Supported Discharge (for stroke), Neurology rehabilitation (for patients with a broad range of neurological diagnoses), and Integrated Primary Care (for patients with other long-term conditions affecting communication and/or swallowing eg dementia, COPD).&lt;/p&gt;\n&lt;p&gt;You may also have the opportunity to gain additional experience on the in-patient wards within St Pancras Hospital Rehabilitation Unit (neurology and multi-pathologies).&lt;/p&gt;\n&lt;p&gt;This post will suit a Speech and Language Therapist looking to consolidate established skills working with adults with acquired communication and swallowing difficulties. You will be well-supported by three Band 7 SLTs and a Band 8a Clinical Lead SLT. You will also benefit from peer support from two other Band 6 SLTs who are experienced members of our team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Debbie Gardiner&lt;/p&gt;\n&lt;p&gt;Job title Highly Specialist Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;Email address debbiegardiner@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 020-33173309&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Pancras Hospital, Camden, London", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254562", "validThrough": "2020-11-17T23:59:59+0000"}