{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-19T16:00:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Computer Technologist (Band 6)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full-time: 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Clinical Computer and Imaging Sciences Service (CCISS) at the University Hospitals Birmingham NHS Foundation Trust (UHB) requires an enthusiastic Clinical Technologist to support the Medical Physics service, in particular Radiotherapy, Radiotherapy Physics and Imaging, and to help provide and develop scientific solutions in clinical computing.&lt;/p&gt;\n&lt;p&gt;The CCISS is part of the Imaging and Medical Physics Group at UHB and is the focus for clinical computing development, problem solving and provisioning, including digital image enhancement, manipulation and analysis. Staffing comprises 9.8 whole-time equivalent Clinical Scientists and Technologists providing clinical computing support to the Radiotherapy Physics, Radiotherapy, Radiation Protection and Imaging services. CCISS staff are involved in:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;developing and implementing software solutions for scientific and clinical issues and integrating these into the patient pathway;&lt;/li&gt;\n&lt;li&gt;providing data extraction and analysis services for clinical and scientific problems;&lt;/li&gt;\n&lt;li&gt;ensuring seamless and safe working of all computing components required for treatment delivery or diagnosis;&lt;/li&gt;\n&lt;li&gt;providing virtualisation platforms for clinical system testing, training, research and development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The CCISS provides maintenance and support for clinical applications within the Radiotherapy pathway, such as: oncology management system (Mosaiq); virtual simulation (Prosoma); treatment planning systems (RayStation, Monaco, Oncentra); imaging verification systems (IViewGT, XVI) and RT PACS. The service is also responsible for the integration into the healthcare environment of Tomotherapy and Cyberknife radiotherapy delivery systems.&lt;/p&gt;\n&lt;p&gt;The service maintains various database management systems, and Medical Physics specific clinical and research based applications, not provided by the Trust IT department. We use and support a variety of open source and proprietary systems, requiring experience in Python, SQL (MS SQL, MySQL), scripting languages (e.g. VBA, JS, Lua) and web technologies. In house solutions have been developed using Java/JakartaEE and PostgreSQL.&lt;/p&gt;\n&lt;p&gt;As part of the CCISS team the post-holder will work very closely with the Radiotherapy Physics service and the Radiotherapy department, and with Imaging R&amp;D projects. Key elements of the role will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;providing first line support for Radiotherapy computing systems (R&amp;V, TPS, VSIM);&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;supporting the physical and virtualized infrastructure underpinning the radiotherapy service, in cooperation with corporate IT;&lt;/li&gt;\n&lt;li&gt;maintaining the electronic inventory for the service;&lt;/li&gt;\n&lt;li&gt;managing and developing in-house software to support the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A successful applicant should have comprehensive experience in the installation and configuration of operating systems and software packages. The CCISS provides a virtualised (VMWare) infrastructure and uses Citrix to provide remote access to systems; experience with supporting these technologies will be beneficial. It is desirable that the candidate possesses computing experience in safety critical systems, preferably in a clinical environment and ideally in Radiotherapy.&lt;/p&gt;\n&lt;p&gt;Candidates should be experienced Clinical Technologists or Radiographers with good IT skills and an interest in Clinical Computing, educated to degree level (or equivalent) in computer science, software engineering or an associated physics/engineering discipline. Candidates should ideally have achieved satisfactory professional registration, or be close to registration, as a Clinical Technologist.&lt;/p&gt;\n&lt;p&gt;A successful applicant who has not yet achieved registration will be appointed Band 5, or Band 6 Annex 21 if judged to be close to registration. Satisfactory professional registration would include the Register of Clinical Technologists, maintained by the Institute of Physics and Engineering in Medicine (IPEM); alternatively appropriate registration with a different regulatory body, such as the Academy for Healthcare Science (AHCS) or the UK Council for Health Informatics Professions (UKCHIP), may be acceptable&lt;/p&gt;\n&lt;p&gt;The CCISS provides training for STP trainees in Clinical Bioinformatics, and for computing competencies for STP trainees in Medical Physics. All our Clinical Scientists and Technologists are expected to become actively involved in clinically-based research projects. The Medical Physics department has strong research and teaching links with the School of Physics and Astronomy at the University of Birmingham.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role the post holder will be expected to work flexibly as the service requires.&lt;/p&gt;\n&lt;p&gt;If you require further information please contact Ian Stronach - Ian.Stronach@uhb.nhs.uk tel 0121 371 5069] or Adam Chalkley - Adam.Chalkley@uhb.nhs.uk tel 0121 371 5062].&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Clinical Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233042", "validThrough": "2020-11-10T23:59:59+0000"}