{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 plus HCAS per annum pro rata"}}, "datePosted": "2020-10-29T10:31:48+0000", "description": "&lt;p&gt;North East London Foundation Trust (Redbridge) are seeking enthusiastic and highly motivated registered nurses to join our Community Nursing Service in Redbridge.&lt;/p&gt;\n&lt;p&gt;The post holder will be a Registered Nurse (RN12-NMC) who will have significant care experience at Band 5. The post holder will be responsible for leading nursing care for a designated team/caseload. Will be professionally and legally accountable for all aspects of care relating to clinical areas. Responsible for patients allocated to them and will assess, manage and deliver care to meet the complex needs for those patients requiring intermediate care and primary care services.&lt;/p&gt;\n&lt;p&gt;The post holder will be able to manage and support their peers, working on their own initiative and but also an effective team member along with the requirements of pre-registration students. They will be committed to working collaboratively, actively supporting and liaising with other health, social professionals and other agencies.&lt;/p&gt;\n&lt;p&gt;The service currently operates from 08.30-17.00hrs (however this may be revised during transformational change) including regular weekends on a rota basis.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to support their team, department and organisation to achieve the Trust’s Values in their day to day work. These are the 5P’s:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Putting people first&lt;/li&gt;\n&lt;li&gt;Prioritising quality&lt;/li&gt;\n&lt;li&gt;Being progressive, innovative and continually improve&lt;/li&gt;\n&lt;li&gt;Being professional and honest&lt;/li&gt;\n&lt;li&gt;Promoting what is possible – independence, opportunity and choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your commitment, the Trust can offer Clinical Supervision, Support for Professional Development, annual appraisals and a Personal Development Plan.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement – London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum payment of £3,784 and a maximum payment of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan MooreJob titleIntegrated Locality Team ManagerEmail addressSusan.moore@nelft.nhs.ukTelephone number020 8708 2389Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Valerie Murray&lt;/p&gt;\n&lt;p&gt;Job Title: Clinical Nurse Lead&lt;/p&gt;\n&lt;p&gt;Telephone number: 0208 708 2188 or 07939193313&lt;/p&gt;\n&lt;p&gt;E-mail address: valerie.murray@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wanstead &amp; Woodford HASS, Redbridge", "postalCode": "E18 2QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5974", "longitude": ".021763"}}, "title": "District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247924", "validThrough": "2020-11-16T23:59:59+0000"}