{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per  annum"}}, "datePosted": "2020-10-23T10:02:11+0100", "description": "&lt;p&gt;&lt;span&gt;Bristol Genetics Laboratory (BGL) is seeking to appoint a permanent Head of Section within the Rare Disease team of the South West Genomic Laboratory Hub (SWGLH). This is a rare opportunity to join a committed and expanding team of scientists and technologists as genomics becomes mainstreamed within the NHS.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a scientific and technical staff of over 100, BGL is housed in the state of the art Pathology Sciences development in North Bristol NHS Trust and is a key member of the Severn Pathology integrated pathology service. Integral to the Severn Pathology vision is a fully provisioned molecular hub supporting wider pathology testing in partnership with PHE.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;BGL is a fully integrated Genomics Laboratory with staff teams structured along patient care pathways to provide comprehensive Rare Disease and Cancer genomic testing to the South West with extensive specialist RD services in cardiac, renal, neurology and endocrinology attracting a large number of national and international referrals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;BGL has a significant R&amp;D programme to support the genomics developments in rare disease and cancer and also benefits from co-location with the University of Bristol Learning and Research Centre in the Trust Science Quarter. BGL has a close working relationship with the Exeter Genomic laboratory, Bristol and Exeter Clinical Genetics services, as well as other clinical, academic and industry partners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;BGL is committed to the provision of high quality training at all levels, through Modernising Scientific Careers programmes ( STP, PTP and HSST and developing CF2-4 roles), contribution to training of other healthcare professional and academic posts including MSc and PhD, and the dissemination of Genomics expertise to colleagues in mainstream medicine.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Role: Will lead a sub-section of the Rare Disease Genomics team and work closely with the lead Consultant Rare Disease Scientist. The postholder will also be responsible for developing services for their sub-specialty in line with the requirements of the SWGLH and NHSE National Genomics Test Directory. As a member of senior leadership team they will also contribute to strategic direction of BGL and the SWGLH Rare Disease Genomics services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Possession of FRCPath part 2 is essential (candidates actively preparing for part 2 are encouraged to apply).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Considerable experience in a range of RD genomic testing is essential. Experience in WGS and aCGH is highly desirable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants must be registered with the Health and Care Professions Council (HCPC) as a clinical scientist (cytogenetics/molecular genetics) and have an upper second or first class honours degree and/or PhD in a relevant scientific subject. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be expected to work 37½ hours per week full-time over 7 days a week, including participation in regular weekend and out of hours working&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maggie Williams - Consultant Clinical Scientist&lt;/p&gt;\n&lt;p&gt;maggie.williams@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone Number: 0117 414 6171&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Prof Rachel Butler - Rachel.Butler@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Principal Clinical Scientist - Band 8B", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239954", "validThrough": "2020-11-12T23:59:59+0000"}