{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "Band 5 - £24,907"}}, "datePosted": "2020-10-26T12:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Preceptorship Forensic Mental Health Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We know that taking up your first job as a nurse is both exciting and scary. That&#39;s why we&#39;ve set up our &lt;strong&gt;Preceptorship Academy&lt;/strong&gt;, to help you get the very best start.&lt;/p&gt;\n&lt;p&gt;Your transition from student to registered nurse is one of the biggest leaps you will ever make in your nursing career. But you don’t have to do it alone. Our preceptorship programme is designed specifically for you as a newly qualified nurse, to support you in that transition.&lt;/p&gt;\n&lt;p&gt;Working within a supportive clinically led team, you will have the opportunity to really work in partnership with patients - engaging, supporting and developing a relationship which really enables the recovery process. With a real commitment to improving care delivery, as part of our team you will be supporting quality improvements and initiatives that will enhance the patient experience.&lt;/p&gt;\n&lt;p&gt;We want you to feel equipped with the right skills to become a brilliant nurse. We will help, support and nurture you to become the best you can be. We will help you to develop in confidence as a nursing professional, enhance your skills and continue your journey of life-long learning.&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;preceptorship programme&lt;/strong&gt; is also a great opportunity to map out your continuing professional development and consider how you want to progress your career as a nurse. You will reflect on and evaluate your role and identity as a nurse, and when you need that extra bit of support to help you through, we&#39;ll be here for you alongside your multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The programme is designed and delivered by senior mental health professionals and peer trainers – people with lived experience of mental health services. Through supervision and assessment you are supported to practice safely and build your confidence during your first 12 months as a newly qualified nurse.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sussex Partnership NHS Foundation Trust&lt;/strong&gt; is offering Mental Health Nurses an innovative and exciting opportunity to work in our &lt;strong&gt;Forensic Healthcare Services&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are committed and passionate about supporting nurses who wish to progress in their career through a clinical pathway, and truly believe that Forensic Healthcare services offer a career for life to nurses who are committed to delivering excellent, evidence based clinical care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Preceptorship Forensic Rotation Programme&lt;/strong&gt; is an 18-month program allowing Band 5 RMNs to experience working across forensic placements in 3 of the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Medium Secure Admissions Ward&lt;/li&gt;\n&lt;li&gt;Medium Secure Recovery Unit&lt;/li&gt;\n&lt;li&gt;Low Secure Services.&lt;/li&gt;\n&lt;li&gt;Locked Rehab services&lt;/li&gt;\n&lt;li&gt;Forensic Community Services&lt;/li&gt;\n&lt;li&gt;Police and Court&lt;/li&gt;\n&lt;li&gt;Women’s Secure Service Pathway including Medium and Low Secure units.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our &lt;strong&gt;Forensic Preceptorship rotation &lt;/strong&gt;is facilitated by Forensic Nurse Consultants, who will provide you with a comprehensive support and development programme, further reinforced through Clinical Supervision, identified Pre-placement learning outcomes, an identified Rotation Mentor, peer reflective practice, and monthly training days. Upon completion of your rotation you will be further supported to apply for a forensic Band 6 post.&lt;/p&gt;\n&lt;p&gt;This post offers The Trust&#39;s &lt;strong&gt;Golden Hello&lt;/strong&gt; for band 5 or 6 Nurses, or a &lt;strong&gt;Relocation Package&lt;/strong&gt; up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document). The post also benefits from an additional environmental allowance, and your initial PIN payment will be paid by the Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Woods, Nurse Consultant - Laura.Woods@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;If you have any additional questions or would like to find out more about our preceptorship programme please contact:&lt;/p&gt;\n&lt;p&gt;Una Hobson, Lead Nurse Education and Training and preceptorship programme lead, on una.hobson@sussexpartnership.nhs.uk or 07738 757272&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Antony Davies, HR/ Resourcing Team Lead, on nursing@sussexpartnership.nhs.uk or 07468 475141&lt;/p&gt;\n&lt;p&gt;You can also follow us on Twitter @SpftPA&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Various", "postalCode": "BN3 4AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8301", "longitude": "-.184206"}}, "title": "Preceptorship Forensic Mental Health Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242368", "validThrough": "2020-11-11T23:59:59+0000"}