{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 PA"}}, "datePosted": "2020-10-27T12:01:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Organisational Development Consultants&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;One Team in One Trust with One Goal with our vision:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;To employ the best people and develop and value them, so that the teams they work in provide outstanding care to the local population.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Developing our organisational culture is important because it is at the heart of a safe, high quality hospital. Only if our staff are supported, comfortable in their role, treated as equals by their peers, will they feel safe to do the right things: speak up and be open when things go wrong, live and breathe our organisational values and strive for excellence”. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Carter CEO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bedfordshire Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The newly merged Foundation Trust is seeking two exceptional individuals in exceptional times to implement and progress the Culture &amp; Organisation Development Strategy for the new organisation. Aligned to the NHS People Promise and We are the NHS: People Plan 2020/21, our strategy will support attainment of our vision through a programme of focussed activities and interventions designed to support, equip and inspire our leaders and their teams to provide the best possible services to our patients ensuring an organisation that is clinically led and managerially enabled.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to make an immediate and positive difference and be at the heart of driving forward our vision and aspirations These new roles will specifically focus on initiatives across the newly merged Foundation Trust, including supporting our clinical integration programme, leadership, team and organisational culture development. You will be joining a fledgling OD team working through a faculty of Fellows and Associates designed to have a profound effect on the culture of the organisation. The roles will be shaped around core competencies whilst playing to your own strengths and experience.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have strong demonstrable combinations of intellectual breadth &amp; depth, exceptional leadership capabilities, mature OD skills, an outcome focused change management track record and strong emotional intelligence.&lt;/p&gt;\n&lt;p&gt;Whilst working to and being professionally accountable to the Assistant Director of OD, you will lead on corporate Organisational Development and culture strategies, plans and policies and their implementation. You will have an autonomous remit and manage and develop an OD practitioner working inside our newly formed OD Faculty.&lt;/p&gt;\n&lt;p&gt;You will have a high level of visibility and exposure to senior managers across the Trust including Executives, Deputies, Clinical Leads and external stakeholders and system partners. You will be operationally responsible for the delivery of key aspects of our People &amp; OD plan including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Embedding new organisational values;&lt;/li&gt;\n&lt;li&gt;Supporting new senior clinical teams;&lt;/li&gt;\n&lt;li&gt;Building our OD capability and offering;&lt;/li&gt;\n&lt;li&gt;Leadership development provision.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;So if you are an innovative, experienced and suitably qualified OD leader looking to develop your career and want to do so in an environment which is challenging but with lots of opportunities make a difference then we would like to hear from you and would encourage you to apply for this role.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to supporting flexible and agile working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Paul King&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Assistant Director of Culture &amp; OD&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;paul.king@bedfordhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone number&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;01234 355122 extension 3677 or 07970946555&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedfordshire Hospitals NHS Foundation Trust, Bedford/Luton", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Organisational Development Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244385", "validThrough": "2020-11-08T23:59:59+0000"}