{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45753 - 51668 pa"}}, "datePosted": "2020-10-20T16:42:32+0100", "description": "&lt;p&gt;&lt;span&gt;We are looking for a Senior Communications Manager to join our friendly, welcoming and award-winning Communications team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting role in the Communications team, delivering communications, marketing and campaign activity both for NECS as an organisation and our services, and working across multiple projects for a variety of internal and external customers across health and care systems nationally. NECS offers a busy and versatile working environment with variety and opportunity to take on new projects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be responsible for promoting and marketing the impact that NECS has, and have a key senior role in a communications team delivering services that our customers value. We will welcome your professional expertise and skills to help us develop our service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will provide expert advice and guidance across the whole remit of communications and marketing and help us achieve our aspirations in this area. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a candidate with experience and a proven track record of achievement in delivering communications and marketing projects, working with key stakeholders including clinical commissioning groups, partner organisations and other public services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;They will have an excellent knowledge of communications and marketing approaches and best practice, The Senior Communications Manager is a key role for NECS, leading on and delivering key programmes of work where communications and marketing are part of the delivery programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a member of the senior team within the directorate you will work with colleagues within NECS, influencing and build relationships with other services in actively supporting delivery of communications service, and demonstrating value. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a varied job with lots of opportunity in a supportive and ambitious organisation at an exciting time for NECS as a care system support organisation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer the chance to join a forward thinking organisation that is committed to transforming its business, improving health outcomes for populations and driving improved value for money.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Snow House, Durham", "postalCode": "DH1 3YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.764", "longitude": "-1.57002"}}, "title": "Senior Communications Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235307", "validThrough": "2020-11-11T23:59:59+0000"}