{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T12:45:53+0000", "description": "&lt;p&gt;Brighton and Sussex University Hospital Trust is the leading Acute Trust on the South East Coast and is a Teaching Hospital. We are the regional Major Trauma Centre. Building work has commenced for our new Hospital which will house a 55 bedded Critical Care Unit. Currently we have 31 beds.&lt;br /&gt;&lt;br /&gt;The Royal Sussex County Hospital in Brighton is located just a 2 minute walk from the sea and is close to our lively and cosmopolitan town centre! The Hospital is within easy access to the seaside, countryside and there are great train links to London and Gatwick.&lt;br /&gt;&lt;br /&gt;Are you motivated, committed and team orientated?&lt;/p&gt;\n&lt;p&gt;Would you like to develop your clinical and managerial skills within our friendly General/Trauma/Neurosurgical Critical Care Unit? &lt;br /&gt;&lt;br /&gt;You must possess a Critical Care course or equivalent. You will act as an excellent role model, clinical practitioner and promote professional practice. You will be supported to work towards completing your full KSF outline for Band 6.&lt;br /&gt;&lt;br /&gt;You will have superb career and professional development opportunities and offered a structured orientation programme.&lt;br /&gt;&lt;br /&gt;We are looking for a dedicated, patient focused and reliable senior nurse to provide commitment to the highest standards of nursing care for our critically ill patients.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lucy Pitt&lt;/p&gt;\n&lt;p&gt;Job title Matron&lt;/p&gt;\n&lt;p&gt;Email address lucy.pitt4@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07341884379&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Critical Care Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259737", "validThrough": "2020-11-29T23:59:59+0000"}