{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-05T10:31:53+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for enthusiastic and motivated Band 2 Healthcare Assistants to join our dynamic team Critical Care teams at The Royal Shrewsbury Hosital and The Princess Royal Hospital, Telford, for a fixed term 6 month period to cover the winter pressures. Secondments would also be considered.&lt;/p&gt;\n&lt;p&gt;The role will involve carrying out basic nursing care duties under the supervision of a registered practitioner, assisting the delivery of the high quality specialised care required to meet the needs of the critically ill patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate high standards in patient care, infection control and communication. They will partake in ensuring that the unit is to a high standard and is safe for both patients and staff by working with our housekeepers, nurses, doctors and physiotherapists.&lt;/p&gt;\n&lt;p&gt;You will be joining a highly motivated team who are proud to have achieved *Diamond* rating during their Exemplar Ward inspection in 2018. We also work closely with the Transforming Care Institute to encourage innovation and creativity from our team to help improve our patients’ experiences. We recognise outstanding care within our team, supported by the Learning from Excellence Scheme and encourage all our staff to get involved. We also highly value safety and quality – with established daily safety huddles, improved communication through our team newsletter and open culture for all staff to suggest improvements.&lt;/p&gt;\n&lt;p&gt;A positive attitude to change is essential as we look to the future, We also encourage cross-site working as much as possible as we align both teams and to give a more varied learning experience.&lt;/p&gt;\n&lt;p&gt;The minimum educational requirements for this role are GCSE&#39;s at Grade 4 or above in Maths and English (or equivalent.)&lt;/p&gt;\n&lt;p&gt;This is a hugely exciting time to be joining Critical Care at SaTH and we hope that you will apply for this post and join our family!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury and Telford", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Healthcare Assistant - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257253", "validThrough": "2020-11-12T23:59:59+0000"}