{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23121", "minValue": "21789", "unitText": "YEAR", "value": "£21,789 - £23,121 PA INC HCAS"}}, "datePosted": "2020-10-14T12:16:52+0100", "description": "&lt;p&gt;The Estates Department operate and maintain, energy and environmental resources, controls, electrical and mechanical services providing power, lighting, heating, air conditioning to wards, outpatients and operating theatres. Estates directly impacts on patient welfare, frontline clinical care, infection prevention and control and energy efficiency and sustainability across the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We have an exciting opportunity for a committed highly self-motivated individual, the Royal Marsden is looking for an Intern Undergraduate Engineer to join the Estates Team on a 1-year placement from August 2021.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a highly valuable broad ranging role allowing the Undergraduate to find their feet in a real working environment, which will expose the Undergraduate to the whole range of Estates services including mechanical, electrical, building &amp; energy control systems and project management. The candidate must be highly proactive in developing their technical knowledge in all aspects of training and work undertaken, engage in active discussions about skills, techniques, methods and approach to tasks in order to develop as a skilled professional.&lt;/p&gt;\n&lt;p&gt;This role requires working in a live Hospital site which will provide excellent opportunities to gain valuable work experience, behaviour at all times must be conducted in a professional manner and consistent with Trust Values.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alison Palmer (Lead), Senior Business Manager, alison.palmer@rmh.nhs.uk, x2051 or x4626&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Undergraduate Engineer 1 Year Placement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226191", "validThrough": "2021-02-01T23:59:59+0000"}