{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata"}}, "datePosted": "2020-10-27T13:31:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Children’s Health Care Support Worker &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Integrated Children’s Nursing Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities have arisen for enthusiastic Health Care Support Worker (Band 3) to work in our integrated nursing team in Dudley. You will be part of the service working in children’s homes and education settings.&lt;/p&gt;\n&lt;p&gt;Following a supportive and in-depth training program you will care for children with a wide variety of complex health care needs and life limiting conditions, such as children who have an unstable airway/unstable condition; have complex seizures; are oxygen dependant; fed by enteral feeding methods such as a gastrostomy tube; tracheostomy, offering support to families.&lt;/p&gt;\n&lt;p&gt;You will work without direct supervision and you will be responsible for implementing and maintaining high standards of health care, as planned and directed by our team of registered nursing staff.&lt;/p&gt;\n&lt;p&gt;It is expected that the post holder will provide some cover of the packages of care to enable children with complex needs attend education. The post holder will also support nurses and families to ensure that practical and emotional support is offered to families and children.&lt;/p&gt;\n&lt;p&gt;The post holder will also be required to provide a range of administration activities as well as supporting the wider services across the team. This will include maintaining equipment and supplies and delivery of equipment&lt;/p&gt;\n&lt;p&gt;This will involve clinical and non-clinical care and will ensure that the post holder works with a wide range of other agencies and professionals including housing, dieticians, clinical engineers, physiotherapy, occupational therapists, and social services.&lt;/p&gt;\n&lt;p&gt;Ideally the post holder will have had prior experience working with children with complex clinical health needs and delivering clinical care.&lt;/p&gt;\n&lt;p&gt;The hours will be term time only 3 days per week (24 Hours)&lt;/p&gt;\n&lt;p&gt;For further details/informal visits please contact&lt;/p&gt;\n&lt;p&gt;Nicki Davies- Team leader 01384321527&lt;/p&gt;\n&lt;p&gt;Email Nicola.Davies8@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicki DaviesJob titleTeam LeaderEmail addressNicola.Davies8@nhs.netTelephone number01384321522Additional contact information&lt;/p&gt;\n&lt;p&gt;Due to Covid worker please email any queries re the post&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brierley Hill Health and Social Care Centre, Brierely Hill", "postalCode": "DY5 1RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4817", "longitude": "-2.11787"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244738", "validThrough": "2020-11-10T23:59:59+0000"}