{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-10-28T09:45:44+0000", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals Birmingham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Directorate of Cardiology at HGS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Junior Specialty Doctor Higher&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is for a Junior Specialty Doctor Higher in Cardiology based at Good Hope Hospital, part of University Hospitals Birmingham NHS Foundation Trust. The post is full time. The successful applicant will work with the team of consultants, to provide and develop cardiology services for the Trust. The appointee will be expected to participate in undergraduate and postgraduate education. The post is intended as a whole time appointment but applicants wishing to work part-time will also be considered and the programme will be modified accordingly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;The Trust&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UHB is one of the largest teaching hospital trusts in England, serving a regional, national and international population.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our multiple sites, Birmingham Heartlands Hospital, Good Hope Hospital in Sutton Coldfield, the Queen Elizabeth Hospital Birmingham, Solihull Hospital and Community Services, and Birmingham Chest Clinic allow people to be treated as close to home as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We see and treat more than 2.2 million people every year across our sites and our hospitals deliver more babies than anywhere else in Europe.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a regional centre for cancer, bone marrow transplants, trauma, renal dialysis, burns and plastics, HIV and AIDS, as well as respiratory conditions like cystic fibrosis; thoracic surgery and have the largest solid organ transplantation programme in Europe.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We provide a series of highly specialist cardiac, liver and neurosurgery services to patients from across the UK.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are world-renowned for our trauma care and have developed pioneering surgical techniques in the management of ballistic and blast injuries, including bespoke surgical solutions for previously unseen injuries. We are a designated a Level 1 Trauma Centre and host of the UK’s only £20m National Institute for Health Research (NIHR) Surgical Reconstruction and Microbiology Research Centre (SRMRC).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have over 20,000 members of staff and we are committed to investing in their development and their health and wellbeing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in Cardiology at Good Hope Hospital. This post will provide an excellent opportunity to develop clinical skills in all aspects of cardiology, working as part of a multidisciplinary team in a busy department. The successful candidate will be involved in all aspects of the work of the Cardiology Directorate under the supervision of Consultant Cardiologists. A full range of training in adult non-invasive and invasive cardiac investigation and percutaneous coronary intervention is available. We provide round the clock 7 days a week primary PCI for ST elevation myocardial infarction. The post includes Cardiology on-call (from home) on a 1:8 basis shared with other Middle Grade Cardiology Staff. The post is pure Cardiology and has no General Internal Medicine commitment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should possess full registration. The MRCP or equivalent and previous Cardiology experience are essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you wish to discuss the post, please contact&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr R Watkin, Deputy Clinical Service Lead, telephone 0121 424 9127,&lt;/p&gt;\n&lt;p&gt;email richard.watkin@heartofengland.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Or Dr S Basavarajaiah, Consultant Cardiologist, tel 0121 424 7478,&lt;/p&gt;\n&lt;p&gt;email Sandeep.basavarajaiah@heartofengland.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for applications is 10th November 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull) - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "B75 7RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5674", "longitude": "-1.81204"}}, "title": "Junior Specialist Doctor (Higher) in Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245863", "validThrough": "2020-11-10T23:59:59+0000"}