{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-15T12:55:46+0100", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Community Staff Nurse&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Torquay Community Nurses are looking for a motivated and enthusiastic Band 5 community nurse to join the team. We are a large but supportive team who enjoys mentoring team members and students and is passionate about delivering quality care to the housebound patients. We worked in an integrated way with allied health care professionals within the locality.&lt;/p&gt;\n&lt;p&gt;We deliver high quality care to the housebound patients of Torquay and work as part of multidisciplinary team and in partnership with primary care and secondary care. We are a motivated and caring team to both patients and colleagues. The team is flexible and promotes a healthy work/home life balance. We are looking for a band 5 nurse who is compassionate, enjoys a challenge and is skilled in the delivery of holistic nursing care. We have an established training and induction plan for all new team members and experience in the community is therefore not essential.&lt;/p&gt;\n&lt;p&gt;The team covers all housebound patients for the GP surgeries of Torquay which includes a supportive role in managing patients within a care home environment in line with the national guidelines and initiatives.&lt;/p&gt;\n&lt;p&gt;For more information or for an informal discussion/visit please contact Corrinna Preston, Community Nurse Lead on 07825 027788 or Corrinna.preston@nhs.net. We look forward to hearing from you&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay ISU", "postalCode": "TQ1 3YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4675", "longitude": "-3.53032"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228254", "validThrough": "2020-11-15T23:59:59+0000"}