{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum inclusive HCA"}}, "datePosted": "2020-11-02T16:30:58+0000", "description": "&lt;p&gt;City &amp; Hackney Centre for Mental Health is a mental health hospital based at Homerton Hospital that provides assessment and treatment for male and female individuals experiencing acute mental health difficulties. Our vision is to provide optimum care and treatment to aid recovery and promote wellbeing prior to returning back within the community environment.&lt;br /&gt;An exciting opportunity has arisen on Conolly Ward which is one of the female wards within the hospital. As a Life Skills Recovery Worker, you will assist in the provision of outstanding recovery focused care as part of the nursing team and wider multi-disciplinary team.&lt;br /&gt;Our expectation is that you will be a highly motivated and dynamic team member; who is able to demonstrate quality therapeutic interactions with service users who require good support for their high dependency and complex needs. You are also expected to be working within the recovery model aims to help people with mental health problems to look beyond mere survival and existence. Supporting and encouraging clients move forward, set new goals and do things and develop relationships that give their lives meaning. You will work closely with the occupational therapy and psychology teams to offer recovery focused individual and group work with service users.&lt;br /&gt;You should also be able to reflect interactions through excellent documentation, and be able to develop effective lines of communication with members of the wider multidisciplinary team and other agencies with the support of the nursing team, and maintain effective team work. We will expect you to be highly resilient and resourceful, able to problem-solve, think on your feet and be able to bring a creative flavour to your work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post will require you to work a mixture of shift work (long days and night shifts) and a 9-5 working pattern.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Life Skills Recovery Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252860", "validThrough": "2020-11-22T23:59:59+0000"}