{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T17:30:26+0000", "description": "&lt;p&gt;This is an exciting opportunity to join an established community team based from Lings Bar Hospital, Gamston covering the area of Rushcliffe. The service is multi-disciplinary and supports people over 65 experiencing mental health problems or who have dementia.&lt;/p&gt;\n&lt;p&gt;Mental Health Services for Older People (MHSOP) is the major provider of mental health services to older people to the populations served by Nottinghamshire County, Nottingham City Primary Care Trusts and Bassetlaw Primary Care Trusts.&lt;/p&gt;\n&lt;p&gt;MHSOP’s Specialist Community Teams provide community based assessment and treatment for people of any age suffering from dementia (organic) and those people over the age of 65 years who are experiencing mental health problems (functional). We strive to be leaders in specialist mental health care and treatment, working in close partnership with the health and social care community. MHSOP works in close partnership with the Trust Involvement team to ensure that all service users are valued, listened to and receive high quality personalised care.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and motivated mental health nurse to join our busy and well established service within the Rushcliffe locality. We provide assessment, treatment and support for service users experiencing both organic and functional mental health problems.&lt;/p&gt;\n&lt;p&gt;You will provide Community Mental Health nursing input into the service. You will provide specialist assessments, duty cover and provide support and supervision to junior team members.&lt;/p&gt;\n&lt;p&gt;You will be a Registered Mental Health Nurse and have current NMC registration. You will have proven post qualification experience and have experience of working with this client group and of multi-disciplinary working. You will have a sound knowledge of risk assessment and be able to demonstrate sound evidence-based practice.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jayne Gething - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: jayne.gething@nottshc.nhs.uk / Telephone number: 0115 8542278&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG2 6PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9227", "longitude": "-1.10035"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256818", "validThrough": "2020-11-19T23:59:59+0000"}