{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-11-02T11:46:21+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the National Inpatient Centre for Psychological Medicine (NICPM) within the Leeds and York Partnership Foundation Trust Liaison Psychiatry department at Leeds General Infirmary.&lt;/p&gt;\n&lt;p&gt;The NICPM is a unique service with a long history of delivering individualised rehabilitation for people with severe and complex medically unexplained symptoms and physical/psychological multi morbidities. We see a range of diagnoses, including functional neurological disorder, chronic fatigue syndrome, complex PTSD and many others.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a NMC registered Mental Health Nurse who is able to work full-time on a 24 hour, 365 days per year rota. They will demonstrate their interest and suitability to become a member of the multidisciplinary team at this highly regarded national centre in their application and interview. While some experience of our client group is desirable, it is not essential, as we have a thorough induction process.&lt;/p&gt;\n&lt;p&gt;Some important components of our approach are the biopsychosocial model and improving occupational performance. We often treat patients whose physical health has deteriorated and as such you will have opportunity to work closely with people in a holistic manner, formulating and addressing the complex factors that can perpetuate illness.&lt;/p&gt;\n&lt;p&gt;If interested, you are invited to call us on 0113 39 27140 for an informal chat with one of our senior clinicians: Kairon Eustace-Tyson, Edward Nottingham or Thomas Fordham.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National Inpatient Centre, LGI, Leeds", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Clinical Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251892", "validThrough": "2020-11-16T23:59:59+0000"}