{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-10-16T09:58:03+0100", "description": "&lt;p&gt;&lt;strong&gt;Health Care Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Negotiable depending on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full Time / Part Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Earls Court Health and Wellbeing Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AT Medics is London’s largest Primary Care Provider, with a strong reputation for our focus on quality improvement and investing in people.&lt;/p&gt;\n&lt;p&gt;Collectively, we serve over 280,000 patients across 40 practices in 18 CCGs, and by joining AT Medics you will benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continuous learning and development programmes&lt;/li&gt;\n&lt;li&gt;Access to NHS discounts and NHS Pension&lt;/li&gt;\n&lt;li&gt;A comprehensive induction programme&lt;/li&gt;\n&lt;li&gt;4 weeks annual leave pro rata&lt;/li&gt;\n&lt;li&gt;Support from the clinical team and GP Director&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;AT Medics was founded by six GPs in 2004, our mission is ‘Improving Healthcare, Improving Lives’, and our services are characterised by great access, high quality, real innovation recognised and replicated at National level, and a real understanding of individual patient need.&lt;/p&gt;\n&lt;p&gt;We are expanding our services and have undergone a sustained period of growth; as a result we have exciting opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HCA key responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;New patient registration checks, completing any necessary paperwork and referrals&lt;/li&gt;\n&lt;li&gt;Urine dipstick testing and Phlebotomy&lt;/li&gt;\n&lt;li&gt;Injections, including B12, within level of training, staples / stitches removal, changing dressings&lt;/li&gt;\n&lt;li&gt;Adult Seasonal Immunisations (this requires training certificate, observation and PSD)&lt;/li&gt;\n&lt;li&gt;Provide lifestyle advice to patients making any necessary referrals for educational&lt;/li&gt;\n&lt;li&gt;Spirometry, asthma and diabetic checks and make sure the right templates are filled and coded&lt;/li&gt;\n&lt;li&gt;Perform alcohol questionnaires, mini-mental tests subject to competencies&lt;/li&gt;\n&lt;li&gt;Telephone patients for recalls, ECG recordings, Weight monitoring, BP Check, Recalls for QOF patients and LCS LTC target patients&lt;/li&gt;\n&lt;li&gt;Perform sexual health screens where appropriate and following agreed protocols&lt;/li&gt;\n&lt;li&gt;Re-stocking of all clinical areas and maintaining a stock and keeping all clinical areas clean&lt;/li&gt;\n&lt;li&gt;To maintain an adequate amount of clinical supplies and health promotion materials, maintain notice boards&lt;/li&gt;\n&lt;li&gt;To ensure that drug/vaccine refrigerator/s are running at the correct temperature on a daily basis and maintain a log&lt;/li&gt;\n&lt;li&gt;Covering reception when there is admin meeting weekly&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must have a deep understanding of health services, together with a passion for improving lives and improving healthcare.it is essential that you have experience in using System one software. Whilst you will bring your experience to the role, you will also receive significant support from the practice based clinical team, Regional GP Director and Senior Regional Manager as part of your development. Previous experience in an HCA role is essential.&lt;/p&gt;\n&lt;p&gt;I&lt;strong&gt;t is essential that you have at least 1 years experiance in either primary care or Dr surgeries.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you want to be part of a vibrant, forward thinking organisation and you share our ideals, take the first step by applying for this position.&lt;/p&gt;\n&lt;p&gt;If you have not heard from us within 4 weeks of the closing date you should assume you have not been short listed but we would like to thank you for your interest in our organisation.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "AT Medics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Earls Court Health and Wellbeing Centre", "postalCode": "SW5 0PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4929", "longitude": "-.192429"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229506", "validThrough": "2020-11-06T23:59:59+0000"}