{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum"}}, "datePosted": "2020-11-04T19:29:36+0000", "description": "&lt;p&gt;Band 7 Emergency Department Lead Educator in a busy Major Trauma Centre.&lt;/p&gt;\n&lt;p&gt;Have you ever wondered what it would be like to work in a dynamic Major Trauma Centre whilst being a stone’s throw from the beach and Dartmoor National Park, wonder no more, the time is now! Cycling, paddle boarding and sea swimming are not mandatory but are strongly encouraged in this department.&lt;/p&gt;\n&lt;p&gt;The Emergency Department at University Hospitals Plymouth sees well over 100,000 adult and paediatrics patients a year and is a dedicated Major Trauma Centre for the South West of England covering a large geographical area. We have recently had agreed funding in excess of £30 million to build a new Emergency Department and work is due to start in 2021.&lt;/p&gt;\n&lt;p&gt;The nursing team has seen several recent developments with an increase in the number of Band 7 Senior Sisters and an increase in Band 6 Sisters, this is an exciting time for a new nurse education lead to really shape how we train and educate our workforce for the next 5-10 years. Education of the workforce is at the heart of what we do, and with a rapidly changing medical and nursing workforce the educational needs are dynamic.&lt;/p&gt;\n&lt;p&gt;We are striving to grow and shape into a premier emergency department with a thriving nursing team, who will work closely with the medical team to deliver excellent care to all of our patients. We have a consultant education lead and now we need a nursing lead, is this you?&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic educator who can successfully plan and deliver a training program in line with the RCN Emergency Nursing Framework and differentiate between level 1 and level 2 nurses in the department. We are looking for someone with the ambition to negotiate a post graduate course for our staff to achieve these very competencies. We need to be delivering world class trauma nursing care and to do that we need a trauma nursing education plan which keeps us up to date with all of the national and international developments.&lt;/p&gt;\n&lt;p&gt;This post needs a true educator who is ready to take the next step in their career and lead the educational plan for this Major Trauma Centre into the next 5 years.&lt;/p&gt;\n&lt;p&gt;Please apply and you will be made very welcome by our phenomenal team.&lt;/p&gt;\n&lt;p&gt;For more information or an informal chat please contact David Smith - ED Matron on 01752 437880 or david.smith137@nhs.net&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Clinical Educator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256858", "validThrough": "2020-11-18T23:59:59+0000"}