{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc"}}, "datePosted": "2020-10-15T11:46:31+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About Role and Service&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;National Psychosis Unit (NPU) is looking for an enthusiastic Registered Mental Health Nurse, to join our busy team. We have great opportunities to work with experienced &amp; respected colleagues from all professions. The multi-disciplinary team is strong and expects collaboration on all areas of work – and new nurses joining the team will find a warm welcome as they are encouraged to engage fully with the team to work with service users.&lt;br /&gt;&lt;br /&gt;NPU is housed at Fitzmary 2 Ward in Bethlem Royal Hospital, near Croydon. NPU offers a total of 23 beds to male &amp; female service users living with a severe &amp; enduring psychosis that has proven difficult to treat in their home boroughs. Our primary task is to apply modern research and use creative, professional working to identify treatment pathways with service users. Our aim is that each service user will have the very best chance to engage in decision making and maximise their own recovery – even where previous approaches have proven unsuccessful, possibly on multiple occasions. The work is challenging but rewarding.&lt;br /&gt;&lt;br /&gt;Our service users are drawn from all areas on the country and they can struggle to engage with services or to join in formulation of care plans and pathways. Reasons for difficulties can often include, the distance from their home borough; the refractory nature of their illnesses; and the often lengthy process through multiple mental health services. At NPU the resources and experience will assist new staff to find innovative ways to engage the client group – and to reflect thoughtfully on the demands of the task.&lt;br /&gt;&lt;br /&gt;NPU is committed to evidence based practice and it will be an asset if postholders have an interest in research and in how it can be applied to nursing care work. There is a clear teaching aspect to the ward, with staff nurses receiving and cascading training as part of their routine work. &lt;br /&gt;SLAM is committed to the principle of learning from those who use our services, carers and families. We believe in the putting the service user at the centre of their own care process, and this is reflected in the day-to-day systems of all our wards. &lt;br /&gt;&lt;br /&gt;We will support the postholder first to complete all mandatory/statutory training, and then to consider planning their professional development. &lt;br /&gt;&lt;br /&gt;Our ward offers a national service, which means we are strongly resourced and motivated – but also means we require the very best staff in all roles, so that challenges can be overcome and service users can get the complex &amp; thoughtful support they need to progress. We support new staff well, but from an early stage staff nurses are expected to take on challenges and act as leads for roles that are important for the ward.&lt;br /&gt;&lt;br /&gt;We welcome applications from qualified RMNs, RNLDs or newly qualified students qualifying in 3 months&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;If successful at shortlisting stage you will be contacted regarding the next stage. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;**Please note that if you do not state the month and year that you have completed your Nursing qualification you will not be invited to the assessment.**&lt;br /&gt;&lt;br /&gt;Ward Name &amp; Location: Fitzmary 2, Bethlem Royal Hospital, Beckenham (Croydon)&lt;br /&gt;Patient Age Range: From 18 years&lt;br /&gt;Patient Gender: Mixed ward&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South London Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London Mental Health and Community Partnership (SLP) is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to rec&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Monks Orchard Rd, Beckenham BR3 3BX, Beckenham, London", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "Registered Mental Health Nurse (NHS), National Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228011", "validThrough": "2020-11-07T23:59:59+0000"}