{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum (incl of HCAS)"}}, "datePosted": "2020-10-16T11:01:13+0100", "description": "&lt;p&gt;&lt;span&gt;Clinical/Counselling Psychologist, Psychotherapist or CAT Therapist Wokingham CMHT Band 7 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Full time (part time considered) Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Good’ rating overall, being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Mental Health Team in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate multi-disciplinary team, in the heart of Wokingham, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A dedicated clinical/counselling psychologist or Psychotherapist/CAT Therapist you will have a passion for clinical work, exceptional communication and people skills and experience of delivering specialist psychological services to clients in a multidisciplinary setting.&lt;/p&gt;\n&lt;p&gt;Skilled in psychological assessment and formulation of complex presentations, and with knowledge of the range of evidence-based psychological interventions in adult mental health, you will have a thorough understanding of the theory and practice of appropriate specialised psychological therapies.&lt;/p&gt;\n&lt;p&gt;You will work as a valued member of the Wokingham Community Mental Health Team within Psychological Therapies, and will contribute to the delivery of evidence-based psychological therapy including direct delivery, supervision, consultation, teaching and joint working with multi-professional teams and colleagues.&lt;/p&gt;\n&lt;p&gt;Enthusiastic and capable, you will offer assessment, formulation, and therapeutic intervention to clients with complex and severe mental health problems referred to the service in line with most recent evidence and service model.&lt;/p&gt;\n&lt;p&gt;A dedicated mental health professional, you will take part in clinical audit activities and contribute to outcome measurement and review of the efficacy of psychological interventions within the service.&lt;/p&gt;\n&lt;p&gt;Communicating complex and sensitive information in a clear and professional manner, you will be resilient and calm when faced with situations that are highly emotive, distressing or abusive. An empathetic advocate for patients, their families and carers, you will work to support them to achieve their goals with the most relevant support available. You will enjoy working in a multidisciplinary team and be eager to share your knowledge with other health professionals.&lt;/p&gt;\n&lt;p&gt;Working autonomously, you will have experience of services that operate the Care Programme Approach successfully within teams with difficult caseloads requiring the application of highly skilled psychological assessments, formulation and intervention.&lt;/p&gt;\n&lt;p&gt;You will show great communication and teaching skills will be happy to contribute to the clinical supervision, training and line management, where appropriate, of assistant trainee or graduate psychologists or other professionals and will engage in appropriate research activities for audit and service evaluation.&lt;/p&gt;\n&lt;p&gt;Reliable and knowledgeable, you will have great IT skills and be familiar with various systems and software packages. You will need access to your own car, and be able to travel independently to locations across Berkshire.&lt;/p&gt;\n&lt;p&gt;Your enthusiasm and commitment will be rewarded with the support of a dedicated team that strives to create a progressive, warm and considerate environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Louise Harriss, Consultant Clinical Psychologist at Wokingham CMHT on 01 189 890 707 or email: Louise.Harriss@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise HarrissJob titleConsultant Clinical PsychologistEmail addressLouise.Harriss@berkshire.nhs.ukTelephone number01189 890 707&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Care Pathways Wokingham, Wokingham", "postalCode": "RG40 1XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4105", "longitude": "-.831558"}}, "title": "Clinical/Counselling Psych / Psychodynamic Psychother /(CAT) Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229789", "validThrough": "2020-11-08T23:59:59+0000"}