{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a. inc. HCA"}}, "datePosted": "2020-10-30T09:46:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Specialist Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Intermediate Care Southwark&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the South East London work on the NHS Long Term Plan an exciting opportunity has arisen for an Occupational Therapist to join our expanding Intermediate Care Service in Southwark. As an integrated health and social care service we deliver both the Urgent Response and Rehabilitation and Reablement pathways for residents of the London Borough of Southwark. Working in community you will be part of a large, dynamic and diverse multidisciplinary team that helps to prevent admission to, and accelerate discharge from emergency departments and acute wards at Guys, St. Thomas’, and King’s College Hospitals. As this role supports the interface between in-patient and community services, we are looking for people who may have experience in either setting, and ideally in both.&lt;/p&gt;\n&lt;p&gt;As one of a number of NHS Plan Accelerator sites across England you will be working at the forefront of the changes in delivery of community services which will influence the national delivery of high quality and more joined up care for patients and families. You will support the redesign of our urgent and emergency care pathways to ensure patients get timely access to the right level of care for their needs, relieving pressure on A&amp;E departments and hospital services.&lt;/p&gt;\n&lt;p&gt;In 2019 GSTT Community services were rated “outstanding” by the CQC and the team strives to constantly improve service delivery. Contributions from all staff are highly valued. We will provide professional development opportunities and support you to provide great care to our patients. We want to develop the right people, with the right skills and behaviours, at the right place, at the right time to deliver high quality, personalised, integrated care across Guys and St Thomas’ NHS foundation Trust and the London Boroughs of Southwark and Lambeth.&lt;/p&gt;\n&lt;p&gt;Our services operate 8am to 9.30pm seven days a week. Staff are expected to work late shifts and weekends on a rota basis. We are able to offer flexible working patterns to meet both staff and service need. We have access to pool cars for community visits.&lt;/p&gt;\n&lt;p&gt;At Guy’s and St. Thomas’ (GSTT) occupational therapy services aim to enhance health and wellbeing through the promotion of occupational performance and engagement by providing assessments, interventions and outcomes based on the occupational needs of individuals, groups or communities centred on engagement and participation in life roles. Outcomes are measured in relation to satisfaction, engagement, occupational performance, participation and wellbeing&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews: Week beginning 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSelena NgJob titleClinical Manager, Intermediate Care SouthwarkEmail addressSelena.Ng@gstt.nhs.ukTelephone number0203 049 5353&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Road, Peckham, Peckham", "postalCode": "SE15 2HP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4727", "longitude": "-.054315"}}, "title": "Senior Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249547", "validThrough": "2020-11-15T23:59:59+0000"}