{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa/ pro rata for part time staff"}}, "datePosted": "2020-11-03T15:46:28+0000", "description": "&lt;p&gt;An exciting opportunity is now available to the right candidate.&lt;/p&gt;\n&lt;p&gt;Do you have experience in developing and delivering quality education programmes? If so are you interested in joining our Practice Development team, supporting learners from a variety of backgrounds. You would be contributing to the development and implementation of a training strategy to support staff across the organisation. You would be delivering education on core essential clinical skills including moving and handling, intravenous cannulation, venepuncture and intravenous drug administration?&lt;/p&gt;\n&lt;p&gt;If the above sounds like you and you are an experienced healthcare professional we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Learning and Development Department is committed to providing all staff and learners at the Trust with access to quality education and training which supports their needs to provide quality patient care. We provide a diverse portfolio of teaching and learning activities using traditional and digital technologies within the department and across the Trust. The department’s work is aligned to the Trust strategies and engages in partnerships with local, regional and national bodies such as Health Education England and we host a number of regional and national projects. This ensures that the Trust is responsive to investing in the training needs of the current and future workforce. The department have received a number of awards and are accredited with the Skills for Health Quality Mark, the UK health sector’s standard for high quality education and training.&lt;/p&gt;\n&lt;p&gt;The Practice Development Team consists of a small group of healthcare staff who support the development of individuals and teams across STH and beyond. We do this by supporting staff in all specialties and at all levels of the organisation. We run a number of training programmes designed to help inform practice. These include but are not limited to:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clinical Skills&lt;/li&gt;\n&lt;li&gt;Display Screen Equipment Assessor Training&lt;/li&gt;\n&lt;li&gt;Evidence Based Practice&lt;/li&gt;\n&lt;li&gt;Moving and Handling&lt;/li&gt;\n&lt;li&gt;Shared Haemodialysis Care&lt;/li&gt;\n&lt;li&gt;Education in Cancer Care and Long Term Conditions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also provide an Ergonomic Advisory function, providing advice for staff and managers regarding workplace redesign to accommodate limitations in staff musculoskeletal health, and work with the estates commissioning teams to provide advice for all new build and refurbishment work to ensure environmental considerations for patient care and staff safety are taken into account at the outset.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated enthusiastic member of staff who is able to develop this role, challenge practice and support the development of staff’s competence across the range of core healthcare skills. The successful applicant will need to be able to work independently and collaboratively, meeting deadlines as required. They will need to have excellent interpersonal skills to influence staff across all disciplines and grades in the Trust. They will need to be able to keep up to date with the latest evidence based practice to ensure Trust policies and procedures continue to meet the needs of our patients and staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Nicky Sharpe (Learning and Development Manager)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: nicky.sharpe1@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 0114 2267338&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Angela Bennett (Learning &amp; Development Co-ordinator)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: angela.bennett20@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 0114 2715150&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Learning &amp; Development Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254626", "validThrough": "2020-11-17T23:59:59+0000"}