{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 pa pro rata"}}, "datePosted": "2020-10-25T12:18:44+0000", "description": "&lt;h2&gt;An exciting opportunity has arisen within the Health Visiting service based in Herefordshire, we are looking to recruit a qualified Health Visitor into the team, full or part time hours will be considered.&lt;/h2&gt;\n&lt;p&gt;As a Health Visitor you will have the opportunity to make a real difference in the health outcomes of the local population by contributing to the delivery of the Healthy Child Programme. If you want to make a real difference to the lives of young children in Herefordshire then join our team.&lt;/p&gt;\n&lt;p&gt;As part of the Health Visiting Team you will work across Herefordshire providing seamless care and support to our families and you will also have an important role in helping to recognise and protect vulnerable young children. Therefore, an experience of working within a multidisciplinary team and a sound knowledge of safeguarding is desired. You will be supported to engage in clinical and restorative supervision alongside regular safeguarding supervision.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal discussion about this post, please do not hesitate to contact Hannah Bannister-White (Health Visitor Practice Lead) - 07387 259160 or Nicky Barber (Health Visitor Practice Lead) - 07387 259159&lt;/p&gt;\n&lt;p&gt;Please note that a presentation will be required at the interview stage.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herefordshire", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241579", "validThrough": "2020-11-08T23:59:59+0000"}