{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-22T12:00:45+0100", "description": "&lt;h1&gt;&lt;strong&gt;Consultant in Microbiology&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;£79,860-107,668 per annum&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity to join the Clinical Microbiology team at the Royal United Hospitals (RUH) Bath NHS Foundation Trust. This is a substantive whole time replacement post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At RUH, you will join an enthusiastic and committed team comprising of a total of 3.75wte Consultant Microbiologists (including this post) and a laboratory manager. We are currently in the process of submitting a business case for a further 1.8wte post/s so that we can offer the trust increased Antimicrobial Stewardship and Infection Prevention and Control. We are looking for someone who is keen to support our ongoing commitment to improving hospital acquired infection rates and antimicrobial resistance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The laboratory services are performed by Public Health England staff. There is an on-site Hot Lab handling blood cultures, CSF and tissue samples with the majority of other microbiology and virology samples being processed at the Severn Pathology in Bristol. The laboratory in Bath has a cepheid machine enabling the laboratory to perform on-site processing of samples for C difficile, norovirus and influenza. We are part of the West of England Pathology network and have collaborated across the network to support Covid-19 testing using the Cepheid and other new platforms (Samba, Nudge). We run Covid-19 antibody testing out of the biochemistry unit on site. The microbiology department is situated in a new, purpose-built laboratory and has full UKAS ISO 15189 accreditation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Royal United Hospital Bath NHS Foundation Trust provides acute hospital services for approximately 500,000 people living in Somerset, Wiltshire and South Gloucestershire. The Trust provides a comprehensive range of acute services including medicine and surgery, services for women and children, accident and emergency services, and diagnostic and clinical support services. The pathology department provides services to the acute trust, a number of community hospitals and a wide rural GP catchment area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital is close to the beautiful and historic World Heritage City of Bath. Bath and the surrounding countryside is an exceptionally pleasant environment in which to work and live with superb cultural and leisure activities. There are excellent state and private schools in and around the city. With easy links to London, Bristol, the M4 and M5 motorways, and an increasing range of flights from Bristol airport to UK and Continental destinations, Bath is a cultural hotspot and an extremely sought after location to live in and work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Dr Sarah Meisner on 01225 825428 or the Pathology Clinical Director Dr Moya O’Doherty on 01225 824710.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Consultant in Medical Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238294", "validThrough": "2020-11-09T23:59:59+0000"}