{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 London Weighting + 1A On Call Su"}}, "datePosted": "2020-10-27T10:31:49+0000", "description": "&lt;p&gt;We have an exciting opportunity to join our a Neonatal team at Chelsea and Westminster Hospital. We&#39;re a busy neonatal unit and one of the two lead perinatal centres in the NW London Perinatal Network and also the designated neonatal surgical referral unit for the sector.&lt;/p&gt;\n&lt;p&gt;With a major redevelopment on the way there has never been a better time to join us. Our critical care project is a state-of-the-art expansion and redevelopment of our adult and neonatal intensive care facilities at Chelsea and Westminster Hospital. We have been working with our charity CW+ and a range of partners to design world-class intensive care units with optimal healing environments for patients and their families. The units will have bespoke lighting, acoustics and technology.&lt;/p&gt;\n&lt;p&gt;It will allow us to treat more critically babies every year, in world-class facilities which will benefit patients and their families. This is one of our biggest redevelopments to date and it will significantly increase the future capacity in these areas, allowing for the treatment of more patients every year in state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;We offer comprehensive neonatal training with emphasis on surgical neonates, multidisciplinary gastro-nutrition care and neuro-developmental outcomes of high risk babies. Our unit has a busy high – risk obstetric service, we deliver and stabilise cardiac babies prior to transfer to the Royal Brompton Hospital and have 24 hour all - level paediatric surgical and Anaesthetics cover for the unit. Please note that this post is only applicable to GMC registered doctors&lt;/p&gt;\n&lt;p&gt;Full-time or part-time applicants welcome.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nilesh Agrawal - Consultant neonatologist&lt;/p&gt;\n&lt;p&gt;Nilesh.Agrawal@chelwest.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Senior Clinical Fellow in Neonatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244030", "validThrough": "2020-11-10T23:59:59+0000"}