{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T13:31:18+0000", "description": "&lt;p&gt;These are exciting times for Cheshire and Wirral Partnership NHS Foundation Trust. We are looking for a temporary Band 3 Clinical Support Workers to work in our new, modern, 15 bedded Specialist Dementia Mental Health Inpatient Unit that has recently opened in Macclesfield. We have a successful structure of MDT working, which includes a Resource Manager, Occupational Therapy /Physio/ SALT/Dietician.&lt;/p&gt;\n&lt;p&gt;You will be part of a supportive multi-disciplinary team and have an ethos of collaborative working between individual service users, carers and other stakeholders.&lt;/p&gt;\n&lt;p&gt;We are proud of being caring, competent and compassionate, with patients at the heart of what we do. We aim to provide high quality, safe services which improve the health, well-being and independence of the people within our locality. We are looking for a motivated support worker to join our team. You should possess commitment to team working and excellent standards of care. You will be able to demonstrate a real enthusiasm for mental health care, as well as a desire for on-going professional development. You will receive excellent training opportunities for clinical development and regular supervision and appraisal.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team who strive to make a difference in the assessment and treatment of mental health patients, some also with complex physical health needs. The ward offers a 24 hour service; therefore the successful candidates must be able to work a full range of 12 hour shifts including night shifts and weekends.&lt;/p&gt;\n&lt;p&gt;In return, not only does CWP offer a comprehensive benefits package which includes an excellent pension scheme, 35 days annual leave on commencement (pro rata) inclusive of bank holidays which rises to 37 days after 5 years and 41 days after 10 years. CWP also offer a competitive salary based upon Agenda for Change which is part of the incremental pay progression. There are also regular opportunities for career progression throughout the organisation.&lt;/p&gt;\n&lt;p&gt;If you feel that this sounds like you, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Further information please contact Kate Chapman kate.chapman7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Silk Ward, Field Bank Rd, Macclesfield, Cheshire, Macclesfield", "postalCode": "SK10 3JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2637", "longitude": "-2.1432"}}, "title": "Clinical Support Worker - East", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250369", "validThrough": "2020-11-13T23:59:59+0000"}