{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37026", "minValue": "37026", "unitText": "YEAR", "value": "up to £37, 026 per annum - depending on experience"}}, "datePosted": "2020-11-01T03:48:38+0000", "description": "&lt;h2&gt;I treat more than just symptoms&lt;/h2&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;Interested in clinical development?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS/ALS (intermediate life support and advanced life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About HMP Stafford…&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HM Prison Stafford is a closed training prison which holds 751 category C people convicted of sexual offences. Modern buildings include Reception, Visits, Education, Kitchen, a 40 bed house block, Sports Hall and with a site adjacent to the prison was as an industrial workshop complex. 50% of our patients are over the age of 55 which leads healthcare services to have an emphasis on chronic disease management, frailty, complex case management, cancer care, palliative care and care of the dying.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;What do we need from you so you can do the job?&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Registered Nurse you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. With plenty of primary care experience, you could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;br /&gt;&lt;br /&gt;If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;In return for your hard work you will...&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £37, 026 depending on experience.&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP Stafford include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Next steps&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt;Amelia will submit your CV to the hiring manager and then will arrange an interview for you to attend at HMP Stafford if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;More information&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week across night shifts. We also welcome bank applications.&lt;/p&gt;\n&lt;p&gt;For more information, an informal discussion or to arrange an informal visit please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;This job advert will close as soon as a sufficient number of suitable applications have been received. Please apply for this job as soon as you can, if interested.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford", "postalCode": "ST16 3AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8115", "longitude": "-2.11843"}}, "title": "Primary Care Nurse (Nights) - HMP Stafford", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251157", "validThrough": "2020-11-16T23:59:59+0000"}