{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 per annum (pro rata)"}}, "datePosted": "2020-10-26T15:48:35+0000", "description": "&lt;p&gt;Thank you for your interest in working for The Mid Yorkshire Hospitals NHS Trust(Mid Yorks) as a Healthcare Assistant.&lt;/p&gt;\n&lt;p&gt;At Mid Yorks we provide hospital services, community services and intermediate care services from three hospital sites and in a range of community settings such as health centres, clinics, GP surgeries, family centres and in patients’ own homes.&lt;/p&gt;\n&lt;p&gt;Every employee at Mid Yorks strives to provide excellent patient experience every single time. As an employer, we strive to provide an excellent employment experience to every one of our employees, every day from the day they apply for employment with us. We have four core values, developed by our staff, and these are at the heart of everything we do to enable us to deliver our ambitions of excellence.&lt;/p&gt;\n&lt;p&gt;In this role, you will have the opportunity to personally make a difference to our patients’ lives and the lives of their carers and relatives every single day. Our Healthcare Assistants work at the heart of our multidisciplinary teams who support our patients by assisting the Registered Nurses in planning, delivering and evaluating care. This will require you: to be able to communicate effectively with a broad range of individuals, both verbally and in writing; to share our commitment to maintaining high standards in everything we do; and to demonstrate that you can work effectively within a team that behaves in accordance with our values.&lt;/p&gt;\n&lt;p&gt;The roles are varied and busy as you will be working a variety of shifts including ‘long days’, nights, weekends and bank holidays. We will support you to achieve full training for your core duties including achievement of a national Care Certificate, and we will support your continued development.&lt;/p&gt;\n&lt;p&gt;To be eligible to work as a Healthcare Assistant, we expect that you hold a &lt;strong&gt;work based &lt;/strong&gt;&lt;strong&gt;NVQ level 2&lt;/strong&gt; &lt;strong&gt;in a health- related subject &lt;/strong&gt;and Level 1 in Functional Skills/Key Skills in Numeracy and English. If you do not hold a Numeracy or English qualification you will be required to achieve this within 12 months of commencement in post.&lt;/p&gt;\n&lt;p&gt;If you need any help with your application or have any questions about the application process, our recruitment team will be happy to help you via &lt;span&gt;midyorks.resourcing@nhs.net&lt;/span&gt; or 01924 546148&lt;/p&gt;\n&lt;p&gt;Best of luck with your application!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewsbury/Wakefield/Pontefract", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243242", "validThrough": "2020-11-13T23:59:59+0000"}