{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806"}}, "datePosted": "2020-11-03T15:46:30+0000", "description": "&lt;p&gt;A 0.5 session post working in a department with a flexible approach in order to accommodate caring needs.&lt;br /&gt; &lt;br /&gt; We are seeking a new colleague with a special interest in Urological cancers to work alongside our surgical and oncology colleagues in the South West Wales Cancer Centre.&lt;/p&gt;\n&lt;p&gt;The Cancer Centre provides a high degree of specialisation for all the major cancers and comprises of in-patient facilities for Oncology and Malignant Haematology,, together with a chemotherapy and haematology day unit, with an aseptic unit on site.&lt;/p&gt;\n&lt;p&gt;The Centre is sited at our coastal located Singleton Hospital, which is adjacent to Swansea University and serves a population of over 900,000 across Swansea, Neath/Port Talbot, Carmarthenshire, Pembrokeshire, Ceredigion and parts of Powys.&lt;/p&gt;\n&lt;p&gt;With strong links to the University, there will be excellent opportunities for clinical research. The University has previously been nominated by The Times as Wales’ University of the Year.&lt;/p&gt;\n&lt;p&gt;Inexpensive properties, good schools and proximity to areas of outstanding natural beauty such as the Gower Peninsula and the Brecon Beacons National Park add to the attractive of living in South West Wales – while London is still only 3 hours away by train.&lt;/p&gt;\n&lt;p&gt;For full detail please see the attached Job Description.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Singleton Hospital, Swansea", "postalCode": "SA2 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6092", "longitude": "-3.98528"}}, "title": "Consultant Clinical Oncologist in Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254627", "validThrough": "2020-11-24T23:59:59+0000"}