{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-37,890 pro rata"}}, "datePosted": "2020-10-21T15:51:01+0100", "description": "&lt;p&gt;Our Living Well Team at Isabel Hospice is looking for a dynamic, motivated and adaptable Specialist Physiotherapist to take responsibility for providing and developing our specialist palliative therapy service that aims to optimise the quality of life of patients under the care of Isabel Hospice and those attending our Living Well Services. &lt;/p&gt;\n&lt;p&gt; You will work independently undertaking holistic assessments, at the In Patient Unit, at our Living Well with Isabel Hubs, and in the Community around Eastern Hertfordshire.  You will manage a caseload of patients with palliative care needs and implement effective and efficient symptom control and rehabilitation programmes for individuals and groups of patients and their carers referred to the service.    You will also be responsible for the day to day management of the Therapy Team and the delivery of therapeutic services across the organisation.  You will also assist in the development and evaluation of therapy services provided by Isabel Hospice, based on rehabilitative palliative care principles, responding to the challenges of the present climate in particular developing remote and virtual interventions.&lt;/p&gt;\n&lt;p&gt; To apply, you should hold a Degree or Diploma in Physiotherapy and be a member of the Chartered Society of Physiotherapy.  You will also need to be HCPC registered and able to assess and plan for patients with complex palliative care needs.  Your experience will need to be in either oncology, palliative care, neurological or respiratory conditions and should also include multi-disciplinary working.  You will need excellent organisational skills and be able to demonstrate management and leadership skills to be able to lead a team.  Membership of the Association of Chartered Physiotherapists in oncology and palliative care (ACPOPC) would be desirable.  Car owner/driver essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing date is 5pm Wednesday 18th November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isabel Hospice ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welwyn Garden City", "postalCode": "AL7 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8009", "longitude": "-.194002"}}, "title": "Specialist Physiotherapist and Therapy Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237166", "validThrough": "2020-11-18T23:59:59+0000"}