{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 3"}}, "datePosted": "2020-11-06T15:03:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join an experienced and dedicated team&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;Band 3&lt;br /&gt; Connections Day Services, Radstock&lt;br /&gt; 37.5 hours/week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a caring and enthusiastic Support Worker looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Support Worker within Virgin Care you’ll join a team who are focused on excellence and delivering positive outcomes for adults with learning disabilities based at Connections Day Services in Radstock.   &lt;/p&gt;\n&lt;p&gt;Your days will be rewarding and varied and include helping to provide a variety of activities and individualised support to our service users, who are adults with learning disabilities. Activities at the service include physiotherapy, groups to develop and promote communication skills, independence skills and general health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The duties of the Support Worker are to provide person-centred support, as described in the service user’s care plan, while the individual is at the day service. You will be responsible for facilitating groups and activities as well as working 1:1 with service users. You will also be responsible for being a keyworker for individuals which means: being a&lt;em&gt; &lt;/em&gt;main contact for the support of that individual, facilitating the person’s IPP meetings (internal service user review meetings) and working with the Support Co-ordinator to ensure a person’s support plans and risk assessments are up-to-date and accurate. You will be supervised by an experienced Support Co-Ordinator. Experience of working with adults with learning disabilities is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feel valued as a Support Worker with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; £19,500 salary&lt;/li&gt;\n&lt;li&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/li&gt;\n&lt;li&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/li&gt;\n&lt;li&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/li&gt;\n&lt;li&gt;Access to bespoke career pathways and opportunities to continue your professional development, and with this role you could complete an apprenticeship&lt;/li&gt;\n&lt;li&gt;Plus the benefits you’d expect from working with a Local Authority partner, including on-site parking and team training days&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/p&gt;\n&lt;p&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Claire Ramster via email: Claire.Ramster@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care is committed to safeguarding and protecting the people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Radstock", "postalCode": "BA3 3LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2891", "longitude": "-2.4317"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260275", "validThrough": "2020-11-20T23:59:59+0000"}