{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inclusive of HCA"}}, "datePosted": "2020-10-28T13:30:43+0000", "description": "&lt;p&gt;Are you looking for a challenge? Do you have post registration experience working within Integrated Sexual and Reproductive Healthcare Services?&lt;/p&gt;\n&lt;p&gt;LNWHUT is looking for an enthusiastic and motivated band 7 nurses to join our Integrated Sexual and Reproductive Healthcare Service.&lt;/p&gt;\n&lt;p&gt;Band 7 Clinic Nurse Manager ISRH – Ealing 37.5hrs per week&lt;/p&gt;\n&lt;p&gt;LNWHUT provides Integrated Sexual and Reproductive Healthcare Services across the boroughs of Ealing, Brent, Harrow and Hillingdon. The successful candidate will join an experienced multidisciplinary team, and contribute to the provision of sexual and reproductive healthcare of a high standard within the service based in the community of Ealing.&lt;/p&gt;\n&lt;p&gt;The successful applicant will require post registration qualifications in contraception and sexual health, with particular emphasis in the provision of contraception services.&lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The insertion and removal of subdermal implants&lt;/li&gt;\n&lt;li&gt;Intrauterine techniques&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will work with the MDT towards the development of staff, having the opportunity to influence the future for nurses working within sexual and reproductive healthcare services.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who have excellent interpersonal, communication and organisational skills, and a genuine passion for delivering contraception and sexual healthcare.&lt;/p&gt;\n&lt;p&gt;If you want to contribute to the development and delivery of integrated sexual and reproductive healthcare services within diverse communities, please apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKimberly DzvovaJob titleMatron - Integrated Sexual and Reproductive Healthcare ServicesEmail addressk.dzvova@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mattock Lane Health Centre, Ealing", "postalCode": "W13 9NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5099", "longitude": "-.315198"}}, "title": "Clinic Nurse Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246777", "validThrough": "2020-11-09T23:59:59+0000"}