{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 to £104,927 pa"}}, "datePosted": "2020-10-29T15:24:03+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Leeds Teaching Hospitals NHS Trust&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Associate Director of Finance – Financial Services&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Salary – AfC Band 9&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Teaching Hospitals NHS Trust (LTHT) is one of the largest and busiest acute hospital trusts in the country. Every year, LTHT provides healthcare and specialist services for people from the city of Leeds, Yorkshire and the Humber and beyond. We also play an important role in the training and education of medical, nursing and dental students and are a centre of world-class research and pioneering new treatments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our vision is to be the best for specialist and integrated care. Our staff helped to define the values and behaviours that we should work to so that we can achieve this vision. This has become known as ‘The Leeds Way’, and forms the foundation of our culture, our ethos and how we work every day. These values are – &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are patient-centred; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are fair; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are collaborative; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are accountable; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are empowered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to delivering the highest quality and safest treatment and care to every patient, every time. This starts with being a good employer, which means that we look after our people and support them to achieve the best they can as professionals and provide the best care for our patients. This has been more important than ever during the COVID-19 pandemic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Leeds Improvement Method (LIM) underpins all of our improvement work at LTHT. The philosophy of LIM is that everyone working in our hospitals feels empowered to make improvements in their daily work bringing the benefits of a safe, high quality experience, for every patient and every member of staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are working hard with our city partners to integrate our health care services, and ensure that our city and region get the recognition and investment we need to provide the people of Leeds and the wider region with the very best services. We are also collaborating across the wider region, as part of the West Yorkshire and Harrogate Health and Care Partnership.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our Trust has a strong track record of financial performance, having for a third consecutive year delivered a financial surplus. This has allowed us to make record levels of investment in maintaining and improving our hospitals and infrastructure. We have achieved Level 3 accreditation of the Future Focused Finance staff development programme and we have been recognised by the HFMA, as ‘Finance Team of the Year’. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are now seeking to appoint the key leadership role of Associate Director of Finance. Reporting into the Executive Director of Finance, the postholder will work at a strategic level supporting the provision of effective, high quality financial services. They will have responsibility for a number of areas, including: Capital Accounting; Financial Accounting; Treasury and Cash Management; Payroll (LTHT are a service provider to 14 NHS organisations) and Financial Transactions (Receivables, Payables, Financial Systems Support).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly skilled and ambitious individual, who can lead by example in terms of promoting and upholding the ‘Leeds Way’ and will continue to drive a culture of continuous improvement within the Directorate consistent with the Leeds Improvement Method.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This would be an excellent role for an aspirant Director of Finance to work within a high performing function and Trust. We welcome applicants from all sectors with the skills and experience to meet the remit of the role however, knowledge of NHS finances would be considered highly desirable. Most importantly, you will be an individual who operates with passion and integrity, demonstrates an inclusive and collaborative leadership style and upholds values which are aligned to those of our Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would particularly encourage applications from women and those from a BAME background to improve the diversity of the senior management team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Recruitment Timetable:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications close: &lt;/span&gt;&lt;span&gt;Sunday, 22 November&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Shortlisting Interviews: &lt;/span&gt;&lt;span&gt;w/c 30 November (To be held virtually) &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Final Interviews &amp; Assessments: &lt;/span&gt;&lt;span&gt;14 &amp; 15 December (To be held virtually) &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To discuss this post further or to request a copy of the information pack, please contact our recruitment partner Joe Joyce of The Finegreen Group on &lt;/span&gt;&lt;span&gt;enquiries@finegreen.co.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122972.jpg", "name": "Finance", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Associate Director of Finance - Financial Services (XN12)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248863", "validThrough": "2020-11-22T23:59:59+0000"}