{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-28T09:33:20+0000", "description": "&lt;p&gt;Interested about working within a forensic care environment?&lt;/p&gt;\n&lt;p&gt;We are seeking a person-centred, enthusiastic and dynamic Specialist Occupational Therapist to join our low secure mental health ward in Lincoln.&lt;/p&gt;\n&lt;p&gt;The Francis Willis Unit is a 15 bedded low secure forensic ward which cares for adult men who have both mental health diagnoses and contact with the criminal justice system. We are a recovery focused ward supporting patients to learn skills, manage mental health and successfully transition towards more independent living.&lt;/p&gt;\n&lt;p&gt;As an occupational therapist at the Francis Willis Unit there is opportunity to work alongside a supportive multi-disciplinary team and supervise an experienced OT assistant, gym instructor and Recovery College peer worker. Clinical supervision is available from a band 7 occupational therapist and there is a network of inpatient mental health occupational therapists for clinical support. The role encompasses the occupational therapy process with consideration of risk management and the limitations of a secure ward. There is lots of scope for service development to put your “own stamp” on the service.&lt;/p&gt;\n&lt;p&gt;As part of the benefits for working within the team we offer:&lt;br /&gt;•Local induction plans/programs which aims to support transitions into a forensic environment either as a newly qualified practitioner or for an individual with no previous knowledge of forensic care.&lt;br /&gt;•An excellent career development program working closely with the University of Lincoln&lt;br /&gt;•Weekly protected clinical group supervision/reflective practice facilitated by our Clinical Psychologist.&lt;br /&gt;•Regular management/clinical supervision and annual appraisal.&lt;br /&gt;•Free onsite parking.&lt;br /&gt;•Childcare vouchers, cycle to work schemes&lt;br /&gt;•Early access to our staff wellbeing service, psychology therapies and occupational therapy services such as physio.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a large county which can offer you whatever you are looking for, in both your personal or your professional life. The county has vibrant towns and the City of Lincoln at its core, as well as idyllic rural villages, offering a high quality of life with affordable living, excellent education and social life facilities – sound interesting?&lt;/p&gt;\n&lt;p&gt;LPFT offers an excellent benefits package, including up to £8k relocation, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Francis Willis Unit, Greetwell Road, Lincoln", "postalCode": "LN2 5UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2324", "longitude": "-.516409"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245839", "validThrough": "2020-11-11T23:59:59+0000"}