{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T14:30:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Occupational Therapist – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – The Dilke Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £24,907 to £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be part of our team…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucestershire Health and Care NHS Foundation Trust provides a range of services to Gloucestershire’s population of approximately 600,000 people. Our vision is to be the service people rely on, to understand them, and to organise their care around their lives. We value colleagues and support them to develop the skills, confidence and ambition to deliver our vision.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for an Occupational Therapist to join our Multidisciplinary Team within the Dilke Community hospital. The team consists of Medical, Nursing, Physiotherapists, Occupational Therapists, Assistants, Mental Health Liaison nurse and Adult Social Care colleagues. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Therapy service has been reconfigured to meet the challenges of the present Covid 19 situation and we hope to be able to use the lessons that we have learnt from this in shaping the services in the future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The ethos of the teams is a Rehabilitation, person-led approach to recovery and self-management and safe discharge planning whilst carrying out positive risks.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is a multifaceted role where you will be able to work closely with patients implementing the trusts rehabilitation standards as well as planning for a safe discharge home. This is an ideal opportunity for a Band 5 Occupational Therapist wanting the opportunity to work in a fast-paced community hospital environment with a variety of patients, often with complex needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are able to offer an induction, regular supervision and the opportunity to work in a supportive multidisciplinary team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;When applying for this position, please ensure that in your supporting statement, you make it clear as to how you meet the person specification especially the values and behaviours expected of all colleagues. This will figure largely in our short-listing criteria and the overall selection process.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal enquiries should be directed to the Michele Slater: Ward Manager 0300 421 8714 or Amy Wadley: Occupational Therapist Professional Lead 07980703353 amy.wadley@ghc.nhs.uk &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cinderford", "postalCode": "GL14 3HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8112", "longitude": "-2.51988"}}, "title": "Occupational Therapist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252424", "validThrough": "2020-11-16T23:59:59+0000"}