{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40797", "minValue": "25265", "unitText": "YEAR", "value": "£15.03 - £24.27 per hour"}}, "datePosted": "2020-10-09T16:49:32+0100", "description": "&lt;p&gt;We are looking for a Bank Registered Learning Disability Nurse / RNLDwith a passion for delivering the best quality of care,to join us at our brand new CAMHS service&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to pick up bank shifts on Mermaid Ward at Cygnet Joyce Parker Hospital.The ward is a 10 bed CAMHS PICU service with a 2 bed emergency place of safety suite for young people with severe mental illness&lt;/p&gt;\n&lt;p&gt;Cygnet Joyce Parker Hospital, our new state-of-the-art Child and Adolescent Mental Health Services (CAMHS) hospital in Coventry, is due to open in October 2020.&lt;/p&gt;\n&lt;p&gt;You will be expected to work as a part of a team to develop the service .We offer excellent training opportunity’s and will support you with your revalidation and offer additional CPD training&lt;/p&gt;\n&lt;p&gt;We work to create an inclusive work environment that is patient centred. We work collaboratively with external organisations including NHS England, local CCG’s and CQC.&lt;/p&gt;\n&lt;p&gt;We support all of our nurses to grow and develop their skills in our work place. In achieving this we ensure that our patients receive the best care and our staff continue to learn, develop and work within their scope of practice in accordance with NMC guidance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Meals on Duty&lt;/li&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;50 % NMC Registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;RCNI Membership&lt;/li&gt;\n&lt;li&gt;NHS Employee discount scheme&lt;/li&gt;\n&lt;li&gt;Bespoke Career Pathway&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit- Providing you with Fitness Programmes, Nutrition consultation and Health checks&lt;/li&gt;\n&lt;li&gt;Plus many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank Rates:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Week Days/Nights: £15.03 ph&lt;/li&gt;\n&lt;li&gt;Weekend Days/Nights: £17.92 ph&lt;/li&gt;\n&lt;li&gt;Bank Holiday Days/Nights: £24.27 ph&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your day-to-day…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Produce outstanding written reports based on your nursing assessments &amp; observations&lt;/li&gt;\n&lt;li&gt;Work closely with the management team to develop the service, audit, &amp; improve quality&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge &amp; promote nursing&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives &amp; other healthcare professionals&lt;/li&gt;\n&lt;li&gt;Administer medicines within healthcare procedure &amp; Healthcare Commission guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Experience as a Registered Nurse Mental Health Nurse / RMN or Learning Disability Nurse / RNLD with a current Pin Number&lt;br /&gt;•The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;br /&gt;•A good understanding of the Mental Health Act 1983 and latest nursing practices&lt;br /&gt;•A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;br /&gt;•Compassion, resilience and a dedication to empower and support service user independence&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•The ability to deputise in a clinical lead role&lt;br /&gt;•An interest in leadership, research and assessment&lt;br /&gt;•Experience with the client group&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Cygnet Health Care has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Cygnet Joyce Parker Hospital...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joyce Parker&lt;/strong&gt;was a caring and dedicated staff memeber at one of our services in the West Midlands who sadly passed away during the COVID pandemic. In her honour and remembrance we have named the hospital after her – Cygnet Joyce Parker Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joyce Parker Hospital&lt;/strong&gt;will support young people aged between 12 and 18 with mental health illness in psychiatric intensive care and low secure environments. The aim of service is to help young people stabilise and return home as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mermaid Ward&lt;/strong&gt;is a 10 bed CAMHS PICU service with a 2 bed emergency place of safety suite for young people with severe mental illness. This new service is due to open in October 2020.&lt;/p&gt;\n&lt;p&gt;The focus on Mermaid Ward is on stabilisation with a view on enabling transition to a general acute ward or back into the care of community services. The service is able to provide robust care and support for young people displaying significant levels of challenging behaviour.&lt;/p&gt;\n&lt;p&gt;The other services that will be provided at the hospital are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Dragon Ward&lt;/strong&gt;– a 12 bed CAMHS low secure service for young people with complex mental health needs, which may include a co-morbid presentation of disordered eating (opening early 2021)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Centaur Court&lt;/strong&gt;– 5 individual flatlet pods for young people that are stepping down from a hospital setting and are ready to trial independent living (opening early 2021).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are a passionate, highly driven nurse looking to make a difference to patients’ lives - we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Apply now to enjoy excellent career prospects whilereaping the rewards of making a difference to others – every day.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry", "postalCode": "CV2 4FN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4096", "longitude": "-1.49177"}}, "title": "Bank Registered Learning Disability Nurse (RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221184", "validThrough": "2020-11-16T23:59:59+0000"}