{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37772", "minValue": "37772", "unitText": "YEAR", "value": "£37772.41 Per annum + £5K Welcome Bonus"}}, "datePosted": "2020-10-13T12:56:00+0100", "description": "&lt;p&gt;Are you looking for an exciting new challenge? Do you want to join a service where you can make a difference every day? If so, we have the perfect role for you!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Priory Calverton Hill provides acute adult mental health services, delivered in partnership with Nottinghamshire Healthcare Trust, at our purpose built facility in Arnold.  &lt;/p&gt;\n&lt;p&gt;* We will be opening our new PICU service shortly - Male Service * .&lt;/p&gt;\n&lt;p&gt;The role of a Charge Nurse is to lead by example and be a role model for the nursing team. We are looking for an individual who is able to support junior staff in their professional development, through excellent and effective clinical leadership, mentoring, teaching and sharing of knowledge and practice.&lt;/p&gt;\n&lt;p&gt;• Registered Learning Disability Nurses (RNLD)or Registered Mental Health Nurse (RMN) with an ACTIVE, NMC PIN Registration.&lt;/p&gt;\n&lt;p&gt;• If you are motivated, flexible and ready to take on a new challenge&lt;/p&gt;\n&lt;p&gt;• Would like to work as part of an established hospital, with a collaborative and supportive MDT, that provide a clear pathway for the patients in our care.&lt;/p&gt;\n&lt;p&gt;• Focused on patient centred care.&lt;/p&gt;\n&lt;p&gt;• Have a commitment to developing and delivering high quality care&lt;/p&gt;\n&lt;p&gt;• Possess, or be ready to develop effective decision making skills&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About our benefits&lt;br /&gt;&lt;br /&gt;In return for your expertise and hard work you can move onto a career pathway to suit your ambitions and further your career at Priory.&lt;/p&gt;\n&lt;p&gt;Sign on bonus - £5,000 Welcome to Priory – either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/p&gt;\n&lt;p&gt;Back pay any increase in salary whilst employees are awaiting their PIN registration&lt;/p&gt;\n&lt;p&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/p&gt;\n&lt;p&gt;Moving less than 100 miles up to £2,000 (To be repaid if individual does not complete probation &amp; leaves)&lt;/p&gt;\n&lt;p&gt;If more than 100 miles up to £4,000 (To be repaid if individual does not complete probation &amp; leaves)&lt;/p&gt;\n&lt;p&gt;Payment into the pension scheme&lt;/p&gt;\n&lt;p&gt;CPD top up&lt;/p&gt;\n&lt;p&gt;Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt;Free parking on site and free meals whilst on duty &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;****Calverton Hill are also recruiting for a number of other nurse vacancies so please enquire****&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CALVERTON", "postalCode": "NG5 8PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0314", "longitude": "-1.11149"}}, "title": "CHARGE NURSE RMN/RNLD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224375", "validThrough": "2020-11-27T23:59:59+0000"}