{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27000", "minValue": "27000", "unitText": "YEAR", "value": "£27,000 per annum FTE"}}, "datePosted": "2020-10-20T16:14:20+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;The Barnsley PCN is recruiting for a full time Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Barnsley has established one “super” Primary Care Network of over 250,000 patients which includes all of GP practices across Barnsley. This is supported by six Neighbourhood Networks building on our successful and existing model of neighbourhood working; this enables us to maintain and focus on the specific needs of each local area whilst allowing integration at a borough wide level.&lt;/p&gt;\n&lt;p&gt;Barnsley leads the way in recognising the benefits that Clinical Pharmacists and technicians bring to patients when based in primary care. These roles have successfully delivered additional capacity and capability to the workforce; increasing access, reducing waiting times and enabling more proactive earlier interventions for more patients particularly improving the quality of medicines related interventions and outcomes.&lt;/p&gt;\n&lt;p&gt;The PCN pharmacy technician is pivotal to improving the quality of care and operational efficiencies so requires motivation and passion to deliver an excellent service within primary care.&lt;/p&gt;\n&lt;p&gt; The PCN technician will develop towards carrying out discharge medicines reconciliation, care homes medicines reconciliation, audits, high risk drug monitoring, prescription and medication queries, QIPP related projects, medicines policies and procedures, QOF and local incentive schemes, audit and medicines safety. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure you aplication includes your professional registration bosy and registration number. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5434", "longitude": "-1.45718"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235182", "validThrough": "2020-11-29T23:59:59+0000"}