{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-27T15:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Medical Microbiologist / Consultant in Medical Microbiology and Infectious Diseases &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time – Permanent - 10 PAs plus 1 PA on-call &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint to the post of a Consultant Medical Microbiologist / Consultant in Medical Microbiology and Infectious Diseases. The post is a result of retirement vacancy. The successful candidate will work with a team of 2 other consultants and 2 clinical scientists to provide a routine Clinical Microbiology service for Wirral University Teaching Hospital ( WUTH), Clatterbridge Hospital and Wirral Primary Care.&lt;/p&gt;\n&lt;p&gt;The post-holder will be given the exciting opportunity to lead the award-winning, well-established Outpatient-Parenteral Antibiotic Therapy (OPAT) service. They will also be expected to develop sub-specialty interests to complement those of the existing consultants. Supplementary roles such as a patient- facing clinical sessions can be negotiated over and above the standard contract, according to the needs of the service and mutual agreement.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at Arrowe Park Hospital where most inpatient wards are located. The diagnostic laboratory is Chester and Wirral Microbiology Service (CWMS) and is jointly owned by WUTH and Countess of Chester (COCH) NHS Trusts. It is located in Bromborough, Wirral.&lt;/p&gt;\n&lt;p&gt;On-call is part of the job requirement being a 1:3 for Infection Control covering WUTH and 1:8 for medical microbiology covering 3 Trusts in the region.&lt;/p&gt;\n&lt;p&gt;Candidates for the post must hold Full and Specialist registration (and with current a license to practise) with the General Medical Council (GMC), or be eligible for registration within six months of interview.&lt;/p&gt;\n&lt;p&gt;Applicants that are UK trained, must ALSO be a holder of a Certificate of Completion of Training (CCT), or be within six months of award of CCT by date of interview. Applicants that are non-UK trained will be required to show evidence of equivalence to the UK CCT.&lt;/p&gt;\n&lt;p&gt;Applicants should have substantial experience of clinical and diagnostic microbiology. Experience in Infection Control is desirable. It is expected that the appointee will hold Fellowship of the Royal College of Pathologists by examination or show evidence of equivalent training and experience.&lt;/p&gt;\n&lt;p&gt;Applications are invited from enthusiastic individuals who would be willing to work in a clinically orientated department.&lt;/p&gt;\n&lt;p&gt;Informal enquiries and requests to visit are very welcome and should be made to Dr Kavya Mohandas, Clinical Lead for Microbiology on 0151 678 5111 (ext 2917) or kavya.mohandas@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Consultant Medical Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245153", "validThrough": "2020-11-24T23:59:59+0000"}