{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 to £53,459 pa Inc HCAS"}}, "datePosted": "2020-11-02T03:45:55+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Matron Specialist Surgery – (Head and Neck)&lt;/span&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Band 8a – 37.5 hours&lt;/span&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Ashford &amp; St Peter’s Hospitals, Theatres, Anaesthetics, Surgery &amp; Critical Care Division (TASCC) are looking to appoint an exceptional nurse leader into the role of Matron for Specialist Surgery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will provide visible leadership within the busy and energetic eye ward, eye unit and the ENT and maxillofacial departments.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Matron is a key member of the specialist surgical management team providing senior nursing leadership for the service working in close collaboration with the Divisional Chief Nurse, Associate Director of Nursing and Service Manager for the Division.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and motivated nurse leader who has extensive experience at band 7 or above and recognised as a credible practitioner. You will have excellent leadership skills and will act as a role model. The post holder will oversee the surgical nurse portfolio within the Ashford &amp; St Peter’s with particular responsibility for providing high quality services and ensuring that professional standards are maintained. This role requires a dynamic, confident leader who can influence practice by utilising excellent leadership and motivational skills. The ability to challenge and influence practice is essential, as is a passion for high quality patient care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return we can offer excellent developmental opportunities within an established and supportive nursing and medical leadership culture with links to Surrey University. The role will give the successful candidate an insight into leadership at senior level within the organisation and also an overview of the operational running of the wards.  There will be the opportunity to be a driving force in the nursing strategy but also for the overall change management and service improvement. This is an exciting and dynamic time which will appeal to forward thinking and motivated individuals with a commitment to patient experience, staff development and service improvement. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Sue Sexton, Divisional Chief Nurse on 01932 722422 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Matron, Specialist Surgery - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251219", "validThrough": "2020-11-11T23:59:59+0000"}