{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-01T16:01:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse, Regional Renal Ward/ Acute Dialysis Team, Southmead Hospital, Band 5 (Experienced)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about nursing in our Renal Ward /Acute Dialysis Team at Southmead Hospital. Here are some of the reasons we’re unique…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are part of the Richard Bright Renal Unit, a regional renal transplant centre with six Haemodialysis Satellite Units across Bristol area. Our Trust is a centre of excellence for the delivery of care for people with renal impairment and our teams are proud to participate in pioneering clinical trials, including H4RT, Prepare for Kidney Care and the Bioempendence Trial.&lt;/li&gt;\n&lt;li&gt;As a nurse working in our service you will be supported to learn the skills required to manage patients requiring renal replacement, both haemodialysis/haemodiafiltration and peritoneal dialysis, as well as gaining experience looking after those patients who have undergone a kidney transplant.&lt;/li&gt;\n&lt;li&gt;We are passionate about professional development. Within our Individual Performance Reviews, our nurses can share their personal career aspirations with the senior team and discuss opportunities available for additional training, including external specialist renal courses and internal management training hosted by the Learning and Development team at our Southmead site.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just our Acute Dialysis Team which are impressive; our trust itself is pioneering, progressive and proud. Let us tell you a little more about it…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our nurses don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;Our staff are consulted on equity issues across the trust within equality and development groups, and given the mentoring and support to succeed. Our trust supports the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Haemodialysis nurse with the passion and talent to progress clinically and professionally?&lt;/li&gt;\n&lt;li&gt;An experienced nurse who would like to learn new skills within an exciting specialty&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have a vacancy within our Acute Dialysis Team, who carry out haemodialysis/hemofiltration and plasma exchange as well as our ward nursing team; both roles are based within the Renal Ward. No previous renal experience is required as we will teach you everything that you need to know. However if you have haemodialysis skills and would like to work in a more acute setting the Acute Dialysis Team could be just what you are looking for. Informal visits or discussions are very welcome if you wish to explore this opportunity, see contact details below.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Yes, that’s me. What do I do next?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Email Nursing@nbt.nhs.uk to arrange an informal visit to the department.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into nursing within our trust (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like to find out more please contact&lt;/p&gt;\n&lt;p&gt;Jacqui Caskey &lt;strong&gt;jacqui.caskey@nbt.nhs.uk &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fiona Wilkes – Fiona.wilkes@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Gemma Stafford – gemma.stafford@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brunel Building, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse- Renal- Band 5 (Experienced and Newly Qualifying)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209218", "validThrough": "2020-11-15T23:59:59+0000"}