{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 agenda for change annex U applie"}}, "datePosted": "2020-10-27T11:46:28+0000", "description": "&lt;p&gt;We are looking for candidates who are interested in training towards being a Diabetic Retinopathy Screener Grader or are already qualified Screener/Graders.&lt;/p&gt;\n&lt;p&gt;The training involves completion of a two year diploma and on the job support and training. You will be working from Ropewalk House and will travel to and from healthcare settings within Nottinghamshire including prisons undertaking screening clinics.&lt;/p&gt;\n&lt;p&gt;Key duties involve preparing the patient for screening, carrying our visual acuity tests, administering eye drops, photograph the retina, and assess the images. Grading of images involves reviewing the images against the national critiera. Tests are carried out in the community and once experienced, Screeners will be lone workers, with support available remotely.&lt;/p&gt;\n&lt;p&gt;For the trainee post, applicants must be educated to A level standard and be proficient within using a computer and software packages. Previous experience in customer care and in the field of science, healthcare or photography is a must. For the qualified position, applicants must hold the Diploma and have experience of working in the field.&lt;/p&gt;\n&lt;p&gt;You will be able to work both as part of a team and independently in developing and delivering the programme and must present excellent communication skills within the multidisciplinary team. You will be accountable in carrying out clinical duties associated with the role and are expected to work in line with National Quality Assurance Standards. Applicants must demonstrate excellent planning and organisational skills along with confident decision making and effective problem solving. Effective teamwork is an important element of the role and we encourage you to speak up regarding new ideas and support development. A variety of essential tasks alongside screening and grading will be required including data collection and analysis, liaising with a number of internal and external contacts and involvement in service improvement projects, therefore your enthusiasm for a career in Diabetic Eye Screening must be evident.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marc Thorley Programme Manager&lt;/p&gt;\n&lt;p&gt;Email address marc.thorley@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07812275530&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ropewalk House, Nottingham", "postalCode": "NG1 5DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9543", "longitude": "-1.15884"}}, "title": "Diabetic Eye Screener Grader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244299", "validThrough": "2020-11-10T23:59:59+0000"}