{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-06T08:16:48+0000", "description": "&lt;p&gt;&lt;span&gt;Band 7 Cognitive Behaviour Therapist, Full time East Hub Integrated Community Care Teams, Small Heath Birmingham.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated CBT Therapist interested in working in our multidisciplinary community service&#39;s for adults with complex mental health needs based at Small Heath Community Mental Health Team and Riverside Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;The post holder will have the opportunity to work with people who present with psychosis, personality disorder and treatment resistant problems such as depression, OCD, PTSD and complex trauma. The individual will have excellent opportunities to gain experience of multilevel and integrated service provision and to further develop skills of complex case assessment, formulation and the application of evidence based psychological interventions, both individual and in groups. Other exciting opportunities include facilitating reflective practice groups, leading team workshops, supervising others with research and clinical work and service development projects.&lt;/p&gt;\n&lt;p&gt;You would be joining a wider service with over 40 psychological services staff, where you would be managed and supervised by experienced psychologists who will support your learning and professional development needs offering a range of clinical models.&lt;/p&gt;\n&lt;p&gt;We have an active and stimulating CPD programme and you would have protected CPD time. We have long and well established links with local Doctoral training courses alongside hosting regular placements for MRES, MSCi and undergraduate programmes.&lt;/p&gt;\n&lt;p&gt;The post will be based in Small Heath Health Centre and will cover 2 CMHT Teams.&lt;/p&gt;\n&lt;p&gt;For further information, contact: Dr Shazma Thabusom, Principal Clinical Psychologist, on 0121 301 7200 or 07999150565.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSHAZMA THABUSOMJob titlePRINCIPAL CLINICAL PSYCHOLOGISTEmail addressshazma.thabusom@nhs.netTelephone number07999150565&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Small Heath health centre, Birmingham", "postalCode": "B10 0PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4708", "longitude": "-1.86581"}}, "title": "Band 7 Cognitive Behaviour Therapist - ICCR Small Heath and Riverside", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258878", "validThrough": "2020-11-16T23:59:59+0000"}