{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus HCAS"}}, "datePosted": "2020-10-28T12:16:36+0000", "description": "&lt;p&gt;An opportunity as arisen for an enthusiastic experienced Community Mental Health Nurse within the Health and Adult Social Care Service (HASS) in the London Borough of Redbridge&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the opportunity to work within a multidisciplinary team and with other members of social care sector within HASS.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough understanding of mental health assessment and interventions .&lt;/li&gt;\n&lt;li&gt;An understanding and experience of working with Older Adults in a mental health setting.&lt;/li&gt;\n&lt;li&gt;Experience and knowledge of using CPA (Care Programme Approach) and managing a case load whilst working as a care coordinator .&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide individual assessments and interventions applying evidence based practice&lt;/li&gt;\n&lt;li&gt;In conjunction with service users and the MDT, continually work towards improving and maintaining high standards by initiating and developing new ideas and methods.&lt;/li&gt;\n&lt;li&gt;Build and maintain excellent communication with other members of the MDT and colleagues from community health and social care&lt;/li&gt;\n&lt;li&gt;Provide supervision to STR’s and other lower band nurses and nursing students.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLynn ChristoforouJob titleClinical Lead NurseEmail addresslynn.christoforou@nelft.nhs.ukTelephone number07534220265&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Health &amp; Social Care Seven Kings, Newbury Park", "postalCode": "IG2 7SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5797", "longitude": ".100086"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246520", "validThrough": "2020-11-11T23:59:59+0000"}