{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Hourly"}}, "datePosted": "2020-11-02T13:16:44+0000", "description": "&lt;p&gt;The Royal Free London Foundation NHS Trust, an organisation with a real sense of community we actively support and develop our staff to ensure our patients receive the best quality care. Join our team and support our vision of delivering the right care first time, every time.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit caring, professional, suitably qualified Doctors to work across all grades and specialties on a bank basis. Here at the Royal Free we are keen to grow our existing team of Bank Doctors and are looking for Doctors on an ‘&lt;em&gt;as and when&lt;/em&gt;’ basis, across, but not limited to, the following specialties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Anaesthetics&lt;/li&gt;\n&lt;li&gt;General Medicine&lt;/li&gt;\n&lt;li&gt;Obstetrics &amp; Gynaecology&lt;/li&gt;\n&lt;li&gt;Orthopaedics&lt;/li&gt;\n&lt;li&gt;Paediatrics&lt;/li&gt;\n&lt;li&gt;General Surgery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are looking for your next role in a friendly hospital or are seeking flexible work that fits around your other commitments, this could be the right role for you. In return for your hard work, commitment and reliability Royal Free London NHS Foundation Trust offers a range of benefits to bank doctors, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive pay rates, with weekly pay&lt;/li&gt;\n&lt;li&gt;Assistance with clinical appraisals and revalidation support&lt;/li&gt;\n&lt;li&gt;Access to NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Long and short term placements, choice of available shifts&lt;/li&gt;\n&lt;li&gt;Experience of working on various wards and across specialties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our acute services are predominantly delivered from our three major sites at the Royal Free Hospital in Hampstead, London, Barnet General Hospital in Barnet and Chase Farm Hospital based in Enfield. All are served by excellent public transport links and have onsite parking or nearby off site free parking.&lt;/p&gt;\n&lt;p&gt;**If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert**&lt;/p&gt;\n&lt;p&gt;Please read the guidance for applicants and completing the application form documents prior to completing your application form (documents are located to the right).&lt;/p&gt;\n&lt;p&gt;We are an equal opportunities employer and welcome all applications irrespective of age, disability, gender, sexual orientation, race or religion. The Trust is a Disability Confident employer and as such, applicants with disabilities will be offered an interview providing they meet the minimum criteria for the post (outlined in the Person Specification). In order to facilitate applications from all members of the community the Trust is able to offer services including Braille Applications and Interpreting Services.&lt;/p&gt;\n&lt;p&gt;The Trust may close any advertised post before the stated closing date. We recommend that you apply as soon as possible.&lt;/p&gt;\n&lt;p&gt;If you have not heard from us within 3 weeks of the advert closing date, regretfully you should assume that your application has been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note, you must have at least 6 months experience in an NHS setting in order to proceed with joining our Bank. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Temporary Staffing&lt;/p&gt;\n&lt;p&gt;Email address: rf.tsrecruitment@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0207 794 0500&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free, Barnet &amp; Chase Farm, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Bank Medical Locum Doctor FY2 - ST3+", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252211", "validThrough": "2020-11-08T23:59:59+0000"}