{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-16T12:16:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Norfolk Community Health and Care NHS Trust in West of Norfolk have an opportunity for an experienced Band 5 Nurse to join our community team. West IV Team / Virtual Ward based at St James Clinic, King’s Lynn. We are looking for a dynamic and motivated nurse to join our friendly professional , busy team with a passion for community nursing to provide Intravenous Therapy visiting patients in their own home / care homes and community hospital to support early discharge from the Acute Trusts and also assisting with Admission Avoidance. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience of IV administration, phlebotomy, PICC/central lines and cannulation would be of benefit as well as being able to work alone. Full training will be provided but you will be required to have post qualifying experience in IV therapy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be working within the Intermediate Care Services so may also be required to work alongside the Virtual Ward Community Team based also St James Clinic, as well as support the community nursing teams when required. As a Trust, we recognise that many nursing skills are transferable and if you have a commitment to learn we will support you in your role. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our location enables easy access to Cambridgeshire, South Lincolnshire, and Central Norfolk for easy commuting to work. We welcome both experienced community nurses, nurses wishing to move into a community setting and nurses with Acute experience. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These posts are full time posts, we would also consider flexibility in hours to work part time if you wish to discuss informally please contact Jinty Harris 07766785791 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you share our vision to improve the quality of people’s lives, in their homes and community, by providing the best in integrated health and social care, we would love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Supervision will be provided by a Senior Registered Nurse. We offer the opportunity to work in an experienced and supportive team with opportunities for on-going professional development. We are proactive in supporting staff development along with listening to any new ideas that will improve the service we provide. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJinty HarrisJob titleClinical Operations ManagerEmail addressjinty.harris@nchc.nhs.ukTelephone number07766785791&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James Clinic, Kings Lynn", "postalCode": "PE30 5NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7492", "longitude": ".410179"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230145", "validThrough": "2020-11-08T23:59:59+0000"}