{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-23T12:13:43+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 5 Mental Health Nurse Post in the Shropshire Crisis Resolution Home Treatment (CRHT) Team&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Band 5 Mental Health Nurse, registered with the Nursing and Midwifery Council.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CRHT Team provides a community based Adult Acute Mental Health, needs led assessment and intervention service to service users in the county of Shropshire. The multidisciplinary team provides effective and therapeutic treatments/activities at home as an alternative to hospital admission or to augment the care already being received by other community pathways.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will provide you with an opportunity to develop and professionally extend your community service knowledge, learn new skills within the role, enhance your knowledge of integrated community working and be a part of exciting and new service developments. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is essential that you possess the skills to work as part of a team and the confidence to work autonomously. You should possess the capabilities and enthusiasm to take on the challenges of a changing, modern day community mental health service where effective liaison with multiple statutory and 3&lt;/span&gt;&lt;span&gt;rd&lt;/span&gt;&lt;span&gt; sector organisations is often critical in supporting the recovery of our service users and supporting their carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will be supported through clinical, peer and management supervision. The successful candidates will also have the opportunity to expand their knowledge, skills and gain experience within the urgent care mental health pathway. Our catchment area is Shropshire-wide (excluding Telford), with the team being based at Redwoods Centre in Shrewsbury.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; IT skills and car driver essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a 24 hour service and team members are all practitioners are required to work rostered shifts including weekends and nights.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Requests for part time hours / job share may be considered if deemed appropriate by the appointing manager. If you are a student nurse nearing completion of your training, please do fee free to speak with us before you apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If prior to the interview you would like to come and meet the team or simply want to call and talk about the position and role, you are welcome to speak with either Gary Joy, Operational Lead or Jane Chandler, Clinical Lead on 01743 210100.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We look forward to receiving your application.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7076", "longitude": "-2.79477"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240456", "validThrough": "2020-12-20T23:59:59+0000"}