{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata for part-tim"}}, "datePosted": "2020-10-20T15:31:23+0100", "description": "&lt;p&gt;Band 6 Occupational Therapist&lt;/p&gt;\n&lt;p&gt;We are looking for passionate, professional and person centred Occupational Therapists to work with older adults with a range of mental health needs.&lt;/p&gt;\n&lt;p&gt;Mental Health Services for Older People Directorate (MHSOP) is the major provider of mental health services to older people in Nottingham and Nottinghamshire. It delivers a range of Community and Inpatient based assessment and treatment for people of any age with dementia and those people over 65 years experiencing other mental health needs. We strive to be leaders in specialist mental health care and treatment, working in close partnership with the Trust Involvement Team to ensure that all service users are valued, listened to and receive high quality personalised care.&lt;/p&gt;\n&lt;p&gt;Intensive Home Treatment Teams – Gedling based at Highbury Hospital.&lt;/p&gt;\n&lt;p&gt;We have redeveloped our seven day service teams to provide a more reactive service to support our patients remain independent and in their own homes. The service operates 8am – 8pm seven days a week providing an intensive multi-disciplinary home treatment service for an eight week period. The Occupational Therapists provide an essential role managing their own case load and supporting the team including the community support workers to effectively support patients in their recovery.&lt;/p&gt;\n&lt;p&gt;Community Mental Health Team – Rushcliffe based at Lings Bar Hospital&lt;/p&gt;\n&lt;p&gt;Occupational Therapy provides an essential role supporting patients in their own homes, operating office hours. You would manage your own occupational therapy caseload and support the multidisciplinary team with duty and other generic assessments. Liaising closely with other teams e.g. home intervention team and social services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What makes you right for this role?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Having a positive attitude towards mental health and older adults&lt;/li&gt;\n&lt;li&gt;Have a positive attitude to risk enablement&lt;/li&gt;\n&lt;li&gt;A sound clinical knowledge and experience of mental health and Occupational Therapy assessment and interventions for this population group&lt;/li&gt;\n&lt;li&gt;Being motivated and resourceful and an excellent communicator&lt;/li&gt;\n&lt;li&gt;Being able to work flexibly and prioritise your own workload;&lt;/li&gt;\n&lt;li&gt;Being able to work holistically in a patient centred way;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return, you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Receive regular support and clinical supervision;&lt;/li&gt;\n&lt;li&gt;Be a member of a well-established Occupational Therapy monthly forum which provides support and CPD opportunities&lt;/li&gt;\n&lt;li&gt;Have a wide range of excellent CPD opportunities for personal and professional development, including peer supervision and a comprehensive in-service training programme including a band 6 development programme.&lt;/li&gt;\n&lt;li&gt;MHSOP Occupational Therapists are supported by an Occupational Therapy Clinical Specialist and AHP Lead.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;Ava Gail Manradge - Team Manager-Gedling &amp; Hucknall&lt;/p&gt;\n&lt;p&gt;Email address: ava-gail.manradge@nottshc.nhs.uk / Telephone number: (0115) 8542277&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Jayne Gething - Team Lead Rushcliffe - 0115 8542278&lt;/p&gt;\n&lt;p&gt;Lyndsay Beck - OT Clinical Specialist - 07880 698831&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235048", "validThrough": "2020-11-10T23:59:59+0000"}