{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-27T14:16:03+0000", "description": "&lt;p&gt;If you are a keen, enthusiastic individual with an excellent eye for detail and a positive approach, the Continuing Healthcare Team (CHC) would like to hear from you. An exciting opportunity has arisen for the post of Nurse Co-ordinator based in Worcestershire.&lt;/p&gt;\n&lt;p&gt;The newly created Hereford and Worcester CCG (from 1 April) are looking for an individual who has excellent assessment skills and experience of working across a variety of care settings. The successful applicant will need to demonstrate enhanced communication skills and have the ability to work both as part of a team and autonomously.&lt;/p&gt;\n&lt;p&gt;Knowledge of the FNC and CHC processes is preferred but not essential as we provide a three month induction and 12 month mentor to assist your transition to Continuing Healthcare. Alongside this the Team Leads and Clinical Lead aim to create a supportive and nurturing environment with a strong focus upon professional and personal development.&lt;/p&gt;\n&lt;p&gt;As well as assessing a patient’s eligibility of NHS Continuing Healthcare, the successful applicant will also manage a case load, support the appeals process and to work collaboratively with the team on any complaints or investigations.&lt;/p&gt;\n&lt;p&gt;This will be a challenging and developing role that is varied and interesting and will need you to bring energy, flexibility and commitment.&lt;/p&gt;\n&lt;p&gt;The work is agile with flexibility to work from home where possible, the team are based at a brand new office at Acton house, Perdiswell Park, Worcester.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across CCG offices.&lt;/p&gt;\n&lt;p&gt;We invite you to call us or visit to discuss the role further please contact Victoria Owen 01905 681975&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128360.png", "name": "NHS Herefordshire and Worcestershire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Acton House, Worcester", "postalCode": "WR3 7GD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2171", "longitude": "-2.21532"}}, "title": "CHC Nurse Assessor Case Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244921", "validThrough": "2020-11-09T23:59:59+0000"}