{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 (Band 5)"}}, "datePosted": "2020-11-02T08:49:42+0000", "description": "&lt;h1&gt;&lt;strong&gt;Registered Mental Health Nurse - Osborne Ward/Sevenacres&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;£24,907-£30,615 (Band 5)&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The opportunity has arisen for RMN Band 5nurses to become part of the team on our 16 bedded mixed sex adult acute ward. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for innovative, motivated and enthusiastic Registered Mental Health Nurses who have the passion, commitment and therapeutic skills to deliver compassionate and high quality care to individuals who are experiencing a crisis in their mental and emotional health and wellbeing. &lt;/span&gt;&lt;span&gt;Our client group is diverse and therefore gives the opportunity to new recruits to build on experience in delivering care to differing mental health needs of adults needing inpatient care.&lt;/span&gt;&lt;span&gt;We will welcome applications from both experienced and newly registered nurses.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Strong leadership skills will be an asset; however we are also keen to hear from less experienced candidates. &lt;/span&gt;&lt;span&gt;The ability to make decisions and show sound, effective communication skills will be required. You will be expected to work a mixture of early, late and night shifts.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;RMN’s on Osborne work as an integral part of a multidisciplinary team of health care professionals to ensure that the clinical, environmental and social needs of our service users are met. We put huge emphasis on working collaboratively with individuals to empower them to move through the care pathway toward recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are able to provide a Preceptorship package for newly qualified RNMH’s and have opportunities for experienced staff to undertake specialist link roles of particular interest and develop their clinical skills to enhance career progression. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Support and supervision for all staff is a fundamental part of the culture of the ward and individuals are actively encouraged to seek out learning opportunities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We believe that all staff on Osborne are part of a respectful, flexible, hard-working, welcoming and collaborative team; we expect successful applicants to support that philosophy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Please note that in addition to the above we are in a position to consider applications from RNLD’s and RGN’s with the appropriate previous experience.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251348", "validThrough": "2020-11-30T23:59:59+0000"}