{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-03T14:00:41+0000", "description": "&lt;p&gt;This is an exciting opportunity for a clinical psychologist to join the Paediatric SARC, within the Rainbow Centre (Safeguarding Unit) at Alder Hey Children’s NHS Foundation Trust. Children and young people attend the Paediatric SARC at Alder Hey Children’s NHS Foundation Trust for a forensic medical examination when there is suspected sexual abuse. The SARC contains an examination suite, which provides a calm, containing environment where children and young people can be medically examined and interviewed. Alder Hey Paediatric SARC covers the Liverpool, Sefton, Knowsley, St Helens and The Wirral regions. The SARC offers a multi-agency approach to the treatment of children and young people who have been sexually abused with close liaison between Police, Children’s Social Care and hospital-based personnel.&lt;/p&gt;\n&lt;p&gt;The clinical psychologist will be based in the newly-expanded Psychology Service within the Paediatric SARC. This is a full-time, permanent position. The psychology service is a small team, consisting of one full time band 8A clinical psychologist and one full time band 7 clinical psychologist (current post). Trainee clinical psychologists also input into the service. The wider team consists of pediatricians, nurses, healthcare assistants, a physician associate and administrators.&lt;/p&gt;\n&lt;p&gt;The Paediatric SARC Psychology Service was developed to ensure the mental health needs of children and young people who access the SARC are met. Adverse Childhood Experiences (ACEs), ongoing child protection needs and concerns around their psychological wellbeing are prevalent in children and young people who access the Paediatric SARC. The service offers psychological assessments and a range of interventions for children, young people and their parents/ carers.&lt;/p&gt;\n&lt;p&gt;The psychology service also facilitates staff support interventions for medical, nursing and administrative staff who input into the SARC. As one of few children’s SARCs in the country, there are a number of opportunities for service development, research, service evaluation and audit.&lt;/p&gt;\n&lt;p&gt;We are looking for a clinical psychologist with strong clinical skills and experience relevant to working with children and young people who have experienced developmental and relational trauma. An ability to confidently respond to safeguarding concerns in order to ensure risks are managed is paramount in this population where there are often child protection concerns. Support with safeguarding is available from the safeguarding nurses and doctors. The successful candidate should possesses strong interpersonal skills and personal qualities which will support them to work with children, young people and families in acute distress and from a diverse range of backgrounds; and to communicate effectively with a range of professionals, including the police and social care. Experience of research and facilitating service developments is beneficial.&lt;/p&gt;\n&lt;p&gt;The successful applicant will access clinical supervision from the lead psychologist within the Pediatric SARC, and will have opportunities for ongoing personal and professional development. The psychology service has strong links with Liverpool Fresh CAMHS.&lt;/p&gt;\n&lt;p&gt;Alder Hey has already earned our place as one of the world’s leading children’s hospitals, thanks to innovation and pioneering medical work. We treat 250,000 young patients a year and have a broad range of hospital and community services, serving the local population of children, as well as being a tertiary referral centre for children from across Merseyside, Cheshire and parts of Lancashire, Shropshire and North Wales. Every individual makes a valuable contribution and Alder Hey is proud of its long history of providing pioneering and innovative healthcare to children and young people. The post holder must adhere to Trust Policies and Procedures at all times.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to carefully screening all job applicants to ensure the safeguard of children and to an environment that promotes equality and embraces diversity. The trust operates a flexible working policy.&lt;/p&gt;\n&lt;p&gt;The Trust is an equal opportunities employer and operates a no smoking policy. &lt;/p&gt;\n&lt;p&gt;Further information concerning the post is available from: Lindsay Neil, Clinical Lead, Liverpool FRESH CAMHS – Lindsay.neil@alderhey.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254230", "validThrough": "2020-11-17T23:59:59+0000"}