{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-05T16:01:21+0000", "description": "&lt;p&gt;Experienced Registered Nurses in Emergency Medicine&lt;br /&gt;&lt;br /&gt;Due to the expansion of our Emergency Department and Urgent Treatment Centre we are looking to recruit highly motivated registered nurses to join our team. We have a number of vacancies for Band 5 Staff Nurses.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced Nurses who are looking for opportunities to further develop their career and who possess excellent communication skills, strong team working skills and can evidence the delivery of good patient care.&lt;/p&gt;\n&lt;p&gt;If you are dynamic, enthusiastic and looking for the next challenge to help build further on our reputation as one of the safest and best hospitals we are looking for you.&lt;/p&gt;\n&lt;p&gt;You will be joining a dynamic, multi-disciplinary team in which Nurses are encouraged to be proactive. We also encourage training and other development opportunities and activities for staff.&lt;/p&gt;\n&lt;p&gt;The Lister Hospital Emergency Department (ED) serves the local community of East and North Hertfordshire. This is an exciting time to be joining our team as the Emergency Department has undergone major refurbishment and a new build which has almost doubled the size of our department. This has included investment of £19.5m and has resulted in the state of the art environment.&lt;/p&gt;\n&lt;p&gt;The Trust provides level 2 Trauma Unit service, a Stroke unit, has 2 Cardiac Cath Labs which provide 24 hour Primary PCI. The ED prides itself on providing high quality, compassionate care and a desire to be amongst the best.&lt;br /&gt;&lt;br /&gt;Including in the expansion of new builds, the Acute Assessment Unit and ward have also been upgraded, this includes a 16 trolley spaces for direct GP heralded patients along with 2 ward areas for acute short stay medical admissions.&lt;/p&gt;\n&lt;p&gt;The East and North Hertfordshire NHS Trust is committed to its’ staff and additional benefits to joining us includes excellent annual leave entitlement, the NHS pension scheme, accommodation, shopping discounts, employee friendly benefits as well as further career development opportunities.&lt;/p&gt;\n&lt;p&gt;As part of the selection process you will be required to take a drug calculation assessment prior to interview.&lt;/p&gt;\n&lt;p&gt;NB Internal Applicants - please be aware that you can apply but Internal Transfer Scheme will apply&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janice Boyle - Matron, Emergency Department&lt;/p&gt;\n&lt;p&gt;Contact: 014382 285946 - janiceboyle@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Registered Nurse - ED", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258472", "validThrough": "2020-11-19T23:59:59+0000"}