{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-12T15:35:22+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Band 6Occupational Therapistto join our dynamic and friendly &lt;strong&gt;Community Interventions Pathway. &lt;/strong&gt;The Community Interventions Pathway compliments The Psychosis Pathway and Intensive Life skills Pathway to form part of &lt;strong&gt;Community Mental Health Services within South Staffordshire.&lt;/strong&gt; This post will be based within the &lt;strong&gt;West Locality &lt;/strong&gt;covering South Staffordshire (Seisdon, Cannock and Stafford zones) but will be primarily aligned to the &lt;strong&gt;Cannock Zone. &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Community Interventions Pathway is an innovative secondary care pathway that is guided by collective leadership, providing evidence-based psychological and medical interventions to patients with a wide range of mental health difficulties of a non-psychotic nature (i.e depression, OCD, anxiety, trauma, personality disorder etc.). The patient’s journey is guided by psychological formulation of his or her presenting needs and difficulties, which subsequently inform the development of a plan of care for the patient. We draw from evidence-based interventions to provide high quality and effective individual and workshop treatments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an experiencedOccupational Therapistwho has a keen interest in working in a multi-disciplinary setting with patients experiencing mental health difficulties using psychological approaches. The successful applicant will be motivated to provide high quality care to our patients. In order to do this the candidate will need to have drive and determination in regards to their own personal development, whilst using their own creative and innovative ideas to support the continuous development of this exciting pathway. In return the successful candidate can expect the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Support with settling into the team and developing into the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Right from the start of joining the team, a clear and ongoing conversation about your skills and personal career progression, which is managed through the Trust’s appraisal process.&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A commitment to supporting you to remain up to date with your practice and develop skills through formal and informal training.&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Regular, high quality clinical and managerial supervision.&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Warm, friendly and supportive colleagues. &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Collective leads who are committed to the psychological and physical wellbeing of staff in the pathway. &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A continual commitment to embrace lean methodology to improve the quality of the services provided for patients/their carers and the experience of staff working within the pathway.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The applicant will need to have up to date knowledge on mental health service delivery frameworks, including working confidently within NICE and NMC guidelines. You will be expected to manage a diverse caseload of patients with differing presenting needs. As part of this caseload management you will be required to work within the CPA framework which includes undertaking risk assessments and completing care plans with patients and their carers. Your role will involve working closely with other partners, agencies, carers, service users, families and the local community, ensuring continuity of service is provided at a high level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are successful in this post you will work as part of a high skilled multi-disciplinary team which includes nursing colleagues, allied health professionals, psychologists, psychiatrists, support workers and peer support workers. As a band 6OT you will be expected to take an active lead within the team providing supervision toBand 5 OT and support workersand other more junior members of the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The usual hours of work are Monday to Friday 9am – 5pm. You will also be required to have access to a vehicle for work purposes and hold a full licence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;If you would like any further information, or wish to arrange an informal visit, please contact Jo Perry, The Community Interventions Pathway Manager on 0300 303 3428 (Mon-Fri 9-5).&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cannock", "postalCode": "WS11 1JN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6909", "longitude": "-2.03377"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223027", "validThrough": "2020-11-09T23:59:59+0000"}