{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-04T11:31:25+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS A FIXED TERM/SECONDMENT FOR UP TO 24 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE .&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR A SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER BEFORE APPLYING FOR THIS POST.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic, highly organised and motivated Pharmacist to join the Medical Directorate at the Welsh Health Specialised Services Committee (WHSSC). This is a unique chance to work in an all Wales role, and with provider organisations in NHS England. Specialised services involves the commissioning of new and innovative treatments and represents a challenging and fast moving area of clinical care.&lt;/p&gt;\n&lt;p&gt;The post holder will lead the operational delivery of the WHSSC medicines optimisation strategy. They will be responsible for delivering safe, high quality, person-centred medicines optimisation work programs and activities across all the specialised services commissioned by WHSSC.&lt;/p&gt;\n&lt;p&gt;They will provide timely, expert, evidence-based, safe and cost effective pharmaceutical advice to WHSSC and deliver high quality information and support to stakeholders. The post holder will work with WHSSC and Health Board / Trust colleagues to ensure that medicines management and optimisation across WHSSC commissioned specialised services provides best value for money and optimal use of public funding.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for monitoring and reporting on the outcomes of medicines optimisation initiatives. They will also provide both specialist clinical knowledge and advanced systems management, as well as procurement and financial expertise during implementation of the Blueteq high cost drug system for WHSCC commissioned medicines across NHS Wales and NHS England providers.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 22nd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Dr Andrew Champion, Assistant Director, Evidence Evaluation&lt;/p&gt;\n&lt;p&gt;Tel: 07557 178958&lt;/p&gt;\n&lt;p&gt;Email: andrew.champion@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welsh Health Specialised Services Committee, Pontypridd", "postalCode": "CF37 5YL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5654", "longitude": "-3.28285"}}, "title": "Medicines Management Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255624", "validThrough": "2020-11-22T23:59:59+0000"}