{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum incl HCAS (pro-rata)"}}, "datePosted": "2020-11-05T18:45:21+0000", "description": "&lt;p&gt;Mental Health Nurse/CAMHS practitioner (CBT route)&lt;/p&gt;\n&lt;p&gt;Band 6 – Two posts&lt;/p&gt;\n&lt;p&gt;1 year fixed term Training Post.&lt;/p&gt;\n&lt;p&gt;Early January – Early December 2021&lt;/p&gt;\n&lt;p&gt;Base – North Camden Community Team (NCCT), Tavistock Centre, 120 Belsize Lane, LONDON, NW1 5BA or South Camden Community Team (SCCT), Ampthill Square, 219 Eversholt Street, LONDON, NW1 1DR.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Are you a mental health nurse who has passion for working with children and young people? Are you interested in training opportunities to &lt;/em&gt;&lt;em&gt;develop your skills and work in a dynamic and innovative community CAMHS team? &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for registered mental health nurses to join one of our well-established community CAMHS teams in Camden. Your week will consist of attending the one-year training course and clinical work in the team delivering services to children, young people and their families. You will be well supported by an experienced supervisor and a team of skilled clinicians.&lt;/p&gt;\n&lt;p&gt;Both NCCT and SCCT are a Community CAMHS service who support children and young people’s emotional wellbeing needs with evidence-based therapeutic interventions. Both Community CAMHS services are made up of a varied multi-disciplinary team, staffed by experienced CAMHS clinicians including psychologists, child psychotherapists, child and adolescent psychiatrists, nurses and family therapists.&lt;/p&gt;\n&lt;p&gt;Both NCCT and SCCT and alongside other Camden CAMHS Services make up Camden CAMHS which is part of the Tavistock and Portman Children Young People and Families Directorate. We work closely with partners including schools and the Local Authority. The Tavistock has a national and international reputation as a training centre and provides an excellent environment in which trainees can have successful and rewarding clinical experiences.&lt;/p&gt;\n&lt;p&gt;Please note you must apply to &lt;strong&gt;both&lt;/strong&gt;: The Tavistock and Portman NHS Foundation Trust &lt;strong&gt;and&lt;/strong&gt; for the university training. Please see the attached guidance regarding the University Application Guidance and the Brochure.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Although these are fixed term Training Posts of 12 months, there may be opportunities to progress onto a Band 7 position upon completion of your training, depending on the financial landscape at the end of the fixed term post.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;You will need to start in the post in early January 2021.&lt;/p&gt;\n&lt;p&gt;Due to the Covid-19 restrictions, it is most likely some of the training and clinical practice/supervision will be delivered remotely.&lt;/p&gt;\n&lt;p&gt;Closing Date: 12-Nov-2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 25-November 2020&lt;/p&gt;\n&lt;p&gt;Start Date: 11th January 2021&lt;/p&gt;\n&lt;p&gt;For further details, contact:&lt;/p&gt;\n&lt;p&gt;For CBT posts: Dr Vikki Lee, Child and Educational Psychologist, South Camden Community Team, Tel: 020 8938 2700. VLee@tavi-port.nhs.uk&lt;/p&gt;\n&lt;p&gt;For ASD/LD posts: Dr Ross Canadé, Clinical Psychologist, North Camden Community Team, Tel: 020 8938 2232. RCanade@Tavi-Port.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For enquiry, contact:&lt;/p&gt;\n&lt;p&gt;Lottie Scull, Clinical Service Manager, SCCT. Tel. 020 8938 2700. Email: lscull@tavi-port.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Yoko Totsuka, Clinical Service Manager, NCCT. Tel: 07851 384511. Email: ytotsuka@tavi-port.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122294.JPG", "name": "Tavistock and Portman NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Tavistock and Portman NHS Trust, London", "postalCode": "NW1 1DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5325", "longitude": "-.137225"}}, "title": "Mental health Nurse/CAMHS Practitioner, Training Post - (CBT route)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258784", "validThrough": "2020-11-12T23:59:59+0000"}