{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T17:15:39+0000", "description": "&lt;p&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton, Salford, Ashton, Leigh and Wigan. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare. The Trust offer a range of flexible working patterns to enable our staff to balance their work and personal life.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;Applicants are invited for the post of Paediatric Learning Disability Nurse within the Paediatric Learning Disabilities Service in Bolton.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be a Registered Nurse - Learning Disability (RNLD).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join this dynamic and innovative community team providing specialist interventions to children and young people who have a Learning Disability, their families and carers.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for enthusiastic and confident applicants who show a commitment to the delivery of high quality services in a variety of community settings, with individuals, carers and families. They will be able to provide assessment, carry out interventions, and give advice to our service users and other agencies to empower and build resilience as well as to carry out duty nurse responsibilities and supervsion of junior staff.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The service works to promote the health and wellbeing of the children and young people that are referred to the service, developing opportunities to meet identified health outcomes in order for the children and young people to be included in all aspects of their school and family life.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have the opportunity to develop knowledge and skills and work across wider Children&#39;s Services as needed. You will be responsible for giving advice and guidance, teaching and role modelling to Parents, Carers, Education, Local Authority and other health professionals. You will be able to work in collaboration with health, education and social care and work to support early help for families and ensure safeguarding needs are met.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;It is desirable that candidates can demonstrate or are willing to develop skills and knowledge in Positive behaviour support, sleep, continence, diet and nutrition and puberty and have experience of being in a leadership/supervisory role.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Successful applicants will be required to apply for an enhanced DBS disclosure.&lt;/p&gt;\n&lt;p&gt;The role requires a full driving license and use of own care with business insurance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The aims of this Trust are to improve the health of and provide the best possible care to the population in which we serve and ensure that our staff have joy and pride in their work. We are striving to recruit a workforce that reflects the communities in which we serve. We value our staff and can offer excellent opportunities for further training and development. We are keen to reflect our local population and therefore applications from all sectors of the community are welcomed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEunice O&#39;BrienJob titleSenior NurseEmail addresseunice.o&#39;brien@boltonft.nhs.ukTelephone number01204463660&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pikes Lane Centre, Bolton", "postalCode": "BL3 5HP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5727", "longitude": "-2.44635"}}, "title": "Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253006", "validThrough": "2020-11-16T23:59:59+0000"}