{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-11-05T13:31:41+0000", "description": "&lt;p&gt;Hours: 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;Contract type: Permanent&lt;/p&gt;\n&lt;p&gt;Are you looking for an interesting post that offers a change of direction in your career and the opportunity for you to develop skills in work based learning? An opportunity has arisen within the Clinical Work Based Learning Team and we are recruiting a registered Healthcare Professional to join us as a Senior Clinical Work Based learning Facilitator.&lt;/p&gt;\n&lt;p&gt;We work together as a team across all sites, delivering Health Care Assistant education programmes within the organisation. You will need good communication skills, knowledge of current Care Certificate requirements, Apprenticeship agenda and experience of supporting Healthcare Assistant development in a practice setting.&lt;/p&gt;\n&lt;p&gt;The post will be based at either Scarborough Hospital or York Hospital delivering educational programmes and supporting learners within a defined area. We are looking for a motivated, flexible and enthusiastic registered healthcare professional who will be able to support the delivery of the clinical support staff education agenda providing support and cover when required to all areas in the organisation.&lt;/p&gt;\n&lt;p&gt;The role of the Senior Clinical Work Based Learning Facilitator is to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitate the delivery and evaluation of work based learning in the clinical environment, supporting the implementation of the education agenda relating to work based learning&lt;/li&gt;\n&lt;li&gt;Develop and deliver training programmes to the non-registered workforce in the Organisation, working to the internal quality assurance of vocational learning and liaising with other training providers if required&lt;/li&gt;\n&lt;li&gt;Ensure the Trust meets the National and Regional Standards for Healthcare Education&lt;/li&gt;\n&lt;li&gt;Act as a positive role model, promoting quality evidence-based practice&lt;/li&gt;\n&lt;li&gt;To act as a conduit between the clinical placements/providers and the organisations within the healthcare community to promote effective partnership working and be a valuable resource for staff and learners requiring advice or guidance on issues relating to work based learning or vocational qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This will involve liaising with partners within and outside the organisation and will involve delivery of presentations, teaching, mediation and organisational skills in order to meet the challenges of work based learning. We can offer you a varied working experience, opportunities to develop your professional skills and work within a friendly supportive team.&lt;/p&gt;\n&lt;p&gt;As this post can be based at either Scarborough or York the preferred base will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that is a great draw. In addition, as a member of our team you will have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To arrange a discussion regarding the post please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Joanne Watson, &lt;/span&gt;&lt;span&gt;CU&amp;WBL Admin Team Lead&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;01723 385004&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough or York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Senior Clinical Work Based Learning Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257895", "validThrough": "2020-11-18T23:59:59+0000"}