{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-16T15:15:12+0100", "description": "&lt;p&gt;Are you a qualified nurse or paramedic?&lt;/p&gt;\n&lt;p&gt;Do you have current NMC/HCPC registration, with no restrictions on your practice?&lt;/p&gt;\n&lt;p&gt;Are you trained and proficient in NHS Pathways and Adastra software?&lt;/p&gt;\n&lt;p&gt;If the answer to the above is &#39;yes&#39; then we have an interesting opportunity for you.&lt;/p&gt;\n&lt;p&gt;We are looking for Clinical Queue Managers to join our Covid Clinical Assessment Service (CCAS) and PharmCAS in our dedicated unit, based in Otterbourne, Hampshire.&lt;/p&gt;\n&lt;p&gt;CCASis aGP Led service and PharmCAS is delivered by a team of pharmacists.The services are providedby South Central Ambulance Service in partnership with the South Central and WestCSU. CCASprovides clinical assessment of patients that have presented to NHS 111with Covid-19 symptoms and PharmCAS deals with pharmacy queries receivedintoNHS 111.&lt;/p&gt;\n&lt;p&gt;The role is a 24/7 role working out of South Central Ambulance service in the NHS 111 team. The role of the Clinical Queue Manager is to monitor calls in the CCAS and PharmCAS queue, making sure that they have been prioritised apppropriately according to clinical need. You will be the focus of clinical support for operational staff in their decision makingto ensure clinical safety is maintained. You will also liaise with the GPs and Pharmacists to support them in their roles.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some important points to note regarding this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This role is office based. There is no homeworking option.&lt;/li&gt;\n&lt;li&gt;We operate a 24/7 roster covering early, late and night shifts&lt;/li&gt;\n&lt;li&gt;This role is offered as a fixed term contract until 31 March 2021. Any extension will be dependant on the circumstances at the time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to have an informal conversation regarding this role, please email matthew.hargreaves@scas.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Otterbourne", "postalCode": "SO21 2RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.009", "longitude": "-1.33424"}}, "title": "CAS Clinical Queue Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230806", "validThrough": "2020-11-08T23:59:59+0000"}