{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-23T16:01:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in Psychiatry - R&lt;/strong&gt;&lt;strong&gt;ampton Hospital – Forensic Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent - &lt;/strong&gt;&lt;strong&gt;40 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Package including Recruitment &amp; Retention Premium - &lt;/strong&gt;&lt;strong&gt;£117,809&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare is one of the country’s leading providers of integrated healthcare and has an extremely diverse portfolio of mental health, learning disability and community health services. The Trust is also involved in a number of collaborations in research and innovation with the University of Nottingham and other partners. The Trust has an income of over £435m and employs over 8800 staff to provide these services.&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen for a Specialty Doctor in Psychiatry to work at Rampton Hospital, which provides a High Secure Forensic Service. The Hospital cares for 273 patients and has four Clinical Services (male mental illness, male personality disorder, male learning disability and specialist services for women).&lt;/p&gt;\n&lt;p&gt;The Hospital has invested substantially in the development of a Health Centre to deliver physical health input for patients on par with community provision. It is expected with this development that Specialty Doctors will focus on mental health provision, whilst retaining an overview of physical healthcare.&lt;/p&gt;\n&lt;p&gt;Specialty Doctors will be working with an MDT and duties will include attending CTMs, providing mental state assessments, reviewing seclusions/segregations and attending CPA meetings.&lt;/p&gt;\n&lt;p&gt;Specialty Doctors are supported in their career progression through facilitating attendance at relevant courses and training programmes. Within the responsibilities of the post, successful applicants will be supported in career development aims, such as achieving Approved Clinician status, passing Membership exams of The Royal College of Psychiatrists or developing a portfolio for being put on the Specialist Register.&lt;/p&gt;\n&lt;p&gt;There are opportunities to conduct external assessments (prisons, MSUs, Low Secure services) under the supervision of Consultant colleagues and to deputise for Consultants in CPA and MHRT settings.&lt;/p&gt;\n&lt;p&gt;A number of our Specialty Doctors have moved on to ST posts in psychiatry/forensic psychiatry.&lt;/p&gt;\n&lt;p&gt;Previous experience in Forensic Services is an advantage, but not essential as you will receive support, training and supervision from Forensic Consultants. There is a weekly Postgraduate Programme with Journal Club, Case Conference and internal or visiting speakers and Specialty Doctors are encouraged to participate. The Forensic Division of the Trust sponsors a Trent Forensic Study Day twice yearly. In addition one session per week is available for study leave. Specialty Doctors are encouraged to be involved in research and audit and are supported in appraisal and revalidation.&lt;/p&gt;\n&lt;p&gt;The salary and terms and conditions of appointment are in accordance with Terms and Conditions of Service for Specialty Doctors (2008). Relocation expenses may be payable to the successful candidate.&lt;/p&gt;\n&lt;p&gt;The post carries an on-call commitment and a RRP is payable of 30%.&lt;/p&gt;\n&lt;p&gt;Further information is available from Dr J Wallace, Clinical Director on 01777 247219 or Carol Dook, Medical Services Co-ordinator on 07545 061481.&lt;/p&gt;\n&lt;p&gt;Disclosure information will be requested from the Disclosure &amp; Barring Service (DBS) in the event of a successful application.&lt;/p&gt;\n&lt;p&gt;The Trust believes in treating everyone with dignity and respect and encourages applications from all sectors of the community. We guarantee an interview to candidates with disabilities who meet the minimum essential criteria.&lt;/p&gt;\n&lt;p&gt;We positively encourage people who have experienced mental health problems to apply for a role within the Trust.&lt;/p&gt;\n&lt;p&gt;THE TRUST OPERATES A NO SMOKING POLICY.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our DBS check is free, you have no fees to pay!&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rampton Hospital, Retford", "postalCode": "DN22 0PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2904", "longitude": "-.838212"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241223", "validThrough": "2020-12-04T23:59:59+0000"}