{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "Up to £36,500 FTE - DOE + Golden Hello"}}, "datePosted": "2020-10-26T10:33:39+0000", "description": "&lt;p&gt;&lt;strong&gt;I treat more than just symptoms!&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; Are you collaborative, caring and compassionate?&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be. &lt;br /&gt; &lt;br /&gt; As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the Health in Justice market leader; 4 years ago we were managing 12 prison healthcare services and in 2020 we&#39;re providing healthcare services in over 40 prisons across the country. &lt;br /&gt; &lt;br /&gt; We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits. &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Looking for something a little different?&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; We&#39;re looking for Mental Health Nurses to join our Mental Health team within the healthcare department at HMP Bullingdon. This will involve working inside the prison, within healthcare and on the prison wings. HMP Bullingdon is a Cat B remand prison for adult males aged 21 and over, near Bicester in Oxfordshire. &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. CBT, substance misuse, ANP, BBV, sexual health, plastering, ILS, health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;In return for your hard work you will...&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; You’ll receive an annual salary up to £36,500 FTE - depending on experience + 2 year Golden Hello (£2,000 in Year 1 of service and £1,500 in Year 2 of service - conditions apply). You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time hours) plus CPD and re-validation support. Part-time applications also welcome.&lt;br /&gt; Other benefits include cycle to work scheme, staff wellbeing, plus training and clinical development opportunities.&lt;br /&gt; Onsite benefits at HMP Bullingdon include access to a free gym on site (outside of regime hours), free parking, subsidised mess/canteen.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; You will be a qualified Registered Mental Health Nurse with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;br /&gt; &lt;br /&gt; You will also be working as part of a larger multi-disciplinary team, alongside the primary care and pharmacy teams.&lt;br /&gt; &lt;br /&gt; Flexible and adaptable? That&#39;s great!&lt;br /&gt; We&#39;re looking for those who can participate in a 24hr, 7 day a week rota.&lt;br /&gt; &lt;br /&gt; Are you new to prison healthcare? &lt;br /&gt; Do not worry... you will be supported and mentored throughout your first 6 months and beyond with Practice Plus Group by experienced teams of highly skilled nurses and practitioners as well as management.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; If you are shortlisted, you will be contacted by our Internal Recruitment team. &lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn we will arrange an interview for you to attend at HMP Bullingdon if the hiring manager feels that you are suitable for the job.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; A full-time role will require working 37.5 hours per week. Healthcare operates 24 hours a day, 7 days a week. We also welcome part-time applications.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester, Oxfordshire", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Mental Health Nurse - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242028", "validThrough": "2020-11-08T23:59:59+0000"}