{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata if part time"}}, "datePosted": "2020-10-27T16:01:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Physician in Stroke Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a substantive Consultant Physician in Stroke Medicine who will help deliver care along the Stroke Service pathway. We are happy to consider Locum for 1 year, please add your requirement in your application.&lt;/p&gt;\n&lt;p&gt;At Salisbury Hospital we provide hyper-acute stroke care, 24/7 Stroke thrombolysis, regional 7-day TIA service, stroke rehabilitation, stroke early supported discharge, stroke outpatient/follow-up clinics and stroke research. As we continue to expand our hyperacute stroke services, the post holders will support the stroke team in providing a seven day specialist service. The stroke unit is a 30 bedded mixed hyperacute, acute and rehabilitation unit. The stroke service actively participates in the Wessex Research Network and with the support of dedicated research staff enrols patients to several multicentre and local clinical trials. We have close links with the Neurointervention team based in Southampton General Hospital.&lt;/p&gt;\n&lt;p&gt;The hyperacute service is fully supported by our local GP’s, Commissioners and at the executive/ board level within the Trust.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the Specialist Register or be within six months of doing so at the time of interview.&lt;/p&gt;\n&lt;p&gt;Applications from those wishing to work part-time, job-share, locum for one year are welcomed.&lt;/p&gt;\n&lt;p&gt;There is a relocation package available to candidates, up to a maximum of £8,000 (terms and conditions apply)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our Trust and Salisbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salisbury District Hospital is rated ‘Good’ by the CQC and has frequently been in the top 10 top performing Emergency Departments in the country. There is a strong commitment to service improvement, particularly in relation to emergency and inpatient medicine with now being a good opportunity for anyone joining the team to get involved with service design and improvement.&lt;/p&gt;\n&lt;p&gt;Salisbury is a vibrant, thriving cathedral city. It is an ideal location for anyone wishing to have all the facilities of a city but also wish to live in area with some of the most dramatic scenery in the South of England. There are many outstanding schools in the local area and many areas of outstanding beauty to enjoy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Toby Black, Consultant Physician and Lead for Stroke &lt;br /&gt;toby.black@salisbury.nhs.uk&lt;br /&gt;01722 336262 Extn. 4141&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury District Hospital, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Consultant in Stroke Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245300", "validThrough": "2020-11-10T23:59:59+0000"}