{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-23T13:01:39+0100", "description": "&lt;p&gt;An opportunity has arisen for a part time Receptionist/Administrator to be part of our friendly team working Mondays, Wednesdays and Thursdays. We provide an efficient reception service for clinic users, staff, patients and visitors to the Children’s services based out of the Peacock Centre in Cambridge.&lt;/p&gt;\n&lt;p&gt;This is a varied role and would suit someone with experience of dealing with a wide range of stakeholders. Duties will include receiving visitors including registration on our electronic system, co-ordinating bookings for meeting rooms, receiving telephone calls and transferring appropriately, sorting all in-coming and out-going post, documenting and co-ordinating maintenance requests and stationery orders, as well as other general administrative duties for the reception and admin teams. You will also be required to work some of the week on our Single Point of Access (SPA) phone line, which directs calls from patients into Specialist Services teams.&lt;/p&gt;\n&lt;p&gt;Recent previous experience in a comparable role within a customer-focused environment would support the post holder to be successful in this role. An ability to deal with conflicting demands and a strong attention to detail with excellent communication skills are required, as well as a working knowledge of Outlook. The post holder will benefit from a full induction programme, training and on-going support.&lt;/p&gt;\n&lt;p&gt;Please note, some changes / flexibility to the above may be required during COVID however we will not deviate from the skills required for this post.&lt;/p&gt;\n&lt;p&gt;Interviews will be virtual over Microsoft Teams&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peacock Centre, Mill Rd, Cambs", "postalCode": "CB1 3DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2016", "longitude": ".153858"}}, "title": "Receptionist / Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240646", "validThrough": "2020-11-08T23:59:59+0000"}