{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc."}}, "datePosted": "2020-11-02T11:32:19+0000", "description": "&lt;p&gt;The Royal National Orthopaedic Hospital (RNOH) is an international center of excellence with an esteemed reputation for diagnosis, assessment and treatment of neuro-musculoskeletal conditions. We are the largest specialist trust in the United Kingdom and amongst the largest orthopaedic specialist hospitals in Europe. We are presently in the process of building a brand new ward block which is planned to open in Autumn 2018.&lt;/p&gt;\n&lt;p&gt;The theatre complex at the Royal National Orthopaedic Hospital consists of 10 operating theatres and a plaster theatre. In addition to our wide range of orthopaedic cases we also perform urology, plastics procedures. Furthermore we do major revision work not undertaken in other centers.&lt;/p&gt;\n&lt;p&gt;We have a well-established team where excellent standards of care are delivered. We understand the rights to privacy and dignity and we always put patients first. We have a clinical educator available within the department to help in your professional training and revalidation requirements. You will be able to progress your career with a wide range of educational courses available both internally and external to the trust.&lt;/p&gt;\n&lt;p&gt;We are seeking Band 5 scrub nurses or ODP’s who are passionate, dynamic and forward thinking to join our team. You will assist the team in all areas of surgical practice and ensure that the trusts vision and values are achieved. You will be given opportunities to suggest and implement improvements in clinical practice and patient experience.&lt;/p&gt;\n&lt;p&gt;If this sounds like a role you would be interested in and can demonstrate the requirements, then we are keen to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mark Ashwell, Clinical Lead for Theatres or Ali Ghasempour on 0208 909 5470 or by email to mark.ashwell@nhs.net; ali.ghasempour@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Theatres Scrub Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251816", "validThrough": "2020-11-16T23:59:59+0000"}