{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 Per Annum (Pro Rata)"}}, "datePosted": "2020-10-30T13:25:19+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About our service&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mountain Healthcare is a leading provider of clinical based services who have a genuine concern for our clients, a sincere appreciation for our employees, and we want to do good things for other people. Mountain is built on core principals and commitments including quality, integrity, respect, kindness, courage, innovation and enjoyment. These values drive the understanding we care for our customers with and have helped us grow into the passionate company we are today. We are currently seeking Advanced Nurse Practitioner for a Secure Children’s Centre. This modern, safe and secure bedded unit caters for boys and girls aged between 10 and 17. It is inspected by Ofsted and approved and licensed by the Department for Children, Schools and Families. The centre comes under Sheffield City Council Children and Young People’s Directorate and has been rated Outstanding / Good in Ofsted inspections with the Youth Justice Board consistently rating as performing at the highest level. The purpose of the centre is to serve both local and national communities by looking after those children and young people who need a safe and controlled yet child centred secure residential environment in order to prevent harm to themselves or to others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Position Summary&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a Registered Nurse - Independent Prescriber &lt;span style=&quot;text-decoration: underline;&quot;&gt;with experience in managing minor illness and chronic conditions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate courageous and critical thinking and is a caring, compassionate and committed experienced nurse who, acting within their professional boundaries, will provide care for the presenting patient from initial history taking, clinical assessment, diagnosis, treatment and evaluation of care. They will demonstrate safe, competent clinical decision-making and expert care, including assessment and diagnostic skills, for patients within the secure centre. The post holder will commit to demonstrating critical thinking in the safe clinical decision-making process. They will communicate and work collaboratively with the team to meet the needs of patients, supporting the delivery of policy and procedures, and providing nurse leadership as required.&lt;/p&gt;\n&lt;p&gt;Working Pattern: Part time position, Flexible 12 hours per week made up of two 3 hour sessions and every Wednesday 9am to 3pm.&lt;/p&gt;\n&lt;p&gt;Candidates must be available to start the position on 1st February 2021.&lt;/p&gt;\n&lt;p&gt;Education:Degree in Nursing required with Masters in Advanced Practice and Full Nurse Prescribing qualification &amp; NMC PIN&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Essential&lt;/span&gt;:&lt;/p&gt;\n&lt;p&gt;Registered nurses working at this advanced level must meet the following standards, they must:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;have an active registration with the NMC&lt;/li&gt;\n&lt;li&gt;practice within the four pillars&lt;/li&gt;\n&lt;li&gt;have a Job Plan that demonstrates advanced nursing practice and has equity with peers working at this level&lt;/li&gt;\n&lt;li&gt;be educated to Masters level&lt;/li&gt;\n&lt;li&gt;be an independent prescriber&lt;/li&gt;\n&lt;li&gt;meet NMC revalidation requirements&lt;/li&gt;\n&lt;li&gt;demonstrate autonomous evidence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;All successful candidates will be subject to pre-employment checks including; an Enhanced DBS check and 2 satisfactory references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S17 3ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3344", "longitude": "-1.53764"}}, "title": "Registered Nurse - Independent Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250345", "validThrough": "2020-11-15T23:59:59+0000"}