{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-02T11:32:26+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 6 within the field of Infection Prevention and Control and Tissue Viability. This is an exciting time to join a new innovative and expanding team. Both specialities offer high profile agendas, and working corporately, will allow practitioners to develop skills across a wide range of clinical services.&lt;/p&gt;\n&lt;p&gt;The role will provide an opportunity for a motivated enthusiastic Band 6 nurse with an interest, in infection prevention and control and/or tissue viability to gain valuable experience across a wide variety of disciplines and community settings. The post-holder will have the opportunity to develop their skills within the two specialties, to provide integrated care to users for Tissue Viability and Infection Prevention and Control.&lt;/p&gt;\n&lt;p&gt;You will work as part of a dynamic team with senior Infection Prevention and Control and Tissue Viability nurses to provide a service for the whole Manchester University Hospital Foundation Trust on all its sites and the community. The post holder will work across the two services on a rotational basis providing integrated care to users across both tissue viability and infection control&lt;/p&gt;\n&lt;p&gt;As a professional role model you will provide direct and indirect clinical care, ensuring the needs of the patient are central to service delivery.&lt;/p&gt;\n&lt;p&gt;You will monitor and improve standards of care through, supervision of practice, clinical audit, evidence based practice, teaching and supporting professional colleagues.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise O&#39;ConnorJob titleLead Nurse Tissue VaibilityEmail addresslouise.oconnor2@mft.nhs.ukTelephone number0161 276 4042Additional contact information&lt;/p&gt;\n&lt;p&gt;Joan Woods&lt;/p&gt;\n&lt;p&gt;Matron Infection Control/ Tissue Viability&lt;/p&gt;\n&lt;p&gt;0161 291 5018&lt;/p&gt;\n&lt;p&gt;Joan.woods@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Foundation Trust, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Specialist Nurse Infection Prevention and Control/Tissue Viability", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251820", "validThrough": "2020-11-15T23:59:59+0000"}