{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 pa, pro rata"}}, "datePosted": "2020-10-26T14:47:06+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and dedicated Occupational Therapist to work within the High Peak and North Dales Older Adult Community Mental Health Teams.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapist is part of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The OT approach will consider therapeutic, meaningful activities to support individual&#39;s recovery and wellbeing in mental health within the community.&lt;/p&gt;\n&lt;p&gt;They will have the OT skills and knowledge to provide specialist functional assessments and be committed to providing high-quality, person-centred care. &lt;span&gt;Knowledge of organic and functional illnesses is essential in this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a suitably experienced Occupational Therapist who is motivated and dedicated, to work within the current team, to contribute to the continued development and promotion of the service.&lt;/p&gt;\n&lt;p&gt;It is anticipated that this will be achieved through MDT work, representing the team within the Trust and an ability to provide a positive role model to other team members.&lt;/p&gt;\n&lt;p&gt;You will carry a clinical caseload of people experiencing a wide range of moderate, to severe, mental illness, facilitate group work, liaise with community partners to promote a person-centred approach to care and support the team with their clinical work.&lt;/p&gt;\n&lt;p&gt;In return, you can expect to be supported in your professional development, develop skills appropriate to the needs of the service and client group and be part of a fantastic team.&lt;/p&gt;\n&lt;p&gt;Car driver essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne Hanby, Service Manager, joannehanby@nhs.net, 0300 123 3373&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Ritz Building, Matlock", "postalCode": "DE4 3AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1384", "longitude": "-1.55414"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242975", "validThrough": "2020-11-08T23:59:59+0000"}