{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-10-27T14:30:52+0000", "description": "&lt;p&gt;NHS Midlands and Lancashire CSU are seeking to appoint a skilled, motivated and confident Senior Business Partner to join our developing Information Governance Service. We are seeking a delivery driven, forward thinking individual with an excellent IG knowledge base, including Data Protection, Freedom of Information, Confidentiality and Caldicott principles. The successful candidate will also be fully conversant with the General Data Protection Regulation (GDPR) which came into force on 25th May 2018.&lt;/p&gt;\n&lt;h2&gt;The role:&lt;/h2&gt;\n&lt;p&gt;Reporting to the Head of Information Governance you will be responsible for providing specialist advice and guidance in relation to all aspects of Information Governance, whilst ensuring the delivery of the local work plans for both the CSU and our customers.&lt;/p&gt;\n&lt;p&gt;In this role it will be critical for you to fully understand our client business and proactively support your assigned customer areas by continuing to support and develop a positive culture towards IG matters whilst improving service quality and experience. In support of this you will have demonstrable proven experience of developing and maintaining successful relationships with key stakeholders.&lt;/p&gt;\n&lt;p&gt;Working closely with the wider Information Governance team you will support the development and delivery of the Information Governance service for the entire CSU ensuring that the services we deliver are value added, high quality and customer focused.&lt;/p&gt;\n&lt;p&gt;Applicants must possess excellent verbal and written communication skills and have the ability to engage confidently and professionally at all levels. You must have extensive knowledge of Data Protection, acquired through either education to degree level in a relevant field or experience working at a senior level working in data protection (or related area).&lt;/p&gt;\n&lt;h2&gt;Who you’ll support:&lt;/h2&gt;\n&lt;p&gt;The role is supporting the CSU and our Worcestershire and Herefordshire Customers working from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Kingston House – West Bromwich (Base Location)&lt;/li&gt;\n&lt;li&gt;NHS Herefordshire and Worcestershire Clinical Commissioning Group - Hereford, Worcester, Bromsgrove and Kidderminster&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Travel will be mostly within the above area however you will also need to be able to travel across the entire footprint of the CSU. MLCSU has a well-established approach to agile working allowing our people to manage organisational demands whilst maintaining a good work life balance. In addition, the organisation is proactive in embracing the use of technology to support interactions with clients and colleagues.&lt;/p&gt;\n&lt;h2&gt;Your qualifications and experience&lt;/h2&gt;\n&lt;p&gt;As an experienced Data Protection professional, you will have demonstrable experience working in a customer or commercially focused organisation and the ability to deliver against agreed plans and targets. You will have an excellent working knowledge of the Data Protection Act 2018, General Data Protection Regulation and Freedom of Information 2000 and be able to apply that knowledge in a clear, practical and solutions focussed manner.&lt;/p&gt;\n&lt;p&gt;You will be looking for an opportunity to use your extensive experience to make a real contribution and will enjoy co-ordinating resources and providing solutions to ensure all operational requirements of the CSU and our customers are met.&lt;/p&gt;\n&lt;h2&gt;What we offer&lt;/h2&gt;\n&lt;p&gt;In return, we provide a supportive environment in which to learn and develop, with the opportunity to further your skills and career within an exciting and evolving environment.&lt;/p&gt;\n&lt;p&gt;Joining our inclusive and innovative team comes with a range of benefits including flexible working arrangements, pension scheme and generous annual leave allowance.&lt;/p&gt;\n&lt;p&gt;With our training schemes and support networks, you will be empowered to play a leading role in the future of healthcare, whatever your specialism or interest. And as a member of NHS staff you will receive plenty of discounts from a host of restaurants and high-street stores too.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Hayley Gidman (Head of Information Governance) via our Information Governance team at mlcsu.ig@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston House, West Bromwich", "postalCode": "B70 9LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5233", "longitude": "-2.00263"}}, "title": "Senior Information Governance Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244957", "validThrough": "2020-11-08T23:59:59+0000"}