{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus HCA"}}, "datePosted": "2020-11-03T14:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Specialist Occupational Therapist, Band 6. 1 x Permanent 1 x Fixed Term (12 months)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A paediatric specialist Occupational Therapist is required in the Lewisham Occupational Therapy Service for Children and Young People. This is an interesting opportunity for an enthusiastic and self-motivated individual who has previous experience of working as an occupational therapist with children and young people.&lt;/p&gt;\n&lt;p&gt;Our Children and Young Peoples Occupational Therapy team is based in Kaleidoscope children and young people’s centre. This is a large modern purpose built provision. The centre houses teams from health, social care and education services. It has excellent OT clinic facilities and office space and is conveniently located with good transport links. The Occupational Therapy team is a large established team which is well regarded within the multi professional team and by our Lewisham community partners.&lt;/p&gt;\n&lt;p&gt;What you can expect if you are the successful candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be part of a friendly experienced team and a place where people enjoy working.&lt;/li&gt;\n&lt;li&gt;To work with people who are committed and hardworking professionals.&lt;/li&gt;\n&lt;li&gt;To be well supported within your area of work. Depending on your experience you will be able to have structured clinical support from experienced staff to help you in your day to day work. There is also supervision both informal and formal including a regularly updated personal development plan.&lt;/li&gt;\n&lt;li&gt;To have exceptional opportunities to develop clinical skills in the area of children’s OT.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we would be looking for from the successful candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A mature professional.&lt;/li&gt;\n&lt;li&gt;Someone who has, in Paediatric OT, experience and who has also undertaken some specialist learning in this area and who is committed to developing their specialist skills further in working with this client group&lt;/li&gt;\n&lt;li&gt;A person who can show compassion and respect when undertaking the daily tasks for the clinical team or the children and families.&lt;/li&gt;\n&lt;li&gt;A person who has the ability to support others and assist in maintaining productive as well as caring team practices.&lt;/li&gt;\n&lt;li&gt;A person who could direct their own learning, showing drive, initiative and a commitment to quality.&lt;/li&gt;\n&lt;li&gt;Someone who can commit to remain working within our team to provide continuity of care and quality.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Royle via 02030491384 or alison.royle2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kaleidoscope, London", "postalCode": "SE6 4JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.45", "longitude": "-.017486"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254285", "validThrough": "2020-11-17T23:59:59+0000"}