{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T08:16:57+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Clinical Educator in Medical Education&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;2 posts, 18.75 hours per week&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a passion for clinical education and developing your teaching skills?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you interested in influencing the development of our new doctors? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 12-month secondment opportunity has arisen for a Clinical Educator (AfC: Band 6) at the Undergraduate Psychiatry Teaching Unit based at the Radbourne Unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Derby Psychiatry Teaching Unit (PTU) provides clinical placements to 4th year medical students from the University of Nottingham who are completing their psychiatry module in Derby. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Our ethos is to provide excellence, compassion and experiential learning in Medical Education. To do this we have developed a number of innovative interactive teaching approaches to help engage students and better develop their skills in working with people experiencing mental ill health. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are now is a position to extend our teaching team to help enhance the experiences for the students. As such, we are seeking mental health nurses with minimum of 3 years’ post registration experience. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Applicants must be enthusiastic, motivated and interested in developing face to face ‘bedside’ teaching with service receivers and carers, ensuring that respect and consideration for the needs of both students and service receivers is prioritised. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Successful applicants will be provided with extensive support and training from our experienced education team, and opportunities to extend their knowledge through medical education and research will be available.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Post holders will be based in the Radbourne Unit, but expected to work across clinical areas in the Trust, as well as provide some cover in the Education Centre at the Hartington unit as required.&lt;/p&gt;\n&lt;p&gt;Please seek approval from employer before applying for this post as a secondment opportunity.&lt;/p&gt;\n&lt;p&gt;For further details please contact Dave Hackett or Prof Subodh Dave: david.hackett@nhs.net or Subodh.dave@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical Annexe, Radbourne Unit, Royal Derby Hospital, Derby", "postalCode": "DE22 3WQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9126", "longitude": "-1.51002"}}, "title": "Clinical Educator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245724", "validThrough": "2020-11-10T23:59:59+0000"}