{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-11-03T09:10:36+0000", "description": "&lt;p&gt;We are seeking an experienced and enthusiastic Transformation and Programme Manager to join the South East Hants and Fareham &amp; Gosport Transformation Team.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who enjoys working as part of a team and can demonstrate a commitment to delivering a high quality service; to improve outcomes for patients through strong leadership, and commissioning&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to be able to provide strong leadership, work under pressure, be responsive to fast moving deadlines and maintain constructive relationships with a broad range of stakeholders. This is a varied and interesting role and you will be working in a dynamic and highly experienced senior management team, delivering an effective service, ensuring high quality commissioning and contracting arrangements are in place.&lt;/p&gt;\n&lt;p&gt;Ensuring patients receive the care they need, in the right place and at the right time is the top priority for the Hampshire and Isle of Wight Partnership of Clinical Commissioning Groups (the Partnership).&lt;/p&gt;\n&lt;p&gt;The Partnership serves a population of more than 1 million people and manages a budget of £1.4 billion. It is made up of five clinical commissioning groups from Fareham and Gosport and South Eastern Hampshire, North East Hampshire and Farnham, North Hampshire and the Isle of Wight.&lt;/p&gt;\n&lt;p&gt;Our aim of the Partnership is to help accelerate improvements in patient care, be more effective and reduce duplication. By working together, we share capacity and skills and operate with greater consistency with our partners for the benefit of patients.&lt;/p&gt;\n&lt;p&gt;We offer excellent employment opportunities to new and existing staff. We aim to be a model employer by embedding best HR practice and to support new ways of working.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on offering good working conditions, job security, lifelong learning, fair pay and benefits, staff involvement and a balance between work and personal life.&lt;/p&gt;\n&lt;p&gt;We enjoy a forward thinking and innovative culture and our vision is to have healthy people, living healthy lives in healthy communities. We understand the only way to deliver this is to have the right people with the right skills.&lt;/p&gt;\n&lt;p&gt;Here is a summary of some of the benefits and services which are on offer to staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days paid minimum holiday and bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Sick pay policy&lt;/li&gt;\n&lt;li&gt;Occupational health services including staff counselling services&lt;/li&gt;\n&lt;li&gt;Flexible working and family friendly policies&lt;/li&gt;\n&lt;li&gt;Flexible retirement and retirement vouchers&lt;/li&gt;\n&lt;li&gt;Health Service Discounts – offers for stores, travel, equipment etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful candidates will be subject to a six-month probationary period. Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For enquiries please contact &lt;/strong&gt;Keeley Ellis, Locality Director &amp; Primary Care&lt;/p&gt;\n&lt;p&gt;Keeley.ellis@nhs.net or 07788438371&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South Eastern Hampshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128535"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fareham", "postalCode": "PO17 6AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8585", "longitude": "-1.10908"}}, "title": "Transformation Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253217", "validThrough": "2020-11-13T23:59:59+0000"}