{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24214", "minValue": "24214", "unitText": "YEAR", "value": "From 24,214 per annum"}}, "datePosted": "2020-11-05T16:45:55+0000", "description": "&lt;p&gt;Silver Birch is 19 bed female acute ward which specialises in providing tailored person centred care for each service user that is admitted on to the unit. Due to it being an all female ward staff are given the opportunity to develop their skills whilst promoting women’s health and are supported with bespoke training and close relations to the female PICU which is situated next door.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic Band 5 Staff Nurse&#39;s to join our experienced and cohesive team. We pride ourselves on delivering high quality, evidence-based individualised care. The emphasis is on providing a therapeutic environment, allowing individuals to recover in a safe and supportive environment..&lt;/p&gt;\n&lt;p&gt;Silver Birch is the only women’s acute ward within the Trust and work closely with the other inpatient wards on the hospital site There will be learning opportunities to develop new skills in working with service users from a wide range of backgrounds and cultures, who are experiencing an acute episode of mental health problems.&lt;/p&gt;\n&lt;p&gt;You will co-ordinate shifts, attend ward rounds/ CPA’s, complete medication rounds, work closely with service users within the key working role and supporting both service users and their carers during their admission and on discharge back in to the community.&lt;/p&gt;\n&lt;p&gt;In addition to the above we offer the opportunity to work alongside our psychologist to participate in therapeutic groups on the ward. Currently we offer DBT skills and mindfulness groups to our service users and as a staff nurse you would be invited to participate in these groups if you are interested.&lt;/p&gt;\n&lt;p&gt;We are keen to develop our staff nurses, you will receive relevant training and supervision, develop close links with women’s services in Bristol, and you may be able to rotate into other areas of Bristol inpatient services.&lt;/p&gt;\n&lt;p&gt;There will be opportunities around career development, taking on lead roles to support the development of the team and service delivery. We also welcome our staff to seek additional training opportunities to meet their interests, eg. Working with learning disabilities &amp; dual diagnosis. You will be supported as a a practice assessor/ practice supervisor for students &amp; be actively encouraged to be a vital part of student nurse learning and development.&lt;/p&gt;\n&lt;p&gt;We have an excellent and enthusiastic multidisciplinary team with a vast range of O/T and psychological input and activities both on and off the ward.&lt;/p&gt;\n&lt;p&gt;Due to Covid-19 currently, as with many other wards Silver Birch Unit may be admitting Male Service Users if required, this is a temporary restructure to the acute services across the whole trust.&lt;/p&gt;\n&lt;p&gt;If you would like to contact the manager or any other member of the team to discuss the role further, we would be happy to be contacted and welcome anyone who wishes to visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Megan Habgood&lt;/p&gt;\n&lt;p&gt;Silver Birch, Acting Ward Manager&lt;/p&gt;\n&lt;p&gt;0117 919 5908&lt;/p&gt;\n&lt;p&gt;megan.habgood@nhs.net&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Hanna Paddock&lt;/p&gt;\n&lt;p&gt;Modern Matron.&lt;/p&gt;\n&lt;p&gt;T: 0117 919 5630&lt;/p&gt;\n&lt;p&gt;hanna.paddock@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Callington Road Hospital, Bristol", "postalCode": "BS4 5BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4315", "longitude": "-2.5575"}}, "title": "Band 5 Staff Nurse Silver Birch Unit Callington Road Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258618", "validThrough": "2020-11-18T23:59:59+0000"}