{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-30T14:00:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Community Public Health Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Visiting&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS AfC Band 5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Permanent post&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Site&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Various&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Town&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£24,907 to £30,615 per annum&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Thank you for your interest in Birmingham Community Healthcare. We are an ambitious organisation with big plans to deliver our early years services differently.&lt;/p&gt;\n&lt;p&gt;Our aspiration jointly with our children centre partners is to give the children of Birmingham the very best start in life. We have a passionate workforce who is committed to support the children and their families to feel safe, healthy and ready to achieve.&lt;/p&gt;\n&lt;p&gt;Under the umbrella of Birmingham Forward Steps with our partners we are working to offer an integrated service to children and families where they tell their story once and we work closely together to deliver the best outcomes possible and support families with their aspirations.&lt;/p&gt;\n&lt;p&gt;Although we are proud of the progress we are making we recognise we have much more to do.&lt;/p&gt;\n&lt;p&gt;Are you the right person to help us take our ambitions forward and help us to develop a brighter future for the children of Birmingham?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Band 5 staff nurses with a passion for delivering high quality services whilst embracing and expressing innovation and creative thinking to support our Health Visiting and Early Years team to deliver our ambitious plans.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to help us develop and implement our integrated way of working with our children’s centre partners.&lt;/p&gt;\n&lt;p&gt;If you are a Band 5 Staff Nurse looking to join a thriving, innovative service that puts children at the heart of everything we do then this is the role for you. The post will include development opportunities and mentorship support.&lt;/p&gt;\n&lt;p&gt;We have posts available across all districts within Birmingham&lt;/p&gt;\n&lt;p&gt;Full-time, Part-time, Job share and flexible working options are available.&lt;/p&gt;\n&lt;p&gt;For an informal discussion or further information please contact Operational Manager Tshiwe Madamombe 07566766398&lt;/p&gt;\n&lt;p&gt;We look forward to welcoming you to join us in this adventure.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our values underpin everything we do&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CARING, OPEN, RESPECTFUL, RESPONSIBLE, INCLUSIVE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to equality, diversity and inclusion starts with our people; shapes the way we deliver our services and the way we build our teams. We welcome candidates from diverse backgrounds to help us deliver great care to all of our communities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality, Diversity and Inclusion&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham is a fantastic place to live and we serve a wide range of people and communities. BCHC is an advocate of diversity and strive to mirror our community as much possible.&lt;/p&gt;\n&lt;p&gt;We are committed to and actively promote equality of opportunity for all staff and applications from individuals from all areas of the community who meet the specific criteria are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage/civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Promoting Workforce Equality&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In response to data held by BCHC which demonstrates that individuals from particular protected characteristics are under-represented, BCHC are striving to redress these imbalances. In order to do this, the Trust is committed to the employment and career development of individuals from these protected characteristics. As part of this commitment, given this under representation, the Trust guarantees an interview to any applicants from under represented protected characteristic for positions at Band 8a and above whose application meets the essential criteria for the post as detailed on the Person Specification.&lt;/p&gt;\n&lt;p&gt;The Trust is currently under-represented in terms of people from Black, Minority Ethnic (BME) backgrounds and welcomes applicants fro&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mose, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 5 Community Public Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250454", "validThrough": "2020-11-13T23:59:59+0000"}