{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 to £46,294  inc HCAS"}}, "datePosted": "2020-09-25T11:55:26+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen within the Surrey-wide Specialist Child and Adolescent Eating Disorders Service for a full time Band Clinical Nurse Specialist. You will be joining an established and successful team. You will be joining a dynamic and happy team of experienced clinicians working with young people and their families in the community who are suffering with an eating disorder.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a highly senior ED clinician and Lead CNS with proven leadership skills, you will be required to jointly clinically lead the ED Nursing Team alongside the other Band 7 CNS. You will also have a lead role in contributing and coordinating the Enhanced Pathway/Acute Liaison work (working with the most severely ill young people and supporting them towards recovery). You will be helping your junior nurse colleagues to coordinate and manage their own caseloads and will provide clinical and managerial supervision and Appraisal to your junior nurse colleagues and nurse students as required. It will be important that you work very closely with the Service Manager, Consultants and other Professional Leads in CEDS, to maintain clinical oversight of your work and the CNS work and to keep abreast of the developments within the service and the national Access and Waiting Times Guidance (2016). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You may at times need to be very mobile in your role, supporting families in the community and attending CPA’s at Tier 4 units or visiting young people who may be in paediatric units awaiting tier 4 placements. You will manage your own case load and supervise and manage the junior nurse colleagues (2 staff) in the team and to jointly coordinate the nurse supervision structure within the team. You will also be able to contribute to the Family Based Treatment programme (training will be provided) and Psycho-educational Parents Group Programme, as well as either leading or co-facilitating some new patient assessments. You will provide nursing supervision within the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is established and well organised, so you will receive a lot of support in the team and clarity around your role. Experience of working with child and adolescent eating disorders (at both Tier 4 and Community levels) is essential. Unfortunately, due to current service requirements we cannot negotiate job share. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to speak to a member of the team about the service or your application please contact &lt;/span&gt;&lt;strong&gt;Suzanne Cole&lt;/strong&gt; (Service Manager) or &lt;strong&gt;Jenni Dilliway-Davies&lt;/strong&gt; (CNS Lead) on 01372 206325.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3493", "longitude": "-.27448"}}, "title": "Eating Disorders Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916200353", "validThrough": "2020-11-16T23:59:59+0000"}