{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 to £25,365 per annum inclusive of HCAS"}}, "datePosted": "2020-11-03T09:30:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an Experienced or Newly qualified Associate Practitioner or Nursing Associate looking to either change direction, return to practice or develop and grow within your career?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If yes, then Frimley Health Foundation Trust is your choice of employer!&lt;/p&gt;\n&lt;p&gt;We are one Trust with 3 hospital sites across Frimley, Ascot and Slough&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for you to join the Medical Acute Dependency Unit nursing team within the Medicine directorate at Frimley NHS Foundation Trust, Wexham Park site.&lt;/p&gt;\n&lt;p&gt;MADU is a 16 bedded unit and has facilities for full cardiac monitoring and non-invasive ventilation. We provide level one and two care to patients with a variety of conditions from GI bleeds, DKA, type 1 and type 2 respiratory failure requiring non-invasive ventilation, Heart failure, severe electrolyte imbalance, central lines and arterial lines monitoring, amongst others.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a dynamic individual with strong interpersonal skills, some managerial and team leader experience and an enthusiasm for caring for acutely ill medical patients.&lt;/p&gt;\n&lt;p&gt;We will take into consideration newly qualified Associate Practitioners/Nursing Associates wishing to join our team too, making sure they will have the appropriate training and support they need.&lt;/p&gt;\n&lt;p&gt;We positively promote staff development with the support of our Cardio and Respiratory specialist Practice Development nurse, and you will have the opportunity to develop your skills.&lt;/p&gt;\n&lt;p&gt;As a department we take extreme pride in our staff, ensuring that individual development is paramount. If you wish to broaden your clinical skill set or gain further knowledge in the field of medicine then this is the opportunity for you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Pedro Leal&lt;/p&gt;\n&lt;p&gt;Pedro.leal@nhs.net&lt;/p&gt;\n&lt;p&gt;01753633000&lt;/p&gt;\n&lt;p&gt;ext 152863&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham Park Hospital, Slough", "postalCode": "SL2 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5331", "longitude": "-.575106"}}, "title": "Associate Practitioner/Nursing Associate - MADU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253279", "validThrough": "2020-11-17T23:59:59+0000"}