{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-23T13:46:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Occupational Therapist Community vacancy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic, motivated and compassionate Band 6 Occupational Therapist looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced Band 6 Occupational Therapist for the Integrated Rehabilitation Team (IRT) within our neighbourhood team in Central Mendip and the post will be based at Shepton Mallet Community Hospital.&lt;/p&gt;\n&lt;p&gt;You will be working closely alongside our District Nurses, Older Persons Mental Health Team, Primary Care, Social Prescribers and Voluntary Sector. Somerset is supporting the development of Neighbourhood Teams, collaborating closely with Primary Care Networks to establish innovative and creative ways to maintain patient’s independence and help them to proactively manage their conditions. We also support other Trust initiatives such as the Discharge to Assess which aims to discharge patients back to their home environment, as early as possible, through the provision of care and re-enablement at home.&lt;/p&gt;\n&lt;p&gt;A broad experience would be beneficial as well as being able to work independently. You will be expected to hold a diverse clinical and complex caseload and be able to inform and advise your neighbourhood colleagues regarding the patient’s occupational therapy needs. This post will provide you with the opportunity to further develop your occupational therapy and intervention skills, building on your knowledge base and strengthening your clinical reasoning skills.&lt;/p&gt;\n&lt;p&gt;This position sits within the wider rehabilitation team and will link in with colleagues at Frome Community Hospital. As part of this role you must have outstanding communication and team working skills, have the ability to inspire and motivate your patients to maximise their physical and functional abilities.&lt;br /&gt;&lt;br /&gt;So if you are passionate about person centred rehabilitation, want to work in the community come and join our team in Mendip. &lt;br /&gt;&lt;br /&gt;If you are interested in applying for this post and would like an informal discussion please give us a call, we&#39;d be delighted to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria BullJob titleIRT Lead East and Central MendipEmail addressvictoria.bull@somersetft.nhs.ukTelephone number07464494456&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet Community Hospital, Shepton Mallet", "postalCode": "BA4 4PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1906", "longitude": "-2.56249"}}, "title": "Occupational Therapist, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240779", "validThrough": "2020-11-18T23:59:59+0000"}