{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23567", "minValue": "23567", "unitText": "YEAR", "value": "£14.02 per hour"}}, "datePosted": "2020-11-04T12:01:19+0000", "description": "&lt;p&gt;Are you current looking for work to fit around commitments such as the school run?&lt;/p&gt;\n&lt;p&gt;Maidstone and Tunbridge Wells NHS Trust currently have a number of opportunities for registered nurses within their Temporary Staffing Service who wish to work flexibly.&lt;/p&gt;\n&lt;p&gt;The position will cover wards at both the Tunbridge Wells Hospital at Pembury and Maidstone Hospital.&lt;/p&gt;\n&lt;p&gt;Both sites encompass many nurse led initiatives including caring for patients requiring non-invasive ventilation, and the opportunity to work in a fast-paced, high patient turnover environment. We are lucky to have a range of dynamic clinical nurse specialists and sisters who support the clinical teams. This post offers the opportunity to learn and develop acute care nursing skills when the patients are at their sickest, early in their hospital stay.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and enthusiastic person to join our nursing team. In return for your enthusiasm, you will be supported to develop your clinical skills and will have the opportunity to develop personally and professionally as part of a ‘high challenge, high support’ environment.&lt;/p&gt;\n&lt;p&gt;The benefits of joining our bank include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cost of DBS and uniform covered by the Trust&lt;/li&gt;\n&lt;li&gt;Priority shifts over agency staff&lt;/li&gt;\n&lt;li&gt;Weekly payroll&lt;/li&gt;\n&lt;li&gt;Support in development and revalidation&lt;/li&gt;\n&lt;li&gt;Online shift booking system&lt;/li&gt;\n&lt;li&gt;Dedicated team to support with any queries 7 days per week&lt;/li&gt;\n&lt;li&gt;Excellent transport links&lt;/li&gt;\n&lt;li&gt;Access to NHS Pension&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Thursday 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Wednesday 4th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;The Temporary Staffing Team on 01622 228800&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone &amp; Tunbridge Wells Hospital, Maidstone &amp; Tunbridge Wells", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255714", "validThrough": "2020-11-19T23:59:59+0000"}