{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCA"}}, "datePosted": "2020-11-02T17:00:53+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6, Junior Sister (with a strong interest in admission and discharge processes)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Murray Falconer Ward is a 31 bedded neurosurgical elective ward caring for patients with a wide variety of neurosurgical conditions as well as 3 elective orthopaedic beds. The unit is an integral part of the GIRFT (Getting It Right First Time) national neurosurgical programme. It is an elective ward, all patients admitted to this ward are under the green elective pathway.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are aiming to improve patient experience by ensuring high quality discharge processes are in place and patients are involved at all stages of their own individualised discharge plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a highly motivated, professional, enthusiastic, dedicated and forward thinking individual to help bridge the gap between the Neurosurgical Admissions Lounge and Murray Falconer Ward. The successful candidate needs to have a strong interest in discharge processes and be prepared to lead change management projects to:&lt;br /&gt;· reduce the length of stay&lt;br /&gt;· increase &#39;on the day&#39; admissions thus reducing unnecessary night before admissions&lt;br /&gt;· develop protocols to enable all patient discharges by 11 am&lt;br /&gt;· consider development of a mini discharge lounge on the ward&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be expected to rotate through, and be a part of, the bigger nursing team within Murray Falconer gaining experience of all levels of nursing care including the Neurosurgical Admissions Lounge. You will roll out your project so all members of the nursing team thus enabling all the nursing team to work in this discharge role on a daily basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please apply if you:&lt;br /&gt;· have a strong interest in the admission and discharge processes in the Neurosurgical Admissions Lounge and Murray Falconer&lt;br /&gt;· have completed (or wish to undertake) the Mentorship course&lt;br /&gt;· are a team player&lt;br /&gt;· able to problem solve to overcome obstacles preventing a streamlined admission and discharge pathway&lt;br /&gt;· are a positive contributor to change&lt;br /&gt;· have excellent communication and interpersonal skills&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal discussions greatly encouraged.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Yvonne Fraser&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address yvonnefraser1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 299 8354&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Junior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252959", "validThrough": "2020-11-15T23:59:59+0000"}