{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "31000", "unitText": "YEAR", "value": "£31,000 - £35,000  plus £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T09:43:02+0100", "description": "&lt;p&gt;Nelson House is a modern and spacious 30 bed rehabilitation and recovery service for men with mental illness. Our focus is on providing an environment where service users are offered the opportunity to develop their skills for independence. The team at Nelson House are committed to enabling the service users to reach their individualised goals and maximise their potential. Service Users are supported to learn new ways of managing their conditions and symptoms to prevent future relapse.&lt;/p&gt;\n&lt;p&gt;Nelson House is a CQC rated Good rehabilitation and recovery orientated mental health unit situated on the South Coast of England. We are currently looking for a motivated and passionate individual who will be responsible for managing all aspects of nursing responsibilities on a day to day basis.&lt;/p&gt;\n&lt;p&gt;Our Deputy Ward Manager role involves:&lt;/p&gt;\n&lt;p&gt;Supporting others to support vulnerable men to reach their full recovery potential&lt;/p&gt;\n&lt;p&gt;• Being a clear leader for the Nursing team and managing shifts&lt;/p&gt;\n&lt;p&gt;• Providing high quality care in a rehabilitation and recovery setting for men suffering from enduring mental illness&lt;/p&gt;\n&lt;p&gt;• Developing therapeutic relationships to optimise patient engagement&lt;/p&gt;\n&lt;p&gt;• Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/p&gt;\n&lt;p&gt;• Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/p&gt;\n&lt;p&gt;• Mentoring and supporting student nurses and other members of the team&lt;/p&gt;\n&lt;p&gt;• Promoting professional development within the team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful in this role you will need to be committed to Personal Learning and Development, Evidence and Values Based Practice and Patient Centred Care. You will need to have excellent team working skills and be highly self-motivated with a flexible approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Qualifications:&lt;/p&gt;\n&lt;p&gt;• - RMN / RNMH&lt;/p&gt;\n&lt;p&gt;Experience:&lt;/p&gt;\n&lt;p&gt;• Experience in a supervisory role&lt;/p&gt;\n&lt;p&gt;• A recognised mentoring certificate&lt;/p&gt;\n&lt;p&gt;• The ability to assess and teach junior staff&lt;/p&gt;\n&lt;p&gt;• A proven ability to co-ordinate care, prioritise tasks and manage Health &amp; Safety issues&lt;/p&gt;\n&lt;p&gt;• The drive to learn and develop&lt;/p&gt;\n&lt;p&gt;• A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Some of the benefits we offer Qualified Nurses are:&lt;/p&gt;\n&lt;p&gt;• Free car parking and&lt;/p&gt;\n&lt;p&gt;Free meals whilst on duty&lt;/p&gt;\n&lt;p&gt;• 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/p&gt;\n&lt;p&gt;• Extra Service Annual leave awards&lt;/p&gt;\n&lt;p&gt;• Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/p&gt;\n&lt;p&gt;• Paid NMC registration fees&lt;/p&gt;\n&lt;p&gt;• Payment into the pension scheme&lt;/p&gt;\n&lt;p&gt;• CPD top up&lt;/p&gt;\n&lt;p&gt;• Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt;£5,000 Welcome Bonus&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;‘All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS). Priory Group will cover the cost of a DBS check for all successful applicants.’&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO13 0EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8125", "longitude": "-1.16009"}}, "title": "Deputy Ward Manager with £5,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225509", "validThrough": "2020-11-13T23:59:59+0000"}