{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 + 5% HCA pro rata"}}, "datePosted": "2020-10-23T14:52:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Superintendent Radiographer for Community based X-Ray Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our staff have gained an excellent reputation for providing a high quality x-ray service. We are looking for a highly motivated Superintendent Radiographer to lead our community x-ray departments to provide an outstanding imaging service to our local community.&lt;/p&gt;\n&lt;p&gt;The x-ray departments undertake approximately 25,000 examinations per year. We have x-ray sites in Walton on Thames and Woking. We work with state of the art equipment - having 2 Siemens YSIOS DR suites. We work closely with the Walk in Centre’s, Outpatients Department, Inpatients and GP’s. You will have to be self-motivated and able to work on your own initiative.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic band 7 radiographer who will work clinically as well as undertake managerial duties. The successful candidate will have experience of leading a team and managing workflows. You will need to be dynamic and flexible approach and be prepared to participate in the rotas which include evening and weekend duties.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have either a DCR or a BSc qualification and have extensive knowledge and experience of radiographic procedures. A high standard of radiographic technique is essential with a patient centered approach to your work.&lt;/p&gt;\n&lt;p&gt;We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent and caring service to our patients. If you want to part of a friendly department with a patient centered focus, then please apply.&lt;br /&gt; &lt;br /&gt; If you are interested in meeting the staff and seeing the departments, please contact Carol Marsden (carolmarsden@nhs.net) or the Woking x-ray department on 01483 846315&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walton and Woking Community Hospitals", "postalCode": "KT12 3LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.38", "longitude": "-.406021"}}, "title": "Band 7 Head of X ray", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241013", "validThrough": "2020-11-06T23:59:59+0000"}