{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-05T10:00:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Contract Manager - Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term/Secondment &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time - 37.5 hours per week&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;NHS North East Essex Clinical Commissioning Group is an ambitious and innovative, clinically led organisation that is&lt;/span&gt;&lt;/span&gt; &lt;span&gt;seeking to recruit to the role of Senior Contract Manager. This is a temporary 12 month fixed term contract to provide maternity cover, which may suit someone looking for a secondment opportunity. The role will be part of a contracts team working across Suffolk and North East Essex, with a focused approach on the North East Essex Alliance locality contracts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Reporting to the Deputy Director of Performance and Contracts the successful candidate will be an experienced Contract Manager who ideally has NHS contracting experience. An understanding of the NHS commissioning and contracting cycle and funding flows within the NHS will be critical as will an in-depth knowledge and experience of contract negotiation and management. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be responsible for a portfolio of healthcare contracts. You will need to have strong interpersonal skills to deal with highly complex and sensitive matters that may arise in day-to-day business and have a credible presence with stakeholders including providers, GP elected members and Primary Care Network (PCN) Clinical Directors. The right candidate will also need the ability to work under pressure and manage competing priorities.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be expected to work with colleagues including Business Intelligence, Finance, Quality and Transformation, to coherently manage all elements of the contracts. The post holder will need to be able to demonstrate excellent organisational skills and an attention to detail that is reflected in verbal and written communication&lt;/span&gt;&lt;/span&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will be challenging but rewarding and we are looking for a candidate that has the passion and commitment to deliver our system’s vision. This will be an individual who shares our values and can support transformational change through the contracting function, contributing to the CCG’s success. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are the person we are looking for and would like to work in a dynamic, ambitious and supportive team, we look forward to receiving your application. Should you wish to explore the opportunity further, please contact Victoria Sawtell, Deputy Director of Performance and Contracts on 01206 286898 or &lt;/span&gt;&lt;span&gt;victoria.sawtell@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North East Essex Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO4 9QR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9213", "longitude": ".93104"}}, "title": "Senior Contracts Manager - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257135", "validThrough": "2020-11-18T23:59:59+0000"}