{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-10-23T10:01:59+0100", "description": "&lt;p&gt;BAND 6 Care Coordinator&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Adult Community Mental Health Rehabilitation&lt;/p&gt;\n&lt;p&gt;West London NHS Trust, Ealing Community Rehabilitation Team&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Are you a registered nurse, occupational therapist or social worker looking for a new challenge in a community setting? Come and join our multi-disciplinary team who work together to support people in their recovery journey and live the best life possible.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;With West London NHS Trust’s planned expansion and development of its community rehabilitation service in the three boroughs it serves, Hounslow, Ealing and Hammersmith and Fulham, the team is looking to recruit a dynamic, creative and hard working Band 6 Care Coordinator to support the service delivery of its rehabilitation pathway for referred service users. This is to achieve their recovery goals, improve function and live the best life possible.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hounslow Community Rehabilitation Team provide a high level of support for people with complex and long standing mental health issues that impact upon their ability to fulfil satisfying and meaningful roles.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The team work closely with service users and carers to help maximise independent functioning, focusing on discharge to less supportive accommodation and actively promoting recovery. This role will also involve care coordination and working to develop detailed CPA, risk assessment and management plans, health and wellbeing plans, and to provide evidence based interventions within a one to one or a small group setting. There will be opportunities to participate in and potentially lead on quality improvement initiatives and research.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In this role you will work closely with the wider clinical team, inpatients services, Early Interventions Service, community mental health team, housing sector as well as a wide variety of local 3rd Sector organisations.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a great opportunity for an experienced mental health nurse, OT or social worker interested in a new challenge within an enthusiastic and hardworking multi-disciplinary rehabilitation team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further information please contact Lemuel Florece, Team Lead – Occupational Therapist: lemuel.florece@westlondon.nhs.uk or 0208 483 2106 or Bradley Platt, service manager for planned and primary care: Bradley.Platt@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLemuel FloreceJob titleTeam Lead – Occupational TherapistEmail addresslemuel.florece@westlondon.nhs.ukTelephone number0208 483 2106Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "13663 Ealing Community Rehab, London", "postalCode": "UB2 4SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5053", "longitude": "-.357689"}}, "title": "Care Co-Ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239946", "validThrough": "2020-11-15T23:59:59+0000"}