{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-12T10:45:12+0100", "description": "&lt;p&gt;The Rotherham NHS Foundation Trust (TRFT) is a clinically progressive, high-performing organisation with a reputation for clinical excellence and efficiency. The Trust is focused on the provision of high standards of care and delivers strong performance against national targets. The Trust is an Associate Teaching Hospital of the University of Sheffield and has an active research programme delivered through local, regional, national and international research networks and consortia. TRFT employs over 4,500 members of staff.&lt;/p&gt;\n&lt;p&gt;Rotherham is surrounded by attractive countryside, contemporary leisure facilities and extensive retail outlets. The town has excellent road and rail links, and easy access to several airports.&lt;/p&gt;\n&lt;p&gt;The Rotherham borough has a population of approximately 250,000 and covers approximately 100 square miles. Traditional heavy industries have been replaced by hi-tech industries and a thriving service sector. One legacy of the town’s industrial heritage is that the borough is made up of many villages (some very small and picturesque) separated by farm and common land.&lt;/p&gt;\n&lt;p&gt;Rotherham has a number of very pleasant suburbs and the hospital itself is located in attractive leafy urban surroundings approximately two miles from the award-winning town centre. Housing in the Rotherham area is competitively priced and offers a wide range of choice, including urban and rural locations.&lt;/p&gt;\n&lt;p&gt;Within Rotherham, there are three country parks, an English Heritage Site and the nationally acclaimed Magna Science Adventure Centre, which draws on Rotherham’s industrial past to provide a spectacular and educational experience. A “Gulliver’s Kingdom” theme park is currently being planned for the town. The historic Wentworth Woodhouse, with its spectacular monuments, beautiful parkland and 365 rooms is also situated within the borough.&lt;/p&gt;\n&lt;p&gt;There are several high-performing state schools in Rotherham. Coaches also run from Rotherham to excellent private schools in Sheffield.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant Obstetrician &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to offer the opportunity for an enthusiastic Obstetrician with well-rounded training to join an existing team of 11 Consultants.&lt;/p&gt;\n&lt;p&gt;The Obstetric unit conducts approximately 2500 deliveries per year,&lt;/p&gt;\n&lt;p&gt;The Maternity Unit currently has 23 beds and a Level 2 Neonatal Unit. Consultant presence on the Delivery Suite is 62.5 hours a week. There are resident evening sessions with non-resident practice overnight.&lt;/p&gt;\n&lt;p&gt;Antenatal practice is divided up into specific speciality clinics to which expectant mothers are allocated. The vast majority of routine and detailed scans are performed within the department. Specific antenatal clinics are supported by Consultant physicians and Nurse Specialists. The unit has specialist antenatal clinics which include diabetes, mental health, endocrine, haematology.&lt;/p&gt;\n&lt;p&gt;The job plan will be discussed and may be modified in discussion with the Director of Clinical Services. This post will currently participate on the on-call rota up to 1:8 but there is a potential for change in the future.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the Obstetrics &amp; Gynaecology department for an informal tour and discussion. The unit will arrange an open day, the date of which will be announced after shortlisting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information about the post or to arrange a visit, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Stephen Poku, Clinical Lead Tel: 01709 424190 (secretary)&lt;/p&gt;\n&lt;p&gt;Mrs Gillian Willers, Director of Clinical Services Tel: 01709 424245&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact Faye Marshall, Service Manager, for Obstetrics &amp; Gynaecology on Tel: 01709 424245&lt;/p&gt;\n&lt;p&gt;The closing date : 9th October 2020.&lt;/p&gt;\n&lt;p&gt;Interviews will be held at the Rotherham NHS Foundation Trust on 19th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant in Obstetrics and Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221927", "validThrough": "2020-11-09T23:59:59+0000"}