{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48000", "minValue": "41000", "unitText": "YEAR", "value": "£41,000 - £48,000 depending on experience"}}, "datePosted": "2020-11-03T17:54:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Qualified Clinical, Counselling or Forensic Psychologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Autism and Learning Disability Division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term contract till end of May 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career Level C / Expert / NHS 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0.6 wte / 22.5 hours a week (flexible hours)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Take on a new leadership challenge at the forefront of Mental Health Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Andrew’s is the UK’s largest mental health charity and a unique provider of specialist care in mental health and learning disability. We aspire to deliver truly world class, holistic services within our outstanding, modern facilities. Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services. We are currently transforming the Charity to deliver ‘Value Based Healthcare’. This will ensure our patients consistently get the best possible outcomes and local teams gain more control and responsibility.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role &amp; Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Autism and Learning Disability Division delivers specialised assessment and treatment to men and women with a diagnosis or intellectual disability or on the autistic spectrum of disorders who require hospital treatment in conditions of security. An opportunity has arisen to work with us to provide the best treatment and care for these patients.  The successful applicant will be joining a well-established psychology department which offers professional support and a wide range of expertise.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We seek a HCPC registered applied psychologist, Clinical, Counselling of Forensic, to join our team of more than 10 psychologists. Psychologists are key members of our multidisciplinary teams that provide treatment and care for more than 100 patients. You will have a caseload of patients and the help of an assistant psychologist. The key tasks are to assess, formulate and deliver treatment and evaluate clinical outcomes to your patients. Clinical risk assessment and management is a major aspect of this role, and you will be, familiar with a range of standardised methods for assessing clinical risks. In addition you will work within the MDT to support and develop their practice on the wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work clinically as part of a large Multidisciplinary team that includes psychiatry, nursing, occupational therapy, speech and language therapy, social work, adult education and vocation training and physical health and exercise teams. Psychological treatment is provided within a broad cognitive behavioural model, with a strong emphasis on psychotherapy that addresses the impairments in autism and intellectual disability, psychological treatment for emotional and psychiatric disorder, as well as offence related interventions aimed at reducing recidivism.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Knowledge and experience of working with challenging behaviour using positive behavioural support is advantageous, as is experience of working with anxiety, major mental illness as many of our patients have multiple presenting problems. As well as being part of our Division psychology team you will have access to a larger group of counselling, clinical and forensic psychologists in the Charity service for consultation and there is opportunity for peer collaboration across our other clinical specialities. The Charity supports innovation and research and there is opportunity for research and development in this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?  We would love you to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Andrew’s is the UK’s leading mental health charity with an excellent and well-deserved reputation as a provider of specialist mental healthcare, and as such, it provides great opportunity for collaborative work and professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to discuss this opportunity or visit the hospital before applying please contact Peter Ford, Lead Consultant Psychologist for the ALD Division on 07738989505.  or James Farrelly (Senior Recruitment Consultant) 01604 616624 or jcfarrelly@standrew.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer an excellent benefits package including 38 days holiday,  sickness policy on par with NHS, car lease scheme, free parking, cycle to work scheme, retailer discounts scheme &amp; access to vocational qualifications.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing Date:   Sunday 22nd November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Qualified Clinical, Counselling or Forensic Psychologist - LD &amp; Autism", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254975", "validThrough": "2020-11-22T23:59:59+0000"}