{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro rata"}}, "datePosted": "2020-11-03T12:02:58+0000", "description": "&lt;p&gt;&lt;strong&gt;18.75 hours, 5 shifts a week – 3.75 hours a day&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the Nantwich Care Community Team (based at Church View Primary Care Centre). The post is for a Band 5 Adult Nurse who is keen to work with the evolving workforce 37.5 hours a week covering 7 days a week over a 5 day period/&lt;/p&gt;\n&lt;p&gt;Do you enjoy working independently, but also like to feel supported and valued by the rest of the team? Are you innovated, committed, motivated and caring? Do you have good time management and able to prioritise? Would you like to be involved in transforming and developing services within the community? Do You want the privilege of visiting patients in their own home to deliver increasingly complex, holistic care? If Yes then Community Nursing maybe the choice for you.&lt;/p&gt;\n&lt;p&gt;Whether you are newly qualified or looking for a change in direction and a more challenging role , we would welcome your application for this exciting opportunity to join the Nantwich and Rural Care Community Team&lt;/p&gt;\n&lt;p&gt;District Nursing is a highly specialised area of practice recognised by the Queens Nurses Institute and NMC as a specialist role.&lt;/p&gt;\n&lt;p&gt;As a community staff Nurse, you will work within the Care Community Team consisting of District Nurses, Advanced Community Practitioners, Complex Case Practitioners, MacMillan Nurses, Case Managers, Community Staff Nurses, Therapists, Therapy assistants and Health Care Assistants to meet the needs of the complex patient in the community and avoid admissions to the acute sector as far as practicable. This includes end of life care, managing the deteriorating patient, complex and simple wound care including Vac Therapy, Pico and Compression therapy, venepuncture, catheterisation, utilising advanced physical assessment skills and many more clinical nursing skills. We nurse people with a variety of conditions in a holistic manner both in their own homes and in a clinic setting and work in close partnership with other primary health care professionals such as GP’s, Tissue Viability, Diabetes, Respiratory and Heart Failure Teams.&lt;/p&gt;\n&lt;p&gt;If you would like more information about this position prior to applying, please call me and I can arrange for you to visit our base or if preferred have an informal chat over the phone. Either way we look forward to hearing from you and wish you well in your application.&lt;/p&gt;\n&lt;p&gt;As travel is an essential part of this role, please demonstrate on your application form how you would meet this requirement.&lt;/p&gt;\n&lt;p&gt;Closing date for the application is 02/11/2020 and interviews will be held on the 11/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nantwich", "postalCode": "CW5 5NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0682", "longitude": "-2.51857"}}, "title": "Community Nurse, Nantwich &amp; Rural Care Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253872", "validThrough": "2020-11-22T23:59:59+0000"}