{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per Annum, Pro rata"}}, "datePosted": "2020-10-07T16:46:36+0100", "description": "&lt;p&gt;&lt;strong&gt;OD practitioner – on-boarding and retention lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you like variety in your role? Do you like working with people and data? One day you may be delivering our Trust Welcome event, the next day trying to understand staff experience through a focus group in the morning and analysing data in the afternoon. Are you someone who has lots of ideas, is willing to try new approaches and enjoys taking the lead on projects to shape new work? Are you someone who enjoys bringing people together on projects? Are you someone who likes writing reports and evaluating your work to ensure what we do adds value? If so this role is for you.&lt;/p&gt;\n&lt;p&gt;Organisational Development plays an influential role in our organisation and our portfolio is growing and you can be part of it with this new role. We’re looking for an enthusiastic and innovative practitioner to take the lead on refreshing and implementing our on-boarding programme and delivering our staff retention plans. You will have variety in your role as you will also support the Leadership and Organisational Development team on shared projects such as coaching, culture and staff engagement. You will also support our team development programme (TED) and through that coach and support managers as well as facilitate team development.&lt;/p&gt;\n&lt;p&gt;Our work is always changing as our organisation changes and so if you’re someone who thrives on change, spots opportunities for Organisational Development to add value and likes to adapt your role as new projects arise then this job is for you.&lt;/p&gt;\n&lt;p&gt;You will report to and work alongside the Head of Engagement, Recognition and Retention to lead on implementing projects and interventions in line with our Organisational Development plans so that our workforce have a positive experience of work, feel engaged with their team and our vision, want to go the extra mile and build their future with us.&lt;/p&gt;\n&lt;p&gt;If you think this role feels like a good fit for you, you have the relevant skills and experience, and you want to work in a creative, forward thinking OD team who are shaping the future of work within the organisation, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;For an informal conversation about the post, please contact Fiona Yates, Head of Engagement, Retention and Recognition via Fiona.Yates@lthtr.nhs.uk and we can schedule a phone call.&lt;/p&gt;\n&lt;p&gt;Interviews and assessments are scheduled to take place on Wednesday 18th November 2020 and shortlisted candidates will need to be available for the full day, we are unable to offer alternative interview dates unfortunately. Further details in respect of the selection process will be shared with shortlisted individuals.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Find out more about the role, our team and organisation by joining our question and answer session on MS teams on Wednesday 28&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;/span&gt;&lt;span&gt; October 6pm – 7pm. If you would like to join please email Fiona.Yates@lthtr.nhs.uk and she will provide you with the details of how to join. Please also send your questions when you book on.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona YatesJob titleHead of Engagement, Retention and RecognitionEmail addressfiona.yates@lthtr.nhs.ukTelephone numbern/a please email to arrange a phonecall&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Organisational Development Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217370", "validThrough": "2020-11-08T23:59:59+0000"}