{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-30T16:16:42+0000", "description": "&lt;p&gt;&lt;strong&gt;8C General Manager – Transformation Programme Lead for Out of Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a 6 month secondment to support the Coventry Out of Hospital transformation programme in the Community Health and Wellbeing Directorate.&lt;/p&gt;\n&lt;p&gt;There are key areas of Out of Hospital delivery that the directorate are leading on:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Development of integrated working in each PCN.&lt;/li&gt;\n&lt;li&gt;Leading on system clinical pathways (Diabetes, Heart Failure, COPD)&lt;/li&gt;\n&lt;li&gt;Workforce development&lt;/li&gt;\n&lt;li&gt;Implementing enabling functions to support demand and capacity modelling.&lt;/li&gt;\n&lt;li&gt;Using patient, staff, carer and stakeholder feedback to improve delivery.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;You will drive forward these ambitions and strategic goals of the Out of Hospital programme, working closely with the Clinical Director, Senior team, clinical teams and PCN leads . You will form part of the directorate senior leadership team and work closely with the Out of Hospital teams across the directorate to deliver and operationalise this ambitious transformation programme.&lt;/p&gt;\n&lt;p&gt;We are looking for an aspiring senior leader who is an 8B or above, who has a track record in delivering transformation work across organisational boundaries . You need to be confident and creative in your approach to problem solving. It is essential that you have excellent people skills and the ability to work with key colleagues and influence at every level.&lt;/p&gt;\n&lt;p&gt;In return we will give you a challenging, yet fulfilling role, career support, and development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in applying, and would like to know more or have an initial discussion about this exciting opportunity please contact Fiona McGruer - Associate Director of Operations, Community Health and Wellbeing Directorate, Tel: 07768 557709 or email; fiona.mcgruer@covwarkpt.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wayside House, Coventry", "postalCode": "CV6 6NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4571", "longitude": "-1.48652"}}, "title": "General Manager - Transformation Programme Lead OHH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250906", "validThrough": "2020-11-15T23:59:59+0000"}