{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive of HCAS"}}, "datePosted": "2020-11-02T11:45:59+0000", "description": "&lt;p&gt;A vacancy has arisen within the Royal Free London NHS Foundation Trust Vascular Access &amp; OPAT Team. The post will be based at the Royal Free Hospital Site and will involve working across the Royal Free Hospital and Barnet Hospital sites.&lt;/p&gt;\n&lt;p&gt;Vascular access and OPAT services are a recognised and growing specialty nationally.is and we at the Royal Free London Hospitals are looking for suitable candidates to join our team.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is looking for a new challenge and keen to expand their skills and knowledge into the field of Vascular Access and OPAT. Sound knowledge and understanding of Vascular Access and OPAT is required and training will be provided for the practical skills.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in an expanding team and develop new skills.&lt;/p&gt;\n&lt;p&gt;As part of this role the post holder will be expected to work within a team experienced specialist practitioners in managing a caseload of patients requiring vascular access and OPAT services. The post holder will be supported by the team of senior and experienced practitioners.&lt;/p&gt;\n&lt;p&gt;The successful post holder will, in conjunction with other members of the team be expected to inserted Vascular Access Devices on completion of the training period, facilitate the safe discharge of patients on the appropriate OPAT pathway, give educational training &amp; support on vascular access &amp; OPAT to all clinical staff working in the Trust, audit practice and participate in implementing changes to practice.&lt;/p&gt;\n&lt;p&gt;If you are ready for a new challenge and have what it takes to join a forward thinking team committed to the delivery of high quality care then let us hear from you!&lt;/p&gt;\n&lt;p&gt;To be shortlisted applicants will need to detail in their supporting information how they can demonstrate the essential requirements of the experience and skills section of the person specification. The interview and selection process will be confirmed following shortlisting.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to work predominantly Monday to Friday as core business hours, 37.5 hours per week, with no on call requirements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Winifred Magambo-Gasana&lt;/p&gt;\n&lt;p&gt;Job title: Lead Nurse Vascular Access &amp; OPAT&lt;/p&gt;\n&lt;p&gt;Email address: w.magambo-gasana@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0207 7940400 Ext 22563 Bleep 4020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 6 Junior Sister / Charge Nurse - Vascular Access &amp; OPAT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251876", "validThrough": "2020-11-16T23:59:59+0000"}