{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24800", "minValue": "21267", "unitText": "YEAR", "value": "£21,267 - £24,800 p.a."}}, "datePosted": "2020-10-27T10:31:19+0000", "description": "&lt;p&gt;Dorset HealthCare is the first mental health trust providing community services in the South to be given an Outstanding rating by the Care Quality Commission (CQC) – and one of only a small handful nationally.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join our CAMHS services, our community services are rated Good and our inpatient unit is rated as Outstanding. We have been fast tracked by NHSE to deliver New Care Models providing a closer to home crisis home treatment service. We are also part of the national trailblazer to Deliver Mental Health Support Teams in schools across 3 pilot sites in Dorset. NHSE have commissioned Dorset Healthcare to build a new state of the art 8 bed PICU.&lt;/p&gt;\n&lt;p&gt;We currently provide the following CAMHS services across Dorset:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 Community teams&lt;/li&gt;\n&lt;li&gt;10 Bed adolescent inpatient unit&lt;/li&gt;\n&lt;li&gt;Dedicated CAMHS psychiatric liaison services within 3 acute hospitals -Out of Hours crisis service&lt;/li&gt;\n&lt;li&gt;Discovery college&lt;/li&gt;\n&lt;li&gt;Peer specialists working within our community and inpatient teams&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are also working closely with our local commissioners to develop new and innovative services including a CAMHS retreat to support the emotional health and wellbeing of young people across Dorset.&lt;/p&gt;\n&lt;p&gt;We are delighted for the first time to offer an exciting opportunity for a qualified and experienced Band 8b Lead Clinical Psychologist to join our outstanding CAMHS inpatient hospital. This post will help reshape services as this is a new exciting post for CAMHS inpatient.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and experienced Clinical Psychologist to join Pebble Lodge, who is flexible and willing to work collaboratively within the multi-disciplinary setting. &lt;br /&gt;&lt;br /&gt;Our aim is to provide outstanding care to young people within our inpatient hospital. You will work within the framework of Care Programme Approach offering psychological assessment to all young people, formulation , intervention and group work. You will be part of the senior leadership team, offering consultation and supervision to the MDT. Therefore excellent communication and team working skills are seen as essential.&lt;br /&gt;&lt;br /&gt;You will need to have a sound understanding of safeguarding practice and principles, a positive approach to multi agency working and the ability to work autonomously as well as part of a team.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff. Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Katie Butler Job title: Tier 4 Clinical Manager&lt;/p&gt;\n&lt;p&gt;Email address: katie.butler1@nhs.net Telephone number: 01202 584361&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;Rebecca Chambers, Ward Manager on 01202 545400 / Clare Young, Consultant Clinical Psychologist - Clinical Lead on 07342 067790.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth, Dorset", "postalCode": "BH4 8EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7168", "longitude": "-1.90326"}}, "title": "Lead CAMHS Inpatient Clinical Psychologist, Band 8b", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244010", "validThrough": "2020-11-10T23:59:59+0000"}