{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa (based on full time hours)"}}, "datePosted": "2020-10-29T15:00:30+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5 hours per week &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location: &lt;/strong&gt;April House, 9 Bath Road, Bitterne, Southampton SO19 5ES &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to recruit an enthusiastic and highly motivated Applied Psychologist or Accredited Psychological Therapist. This post would be suitable for a newly qualified Clinical Psychologist or an IAPT High Intensity therapist wishing to gain additional training in CBT for eating disorders. There is likely to be the opportunity to interview for a place on the newly commissioned IAPT-SMI training course delivered by UCL (one year CBT-ED top-up training).  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role also offers exciting opportunities for direct clinical work, service development and multi-disciplinary team working. You will provide evidence-based psychological interventions to people experiencing a wide range of eating disorders, many of whom present with comorbid mental health difficulties. The role will involve delivering individual and group interventions, as well as some joint work with our day service staff. You will also be involved in providing consultation, training and supervision to others within and outside of the team.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will join a supportive team of clinicians, committed to delivering high quality care and promoting recovery. You will receive regular supervision and will have the opportunity to join our reflective practice group. Within the service we offer a range of evidence-based interventions, including CBT-ED, DBT, SSCM, MANTRA and psychodynamic psychotherapy. We also work closely with families and carers and you will have the opportunity to be involved in taking this work forward. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service was rated ‘good’ across all domains in the last full CQC inspection (2014). Applicants should be qualified in a core profession, and/or hold accreditation with an appropriate psychotherapy organisation. Informal enquiries and visits are encouraged.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please contact Dr Hannah Turner, Consultant Lead Clinical Psychologist or Dr Gillian Adams, Principal Clinical Psychologist, on 023 8081 9000.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;Happy to Talk Flexible Working- &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO19 5ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9134", "longitude": "-1.35269"}}, "title": "Applied Psychologist / Eating Disorder Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248778", "validThrough": "2020-12-03T23:59:59+0000"}