{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 to £46,294 pa inc HCAS (Pro Rata)"}}, "datePosted": "2020-10-22T15:15:45+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Early Supported Discharge Team (ESD) for Stroke &lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Team Lead Speech and Language Therapist BAND 7 – Part time (26.25 hours per week)&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Permanent contract&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;BASED AT BOTH ASHFORD &amp; ST PETER’S HOSPITALS&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Would you like to work in a friendly multidisciplinary team providing home-based early rehabilitation and support to patients following stroke? Want to work flexibly to maintain a healthy work life balance? Keen to maintain or develop your FEES and Videofluoroscopy skills?&lt;/p&gt;\n&lt;p&gt;We are looking for a specialist Speech &amp; Language Therapist to join our senior leadership in Early Supported Discharge (ESD) for stroke. We are well established in NW and SW Surrey with two teams managed as one service. Our team is highly specialised and includes therapists, psychologists, nurses and rehab assistants working closely and flexibly across our sites to deliver high quality rehabilitation and support to a variety of patients immediately after discharge home and for the early weeks post-stroke. Weekend shifts are required on a rota basis, as part of our 7 day service provision.&lt;/p&gt;\n&lt;p&gt;Attendance at inpatient ward/board rounds will be encouraged. We aim to provide an in-reach presence within the HASU/ASU at St Peter’s Hospital, working with colleagues from the acute team to commence early assessments and aid transition from hospital to home. We also have good links with our other main referrers in the region (Royal Surrey and Frimley Park).&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, innovative and motivated Speech and Language Therapist who is interested in developing specialist skills in stroke, and will relish opportunities to contribute to, facilitate, design and lead local service development across the stroke pathway. The successful candidate will have proven experience working with adults who have communication and swallowing needs in a rehabilitation environment, and preferably have worked in community settings. Considerable amounts of driving are required and therefore a valid UK licence and access to a car is essential. The post holder will also be required to provide supervision to the B6 SLTs within the team.&lt;/p&gt;\n&lt;p&gt;ASPH offers excellent access to supervision and opportunities for continual professional development (including allocated CPD time). Staff are encouraged and supported to develop and share skills within a well-established Surrey-wide Adult Speech and Language Therapy Team network as well as the SLT teams at St Peter’s and Bradley Unit. There is access to the SLT-led videofluoroscopy service and a developing FEES service (Fibre-optic Endoscopic Evaluation of Swallow), and we envisage that the post holder will be involved in expanding this for patients across the pathway. There will be opportunities to develop competencies if required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in a variation on hours to the 0.7WTE advertised – please do discuss with us as we are willing to explore options.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact Anna Lavelle (Clinical Lead for ESD) on 01932 726870 / 01784 884913 / 07814 153494 or via email anna.lavelle@nhs.net, or Kathy Anderson (Therapy Manager for Stroke and Neuro Services) on 07971 180513 or via email katherine.anderson5@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Team Lead Speech &amp; Language Therapist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239083", "validThrough": "2020-11-13T23:59:59+0000"}