{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T13:46:25+0000", "description": "&lt;p&gt;Do you enjoy working in a busy environment where no two shifts are the same?&lt;/p&gt;\n&lt;p&gt;Would you like to work in a highly supportive team with excellent opportunities for development and progression?&lt;/p&gt;\n&lt;p&gt;Do you want to fully utilise and develop your clinical skills underpinned with funded Master’s Level Training in Minor Injury and Illness?&lt;/p&gt;\n&lt;p&gt;If so our Minor Injury Unit and the GP Out of Hours Service is the place for you!&lt;/p&gt;\n&lt;p&gt;The Out of Hours Service manages approximately 11, 000 patient contacts per month whilst our Minor Injury Units treat approximately 8000 patients across the Service per month, making a real difference, providing care closer to home and avoiding admission to hospital wherever possible and appropriate.&lt;/p&gt;\n&lt;p&gt;As an Urgent Care Emergency Practitioner you will be a Registered Nurse or Paramedic. You will need to have the desire to autonomously assess and treat patients within their own home, with telephone consultations and within the Urgent Care bases. You will have excellent clinical assessment and decision-making skills along with the ability to lead together with a passion to provide patient centered care. You will be working across a shift system which includes nights, weekends and bank holidays supporting patients when they are unable to access their own GP services.&lt;/p&gt;\n&lt;p&gt;You will be joining a multi-disciplinary team who pride themselves on their excellent team working and support of each other whilst treating a diverse range of conditions.&lt;/p&gt;\n&lt;p&gt;You will have excellent opportunities for learning and development with access to a wide range of courses to develop your clinical skills.&lt;/p&gt;\n&lt;p&gt;We are able to support you with the minor injuries and minor illness management courses with accredited courses through the University of West London.&lt;/p&gt;\n&lt;p&gt;This role will provide you with a challenging but rewarding opportunity to utilise your skills and to deliver excellent care to a wide group of patients. We are happy to consider full or part time hours, experience in Urgent Care or to support those who want to join us at this exciting time of service growth and development.&lt;/p&gt;\n&lt;p&gt;Shortlisting will be made against selection criteria of the person specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Karen Lopez&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address: karen.lopez@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07867142105&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Abingdon", "postalCode": "OX14 1AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6701", "longitude": "-1.3018"}}, "title": "Emergency Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256067", "validThrough": "2020-11-24T23:59:59+0000"}