{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33750", "minValue": "26000", "unitText": "YEAR", "value": "£26,000 to £33,750 per annum"}}, "datePosted": "2020-10-21T14:03:23+0100", "description": "&lt;p&gt;If you wish to discuss this vacancy informally, please feel free to contact the Radiology Manager, Shawn Anderson on 01926 562562. We are keen to recruit someone into our team who is flexible and so we can offer a range of different benefits and working arrangements that suit both the successful applicant and the business.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will predominantly work five days of eight hours each, with a 30 minute lunch break (one day will be slightly shorter).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Warwickshire Hospital is currently seeking to recruit a highly motivated, friendly and professional Radiographer to join the team in our busy department on a full-time, permanent basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have the ability to work within the team whilst also being able to use your own initiative and work independently during the day. The hours are predominantly between 8.30am and 6pm, five days a week, with on-call for general work and theatre as necessary on a rotational basis.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The day-to-day duties will involve operating our GE Optima CT scanner, working alongside other Radiographers, providing exceptional service to our patients and you will be able to perform both routine and complex CT examinations as well as carry out general X-ray work within the department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The department provides Radiography services to the hospital which has 42 in-patient beds, three operating theatres, a large out-patient department and we also provide services for GP’s and physiotherapists within the surrounding region. We are proud to have multi-disciplinary team which is committed to delivering high quality diagnostic imaging and high levels of patient care through a range of radiographic procedures. We have a team of responsive Radiographers in the department who are supported by a friendly team of Radiologists and an admin team.&lt;br /&gt;&lt;br /&gt;You should be able to demonstrate a proven clinical experience and have a high level of accuracy and attention to detail, good computer literacy with flexibility and adaptability to meet the changing needs of the business.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;DCR or BSc in Diagnostic Radiography, current HCPC registration and evidence of CPD. A post-graduate qualification in CT is desirable but post-graduate experience can be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key employee benefits can include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;A competitive salary, generous holiday and leave arrangements, flexible pension options, life assurance and healthcare schemes, health assessments (after a qualifying period), free membership of our fantastic Nuffield Health Fitness &amp; Wellbeing Centres, with heavily subsidised memberships for family, cycle to work scheme, childcare vouchers, the offer of additional hours, overtime, enhancements and on-call payments, continuing professional and career development, employee assistance programme for professional advice and counselling – legal, financial, etc. and employee discounts on a wide range of products and/or services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Nuffield Health Warwickshire Hospital has been rated as a ‘Good’ hospital by the CQC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £26,000 to £33,750 per annum (dependant on experience)&lt;br /&gt;Closing date - 18/11/2020&lt;br /&gt;Location - Warwickshire Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract type - Permanent&lt;br /&gt;Weekly hours - 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Nuffield Health is committed to equal opportunities in the recruitment, training, and development of our employees. We have a duty to apply to the Disclosure and Barring Service (DBS) for disclosure on successful candidates.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leamington Spa", "postalCode": "CV32 6RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.309", "longitude": "-1.54335"}}, "title": "General / CT Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236749", "validThrough": "2020-11-18T23:59:59+0000"}