{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37631", "minValue": "37631", "unitText": "YEAR", "value": "37631.08 + £1500 Welcome Bonus"}}, "datePosted": "2020-10-28T16:55:37+0000", "description": "&lt;p&gt;Woodland View is a 31 bedded rehabilitation and recovery service for adult males. We offer a positive environment to stabilise the symptoms of mental illness, and develop positive self-management and independent skills for a successful discharge into the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a dedicated Occupational Therapy service offering real working opportunities and pet therapy, amongst many other benefits within our monitored programme we offer a number of benefits on site including:-&lt;/p&gt;\n&lt;p&gt;Free parking&lt;/p&gt;\n&lt;p&gt;Free meals for all staff&lt;/p&gt;\n&lt;p&gt;Monthly staff appreciation events&lt;/p&gt;\n&lt;p&gt;CPD training and development for all staff&lt;/p&gt;\n&lt;p&gt;Access to Priory benefits including pension scheme amongst many other benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic Registered Mental Health Nurse who is committed to helping people become the best they can by achieving their goals?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you enjoy a challenge?  Are you inspired by progressive nursing practice?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently interviewing for a Charge Nurse&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be able to demonstrate the following attributes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sound clinical awareness and a drive to influence and implement positive and lasting change. &lt;/p&gt;\n&lt;p&gt;A desire to support and develop the Rehabilitation and Recovery pathway with vision and creativity.&lt;/p&gt;\n&lt;p&gt;The ability to inspire others and promote a spirit of cooperation in working towards shared goals.&lt;/p&gt;\n&lt;p&gt;A willingness to encourage and promote innovation and imaginative problem solving.&lt;/p&gt;\n&lt;p&gt;The ability to proactively contribute towards collaborative decision making.&lt;/p&gt;\n&lt;p&gt;A growth mindset that embraces change and seeks to empower others.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful they will need to&lt;/p&gt;\n&lt;p&gt;Work alongside the ward manager to ensure compliance with audit requirements and lead implementation of recommendations.&lt;/p&gt;\n&lt;p&gt;Ensure compliance with legislative and professional standards.&lt;/p&gt;\n&lt;p&gt;Act as clinical supervisor and ensures that all staff participate in clinical supervision.&lt;/p&gt;\n&lt;p&gt;Monitor, evaluate, and ensure effective use of resources within set budgets.&lt;/p&gt;\n&lt;p&gt;Operate effectively as a team member.&lt;/p&gt;\n&lt;p&gt;Promote effective decision making.&lt;/p&gt;\n&lt;p&gt;Act as mentor/preceptor and ensure the development of student nurses and other team members&lt;/p&gt;\n&lt;p&gt;Assess staff nurses within the competency development programme&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key Competencies&lt;/p&gt;\n&lt;p&gt;Evaluate situations through information obtained from patients, their families and other relevant sources; and also the patients strengths, disabilities, risks and vulnerabilities.&lt;/p&gt;\n&lt;p&gt;Work closely with the service user to explore all of the above issues in such a way that they can increase understanding, insight and motivation and view self-management of risk as an essential part of the recovery process.&lt;/p&gt;\n&lt;p&gt;Work collaboratively with the service user to identify early signs of deterioration in mental state and behaviour; plus any potential triggers factors which may lead to risk behaviours recurring.&lt;/p&gt;\n&lt;p&gt;Supporting service users to develop skills to self-manage their medication through graduated self-medication programmes.&lt;/p&gt;\n&lt;p&gt;Support users to engage/re-engage with family and friends&lt;/p&gt;\n&lt;p&gt;Identifying service needs and using high level communication, negotiation and liaison with other stakeholders, including senior managers, commissioners, primary care, general adult, forensic and substance use services, prisons and probation services and other independent providers as appropriate to develop flexible, integrated and comprehensive services&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Skills&lt;/p&gt;\n&lt;p&gt;A relevant nursing qualification and registration&lt;/p&gt;\n&lt;p&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights&lt;/p&gt;\n&lt;p&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;The drive to continually push your own personal learning and development&lt;/p&gt;\n&lt;p&gt;Be recovery focused.&lt;/p&gt;\n&lt;p&gt;Be conversant with CPA (Care Programme Approach).&lt;/p&gt;\n&lt;p&gt;Being able to effectively manage the ward resources of a shift/daily basis&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "COVENTRY", "postalCode": "CV7 7HZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4372", "longitude": "-1.61902"}}, "title": "CHARGE NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247435", "validThrough": "2020-12-15T23:59:59+0000"}