{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-10-29T10:31:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Occupational Therapist – Inpatient Rehabilitation Service &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent: Full time &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Band 6 looking for a new exciting opportunity? Or a Band 5 looking to progress in your career? We are seeking skilful, motivated and dynamic Occupational therapist with a passion to work with patients in the rehab setting.&lt;/p&gt;\n&lt;p&gt;The Inpatient rehabilitation service is a large multidisciplinary London based community team of Physiotherapists, Occupational Therapists, Nurses and Rehab Assistants. We offer physical hospital bed-based rehabilitation, supporting patients to recover and to discharge them at home. We work closely with the community Rehabilitation Services and acute partners to enable early facilitated discharges. As a Band 6 Occupational therapist within the team, you will manage your own caseload of Inpatient patients as well as support the other therapists in the team by providing training, supervision and joint sessions.&lt;/p&gt;\n&lt;p&gt;We can offer excellent carrier progression and work - life balance including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Protected CPD time with a diverse In Service Training Programme&lt;/li&gt;\n&lt;li&gt;Regular Supervision and Appraisal&lt;/li&gt;\n&lt;li&gt;Opportunity for Service Development and Audit&lt;/li&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;High cost area supplement of 15% of the basic salary (minimum of £3,483 to a max of £4,439)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Other benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary Sacrifice car scheme&lt;/li&gt;\n&lt;li&gt;Childcare support and vouchers&lt;/li&gt;\n&lt;li&gt;Close transport links into London&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in coming to work for NELFT we would welcome your application.&lt;/p&gt;\n&lt;p&gt;For further information please contact­­­­­­­­­­­­­­­­­­ Tammy Theron 0300 555 1201 ext 53494 Email :Tammy.Theron@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt;This post will be subject to 6 months probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff)&lt;/p&gt;\n&lt;p&gt;The main responsibilities of the post holder are:&lt;/p&gt;\n&lt;p&gt;1. To work flexibly and assist in effective and efficient delivery of the service.&lt;/p&gt;\n&lt;p&gt;2. To prioritise workload, delegate and to supervise more junior staff including support staff and students, to aid provision of high standards of patient care.&lt;/p&gt;\n&lt;p&gt;3. To assess the Occupational Therapy needs of a defined patient group and establish and evaluate appropriate treatment plans. This includes chronic, acute and palliative care within own competencies, recognising own limitations and seeking advice when necessary.&lt;/p&gt;\n&lt;p&gt;4. To monitor, evaluate and modify treatment for patients with multiple pathologies in order to measure progress and ensure effectiveness of treatment.&lt;/p&gt;\n&lt;p&gt;5. To select and apply Occupational Therapy assessments, addressing any skill deficits, enabling patients in the areas of productivity, self and leisure.&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of ££3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTammy TheronJob titleSenior Physiotherapist B7Email addresstammy.theron@nelft.nhs.ukTelephone number0300 555 1201 ext 53494&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Meadow Court, Goodmayes hospital, Ilford", "postalCode": "IG3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.578", "longitude": ".110514"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247900", "validThrough": "2020-11-12T23:59:59+0000"}