{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum plus enhancements"}}, "datePosted": "2020-11-02T12:45:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow in Emergency Medicine (Trust Grade Registrar) with Special Interest&lt;/strong&gt;. &lt;strong&gt;Starting Aug 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We all know that Emergency Medicine can be tough, we want to offer a job that invests time into developing you and your interests alongside our awesome speciality.&lt;/p&gt;\n&lt;p&gt;These brand new fellowships are a minimum 80% clinical time on our Middle Grade rota and 20% non-clinical time to undertake project work (Some of the fellowships may be allocated a greater amount of non-clinical time). They are ideal as a 12 month post for an OOPE (but please check you are eligible for time out of your programme). They are also open to those who want a longer term appointment as well.&lt;/p&gt;\n&lt;p&gt;We have a number of special interests on offer, including Education, Quality Improvement, Wellbeing, Frailty/ Geriatric Emergency Medicine, or I.T. If there is an interest that we haven’t mentioned please get in touch as we may be able to accommodate a bespoke position. We are also happy to discuss what each position might entail in advance of application via the details below.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be allocated a supervising FRCEM Consultant with a relevant special interest to support their project and will be encouraged to submit project work for presentation regionally/ nationally.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our department and our team…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Emergency Department was inspected in 2019 by the Care Quality Commission (CQC) and was rated as “&lt;strong&gt;GOOD”&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are a very organized and professional department seeing upwards of 115,000 patients per year, of which approximately 25% are children. The Consultant team is made up of 11 FRCEM qualified Consultants and we all have specialist interests including Geriatric Emergency Medicine, Pre-Hospital Emergency Medicine, Wilderness Medicine, Sports medicine, Acute medicine, Education, Emergency Ultrasound Practitioners, and Level 1 ultrasound trainers.&lt;/p&gt;\n&lt;p&gt;The Trust values and invests in the Emergency Department and Urgent Care. The Emergency Department Resuscitation Room has recently been refurbished and a new First Intervention Team Assessment Area built. We have also expanded our services by building a co-located Primary Care facility next to the Emergency Department, where our Primary Care team are based. Even more exciting is the bespoke, multi-million pound 60-bedded (Nye Bevan) Acute Assessment and Admissions Unit for Urgent Care that that has recently opened. This is a really exciting time to be joining us!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Living in Northampton…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Northampton is a rapidly growing County town. It has a fascinating blend of rich heritage, distinguished history and all the energy and vigour you would expect of one of the fastest growing, modern, commercial towns in the UK. The county is part of a designated government growth area, which will see significant development and consequent population growth over the next 25 years. The population of the town is predicted to increase by more than 50,000 people by 2021 so we will always be kept busy!&lt;/p&gt;\n&lt;p&gt;If you like sports, Northampton has successful Rugby Union and County Cricket Teams for you to go and watch, as well as a slightly less successful Football team. For theatre and film aficionados, considerable investment is being made into a new shopping park just outside of Northampton, housing the county’s only iMax cinema, and there is an “arts” cinema situated in the town centre, which is associated with the renowned Royal and Derngate Theatre.&lt;/p&gt;\n&lt;p&gt;If you have children, local schools are good and the hospital has crèche facilities.&lt;/p&gt;\n&lt;p&gt;There is also a gym and swimming pool on the hospital site.&lt;/p&gt;\n&lt;p&gt;If all that still isn’t enough for you, Northampton is an hour’s journey by train or road from London and our house prices are also considerably cheaper!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details, please contact Dr Sillett: ed.rota@ngh.nhs.uk 01604 545603&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The serious bit…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be notified if you have been shortlisted via the interview section on your NHS Jobs homepage. Do not forget to check your NHS Jobs account regularly for correspondence. &lt;br /&gt;&lt;br /&gt;Please note that we reserve the right to close vacancies prior to the advertised closing date when we are in receipt of sufficient applications&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJamie SillettJob titleConsultant in Emergency MedicineEmail addressjamie.sillett@ngh.nhs.ukTelephone number01604 545603Additional contact information&lt;/p&gt;\n&lt;p&gt;Please feel free to contact us to discuss your special interests in advance so we can try and tailor this position to your needs.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Emergency Medicine Senior Clinical Fellow with Special Interest", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252109", "validThrough": "2020-12-30T23:59:59+0000"}