{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-11T09:26:38+0100", "description": "&lt;p&gt;Do you want to work within rehabilitation services: joining our wide ranging rotation which includes both hospital and community services. The rotation encompasses our D2A hospital and community service, Rheumatology, Rehabilitation Medicine and Stroke Rehabilitation rotation based at the Haywood Hospital? The rotation also includes exciting new opportunities within Community Services including Homefirst and Domiciliary Occupational Therapy services. As part offurther developments there are opportunities ahead in joining up with other existing rotations across MPFT to offer more specialities.&lt;/p&gt;\n&lt;p&gt;Currently we provide multidisciplinary services to older adults (over 18) following a range of conditions across the different specialities following illness and other associated conditions; falls; stroke; brain injury and / or trauma. Our aim is to to maximise function, prevent deterioration and ensure both safe discharge and / or follow up in the community with short &amp; longer term rehabilitation programmes ensuring adaptation to life changes. Our Rheumatology and musculoskeletal outpatient services offer specialist expertise in management of rheumatology conditions; hand injury / trauma and long term conditions.&lt;/p&gt;\n&lt;p&gt;All post holders will rotate between posts with length of rotations dependent on joining date, service needs and individual personal development needs. Some services currently work over a 7 day week with community working requiring access to transport as essential.&lt;/p&gt;\n&lt;p&gt;In joining our teams you will be influential in supporting both inpatient and outpatient services and community based rehabilitation with a strong focus on rehabilitation, education and prevention, and self-management / lifestyle advice for long term conditions.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Occupational Therapists with:&lt;/p&gt;\n&lt;p&gt;Keen interest &amp; / or experience of working in rehabilitation services and can demonstrate a strong understanding and vision oftherapy, rehabilitationand service needs&lt;/p&gt;\n&lt;p&gt;Proactive in developing sound clinical skills in the assessment and management of patients in the rehabilitation and / or community environment&lt;/p&gt;\n&lt;p&gt;A strong commitment to developing self and supporting others&lt;/p&gt;\n&lt;p&gt;A strong commitment to working in and supporting a team&lt;/p&gt;\n&lt;p&gt;We can offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Friendly, supportive and well experienced clinical teams who are passionate about rehabilitation&lt;/li&gt;\n&lt;li&gt;Development of your clinical skills through supervision, training and networking opportunities across the Trust / local rehabilitation services including voluntary and statutory agencies&lt;/li&gt;\n&lt;li&gt;Clear working structure through regular supervision and appraisal with In-service training and peer supervision an essential component for continued professional development&lt;/li&gt;\n&lt;li&gt;A strong rehabilitation research culture within the Trust and local rehabilitation pathway&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you have a true passion for delivering positive outcomes in the field of rehabilitation? If you would like to work alongside dynamic multi-disciplinary teams we would love to hear from you. If you would like any further general information regarding the role please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stroke&lt;/strong&gt;: Laura.Baggaley@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;D2A &lt;/strong&gt;Alexandra.Davenport@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rheumatology&lt;/strong&gt;: Carol.Graham@mpft.nhs.uk / Nicky.Edwards@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rehabilitation Medicine&lt;/strong&gt;: David.Coxon@mpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Haywood Hospital", "postalCode": "ST6 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0571", "longitude": "-2.19003"}}, "title": "Band 5 Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221420", "validThrough": "2020-11-20T23:59:59+0000"}