{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 -  £44,503 per annum"}}, "datePosted": "2020-11-03T13:16:05+0000", "description": "&lt;p&gt;An Excellent opportunity has arisen for a confident, compassionate and clinically credible Specialist Practitioner to join our dedicated team of paediatric Macmillan Nurses at the Royal Manchester Children’s Hospital.&lt;/p&gt;\n&lt;p&gt;Depending on experience your starting salary will be at Band 6 or Band 7.&lt;/p&gt;\n&lt;p&gt;You will carry a caseload and be the designated key worker for children, young people and their families receiving treatment for a diagnosis of cancer providing specialist expertise, advice and support within the hospital and community setting. You will work closely within the senior and multidisciplinary team to deliver high standards of care and ensure effective communication with all professionals involved throughout the treatment pathway.&lt;/p&gt;\n&lt;p&gt;After completing training, the successful applicant will become part of the on-call rota where you will support the palliative and end of life care of patients and families through the provision of expert advice on symptom management, emotional and psychological care. This is a demanding fulfilling role requiring an individual who is committed to providing excellence in care.&lt;/p&gt;\n&lt;p&gt;You will have an RSCN/RN child with a post-registration qualification. Minimum 2 years’ experience in the speciality at band 6 and previous palliative care experience. You will be team-orientated but also able to work autonomously: you will have good time management skills and clinical expertise. Car driver is essential.&lt;/p&gt;\n&lt;p&gt;In return we will provide a comprehensive induction programme and training package. You will be appraised on a yearly basis with a view to developing knowledge and skills where appropriate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachael DaviesJob titleSpecialist PractitionerEmail addressRachael.Davies@mft.nhs.ukTelephone number0161-701-8428Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal chat please contact Rachael Davies Specialist Practitioner on 0161 701 8428, email Rachael.davies@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road Central, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Paediatric Macmillan Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254106", "validThrough": "2020-11-15T23:59:59+0000"}