{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-23T10:01:49+0100", "description": "&lt;p&gt;The Chief Nursing Officer (CNO) for England wishes to establish a Senior Clinical Fellowship programme, building on that of other fellowship schemes, offering a mechanism to bridge the existing gap between senior nurse leadership at an organisation level to senior leadership at a strategic national level. The nurse fellow programme would offer approx. 10 FTE nurses a unique secondment opportunity to spend 4 – 5 months outside of clinical practice, working alongside senior colleagues at NHS E&amp;I to develop their skills in leadership, management, strategy, project management and health policy.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Each Fellow will: &lt;br /&gt;• Be placed within the regional and national nursing teams to provide contemporary experience and dedicated focus on strategic projects and workstreams e.g. mental health, community nursing, development and leadership programmes, Black and Minority Ethnic (BME) nurse agenda. &lt;br /&gt;• Receive a development programme which will focus on leading for inclusion, system leadership, an understanding of policy and strategy formation, personal development and peer support. &lt;br /&gt;• Participate in and receive mentorship from senior colleagues within the CNO Directorate and Chief People Officer Lifelong Learning and Education Team. &lt;br /&gt;• Be closely involved with the healthcare leadership agenda.&lt;/p&gt;\n&lt;p&gt;Nurse Fellow Descriptors:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;1. Community Nursing &lt;br /&gt;This role provides an opportunity to shape and develop the co-production of the National Community Nursing Plan. The components of the National Community Nursing Plan will likely include broad themes of workforce, culture, safety, regulation, professional practice, research, leadership, digital, innovation, governance and education. We are seeking clinical nurse fellows who are community nursing leaders that hold a Community Specialist Practitioner Qualification, or similar, and are excited about the prospect of working with our regional and national nursing teams to build community nursing for the future.&lt;/p&gt;\n&lt;p&gt;2. Mental Health&lt;br /&gt;Specific projects under this area of work include the development of a mental health nursing handbook and the reduction of restrictive interventions particularly within non mental health settings. The mental health areas of work will require registration as a mental health Nurse and specific experience will be required across mental health settings in inpatient and community.&lt;/p&gt;\n&lt;p&gt;3. Development and Leadership Programmes &lt;br /&gt;The purpose of this role is to support the further development of CNO leadership programmes, this may include providing an evidence base to the work and dissemination via publication and presentations at conferences.&lt;/p&gt;\n&lt;p&gt;4. Race and Health Agenda&lt;br /&gt;As part of the CNO BME Action Plan a commitment has been made to rapid implementation of the Getting to Equity –Sponsorship Programme as it has been deemed to have the potential to increase the number of BME senior nurses across the country in an equitable, transparent and sustainable way. A project team is in formulation which requires dedicated expertise to lead the implementation of the project. We are seeking a senior nurse who possess cultural competences for equity and inclusion. With highly developed interpersonal skills the person needs to be able to engage across different contexts and have expertise in transforming towards equity and inclusion and delivering cultural intelligence programmes.&lt;/p&gt;\n&lt;p&gt;5. Organisational culture &lt;br /&gt;This work will require a scoping exercise to ensure that the CNO work programmes are aligned to the recommendations in the Courage of Compassion Report (West 2020). There is a need to identify key actions for focus, to enable front line nurses and midwives to speak up and be actively involved in patient safety, staff safety, and service innovation initiatives.&lt;/p&gt;\n&lt;p&gt;6. Regional Opportunities&lt;br /&gt;As an alternative, different areas of work can be defined by discussion and agreement between the regions and applicant. Reasonable flexibility will be offered for leadership projects subject to availability and depending on the interests and experience of the nurse fellow within the post allocated.&lt;/p&gt;\n&lt;p&gt;Applications are invited from individuals who are:&lt;/p&gt;\n&lt;p&gt;• Registered on the NMC. &lt;br /&gt;• Working in Health and Social Care in England. &lt;br /&gt;• Able to be released immediately from their current work to take up the position. Note - Please ensure that permission has been obtained for a quick release/secondment prior to applying and confirm this within the supporting information section of the application.&lt;/p&gt;\n&lt;p&gt;Please note the reason for these fixed term secondments is due to short term project funding.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela Knight JacksonJob titleHead of Nursing Development ProgrammesEmail addressAngela.Knightjackson1@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;To arrange an informal discussion please contact Patricia McKay patricia.mckay@nhs.net&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible, Leeds or London or other NHS England/NHS Improvement offices", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Nurse Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239939", "validThrough": "2020-11-08T23:59:59+0000"}