{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-27T14:46:49+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen to join the Paediatric Dietetics team at the highly recognised Oxford Children’s Hospital (John Radcliff Hospital). In partnership with the current post holder, to lead and further develop the ketogenic diet therapy service. Oxford Children’s hospital is a tertiary referral centre for neurology disorders, especially the treatment of epilepsy.&lt;/p&gt;\n&lt;p&gt;You will be working as an integral member of both the dietetic team and the multidisciplinary paediatric neurology team to provide a flexible, prioritised service based on clinical need.&lt;/p&gt;\n&lt;p&gt;You will be joining a friendly and energetic team of 12 paediatric dietitians who are a well thought of members of the children’s therapies team and continue to have close links with the adult dietetic department of 40 plus dietitians. The paediatric team work alongside well established paediatric specialist Multidisciplinary Teams contributing to the care of infants and children with varied clinical and complex conditions. These include metabolic disease, intensive care, gastroenterology, surgery, oncology, diabetes, cystic fibrosis, neonates and allergy in both inpatient and outpatient settings.&lt;/p&gt;\n&lt;p&gt;The right candidate will need to have good clinical paediatric experience. Knowledge in ketogenic diet therapy will be advantageous however full training will be provided to build on your current knowledge and skills. You should be able to demonstrate the ability to work within a changing environment, commitment to team working, have good communication skills and provide evidence of ongoing professional development relevant to this post. Regular supervision and support will be provided. You will also be expected to support students and junior members of the team with the guidance of the Team Lead.&lt;/p&gt;\n&lt;p&gt;Please phone to find out more about this exciting opportunity. (see contact details below).&lt;/p&gt;\n&lt;p&gt;For more information about this exciting opportunity, please contact Katheryn Hodgetts, Paediatric Team Lead (01865-231234) or Judy Wadsworth, Paediatric Ketogenic Dietitian (01865 234032)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE &lt;/strong&gt;Interviews planned for week commencing 16&lt;span&gt;th&lt;/span&gt; November 2020, due to social distancing these may initially be via Skype/Zoom. This may then lead to an additional face to face interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatheryn HodgettsJob titlePaediatric Team Lead DietitianEmail addresskatheryn.hodgetts@ouh.nhs.ukTelephone number01865231234Additional contact information&lt;/p&gt;\n&lt;p&gt;Judy Wadsworth, Paediatric Ketogenic Dietitian (01865 234032)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliff Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Paediatric Ketogenic Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245041", "validThrough": "2020-11-09T23:59:59+0000"}