{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 per annum, inc HCA"}}, "datePosted": "2020-10-26T08:16:53+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department of Community Special Care Dentistry welcomes applications from enthusiastic dental nurses who wish to join our team. The department is part of King’s College Hospital NHS Foundation Trust; The post holder would be based in Merton, Sutton and Croydon boroughs. Whilst the post is predominantly based in one clinic the post holder is required to travel between our sites so must have the ability to travel independently across all 19 community dental clinics in all 9 South London boroughs covered by our service as required. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a full time post. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our service provides highly specialised oral care for adult and paediatrics patients with varying medical conditions and disabilities, within the dental surgery, domiciliary setting, homes and schools.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A recognised dental nurse qualification and registration with the General Dental Council is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer excellent training opportunities and encourage our staff to be innovative and forward thinking, using their skills and knowledge to support and improve services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are hardworking, compassionate, empathetic and flexible and can work as part of a large team, then this is the role for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be contacted if you are shortlisted for an interview. Previous applicants need not apply.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola HumphriesJob titleDental Nurse ManagerEmail addressn.humphries@nhs.netTelephone number07890 251946&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Health Centres - Merton Sutton &amp; Croydon, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Community Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241707", "validThrough": "2020-11-09T23:59:59+0000"}