{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-28T09:15:48+0000", "description": "&lt;p&gt;Accredited Clinical Coder Band 5&lt;/p&gt;\n&lt;p&gt;The Clinical Coding team at Hinchingbrooke Hospital are looking for an ACC qualified clinical coder to join our friendly, award winning team. With a focus on quality of coding, the appointee will have the opportunity to expand their coding skills by coding over 15 specialties, receive regular coding reviews, build relationships with clinicians and help shape the team as we meet new challenges. Dependent on your experience, you may have the opportunity to mentor trainees and conduct your own coding reviews.&lt;/p&gt;\n&lt;p&gt;The successful candidate must hold the National Clinical Coding Qualification (NCCQ) and, if qualification was gained over three years ago, must have passed the National Clinical Coding Refresher Course within the last three years.&lt;/p&gt;\n&lt;p&gt;Working together as a team is essential in achieving our key performance targets. Along with attention to detail and a high degree of accuracy, you will also be able to work to tight coding deadlines whilst managing your own workload.&lt;/p&gt;\n&lt;p&gt;The Trust is working towards Electronic Document Management (EDM) during early 2021 for Hinchingbrooke Hospital which will bring the hospital in line with Peterborough City Hospital. It is hoped that once implementation is complete the Hinchingbrooke based coders can join with the Peterborough based coders in enjoying the option to work from home if desired, and subject to meeting certain criteria.&lt;/p&gt;\n&lt;p&gt;In the role of ACC qualified clinical coder you will interact with many different team members and employees within the hospital setting, and occasionally with the public, you will have excellent communication and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;The Trust also has a Coding Department at Peterborough City Hospital, and the successful applicant must be prepared to work cross-site if required.&lt;/p&gt;\n&lt;p&gt;Informal enquiries or visits are encouraged.&lt;/p&gt;\n&lt;p&gt;Working Pattern; 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Salary £24,907 - £30,615 dependent on years of experience post NCCQ&lt;/p&gt;\n&lt;p&gt;Closing date for applications Sunday 15th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnne StarrJob titleClinical Coding Team ManagerEmail addressAnne.Starr@nhs.netTelephone number01480 547548Additional contact informationKetan Patel&lt;/p&gt;\n&lt;p&gt;Coding Data Quality Lead&lt;/p&gt;\n&lt;p&gt;Ketan.patel7@nhs.net&lt;/p&gt;\n&lt;p&gt;01733 673443&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hinchingbrooke Hospital, Huntingdon", "postalCode": "PE29 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3334", "longitude": "-.202658"}}, "title": "Accredited Clinical Coder - Huntingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245797", "validThrough": "2020-11-15T23:59:59+0000"}