{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23567", "minValue": "23567", "unitText": "YEAR", "value": "£14.02 per hour plus HCA"}}, "datePosted": "2020-10-29T11:17:49+0000", "description": "&lt;p&gt;We operate a temporary staffing service and can offer competitive hourly rates, flexibility of shifts and hours, access to the NHS pension scheme, variety of work and access to training opportunities.&lt;br /&gt;&lt;br /&gt;We are looking to recruit Band 5, registered nurses to join our expanding temporary staff bank service to support our Inpatient teams in the following areas:&lt;br /&gt;&lt;br /&gt;Alistair Farquharson Centre, Thurrock Hospital&lt;br /&gt;Brentwood Community Hospital&lt;br /&gt;Mayflower Community Hospital, Billericay&lt;br /&gt;Foxglove Ward, King Georges Hospital&lt;br /&gt;Grays Court Ward 1&amp;3, Dagenham Hospital&lt;br /&gt;Heronwood and Galleon, Wanstead Hospital&lt;br /&gt;Ainslie rehabilitation unit, Chingford&lt;br /&gt;You will be involved in assessing, planning, implementing and evaluating patient care and must have recent clinical experience, ideally in a community or community hospital setting. You will need to be a reliable, enthusiastic and self-motivated individual, with excellent verbal and written communication skills.&lt;br /&gt;&lt;br /&gt;Please ensure you meet the person specifications and have the relevant qualifications required for the role, please note if your application is shortlisted you will be invited to our assessment day , date to be confirmed.&lt;br /&gt;&lt;br /&gt;For more information about working on the Temporary Staffing Bank please contact the Temporary Staffing Team on 0300 300 1530&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, London and Essex", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Bank General Inpatient Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248084", "validThrough": "2020-11-22T23:59:59+0000"}