{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:46:20+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for the recruitment of both Registered general nurses and Registered Mental Health Nurses to come and join our team on ward 6A. We are looking for motivated, enthusiastic and caring individuals with an avid interest in the development and provision in the care of the older person.&lt;/p&gt;\n&lt;p&gt;6A is a mixed sexed elderly care ward with 28 beds. 6A specializes in the care of those elderly patients that have complex care needs and those that have also been diagnosed with a cognitive impairment such as Dementia or Alzheimer’s. We also have a special interest in those patients that have been diagnosed with Parkinson’s Disease.&lt;/p&gt;\n&lt;p&gt;6A prides itself in taking a holistic approach to each individual patient and their care needs. This is from both a medical and psychological perspective. With having our Occupational and Physiotherapists on the ward means that we are able to work very closely with them to ensure that the patients are referred and assessed in a timely manner ensuring the patients stay in hospital is kept to a minimum. As well as a patient handover each morning we also have a MDT board round where each patient’s medical and discharge plans are discussed.&lt;/p&gt;\n&lt;p&gt;We have a Dementia Practitioner who supports the patients and their carers providing necessary information on services that can be accessed in the community. The practitioner will also liaise with family to ensure we know as much about the patient as possible, their likes and dislikes. This is a relatively new position that will provide a service for the ward. The practitioner is able to offer a range of distraction therapies or to just simply spend some valuable time with the patient at the bed side.&lt;/p&gt;\n&lt;p&gt;As an experienced RGN/MHN your knowledge and skills will be utilized to ensure that the patients on the ward receive a high standard of care ensuring that all of their care needs are met. Sharing your knowledge and skills within the team to ensure continuity in the patient experience.&lt;/p&gt;\n&lt;p&gt;Due to the vulnerable nature of our client group we work closely with the Trust and Local Authority Safeguarding Departments and deal regularly with issues relating to Mental Capacity, Best Interest and DOLS. As well as having knowledge of relevant legislation you will also be responsible for assessing, planning, delivering and evaluating nursing care, utilizing flexible and innovative research based practice to improve the patients experience. This will also involve acting as the advocate for patients and carers to ensure that their individual care needs are met.&lt;/p&gt;\n&lt;p&gt;As a Registrant with the NMC, you will have previous experience within healthcare. You will also have excellent written and oral communication skills, IT skills, and demonstrate the ability to implement Trust Policies and Procedures in Practice, understanding the rationale.&lt;/p&gt;\n&lt;p&gt;You must possess the ability to prioritise and organise your workload and champion best practice with infection control, dignity in care and safeguarding practices.&lt;/p&gt;\n&lt;p&gt;The 6th floor is proud to be able to offer both our own staff and our students access to the 6th floor (Supernumerary) Clinical Educator. Our CE is on hand to induct our new starters as well as supporting our Lincoln University student nurses when on placement. The CE will support those staff with their extended roles, facilitate training sessions and ensure that each member of staff is competent and proficient within their roles. The CE will be on hand to support you with your induction on the ward and to ensure that you have a development plan to work towards.&lt;/p&gt;\n&lt;p&gt;So why not give us a ring and set a date for an insight visit, come along and meet the team. You never know you might even bump into the PAT dog, Dougal that visits the patients on a regular basis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachelle CryanJob titleWard SisterEmail addressrachelle.cryan@ulh.nhs.ukTelephone number01205 445661 0r 01205 445024Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma.Perry@ULH.nhs.uk 01205 445661&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Staff Nurse - Ward 6A - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251891", "validThrough": "2020-11-23T23:59:59+0000"}