{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "In line with secondees&#39; existing arrangements"}}, "datePosted": "2020-11-03T11:16:28+0000", "description": "&lt;p&gt;The role of Head of School is to work with and support the Health Education England Postgraduate Dean in leading the delivery of a wide range of functions, aligned to the Health Education England mandate.&lt;/p&gt;\n&lt;p&gt;The Head of School is professionally and managerially accountable to the Postgraduate Dean. The Head of School will focus upon improvement of learner supervision, assessment and experience, engagement of faculty and ensuring effective educational outcomes, both now and in the future. The role is evolving and will also focus on whole workforce transformation and developing multi-professional links mas well as innovative ways of curriculum delivery and workforce well-being strategies.&lt;/p&gt;\n&lt;p&gt;To support the Postgraduate Dean, Heads of Schools work across the spectrum of health and where relevant, social care, within the context of a team, so that the provision of education reflects changing service models. This will deliver an integrated workforce comprising individuals from a spectrum of professional and other backgrounds.&lt;/p&gt;\n&lt;p&gt;The Head of School will be expected to meet the challenges of leading the School and Education Providers to deliver the changing curricular in an evolving service landscape.&lt;/p&gt;\n&lt;p&gt;Although the main role is to lead and develop the Postgraduate School of Psychiatry all senior clinicians within HEE may have wider roles and projects as agreed with the Postgraduate Dean.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Margaret Campbell&lt;/p&gt;\n&lt;p&gt;Job title: Head of School for Psychiatry&lt;/p&gt;\n&lt;p&gt;Email address: margaret.campbell@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Clare Inkster&lt;/p&gt;\n&lt;p&gt;Associate Dean&lt;/p&gt;\n&lt;p&gt;clare.inkster@hee.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regatta Place/Piccadilly Place, Liverpool / Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Head of School for Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253676", "validThrough": "2020-11-17T23:59:59+0000"}