{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-06T15:46:51+0000", "description": "&lt;p&gt;&lt;strong&gt;4wte Band 6 Trainee Cognitive Behavioural Therapist (CYP IAPT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 post available for Dudley&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 post available for Walsall&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 post available for Sandwell&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 post available for Wolverhampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term posts for 1 year – commencing January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a training role within the Child and Young Person’s Improving Access to Psychological Therapies Programme (CYP-IAPT). The role is to work within the CAMHS service providing interventions whilst undertaking a programme of training. This is an intensive training post which will equip the postholder to provide interventions based on CYP-IAPT core principles and also an evidence based intervention consistent with their training course. The post is to work in the service for three days per week using the newly developed skills whilst attending the training programme at Derby University for the other two days. Clinical supervision will be a mandated element of this post.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and committed individuals to join our team. We are an energetic and hardworking team working with children and young people across the localities. CAMHS is a fully integrated multi-disciplinary team comprising Clinical Psychologists, Psychotherapists, Family Therapists, Nurses, Occupational Therapists, Social Worker, Psychiatrists and Youth Offending Team. The team also takes a range of students on practice placements.&lt;/p&gt;\n&lt;p&gt;CAMHS professionals deal with a wide range of mental health problems. Many children and young people are troubled by emotional, behavioural and psychiatric problems. These can cause worry and distress both to themselves and to those who care for them. A large part of the CAMHS professionals’ work is to identify the problem, understand the causes and advise about what may help.&lt;/p&gt;\n&lt;p&gt;Our team has recently achieved Outstanding in the Caring domain from CQC, as a team we are very proud of this. We are seeking an individual who shares this commitment to caring.&lt;/p&gt;\n&lt;p&gt;Only applicants with a core professional qualification registered with either NMC, BPS or HCPC are encouraged to apply for these posts.&lt;/p&gt;\n&lt;p&gt;For more information and a confidential discussion relating to the locality of preference please email:&lt;/p&gt;\n&lt;p&gt;Pooja Behl, Positive Steps Lead for Walsall – pooja.behl@nhs.net&lt;/p&gt;\n&lt;p&gt;Rachel Garfield, Positive Steps Lead for Dudley – rachel.garfield@nhs.net&lt;/p&gt;\n&lt;p&gt;Nicky Mountford, CAMHS Service Lead for Sandwell – nicky.mountford@nhs.net&lt;/p&gt;\n&lt;p&gt;James Reeley – CAMHS Service Lead for Wolverhampton – jamesreeley@nhs.net&lt;/p&gt;\n&lt;p&gt;Any question regarding application please contact our recruitment team on 01384 325028.&lt;/p&gt;\n&lt;p&gt;Please note: The CBT trainee posts are training positions subject to 1 year fixed term contracts, successful candidates will be expected to travel to Derby University to complete their however we are fully expectant for much of the course to be delivered via online platforms throughout 2021.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date&lt;/strong&gt; – 13th November however may close earlier due to anticipated demand&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date – &lt;/strong&gt;24th November&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note the successful candidates must be available to commence their post on January 25th 2021 in readiness to start university on February 9th 2021.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePooja Behl / Rachel Garfield / Nicky Mountford / James Reeley&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canalside / Cross Street / Lodge Road / Gem Centre, Walsall / Dudley / Sandwell / Wolverhampton", "postalCode": "B70 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5193", "longitude": "-2.0188"}}, "title": "CYP IAPT CBT Trainee Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260458", "validThrough": "2020-11-13T23:59:59+0000"}