{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-03T09:55:38+0000", "description": "&lt;p&gt;Thorney &amp; Eye Surgery are recruiting for either an Advanced Nurse Practitioner for 36 hours per week across Monday - Friday.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a caring, compassionate, committed and experienced nurse who, acting within their professional boundaries, will provide care for the presenting patient from initial history taking, clinical assessment, diagnosis, treatment and evaluation of care. They should be able to work autonomously and as part of a dynamic multidisciplinary team, demonstrating a high level of professionalism and motivation. They will demonstrate safe, competent clinical decision-making and expert care, including assessment and diagnostic skills, for patients in their care. The post holder will commit to demonstrating critical thinking within a safe clinical decision-making process. They will communicate and work collaboratively with the general practice team to meet the needs of patients, supporting the delivery of policy and procedures, and providing nurse leadership as required&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge and the opportunity to make a difference, we would love to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Octagon Medical Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE6"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6556", "longitude": "-.196164"}}, "title": "Advanced Nurse Practitioner  - Thorney &amp; Eye Surgery - Octagon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253338", "validThrough": "2020-11-24T23:59:59+0000"}