{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "1000", "minValue": "1000", "unitText": "YEAR", "value": "Bursary of up to £1,000"}}, "datePosted": "2020-10-22T16:15:34+0100", "description": "&lt;h1&gt;Return to Practice Student&lt;/h1&gt;\n&lt;p&gt;Are you a nurse who’s NMC Registration has lapsed? Do you miss the challenges and rewards of clinical practice? Do you want to return to practice and re-join the NMC professional register? Do you want to join a trust recognised for its success supporting the Return to Practice Nursing Programme?&lt;/p&gt;\n&lt;p&gt;If the answer is YES, then the Return to Practice Programme at the Royal United Hospital Bath NHS Foundation Trust Bath is just what you’ve been looking for!&lt;/p&gt;\n&lt;p&gt;The Return to Practice programme is funded by Health Education England in partnership with the University of the West of England, Bristol. The programme includes an academic and practice components.&lt;/p&gt;\n&lt;p&gt;The academic component runs over 6 consecutive weeks with live online lesions Monday’s and Fridays between 09:00 and 12:30 hosted by the University of West of England. and the submission of an academic assignment&lt;/p&gt;\n&lt;p&gt;The practical part includes working and learning in clinical practice areas to support your learning and achieve the required clinical competencies. The amount of time in practice will vary depending on how long you have been out of practice and whether you choose to work the practice hours part or full time.&lt;/p&gt;\n&lt;p&gt;To help you, you will receive Bursary of up to £1,000This can be used for childcare, travel, books etc.&lt;/p&gt;\n&lt;p&gt;On successful completion of the programme you will be offered a permanent position within our friendly Trust as a Band 5 Registered Nurse. These maybe full or part time hours in one of the wards or specialist areas, such as Theatres and Critical Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;We are recruiting now a January 2021 cohort&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews are planned to take place at the Royal United Hospital Bath NHS Foundation Trust Bath. Interviews will include a Math’s test. &lt;/p&gt;\n&lt;p&gt;More information &lt;strong&gt;in the first instance &lt;/strong&gt;can be found in this additional document with this advert. For further questions please Contact Linda Chapman Education: L.chapman1@nhs.net&lt;/p&gt;\n&lt;p&gt;Interviews will be held on &lt;strong&gt;Interviews will be held on November 20th 2020 in the Education Centre, RUH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;At the interview there will be a 1 hour Math’s exam where by no rulers or calculators are permitted. Please note- attached is only a practice Maths paper, this will not be marked or form any part of your assessment or interview, it is for your reference only.&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Return to Practice Student", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239293", "validThrough": "2020-11-06T23:59:59+0000"}