{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum plus HCA where applica"}}, "datePosted": "2020-10-26T13:46:58+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that NEL staff At-Risk candidates will be given priority***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting and unique opportunity has arisen for a highly motivated, GPhC registered pharmacist to work within the Clinical Services team of NEL&lt;/p&gt;\n&lt;p&gt;As a key member of the Medicines Management and Optimisation Team, the post-holder will support the provision of pharmaceutical advice to commissioner and provider organisations in the delivery of local and regional services, alongside internal NEL teams.&lt;/p&gt;\n&lt;p&gt;The role focuses primarily on supporting the management of commissioning and contracting issues for National Tariff excluded drugs and devices, working closely with commissioners, primary, secondary, and tertiary care colleagues to ensure cost-effective, high quality clinical services for patients and our partners.&lt;/p&gt;\n&lt;p&gt;The role will also involve providing clinical support to the Individual Funding Request team within NEL.&lt;/p&gt;\n&lt;p&gt;This role will require the post-holder to form and nurture collaborative working-relationships with individuals and networks from a range of commissioner and provider organisations along with NEL partners to meet local and national agendas for the benefit of the patient and healthcare economy.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to gain multifaceted exposure to healthcare services across London and the South East, which will provide insight to the strategic challenges facing the NHS as it adapts to deliver the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;Excellent clinical competence, communication and interpersonal skills are vital for the multidisciplinary and cross-organisational matrix working required for this role. We are looking for an individual with a good understanding of the current healthcare landscape who thrives on a broad range of tasks and challenges in order to support the NEL vision of delivering a high-quality and innovative service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFarhan IsmailJob titleContracting and Commissioning PharmacistEmail addressfarhan.ismail@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Commissioning and Contracting Support Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242752", "validThrough": "2020-11-09T23:59:59+0000"}