{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32145", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,145 per annum incl. HCAS"}}, "datePosted": "2020-11-06T10:51:37+0000", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Occupational Therapist&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Band 5 - Permanent - Full Time (37.5 hours per week)&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;*Previous Applicants not need to apply*&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Surrey NHS Foundation Trust is looking for a Band 5 Occupational Therapist to join our expanding rotation. We have fantastic opportunities for staff who starting out in their career, or wish to take it in a new direction. We welcome applications for students due to graduate this year and are keen to put their new found skills into practice from June/July 2020.&lt;/p&gt;\n&lt;p&gt;Our rotations include:-&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Orthopaedics&lt;/strong&gt; – working across trauma and elective wards, you will have the opportunity to learn about different types of trauma as well as being part of the ground-breaking Fast Track hip/knee replacement pathway which aims to get patients back home the same day as their operation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A&amp;E, EAU and SAU&lt;/strong&gt; – based at the ‘front door’ you will work closely with specialist nurses and consultants to prevent admission. You will begin to develop skills in rapid assessment and discharge planning.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Older Persons Unit&lt;/strong&gt; – this rotation will develop your complex discharge skills and allow you to learn about large equipment provision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Short Stay Frailty&lt;/strong&gt; – within Care of the elderly is our short stay frailty unit where patients aim to be turned around within 72 hours. This rotation brings together the skills of rapid assessment and complex discharges for older people.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stroke/Neurology&lt;/strong&gt; – you will develop specialist Stroke and Neurology knowledge and skills including standardised and non-standardised assessments, formulating rehab programmes and upper limb management&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Medicine/Surgery&lt;/strong&gt; – covering respiratory, cardiology, oral &amp; maxillofacial surgery, ENT, colorectal, urology, gastro-intestinal, gastroenterology and diabetes, the medical/surgical team offers a smorgasbord of conditions for you to get your teeth into&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Milford Community Hospital&lt;/strong&gt; – having recently integrated with our local community services, for the first time we are including our rehab hospital in our rotations. Here you will learn about planning and implementing rehab programmes for those who have moved across from the Royal Surrey Hospital in order to prepare them for returning home&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rapid Response&lt;/strong&gt; – another new rotation: based in the grounds of Milford Hospital, the Rapid Response team treat patients who have been discharged from hospital and require further input at home to keep them safe and progress, as well as responding to referrals from other sources such as GPs in order to avoid admission. This is the emergency service of the OT world!&lt;/p&gt;\n&lt;p&gt;You may already have started your career and are looking for a new challenge or coming to the end of your training and looking to get a job lined up ready for the summer. As a Band 5 you will be supported to make the transition from student to autonomous practitioner with guidance from senior staff. In all fields of practice you will be supported by an experienced team lead. For newly qualified staff, you will work your way through our Preceptorship programme over the first year of employment which will help you make this transition and consolidate all the skills and knowledge gained throughout your training.&lt;/p&gt;\n&lt;p&gt;Our services cover 7 days per week and the post holder will be expected to work regular weekends and bank holidays. Use of own car for business use is essential.&lt;/p&gt;\n&lt;p&gt;As a department we are a friendly bunch of therapists who all work together to provide a dynamic and pro-active service to our patients. We have a range of experience and specialisms ranging from Assistants to Advanced Clinical Specialists providing clinical support, and formal and informal training, and the department benefits from being managed by an Occupational Therapist who provides a strong professional lead. We have a strong commitment to clinical supervision and Continuing Professional Development; you will be regularly supervised by a senior therapist and attend the band 5 Occupational Therapy support groups. We have a well-structured In-Service Training Programme which the successful applicant will be able to learn from as well as the opportunity to lead sessions alongside from your team. We benefit from a well-stocked Gym which can be used by staff either before or after working times. Accommodation is available at the Royal Surrey NHS Foundation Trust site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunities for professional &amp; personal development&lt;/li&gt;\n&lt;li&gt;In-service training &amp; post graduate education&lt;/li&gt;\n&lt;li&gt;Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;li&gt;Multidisciplinary working&lt;/li&gt;\n&lt;li&gt;Welcoming department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Essential requirements&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current HCPC registration&lt;/li&gt;\n&lt;li&gt;Own car for business use&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Royal Surrey Foundation Trust is a DistrictGeneralHospital and regional cancer centre with links to a range of related services providing excellent opportunities for multidisciplinary working.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For further information, an informal visit/chat please contact Suzanne Ward Head Occupational Therapist or Isla Pavey, Deputy Head Occupational Therapist on 01483 571122 ext 4766 or 4679. Email suzanneward@nhs.net or isla.pavey@nhs.net or Nicola Weber-Hall, Service manager Community Therapies on 01483 782663.Email n.weber-hall@nhs.net&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date of Interview: TBA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259309", "validThrough": "2020-11-22T23:59:59+0000"}