{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-22T10:11:54+0100", "description": "&lt;h1&gt;&lt;span&gt;&lt;span&gt;Senior Resilience and Emotional Health Practitioner (Single Point of Access)&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In the Norfolk Healthy Child Programme we are looking to develop and enhance our Emotional Health Team with the exciting opportunity for a Senior Resilience and Emotional Health Practitioner (SREHP) based within our single point of access, ‘Just one Number’ in Cringleford, Norwich. Our team focuses on supporting children, young people and their families where there are emerging emotional health concerns by offering direct evidence-based interventions as well as providing emotional health promotion activities for parents and young people at school or from resources available on our website. (Link to our website can be found on the job description)&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This newly established senior role will be a key link between our established team of Resilience Emotional Health Practitioners (REHP) and the single point of access. As an experienced clinician you will have the opportunity to work directly with referrers, parents and young people via telephone and attend anywhere calls. You will be able to gather information from the important people in the child/young person’s life, and then bring together the salient points into a clear analysis which leads to a clear plan to access timely support for that child or young person. There will at times be opportunities to work face to face with children, young people and their families, although the majority of the role will be within Just One Number. You will also work in close collaboration with and support the Resilience and Emotional Health Practitioners within the Emotional Health Pathway. The role will involve offering case management support, consultation and training within the team and to practitioners within the wider 0-19 service. You will also have the opportunity to support in the content and development of our Just One Norfolk website.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for people with a passion for the ‘Think Family’ approach, who are enthusiastic and energized by working for the best achievable outcomes for the child or young person and their family. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you can see yourself in this innovative and exciting new role, we would welcome informal enquiries/visits so you can find out more about this opportunity. Please contact us on the below details&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sara Scott - 07881326895 Sara.scott14@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bryony Wallis - 07825 934441 bryony.wallis@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kevin Brett - 07816172024 kevin.brett2@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews will be held on 3rd &amp; 4th December 2020&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk", "postalCode": "NR4 6AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6048", "longitude": "1.24519"}}, "title": "Senior Resilience and Emotional Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237831", "validThrough": "2020-11-12T23:59:59+0000"}