{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "35000", "unitText": "YEAR", "value": "35,000"}}, "datePosted": "2020-10-29T15:01:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title:&lt;/strong&gt; Practice Manager&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; Circa 35k&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;Full Time&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;The Lister Practice, Peckham&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About AT Medics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AT Medics is London’s largest and fastest growing primary care provider with a 15-year track record of Primary Care transformation. The organisation has a vision of ‘Improving Healthcare, Improving Lives’. Services are characterised by high quality access, nationally recognised innovation and a real understanding of individual patient need, collectively, serving over 390,000 patients across 48 practices in 18 London CCGs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our well-established practices have excellent performance against local and National requirements, and a committed multi-professional team. We take great pride on the efficiencies we have created in General Practice through our in- house bespoke tools- freeing up senior clinicians to attend to the highest quality of patient care and access.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The practice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Lister Practice has11,000 registered patients in central Peckham, Southwark. The CQC rated the Practice as ‘Good’ in 2019 following and in 2020 the practice was approved by the London Deanery as a training practice.&lt;/p&gt;\n&lt;p&gt;The practice has a fully staffed strong clinical team consisting of GPs, Nurses and Allied Health Professionals. Including the admin team there are 20 staff members in total.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We took over the practice in 2018 and have improved patient care immensely in the last 2 years. We are now looking for a Practice Manager to take things to the next level to ensure we provide the best possible service for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience in people management; it is more desirable if this experience in Healthcare however this is not essential. &lt;strong&gt;We will consider candidates from other sectors with a strong history of people management.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Some of the post holder duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Management of services required to meet contractual, quality and safety expectations&lt;/li&gt;\n&lt;li&gt;People/Staff management and day to day operational management&lt;/li&gt;\n&lt;li&gt;Quality Assurance and CQC Compliance&lt;/li&gt;\n&lt;li&gt;Patient Services; high level of customer service and representing the practice at external meetings&lt;/li&gt;\n&lt;li&gt;Complaints handling&lt;/li&gt;\n&lt;li&gt;With the corporate HR and Finance teams&lt;/li&gt;\n&lt;li&gt;Practice development and improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Knowledge and experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Primary Care experience is desirable but non-essential&lt;/li&gt;\n&lt;li&gt;You must have a good understanding of people management, together with a passion for improving healthcare and improving lives&lt;/li&gt;\n&lt;li&gt;Whilst you will bring your experience to the role, you will also receive significant support from the Senior Manager and Regional GP Director as part of your development.&lt;/li&gt;\n&lt;li&gt;Understand how to working to defined KPIs&lt;/li&gt;\n&lt;li&gt;Ambitious to succeed and drive positive change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AT Medics staff enjoy a range of benefits, including access to the NHS Discounts and other benefits of joining us include:&lt;/p&gt;\n&lt;p&gt;A comprehensive induction programme&lt;/p&gt;\n&lt;p&gt;5 weeks annual leave (pro rata)&lt;/p&gt;\n&lt;p&gt;Continuous training&lt;/p&gt;\n&lt;p&gt;Ongoing support from the Senior Manager and Regional GP Director&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "AT Medics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peckham", "postalCode": "SE15 5LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4745", "longitude": "-.075548"}}, "title": "Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248796", "validThrough": "2020-11-12T23:59:59+0000"}