{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 per annum, including London Wei"}}, "datePosted": "2020-11-02T17:00:59+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a full time, 1 year fixed term Ophthalmology high volume cataract theatre list back fill post for King’s College Hospital NHS Foundation Trust based at Queen Mary’s Hospital and the Princess Royal University Hospital. This is an excellent opportunity for a suitably trained individual to vastly expand their theatre experience by undertaking a theatre bias job plan focused on high volume cataract lists. Applicants must have recognised higher training and expertise in cataract surgery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s ophthalmology services are centred at King’s College Hospital, Denmark Hill, Queen Mary’s Hospital, Sidcup and Orpington Hospital, Orpington. Services are also provided at University Hospital of Lewisham and Queen Elizabeth Hospital Woolwich. The ophthalmology services are staffed by 29 Consultant Ophthalmologists (13 based at King’s, 10 at Queen Mary’s and 6 at Orpington) covering all subspecialty interests. There is support from a range of non-Consultant medical staff and a full complement of orthoptists, optometrists, ophthalmic photographers, technicians, specialist nurses and administrative staff. The outpatient departments are very well equipped and there are dedicated eye theatres at the 2 main sites, Queen Marys Hospital and Denmark with a third at Princess Royal University Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Queen Marys is situated on the edge of the green belt with easy access to central London, the Kent countryside and the Chanel ports. There is a good selection of housing in rural and suburban locations and an excellent choice of state and private schools. Applicants should be on the General Medical Council’s Specialist Register or have the appropriate CCT. Candidates can also apply if they are within six months of their CCT at the date of the interview but are required to have sat and passed their exit exam or equivalent. Applications from those unable to work full time will also be considered.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Alex Chipperfield&lt;/p&gt;\n&lt;p&gt;Job title Service Manager&lt;/p&gt;\n&lt;p&gt;Email address a.chipperfield@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07947100827&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For informal discussion about the post please contact MR Eoin O’Sullivan, Clinical Director for Ophthalmology on 02039613434, and Mr Alex Chipperfield, Service Manager at Queen Marys and King&#39;s College Hospitals on 07947100827.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Mary Hospital, Sidcup", "postalCode": "DA8 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4706", "longitude": ".187066"}}, "title": "Locum Consultant Ophthalmologist - Cataract Theatre Back Fill", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252962", "validThrough": "2020-11-23T23:59:59+0000"}