{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-11-02T12:46:03+0000", "description": "&lt;p&gt;With a reputation for excellence, our accredited service provides a stepped model of care tailored to the individual’s needs for stabilisation and recovery. We offer a range of programmes and evidence-based treatments to assist a patient’s return to independent living. Our aim is to provide the highest standard of care in a safe, caring and excellent way, ensuring that care provision is collaborative, holistic and individualised.&lt;/p&gt;\n&lt;p&gt;You may be an experienced or newly qualified nurse who would relish the opportunity to be part of a specialist service where you will be supported to develop your knowledge and skills in the field of eating disorders. You will have a good knowledge base, excellent communication skills and a flexible and positive attitude. You should have a caring, non-judgmental and inclusive attitude and be committed to the delivery of safe, high quality care&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to undertake training in Cognitive Behavioural Therapy for Eating Disorders (CBT-ED) as well as co-facilitating groups that you have an interest in, such as DBY or creative art. There will be regular support groups and teaching sessions on a wide range of topics to enhance your knowledge and experience.&lt;/p&gt;\n&lt;p&gt;We understand how important work life balance is and the difference that being part of an organisation that supports this makes to our staff. If you would like to discuss the possibility of a flexible working pattern please do get in contact!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEllen TutisaniJob titleModern MatronTelephone number01865 902534&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warneford Hospital, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Staff Nurse - Eating Disorder Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252113", "validThrough": "2020-11-16T23:59:59+0000"}