{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata pa inc plus Inner Londo"}}, "datePosted": "2020-11-04T16:30:35+0000", "description": "&lt;p&gt;The post of the specialist physiotherapist is to be responsible for clinical and service development for Corporate Physiotherapy across the Ladywell Unit (Lewisham – including Heather Close). We are looking for a motivated and enthusiastic practitioner to use highly developed assessment &amp; clinical reasoning skills to plan progress and deliver specialist physiotherapist treatment for service users who are admitted for mental health treatment and have complex needs requiring interventions to address their physical health&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work as an autonomous practitioner (but be supported by the Head of Therapies and Head of Physiotherapy and clinical lead occupational therapist&lt;/p&gt;\n&lt;p&gt;You will be an integrated member of the multidisciplinary team implementing and providing specialist advice to other health professionals including: Medical Staff, Psychology Staff, Nursing Staff (including healthcare assistants), Occupational Therapists, Speech &amp; Language Therapist, Social Workers, Dieticians, and other members as necessary.&lt;/p&gt;\n&lt;p&gt;Be a part of the internationally renowned South London &amp; Maudsley NHS Foundation Trust by joining our hard working and energetic senior management team in the London borough of Lewisham.&lt;/p&gt;\n&lt;p&gt;We value diversity and want our teams to represent our population in Lewisham. With that in mind we welcome applicants who have lived experience as well as those from a BME background&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role is for a total of 7.5 hours per week and can be negotiated flexibly to suit the applicant. The role will include the individual identifying and managing their own physiotherapy caseload in conjunction with the MDT. Interventions will include among other areas: 1. Identification of people with mobility difficulties, and prevention of falls; 2 access suitable exercise for patients with comorbidities and 3. Addressing complex physical barriers which may have arisen from recent physical trauma (e.g. self-harm).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will not only join a diverse and thriving directorate, but located in the heart of Lewisham, you will have access to excellent social facilities. Wider Lewisham today is a successful and cosmopolitan part of London occupied by energetic, creative and diverse local communities. People benefit from attractive residential neighborhoods, great local schools and a huge number of parks and green spaces. There are excellent transport connections to the rest of London and the wider region, with Canary Wharf, the City, London City Airport and the new international rail terminal at Stratford all within easy reach of the borough. The London Overground is now connecting more of Lewisham with central London and the rail and tube network. In addition, there are exciting developments taking place in local town centres and neighborhoods, bringing new housing, new schools and new leisure facilities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBrendon StubbsJob titleHead of PhysiotherapyEmail addressBrendon.Stubbs@slam.nhs.ukTelephone number02032285028Additional contact information&lt;/p&gt;\n&lt;p&gt;Leonie Down&lt;/p&gt;\n&lt;p&gt;head of occupational therapy&lt;/p&gt;\n&lt;p&gt;Lewisham&lt;/p&gt;\n&lt;p&gt;leonie.down@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;07525236592&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ladywell Unit, lewisham", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256654", "validThrough": "2020-11-11T23:59:59+0000"}