{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-30T16:17:18+0000", "description": "&lt;p&gt;We are seeking an experienced Personal Assistant to join the Divisional Management Team to provide comprehensive office and administrative support to the Family Health Division, Gynaecology Division and Clinical Support Services Division for a period of 9 months to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have previous experience as a PA at senior management level and have excellent organisational skills, a high level of competency in using Microsoft Office and the ability to work under pressure, prioritise workloads and work to deadlines. You will be required to work on your own initiative and deal with matters on behalf of those who you support and be an effective decision maker with the ability to work flexibly.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills, both written and verbal, are required and the post holder must have the ability to liaise with staff at all levels within the Trust. They will also be required to liaise with external contacts representing the organisation.&lt;/p&gt;\n&lt;p&gt;A key part of the role is complex diary management, which involves the provision of full support and facilitation for a variety of senior level meetings. This includes producing and distributing papers in a timely manner, chasing outstanding actions and taking accurate minutes to reflect the discussions held.&lt;/p&gt;\n&lt;p&gt;The post holder will work as a team of two PA’s providing cover and support for each other to ensure the smooth running of the administrative function as a whole. Other duties involve making travel arrangements, collating complex and confidential information, as well as contributing to the overall support function for the three divisions.&lt;/p&gt;\n&lt;p&gt;This is a rewarding, yet busy and demanding role with the post holder needing to have a flexible approach to work, being able to use their own initiative and work effectively as part of a larger team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Experience of minute-taking is essential&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Secondments will be considered – applicants wishing to apply as a secondment MUST seek approval from their line manager before applying for this post.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary EvansJob titleOperational Services ManagerEmail addressmary.evans@lwh.nhs.ukTelephone number0151 708 9988 ext 1124Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Mary Evans.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0151 708 9988 ext 1124&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;mary.evans@lwh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Crown Street | Liverpool | L8 7SS&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Liverpool Womens NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121086"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crown Street, Liverpool", "postalCode": "L8 7SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3983", "longitude": "-2.95998"}}, "title": "Divisional Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250927", "validThrough": "2020-11-13T23:59:59+0000"}