{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive + Company Benefits"}}, "datePosted": "2020-11-02T16:27:13+0000", "description": "&lt;p&gt;We are looking for a passionate, professional and ambitious Registered Mental Healthcare Nurses to join our expanding clinical team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Company&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Northern Health Care Ltd provides outcome focused mental health recovery services across the UK. Our services include both residential units and community outreach including 24 hour support and access to experienced, clinically qualified staff.&lt;/p&gt;\n&lt;p&gt;Due to organisational expansion, opportunities have arisen within Northern Healthcare for Registered Mental Healthcare Nurse positions for our Cradley Heath unit. If you are looking for a flexible working week, whilst working part time, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;In line with the philosophy of the unit the post holder will be responsible for the assessment, planning, implementation and evaluation of care for the identified service users, acting as nurse for service users with complex and challenging needs within an enhanced supported living environment.&lt;/p&gt;\n&lt;p&gt;As part of this role you&#39;ll deliver specific interventions on an individual basis, providing effective evidence based care to service users. Communication and liaison with a number of disciplines is essential to promote effective delivery of the clinical care pathway to meet service user’s needs.&lt;/p&gt;\n&lt;p&gt;You&#39;ll provide support and direction to team members and assist the smooth coordination and running of the unit.&lt;/p&gt;\n&lt;p&gt;In return, benefits of this role include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong career progression and development opportunities into management roles&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision &amp; peer support&lt;/li&gt;\n&lt;li&gt;Employee referral scheme&lt;/li&gt;\n&lt;li&gt;Preceptorship&lt;/li&gt;\n&lt;li&gt;Mon-Fri working week&lt;/li&gt;\n&lt;li&gt;Part time hours&lt;/li&gt;\n&lt;li&gt;The option to join the on-call service&lt;/li&gt;\n&lt;li&gt;No unsociable hours&lt;/li&gt;\n&lt;li&gt;No weekend work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are committed to providing Supervision, Appraisal and Personal Development.&lt;/p&gt;\n&lt;p&gt;Applicants should note that an enhanced disclosure check via the Criminal Records Bureau will be required before appointment.&lt;/p&gt;\n&lt;p&gt;If you are passionate about Mental Health Recovery and making a difference then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135974.JPG", "name": "Northern Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cradley Heath", "postalCode": "B64 6AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4701", "longitude": "-2.08532"}}, "title": "RMN - Registered Mental Health Nurse (Cradley Heath)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252837", "validThrough": "2020-12-31T23:59:59+0000"}