{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "79860", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 p.a excl LZ (Pro rata)"}}, "datePosted": "2020-10-28T09:31:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Guy&#39;s and st Thomas&#39; NHS Trust &lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Oncology Department &lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Consultant in Clinical Oncology&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;From £79,860 p.a. excl. LZ (pro rata)&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Full time - 10 PAs&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Commencing as soon as possible&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cancer services in Guy’s and St Thomas’ NHS Foundation Trust are undergoing a major transformation programme to improve the quality of care and patient experience. The programme includes a new cancer centre housing ambulatory cancer services which opened in 2016 and a new cancer treatment centre at Queen Mary’s Hospital Sidcup (QMS) which opened in May 2017. Clinical pathways are being revised to optimise patient care. This post is available to support the current breast team at Princess Royal University Hospital (KCH) and GSTT (Guy’s and St Thomas’ Hospital) and the breast team at Guy’s Cancer Centre.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be motivated individuals with FRCR or equivalent and a wide experience in Clinical Oncology (both chemotherapy &amp; radiotherapy, including SBRT). A Research Degree is highly desirable. The applicant will be working with a team of consultants in a joint-clinic/MDT setting. The post includes breast clinics at PRUH. He/she will be supervising chemotherapy and radiotherapy treatment for breast cancer patients diagnosed at PRUH with treatments delivered both at the Cancer Centre and locally.&lt;/p&gt;\n&lt;p&gt;Guy’s &amp; St Thomas’ Trust is part of King’s Health Partners (KHP) which is one of only six Academic Health Science Centres in the UK accredited by the Department of Health, with a vision to achieve excellence in clinical care, research &amp; teaching. KHP is aspiring to transform cancer care in the region with a 5-year strategy underway.&lt;/p&gt;\n&lt;p&gt;As part of the commitment of the Trust to providing the highest quality of cancer care, the new purpose-built cancer centre on Guy’s campus opened in September 2016 and a new cancer centre at Queen Mary’s Hospital in Sidcup opened in May 2017. The Guy’s Cancer Centre was designed by staff and patients working together and provides state-of-the-art cancer care in a supportive modern environment. The centre includes individual departments (villages): welcome (housing all patient support activities), radiotherapy, chemotherapy and outpatients. The 2 centers are equipped with 8 TrueBeam linacs, 3 CT simulators, 1 PET/CT and a new planning system. The Clinical Oncology Department at Guy’s and St Thomas’ offers a wide range of specialized radiotherapy techniques including IMRT, IGRT, VMAT, 4D-RT, SABR, HDR brachytherapy, LDR seed brachytherapy, TSEBT, TBI and SRS.&lt;/p&gt;\n&lt;p&gt;Guy’s Cancer Centre is accredited as a comprehensive cancer centre by the Organisation of European Cancer Institutes and a Cancer Research UK centre by CRUK.&lt;/p&gt;\n&lt;p&gt;Closing date -13th July 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or to visit the hospital, please contact Dr Teresa Guerrero Urbano, Radiotherapy Lead, on 020 7188 4225 and/or Dr Anne Rigg, Clinical Director on 020 7185 6723.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Consultant in Clinical Oncology - With specialist interest in Breast", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245828", "validThrough": "2020-11-11T23:59:59+0000"}