{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata, per annum"}}, "datePosted": "2020-11-05T12:30:37+0000", "description": "&lt;p&gt;The post will cover Patient Meal Services at both Hull Royal Infirmary (HRI) and Castle Hill Hospital (CHH).&lt;/p&gt;\n&lt;p&gt;The successful candidates will be working various shifts to cover service delivery requirements. The department operates from 06:00 through to 18:30 7 days a week including public holidays, the above posts will predominantly work the below shift times:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will assist in the provision of a comprehensive and cost-effective catering service that meets the needs of all patients whilst fulfilling the objectives of the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To provide a full range of high quality ward catering services including the regeneration and attractive presentation of a wide range of cook-freeze food items.&lt;/p&gt;\n&lt;p&gt;Duties will include the preparation, storage, packaging, distribution, regeneration and service of patient meals. Regularly handling frozen, chilled and cooked food items whilst standing for prolonged periods of time.&lt;/p&gt;\n&lt;p&gt;Ensure all patient meals are accurate and served in a timely manner.&lt;/p&gt;\n&lt;p&gt;To undertake a wide range of general kitchen and catering hygiene duties at ward level.&lt;/p&gt;\n&lt;p&gt;To work in accordance with Food Hygiene Regulations, Codes of Practice for Caterers and all relevant Trust policies.&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate good customer/patient care skills, and have a basic knowledge of food service and food hygiene.&lt;/p&gt;\n&lt;p&gt;Flexibility to work between Castle Hill Hospital and Hull Royal Infirmary is desirable.&lt;/p&gt;\n&lt;p&gt;Please note: The role does involve physical work in an area with varying temperatures.&lt;/p&gt;\n&lt;p&gt;** Salary relates to year 3 of 3 year NHS pay deal&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne Tock, Patient Meals Team Leader Joanne.Tock@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;Adriana Verschoor, Patient Meals Team Leader Adriana.Verschoor@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;Elizabeth Hatch, Patient Meals Team Leader Elizabeth.Hatch@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary/Castle Hill Hospital, Hull/Cottingham", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Patient Meals Catering Assistant - Casual Contract", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257663", "validThrough": "2020-11-19T23:59:59+0000"}