{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T10:31:45+0100", "description": "&lt;p&gt;We have a vacancy for a CBT therapist to work within our 0 – 18 years Integrated CPS and CAMHS service. Full BABCP accreditation as a CBT therapist is essential for the post. The post-holder will also be supported to attend CYP IAPT CBT Supervision if not already completed.&lt;/p&gt;\n&lt;p&gt;The core role will be to provide case management, specialist CBT assessment, formulation and intervention for children, young people and their families/carers. Experience of working within a children and family setting is required. Experience of adapting CBT for working with young people with neuro-diverse needs (e.g. autism spectrum condition) will be helpful. A thorough understanding of care planning, risk assessment and risk management within a children and family setting is also needed. The post-holder will be responsible for providing supervision to CYWP and CBT trainees and qualified staff.&lt;/p&gt;\n&lt;p&gt;The post is within a fully-integrated MDT of Specialist CAMHS Practitioners, DBT Therapist, Clinical Psychologists, and Psychiatry. The post-holder will join a number of CBT therapists already working in the children and young people specialty across eight teams in South Cumbria and Lancashire. There will be opportunities for peer support meetings with other CBT therapists within the specialty. Support for psychological practitioners is well-established through cross-specialty in-house events and the regional PPN network.&lt;/p&gt;\n&lt;p&gt;We support our staff to deliver high quality and innovative psychological solutions with service-users through consultation, parent workshops, individual, systemic/family approaches, and group work. The service provides care at HAS Tiers 2 and 3 and also has an established Primary Mental Health Workforce. Due to Covid-19 much of our work has moved to telephone and online platforms.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Lancashire and South Cumbria NHS Foundation Trust due to the regional service re-design in line with the ‘Thrive’ model. Thrive places service-users at the heart of service-delivery with a focus on needs-led services and shared decision-making.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennie Wynn, Team Leader Fylde &amp; Wyre CPS/CAMHS jennie.wynn@lancashirecare.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Julie Warburton, Consultant Clinical Psychologist Fylde Coast and North Lancashire&lt;/p&gt;\n&lt;p&gt;Julie.warburton@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitegate Health Centre, Blackpool", "postalCode": "FY3 9ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.813", "longitude": "-3.0346"}}, "title": "Cognitive Behavioural Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240056", "validThrough": "2020-11-19T23:59:59+0000"}