{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35782", "minValue": "35782", "unitText": "YEAR", "value": "UPTO £35,782"}}, "datePosted": "2020-11-05T13:51:30+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Deputy Clinic Manager&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you committed to delivering patient-orientated, high quality care? Do you have the expertise to provide specialised nursing guidance and advice? Can you work with others to maintain performance?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In a modern, well-equipped environment with a multi-disciplinary approach to care, you will provide the operational management to ensure that the service is patient-led and performing well. You will allocate resources effectively, oversee the training and development of staff and play a part in delivering care plans for individual patients. By promoting a culture of innovation and a passion for care, you will ensure that your clinic meets the needs of every patient.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your skill set will be a 1st or 2nd level nurse registered with the NMC with either formal renal nursing qualification or substantial Heamodialysis experience. Additionally, you will also have experience of managing others, counselling patients and understanding the role of the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Making a difference to patient’s lives is why we’re here. As a world leader in renal care, Fresenius offers dedicated, patient centred environments where quality care and the latest technology provide a supportive, modern patient experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an employer, we’re keen to look after our people with as much dedication as they look after our patients. That’s why we offer competitive salaries, excellent training and exceptional career prospects. We’re a growing and ambitious company, so there is huge potential here to develop with us and enjoy fantastic rewards in your career.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Crewe Dialysis Unit operates 18 haemodialysis stations, serving up to 72 patients, in partnership with the University Hospitals of North Midlands NHS Trust using only the latest equipment. Nursing is planned at a ratio of 1:4 patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full time role of 37.5 hours a week. Current days are working various shifts Monday to Saturday between 6.30am to 6.00pm.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Deputy Clinic Manager posts will be subject to an enhanced DBS Disclosure&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Fresenius Medical Care is an equal opportunities employer&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Fresenius Medical Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Deputy Clinic Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257970", "validThrough": "2020-12-18T23:59:59+0000"}