{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus HCAS"}}, "datePosted": "2020-11-06T12:01:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a band 7 EPAU Nurse/Midwife sonographer at Lewisham &amp; Greenwich NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated, committed and self-motivated Nurse/Midwife Sonographer to provide a high quality, evidence-based service to patients in early pregnancy assessment, with the aim of enhancing the care for women (and their partners) who may be concerned about a complication in early pregnancy.&lt;/p&gt;\n&lt;p&gt;The post holder will provide expert clinical skills, knowledge, advice and information to facilitate high quality care. This senior role will require the nurse to have proven advanced skills to physically assess, diagnose and implement management plans. The post holder will have a CASE (Consortium of Accredited Sonographic Education) programme of training for ultrasound in early pregnancy and gynaecology.&lt;/p&gt;\n&lt;p&gt;The ability to work in partnership with all members of the multi-disciplinary team to provide seamless care and support is also essential. We require someone who can work both autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt;You will be part of the senior nurse and midwifery leadership working across the Gynaecology speciality and you will be responsible for line managing and supporting the professional development of the EPAU Nurse/Midwife and HCA team. One of the aims of the service is to increase the number of nurses who are trained to scan so this post will be providing clinical leadership, training, support and supervision for nurses during their training.&lt;/p&gt;\n&lt;p&gt;You will promote clinical excellence whilst working closely with the Clinical Lead, Consultant colleagues and other key stake holders.&lt;/p&gt;\n&lt;p&gt;You will be required to work cross site at University Hospital Lewisham and Queen Elizabeth Hospital.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBelinda ChampionJob titleAdvanced Nurse Practitioner EPAUEmail addressbchampion@nhs.netTelephone number07500124288&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Hospital, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "EPAU Clinical Nurse Specialist - Nurse/Midwife Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259565", "validThrough": "2020-11-22T23:59:59+0000"}