{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 Per Annum Inc"}}, "datePosted": "2020-11-02T15:31:34+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South London Partnership’s CAMHS New Models of Care Programme aims to transform services through partnership-working; delivering best practice consistently to support young people and their families.&lt;/p&gt;\n&lt;p&gt;We aim to reduce A&amp;E presentations and hospital admissions and offer the least restrictive interventions to provide consistent access to rapid, effective interventions, support and recovery – including crisis services. This includes better use of resources and investing to develop more local, community-based services and support.&lt;/p&gt;\n&lt;p&gt;South London Partnership is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, between them delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring journey&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Deputy Team Leader/ Clinical Charge/CPN/PDN to work within the CAMHS Enhanced Treatment Service. We would welcome applications from Nurses offering treatment interventions from other specialties. The service will work closely alongside Crisis service and will link with the three mental health trusts in the South London Mental Health and Community Partnership.&lt;/p&gt;\n&lt;p&gt;This varied role offers excellent opportunities to gain experience and skills in a variety of different settings.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint someone who is confident, responsive and has a passion for young-person and family-centred improvements; you will be enthusiastic and resilient and be able to respond to young people’s needs flexibly&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be based at Maudsley Hospital, Denmark Hill, London, SE5 8AZ&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMandy WaitJob titleClinical Service ManagerEmail addressMandy.Wait@slam.nhs.ukTelephone number07453 960126&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, Denmark Hill, London, SE5 8AZ, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Deputy Team Leader/ Clinical Charge/CPN/PDN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252609", "validThrough": "2020-11-09T23:59:59+0000"}