{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 PA"}}, "datePosted": "2020-10-27T18:17:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a successful Trust &amp; Foundations or Major Gifts expert ready for your next challenge? Are you looking for a role where you can hone your skills and experience to secure leading gifts from charitable funders that will transform the lives of women, children, and their families across the UK? A role where you can personally grow and develop as the team succeeds?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Fundraising Team exists to inspire thousands of people – from individuals to large corporate organisations and charitable foundations – to support our quest to always be at the forefront of what is possible. Over the last ten years we have grown our income substantially to push boundaries and improve standards of excellence in research, treatment and care; driven every day by the passion of our staff, the expertise of our clinicians, the need of our patients, and the generosity of our supporters.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;But we have so much more that we want to achieve. As the need and importance of our Charity continues to grow, we have ambitious plans to increase the impact of our work - both here in the Midlands and across the UK - in areas such as childhood cancer, rare diseases, neonatal and maternal health, children and young people’s mental health, and critical care. Central to these plans will be the development of a significant capital build programme and the delivery of an ambitious new Philanthropy strategy that will significantly increase our charitable income over the coming five years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The new Head of Philanthropy will be critical to the delivery of this plan. Managing a team of two, and working closely with the Assistant Director of Philanthropy, they will lead on the development and delivery of high-value funding applications to charitable funders, personally manage a portfolio of funder relationships, and set and deliver operational plans to achieve our long-term objectives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role is an exciting opportunity for either an existing ‘Head of’ or a driven and ambitious Trust and Foundation or Major Gift fundraiser who is ready to make the step up. They will be a strong team player, capable of navigating a large and highly complex organisation to establish the systems, process and relationships necessary for success. This is your opportunity to help us shape the future, drive growth, and create a legacy that will be felt for decades to come.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more details, and an informal chat about the role and what we are looking for please contact simon@peridotpartners.co.uk or 07702 678 658.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Children&#39;s Hospital", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Head of Philanthropy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245622", "validThrough": "2020-11-22T23:59:59+0000"}