{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-20T15:04:02+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Community Staff Nurse - 30.00 hour per week&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you been thinking of a change but not sure if community is really for you? This is an ideal opportunity to test the water to see.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity within the Workington Community nursing ICC team for a secondment as a Band 5 Community Nurse.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Applicants should discuss their interest in a secondment opportunity with their line manager and seek their approval before pursuing the opportunity.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Workington is an exciting place to work as part of a developing Integrated Care Community. We are looking to appoint an enthusiastic and motivated nurse, who is looking to work in an evolving community nursing service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role of a band 5 community nurse is very varied. All new team members will be provided with a structured preceptorship period, with multiple team members providing the support, and we actively encourage ongoing skill development to all staff members. Being a nurse in the community enables practitioners to be dynamic thinkers, autonomous workers to problem solve issues with their patients to ensure safety. Whilst working as part of a wider supportive team, to draw on each other’s clinical skills and knowledge. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to appoint an enthusiastic and motivated nurse, who can demonstrate kindness and respect in all aspects of their care. We expect applicants to be able to work collaboratively with their MDT colleagues to ensure high quality, patient centered care is provided. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working within an ICC enables community practitioners to manage patients effectively, and where possible avoid acute hospital admissions. We also work closely with acute services to facilitate timely and safe discharges of patients back into community care. Partnership working with our patients if fundamental to ensure ongoing holistic care, in order to promote patients health and ensure a continuity of care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The community nursing team visit patients in their own homes, as well as in residential care settings, providing a range of clinical skills, including holistic assessment, intravenous therapy, vaccinations, complex wound care, health promotion, continuing health care assessments, palliative care, continence management and assessment for specialist equipment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our aim is to promote better health by providing better care for the people in Cumbria. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be a 1st level registered nurse; This post includes evening, weekend, some bank holiday working and nights; therefore a flexible approach is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If interested in this post we would encourage you to contact District Nursing Sisters Melissa Norman on 01900 705225/ 07899068988 &lt;span style=&quot;text-decoration: underline;&quot;&gt;melissa.norman@NCIC.cumbria.uk&lt;/span&gt; or Louise Freeman on 01900705244/ &lt;span style=&quot;text-decoration: underline;&quot;&gt;louise.freeman@NCIC.cumbria.uk&lt;/span&gt; for further information.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Healthcare Professionals returning to practice, moving into new roles or changing clinical environments, may access an agreed preceptorship period.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These schemes are subject to availability&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Workington, Cumbria", "postalCode": "CA14 2RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6428", "longitude": "-3.55147"}}, "title": "Community Staff Nurse **Internal Applicants only**", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234927", "validThrough": "2020-11-22T23:59:59+0000"}