{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-05T15:46:13+0000", "description": "&lt;p&gt;&lt;strong&gt;*Previous Applicants Need Not apply*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about patient care and a Registered Nurse looking to join our &lt;/strong&gt;&lt;strong&gt;dedicated teams?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Medicine and Clinical Support Business group here at Stepping Hill Hospital would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Our medical wards and departments will provide you with an environment where you can flourish. You will be able to develop your skills, knowledge and compassionate patient care. We have opportunities within a range of services and specialities, including, cardiology, respiratory medicine, Stroke service, caring for older peoples medicine, general medicine and endocrinology. We understand that you may not be sure which speciality is for you, so can offer you a rotational programme. This will give you valuable experience for your career, Medicine makes sense.&lt;/p&gt;\n&lt;p&gt;If you would like to join our expanding services and gain experience in your chosen field, why not be bold and apply now. We would love to hear from you, if you are at the beginning of your career, midway or looking for a change. We can and help you become the nurse you are meant to be here in Medicine.&lt;/p&gt;\n&lt;p&gt;Working as a registered Nurse within our teams you will have the opportunity to work with a range of supportive colleagues, the whole multidisciplinary team, specialist nurses and our new Advanced Clinical Practitioners. Our innovative approaches to care based on our quality improvement programme means that medicine remains varied, no two days are the same which enable you to develop your leadership skills and respond to change.&lt;/p&gt;\n&lt;p&gt;Our Education lead is here to welcome, support and care for you every step of the way from recruitment to joining us. With our supportive teams we can enable you to access a wide range of dynamic training, development and education to underpin your professional practice. You can grow in your knowledge, skills and practice to be the medical nurse you aspire to be. This includes clinical induction and skills competencies. For newly registered nurses we provide you with our innovative preceptorship programme that supports your transition to a confident autonomous practitioner which gives you the opportunity to develop a quality improvement initiative. For existing nurses we provide continued professional development.&lt;/p&gt;\n&lt;p&gt;We understand that your nursing career is one part of your life. We are committed to helping you achieve this work life balance. We have invested in wellbeing resources that staff can use. We can offer supportive family friendly employment.&lt;/p&gt;\n&lt;p&gt;If successful, this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namesharon greenJob titleEdcaution LeadEmail addresssharon.green@stockport.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information contact Sharon Green, Education Lead&lt;/p&gt;\n&lt;p&gt;Email Sharon.green@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;for an informal chat, to arrange a tour of the hospital or a Skype interview&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Registered Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258411", "validThrough": "2020-11-19T23:59:59+0000"}