{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "In line with TPD&#39;s sessional payment"}}, "datePosted": "2020-10-30T11:46:36+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Advanced clinical practitioners (ACPs) enhance capacity and capability within multi-professional teams by supporting existing and more established roles. They help to improve clinical continuity, provide more patient-focused care, enhance the multi-professional team and help to provide safe, accessible and high-quality care for patients.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The EoE School of Ophthalmology is looking for a clinician to support the development and delivery of ACP roles within ophthalmic settings. They will report to the School Board, and support EoE regional work on ACPs, feeding into the HEE ACP Steering Group.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role of Training Programme Director/Specialty Advisor is to work with and support the Head of School in leading the delivery of a wide range of functions, aligned to the Health Education England mandate.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Training Programme Director/Specialty Advisor is professionally and managerially accountable to the Heads of School. The Training Programme Director will focus upon improvement of learner supervision, assessment and experience, engagement of faculty and ensuring effective educational outcomes, both now and in the future. The role is evolving and will also focus on whole workforce transformation and developing multi- professional links.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;To support the Postgraduate Dean, Training Programme Directors will work across the spectrum of health and where relevant, social care, within the context of a team, so that the provision of education reflects changing service models. This will deliver an integrated workforce comprising individuals from a spectrum of professional and other backgrounds.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our work is set within the NHS Long-Term Plan and Interim People’s Plan and is defined by the HEE Mandate from Government. It is part of the consensus on how the NHS needs to change, with a key focus on prevention and a commitment to reducing health inequalities and promoting equality and diversity.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post is offered on a secondment basis and all candidates are reminded that if they are successful, they are responsible for securing written agreement from their Trust/Practice for release from other duties/clinical work for the specified number of PAs/sessions. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The specified PAs has been established following the 2018 national review of funding for TPD work. TPD posts are open to Substantive Ophthalmology Consultants who work in a EoE recognised training unit, who meet the requirements. In the future the ACP TPD role is expected to be open to multi-professionals, whom have the required qualifications and experience including faculty development in assessment and progression of ACPs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The EoE School of Ophthalmology is looking for a TPD/Specialty Advisor to support the development and delivery of ACP roles within ophthalmic settings. They will report to the School Board, and support EoE regional work on ACPs, feeding into the HEE ACP Steering Group.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The key deliverables will be:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;To establish (and then chair) an Ophthalmology ACP lead forum to bring together the multidisciplinary team working to introduce and embed ACP programmes in ophthalmic settings to share learning, ideas, etc. and collaborate where possible&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Using expertise within the forum, to identify what the additional support and development needs for ACP trainees and qualified ACPs in ophthalmology are, e.g. support around how ACPs can adapt to their roles, additional clinical study days, etc.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Developing a support programme for ophthalmic ACPs (as identified above) and putting this in place. Examples of programme can include a conference and/or materials for level 3 ACPs* and their supervisors.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Narman Puvanachandra, Head of School for Ophthalmology&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Email: narman.puvanachandra@nnuh.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Victoria House, Cambridge", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "TPD/Specialty Advisor for ACP Ophthalmology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250030", "validThrough": "2020-11-15T23:59:59+0000"}