{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Band 3"}}, "datePosted": "2020-11-03T15:46:32+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for an administrator to join our Temporary Staffing Team following the retirement of a long standing member of the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Temporary Staffing Team support the Trust in the delivery of safe patient care by managing the booking of temporary workers; providing the wards and departments with additional appropriately trained staff to support their required staffing levels. We support the provision of bank and agency workers across multiple staff groups including Nursing, Allied Health Professionals and Medical Locums.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a positive, pro-active and professional administrator to join our team. If you have excellent interpersonal skills, are a good communicator and have a strong desire to deliver outstanding support to our clinical teams then this could be the role for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work together with many different people across the Trust, building relationships with staff, managers and directors at all levels, in order to understand their temporary staffing needs and requirements and how we can support them to deliver safe, effective patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will be proficient in the use of the Allocate HealthSuite of systems or have the ability to learn the use of IT systems quickly. You will also have an excellent working knowledge of Microsoft packages, including Word, Outlook and Excel.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Temporary Staffing Team provide a 7 days service to the Trust from 08:00-20:00 and to support this the team work on a shared rota of the following shift patterns:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;October to April – 3 x 11hr shifts per week&lt;/li&gt;\n&lt;li&gt;April to October – either 3 x 11hrs shifts per week on a weekday or 2 x 11hr shifts on a weekday and 2 x 5.5hr shifts on a weekend&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please review the attached job description and person specification&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa MuganJob titleTemporary Staffing ManagerEmail addresslisa.mugan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worthing, Worthing", "postalCode": "BN11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8167", "longitude": "-.364296"}}, "title": "Temporary Staffing Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254628", "validThrough": "2020-11-15T23:59:59+0000"}