{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc"}}, "datePosted": "2020-11-06T12:31:41+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South West London and St George’s Mental Health Trust (SWLSTG) are currently recruiting for a band 6 charge nurse to join our CAMHS (Children and Adolescent Mental Health) inpatient team and work with children aged 12 – 18 years.&lt;/p&gt;\n&lt;p&gt;Aquarius Ward is a specialist inpatient mental health provision for young people aged 12 – 18 who are experiencing an acute mental health crisis. It is a 12 bedded National Unit open 365 days a year, 24h a day. It is part of the South London Partnership providing the adolescent in-patient services for young people under South West London &amp; St George’s Mental Health NHS Trust, South London and Maudsley and Oxleas NHS Trust.&lt;/p&gt;\n&lt;p&gt;The team provides inpatient treatment for adolescents aged 12 to their 18th birthday in an acute mental health crisis that is unable to be managed in the community with conditions such as severe depression, anxiety, OCD, self-harm, psychosis and mania.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining a multi-disciplinary team that is committed to the provision of high quality service user centred care. Our teams are looking for compassionate, extraordinary Mental Health Nurses that are wanting to develop in their management skills in a busy and exciting environment.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is clinically competent with the appropriate skills to lead a diverse and experienced team. The successful candidate will be able to develop a positive team atmosphere through hard work, calmness, tolerance and consistency.&lt;/p&gt;\n&lt;p&gt;They will lead on quality improvement initiatives and support a culture of reflection and learning. Lastly the candidate will be able to mentor, counsel, coach and generally support those who are not confident in the clinical environment, building morale and self-esteem and generally encouraging others to give their best performance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Naomi Sutherland, Ward Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 513 5421&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Charge Nurse (Aquarius) - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259678", "validThrough": "2020-11-15T23:59:59+0000"}