{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T09:45:52+0000", "description": "&lt;p&gt;If you are seeking to develop your clinical and managerial skills and want to contribute to a forward thinking neonatal team, we can offer you an excellent experience within a supportive environment. Neonatal Intensive care course essential.&lt;/p&gt;\n&lt;p&gt;We are a level 1 unit with 11 cots, three of which are equipped for short-term intensive care. About 3,000 babies a year are born at South Warwickshire NHS Foundation with 350–400 babies being admitted to SCBU. We are proud to have been at the fore front of successful service improvements and developments including work with the Department of Health, the Kings Fund (as part of the Improving safety in Maternity Services Project), the Baby Friendly Initiative, BLISS and local charities and support groups.&lt;/p&gt;\n&lt;p&gt;Our Neonatal Nurses are exceptional at planning and managing their workload and you will need to be able to demonstrate how you do this as part of the application process. We pride ourselves on delivering specific individualised family integrated care and you will need to demonstrate how you ensure this through your work.&lt;/p&gt;\n&lt;p&gt;Working with a variety of staff groups in and out of the NHS your communication skills will be first-rate and you will be able to communicate complex, sometimes difficult information to families and you colleagues. This also means that your written communication will be clear and appropriate to those reading it. This includes writing excellent patient notes and producing clear and effective reports for, as an example, child protection conferences.&lt;/p&gt;\n&lt;p&gt;You will need to be able to work flexibly including nights and weekends.&lt;/p&gt;\n&lt;p&gt;We actively encourage professional development and can support staff to undertake a variety of courses and study days. The Trust maintains strong links with Coventry University and there are opportunities for secondment to courses there.&lt;/p&gt;\n&lt;p&gt;If you want to be part of a growing developing team with a great future we would love to hear from you. So for more information or to arrange a visit to our department please contact Esther Boyle.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEsther BoyleJob titleUnit ManagerEmail addressesther.boyle@swft.nhs.ukTelephone number01926 495321 ext 4530&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SCBU H24071, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Neonatal Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251454", "validThrough": "2020-11-16T23:59:59+0000"}