{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 pro rata (run through)"}}, "datePosted": "2020-10-23T14:16:22+0100", "description": "&lt;p&gt;&lt;strong&gt;Contract Type: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Up to 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Radiographer, Band 5 (£24,907 to £30,615 pa); or&lt;br /&gt;Radiographer Specialist, Band 6 (£31,365 - £37,890)&lt;br /&gt;(Individuals may be appointed to either a Band 5 or Band 6 role, dependent on experience).&lt;br /&gt;&lt;strong&gt;We have a competency based run-through from Band 5 to Band 6, and as such encourage and support personal development and role extension&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Radiology Department at York Teaching Hospital NHS Foundation Trust employs a multi-disciplinary team of clinical and non-clinical staff, to provide high quality, customer-focused and user-friendly Diagnostic Radiology Service.&lt;br /&gt;We are a friendly team with a great skill mix, which helps us support each other to provide patient-centred care.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit enthusiastic and well-motivated individuals, who are suitably qualified and registered with the HCPC. As part of the Radiology Team, you will be required to work on a 50/50 basis within the general x-ray department, including theatres, fluoroscopy and the Emergency Department as well as the CT department. You will be expected to participate in both the ED and CT out of hours rota (on a 50/50 basis), in order to provide a service 24 hours a day/7 days a week.&lt;/p&gt;\n&lt;p&gt;Previous CT experience would be desirable, but full training can be given for the right candidate. York Hospital operates 3 Siemens CT scanners, covering all aspects of CT scanning.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking department committed to advanced practice with Radiographers currently undertaking extended roles.&lt;/p&gt;\n&lt;p&gt;These roles include intravenous cannulation, fluoroscopic examinations, multi-modality advanced practice reporting and the vetting of referrals.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Requirements of the role&lt;/strong&gt;&lt;/span&gt;:&lt;/p&gt;\n&lt;p&gt;1. Must have a degree in Diagnostic Radiography (or comparable higher education qualification in Diagnostic Radiography).&lt;br /&gt;2. Must be HCPC registered.&lt;br /&gt;3. Must have relevant prescribed clinical experience leading to qualification.&lt;br /&gt;4. Evidence of continuous professional development.&lt;br /&gt;5. Must have excellent communication skills, be calm under pressure and exhibit a caring attitude.&lt;/p&gt;\n&lt;p&gt;Applications from candidates interested in fewer than the full number of hours specified, and/or those interested in a job share will be considered&lt;/p&gt;\n&lt;p&gt;Sounds like a good opportunity? Have you got the skills we need?&lt;/p&gt;\n&lt;p&gt;Please get in touch - we are waiting to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: This vacancy may close at short notice should sufficient applications be received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gwen Haley&lt;/p&gt;\n&lt;p&gt;CT Principal Radiographer&lt;/p&gt;\n&lt;p&gt;gwen.haley@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01904 725653 or 01904 725937&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Steve Baker, Radiographer Principal&lt;/p&gt;\n&lt;p&gt;steven.baker@ york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01904 725916&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw.  In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Radiographer / Radiographer Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240884", "validThrough": "2020-11-08T23:59:59+0000"}