{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T11:46:23+0000", "description": "&lt;p&gt;This is an exciting opportunity to support the NWSSP Senior Leadership Team in the development of the NWSSP Integrated Medium Term Plan (IMTP).&lt;/p&gt;\n&lt;p&gt;Our IMTP is bold and ambitious with a number of significant service changes planned for the medium term, alongside a keen focus on quality and continuous improvement in our service delivery.&lt;/p&gt;\n&lt;p&gt;Primarily, the post holder will work with Directors to produce an IMTP document using a recognised project management approach, drafting the plan and report against progress with the plan.&lt;/p&gt;\n&lt;p&gt;Key to the role will be supporting Divisions to ensure that their operational service plans are fit for purpose. Acting on behalf of NWSSP in preparing Welsh Government reports especially when they are linked to specific projects or the IMTP.&lt;/p&gt;\n&lt;p&gt;Day to day work will be conducted with minimum supervision the judgement of the individual is required to alert Directors of any deviations from the programme of work.&lt;/p&gt;\n&lt;p&gt;The role will be responsible for the effective delivery of allocated projects. The individual must have excellent organisation skills to effectively support the Senior Leadership Team (SLT) and its delivery against the strategic projects that impact on NHS Wales. The role will require work at all levels across NWSSP, Health Boards, Trusts and with Welsh Government.&lt;/p&gt;\n&lt;p&gt;The post holder will be able to demonstrate significant Project Management knowledge/experience along with a proven track record of liaising effectively with a range of stakeholders across various organisations at different and often senior levels.&lt;/p&gt;\n&lt;p&gt;You will also have experience of working in and directing cross-organisational and cross-functional project teams. Excellent verbal and written communication skills are essential. Including leadership and expertise to enable Health Boards their clinicians and managers to understand variations in practice in order to deliver outstanding organisational performance.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Ramsey - Deputy Director of Finance and Corporate Services&lt;/p&gt;\n&lt;p&gt;alison.ramsey@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127554.jpg", "name": "NHS Wales Shared Services Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible but one of the NWSSP regional offices, regular travel to Nantgarw HQ will be required, Nantagarw", "postalCode": "CF15 7QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5659", "longitude": "-3.27787"}}, "title": "IMTP Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248162", "validThrough": "2020-11-12T23:59:59+0000"}