{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "3000", "unitText": "YEAR", "value": "£30,000.00 Plus £3,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:59:01+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Set back within 15 acres of landscaped gardens, the tranquil environment of the Priory Hospital Southampton offers therapeutic and recovery focused residential treatment as well as day care and outpatient services. The hospital also provides a specialist inpatient service for children and adolescents.&lt;/p&gt;\n&lt;p&gt;We have ahighly experienced team of mental health professionals and support staff, which include consultant psychiatrists, psychologists, nurses and therapists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Requirements:&lt;/p&gt;\n&lt;p&gt;RMN/RGN/RNLD - Registered with the NMC&lt;/p&gt;\n&lt;p&gt;• Adopt a systemic, individual approach to all patient care plans and communicate the outcomes to the clinical team both verbally and in writing, ensuring all CPA and risk assessment documentation is kept up to date.&lt;/p&gt;\n&lt;p&gt;. Ability to lead a team and communicate effectively&lt;/p&gt;\n&lt;p&gt;. Undertake lead roles as directed by ward manager&lt;/p&gt;\n&lt;p&gt;Provide supervision for junior nurse and health care assistants&lt;/p&gt;\n&lt;p&gt;• Ensure effective communication of any concerns relating to patient care.&lt;/p&gt;\n&lt;p&gt;• Deputise in the absence of the Ward Manager and their Deputy to manage the staffing and clinical needs of the ward as required.&lt;/p&gt;\n&lt;p&gt;• Support and supervise new or junior assist and support regional management in developing and implementing new services.&lt;/p&gt;\n&lt;p&gt;• Manage the assessment, implementation and evaluation of individual patient care plans while promoting a professional working environment to ensure a high standard of patient care.&lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to apply for a disclosure at the enhanced level from the Disclosure and Barring Services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marchwood, Southampton", "postalCode": "SO40 4WU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8846", "longitude": "-1.45034"}}, "title": "RMN/RGN/RNLD With £3K Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225828", "validThrough": "2020-11-13T23:59:59+0000"}