{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc pro rata"}}, "datePosted": "2020-11-02T17:00:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Manual and Patient Handling Trainer and Subject Matter Expert – Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have an interest in being able to inspire people to be confident and safe in their manual and patient handling? Would you like to be able to improve the experience of people who use our services? Do you have a desire to use your clinical skills and experience to influence and shape patient handling? If so, then please read on.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for two creative and dynamic people to join the ‘heroes’ of CNWL&#39;s Safety Team as Patient Handling Trainers and Subject Matter Experts.&lt;/p&gt;\n&lt;p&gt;We are looking to employ two part time people (each three days per week) with the competence to design and deliver patient handling training across our services. You will be an expert by way of experience and have a central role to train and advise our staff regarding equipment and current best practice. You will work within the Trust’s Safety Team.&lt;/p&gt;\n&lt;p&gt;As part of your role, you will not only deliver training but also help shape the course content and way in which this is delivered – including online content where feasible. You will also undertake on site competency assessments working with staff to promote excellence. You will need to have excellent communication skills and be able to inspire people to do things differently; using your clinical and personal experience to influence and support change.&lt;/p&gt;\n&lt;p&gt;Ideally you will have experience of delivering Patient Handling training and have Patient Handling qualifications. Support for development training will be available via the General Services Association. The Trust has an outstanding track record of developing its staff and with access to our Quality Improvement (QI) training programme there will be further opportunities for ongoing personal and professional development.&lt;/p&gt;\n&lt;p&gt;We are looking for a person who will not only talk about our values of Compassion, Respect, Empowerment and Partnership but will live these in all that they do.&lt;/p&gt;\n&lt;p&gt;We would love to hear from you. Candidates are encouraged to contact us to have a chat about the role or to arrange a visit.&lt;/p&gt;\n&lt;p&gt;Interview date 8th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mark Singleton&lt;/p&gt;\n&lt;p&gt;Job title Trust Resusciation Manager&lt;/p&gt;\n&lt;p&gt;Email address Mark.Singleton2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07899767166&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Rose Dindol, Health and Safety Manager &lt;/span&gt;&lt;span&gt;rose.dindol@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust Headquarters, London", "postalCode": "NW1 3AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5244", "longitude": "-.142095"}}, "title": "Manual and Patient Handling Trainer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252961", "validThrough": "2020-11-16T23:59:59+0000"}