{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £110,683 per annum (pro rata)"}}, "datePosted": "2020-10-20T16:16:39+0100", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and thefuture National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Blood Safety, Hepatitis, Sexually Transmitted Infections &amp; HIV Division, part of the National Infection Service based at Colindale, comprises a team of experienced specialists at the forefront nationally and internationally of surveillance, prevention and control of viral hepatitis, STIs and HIV. We are seeking to appoint to a challenging and rewarding role providing leadership for the STI Section.&lt;/p&gt;\n&lt;p&gt;The role will involve leading and managing the Section and providing expertise on the development and maintenance of national surveillance and prevention activities for sexually transmitted infections (STIs) in England. The consultant will provide specialist epidemiological and public health leadership while managing new surveillance and evaluation activities and world-class research. She/he will provide specialist advice and support nationally, locally and internationally on standards in diagnosis and patient management, infection control and interventions, and outbreak and incident management.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;For further information prospective candidates are invited to contact Professor Gwenda Hughes (Gwenda.Hughes@phe.gov.uk), Deputy Director.&lt;/p&gt;\n&lt;p&gt;Interview Date: Friday 18 December 2020&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale, London", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Head of STI Section (Consultant Epidemiologist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235208", "validThrough": "2020-11-15T23:59:59+0000"}