{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc HCA"}}, "datePosted": "2020-10-27T11:46:23+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Band 7 - Ward Sister/Charge Nurse , Alexandra Ward&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for you to work as Ward Sister/ Charge Nurse in a passionate and innovative team at one of the UK’s leading teaching hospitals in the heart of London.&lt;/p&gt;\n&lt;p&gt;If you are a highly motivated and forward thinking experienced nurse and are interested in an opportunity to lead and develop a dedicated group of Nurses, Nursing Assistants and Apprentice Nursing Associates , this could be the job for you!&lt;/p&gt;\n&lt;p&gt;Alexandra Ward in Older Person’s Unit (OPU) has an exciting opportunity to recruit a Ward Sister/ Charge Nurse to join their ever growing team. The ward is a 28-bedded ward providing acute and emergency care to frail older people from admission to discharge.&lt;/p&gt;\n&lt;p&gt;Staff on this ward is committed to transform care of the older person and pride themselves on delivering high quality, expert care in a safe and nurturing environment. You will be supported by the Matron, senior nursing team and Practice Development Nurses to enable you to translate your vision into practice. You will also have the opportunity to work collaboratively with our Practice Educators to guide the development of our aspiring nurses and prepare them to be part of a skilled and competent workforce.&lt;/p&gt;\n&lt;p&gt;Alexandra Ward is embarking on using innovative modern day methodology for training our nursing workforce to embed safe, compassionate and evidence-based practice through in-situ simulation. Your role as Ward Sister/ Charge Nurse will be pivotal to this novel initiative that could become part of a training package for nurses working with older people.&lt;/p&gt;\n&lt;p&gt;The role provides not only opportunities but positive challenges that will help you develop your skills and gain further experience. You will be able to undertake in-house and external courses as well as other developments related to the role. You will have structured and peer support to be able to achieve your own personal aspirations within the vision of the ward and the Unit.&lt;/p&gt;\n&lt;p&gt;You must possess demonstrable experience as a senior nurse working in an acute setting and experience in staff management.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic, resilient and positive thinking nurse leader, you are the person we are looking for to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: 9th November 2020 (midnight)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview date: 18th November 2020&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Darlene Romero (Matron, Department of Ageing and Health) on 020 7188 7188 Extension 51166 or bleep 0374 and Heidi Jensen (Head of Nursing) via email to darlene.romero@gstt.nhs.uk&lt;em&gt; or &lt;/em&gt;heidi.jensen@gstt.nhs.uk&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas&#39; Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Ward Sister/ Charge Nurse - Alexandra Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244295", "validThrough": "2020-11-09T23:59:59+0000"}