{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-11-03T17:16:09+0000", "description": "&lt;p&gt;Are you a caring individual looking to grow your career in health care in a Hospital that truly cares for their staff? Do you have the passion and skills to provide the best patient care? You do? Brilliant – we have the role for you…&lt;/p&gt;\n&lt;p&gt;Here at Dorset County Hospital, we are looking to grow our team of Health Care Assistants (HCA). We have roles across a variety of wards including surgical &amp; medical. As an NHS organisation we pride ourselves on the care we provide, and on the support we give our teams and colleagues. We are a growing and changing organisation, and are looking for new team members to work with us during this time of change.&lt;/p&gt;\n&lt;p&gt;The role of a Healthcare Assistant is a very privileged role, as a HCA you will provide personal care and support to patients at their most vulnerable times. You will work alongside a multidisciplinary team to provide a compassionate, caring and safe environment for our patients.&lt;/p&gt;\n&lt;p&gt;To excel in this role you will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have excellent communication skills and be able to work as part of a team.&lt;/li&gt;\n&lt;li&gt;Have an eye for detail and be able to maintain accurate documentation.&lt;/li&gt;\n&lt;li&gt;Be flexible and willing to work across a variety of adult wards within DCHFT.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we can offer you..&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to first class training to support you in your role, whether you are in your first years of healthcare, or progressing your existing career. This includes a week of initial training which will result in you achieving a Care Certificate.&lt;/li&gt;\n&lt;li&gt;A truly special team environment as part of #TeamDCH.&lt;/li&gt;\n&lt;li&gt;A variety of NHS Discounts wide range of shops, restaurants and retailers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Make sure to check our benefits page by searching JoinDCHFT online.&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application!&lt;/p&gt;\n&lt;p&gt;We are a Trust that celebrates diversity and we are committed to creating an inclusive environment for all employees. We would welcome applications from people in groups which are under-represented in our organisation.&lt;/p&gt;\n&lt;p&gt;For further information please contact on 01305 25176 or email Lyndsey.blakeway@dchft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Interviews: 25th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121023.jpg", "name": "Dorset County Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121023"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset County Hospital, Dorchester", "postalCode": "DT1 2JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7135", "longitude": "-2.44712"}}, "title": "Healthcare Assistant - Permanent &amp; Worklife Balance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254913", "validThrough": "2020-11-15T23:59:59+0000"}