{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 per annum"}}, "datePosted": "2020-10-27T11:02:03+0000", "description": "&lt;p&gt;Within the Training Programme Management function of HEE North West, we have opportunities for two Programme Support Administrators, one to support the School of General Practice and the other to support Training Hubs and the School of Primary Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;School of General Practice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The GP Programme Support Administrator will provide effective and efficient administrative support to the NW School of General Practice, the largest of its kind in the country. GP Training is experiencing an exciting period of expansion and reform, and this is a varied role which underpins both the support of our GP Trainees and the development of our Educator community across the North West (Lancashire &amp; South Cumbria, Cheshire &amp; Merseyside, and Greater Manchester).&lt;/p&gt;\n&lt;p&gt;The post-holder will be involved in a range of activities such as accreditation of GP trainers and learning environments, educational events for trainees and educators, managing queries coming into shared inboxes and ensuring trainees are fully prepared for their annual reviews. The role provides an excellent opportunity to work with a wide range of internal and external colleagues to support the work of the GP School and the chance to learn new skills. There may be some external events that the post holder would be expected to attend.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Training Hubs and School of Primary Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Training Hub &amp; Primary Care Programme Support Administrator will contribute towards the development of the HEE NW Primary Care School. This role focuses on supporting the accreditation of a multi-disciplinary workforce across the North West.&lt;/p&gt;\n&lt;p&gt;The Administrator is responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working as part of a team to support the implementation of specific workstreams and team functions&lt;/li&gt;\n&lt;li&gt;Maintaining a database of all multi-professional learning environments within the NW and oversight of placement capacity within primary /community care&lt;/li&gt;\n&lt;li&gt;Supporting the delivery of a comprehensive administrative service, including secretariat for meetings&lt;/li&gt;\n&lt;li&gt;Helping to ensure that the education delivered to all learners in primary care is of a consistently high quality&lt;/li&gt;\n&lt;li&gt;Supporting a rapid expansion of accredited multi-professional learning environments across the NW and the approval process for these&lt;/li&gt;\n&lt;li&gt;Supporting the development of a multi-professional educator faculty and the delivery of training courses&lt;/li&gt;\n&lt;li&gt;Supporting all Primary Care School development objectives and the functioning of the School board&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For both roles, we are looking for enthusiastic and organised individuals who can manage and prioritise their own workload within a fast-paced environment. A good working knowledge of Office365, including Microsoft Office and the ability to manipulate information from a variety of sources is essential. It is important that the post holders have excellent communication skills and are able to deal sensitively with people at all levels. We are looking for team players, as the willingness to support other members of our forward-thinking and friendly teams is vital.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic with a can-do attitude, have an eye for detail, enjoy working with systems, and have excellent organisational and relationship-building skills, these could be great opportunities for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please state your role preference within your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 4 with a full-time starting salary of £21,892, with a pay step increase after 3 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;Your formal office base can be either Piccadilly Place in Manchester or Regatta Place in Liverpool, however you may occasionally be required to travel across the North West region for either role.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gemma Bradshaw, Primary Care Programme Support Business Manager&lt;/p&gt;\n&lt;p&gt;Email: gemma.bradshaw@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3 Piccadilly Place, Manchester or Regatta Place, Liverpool", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Programme Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244122", "validThrough": "2020-11-10T23:59:59+0000"}