{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 (Band 5)"}}, "datePosted": "2020-11-03T12:36:53+0000", "description": "&lt;h1&gt;&lt;strong&gt;Isle of Wight NHS Trust&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Paediatric Nurses&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Children’s Ward / Paediatric Assessment Unit&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;£24,907-£30,615 (Band 5)&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Registered Nurse&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Part Time / Full Time&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The Isle of Wight NHS Trust is the only integrated acute, community, mental health and ambulance health care provider in England. The Isle of Wight, Britain&#39;s own island in the sun is located off the south coast of England and has a population of 138,000. It has much to offer in the way of outdoor leisure pursuits, family living and is also home to the annual music festival. It is a beautiful place to live and relax after work. Connections to the mainland are frequent, fast and efficient, with a choice of crossings via catamaran, hovercraft, or car ferry, from Southampton or Portsmouth, both of which are approximately 90 minutes by rail from London.&lt;/p&gt;\n&lt;p&gt;Paediatrics on the Isle of Wight consists of an Emergency Department, a Paediatric Assessment Unit, a Children’s Ward, an Outpatients Department, a Children’s Community Team and attached to the maternity wing is a 4 bedded SCBU; all within the Wessex and Thames Valley regional networks. We work closely as a multiple of teams to deliver care to the whole community on the Isle of Wight, which offers a wide variety of experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Nurse Post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for registered children’s nurses to join our children’s nursing team to contribute to the changing environment and perform at their very best, delivering high quality care to our children and their carers.&lt;/p&gt;\n&lt;p&gt;We would hope to appoint caring, compassionate paediatrics nurses with excellent communication and clinical skills. Applicants would get the experience of working within our Children’s Ward, Paediatric Assessment Unit and Surgical Day ward with opportunities to gain insight into other paediatric areas across the Trust. Educational opportunities would be available in conjunction with internal and external resources and an individual pathway will be set and reassessed to suit your individual needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newly Qualified PaediatricRegistered Nurses – Qualifying and obtaining NMC pin by October 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We now have the opportunity for Newly Qualified Band 5Registered Nurses to work on the Children’s Ward and gain experience across our paediatric services.&lt;/p&gt;\n&lt;p&gt;Applicants must be highly motivated and willing to learn. They must display excellent communication skills and offer care in a kind and compassionate manner, enjoying working in a changing and often challenging environment. The senior team will work by your side to provide an environment conducive to learning and will support you throughout your emerging career pathway. NQN’s have the opportunity to join the Wessex preceptorship programme that will be supported by us and the Wessex PIER Network team.&lt;/p&gt;\n&lt;p&gt;We would welcome your application and if you need any more details regarding these positions please feel free to make contact.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rachel Clark(Ward Manager Children’s Ward) on (01983) 532089 and email (rachel.clark24@nhs.net)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254001", "validThrough": "2020-11-17T23:59:59+0000"}