{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T14:16:03+0000", "description": "&lt;p&gt;This is a fixed term vacancy for 12 months. If you are a SBUHB employee you must seek your line manager&#39;s approval before applying for this post.&lt;/p&gt;\n&lt;p&gt;The Older Adult Inpatient Service is delighted to announce exciting opportunities for two motivated and enthusiastic Band 5 Assistant Psychologists. The posts are full time, fixed term for one year and are based in Tonna/Neath Port Talbot Hospital and Cefn Coed Hospital, Swansea. It is an exciting time of change for the service and the post holder will have the opportunity to contribute to inpatient provision and further development of a psychology service to older people living with mental health issues including dementia and their families, as well as working with clinical teams who support them.&lt;/p&gt;\n&lt;p&gt;The roles will provide the post holders with opportunities to gain experience and further develop their skills in: assessment (psychometric and neuropsychological) formulation, evidence based interventions (individually and in groups) and evaluation. There will also be opportunities to utilise and develop skills in research, audit and service evaluation.&lt;/p&gt;\n&lt;p&gt;The post holders will be supervised by a clinical psychologist and Swansea Bay Mental Health and Learning Disabilities Psychology has strong links with the South Wales Doctoral Programme in Clinical Psychology as well as the MSc in Clinical and Abnormal Psychology at Swansea University. Therefore, there will be opportunities for peer support.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Dr Sarah Collier&lt;/p&gt;\n&lt;p&gt;Sarah.Collier2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Kathy Williams&lt;/p&gt;\n&lt;p&gt;Kathy.williams2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neath Port Talbot, Tonna and Cefn Coed Hospitals, Swansea and Neath and Port Talbot", "postalCode": "SA11 3LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.68", "longitude": "-3.76548"}}, "title": "Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258061", "validThrough": "2020-11-15T23:59:59+0000"}