{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 per annum inclusive"}}, "datePosted": "2020-11-04T16:16:18+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Supply Chain Officer&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Great Ormond Street Hospitals Supply Chain department currently have a vacancy for a Supply Chain Officer to work in an evolving team delivering enhanced materials management services to a number of clinical areas including inpatient wards and theatres. &lt;br /&gt;&lt;br /&gt;Applicants must be able to demonstrate a sound understanding of basic materials management and the ability to learn new methods of working using varying ordering processes and technologies to control stocks to pre-set levels in line with the trusts agreed Supply Chain Process.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate that you are a good team player and able to work unsupervised in clinical based store areas. You must be able to demonstrate excellent customer service skills and the ability to react positively under pressure in a demanding environment.&lt;/p&gt;\n&lt;p&gt;You will need to be a highly motivated individual with exceptional organisational skills with a keen eye for detail. You must be able to demonstrate effective on the spot problem solving skills to ensure that all aspects of the supply chain work for the benefit of the trust in terms of supply and financial management. &lt;br /&gt;&lt;br /&gt;This is a full time post working 37.5 hours per week on rotational shifts which can be interchangeable to cover service requirements. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicole Grossman (Supply Chain Team Leader) on nicole.grossman@gosh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Supply Chain Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256593", "validThrough": "2020-11-18T23:59:59+0000"}