{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-28T11:15:24+0000", "description": "&lt;h2&gt;Practitioner Biomedical Scientist&lt;/h2&gt;\n&lt;p&gt;We are a busy clinical microbiology laboratory based in a large NHS Trust. The laboratory is well-equipped, with ISO:15189:2012 accreditation and training status with the Health Care Professions Council (HCPC). We have a workload of 700,000 tests per annum and offer a comprehensive range of tests in bacteriology, serology and virology, including molecular. In addition the department is testing around 3600 samples per week for Molecular CoVID19 and 1000 serology specimens.&lt;/p&gt;\n&lt;p&gt;We are looking for a Practitioner Biomedical Scientist to help us deliver accurate and timely microbiology services for patients and the staff caring for them. The post holder will rotate through the various sections of the laboratory including Bacteriology, Serology and Molecular. There will be an expectation for the successful candidate to work extended days and there may be a requirement for some overnight working in support of CoVID19 testing.&lt;/p&gt;\n&lt;p&gt;Responsibilities will include interpretation of bacterial cultures, the use of automated and semi-automated technologies, specimen processing, application of quality assurance procedures, computer data and result entry. In addition, the post holder will have a role in the training, development and supervision of other support staff.&lt;/p&gt;\n&lt;p&gt;As a Practitioner Biomedical Scientist you must have an IBMS approved degree and have completed the IBMS Certificate of Competence Portfolio and be a Registered Practitioner with the Health and Care Professions Council (HCPC). You must have evidence of clinical laboratory experience, be able to work accurately and methodically in an organised manner and be used to working with computers.&lt;/p&gt;\n&lt;p&gt;You must have excellent verbal and written communication skills with the ability to maintain high standards and keep up-to-date with advances in medical microbiology. It’s a great chance to gain further experience in all aspects of microbiology whilst rotating through all sections.&lt;/p&gt;\n&lt;p&gt;Working hours: 37.5 per week – shift pattern includes early shifts (08:00-16:00), core shifts (09:00-17:00) and late shifts (12:00-20:00). Weekend and Bank Holiday working will be required. In addition the Molecular Team are currently working a range of extended shifts from 07:00 to 23:00 seven days per week. The provision of a 24 hour testing service will become a requirement within the next few weeks.&lt;/p&gt;\n&lt;p&gt;Consideration will be given to staff who can fulfil part time hours, weekend only working or those who would like to work nights on a permanent basis.&lt;/p&gt;\n&lt;p&gt;These post are available for either internal secondment, or on a fixed term basis until 31st March 2021.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 11/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Practitioner Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246234", "validThrough": "2020-11-11T23:59:59+0000"}