{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806 Per annum pro rata"}}, "datePosted": "2020-11-02T13:16:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Consultant Haematologist based at Ysbyty Gwynedd, Bangor. We are seeking a dynamic individual committed to excellence in service delivery to join our team. All candidates should be competent in managing patients with haematological disorders, development of a speciality interest would be encouraged.&lt;/p&gt;\n&lt;p&gt;Betsi Cadwaladr University Health Board (BCUHB) is the largest health organisation in Wales. It provides a full range of primary, community, mental health and acute hospital services for a population of around 676,000 people across the six counties of North Wales (Anglesey, Gwynedd, Conwy, Denbighshire, Flintshire and Wrexham) as well as some parts of mid Wales, Cheshire and Shropshire.&lt;/p&gt;\n&lt;p&gt;The Health Board employs around 16,00 staff and has a budget of approx. £1.2 billion. It is responsible for the operation of three district general hospitals (Ysbyty Gwynedd in Bangor, Ysbyty Glan Clwyd near Rhyl, and Wrexham Maelor Hospital) as well as 18 other acute and community hospitals, and a network of over 90 health centres, clinics, community health team bases and mental health units. It also co-ordinates the work of 115 GP practices and NHS services provided by North Wales dentists, opticians and pharmacies.&lt;/p&gt;\n&lt;p&gt;The haematology service is constantly evolving and this post, in conjunction with existing and new posts, will support the development of the North Wales Haematology Service.&lt;/p&gt;\n&lt;p&gt;North Wales had some of the most beautiful countryside and scenery in Britain. It offers a myriad of opportunities for outside leisure interests such as cycling, sailing and other water-sports. Snowdonia National Park provides opportunities for walking, mountain biking and mountaineering. The area is also rich in history with many great castles, stately homes and gardens close by.&lt;/p&gt;\n&lt;p&gt;There are excellent road and rail links into the North West with easy access to both Liverpool and Manchester.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Earnest HeartinJob titleHaematology Clinical DirectorEmail addressearnest.heartin@wales.nhs.ukTelephone number01745448 790 extension 2933Additional contact information&lt;/p&gt;\n&lt;p&gt;Geraint Roberts&lt;/p&gt;\n&lt;p&gt;North Wales Cancer Treatment Centre General Manager&lt;/p&gt;\n&lt;p&gt;Tel: 01745 448239&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Gwynedd, Bangor", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Haematology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252197", "validThrough": "2020-11-30T23:59:59+0000"}