{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-11-06T12:09:14+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;em&gt;&lt;strong&gt;Previous Applicants need not apply.&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Development Hub Administrator, 37.5 hours per week (job share considered), 12 month fixed term contract or secondment opportunity &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The NHS and local authorities are working together to provider sustainable health and care services for people in Dorset.  The mechanism for driving this work forward is through our Integrated Care System. One of the biggest challenges is workforce; nationally and locally there is a shortage of clinical and care staff to recruit from.  The ‘Leading and Working Differently’ portfolio is one of the portfolios within our Integrated Care System and a dedicated Workforce Delivery Team has been established with a mandate to work with and on behalf of the individual organisations to improve the retention, attraction, recruitment and development of our current and future NHS and care workforce.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As one of the first Integrated Care System teams in Dorset, we are breaking new ground, challenging tradition by working with others to identify and overcome barriers and opportunities.  Our workforce is our biggest asset therefore we must involve them in the changes that we make, find new ways to retain and develop our people whilst attracting new people to work with us, including those who may not traditionally have chosen a career in health or care.    &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an Administrator to join the team, overseeing the administration processes within the Our Dorset Development Hub at West Moors in Wimborne.   &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you enjoy working with people and can you quickly build rapport?  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you have a business or training administration background and skills? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Can you solve problems and work efficiently?   &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you ready to learn and get to grips with new systems and processes?  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are up for a new challenge?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Finally, do you want to join a dynamic, ambitious, pioneering team? &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If so, then we would be interested to hear from you. If you would like further information and an informal conversation about the role contact Fran Pingarelli, Leadership and Talent Management Lead on 07966179033.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Moors", "postalCode": "BH21 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8374", "longitude": "-1.88272"}}, "title": "Our Dorset Development Hub Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259587", "validThrough": "2020-11-22T23:59:59+0000"}