{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-13T12:46:21+0100", "description": "&lt;p&gt;Staff nurse opportunities within general surgery have arisen at University Hospital Southampton NHS Foundation Trust (UHS) where our multi professional team is leading the way in providing high quality educated care for the general surgical patient.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a team we are seeking proactive, motivated registered nurses who are keen team players that strive to provide high quality patient care supported by a structured educational development plan. We embrace innovative thinking as we aim to deliver excellence in customer care, staff satisfaction and patient experience. CQC Rated in 2017 as Good through all domains.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our local and regional surgical specialties consist of upper and lower GI which includes a specialist intestinal failure unit supporting complex nutritional needs for specific patient groups. Hepatobilary and urology including a newly developing urology day unit which will transform patient pathways. Head &amp; neck including head &amp; neck acute assessment area and emergency surgery admissions consisting of our surgery emergency department (ASU) and acute admissions short stay (ASA). All patients are supported by an MDT approach ensuring timely reviews aiming to ensure patients within our care know their treatment pathways and likely discharge dates. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;WHAT YOU&#39;LL DO&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a band 5 surgical ward nurse you will be expected to&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plan, deliver and evaluate a high standard of care to our patients, families and carers using a systematic approach in accordance with agreed policies and within available resources.&lt;/li&gt;\n&lt;li&gt;Give and receive regular reports on the progress of patients&lt;/li&gt;\n&lt;li&gt;Liaise with all members of the multi-professional team&lt;/li&gt;\n&lt;li&gt;Recognise the deteriorating patient and escalate care needs&lt;/li&gt;\n&lt;li&gt;Maintain accurate records of observation, treatment and care.&lt;/li&gt;\n&lt;li&gt;Participate in the checking and administration of prescribed drugs&lt;/li&gt;\n&lt;li&gt;Demonstrate competence in administration of complex intravenous therapies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE&#39;RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate continuing professional development and have an understanding of how to improve and provide safe, quality care for patients and their carers/relatives. You must be an effective role model, adhering to the NMC code of conduct and trust policies and procedures, communicate efficiently advocating for your patients needs, escalating concerns as required and be able to exhibit your team ethic.&lt;/p&gt;\n&lt;p&gt;As the successful post holder you would be working closely with your ward leader, nurse practitioner, nurse specialist and consultant teams supporting the delivery of established patient pathways whilst supporting the development of new and innovative approaches to patient care.&lt;/p&gt;\n&lt;p&gt;The position is fully supported with clear band 5 development pathways, with access to MSC modules at Southampton University, allowing you to personally and professionally develop your nursing career.&lt;/p&gt;\n&lt;p&gt;If you believe you have the dedication and motivation to develop we would love to discuss this exciting opportunity with you further. Informal visits are strongly encouraged.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Attrill&lt;/p&gt;\n&lt;p&gt;Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;02381204488&lt;/p&gt;\n&lt;p&gt;lisaattrill@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff Nurse - Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224353", "validThrough": "2021-01-13T23:59:59+0000"}