{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-23T09:30:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Physiotherapist Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Rehabilitation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a qualified Physiotherapist looking to build on your experience? Are you looking for a role that offers job satisfaction? If you are, we have a position within our adult Integrated Care Team in Tendring North covering Walton, Frinton, Harwich, Manningtree, Weeley and surrounding areas.&lt;/p&gt;\n&lt;p&gt;We are recruiting an enthusiastic, forward thinking team player to join our dynamic Community Rehabilitation service. We are looking for a Physiotherapist who is motivated to achieve their full potential. Clear clinical reasoning and good assessment skills are essential. It is preferable that you have experience of working in a community setting although we would welcome applicants with all levels of experience. It is expected that you will have excellent communication skills, enjoy working with a variety of service users of different age groups, have good self management skills and an ability to prioritise your caseload.&lt;/p&gt;\n&lt;p&gt;You will be responsible for managing a wide caseload of conditions including neurological, orthopaedic (trauma and elective), respiratory and elderly rehabilitation. You will be working as part of an integrated team with Specialist Physiotherapists, Occupational Therapists, Associate Practitioners, Assistant Practitioners, and alongside Nurses, Community Matrons, and other specialist services.&lt;/p&gt;\n&lt;p&gt;This Integrated Care Team is busy and continues to give a high level of service to the patients within North East Essex. We have a high degree of diversity and specialism within our team. We offer a well-established supervision and appraisal structure and we have a firm commitment to CPD, evidence based practice, undergraduate and postgraduate education. We are an independent provider of the NHS Pension Scheme.&lt;/p&gt;\n&lt;p&gt;Anglian Community Enterprise is delivering one of England&#39;s largest current health care contracts to deliver Care Closer to Home. We are committed to offering the people of North East Essex an integrated and seamless network of patient-centred services based closer to where they live and in their communities wherever possible. As a result you will need to be flexible and may be required to work at various sites across North East Essex in line with service requirements. It is essential that you are a car driver.&lt;/p&gt;\n&lt;p&gt;Enquiries prior to interview are welcomed. For further information contact:&lt;/p&gt;\n&lt;p&gt;Jo Flaherty on 07766901527 or Johanna.flaherty@acecic.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions, cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;Working for ACE puts you right at the heart of all North Essex has to offer. If you are looking to re-locate to the area then we may be able to help with your moving costs. Further information can be found in the Relocation policy&lt;/p&gt;\n&lt;p&gt;Within Tendring you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK! Within a stone’s throw of Tendring is Colchester – Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after locations. In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clacton on Sea", "postalCode": "CO15 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8041", "longitude": "1.16672"}}, "title": "Physiotherapist, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239824", "validThrough": "2020-11-09T23:59:59+0000"}