{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 to 30,615.00"}}, "datePosted": "2020-10-26T14:47:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Speech and Language Therapist&lt;br /&gt;BAND 5&lt;br /&gt;LOCATION  Salisbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a positive, enthusiastic, motivated, Speech and Language Therapist keen to work in Wiltshire and be based in Salisbury? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?  Salisbury is a stunning medieval city surrounded by beautiful country side. Only 45 minutes from the Dorset coast and 2 hrs from London. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Speech and Language Therapist delivering NHS services with us you will receive Band 5 AfC 20/21 salary and terms and conditions  – including an NHS pension. We’ll provide you with access to a committed Learning and Development team. We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers including discounts on holidays. &lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health. All this, and flexible working patterns to help support your work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have a Degree Qualification in Speech and Language Therapy, a licence to practice with the Health and Care Professions Council, and be a registered member of the Royal College of Speech and Language Therapists.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Speech and Language Therapist you will offer support to children and young people, their families and other service users. You will reduce the impact of speech and language difficulties, to allow children to participate in daily life and inspire them to reach their full potential.&lt;/p&gt;\n&lt;p&gt;Working within the dynamic Wiltshire community paediatric team, you will&lt;em&gt; &lt;/em&gt;provide assessment and intervention for preschool and school aged children 0-19 years who experience speech, language, communication or swallowing difficulties. This is delivered within preschools, clinics, schools, and other community settings throughout Wiltshire, therefore owning and driving a car driver is essential.  Agile working is encouraged including some home working, the use of virtual consultations, as well as face to face appointments where appropriate.   &lt;/p&gt;\n&lt;p&gt;We are particularly keen to hear from qualified SLTs who have completed their RCSLT competencies and the salary is negotiable within band 5 for those with relevant experience. We also welcome newly qualified SLTs and offer a robust induction programme to develop professional competencies.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further please contact caroline.almeida@nhs.net or Alison.masero@virgincare.co.uk or phone 0300 247 0090. You’re welcome to come in for an informal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/p&gt;\n&lt;p&gt; Virgin Care partner with the NHS to make a real difference to people in Wiltshire and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview: Socially Distanced in Salisbury Tuesday 17th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury", "postalCode": "BA14 0XG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2988", "longitude": "-2.19642"}}, "title": "Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242981", "validThrough": "2020-11-09T23:59:59+0000"}