{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T15:46:34+0000", "description": "&lt;p&gt;This is an exciting opportunity to work as part of a child and adolescent mental health multidisciplinary team delivering high quality service provision that promotes and improves the mental health and wellbeing of children and young people and their families.&lt;/p&gt;\n&lt;p&gt;We are seeking an energetic, highly motivated and experienced Clinical Specialist Nurse who has the skills and knowledge in the assessment of children and young people and to deliver expert nursing care, advice and support to children and young people with mental health problems.&lt;/p&gt;\n&lt;p&gt;You must be an NMC Registered Nurse and possess a sound knowledge of child development and child mental health. You will work alongside our Multi-Disciplinary team of Child Psychiatrists, Clinical Psychologists, Psychotherapists, Nurses and Social Workers. You will be responsible for demonstrating excellent clinical outcomes, safe and effective delivery of care to children and young people.&lt;/p&gt;\n&lt;p&gt;You will be expected to manage your caseload effectively in order to improve the experience for the child and family, acting promptly on concerns, communicating effectively and sharing information appropriately within a multiagency context where collaborative working is key.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication and interpersonal skills, be flexible and able to use initiative. You will also need to be capable of working independently as well as pat of the wider CAMHS multidisciplinary team and be adaptable to the changing needs of the organisation and be able to work across disciplines.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBrian McGilliganJob titleCAMHS Community ManagerTelephone number01992 465 042&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rosanne House, Parkway, Welwyn Garden City, AL8 6HG, Welwyn Garden City", "postalCode": "AL8 6HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8032", "longitude": "-.208862"}}, "title": "Clinical Specialist Nurse - CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254629", "validThrough": "2020-11-17T23:59:59+0000"}