{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42642", "minValue": "39444", "unitText": "YEAR", "value": "£39,444 - £42,642"}}, "datePosted": "2020-10-29T10:43:40+0000", "description": "&lt;p&gt;We are looking for a highly motivated Clinical Nurse Specialist to lead our Rapid Assessment and Discharge Team based at Farleigh Hospice. &lt;/p&gt;\n&lt;p&gt;The Rapid Assessment and Discharge Team are dynamic and proactive working jointly with patients, their families and all agencies involved to facilitate timely discharge of patients from the acute hospital or hospice setting.  The primary aim of this team is to support people to safely move to their preferred place of care/death where possible. Additionally the team work alongside colleagues to assist in the avoidance of admission to hospital unnecessarily.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Farleigh Hospice is a high performing organisation providing specialist palliative care, and end of life care for people with life limiting illness in the Mid Essex region, and we have undergone a significant clinical reorganisation to move to a locality-based model of community care.  The localities are multidisciplinary, consist of a range of disciplines including nursing, therapy, medical, psychosocial, and care staff.&lt;/p&gt;\n&lt;p&gt;Based in a specific locality of Mid Essex, the extensive MDT will deliver holistic care to patients at all stages of end of life from ‘stable’ to ‘unstable, deteriorating and dying’ in line with the national palliative care classification.  The team will also provide essential support to carers and family members.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our IPU consists of 10 beds and provides an opportunity to deliver specialist palliative care to those with complex needs in the last days/weeks of life.&lt;/p&gt;\n&lt;p&gt;Our Rapid Assessment and Discharge Team work as part of our Core Team, who provide a core function of clinical support for our community based Locality Care Teams.&lt;/p&gt;\n&lt;p&gt;You will be an empathetic, clinical nurse specialist with excellent communication skills, have a passion for service improvement within healthcare.  You will build and maintain strong relationships with colleagues and other health professionals to deliver the best possible care for our patients ensuring Farleigh Hospice is as an integral part of the local health and care economy.&lt;/p&gt;\n&lt;p&gt;You will be supported by a dedicated clinical leadership team and have access to excellent education facilities to develop your skills and career. &lt;/p&gt;\n&lt;p&gt;In return, we offer a great working environment, a competitive pay and benefit package, flexible working and a strong team to support you.&lt;/p&gt;\n&lt;p&gt;If you are excited as we are about the role we look forward to hearing from you.  Please contact Dr Matt Sweeting at matt.sweeting@farleighhospice.org or telephone 01245 45731 for an informal discussion on the role.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Farleigh Hospice is an Equal Opportunities Employer. Farleigh Hospice operates a three month probation period. Positions may be subject to DBS Disclosure. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Charity Registration No: 284670&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Farleigh Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130116"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM1 7FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7765", "longitude": ".467758"}}, "title": "Clinical Nurse Specialist - Rapid Assessment and Discharge Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247947", "validThrough": "2020-11-12T23:59:59+0000"}