{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-15T09:32:02+0100", "description": "&lt;p&gt;&lt;strong&gt;HULL UNIVERSITY TEACHING HOSPITALS NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT IN NEONATES (10 PA’S)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an innovative colleague who are ready for a new challenge and who are prepared to contribute to shaping the future at Hull University Teaching Hospital NHS Trust. We have exciting opportunities for our Consultants in Neonates as we look to develop and expand our service in line with the Critical care Transformation Review fully supported by our Neonatal Network. Recruitment will also support the transition with forthcoming retirements and the clinical teams are currently looking for support from the Trust to expand this single post to 2. We want candidates to share our passion and to drive forward changes for the care of Neonates.&lt;/p&gt;\n&lt;p&gt;We would particularly welcome applications from candidates who have the skills to undertake Neonatal Echocardiography and who have formally begun to develop these skills. This would be to support the Neonatal Cardiology service within Hull for both inpatients and outpatient follow up to 1 year alongside the regional cardiology service.&lt;/p&gt;\n&lt;p&gt;It is anticipated in due course that the Neonatal Service will expand by a further full time post in addition to replacing consultants as they retire. The Healthgroup are looking for approval for a 2nd post at Executive level in order to support succession planning.&lt;/p&gt;\n&lt;p&gt;The Hull Women’s and Children’s Hospital on the Hull Royal Infirmary site was opened in 2003 and is one of the group of hospitals comprising the Hull University Teaching Hospitals NHS Trust. The hospital provides comprehensive tertiary services for Hull and East Yorkshire which has an extended population of approximately 1.2 million with approximately 6,000 deliveries per year in the hospital. The Hull Neonatal Service is a key partner in the Yorkshire Neonatal Operation delivery Network together with 3 other tertiary centres and is one of the 2 surgical units in the northern part of the network.&lt;/p&gt;\n&lt;p&gt;Visits and general expressions of interest by both telephone and email are welcome including from applicants wishing to consider a part time post.&lt;/p&gt;\n&lt;p&gt;For further information and informal discussions about the post applicants are invited to&lt;/p&gt;\n&lt;p&gt;contact Dr Joanna Preece, Consultant Neonatologist and Clinical Lead at Joanna.preece@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;or Dr Chris Wood, Consultant Neonatologist and Clinical Director at Chris.wood@hey.nhs.uk both on (01482) 607875.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Joanna PreeceJob titleConsultant Neonatologist and Clinical LeadEmail addressjoanna.preece@hey.nhs.ukTelephone number01482 607875Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Chris Wood, Consultant Neonatologist and Clinical Director at Chris.wood@hey.nhs.uk both on (01482) 607875.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Consultant Neonatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227505", "validThrough": "2020-11-15T23:59:59+0000"}