{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45998", "minValue": "40074", "unitText": "YEAR", "value": "£40,074 - £45,998 per annum (pro rata)"}}, "datePosted": "2020-10-27T08:45:21+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice. To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the HIV Section in the Division of Blood Safety, Hepatitis, Sexually Transmitted Infections and HIV at PHE. The postholder will be one of the senior scientists in the HIV Section responsible for overseeing the collection of national HIV surveillance data. The postholder will contribute to the management of the rollout of the new HIV and AIDS Reporting System (HARS) dataset to over 200 specialist HIV clinics, validating the data and ensuring high-quality data outputs to monitor the HIV epidemic and care provided nationally. The postholder will also lead on scientific outputs which drive the public health response to HIV within the UK and Europe. This work is essential in producing key public health outputs that inform HIV policy and prevention strategies.&lt;/p&gt;\n&lt;p&gt;The postholder will lead a small team and will require a strong understanding of complex databases, validation of data and public health analyses. Excellent written and oral communication skills are required and ability to quickly synthesise current knowledge and prepare scientific reports. Good project management and partnership skills are also necessary.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a strong interest in managing and building complex data systems and undertaking public health analyses and will be able to work well in a team with colleagues, both internal and external to PHE, as well as independently.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Brown, alison.brown@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, Colindale", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Senior HIV/STI Surveillance &amp; Prevention Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243737", "validThrough": "2020-11-10T23:59:59+0000"}