{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "Band 5: £24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-06T11:12:32+0000", "description": "&lt;h2&gt;&lt;span&gt;&lt;em&gt;*We can offer you a competitive salary, staff benefits package and excellent career development and training that comes from working for Wye Valley NHS Trust . In hard to recruit areas there is an additional payment of £1,000* as a Golden Hello for joining our Trust. T&amp;C’s apply*&lt;/em&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;* At Wye Valley NHS Trust we do not have a probationary period, we also have no limit on minimal hour contracts&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;STAFF NURSES FOR ROSS COMMUNITY HOSPITAL IN HEREFORDSHIRE&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;The key principles of Wye Valley Trust are to improve the health and well-being of the people we serve in Herefordshire and surrounding areas. &lt;br /&gt;&lt;br /&gt;We are looking for registered, experienced and newly qualified nurses to join our highly committed teams in an exciting and challenging time. &lt;br /&gt;&lt;br /&gt;We currently have vacancies in Ross Community Hospital.&lt;/p&gt;\n&lt;p&gt;If you are committed to providing the very best care for our patients then we would like to hear from you. We can offer you comprehensive training and the chance to focus on your chosen specialty.&lt;br /&gt;&lt;br /&gt;Ross Community Hospital vacancies: Tracey Ricketts or email tracey.ricketts@wvt.nhs.uk&lt;/p&gt;\n&lt;p&gt;If you are interested in joining us then please apply!&lt;br /&gt;&lt;br /&gt;We look forward to hearing from you! &lt;br /&gt;&lt;br /&gt;Please ensure when completing your application form that your references cover the last 3 years of employment and that they are provided by appropriate referees for example not work colleagues but from someone in a position of authority where you have previously worked.&lt;/p&gt;\n&lt;p&gt;For more information on Wye Valley NHS Trust please see additional documents.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herefordshire", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Staff Nurse - Ross Community Hospital WITH RECRUITMENT INCENTIVE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259357", "validThrough": "2020-11-20T23:59:59+0000"}