{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-30T07:52:17+0000", "description": "&lt;h1&gt;&lt;strong&gt;Band 6 Sister/Charge Nurse Permanent and secondment Position St James’s University Hospital, Ward J26, JAMA&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently looking for 2 dynamic self-motivated band 6 Sister/Charge Nurses to join our team on J26 at St James’s University Hospital. 1 permanent position and a 12 month secondment.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals to support the Matron and Senior Sister/Charge Nurses to ensure expert high quality care is delivered. If you have compassion, energy and a genuine dedication to patient care then we’d like you to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return we offer continual learning training and development opportunities to enhance and develop your skills and knowledge. You need to be a registered Adult nurse with a recognised teaching and assessing qualification.&lt;/p&gt;\n&lt;p&gt;You must possess a recent substantial Band 5 experience, with proven experience of leading and coordinating a department/ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Leeds Teaching Hospitals NHS Trust operates across two main sites with Emergency Care being provided on both the Leeds General Infirmary and St James’s sites. We see approximately 210,000 patients per year from a wide range of social and ethnic groups, making it one of the largest acute hospital trusts in England.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will cover a 24 hours rolling roster so therefore the successful candidate will be expected to work nights, weekends and Bank holidays.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be required:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To take direct managerial responsibility for the clinical area in the absence of or as delegated by the Senior Sister/Charge Nurse&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To lead and develop an identified team of nurses within J26, JAMA and frailty, ensuring professional development is maintained through timely specific Appraisal identified needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To act as a clinical resource within the J26&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To act as a positive role model&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will need to demonstrate recent change management and implementation, a clear understanding of Leeds Teaching Hospitals Key aims and objectives and a sound understanding of workforce management.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To have an understanding of the Emergency Care Standard (ECS) and an understanding of the ambulatory care model.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To have a good understanding of relevant local and national health agenda items&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates will have to ensure a high level of timely care is delivered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An informal visit to the department is recommended. To arrange this, or for more information, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Senior Sister Keely Vickerman&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Keely.vickerman@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;0113 2069126&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122056.jpg", "name": "Emergency & Specialty Medicine", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122056"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Sister/Charge Nurse (XR06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249321", "validThrough": "2020-11-13T23:59:59+0000"}