{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:32:16+0000", "description": "&lt;p&gt;&lt;strong&gt;For ward based registered nurses a trust allowance of £4,012 per annum will be paid in addition to your salary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation support is provided of up to £8,000 to help with buying or renting your new home&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rampton Hospital is one of only three high secure hospitals in the country providing a comprehensive range of highly specialised services to adult patients who experience a mental health problem, personality disorder or learning disability combined with a history of offending behaviour.&lt;/p&gt;\n&lt;p&gt;The hospital is host to a number of national high secure services including the national high secure service for women, the national high secure deaf service and the national learning disability service.&lt;/p&gt;\n&lt;p&gt;The services within the hospital provide a range of treatment pathways for both men with a diagnosis of learning disability and mental health problems and women with complex needs including enduring psychosis, trauma, personality disorder, offending behaviour and self-harm. A range of psychological, occupational, educational and vocational approaches will be available to support men and women through their recovery.&lt;/p&gt;\n&lt;p&gt;Our aim is to engage patients in a comprehensive assessment process and to support them as they progress through an individualised care package which is focussed on both providing care and treatment relating to the individual’s mental disorder and also addressing their offending behaviour.&lt;/p&gt;\n&lt;p&gt;We are currently seeking to recruit enthusiastic, flexible and creative Registered Mental Health Nurses (RMHN) and Registered Learning Disability Nurses (RNLD) to work within our inpatient services.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent interpersonal skills and an ability to work effectively as part of a multi-disciplinary team. You must be able to deliver high quality nursing care with a compassionate and caring attitude within a High Secure setting and be committed and motivated to providing innovative care.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will promote and maintain high standards of care through excellent communication, motivation, supervision and role modelling.&lt;/p&gt;\n&lt;p&gt;In return, successful applicants will, have the opportunity to gain a unique and varied experience of working within a range of diverse and highly specialised settings: and will have access to a competitive package of developmental opportunities which will be tailored to individual’s specific needs.&lt;/p&gt;\n&lt;p&gt;We welcome applications from newly qualified staff or those who are about to qualify, for whom there is an excellent preceptorship programme available.&lt;/p&gt;\n&lt;p&gt;You will be required to work on a rotational 24 hour shift pattern which include, days and nights when required. You will need to be flexible and work to the needs of the service .You will need to be a First Level Registered Nurse in Mental Health/Learning Disability and have evidence of working in clinical practice. You will be able to demonstrate previous involvement in the delivery of a high quality, effective service and you will require an enthusiastic and outcome focussed approach. You will need to be able to demonstrate an understanding of the specific profile and needs of forensic patients, previous experience in a secure setting would be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For nursing roles graduating in 2018/19; and gaining employment in the same financial year; the first year of professional member fees will be paid as incentive to employment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working to include long days&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our DBS check is free, you have no fees to pay!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGayle BennettTelephone number01777 248321&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rampton Hospital, Retford", "postalCode": "DN22 0HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2981", "longitude": "-.799982"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251814", "validThrough": "2020-11-12T23:59:59+0000"}