{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata pa plus Fringe HCAS"}}, "datePosted": "2020-11-06T11:00:30+0000", "description": "&lt;p&gt;Surrey Heartlands CCG are looking for an enthusiastic, organised individual to provide high quality support to the Delivery Unit Business Manager.&lt;/p&gt;\n&lt;p&gt;We have an ambitious vision for transformation and continuous improvement of health and care across our footprint. We are in the unique position of having secured a devolution deal, which for the first time really brings together health and social care by allowing us to commission from a single budget. We are also developing four dynamic and sustainable Integrated Care Partnerships (across East Surrey, Guildford and Waverley, North West Surrey and Surrey Downs localities) based on co-operation with our component partners, and focusing on local population needs, priorities and decision making.&lt;/p&gt;\n&lt;p&gt;In addition, we have responsibility, delegated from NHS England, for managing Primary Care contracts across the Surrey Heartlands footprint&lt;/p&gt;\n&lt;p&gt;Key responsibilities of role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Update, maintain and analyse information and complex and detailed programmes and reports, monitor and track risks and identify best practice&lt;/li&gt;\n&lt;li&gt;Prepare complex papers and provide specialist advice and guidance on functional and information matters and support the development of internal and external communications&lt;/li&gt;\n&lt;li&gt;Check and process invoices, achieve quality outcomes and strive to deliver value for money and greater efficiency across programmes and contracts managed.&lt;/li&gt;\n&lt;li&gt;Provide and manage information management processes, carry out information analysis and reporting and be responsible for the development and maintenance of databases&lt;/li&gt;\n&lt;li&gt;Support and contribute to the development of key performance indicators for programme of work and test and support the development of business cases&lt;/li&gt;\n&lt;li&gt;Contribute to the management and coordination of the system recovery plan, development of measurable performance outcomes and formulation of plan of recovery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ideal candidate for this opportunity will be a highly motivated, flexible and enthusiastic individual who has first class communication, organisation and prioritisation skills with the ability to work under pressure, planning and co-ordinating a demanding workload in order to meet tight deadlines as well as being able to work independently and as part of a team.&lt;/p&gt;\n&lt;p&gt;We would warmly welcome any questions about this opportunity - please contact Sajid Shah (details on the right), in the first instance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "to be agreed - home working during Covid", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "Delivery Unit Business Manager Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259324", "validThrough": "2020-11-20T23:59:59+0000"}