{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-10-28T10:16:55+0000", "description": "&lt;p&gt;We are looking for dynamic Bank Physiotherapists with good communication skills, enthusiasm and flexibility to join us to work with our patients in the Macclesfield area of East Cheshire.&lt;/p&gt;\n&lt;p&gt;With COVID-19 continuing to impact on health care provision, we are expanding our capacity over the winter period and need your support to continue to deliver excellent care to our patients.&lt;/p&gt;\n&lt;p&gt;We are looking for a group of bank Physiotherapists with HCPC registration and a passion for rehabilitation, to join our temporary workers. You will have sound clinical skills in the assessment and rehabilitation of patients. As a flexible Bank worker, you are employed on an ‘as and when required’ basis or there may be an opportunity for a fixed term contract, whichever suits you.&lt;/p&gt;\n&lt;p&gt;You would join our band 5 rotation wherever there was a need. Areas covered include Orthopaedics, Surgery, Medicine, bed-based IMC, Frailty, Neuro OP and MSK.&lt;/p&gt;\n&lt;p&gt;There is opportunity for CPD and in-service training and supervision from experienced senior Physiotherapists.&lt;/p&gt;\n&lt;p&gt;This post is Bank&lt;/p&gt;\n&lt;p&gt;Hours per week: Bank&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ros Hope Job title Therapy Team Manager Email address roshope@nhs.net Telephone number 01625 661488&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Rachel Pepler&lt;/p&gt;\n&lt;p&gt;r.pepler@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 01625 661488&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Bank Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246031", "validThrough": "2020-11-11T23:59:59+0000"}