{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-15T12:01:51+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a motivated band 5 staff nurse to join the highly skilled/ dedicated ophthalmic surgical team. This will be a full time vacancy working in The Ophthalmic Surgical theatres. Working hours include Monday- Friday 7.30 am-7.00 pm over a 4- 5 day period. This post will also include on call cover during weekends, evening and bank holidays.&lt;/p&gt;\n&lt;p&gt;The ophthalmic surgical unit provides sight saving treatment for people across Lancashire/ Cumbria and beyond using state of the art facilities designed with high quality patient focused care at the forefront.&lt;/p&gt;\n&lt;p&gt;The Ophthalmic surgical unit is a specialised department which integrates The Medical Retina Unit, macular service, two theatres a recovery area and an ophthalmic day surgery ward offering a number of clinical settings within the unit. The department is considered one of Blackpool Victoria Hospitals greatest assets treating up to 11,000 patients annually.&lt;/p&gt;\n&lt;p&gt;As an integral member of the team you would be involved in procedures such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Retinal detachments (PPV)&lt;/li&gt;\n&lt;li&gt;Cataract surgery&lt;/li&gt;\n&lt;li&gt;Plastic surgery&lt;/li&gt;\n&lt;li&gt;Biopsies&lt;/li&gt;\n&lt;li&gt;Laser eye surgery&lt;/li&gt;\n&lt;li&gt;Emergency and trauma surgery&lt;/li&gt;\n&lt;li&gt;Due to restructuring within the unit in an attempt to grow our expanding service we require a passionate and positive individual who have pride and joy in their work. The ideal candidate would receive full on the job training in a supportive environment with a team that values you. We also offer:&lt;/li&gt;\n&lt;li&gt;A structured mentorship programme, supportive of individuals learning strategies and needs&lt;/li&gt;\n&lt;li&gt;Encouragement for staff to take on projects to take the department forward, where each contribution is valued.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola KirbyJob titleOphthamology Unit MangerEmail addressnicola.kirby@nhs.netTelephone number01253 957421Additional contact information&lt;/p&gt;\n&lt;p&gt;We would welcome anyone interested in this post, to have an informal visit. To arrange this please bleep via switchboard 01253 300000 bleep 498. Alternatively contact Carol Higgins Ophthalmology Clinical Matron on 01253 300000 bleep 316&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Ophthalmic Scrub Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228088", "validThrough": "2020-11-12T23:59:59+0000"}