{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa/pr"}}, "datePosted": "2020-10-21T08:45:16+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;&lt;strong&gt;Integrated Safeguarding Team Manager &amp; Named Nurse&lt;/strong&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an enthusiastic, passionate and knowledgeable practitioner to join a committed Corporate Safeguarding Team as Named Nurse for Safeguarding Children and Adults within City Health Care Partnership Community Interest Company.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are encouraged from those that have significant safeguarding children experience to ensure the delivery of this statutory role. As part of the Integrated Safeguarding Team, the post holder will develop and support the delivery of the Child Safeguarding agenda, in addition to supporting a think family approach with safeguarding adults activity. As the Named Nurse you will be able to share, retain and enhance your current specialist expert skills along with developing new ones as we continually strive to develop the safeguarding agenda to enable excellent safe care for our clients and families.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be joining a committed hardworking and progressive team including an Adult, MCA and DoLS Professional, and Safeguarding Specialists from a range of backgrounds including Adults, Children, and Social Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will work to develop and provide specialist safeguarding support, to ensure Section 11 of the Children&#39;s Act is continually met, support the delivery of safeguarding supervision, advice, guidance and training relating to the whole Safeguarding agenda. A significant element of the role will be supporting the safeguarding advisers, delivering training, and report writing. Travel in and around the geographical area is expected. The Named Nurse will be expected to contribute to working in partnership within a multi-agency arena ensuring effective communication, the dissemination of learning and collaboration.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder must be a registered Nurse, hold the essential qualifications and have relevant and significant safeguarding experience as listed in the personal specification. The post holder will be passionate about the safeguarding agenda, be flexible in their work approach, and possess excellent communication and interpersonal skills as well as the ability to work well both independently and within an integrated team.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124994.jpg", "name": "City Health Care Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Business Support Centre, 5 Beacon Way, Hull", "postalCode": "HU3 4AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7302", "longitude": "-.374505"}}, "title": "Integrated Safeguarding Team Manager &amp; Named Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235565", "validThrough": "2020-11-08T23:59:59+0000"}