{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-20T13:31:02+0100", "description": "&lt;p&gt;&lt;strong&gt;Community-based - will need driving licence &amp; access to a car.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suitable for newly qualified&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our Evening Team who visits complex patients across the city. This role is ideal for candidates who are looking for a position that supports flexible working. We are looking for a group of highly motivated applicants who are interested in meeting the challenge of working in the community with patients in the home setting working within the Evening Service Team. The evening service team covers the city of Birmingham, working within localities across the city. The centralised hub is based at Priestly Wharf. The service operates between the hours of 6 pm to 10:30pm over 7 days per week and the working pattern for the successful candidate will include weekend working and bank holiday periods with flexibility on the number of evenings to be worked. This post requires the successful candidates to be highly mobile so requires a full driving licence and car available for work.&lt;/p&gt;\n&lt;p&gt;You will be working with a variety of disciplines within the multidisciplinary team to achieve the best outcomes for patients to ensure their independence and well being. The post holder will carry out a variety of nursing duties as part of the patients holistic care management through the assessment and evaluation of health needs particularly in the areas of palliative care, wound management, diabetes and other long term conditions. The evening service visit both planned patients and also visit emergent visits, such as palliative patients requiring support. Training and development will be provided to support successful candidates in achieving competence in these areas with access to training within the evening.&lt;/p&gt;\n&lt;p&gt;Vacancies available within Birmingham Community Healthcare NHS Foundation Trust on a permanent basis.&lt;/p&gt;\n&lt;p&gt;For more information or to arrange meeting the team please email Tabitha.lloyd@bhamcommunity.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 5 Community Staff Nurse - Evening Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234581", "validThrough": "2020-11-08T23:59:59+0000"}