{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T08:45:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Scheduled and Planned Care Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Eating Disorders Specialist Clinician &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;(Fixed term Contract for one year)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 6 £31,365 - £37,890 pa (dependent on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: St George’s Community Health Centre &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hours: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Ref: 457-20-101-QN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be hosted by Sheffield Eating Disorders Service, one of the 3 involved provider organisations on behalf of the Partnership delivering the Sheffield All Age Eating Disorder Service. The partnership also includes South Yorkshire Eating Disorders Association and Sheffield Child and Adolescent Mental Health Service (CAMHS) The post holder will work across each organisation to meet the needs of the new All Age Eating Disorder (AAED) Pathway.&lt;/p&gt;\n&lt;p&gt;Sheffield Eating Disorders Service provides out and day patient care to young people and adults with moderate to severe eating disorders. The Service offers specialist assessment and evidence based treatment interventions which aim to support the service user to work towards recovery. Day treatment may also be offered if the service user requires more intensive intervention. The Service also liaises with medical and specialist units if in patient care is required.&lt;/p&gt;\n&lt;p&gt;Description of the Team/responsibilities/duties of the role &lt;br /&gt;The post holder will participate in daily triage of referrals and offer both routine and urgent assessments on a weekly basis. The post holder will work closely with the MDT to develop appropriate care plans for service users who have been assessed and liaise with other parts of the pathway, broader Mental Health services and Primary Care. The post holder will deliver therapeutic interventions e.g. CBT/ Motivational work or other interventions dependant on skills and experience.&lt;/p&gt;\n&lt;p&gt;Mental Health professional qualification e.g. First level professional qualification in Mental Health Nursing or Diploma/degree in Occupational Therapy or Social Work qualification. Previous work experience in mental health setting &lt;br /&gt;Training in CBT, motivational interviewing or other therapeutic approach. Evidence of post qualification training or further study. Knowledge of or work experience with people with eating disorders&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S3 7ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3837", "longitude": "-1.48855"}}, "title": "Eating Disorders Specialist Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247655", "validThrough": "2020-11-15T23:59:59+0000"}