{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Equivalent o Band 5"}}, "datePosted": "2020-11-03T08:25:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse| Band 5 | Flexiable working |Excellent development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Hospital Manchester has an exciting opportunity for a number of ambitious, focused Staff Nurses to join our expanding team. Working on our busy surgical ward you will provide first class post-surgery care to our patients. We undertake a wide range of operations, including Orthopaedics, ENT and Gynae.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Manchester Hospital is a brand new, £65m state-of-the-art healthcare facility offering patients a wide range of integrated surgical, medical and diagnostic services. The rapidly expanding team in Manchester consists of over 500 colleagues, who thrive in the welcoming atmosphere that is friendly, supportive and progressive.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will provide post-operative care to our patients, assisting in their recovery and getting them ready for discharge – this will include wound care, assisting with personal care and providing emotional support at what can be a stressful time. You will liaise with patients, their families and consultants giving advice and making recommendations to improve the patients’ wellbeing, whilst also being adept at identifying a deteriorating patient and making on the spot, informed decisions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse used to working with minimum supervision and experience of working in an Acute environment.&lt;/li&gt;\n&lt;li&gt;A surgical background is desirable but we are happy to consider Nurses with an interest in developing their experience in this field.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;p&gt;Competitive hourly rate &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Save an average of £50 per month with our free onsite car park&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet under ‘’additional information’’ for more details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or if this job isn&#39;t quite right for you but you are looking for a new position, please contact Claire Murphy email claire.murphy@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us,it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M20 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4149", "longitude": "-2.23507"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253152", "validThrough": "2020-11-17T23:59:59+0000"}