{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-28T12:17:13+0000", "description": "&lt;p&gt;Senior Managers at NHS England and NHS Improvement include finance professionals, management consultants and economists and come from a range of backgrounds including financial services firms, the health sector, large commercial organisations and regulatory bodies. They bring to the role critical thinking and governance. If you wish to challenge yourself, make a positive impact in patient care, whilst also benefiting from a healthy work life balance, our Senior Manager posts within Provider Development may be the opportunity for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Provider Development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Provider Development directorate works with regional teams, local health systems and the provider sector to ensure that we have strong and successful providers, working collaboratively within strong and successful systems, in the best interests of local patients, populations and staff. The Provider Transformation team works closely with NHS providers and with the regional teams across the areas of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Diligence and assurance of complex provider to provider transactions;&lt;/li&gt;\n&lt;li&gt;Supporting NHS providers and systems to diagnose the challenges facing them and to develop and deliver solutions for the delivery of sustainable services such as via joint management across trusts or developing strategic options for unsustainable providers; and&lt;/li&gt;\n&lt;li&gt;Developing the future provider landscape, for example designing new organisational forms to support greater collaboration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Manager, you will support Directors by leading on project workstreams and presenting findings in a logical and convincing way that is tailored to appropriate audiences and takes account of political sensitivities. This will include commissioning and working with Senior Analysts to undertake analytical work relating to the diagnosis, solutions development, regulatory strategy, assurance and oversight at provider and systems level.&lt;/p&gt;\n&lt;p&gt;Our approach is based on team and project working using a pool-based resourcing model; this enables people to work both on different types of projects and with different people within the team combined with the benefits of having an individual based line management approach.&lt;/p&gt;\n&lt;p&gt;Although based in Skipton House (London), team members are currently working remotely from home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Educated to Masters level or equivalent level of experience of working at a senior level in a specialist area, you will be a strong strategic thinker with a proven track record in more than one of the following: identifying key risks/areas for improvement; reviewing historical and forecast financial performance and financial positions; and presenting findings at a senior management or Board level.&lt;/p&gt;\n&lt;p&gt;In the past, successful candidates have had experience working in a professional, client facing role in strategy, governance, mergers and acquisitions, transaction services or similar. We welcome applicants with alternative, relevant experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;And in return&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Provider Transformation is a friendly and supportive team, and we are committed to supporting team and personal development. The team supports a range of flexible working patterns and aims to achieve a positive work-life balance while delivering an ambitious agenda.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virtual interviews will take place over the week 2-9 December 2020. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A virtual information evening will be held in the week commencing 9 November 2020 to provide more information on the team and the role. If you are interested in attending this, please contact David Lane (david.lane6@nhs.net).&lt;/p&gt;\n&lt;p&gt;Applications will be shortlisted based on the criteria set out in the job description below. Shortlisted candidates will be invited to submit a written response to a case study and to take part in an interview conducted online.&lt;/p&gt;\n&lt;p&gt;The case study exercise will set out a hypothetical scenario and ask the candidate to provide written answers to various questions, this is intended to simulate the type of work undertaken by Senior Managers.&lt;/p&gt;\n&lt;p&gt;The online interview will take one hour and will be conducted by three interviewers. The interview will include discussion of the candidate’s written case study responses as well as various competency based and technical questions to help us understand the candidate’s experience of the type of work undertaken by Senior Managers.&lt;/p&gt;\n&lt;p&gt;We aim to be an inclusive team which recognises that people have a wide range of lived experience and obligations beyond work. We would encourage anyone that matches the person specification to make an application. However, we recognise that sometimes people have a question about working in our team that is not covered in the job description or person specification. If you have a specific question, or concern, you would like to discuss informally before you make an application to join the team and understand how we are supporting inclusivity, please contact David Lane (david.lane6@nhs.net).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDavid LaneJob titleHead of Business OperationsEmail addressdavid.lane6@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Provider Transformation Senior Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246549", "validThrough": "2020-11-18T23:59:59+0000"}