{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T12:01:02+0000", "description": "&lt;p&gt;We are looking for a dynamic and motivated individual to expand our current Diabetes and Endocrinology Consultant team here at Tameside and Glossop Integrated Care NHS Foundation Trust. The post holder will join a team of 1.4 WTE consultants, Specialist Registrar, CMT and Foundation Doctors as well as Diabetic Specialist Nurses, High Risk Foot Podiatrists and a Diabetes Dietitian. The department offers a complete service to the residents of Tameside and Glossop. Consultants predominantly work at a single site which is the main acute hospital but carry out some clinics in the Primary Care Centre. The service includes general Diabetes and Endocrinology adult clinics, High Risk Foot clinics, Paediatric Transition clinics, Antenatal clinics and insulin pump clinics&lt;/p&gt;\n&lt;p&gt;The department benefits from good working relationships across the Integrated Care Organisation, including with GPs and Practice Nurses, the Orthopaedics and Vascular teams and liaising closely with the Paediatric and Antenatal Departments to ensure good quality joint care.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to drive improvement in the service as required by patients, staff and the government, and to promote best practice in the management of all cases. The role will also include driving improvement in the service by facilitating training to junior doctors, assisting in pathway design to enhance the Diabetes and Endocrinology service offered to the local community. We are also keen to support any special interests that applicants may have been working towards.&lt;/p&gt;\n&lt;p&gt;This post represents an exciting opportunity to join one of the pioneering integrated care organisations in the country which is transforming the way care is delivered to improve the health of the population it serves. Not only does this post provide exposure to a variety of clinical settings but also the opportunity to be at the core of transforming our services to provide a truly integrated model of health care to our population.&lt;/p&gt;\n&lt;p&gt;Tameside &amp; Glossop Integrated Care NHS Foundation Trust is one of the first organisations providing fully integrated health and social care in the country. The main acute hospital site, known locally as Tameside Hospital, is based in Ashton-Under-Lyne serving the needs of approximately 250,000 people.&lt;/p&gt;\n&lt;p&gt;As a forwarded thinking trust we are continually striving to deliver clinical excellence to our patients. Your experience and enthusiasm will be supported by our skilled team of clinical staff alongside dedicated and trained diabetes nurses and podiatrists.&lt;/p&gt;\n&lt;p&gt;Everyone at Tameside Hospital has absolute commitment to the delivery of high quality services for our patients, and for the right to be treated with dignity and respect. Our mission is to work with colleagues, patients, carers and the wider public to ensure that at our hospital, Everyone Matters. Safety, Care, Respect, Communication and Learning are values and behaviours which underpin our actions and guide us through our improvement journey. Having gone through a period of intense scrutiny and special measures Tameside is now proud to announce the overall CQC rating as a GOOD organisation with the Division of Medicine receiving a rating of Outstanding in the Responsive domain.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Please note: interviews will be held on Tuesday 3rd November 2020.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Alison Marsh&lt;/p&gt;\n&lt;p&gt;Job title Directorate Manager&lt;/p&gt;\n&lt;p&gt;Email address Alison.Marsh@tgh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 922 4715&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Professor Ed Jude, Consultant in Diabetes and Endocrinology - Edward.Jude@tgh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashton under Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Consultant - Diabetes and Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244372", "validThrough": "2020-11-22T23:59:59+0000"}