{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-03T09:46:35+0000", "description": "&lt;p&gt;Do you have excellent interpersonal skills and love helping people? Would you like to further your skills by working autonomously, providing rapid assessment of complex patients to our partner organisations? If so we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;We are transforming clinical care to care homes across Hampshire and the Isle of Wight with our new service Telemedicine.&lt;/p&gt;\n&lt;p&gt;The aim of the Telemedicine is to provide remote clinical care to support residents in their care home. The service will be starting with a phased approach and will gradually increase the number of homes it supports.&lt;/p&gt;\n&lt;p&gt;This is an innovative clinical project and the post-holders will be required to actively engage with hospital staff, community teams and key stakeholders as well as care homes.&lt;/p&gt;\n&lt;p&gt;You will carry out a complete virtual and holistic assessment of the patient by utilising the available technology, as well as capturing data and outcomes.&lt;/p&gt;\n&lt;p&gt;Every member of the team will help us shape our service and achieve successful implementation along with long term sustainability; it really is an exciting time to join us.&lt;/p&gt;\n&lt;p&gt;The Telemedicine project has been supported by NHS digital funding and you will be working within an enthusiastic team with a desire to improve patient outcomes and establish a successful STP wide service improvement.&lt;/p&gt;\n&lt;p&gt;This post is offered as a fixed term or secondment with a view to becoming substantive at the end of the pilot process. The post is based at RHCH Winchester but occasional travel may be required for external meetings. There is an inter-site minibus for transfers between RHCH and BNHH Basingstoke.&lt;/p&gt;\n&lt;p&gt;We welcome questions and informal discussions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sam Jackson&lt;/p&gt;\n&lt;p&gt;Sam.jackson@hhft.nhs.uk 01962 824051&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hampshire County Hospital, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Senior Clinical Assessor - Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253326", "validThrough": "2020-11-17T23:59:59+0000"}