{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-02T14:01:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Early In Psychosis Service Halton &amp; Warrington, as a Support Time Recovery Worker.&lt;/p&gt;\n&lt;p&gt;In May 2019, NHS England and NHS Improvement released an opportunity to bid for transformational funding to transform adult community mental health crisis care services. This opportunity is specifically aimed at achieving the ambitions of the Five Year Forward View for Mental Health, and the NHS Long Term Plan. North West Boroughs Healthcare were part of a successful bid for this funding and as a result we now have more opportunities to recruit Support, Time and Recovery (STR) Workers to our Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate an attitude which respects and values service users’ and their carers and support the Trust’s values. They will also embrace the core values of the organisation and adopt the principles of Recovery. These principles will recognise the need to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Promotes safe practice&lt;/li&gt;\n&lt;li&gt;Value the aims of service users&lt;/li&gt;\n&lt;li&gt;Work in partnership and offer meaningful choice&lt;/li&gt;\n&lt;li&gt;Be optimistic about the possibilities of meaningful change&lt;/li&gt;\n&lt;li&gt;Value social inclusion&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In this role, you will provide NICE Concordant Care for psychosis for those aged between 14-65 who are experiencing their first episode of psychosis or are identified to have an at risk mental state. You will undertake specialist assessments, facilitate care coordination and work as a member of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop your knowledge, skills and experience within a supportive multi-disciplinary Team. You will have access to relevant training opportunities, with ongoing supervision and support.&lt;/p&gt;\n&lt;p&gt;The service runs Mon - Fri 9 am - 5 pm and your office base will be St Johns Unit Widnes, covering both Halton &amp; Warrington Localities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT: &lt;/strong&gt;The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;If you require to travel across the Merseygate Way Bridge to commute to the work base the Trust are unable to reimburse this payment. (All crossing during work hours will be reimbursed).&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with adults and children&#39;s barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Smith - Support Time Recovery Worker&lt;/p&gt;\n&lt;p&gt;stephanie.smith3@nwbh.nhs.uk / 0151 422 6826&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Johns Unit, Widnes, Cheshire", "postalCode": "WA8 7QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3611", "longitude": "-2.73141"}}, "title": "Support Time Recovery Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252331", "validThrough": "2020-11-09T23:59:59+0000"}