{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29608", "minValue": "23023", "unitText": "YEAR", "value": "£23,023 to £29,608 pa"}}, "datePosted": "2020-11-06T11:16:17+0000", "description": "&lt;p&gt;&lt;strong&gt;We&#39;re currently not recruiting overseas nurses - must have NMC Registration&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 – Nurse – Winter Pressures&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As winter approaches, the NHS comes under unprecedented pressure, with rising numbers of patients needing hospital care. We are therefore now recruiting for a number of Band 5 - Nurses to join Winter Squire which will be our extra capacity ward area to support winter pressures.&lt;/p&gt;\n&lt;p&gt;The position will be based on Winter Squire Ward which will be an extra capacity 15 bed medical ward opening from October 2020 to End March 2021. There is likely to be a mixed speciality and variety of patients due to this. This will be an excellent environment to build your knowledge and develop your skills as a Nurse. Successful candidates will be aligned with a base ward prior to starting which they will be deployed to when Squire is closed. We will be accepting applications from both experienced and newly qualified nurses. You will be working with a seconded senior team of a Ward manager and Band 6s.&lt;/p&gt;\n&lt;p&gt;You must be a compassionate and dynamic person who thrives in a busy, fast paced environment. You must have excellent communication and adaptability skills and up for a challenge and enjoy an environment where every day is different.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will consider flexible working including permanent nights or days, fixed patterns, part time at a minimum of 22.5 hours a week. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We fully support learning and educational environment to ensure all employees have the right skills and knowledge to carry out their roles competently. Newly Qualified nurses will have access to the preceptorship scheme. We also fully engage in development and promote career progression internally.&lt;/p&gt;\n&lt;p&gt;At the end of the winter period staff we be redeployed to ward areas where there are vacancies. Preference areas will be taken into consideration however this will be dependent on where vacancies are with the Trust site based at Warwick Hospital.&lt;/p&gt;\n&lt;p&gt;We think South Warwickshire NHS Foundation Trust is a great place to work, we hope you will too.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information contact Claire Hawkins 01926 495321 ext. 8437 or 07887628247.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire HawkinsJob titleSenior HR AdvisorEmail addressclaire.hawkins@swft.nhs.ukTelephone number01926 495321 ext. 8437 or 07887628247Additional contact information&lt;/p&gt;\n&lt;p&gt;For more information contact Claire Hawkins 01926 495321 ext. 8437 or 07887628247.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Nurse – Winter Pressures - Squire Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259385", "validThrough": "2020-11-22T23:59:59+0000"}