{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-26T13:00:18+0000", "description": "&lt;p&gt;Commisioning &amp; Delivery Manager&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NHS Tees Valley Commissioning Group is led by an ambitious Clinical and Management Team committed to improving health outcomes for the people of all localities across the Tees Valley whilst delivering challenging Service Improvement and Efficiency Plans (QIPP – Quality, Innovation, Productivity and Prevention). &lt;br /&gt; &lt;br /&gt; We have an ambitious transformation programme led by clinicians, and are committed to working with partners and stakeholders to deliver the work program through innovative commissioning approaches, which will improve quality outcomes, release inefficiencies and make a real difference to patient care. The CCG is coterminous with five Local Authorities: Darlington Borough Council, Hartlepool Borough Council, Middlesbrough Borough Council, Redcar and Cleveland Borough Council and Stockton-on-Tees Borough Council who we work in close partnership with.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to work as a Commissioning and Delivery Manager within Tees Valley CCG, we require a candidate who is committed to delivering a transformation agenda of high quality care. The candidate must be able to demonstrate extensive experience of multi-agency and partnership working at a senior level including experience of commissioning services, performance and change management of service provision, service redesign processes and QIPP methodologies. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A clinical background is not essential but would be advantageous in relation to the post. The focus of the candidates’ portfolio is expected to primarily be across the Cancer, End of Life and Prevention agendas. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The candidate should also be able to demonstrate outstanding leadership, influencing, innovation, communication and interpersonal skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The interviews will take place on 16&lt;span&gt;th&lt;/span&gt;, 17&lt;span&gt;th&lt;/span&gt; and 18&lt;span&gt;th&lt;/span&gt; November.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England CCGs", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Middlesbrough", "postalCode": "TS3 6AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5717", "longitude": "-1.21635"}}, "title": "Commissioning &amp; Delivery Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242541", "validThrough": "2020-11-09T23:59:59+0000"}