{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13000", "minValue": "13000", "unitText": "YEAR", "value": "£13,000 per annum"}}, "datePosted": "2020-10-29T15:01:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Non Executive Directors: James Paget University Hospitals NHS Foundation Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Time commitment: minimum of 3-4 days per month, various days as required&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Term of office: 3 years&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Remuneration: £13,000 pa&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking two new Non Executive Directors with experience of engaging with diverse social, economic and cultural groups, managing transformational change and the adoption of innovations, who can help us become outstanding in every way. This is an exceptional opportunity to share your talents and expertise to make a positive difference to the lives of people served by the Trust.&lt;/p&gt;\n&lt;p&gt;It is an exciting time for our hospital. Our talented Chief Executive, Anna Hills, has been in post just over a year supported by a highly capable executive team. We are playing a major role in developing integrated care in the Norfolk and Waveney Health Partnership and promoting provider collaboratives to deliver a range of sustainable services across the system, to improve quality and reduce inequity. This includes linking more closely with community services, GPs, local councils and the voluntary sector.&lt;/p&gt;\n&lt;p&gt;Of course we face challenges, not least the ongoing Covid 19 pandemic and the additional pressures that this has brought to bear on the delivery of safe and timely acute services to our communities. However, despite these difficulties, we are seizing the opportunities to improve and develop, maximising digital working, building a just, compassionate culture in our organisation and living up to our values of &lt;em&gt;We care for our patients, each other and ourselves&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;Most excitingly, we have recently secured the funding to completely rebuild the hospital and have long term plans to digitalise all patient records across the system – two incredibly complex projects that require considerable additional operational resources as well as Board level governance and assurance. This is a once in a generation opportunity that we must deliver well to ensure our services can meet the needs of our communities in the longer term.&lt;/p&gt;\n&lt;p&gt;You will need to have a genuine commitment to patients and the promotion of excellent health care services. It is likely that you will have senior level experience gained in complex situations and large organisations. Some personal authority and confidence would be essential as our new Board members would be expected to chair groups and lead committees as required.&lt;/p&gt;\n&lt;p&gt;You will extend and challenge our Board’s thinking, especially over diversity and ways in which we tackle inequalities. Great Yarmouth and its surrounding areas have a rich background of cultures and we are committed to ensuring our organisation reflects this at all levels. For both roles we welcome those with lived experience or people who have engaged with diverse social, economic and cultural groups, particularly the black, Asian and minority ethnic communities, those people living with disabilities and the LGBT+ community. This may have been gained through links with the voluntary or not for profit sectors, community involvement or business initiatives.&lt;/p&gt;\n&lt;p&gt;Whatever your background, you must live in Norfolk or Suffolk and be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;passionate about quality of care and patient experience&lt;/li&gt;\n&lt;li&gt;an excellent communicator with a talent for influencing change&lt;/li&gt;\n&lt;li&gt;a good listener, able to relate to groups and individuals at all levels&lt;/li&gt;\n&lt;li&gt;curious, not afraid to ask questions or to offer constructive challenge&lt;/li&gt;\n&lt;li&gt;an independent, strategic thinker&lt;/li&gt;\n&lt;li&gt;someone who relishes complex challenges and is solution focussed&lt;/li&gt;\n&lt;li&gt;reflective, demonstrating integrity and high ethical standards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will also need to be able to demonstrate you can use your experience to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work constructively with other Non Executives and Executive colleagues as an equal member of the Board&lt;/li&gt;\n&lt;li&gt;bring independence, external perspectives, skills and challenge to strategy development&lt;/li&gt;\n&lt;li&gt;hold the Executive to account by providing purposeful, constructive scrutiny and challenge&lt;/li&gt;\n&lt;li&gt;shape and actively support a healthy culture for the Trust.&lt;/li&gt;\n&lt;li&gt;All Board Directors must &lt;strong&gt;champion the standards of public life&lt;/strong&gt; – by upholding the highest standards of conduct and displaying the principles of selflessness, integrity, objectivity, accountability, openness, honesty, and leadership.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As NHS leaders, the successful candidates will be able to demonstrate the range of behaviours required to contribute effectively in this board level role. These are outlined in the NHS Leadership Academy’s Healthcare Leadership Model (opens in a new window)&lt;/p&gt;\n&lt;p&gt;Our recruitment processes are conducted in accordance with the Code of Governance to ensure that they are made on merit after a fair and open process so that the best people, from the widest possible pool of candidates, are appointed.&lt;/p&gt;\n&lt;p&gt;Please talk to us if you are interested in this role and believe you have the right mix of experience and skills. For an informal discussion, contact the Chair’s PA on 01493 452680 to arrange a discussion with Anna Davidson or email directly anna.davidson@jpaget.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Sunday 15th November 2020 at midnight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: Tuesday 1 December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnna DavidsonJob titleChairEmail addressanna.davidson@jpaget.nhs.ukTelephone number01493452680&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital NHS Foundation Trust, Gorleston", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Non Executive Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248792", "validThrough": "2020-11-15T23:59:59+0000"}