{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band Equivalent"}}, "datePosted": "2020-11-01T22:51:39+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;JOB TITLE:  &lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;Care Home Support Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver a pro-active training/educating advisory service that aims to improve the health and well-being of all care home residents and empower staff.&lt;/li&gt;\n&lt;li&gt;Identify the specific skills and training requirements for each care home and deliver and record a tailored training programme to include a train the trainer option if sufficient care homes request this approach. &lt;/li&gt;\n&lt;li&gt;Implement the champions programme focusing on the key annual KPIs and identifying which further champion roles can be developed. &lt;/li&gt;\n&lt;li&gt;Champion care home residents’ rights, for example dignity, equality, diversity, ethnicity and culture, and ensure services are delivered in a manner that is appropriate, stimulating, relevant and respectful recognising choice and the decision making capacity of the resident.&lt;/li&gt;\n&lt;li&gt;Support the care homes with the highest user activity to identify ways to reduce their activity levels in identified areas including specific tailored training focused on the high volume NEL admission HRGs (urinary disorders, respiratory disorders, falls and fractures, dementia and dysphagia).&lt;/li&gt;\n&lt;li&gt;Review residents after an acute hospital admission to ensure any changes in the management plan are implemented to reduce the risk of re-admission.&lt;/li&gt;\n&lt;li&gt;Implement face to face and digital clinical reviews to proactively manage care home residents to reduce avoidable admissions.&lt;/li&gt;\n&lt;li&gt;Work with care home staff to ensure that end of life care is discussed with the resident and their family members and robust advanced care plans are in put in place in collaboration with the GP.&lt;/li&gt;\n&lt;li&gt;Communicate complex and sensitive information and advice in a sensitive and empathic manner to service users, carers, and professionals, including information about diagnosis and prognosis, to find ways of enabling the information to be understood.&lt;/li&gt;\n&lt;li&gt;Support care home staff to make direct referrals on to other services or professions as required&lt;/li&gt;\n&lt;li&gt;To work according to the NMC Code of Conduct and professional practice and the relevant legislative framework and exercise professional accountability at all times&lt;/li&gt;\n&lt;li&gt;To be responsible for keeping professionally updated and registered with the NMC.&lt;/li&gt;\n&lt;li&gt;Develop, monitor, evaluate and review the delivery of community provision into care homes in collaboration with the integrated care home service manager.&lt;/li&gt;\n&lt;li&gt;Attend and contribute to clinical MDT meetings.&lt;/li&gt;\n&lt;li&gt;To be actively involved with performance and clinical audits.&lt;/li&gt;\n&lt;li&gt;Provide support and clinical supervision for junior nurses within the team.&lt;/li&gt;\n&lt;li&gt;Share expert knowledge and skills with the care homes to enhance their skills.&lt;/li&gt;\n&lt;li&gt;Contribute to the development and practice of others by developing and delivering educational programmes as required.&lt;/li&gt;\n&lt;li&gt;Facilitate education and training for care home staff.&lt;/li&gt;\n&lt;li&gt;Identify personal/professional development evidenced by Personal Development Plan developed within the Trust’s annual appraisal process.&lt;/li&gt;\n&lt;li&gt;Access appropriate and relevant training opportunities that will enhance both personal and professional development identified at annual appraisal.&lt;/li&gt;\n&lt;li&gt;Undertake and keep up to date with appropriate statutory and mandatory training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;Location: &lt;/strong&gt;St Marks Hospital, Maidenhead, SL6 6DU&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shifts/Hours:&lt;/strong&gt; Monday to Friday, 08:30 to 16:30&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Band 6 – Example Rate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Day Rate - £20.35 per hour&lt;/p&gt;\n&lt;p&gt;Night/Sat Rate - £26.16 per hour&lt;/p&gt;\n&lt;p&gt;Sun/Bank Holiday Rate - £31.97 per hour&lt;/p&gt;\n&lt;p&gt; In return for your hard work and your professional, caring, and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Access to the NHSP Stakeholder Pension&lt;/li&gt;\n&lt;li&gt;Paid annual leave and statutory maternity pay&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;Registration with NHS Professionals is subject to employment history and reference checking and offers of registration are therefore conditional upon the receipt of satisfactory references.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;strong&gt;For further information about the role, please contact &lt;/strong&gt;&lt;strong&gt;BerkshireHealthcare@NHSProfessionals.nhs.uk&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidenhead", "postalCode": "SL6 6DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5248", "longitude": "-.744843"}}, "title": "Senior Registered General Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251215", "validThrough": "2021-01-02T23:59:59+0000"}