{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-11-02T13:16:26+0000", "description": "&lt;p&gt;&lt;strong&gt;DIVISION OF URGENT CARE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EMERGENCY DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;**Previous applicants need not apply**&lt;/p&gt;\n&lt;p&gt;Speciality Doctor&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Are you a dynamic individual who thrives in a fast-paced, challenging environment?&lt;br /&gt;Are you passionate about improving patient care whilst developing your career within&lt;br /&gt;Emergency Medicine? If so, Tameside and Glossop Integrated Care NHS&lt;br /&gt;Foundation Trust welcomes you to join our Urgent Care family as a Specialty Doctor&lt;br /&gt;within the Emergency Department.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be part of a team of Specialty Doctors, delivering a 24 hour service under&lt;br /&gt;Consultant supervision. As well as providing clinical cover, you will also undertake&lt;br /&gt;administrative and supervisory duties as part of the Specialty Doctor rota. Fully&lt;br /&gt;registered with the GMC, you will be able to demonstrate the experience and skills&lt;br /&gt;needed for this role, including time spent in an A&amp;E department caring for both&lt;br /&gt;adults and paediatrics. In return, you can expect outstanding training and education&lt;br /&gt;opportunities, delivered under the supervision of our Consultant medical staff, as well&lt;br /&gt;as support in developing your management portfolio.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At Tameside and Glossop Integrated Care NHS Foundation Trust, we understand&lt;br /&gt;just how crucial it is for our A&amp;E staff to have a detailed induction, training and&lt;br /&gt;support programme. That is why we offer all our Specialty Doctors bespoke in-house&lt;br /&gt;training and the assurance that we are as interested in what we can do for them, as&lt;br /&gt;what they can do for us. These roles are an opportunity to advance your career in&lt;br /&gt;Northwest England’s second highest performing A&amp;E department.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;After 12 months in post you will also have the opportunity to express your interest in&lt;br /&gt;a rotational post which covers Anaesthetics, Paediatrics and Critical Care. There are&lt;br /&gt;ample opportunities to be involved in service development projects and audits&lt;br /&gt;throughout your time with us.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Tameside and Glossop Integrated Care NHS Foundation Trust is part of the vibrant,&lt;br /&gt;multi-cultural city of Manchester, which offers a wide variety of cultural and&lt;br /&gt;recreational activities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Samantha Ledwith, Associate Directorate Manager for Urgent Care – 07900737813, Samantha.ledwith@tgh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside Hospital, Ashton Under Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Specialty Doctor - Accident and Emergency", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252200", "validThrough": "2020-12-31T23:59:59+0000"}