{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata for part time"}}, "datePosted": "2020-10-21T10:01:21+0100", "description": "&lt;p&gt;As part of our current local transformation work Nottinghamshire Healthcare Trust have received investment to support expansion of Local Mental Health Teams within the Greater Nottinghamshire area and we are looking to recruit Mental Health Practitioners in to our City Community Mental Health Teams.&lt;/p&gt;\n&lt;p&gt;Would you welcome a new challenge? If you are a confident experienced clinician and would like an opportunity to use your skills working in a busy, challenging, rewarding and supportive environment we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a range of mental health practitioners from a nursing, social care or OT background who want to gain experience from working with a variety of mental health conditions within the community to join our teams.&lt;/p&gt;\n&lt;p&gt;The core aspects of the role will involve conducting assessments of individuals when they are referred to the local mental health team, Care Coordinate with a view to managing risk and developing a person centred care plan that will enable the individual to manage their mental health condition.&lt;/p&gt;\n&lt;p&gt;Hours can be flexible and we would welcome applications from those wanting both part and full time work on a substantive contract. This is an excellent opportunity for both experienced and newly qualified people to explore the options for on - going careers in community mental health.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;SallyAnn Summers - Acting Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: sallyann.summers@nottshc.nhs.uk / Telephone number: 07887898103&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Laura Humphreys - Team Manager - Telephone number: 01159555360&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment.&lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email. Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235760", "validThrough": "2020-11-15T23:59:59+0000"}