{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata, per"}}, "datePosted": "2020-10-27T13:01:20+0000", "description": "&lt;p&gt;We are looking to recruit a Senior BMS in the Coagulation section of HUTH Haematology department , to join a strong, supportive team delivering a first class service. The Haematology Laboratory at Hull provides an extensive service to one of the largest Trusts in England and has close partnerships with a wide variety of Clinical Specialities including specialist Haematology/Oncology services, Cardiac and Vascular surgery, Maternity and Neonatal services. The Trust is also a major UK Trauma Centre.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a temporary 12 month contract Senior BMS in the Coagulation section of Haematology. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;As a forward thinking team, we are continuing to implement a comprehensive service development plan, and are looking for someone with drive, motivation and ambition to support this. The post is ideal for someone wishing to develop their knowledge, skills and experience in a busy Coagulation Laboratory. There will be excellent opportunities for technical and service development as the department has a good track record for learning and staff development and this expertise will be used to support you.&lt;br /&gt;&lt;br /&gt;The existing team has a strong quality and training focus and the department has recently introduced and verified new analysers. The successful applicant will play a key role in further development of the service.&lt;br /&gt;&lt;br /&gt;Applicants must be state registered with HCPC, hold an IBMS Specialist Portfolio in Haematology &amp; Blood Transfusion and have started a postgraduate MSc with completion of a minimum of the 1st semester.&lt;/p&gt;\n&lt;p&gt;Candidates should have experience in Haemostasis.&lt;/p&gt;\n&lt;p&gt;The department operates a 24/7 service, and as such our Senior BMS staff participate in a support rota – this includes weekend and evening working within the department.&lt;/p&gt;\n&lt;p&gt;Hull, as a large coastal city can offer all the benefits of “big city” services and can has a wide range of first class leisure, sporting, cultural and entertainment facilities yet is on the doorstep of glorious rolling countryside and is within easy reach of several seaside resorts.&lt;/p&gt;\n&lt;p&gt;Jannene Sanders or Beverley Barnett&lt;br /&gt;Haematology Laboratory&lt;br /&gt;Hull Royal Infirmary&lt;br /&gt;Tel: 01482 607770/607773&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Senior Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244648", "validThrough": "2020-11-10T23:59:59+0000"}