{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096 - £110,683"}}, "datePosted": "2020-10-12T15:46:35+0100", "description": "&lt;p&gt;The Queen Elizabeth Hospital King’s Lynn NHS Foundation Trust is a 488 bed hospital which offers a chance to live and work in a beautiful region with its own distinctive mix of urban, rural and coastal landscapes, all within easy reach of Norwich, Cambridge, London and the Midlands. We serve an expanding population of around 220,000, which, increases substantially during the summer through the popularity of the surrounding countryside and beaches for leisure and holidays. We are a welcoming and friendly hospital that is devoted to our vibrant diverse community. We know where we are going, and want inspirational, compassionate and caring individuals to join us on this journey.&lt;/p&gt;\n&lt;p&gt;Great care can change everything and here at the Queen Elizabeth NHS Foundation Trust we want to deliver truly brilliant integrated care. Just like you we are ambitious about what we do and we are continually striving to improve our patient’s experience and outcomes. Bring your dedication and determination here, and you will benefit from the support of an experienced and enthusiastic multi-professional team committed to the delivery of brilliant patient care.&lt;/p&gt;\n&lt;p&gt;Our Values are at the heart of all that we do. We not only recruit employees based on their qualifications and experience - we recruit individuals who possess (and can demonstrate) the behaviours which underpin our core values. They define who we are and they encompass what we believe and how we will work together to achieve our objectives, these are as follows;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Act Well: &lt;/strong&gt;Taking personal responsibility and respecting the dignity and individuality of each person in our care and the professionalism and skills of our team members.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Care Well: &lt;/strong&gt;We care about providing safe, compassionate and attentive services for patients and a positive working environment for our colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Listen Well: &lt;/strong&gt;We deliver forward thinking quality services through listening to, learning from, and empowering those we work with.&lt;/p&gt;\n&lt;p&gt;You will join an expanding department of Ophthalmology. This is a new post (10 PAs) joining other established Consultant Ophthalmologist in the team. We ensure that close collaboration of all the consultants takes place with regular fortnightly team meetings and we there is a close working relationship with the managers of the service. We work in a friendly and close team atmosphere with a diverse population in north west Norfolk.&lt;/p&gt;\n&lt;p&gt;This is an exciting role to expand our current glaucoma service to integrate with both specialist nurses and establish community optometrist involvement to the service. Being the first dedicated glaucoma consultant in this trust offers an opportunity to develop and refine the service in your own areas of interest. We would welcome the introduction of a glaucoma training fellowship and research and we currently work closely with tertiary glaucoma services at Norwich and Cambridge.&lt;/p&gt;\n&lt;p&gt;We undertake over 100 trabeculectomy operations per year in the department and are involved with MIGS. The role would involve a 1:5 on call rota and to participate in the cataract services.&lt;/p&gt;\n&lt;p&gt;All resulting in achieving NICE guidelines and National Targets .&lt;/p&gt;\n&lt;p&gt;If you feel that you want to be part on this exciting department and have ideas for helping us ensure that a small DGH is sustainable for our local population then come and join us !&lt;/p&gt;\n&lt;p&gt;We really value the impact that you as a Consultant will have on our patients and services&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Stephen Byard - Stephen.Byard@qehkl.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Asher Dino - Asher.Dino@qehkl.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital, King&#39;s Lynn, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Consultant Ophthamologist with a special interest in Glaucoma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223067", "validThrough": "2020-11-09T23:59:59+0000"}