{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "78000", "minValue": "78000", "unitText": "YEAR", "value": "up to £78,000 per annum"}}, "datePosted": "2020-10-29T13:12:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Calling All ANPs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group, along with other independent providers of healthcare services are working with the NHS in a collective effort to combat the crisis posed by COVID-19.&lt;br /&gt; &lt;br /&gt; In our collective response to COVID-19 Practice Plus Group, we are seeking applications from ANPs to respond to increased demand in calls to our Out-of-Hours services.&lt;br /&gt; &lt;br /&gt; In particular, we are recruiting for face-to-face clinicians who can work in our primary care bases as well as conducting home visits to patients.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the largest provider of unscheduled care services in the UK and we proudly continue to lead the way with innovation in line with the vision of the NHS. This means we have a constant need to add to our bright and dynamic medical team to ensure we continue to fulfil the lives of our patients.&lt;br /&gt; &lt;br /&gt; We have permanent or self-employed opportunities within our Surrey Out-of-Hours (OOH) service, with locations in Dorking, Guildford, Epsom, Woking, Ashford, Haslemere, Cranleigh and Redhill.&lt;br /&gt; &lt;br /&gt; If you are looking for flexible hours and want to help in this time of need, then we would be happy to discuss how working with us can fit around you and your other commitments.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Surrey OOH service provides advice, information and treatment for NHS patients who become unwell during the out-of-hours period when their own GP surgery is closed.&lt;br /&gt; &lt;br /&gt; As an Advanced Nurse Practitioner, you&#39;ll see, treat and discharge patients of all ages that present minor illnesses or minor injuries, either over the phone or face-to-face in the base or when you&#39;re doing a home visit. You’ll be responsible for assessing patients, planning their care, administering treatment and discharging them or referring them as appropriate to other healthcare professionals / external agencies. You’ll work alongside GP’s, Practice Nurses, HCA’s and other non-clinical staff to deliver the best possible patient care.&lt;br /&gt; &lt;br /&gt; Our permanent roles run up to 37.5 hours per week however we also have bank and self-employed opportunities available, which will give you the flexibility to choose how you wish to work and with a rota made over a month in advance you have plenty of notice to plan your life around work.&lt;br /&gt; As we are an OOH service, we are ideally looking for ANPs who can work evenings and weekends.&lt;br /&gt; Our shifts are varied and range from 3.5 hours – 5 hours during the evenings and from 8 – 12 hours on the weekend.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Can Offer You...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are self-employed, then we can offer you...&lt;br /&gt; •Competitive pay rates&lt;br /&gt; •Flexible working hours&lt;br /&gt; •Working with a friendly and cohesive multi-disciplinary team&lt;br /&gt; •Supportive environment and senior leadership teams&lt;br /&gt; •Access to our bespoke learning system&lt;br /&gt; &lt;br /&gt; If you would like to come on board as salaried, then we can offer you...&lt;br /&gt; •Competitive salary + benefits&lt;br /&gt; •Company Pension&lt;br /&gt; •Indemnity Cover&lt;br /&gt; •25 days annual leave + bank holidays&lt;br /&gt; •Varied, interesting and challenging work&lt;br /&gt; •Cycle to work scheme&lt;br /&gt; •Online discounts&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;How we can Support You&lt;/strong&gt;&lt;br /&gt; •Regional and National career development opportunities&lt;br /&gt; •Regular clinical supervision and education events, including the opportunity to have a weekly case&lt;br /&gt; discussion with the Medical Lead&lt;br /&gt; •Bimonthly evening meals/clinical updates for the team, where we also invite external speakers&lt;br /&gt; •Our bespoke Learning Management System to address your learning needs&lt;br /&gt; •Discounted rates for national update/clinical topic refreshers.&lt;br /&gt; •Support from the wider team, should you need it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are Looking For...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Be an autonomous Nurse Practitioner with a patient assessment qualification and recent work&lt;br /&gt; experience within a Primary/Urgent Care environment&lt;br /&gt; •Hold an independent prescribing qualification&lt;br /&gt; •Hold an NMC Pin&lt;br /&gt; •Be able to see, treat and discharge patients of all ages with unscheduled presentations&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to talk to our friendly recruiters for further information, or for a full, comprehensive Job Description, please contact Karla Smith.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to receipt of satisfactory references and a DBS check.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is committed to creating a diverse environment and we are proud to be an equal opportunity employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking", "postalCode": "RH4 1HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2356", "longitude": "-.339219"}}, "title": "Advanced Nurse Practitioner (OOH) - Surrey", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248459", "validThrough": "2020-11-25T23:59:59+0000"}