{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £37,890 pa"}}, "datePosted": "2020-10-22T13:30:20+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 5/6 Diabetes Dietitian (Development Post)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Band 5 or Band 6 Dietitian&lt;/p&gt;\n&lt;p&gt;You may be a band 5 looking for an opportunity to progress your career by gaining experience in the management of Diabetes. If so we can offer the support to fast track your development to band 6 once you have met the appropriate competencies and ideally within 6 months.&lt;/p&gt;\n&lt;p&gt;Equally you may be a Band 6 dietitian wanting to gain further experience or to continue working in Diabetes.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Dietitian with excellent communication skills to join our team of Diabetes Dietitians who work across the acute sites – Heartlands, Good Hope and Solihull Hospitals.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work primarily in the clinic setting covering one to one sessions and group sessions.&lt;/p&gt;\n&lt;p&gt;Our diabetes directorate  provides general diabetes clinics but also specialist clinics such as insulin pump, islet transplant clinics preconception clinics, antenatal clinic, young adult clinics, foot clinic, eye screening as well as a new type 1 service currently being developed. All of which you may have an opportunity to gain experience in.&lt;/p&gt;\n&lt;p&gt;We also provide group education including our QISMET awarded Type 1 education programme (HET1E) , Xpert insulin, carb counting groups, gestational diabetes groups and Pump training days.&lt;/p&gt;\n&lt;p&gt;The post holder will require a flexible approach. They must have excellent team working skills and organisational and time management skills will be essential.&lt;/p&gt;\n&lt;p&gt;Therapies at HGS are committed to providing a 7 day therapy service with participation in bank holiday cover for dietetics.&lt;/p&gt;\n&lt;p&gt;Therapies give CPD a high priority and we would actively support the development of your knowledge in this area. We take A, B and C placement dietetic students, and have excellent IT and secretarial support.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this post, please contact Joanne Edwards, Diabetes Dietetic Team Leader on 0121 4243146&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Closing date: 15/11/2020&lt;br /&gt;Interview date: 26/11/2020&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5/6 Diabetes Dietitian (Development Post)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238665", "validThrough": "2020-11-15T23:59:59+0000"}