{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T12:46:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Transfer of Care Advice and Liaison Service (TOCALS) for two Specialist Discharge and Liaison Nurses (DLN) to join our evolving multidisciplinary team. &lt;br /&gt;&lt;br /&gt;TOCALS is an established and dedicated multidisciplinary team that work to support rapid assessments, care &amp; discharge planning for people who are at increased risk of long term reduced level of function as a result of a hospital admission. The team will work alongside community, primary care and acute hospital staff to develop an integrated approach to maintaining patient independence and early effective discharge. &lt;br /&gt;&lt;br /&gt;The role of the DLN is to use specialist skills to identify complex discharges and promote early but safe discharges within the hospital setting in accordance to the D2RA pathways. You will support the Integrated Community Care Co-coordinator by having clinical, managerial and operational input into the discharge processes by endorsing early intervention and discharge planning whilst being a role model for hospital staff and patient advocate. The ability to motivate and contribute to service development that will enhance the patients experience during discharge planning is required. &lt;br /&gt;&lt;br /&gt;The candidate should be able to demonstrate strong communication and negotiation skills in order to use and apply their knowledge and skills to facilitate complex discharges and advise, educate and support both acute and community teams to promote patient flow and avoid delays with transfers of care to the community setting.&lt;/p&gt;\n&lt;p&gt;The candidate must hold Level 1 Registration in nursing, have evidence of continuous professional development and have knowledge of multi-agency working, community services and awareness of the processes around Continuing Health Care assessment.&lt;/p&gt;\n&lt;p&gt;The post is currently Monday – Friday, full time hours with a position available on both Prince Philip Hospital and Glangwili General Hospital sites. Occasional cross site cover may be expected therefore the ability to travel between sites is required&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply&lt;/p&gt;\n&lt;p&gt;For further details:&lt;/p&gt;\n&lt;p&gt;Aysha Davies, Integrated Care Coordinator&lt;/p&gt;\n&lt;p&gt;Tel: 07422072873 / )1554 756567 Bleep 955&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAysha DaviesJob titleIntegrated Community Care CoordinatorEmail addressaysha.davies@wales.nhs.ukTelephone number07422072873&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital and Prince Philip Hospital, Carmarthenshire", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Specialist Nurse - Discharge Planning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255912", "validThrough": "2020-11-16T23:59:59+0000"}