{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-26T12:30:33+0000", "description": "&lt;p&gt;Now is a very exciting time to join the South West Hampshire Division of Southern Health NHS Foundation Trust as we embark on a period of expansion and move toward a model of working as an ‘Academy of Community Health Care’.&lt;/p&gt;\n&lt;p&gt;The Academy model provides structured and accessible career pathways clinically and non-clinically, from band 3 all the way to 8b for the right people. We are committed to finding the right people for the roles, and then supporting them as individuals to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;We are recruiting to multiple posts, to work alongside the local Primary Care Networks across the South West Hampshire division. These new post holders will have the opportunity to work across the three branches of The Academy, in Community Nursing, Community Therapy and The Frailty Support Team. All of our community teams provide urgent-acute and planned services to our patients. Which means no two days are the same!&lt;/p&gt;\n&lt;p&gt;These very exciting new roles should appeal to experienced Band 5 practitioners and newly qualified registrants alike.&lt;/p&gt;\n&lt;p&gt;So if you looking for a band 5 role with scope to grow and a clearly defined career pathway toward a band 6 role this could be the role for you, if you are a nurse (adult/mental health), paramedic, physiotherapist or occupational therapist.&lt;/p&gt;\n&lt;p&gt;The successful applicants can expect a thoroughly planned preceptorship/induction tailored to individual development needs. We are able to offer flexible working across Frailty, Community Health Teams and Inpatient Rehabilitation if you desire a rotational post after qualifying.&lt;/p&gt;\n&lt;p&gt;We offer flexible working patterns over 7 days, from 8am to 6pm. Successful candidates would be allocated a home base, and as a dynamic and flexible team may be asked to cover other bases as required from time to time.&lt;/p&gt;\n&lt;p&gt;If you think this opportunity could be the right one for your next step, please get in touch. Informal visits are strongly encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion, in the first instance please contact the team administrators to arrange on &lt;/strong&gt;&lt;strong&gt;&lt;span&gt;01590 663200&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh Borough or Totton and Hythe hubs, South West Hampshire Division", "postalCode": "SO50 9DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9713", "longitude": "-1.35402"}}, "title": "Frailty Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242422", "validThrough": "2020-11-13T23:59:59+0000"}