{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-10-20T17:01:05+0100", "description": "&lt;p&gt;&lt;strong&gt;With our clear vision to provide Caring at its Best, our strong values, ambitious quality improvement plans and multi million pound transformation agenda, there’s never been a better time to join University Hospitals of Leicester NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are about to embark on the most ambitious Programme of acute healthcare transformation culminating in new state of the art facilities for residents of Leicester, Leicestershire, Rutland and the wider region within a budget of will £450m. The Estates Capital Project Managers will form an essential component of the capital team who will deliver UHL’s reconfiguration programme which in the long term secures the clinical and financial sustainability of the Trust.&lt;/p&gt;\n&lt;p&gt;Working closely with specialist advisors, design teams, construction partners, clinical and reconfiguration colleagues, the Estates Capital Project Managers will lead and support specific projects within the reconfiguration programme.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants with a positive problems solving, dynamic approach to work that have sound transferable project management skills, with an impressive track record of delivering construction projects either client or contractor side. The ability to challenge, communicate and support others through the design and construction process is key.&lt;/p&gt;\n&lt;p&gt;We have several vacancies available at Leicester Royal Infirmary and Glenfield Hospital and are currently looking for applicants with experience in the following specialities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Construction - delivering large construction and civil engineering projects&lt;/li&gt;\n&lt;li&gt;Infrastructure - delivering large mechanical and electrical infrastructure projects&lt;/li&gt;\n&lt;li&gt;Government Soft Landings - delivering the building purpose to the end user, commitment to building commissioning and aftercare post construction&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Opportunities such as this do not present themselves often so to find out more about this post please contact Elaine Neal in the first instance on 0116 258 6348.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Elaine Neal  Job title: Capital Projects Officer  Email: address: elaine.neal@uhl-tr.nhs.uk  Telephone number: 0116 258 6348  Additional contact information: &lt;/p&gt;\n&lt;p&gt;Available Monday-Friday - 08:30 to 17:30&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals of Leicester, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Estates Capital Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235372", "validThrough": "2020-11-06T23:59:59+0000"}