{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-27T16:30:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Project Officer – Clinical workforce projects&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Norfolk and Waveney Health and Care Partnership is a partnership of local health and care organisations working together to improve the health, wellbeing and care of people living in Norfolk and Waveney. Our partnership includes local GP practices, hospitals, community care, social services and mental health teams, and together we provide services to more than a million people. Our three goals are to make sure people an live as healthy a life as possible; to make sure people only have to tell their story once; and to make Norfolk and Waveney the best place to work in health and care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The people who work in our system, our workforce, are at the heart of improving outcomes for our patients and wider population. We have just launched &lt;em&gt;#WeCareTogether, the Norfolk and Waveney People Plan 2020-25&lt;/em&gt; which sets our vision to make our system the best place to work. We have an ambitious programme of work focusing on creating new opportunities, promoting good health and wellbeing, maximising peoples skills, and creating a positive and inclusive culture for our people.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an individual who is passionate about workforce transformation to work in a newly developed post in the Norfolk and Waveney Health and Care Partnership Workforce Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will have a key role in supporting the delivery of our #WeCareTogether. We are looking for an individual with innovative ideas, excellent planning and organisational skills and a keen interest in problem solving to support the clinical leads across a variety of clinical professions including pharmacy, allied health professionals and healthcare science. The post holder will support our clinical leads to develop and implement a system wide approach to increasing recruitment, retention, training and developing new roles in these essential professions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will work to the Assistant director, medicines optimisation and the Allied Professions Lead and ensure that the work plan is robustly developed and tracked. We are looking for an individual who has an awareness of project management documentation and process, but who is also able to engage with people to arrange meetings, workshops and participate in discussions relating to the work programme with a range of stakeholders at various levels of seniority including Directors, Managers and clinical teams in Health, Social Care and Primary Care organisations.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role provides the opportunity for personal development through access to and insight into a number of workforce transformation projects which will include education, leadership, new role development, new ways of working, and workforce planning as the heart of each.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a fixed term post for 1 year which will also be offered as a secondment opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The interview date will be 27th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCeinwen MannallJob titleAssistant Director, Medicines Optimisation &amp; Workforce ProjectsEmail addressceinwen.mannall@nchc.nhs.ukTelephone number07775 118080&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich Community Hospital, Norwich", "postalCode": "NR2 3TU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6342", "longitude": "1.26243"}}, "title": "Project Officer – Clinical Workforce Projects", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245422", "validThrough": "2020-11-15T23:59:59+0000"}