{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T14:27:32+0000", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This post provides the opportunity to be part of an award winning perinatal team in Devon Partnership Trust. Perinatal mental health is a fast evolving and dynamic field with many opportunities for people to be part of creating high quality services.&lt;/p&gt;\n&lt;p&gt;The role will be as a Consultant Psychiatrist based in the Perinatal community team in Devon Partnership Trust.&lt;/p&gt;\n&lt;p&gt;This is a Fixed Term post initially however we are hopeful that there will be further opportunities for permanent positions within perinatal services or elsewhere in the trust once this has been completed. There is a possibility that the term may be increased.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We would love to hear from you if you are an enthusiastic and forward thinking consultant willing to take a leading clinical role in our perinatal mental health service community teams.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;The location&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This role will be based within the community perinatal service in Devon Partnership Trust. The team that you could be potentially be working in would cover Exeter, East and Mid Devon, Torbay, South Hams and West Devon. However we recognise this is a large area and will be open to discussion about which part of this geography you would like to be based and work in. It is also possible that some of this work could be done remotely using videoconferencing software. We are very open to further discussions about this.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This post will be based in the community perinatal team in Devon Partnership Trust. The appointee to this post will be working alongside a 9PA Perinatal community consultant Dr Jo Black who is also currently the Chair of the Perinatal Faculty for the Royal College of Psychiatrists. There is also an eight bed MBU, Jasmine Lodge, based in Exeter where Dr Laurie Windsor (consultant) and Dr Jessica Brock (Speciality Doctor) are based. In North Devon Dr Allison Collins provides input to the perinatal community team. We have regular local perinatal peer groups with all the senior perinatal doctors working in Devon which are rewarding and supportive experiences.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive.&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;32 days of annual leave per year plus bank holidays.&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Great place to work. Great place to live.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Locum Consultant Psychiatrist in Perinatal Psychiatry (5 PAs per week)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254333", "validThrough": "2020-11-18T23:59:59+0000"}