{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "From £24,907 per annum"}}, "datePosted": "2020-11-02T10:16:12+0000", "description": "&lt;p&gt;The Riverside Adolescent Unit in Bristol is a specialist CAMHS service providing assessment, formulation and treatment for young people aged 13-18 who have complex mental health needs. The Unit offers both in-patient and day attendance with a therapeutic programme and provides a safe and nurturing environment for young people to work through emotional and psychological difficulties.&lt;br /&gt;&lt;br /&gt;This post offers a real opportunity for personal and professional development. As a Staff Nurse at Riverside you will be able to develop skills working in individual, group and family contexts, as well as becoming involved in a wide range of educational and recreational activities. You will also have the opportunity to expand your day to day management experience and to build up links with referrers and community based services. You will also be key worker for young people in collaboration with the Riverside multi-disciplinary team. You will have excellent team-working skills.&lt;/p&gt;\n&lt;p&gt;The Riverside Adolescent Unit is currently being refurbished and the team is based at Larch Unit, Callington Road Hospital in South Bristol. At present, this involves operating a day and outreach service for young people, including virtual input, with telephone support at night. The team has shown its great adaptability in managing the challenges of recent months while maintaining a high quality of care for the young people we work with.&lt;/p&gt;\n&lt;p&gt;The return to the Riverside Unit at Blackberry Hill Hospital, Fishponds, is planned for March 2021 where it will expand to 12 beds. Because of these changes, it is a particularly exciting time to become part of our highly supportive team.&lt;br /&gt;&lt;br /&gt;Candidates should be a Registered Mental Health Nurse, but we are willing to consider a nurse with a Learning Difficulties qualification to broaden the skill mix of the team. Those with experience are encouraged to apply as well as preceptors. You will need to demonstrate imagination, enthusiasm, positivity, robustness, and feel you can make a contribution working with this stimulating and rewarding client group in what can be a challenging environment.&lt;/p&gt;\n&lt;p&gt;We welcome candidates from all backgrounds and experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jonathan Jones,  Modern Matron  Email jonathan.jones10@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0117-3546350&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Harri Richards - harri.richards@nhs.net or telephone 0117 354 6350&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 2EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4831", "longitude": "-2.53883"}}, "title": "Band 5 Staff Nurse (RMH/LD) - Bristol", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251533", "validThrough": "2020-11-16T23:59:59+0000"}