{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45998", "minValue": "36329", "unitText": "YEAR", "value": "£36,329 - £45,998 Salary will depend on location £"}}, "datePosted": "2020-10-28T15:31:51+0000", "description": "&lt;p&gt;FFE Equipment Manager&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the PHE Science Hub Programme.&lt;/p&gt;\n&lt;p&gt;This Programme, seeks to create a national integrated hub for public health science to deliver the core national responsibilities of Public Health England, the expert advisor to the government on the public’s health.&lt;/p&gt;\n&lt;p&gt;The Science Hub Programme works with a number of external organisations who support the delivery of key specialist activities, all staff will be required to work closely with these service providers in the undertaking of their work.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an FFE Equipment Manager to work across the Science Hub Programme on the Furniture Fixtures and Equipment workstream.&lt;/p&gt;\n&lt;p&gt;The post holder will be working with the Programme team and the Business to support the move of all FFE to the new Harlow site.&lt;/p&gt;\n&lt;p&gt;This job description and person specification may be reviewed on an ongoing basis in accordance with the changing needs of the organisation, for a full list of duties and responsibilities, please refer to the attached Job Description.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification as sub-headings in their application to make it clear how they meet each of the essential criteria.&lt;/p&gt;\n&lt;p&gt;Salary will depend on location £40,074 - £45,998 per annum (Inner), £38,202 - £44,240 per annum (Outer) , £36,29 - £42,481 per annum (National)&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To find out more about how we champion diversity and inclusion in the workplace, visit: PHE Website&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute of Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate consultation prior to any formal transfer taking place.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Hannah Conway Job title Business Change Support Manager Email address Hannah.Conway@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, Harlow, Colindale or Salisbury (Porton Down) Offices. Travel between Science Hub locations will be required on a regular basis., London, Harlow, Colindale or Salisbury (Porton Down) Offices.", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "FFE Equipment Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247209", "validThrough": "2020-11-12T23:59:59+0000"}