{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-30T11:46:07+0000", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust is a world-leading cancer centre. Our role is to offer our patients the best cancer care available anywhere in the world, and to continue to make a global contribution to finding better ways of diagnosing and treating cancer. We employ over 3,900 staff in a diverse range of careers including nursing, medical, science, radiography, pharmacy, occupational therapy, finance and administrative services.&lt;br /&gt;Our Research and Development has remained a key strategy of the Trust throughout, collaborating with a number of world leading institutions to lead on developing highly innovative and technologically advanced treatments.&lt;br /&gt;A vacancy has arisen within the Research and Development Finance team for an enthusiastic and highly motivated Assistant Finance Manager. Ideally, applicants would have experience in management accounting and would be looking to develop their financial management skills within a dynamic NHS environment. A keen interest in the research environment is highly desirable. We are seeking an organised, hard-working and ambitious individual who has a passion for best practice. Reporting to a Finance Manager; and working closely with the R&amp;D Management Accountant, you will be producing high quality financial information, including monthly management accounts, forecasts and variance analysis. You will need to provide sound support and advice to the business to help manage their research portfolio finances. You will have excellent communication skills and be highly computer literate, with excellent attention to detail. The Trust is based over two main sites in Chelsea and Sutton, Surrey and whilst the post will be based in Chelsea, the post holder will be required to attend meetings at other Royal Marsden sites as necessary.&lt;/p&gt;\n&lt;p&gt;Please note: on the day of the interview, there will be an Excel test (45 minutes) followed by a face-to-face interview (45-60 minutes).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dobrinka Petrova, Finance Manager - R&amp;D, dobrinka.petrova@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Caroline Ibbs, Finance Manager, caroline.ibbs@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Assistant Finance Manager R&amp;D", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250012", "validThrough": "2020-11-13T23:59:59+0000"}