{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa pro rata plus HCAS"}}, "datePosted": "2020-10-21T20:45:16+0100", "description": "&lt;p&gt;We are seeking a skilled and experienced Clinical Psychologist to provide team management and clinical input to our well established and famous CAMHS for Learning Disabilities. The post holder will provide management and leadership to Clinical Psychologists covering a range of services including ‘Building my Future’, psychologists in relevant schools, and those in the Intensive Therapeutic and Short Break Service (a flagship service recommended in NICE guidelines).&lt;/p&gt;\n&lt;p&gt;The post offers excellent opportunities to develop and consolidate management and service development experience and clinical skills with this specialist client group, within a collaborative and innovative multi agency service context. The CAMHS-LD team work closely with Ealing’s multidisciplinary Child Development Team, as well as with education and social care teams working with this client group.&lt;/p&gt;\n&lt;p&gt;The post holder will be based in Carmelita House Ealing a purpose built building for this client group and the base for the multiagency integrated Ealing Service for Children with Additional Needs (ESCAN).&lt;/p&gt;\n&lt;p&gt;The Borough is at the forefront of innovation in terms of developing cross agency, integrated service provision for children and young people with disabilities, and their carer networks, and the Clinical Psychologists are leading on a number of exciting service initiatives. The post holder will be expected to sit on the ESCAN management team and contribute to service developments within ESCAN.&lt;/p&gt;\n&lt;p&gt;The post offer opportunities for:&lt;/p&gt;\n&lt;p&gt;• Contributing to the strategic development of the Service, in collaboration with senior managers in CAMHS and the Local Authority.&lt;br /&gt;• Management and supervision of a committed and skilled team of Child Clinical Psychologists working with this client group.&lt;br /&gt;• Direct clinical work with children with disabilities and their families who have challenging behaviours and mental health needs &lt;br /&gt;• Joint working with colleagues in Community Paediatrics, Education, Social Services and the voluntary sector&lt;br /&gt;• Consultation and training across agencies&lt;br /&gt;• Leading in an area of special interest and expertise, for example assessment and intervention with children with autistic spectrum disorders, feeding difficulties, sleeping difficulties etc.&lt;/p&gt;\n&lt;p&gt;There is a large and supportive Child Clinical Psychology Group in Ealing, including those who work in other multiagency Tier 2 services and Tier 3 CAMHS services in the area.&lt;/p&gt;\n&lt;p&gt;We are able to provide excellent support and supervision, and strongly support professional development and research interests. We enjoy close links with the UEL, UCL and Royal Holloway Training Schemes.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Dr Desiree Saddik, Consultant Clinical Psychologist on 07958488587.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Desiree SaddikJob titleConsultant Clinical PsychologistTelephone number07958488587.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ESCAN Block, Ealing", "postalCode": "W5 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5143", "longitude": "-.300322"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237516", "validThrough": "2020-11-08T23:59:59+0000"}