{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:17:03+0000", "description": "&lt;p&gt;&lt;em&gt;The Royal Free Critical Care team is looking to appoint Band 5’s who have a minimum of six months post registration experience to join our critical care team on the Barnet Site. We are seeking to appoint motivated and dynamic Band 5 Registered Nurses who wish to pursue a structured Band 5 to 6 critical care development.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Barnet Intensive Care unit comprises of 23 beds, 10 level 2 and 13 level 3. The unit admits in excess of 1,000 patients per year. Specialties include general medical and surgical patients, patients requiring renal replacement therapies, spinal, plastic and complex lower GI.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In order to equip you with the correct knowledge, skills and attitude to become a competent and confident critical care Registered Nurse we will provide you with:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;* Supernumerary orientation programme that will be individualized to your professional needs. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;*Tracheostomy study day and training.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;*Dedicated band 7 staff member and team who will guide and mentor you throughout your development.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;* Band 5 Registered Nurses will attend an “Introduction to Intensive Care Course”. This is a 6 month course and on completion will give you 15, Level 6 Credits. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;* Experienced Band 5 Registered Nurses will be supported to gain a place on the nationally recognised Royal Free Postgraduate Intensive Care Course. This is a 6 month course and on completion will give you 30, Level 6 Credits.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As you can see we are committed to developing and supporting a modern career frame work for our Nurses in critical care and you will be supported every step of your critical care career pathway by our Clinical Practice education team and senior team.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that these vacancies may close prior to the advertised closing date, subject to the high number of applicants anticipated.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding an interview. We will use Zoom and similar tools to conduct testing and interviews. Due to the challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Deborah Kirby, ITU Matron - deborahkirby@nhs.net / 020 8216 5304&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Nuala Kelly, Senior Practice Educator – nuala.kelly@nhs.net/ 020 216 5311&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 5 Staff Nurse - ICU Barnet Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244450", "validThrough": "2020-11-25T23:59:59+0000"}