{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-06T11:46:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Norfolk Community Health &amp; Care NHS Trust have an exciting opportunity available for an experienced Band 6 Physiotherapist who enjoys working in partnership with patients and their families to join our successful Intermediate Care Beds and Community Response Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The team consists of Occupational Therapist, Registered Nurses, Assistant Practitioners and Healthcare Assistants. The team work from St James Clinic Kings Lynn who triage, review referrals received from the acute setting, Paramedics and General Practitioners also Community Matrons. We also assess and support to ensure early discharge from the acute setting or admission avoidance in non urgent cases, and support the precured beds in nursing homes. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The ability to effectively co-ordinate and communicate often complex and diverse information is vital in the effectiveness of the service. You will be required to triage, review and initiate timely responses to received referrals to ensure patients in their own homes are provided with an excellent and safe service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are motivated and passionate about providing excellent patient care then this is the post for you. As a Clinician working in the Community Response Team and Intermediate Care Beds the role will require an ability to work closely with professionals from other organisations to enable integrated working. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical supervision will be provided, we offer the opportunity to work in an experienced and supportive team with opportunities for ongoing professional development.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Past applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are happy to support short shadow visits to see how the team works; for further information please contact Jinty Harris 07766785791&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJinty HarrisJob titleClinical Operations ManagerEmail addressjinty.harris@nchc.nhs.ukTelephone number07766785791&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James Clinic, , Kings Lynn", "postalCode": "PE30 5NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7492", "longitude": ".410179"}}, "title": "Community Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259504", "validThrough": "2020-11-16T23:59:59+0000"}