{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-11-05T12:30:51+0000", "description": "&lt;p&gt;CAMHS Specialist Practitioner band 7 full time or part time positions considered.&lt;/p&gt;\n&lt;p&gt;ARE YOU ABLE TO HIT THE GROUND RUNNING!&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to become part of a vibrant and dynamic service as it further expands to increase access and improve outcomes for young people in the very diverse and exciting Tower Hamlets borough in East London.&lt;/p&gt;\n&lt;p&gt;There are 5.5 wte posts at band 7 open to all CAMHS professionals including social workers and creative and arts therapists and these are spread across a number of parts our service. We are happy to consider both full-time and part time clinicians to fulfil these roles. Due to the current situation with COVID-19 and unpredictable demands on services these posts will likely initially comprise of dual roles, the first within the core Triage/Emotional and Behavioural pathway and then the second within our more specialist Neuro-Developmental Team (NDT), Under 5s Team and Tower Hamlets Education Wellbeing Service - (Mental Health in Schools Team). We plan to be to offer the right candidates an opportunity to specialise further in the longer term once the COVID recovery is better established, particularly in our NDT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience in generic CAMHS psychosocial assessment and interventions for many of the presenting problems we see is fundamental for these posts. Experience in adapting to the remote working conditions of late is also valued although we of course deliver as much key face to face work as possible. We encourage applications from those with specialist experience and those keen to develop more specialist knowledge and skills. A few examples would be: ADOS training, training in models of brief and short interventions, DBT and CBT training to supervise CYP IAPT trained staff including Education Wellbeing Practitioners (EMHP) and Childrens Wellbeing Practitioners (CWP).&lt;/p&gt;\n&lt;p&gt;For more information please contact Richard Simmonds, Psychological Therapies Lead, Tower Hamlets CAMHS 020 7426 2375 &lt;br /&gt;Closing date: 15.11.2020&lt;br /&gt;Interviews: 26th &amp; 27th/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard SimmondsEmail addressRichard.simmonds1@nhs.netTelephone number07815312109Additional contact information&lt;/p&gt;\n&lt;p&gt;Richard Simmonds, telephone 07815312109, email Richard.simmonds1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS TH Community CAMHS, LONDON", "postalCode": "E1 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5178", "longitude": "-.066951"}}, "title": "CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257675", "validThrough": "2020-12-06T23:59:59+0000"}