{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa pro rata"}}, "datePosted": "2020-10-29T14:46:26+0000", "description": "&lt;p&gt;&lt;strong&gt;UNIVERISTY HOPITALS BRISTOL AND WESTON NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bristol Fellowship in Cardiothoracic Surgery (SpR LEVEL)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for a highly motivated individual who wishes to gain experience in Cardiothoracic Surgery. The post is for a 6 months in the first instance but potentially renewable. and experience in adult and paediatric Cardiac Surgery and General Thoracic Surgery are all potential opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol NHS Foundation Trust is a dynamic and thriving group of hospitals in the heart of Bristol, a vibrant and culturally diverse city. Our 7,900 staff offers over 100 different clinical services across nine different sites. We provide general medical and emergency services to the local population of Central and South Bristol, and a broad range of specialist services across a region that extends from Cornwall to Gloucestershire, into South Wales and beyond. We are one of the country&#39;s largest acute NHS Trusts with an annual income of over £500 million.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is part of a new investment in our junior medical workforce and will be based in the Bristol Heart Institute, Bristol Children’s Hospital and Thoracic Surgery. The new Bristol Heart Institute was opened in 2009 and it delivers 1400 adult cardiac operations on an annual basis. Thoracic surgery perform around 1000 annually and 350 operations in the Children’s Hospital. Our centre specialises in the whole range of cardiac surgery with the exception of transplantation and ventricular assist devices. There are 4 fully equipped modern cardiac surgery theatres, of which one is hybrid (shared with Cardiology). Critical care support is provided within a modern 25 bedded Critical Care area staffed by dedicated cardiac intensive care specialists. Ward accommodation is provided on wards 708 and 705 with an average bed usage of 36 beds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will offer excellent clinical, teaching and research facilities with possibilities to develop/consolidate your surgical expertise. Particular strengths are the opportunity of performing/assisting at various techniques of open and key-hole mitral valve repair, complex aortic surgery, TAVI, OPCAB and VATS lung resections.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must have GMC registration by the starting date and some experience in Cardiothoracic Surgery would be helpful.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shortlisting details and interview arrangements will be communicated via email therefore please ensure you check your email account regularly following the closing date.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark YeatmanAdditional contact information&lt;/p&gt;\n&lt;p&gt;Mr Mark Yeatman, Consultant Cardiac Surgeon, BHI on 0117 342 6661.&lt;/p&gt;\n&lt;p&gt;(email: Mark.Yeatman@UHBristol.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Heart Institute, Bristol", "postalCode": "BS2 8ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4583", "longitude": "-2.59763"}}, "title": "Clinical Fellow In Cardiothoracic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248751", "validThrough": "2020-11-08T23:59:59+0000"}