{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17598", "minValue": "17598", "unitText": "YEAR", "value": "£17,598.26"}}, "datePosted": "2020-10-06T16:38:46+0100", "description": "&lt;p&gt;We have an exciting opportunity for a self-motivated individual to join our team to work with and provide comprehensive administrative support to the Barnsley Primary Care Network and its associated management team within Barnsley Healthcare Federation. With a wide ranging remit, this role will support and facilitate delivery of resilient high quality primary care to our local population ensuring that service planning and delivery meets Local and National objectives, contractual requirements and targets.&lt;br /&gt; &lt;br /&gt; The ideal candidate for this challenging post will have NHS experience and excellent communication skills dealing with a wide variety of partners, especially on the telephone. The post holder will be proactive and astute with demonstrable experience of taking minutes, writing reports, liaising with stakeholders, organising documents, coordinating calendars, utilising spreadsheets and/or databases, and reception duties.  Applicants will also be required to demonstrate the ability to build relationships with a diverse group of stakeholders&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Launched in 2015, Barnsley Healthcare Federation (BHF) is a not-for-profit Community Interest Company which aims to improve and enhance the way in which primary care at scale is delivered within Barnsley. Drawing upon the knowledge and expertise of health professionals from across the borough, our vision is to deliver a robust publicly-funded health and social care service which meets the needs of the local community. We believe that regardless of location or need, every patient should receive the same high standard of care, at times when they need it most. Recently BHF is playing a big role in the development and implementation of the local Primary Care Network (PCN). The Barnsley area has grouped together into one PCN, and is the largest network in the country.&lt;/p&gt;\n&lt;p&gt;We are an inclusive and ambitious organisation and offer 5 weeks annual leave plus bank holidays, free parking, a monthly in house training event plus access to the NHS pension scheme. &lt;br /&gt; &lt;br /&gt; Please refer to the Job description and the Person Specification for details of the role and the skills, qualifications and experience required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;YOU ARE ENCOURAGED TO APPLY AS SOON AS POSSIBLE FOR THIS VACANCY AS IT MAY CLOSE EARLIER THAN THE SPECIFIED DATE SHOULD EXCESSIVE APPLICATIONS BE RECEIVED.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5434", "longitude": "-1.45718"}}, "title": "PCN Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215463", "validThrough": "2020-11-08T23:59:59+0000"}