{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615"}}, "datePosted": "2020-10-16T18:37:14+0100", "description": "&lt;p&gt;Come and join a Community Nursing Team where our staff count, where you can make a difference to your patients and no two days are the same. We have a Band 5 registered nurse vacancies in our Cullompton team as part of the Culm Valley Community nursing team.&lt;/p&gt;\n&lt;p&gt;You will work to provide high level nursing care to patients in their own homes and our aim is to wherever possible maintain patients in their preferred place of care, enabling them to maximise their independence and optimise their quality of life.&lt;/p&gt;\n&lt;p&gt;You will be part of a dedicated team, delivering a wide range of clinical interventions including end of life care, wound care management and long term condition management as part of the wider multi-disciplinary. Candidates will need to have excellent communication and assessment skills and will be responsible for the assessment, planning, implementation and evaluation of personalised patient centered care in partnership with our patients and those important to them.&lt;/p&gt;\n&lt;p&gt;Transferable clinical skills will be supported with high quality training packages and there is opportunity for ongoing personal and professional development, supported by regular supervision and annual appraisals. Community nursing is ever changing and dynamic; this is a great opportunity to join this exciting discipline.&lt;/p&gt;\n&lt;p&gt;Hours are negotiable for the right candidate, so please contact to discuss.&lt;/p&gt;\n&lt;p&gt;There is an expectation that team members will support all teams within the Culm Valley as required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cullompton", "postalCode": "EX15 1FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8473", "longitude": "-3.39506"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231314", "validThrough": "2020-11-08T23:59:59+0000"}