{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26000", "minValue": "22000", "unitText": "YEAR", "value": "£22-£26K, depending on experience"}}, "datePosted": "2020-10-27T12:12:12+0000", "description": "&lt;p&gt;Fancy a new exciting job in the New Year? Are you the Registered Pharmacy Technician we need?  Chippenham, Corsham &amp; Box Primary Care Network are seeking an enthusiastic, patient-focused, and independently motivated person to join our existing pharmacist team to provide quality patient-care.&lt;/p&gt;\n&lt;p&gt; This is a new and developing role taking advantage of the NHS Network Contract DES for Additional Roles Reimbursement Scheme.&lt;/p&gt;\n&lt;p&gt; The successful candidate will work across the 5 GP Practices in the PCN, with projects ranging from dealing with prescription requests and cost-saving switches to facilitating medication reviews.  We expect contribution to the overall medicines optimisation programme, acting on best practice from local and national guidelines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main job roles&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the role of PCN clinical pharmacists in the delivery of clinical pharmacy services to people in their own homes or local care homes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Perform medicines improvement work to maximise safe, cost-effective best practice in prescribing&lt;/li&gt;\n&lt;li&gt;Improve the use of medicines and help patients with medication concordance&lt;/li&gt;\n&lt;li&gt;Assist with medication safety monitoring systems&lt;/li&gt;\n&lt;li&gt;Liaise with hospital teams, clinicians and administrative staff to resolve medicine-related queries&lt;/li&gt;\n&lt;li&gt;Monitor practice prescribing and adherence to practice, local and national prescribing policies&lt;/li&gt;\n&lt;li&gt;Improve service and quality through audit and searches&lt;/li&gt;\n&lt;li&gt;Help identify patients at risk of medicines use issues, including waste, safety and over-&lt;strong&gt;use&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Chippenham, Corsham and Box Primary Care Network (CCB PCN) provides proactive and coordinated care across the local population of  58,000 people. We have a strong focus on health promotion and personalised care, supporting people to make informed decisions about their health and social care.  We are a dynamic, friendly and supportive PCN with much experience in training GPs and other healthcare professionals.&lt;/p&gt;\n&lt;p&gt; The individual practices have been early adopters of new models of NHS care, utilising the diverse skill mix offered by physiotherapists, paramedics, nurse practitioners, social prescribers, and clinical pharmacists.  The PCN is excited about continuing this development by the introduction of a PCN Pharmacy Team.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You MUST be a Pharmacy Technician registered with the General Pharmaceutical Council (GPhC).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Full driving license as travel will be required to surgeries, care homes and patients in the PCN area.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply unless registration has been recently attained.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To discuss the role informally please contact Emma Pope, Lead Clinical PCN Pharmacist by email emma.pope4@nhs.net or mobile 07780912281&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chippenham/Corsham/Box", "postalCode": "SN14 6GT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4673", "longitude": "-2.13976"}}, "title": "PCN Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244415", "validThrough": "2020-11-12T23:59:59+0000"}