{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "168100", "minValue": "117670", "unitText": "YEAR", "value": "£70-£100 per session"}}, "datePosted": "2020-11-03T11:00:25+0000", "description": "&lt;p&gt;At CDDFT we are doing things differently and we are seeking to enable our GPs to practice in a new way.&lt;/p&gt;\n&lt;p&gt;Would you like?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An assistant / driver to accompany you out of hours?&lt;/li&gt;\n&lt;li&gt;A competitive salary commensurate with actual duties?&lt;/li&gt;\n&lt;li&gt;The opportunity to work alongside a dynamic multi-disciplinary team?&lt;/li&gt;\n&lt;li&gt;Flexibility to ensure a work life balance?&lt;/li&gt;\n&lt;li&gt;Indemnity covered by the Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;County Durham and Darlington Urgent Care Services seek to employ dynamic GP’s to complement our existing multi-disciplinary teams within its five centres. The centres are Darlington Memorial Hospital, Bishop Auckland, Peterlee, Shotley Bridge and University Hospital North Durham.&lt;/p&gt;\n&lt;p&gt;With a focus on out of hours and weekend work, we offer competitive rates and no minimum hours on either a sessional or salaried basis. Ten percent governance/reading time is also within the salaried role along with Trust indemnity for both sessional and salaried roles.&lt;/p&gt;\n&lt;p&gt;Working alongside experienced practitioners and members of the multi-disciplinary team, you will be supported in your role by a dedicated GP Clinical Lead, Medical Clinical Director and the Clinical Service Manager/ Matron.&lt;/p&gt;\n&lt;p&gt;If there is anything else that is important to you in either your career or personal requirements, let us know and we will do our best to accommodate these.&lt;/p&gt;\n&lt;p&gt;We welcome your interest and any queries, for further information regarding this service please contact Patricia Bannar-Martin CSM/Matron patricia.bannar-martin@nhs.net.&lt;/p&gt;\n&lt;p&gt;Please note this position requires a Disclosure Barring Service check (DBS)&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "County Durham &amp; Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Sessional GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253586", "validThrough": "2021-05-02T23:59:59+0100"}