{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393  per annum inc"}}, "datePosted": "2020-11-02T12:15:59+0000", "description": "&lt;p&gt;&lt;strong&gt;1C Adult Critical Care Unit – Cardiothoracic post op care/ Critical Care Bed Coordination&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for a band 7 Senior Sister/Charge Nurse to join a dedicated team on our world class cardiac recovery/critical care unit. ACCU 1C specialises in nurse led and fast track recovery for elective and emergency cardiac surgery patients undergoing CABG, valve replacement, dissection repair and grown up congenital heart (GUCH) patients. ACCU on 1C is busy, dynamic and requires nurses that enjoy working in a fast paced and exciting environment. The unit also supports patients who require level 3 on-going critical care interventions in the post-op period.&lt;/p&gt;\n&lt;p&gt;Additionally this Band 7 role involves dedicated shifts to manage the bed coordination service within critical care. As the ACCU bed coordinator, you will be responsible for allocation of emergency admissions through the HAC/dissection/ECMO service, as well as coordinating flow from theatres into ACCU, and from ACCU to the wards. Attendance at site safety huddles is a vital responsibility of the bed coordinator, as well as networking and working alongside the site management team.&lt;/p&gt;\n&lt;p&gt;We are extremely proud to have been rated ‘outstanding’ in our leadership by the Care Quality Commission in 2017. Your professional development is very important to us and we offer you the opportunity to undertake ILS, ALS, CALS, ICU Transfer Training, Band 6 forums and airway management days. You will be allocated to work within a nursing team managed by a band 7 and have regular team away days.&lt;/p&gt;\n&lt;p&gt;We have a platform for nurse led research and are fortunate enough to be able offer our nursing staff opportunities to gain BSc, MSc and PHD qualifications, which is fully supported by our director of research and development. We are committed to providing a culture of continuous learning, which actively supports the professional and personal development of our staff.&lt;/p&gt;\n&lt;p&gt;As part of our Adult Critical Care commitment to enhance the working lives of our staff, we offer flexible working arrangements, self-rostering, childcare vouchers, and family-friendly policies and staff benefits including an excellent pension scheme.&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Keisha Mills – Matron &lt;strong&gt;Keisha.Mills@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Neil Anderson – Matron &lt;strong&gt;Neil.Anderson@nhs.net&lt;/strong&gt; Tel: 020 34655396&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKeisha MillsJob titleMatronEmail addressKeisha.Mills@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information Contact&lt;/p&gt;\n&lt;p&gt;-Keisha Mills on 020 3465 8006&lt;/p&gt;\n&lt;p&gt;-Keisha.mills@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomew&#39;s Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Patient Flow and Capacity Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252004", "validThrough": "2020-11-16T23:59:59+0000"}