{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Neg"}}, "datePosted": "2020-11-04T13:55:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Partnering Health Limited&lt;/strong&gt; has an exciting opportunity for a&lt;strong&gt; Clinical Lead &lt;/strong&gt;to join our team based in Guildhall Walk Healthcare Centre&lt;strong&gt;. &lt;/strong&gt;We are looking for this individual to join us for up to 8 sessions per week, 2 management and 6 clinical, however we will consider a more flexible arrangement for the right candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Guildhall Walk Healthcare Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The service provides a Primary Care Medical Service to over 8000 registered patients. We have a range of patients we provide care for with a large student population. We have a clinical team of GP’s, Advanced Clinical Practitioner, Practice Nurses and Healthcare Assistants working with the operational team of a Service Manager, Administrator’s and Receptionists to deliver high quality care to our patients. Clinical and operational support is also provided to the centre by the central PHL team based at Whiteley.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Clinical Lead role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an experienced clinical leader your leadership style is always delivered with a &lt;strong&gt;caring&lt;/strong&gt; and &lt;strong&gt;respectful&lt;/strong&gt; disposition. You will work closely with the Service Manager, Clinical Manager to support delivery of the contract requirements including QOF, LCS and DES and other CQUINs and Primary Care targets for the benefit of our patients. You will also develop effective teamwork and additionally work closely with Governance Manager to take accountability for service compliance with robust governance processes within PHL governance framework.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide clinical care to patients this will include assessing, diagnosing and treating patients presenting with clinical needs that can be met by Primary Care including, telephone triage and face to face assessments&lt;/li&gt;\n&lt;li&gt;Provide emergency care while waiting for emergency transfer of patient when appropriate&lt;/li&gt;\n&lt;li&gt;Provide advice and support to colleagues and the multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;Manage the flow of patients by balancing the clinical need of the patient with the capacity of the provider to deliver the necessary response.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Operational Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with the Service Manager &amp; Clinical Manager to support the development, delivery and review of the service specification to include (not an exhaustive list) QOF, LCS, DES, CQUINs and their KPI targets, resource profile and cost management.&lt;/li&gt;\n&lt;li&gt;Attend regular meetings with Service Manager to support the delivery of the service.&lt;/li&gt;\n&lt;li&gt;Provide clinical leadership for the Service and the primary health care team in delivery of clinical care and recruitment of clinical team members.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Lead Skills and Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced doctor with GP accreditation&lt;/li&gt;\n&lt;li&gt;Current registration with GMC and NHS performers list (with no conditions preventing working or restrictions on practice)&lt;/li&gt;\n&lt;li&gt;Experience of working in a GP practice with a lead role&lt;/li&gt;\n&lt;li&gt;Experience of urgent care environment such as A&amp;E and Out of Hours desirable but not essential&lt;/li&gt;\n&lt;li&gt;Record of on-going CPD and learning&lt;/li&gt;\n&lt;li&gt;MRCGP examination or equivalent experience&lt;/li&gt;\n&lt;li&gt;Sound knowledge of clinical governance&lt;/li&gt;\n&lt;li&gt;Will understand the political agenda and drivers influencing primary care provision.&lt;/li&gt;\n&lt;li&gt;Good leadership skills with the ability to influence and negotiate.&lt;/li&gt;\n&lt;li&gt;Good clinical skills in assessment, diagnosis and management of acute Primary care presentations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO8 8DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8939", "longitude": "-1.01816"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256091", "validThrough": "2020-11-18T23:59:59+0000"}