{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 equivalent depending on experience"}}, "datePosted": "2020-10-13T16:32:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Operating Department Practitioner | Nurse | Anaesthetics | Theatres | Band 6 equivalent depending on experience | Bristol | Full Time hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bristol Hospital are looking for an Anaesthetics ODP/Nurse to join our busy Theatres Department on a full time basis working 37.5 hours per week.&lt;br /&gt; &lt;br /&gt; As the only private hospital in the South West with an Intensive Care Unit, Spire Bristol Hospital has been providing excellent care, expertise and knowledge in a supportive and progressive environment for over 32 years. We bring together the very best of facilities and people that modern medicine can offer. We’re dedicated to providing quality treatment and aftercare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To support the theatre staff, ensuring high standards of effective care are delivered to all patients within the Theatre suite, whilst maintaining communication within the team.  You will be joining an already established team who have a great working environment and numerous training opportunities that will help you develop your potential.  You will be involved in all specialties including Cardiac, Neuro and Paediatrics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC/HCPC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 2 years post-graduation experience&lt;/li&gt;\n&lt;li&gt;Happy to train and develop&lt;/li&gt;\n&lt;li&gt;Excellent communication skills, along with being organised and can showcase excellent patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 or email carly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Anaesthetic Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225082", "validThrough": "2020-11-13T23:59:59+0000"}