{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751"}}, "datePosted": "2020-10-13T13:31:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor - Sexual Health 7 PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust are looking for a highly motivated, driven individual to join our team and support performance optimisation at the Garden Clinic sexual health service in East Berkshire. The successful candidate will support the day-to-day delivery and development of the medical aspects of the service and support the training of our nursing staff.&lt;/p&gt;\n&lt;p&gt;The successful candidate will motivate and train the nursing team and will work to ensure the service is meeting its objectives and continuing to provide a fantastic experience for patients. They will have existing staff management experience and an extensive background within sexual health. We are looking for someone who is enthusiastic and proactive in their thinking to join a service which is dedicated to delivering the best service possible.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join our team in an exciting period as we seek to implement a number of changes to improve the experience of our patients and our staff. We look forward to welcoming the successful candidate into the team and continuing the service’s excellent record of patient care and looking after our staff.&lt;/p&gt;\n&lt;p&gt;For further information please contact Anju Sharma, Sexual Health Service Manager on tel: 07760 422 988&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sexual Health Medical, Slough", "postalCode": "SL1 2BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5054", "longitude": "-.59374"}}, "title": "Specialty Doctor - Sexual Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224484", "validThrough": "2020-11-15T23:59:59+0000"}