{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 pro rata pa plus Outer HCAS"}}, "datePosted": "2020-11-02T12:39:46+0000", "description": "&lt;p&gt;NHS South East London Clinical Commissioning Group is the statutory body responsible for commissioning healthcare services to south east London’s 1.9 million residents of the boroughs of Bexley, Bromley, Greenwich, Lambeth, Lewisham and Southwark.&lt;/p&gt;\n&lt;p&gt;South East London CCG’s key priorities include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing more systematic and proactive management of chronic disease to improve health outcomes&lt;/li&gt;\n&lt;li&gt;Empowering patients and encouraging self-care&lt;/li&gt;\n&lt;li&gt;Integrating models of care&lt;/li&gt;\n&lt;li&gt;Ensuring urgent care systems maximise appropriate access of care for patients&lt;/li&gt;\n&lt;li&gt;Improving access to services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An exciting opportunity has arisen for a part time 7.5 hours per week Band 8c to join the Medicines Optimisation Team at Greenwich.&lt;/p&gt;\n&lt;p&gt;The post holder will hold corporate responsibility and take an operational lead in development, interpretation, implementation and monitoring of CCG medicines optimisation and quality improvement services and will play a role in the development, interpretation, implementation and monitoring of overall medicines optimisation policy and strategy in line with national policies.&lt;/p&gt;\n&lt;p&gt;The post holder will support and deputise for the Associate Director Medicines Optimisation (Greenwich) for all matters relating to medicines optimisation, clinical effectiveness, clinical safety, and pharmaceutical care pathways and prescribing. ­&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from candidates with experience of leading teams, supporting the development of strategies to meet changing organisational needs and inter-agency working and the development of joint projects .&lt;/p&gt;\n&lt;p&gt;Working pattern is 7.5 hours per week.&lt;/p&gt;\n&lt;p&gt;For more information or an informal chat before applying, please email your contact details to jin.on@nhs.net. To apply, complete the online application outlining your knowledge, skills and personal attributes that make you ideal for this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Woolwich Centre, 35 Wellington St, Woolwich, London", "postalCode": "SE18 6ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4893", "longitude": ".065404"}}, "title": "Assistant Director of Medicines Optimisation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252086", "validThrough": "2020-11-06T16:52:04+0000"}