{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-30T14:49:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Pre-Assessment Staff Nurse | Pre-Assessment | Band 5 dependent on experience | Spire Fylde Coast - Blackpool&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Fylde Coast Hospitalare looking to recruit an experienced and committed Nurse to join our surgical team. Working with a wide variety of specialisms you will be able to develop your clinical skills in a modern and supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Hospital covers a wide variety of surgical procedures, you will support in assessing patient’s health and well-being across a complex and changing caseload, assisting in the delivery of care to meet the patient’s needs. You will actively promote best practice and contribute towards quality improvements, collect collate and organise data, interpret all of the information and make a justifiable assessment, making this available to relevant others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong understanding of, and the ability, to follow policies and criteria for surgical suitability&lt;/li&gt;\n&lt;li&gt;Completing pre-operative checks and referring on for review as and where needed&lt;/li&gt;\n&lt;li&gt;Liaising with GP’s to follow through on any extra care needed to reduce cancellations&lt;/li&gt;\n&lt;li&gt;You will undergo your pre-assessment course, fully funded&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Surgical nursing experience&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;li&gt;Time management skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contactUsman Masood at usman.masood@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool", "postalCode": "FY3 8BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8261", "longitude": "-3.01957"}}, "title": "Pre-Assessment Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250663", "validThrough": "2020-11-30T23:59:59+0000"}