{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T08:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Recovery Care Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our care group is enabling and empowering a person to find their own way after a period of mental ill health, giving them the tools to live well with their condition.&lt;/p&gt;\n&lt;p&gt;A success to us is us being able to discharge someone who then feels confident to face the world, not defined by their diagnosis.&lt;/p&gt;\n&lt;p&gt;One in four of us will experience a mental health condition in our lifetime and that is a very personal, individual journey with often a number of complex factors in play.&lt;/p&gt;\n&lt;p&gt;Our close-knit multidisciplinary teams are made up of nurses, peer support workers, psychologists, psychiatrists, healthcare assistants, support, time and recovery workers and occupational therapists. They bring together their expertise and, with a service user and their loved ones who need that extra support, identify the best and most appropriate pathways available to recovery and wellness.&lt;/p&gt;\n&lt;p&gt;Someone might be referred into our service via their GP, after meeting our liaison psychiatry colleagues, based in Kent’s acute hospitals, or they may have sought help themselves via our single point of access team.&lt;/p&gt;\n&lt;p&gt;The initial early intervention work at that point is critical and that set period of bespoke treatment often changes the story for someone in crisis, paralysed by fear and uncertainty and unable to see themselves past their mental health label.&lt;/p&gt;\n&lt;p&gt;We also care for people stepping down from an acute setting, preparing to get back to their friends and families and life again in the community and those with a diagnosed personality disorder to access effective help in order to manage the symptoms.&lt;/p&gt;\n&lt;p&gt;Under our umbrella is the vocational rehabilitation service, a recent finalist in a national award for its work supporting people to recognise their skills, talents and potential and encouraging them back into meaningful activities and employment, recognising the game-changing properties of routine and a sense of belonging.&lt;/p&gt;\n&lt;p&gt;Complementary to this is our Kent and Medway Recovery and Wellbeing College, currently being piloted in Thanet. The college offers educational courses to support mental, physical and emotional wellbeing in shared learning environments in the community. It supports people to identify and build on their own strengths and make sense of their experiences. This helps people take control, feel hopeful and become experts in their own wellbeing and recovery. This has been developed with people with lived experience.&lt;/p&gt;\n&lt;p&gt;The roles in our care group are well-defined and the opportunities are wide and varied across 10 community mental health teams, six rehabilitation units and our specialist services.&lt;/p&gt;\n&lt;p&gt;This is a great time to get involved. The first major investment programme in two decades has been announced by Kent’s clinical commissioning groups, allowing us to expand this work and make an even bigger difference. And you will see the difference we make on a daily basis.&lt;/p&gt;\n&lt;p&gt;Our patients are aged between 18 and 65.&lt;/p&gt;\n&lt;p&gt;We are looking for dedicated Staff Nurses to join us and be part of our forward thinking, progressive team that invests in staff through continuous development and career progression.&lt;/p&gt;\n&lt;p&gt;You might be a newly qualified RMN/RNLD nurse, a RMN looking to return to work or an experienced nurse looking for a new challenge. In addition, we are always happy to talk to you about your flexible working needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ganesh Sivan, Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Telephone: 01227 812348&lt;/p&gt;\n&lt;p&gt;Email: ganesh.sivan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Medway NHS and Social care Partnership Trust, Various", "postalCode": "CT1 1AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2778", "longitude": "1.11098"}}, "title": "Qualified Mental Health Nurse - Community Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253138", "validThrough": "2020-11-22T23:59:59+0000"}