{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-29T17:01:26+0000", "description": "&lt;p&gt;&lt;strong&gt;NORFOLK AND NORWICH UNIVERSITY HOSPITAL NHS FOUNDATION TRUST &amp; QUEEN ELIZABETH HOSPITAL NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;CONSULTANT POST IN DERMATOLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications are invited for this new post of Consultant Dermatologists across the NNUH NHS Foundation Trust &amp; QEH NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;It is a full-time post (10 sessions) &amp; will expand the team of consultants at the NNUH from 14 to 15 and at the QEH from 2 to 3.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Trusts provide a cohesive service across Norfolk with a regional research hub and centre of research excellence in Norwich and a well-established DGH unit providing a full spectrum of dermatology services in King’s Lynn. The units work together to provide a unified Skin Cancer MDT, Regional Clinic, SpR Training and the UEA Medical Student Teaching Programme.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The NNUH NHS Foundation Trust provides a full range of acute clinical services through the NNUH (1000 beds) and Cromer District Hospital, including more specialist services such as oncology and radiotherapy, neonatology, orthopaedics, plastic surgery, ophthalmology, rheumatology, paediatric medicine and surgery. The staff of over 7000 treat more than 1 million patients – people from Norfolk, neighbouring counties and further afield. &lt;br /&gt;As a university teaching hospital the research and development strategy has been developed in partnership with the University of East Anglia. The NNUH also works closely with partners in the Norwich Research Park and Norwich Radiology Academy to take forward ambitious targets for research and development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The QEH Dermatology Unit is purpose built with full outpatient, day care and surgical services. GRIFT highlighted the unique, seamless skin cancer service which has been developed in conjunction with plastic surgery colleagues. The department is supported by 6 specialist nurses working at Band 6 and above and the West Norfolk Community Dermatology Nursing Team. Education has a high profile as we teach students from Cambridge University and UEA.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;em&gt;&lt;strong&gt;If quality of life is important to you, this post provides a unique opportunity to be based in Norwich with its thriving arts and café culture or in idyllic rural Norfolk with access to the North Norfolk Coast, its endless beaches and internationally renowned bird watching. &lt;/strong&gt;&lt;/em&gt;&lt;br /&gt;&lt;em&gt;&lt;strong&gt;London can be reached in one and a half hours by train from either Norwich or King’s Lynn.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Candidates must have their Certificate of Completion of Specialist Training (CCST) in Dermatology or equivalent or be within six months of completion.&lt;/p&gt;\n&lt;p&gt;Full and part-time applicants will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For informal enquires please contact Dr Gillian Dootson at QEH on 01553 613601 gillian.dootson@qehkl.nhs.uk or Dr Anila Kapadia at NNUH on 01603 288265 anila.kapadia@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Closing date 30th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Interview date 6th January 2021&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NNUH Norwich and QEH Kings Lynn - Dermatology department, Norwich and Kings Lynn", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Consultant Dermatology NNUH and QEH Foundation Trust Hospitals", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249187", "validThrough": "2020-11-30T23:59:59+0000"}