{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T10:02:21+0000", "description": "&lt;p&gt;&lt;span&gt;The North Yorkshire Breast Screening Service provides a high quality Breast Imaging Service across the North Yorkshire region.. The Services is based at the Magnolia centre at York hospital and Imaging is provided at various locations around the region. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated individual who has a desire to make a difference in the health care environment whilst being committed to excellence in patient care and delivering a high quality administration function, to join our team as a Team leader.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an administration team leader you will be responsible for supporting the administration manager in ensuring all aspect of the breast screening and imaging administration services are undertaken accurately and efficiently undertaking the day to day management of the team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Using bespoke computer software you will create and maintain clinic sessions and supervise the team in all aspects of booking into both screening and symptomatic clinics. You will regularly review and monitor the appointments to ensure capacity is maximised at all times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will also support the administration manager with aspects of the digital picture archiving system to ensure the secure and safe transfer of digital images.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Educated to GCSE level or equivalent including Maths and English at grade C or above, you must be able to demonstrate: excellent computer/IT skills to include Microsoft Office Packages, good organisational skills, the ability to work to high quality standards, paying attention to detail and accuracy, &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A positive attitude to work, willingness and motivation to learn and develop is essential coupled with excellent communications skill in written, oral and telephone communications in order to lead the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As team leader you will be required to demonstrate a full understanding of patient confidentiality and information governance, supporting the team in ensuring compliance. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw.  In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note: This job advertisement will close at short notice, once sufficient applications have been received. We encourage you to apply promptly, if you are interested in this role. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGeraldine OxbyJob titleBreast Screening Office ManagerEmail addressGeraldine.oxby@york.nhs.ukTelephone number01904 721742&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "YORK", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Breast Imaging Admin Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249627", "validThrough": "2020-11-15T23:59:59+0000"}