{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-10-09T11:16:10+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Liverpool University Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Radiology Department - Directorate of Imaging&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;MSK Radiology Fellow&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Musculoskeletal Imaging fellowship is a one year post-radiology CCT training program. The fellowship provides clinical experience across the full range of disorders affecting the adult musculoskeletal system. The program incorporates the application and interpretation of the full range of MSK imaging examinations and procedures including radiography, ultrasonography, computed tomography, MRI, MR arthrography and image guided percutaneous biopsy. There will be the opportunity to gain experience in image guided spinal intervention for pain management.&lt;/p&gt;\n&lt;p&gt;Fellows will be responsible for the reporting of in and outpatient MSK examinations across the two sites of the Royal Liverpool University Hospital (RLUH) and the Diagnostic and Treatment Centre (DTC) based at the nearby Broadgreen Hospital. Fellows will participate in divisional multi-disciplinary team meetings in addition to supporting the regional soft tissue sarcoma (STS) service.&lt;/p&gt;\n&lt;p&gt;The post will include one day a week of dedicated research time and fellows will be expected to produce at least one peer reviewed research project over the course of the year. RLUH is closely affiliated to the University of Liverpool across the road and fellows will have access to online library resources. Some contribution to the Mersey School of Radiology teaching programme will be expected.&lt;/p&gt;\n&lt;p&gt;The RLUH site is a busy, acute teaching hospital serving a population of 2 million and performs approximately 200,000 radiology examinations a year of which 40,000 are musculoskeletal studies. The RLUH department uses two 1.5T MRI scanners, a 3T university MRI and four CT scanners ranging from 64-128 multi-slice systems. Orthopaedic out-patients and elective surgery are based at the DTC where there is a third 1.5T MRI scanner. There are MSK ultrasound lists running at both sites offering diagnostic and therapeutic image guided injection services. The DTC ultrasound lists offer open access scanning for upper limb and Rheumatology Early Arthritis out-patient clinics. The RLUH is a regional STS diagnostic and treatment centre and fellows will gain experience in sarcoma imaging and biopsy. Fellows will be encouraged to par5ticipate in orthopaedic and spinal MDT meetings, which act as a valuable forum for case discussion and acquiring research project ideas.&lt;/p&gt;\n&lt;p&gt;The MSK Imaging Fellowship attracts a top scale (yr6) SpR pay rate with no on-call commitment. There may be opportunity to contribute to additional paid reporting sessions for those interested.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr. A. Mistry Job title Consultant Radiologist Email address alpesh.mistry@liverpoolft.nhs.uk Telephone number 0151 706 2915 Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr. Alpesh Mistry - alpesh.mistry@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0151 706 2915&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RLUH, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "MSK Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219930", "validThrough": "2020-11-06T23:59:59+0000"}