{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-20T08:45:40+0100", "description": "&lt;p&gt;Clinical Performance Improvement &amp; Quality Assurance Manager - Band 8a&lt;/p&gt;\n&lt;p&gt;City and County base with some home working and travel&lt;/p&gt;\n&lt;p&gt;The Leicester, Leicestershire and Rutland (LLR) CCGs’ are progressing their plans to appoint to its new single management team to work with the newly appointed Executive Leadership Team. Internal application are welcome from existing staff who are at risk of redundancy, and who meet the majority of the essential criteria (where any gaps could be easily addressed) and for whom the role would provide suitable alternative employment. In addition, applications will be considered from other internal applicants who can demonstrate that they meet all of the essential criteria.&lt;/p&gt;\n&lt;p&gt;The post holder will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Performance Improvement &amp; Quality Assurance Team supporting the team in creating a culture of positive improvement across Leicester, Leicestershire and Rutland.&lt;/li&gt;\n&lt;li&gt;Lead the Performance Improvement &amp; Quality Assurance Team and wider system teams in developing, monitoring, achieving and sustaining improvements in quality within the system to facilitate improvements in patient outcomes.&lt;/li&gt;\n&lt;li&gt;Lead and facilitate with internal and external partners the developing of an Improvement Performance Strategy with an underlying framework which can be shared across the system and utilised by the Design Groups.&lt;/li&gt;\n&lt;li&gt;Ensure the delivery of safe high quality services and secure sustained improvements in relation to patient experience, patient safety and clinical effectiveness by working closely with key system partners.&lt;/li&gt;\n&lt;li&gt;Deputise for the Assistant Director of Performance Improvement as required.&lt;/li&gt;\n&lt;li&gt;Provide clinical and quality support across the teams as part of their portfolio of work.&lt;/li&gt;\n&lt;li&gt;Oversee and be responsible for the improvement performance and quality assurance within key design group areas and work towards solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be shortlisted, you will need to demonstrate the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;That you are a qualified clinician i.e. Nurse, midwife, therapies or Pharmacist (this list is not exhaustive) with current registration to relevant professional body&lt;/li&gt;\n&lt;li&gt;Experience of working in a similar organisation / environment, and successfully influencing and managing stakeholders and advising around quality assurance.&lt;/li&gt;\n&lt;li&gt;Ability to provide and receive highly complex, sensitive and contentious information and provide solutions from this.&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interviews for this post will take place via MS teams on Monday 16th November 2020&lt;/p&gt;\n&lt;p&gt;Closing date: Friday 6th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to discuss your application, please contact Hannah Hutchinson on hannah.hutchinson@leicestercityccg.nhs.uk or 07771 378752.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ST JOHNS HOUSE, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Clinical Performance &amp; Quality Assurance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233494", "validThrough": "2020-11-06T23:59:59+0000"}