{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T10:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Walsall Healthcare NHS Trust&lt;/strong&gt; provides integrated acute and community Healthcare in the West Midlands serving a population of 260,000 residents. Walsall Manor Hospital houses the full range of district general hospital services. The £170 million development was completed in 2010 and we are continually upgrading. Construction of the new integrated critical care unit has commenced and is due to be completed 2018, and building development has also commenced for our new Neonatal Unit.&lt;/p&gt;\n&lt;p&gt;We provide high quality, friendly and effective community health services from multiple sites covering Walsall. Our multidisciplinary services include rapid response and home-based care, so that those with long term conditions and the frail elderly can remain in their own homes.&lt;/p&gt;\n&lt;p&gt;We are recommended by colleagues as a place to work which is supported by the trusts promises to work as part of a team, be supported to maintain high standards and appreciate every individual. We are committed to investing in our workforce by recruiting to Nursing, Midwifery, Allied Health Professional and HealthCare Science vacancies.&lt;/p&gt;\n&lt;p&gt;We have already made substantial progress following our CQC visit and this has been recognised by NHS Improvement. We are committed to delivering high quality care in our wards and services and as part of our improvement plans.&lt;/p&gt;\n&lt;p&gt;**Exciting Opportunity to join our team**&lt;/p&gt;\n&lt;p&gt;This is a truly exciting time to join our friendly, open and highly effective Imaging team here at Walsall Manor Hospital.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an inspiring and credible operational leader who has the energy, drive and determination to successfully become the Professional Lead for Sonography here at Walsall Manor.&lt;/p&gt;\n&lt;p&gt;The Professional Lead for Sonography is an active member of the Trust&#39;s professional management team and will assist the Professional Lead for Imaging Services and the Head of Diagnostics in planning and delivering a co-ordinated, well-structured and well-resourced Imaging services.&lt;/p&gt;\n&lt;p&gt;As the Professional Lead for Sonography the post holder will work closely with the Professional Lead for Imaging Services and the Clinical Director and will have overall responsibility for Walsall’s Sonography services. They will provide strategic leadership and operational management for the service and will be accountable for the effective management of all non-medical resources needed to deliver a comprehensive Sonography service. This will include the line management of all non-medical staff within Sonography. They will be responsible for achieving performance targets and in conjunction with colleagues such as the medical workforce, Head of Diagnostics, senior radiographic, ultrasound and administrative teams be responsible for developing the service improvement strategy.&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity to play a critical role in the operational delivery of Sonography services at Walsall Manor ensuring that they deliver high quality patient outcomes and financial sustainability for the Trust.&lt;/p&gt;\n&lt;p&gt;To succeed in this role you will need to have excellent interpersonal skills, be able to demonstrate outstanding leadership qualities and have the ability to empower and lead others to ensure the delivery of high quality patient care.&lt;/p&gt;\n&lt;p&gt;If you feel you have the necessary experience to lead, direct and effectively manage the Sonography services here at Walsall Manor then please don’t hesitate and contact us today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Charity Matthews&lt;/p&gt;\n&lt;p&gt;Job title: Professional Lead Imaging Services&lt;/p&gt;\n&lt;p&gt;Email address: charity.matthews@walsallhealthcare.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01922721172&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120984.jpg", "name": "Walsall Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120984"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manor Hospital, Walsall", "postalCode": "WS2 9PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5822", "longitude": "-1.99918"}}, "title": "Professional Lead for Sonography", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255346", "validThrough": "2020-11-18T23:59:59+0000"}