{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pa"}}, "datePosted": "2020-11-03T08:45:38+0000", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated, enthusiastic and innovative individual to join the Luton and Dunstable Therapies team.&lt;/p&gt;\n&lt;p&gt;Our band 5 rotational Occupational Therapy posts are a great opportunity to experience the acute hospital setting to its full. You will work with a wide range of patients and multi-disciplinary team members; giving you a great opportunity to practice and enhance your OT skills across multiple specialities.&lt;/p&gt;\n&lt;p&gt;We have 6 month rotations across the following specialities: Acute and Emergency Medicine, Orthopaedics and Surgery, Neurology and Complex Medicine. Each rotation will give you an opportunity to work with a variety of highly skilled staff that will help you to develop your knowledge and clinical skills.&lt;/p&gt;\n&lt;p&gt;The acute setting is face paced and requires quick and decisive decision making. Although this can be challenging we have great support structures and learning opportunities in place to support new staff to develop their skills: The Preceptorship programme; this provided to all newly qualified staff to support you with the transition from student to a qualified staff member, in service training opportunities: within your rotation, as a department and in OT specific ‘OT aspiring to excellence sessions’ which focus on OT specific skills. All staff also have an allocated supervisors who will give you opportunities for 1:1 supervision sessions.&lt;/p&gt;\n&lt;p&gt;Luton and Dunstable Hospital offers expert, excellent care to a large diverse patient population. The Hospital is situated close to Luton airport and has excellent links to London. The Therapy department understands the importance of a good work life balance and the well-being of staff. Our staff support group are a great advocate for staff and periodically arrange social events to help staff to get to know each other.&lt;/p&gt;\n&lt;p&gt;We are open to application for permanent positions, job shares or bank work.&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours including weekend and bank holidays.&lt;/p&gt;\n&lt;p&gt;If you would like more information or to arrange an informal visit, please contact: Cathy O’Mahony OT/PT Manager or Marcella Daalhuizen Clinical Lead Occupational Therapist on: 01582 497350.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;line-height: 1.35em;&quot;&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253170", "validThrough": "2020-11-17T23:59:59+0000"}