{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-30T12:36:11+0000", "description": "&lt;p&gt;We are looking for motivated and enthusiastic Registered Nurses at Barnsley NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Do you relish the opportunity to work in a Trust that has been rated as ‘Good’ in a recent CQC report, and is &lt;/em&gt;renowned for their friendly culture, family feel and convenient location&lt;em&gt;?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like your work to be flexible to fit your lifestyle and circumstances, and do you have a passion for nursing?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Barnsley Hospital serves a population of over a quarter of a million people and provides a full range of district hospital services to the local community and surrounding area. This includes emergency department services, outpatient clinics, inpatient services and maternity and children’s services. We also provide several specialised services, including cancer and surgical services, in conjunction with Sheffield Teaching Hospitals.&lt;/p&gt;\n&lt;p&gt;There is a continuing programme of capital investment in our estate. In the past few years, we have successfully completed an £8 million development of the Imaging Department, a £1 million refurbishment of the Acute Medical Unit and £2 million on the Emergency Department Clinical Decision Unit (CDU) and Resuscitation Unit.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The flexible worker will be required to carry out all relevant forms of quality care to patients who attend Barnsley Hospital. In return for your hard work and your professional, caring and reliable service you will have access to the following benefits: –&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Flexible working to suit your lifestyle&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;First choice of shifts&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Competitive pay rates&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Work this week, and get paid the next week&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Book and manage shifts on the go&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Build holiday allowance for every shift you work&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;24/7 Support when you need it&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Working in partnership with Barnsley NHS Foundation Trust, NHS Professionals provides a service that combines intimate understanding of the Trusts temporary and flexible workforce requirements with the reliability, quality and value for money that only a managed service can offer. NHSP saves over £70 million per year for NHS Trusts.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NHS Professionals (NHSP) is the leading provider of managed flexible worker services to the NHS. More than 100,000 general and specialist nurses, doctors, midwives, administrative and other healthcare professionals have registered to work flexibly&lt;/em&gt;&lt;em&gt;through the bank&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;To apply for this post, the post holder will:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Have a minimum of 6 months paid experience in an acute hospital environment within the last 2 years. &lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices.&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Be proficient in the delivery of care to patients&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S75 2EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5583", "longitude": "-1.49958"}}, "title": "Registerd Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250195", "validThrough": "2020-11-13T23:59:59+0000"}