{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-27T15:45:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Access Team Booking Clerk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS is the biggest employer in Europe. It’s a world-renowned institution and an exciting place to work, full of challenges and opportunities.&lt;/p&gt;\n&lt;p&gt;The Robert Jones and Agnes Hunt Orthopaedic Hospital (RJAH) is one of the leading specialist orthopaedic hospitals in the country, with some of the highest levels of staff and patient satisfaction, as well as a strong reputation for innovation. We work together as a team of over 1,600 expert members of staff to make a difference for our patients and their families.&lt;/p&gt;\n&lt;p&gt;Our latest CQC Report was published in February 2019 and saw us rated as ‘Good’ overall and ‘Outstanding’ for care.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a new booking clerk to the busy Appointments section within the Surgery Division.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we’re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be involved in the delivery of the initial appointment and follow-up appointment patient pathway of the Referral to Treatment Target (RTT) in line with national targets.&lt;/p&gt;\n&lt;p&gt;This will be achieved through the booking of consultant’s clinics and management of their waiting lists, with the recording of all necessary information on the Trust Patient Administration System(PAS). The post holder will also be expected to carry out other clerical duties as deemed necessary.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to be able to display discretion when dealing with sensitive and confidential information and be able to deal calmly and politely with staff of all levels and the public both face to face and by telephone.&lt;/p&gt;\n&lt;p&gt;Applicants must be educated to GCSE level or equivalent. Experience of working in a busy office environment and using computers is essential. Experience of using Patient Administration Systems is desirable but training in the use of necessary computer systems will be provided. Knowledge of Referral to Treatment waiting times is essential.&lt;/p&gt;\n&lt;p&gt;Our aim is to aspire to deliver world class patient care, and we want talented, dedicated and passionate people to help us achieve this.&lt;/p&gt;\n&lt;p&gt;Our continued success is accomplished through the skills and expertise of our staff, which is underpinned by our values: Friendly, Caring, Excellence, Professional and Respect. If your values align to ours, and you would like to join us in aspiring to deliver world class patient care, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why RJAH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Joining RJAH is more than just a job – we want our people to have the best opportunities to thrive in their role.&lt;/p&gt;\n&lt;p&gt;Whether you&#39;re starting out in your career, or have a wealth of experience – we’re always looking to recruit outstanding individuals in a range of clinical areas, as well as support and administrative roles.&lt;/p&gt;\n&lt;p&gt;We have a range of fantastic staff benefits on offer to everyone who joins RJAH and you&#39;ll have access to state-of-the-art facilities and outstanding professional development opportunities.&lt;/p&gt;\n&lt;p&gt;RJAH has strong links with a range of universities including Staffordshire, Keele, Glyndwr, Chester and Birmingham.&lt;/p&gt;\n&lt;p&gt;Shropshire is also one of the most attractive parts of the country, with a rich historic culture and excellent transport links. The hospital is located on a site outside Oswestry, just off the A5. The nearest train station is in Gobowen, approximately two miles from the hospital. The station is part of the Chester to Birmingham line.&lt;/p&gt;\n&lt;p&gt;For further information please contact Ben Carter on 01691 404360&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121259.jpg", "name": "Robert Jones and Agnes Hunt Orthopaedic Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121259"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Robert Jones and Agnes Hunt Orthopaedic Hospital, Oswestry, SY10 7AG", "postalCode": "SY10 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8842", "longitude": "-3.03268"}}, "title": "Access Team Booking Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245251", "validThrough": "2020-11-06T23:59:59+0000"}