{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 to £74,661"}}, "datePosted": "2020-11-03T10:41:44+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Isle of Wight NHS Trust&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Specialty Doctor – General Medicine&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Medical Services&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;10 Programmed Activities per week&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;This new full-time post is an exciting opportunity for ambitious specialty doctors to join our department in the provision of general medical services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will be ward based providing senior cover during the day and support to medical trainees and nursing staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst the main duties are designed to increase senior cover and support on the wards and MAU, post holders are encouraged to develop their skills and experience by attending outpatient clinics and other medical related activities such as research.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will also participate in the 1 in 10 medical on call rota during which time clinical duties will include the in-patient management of all patients admitted to the medical wards and Medical Admissions Unit. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The job plan would be reviewed to accommodate attendance at OPD or other related activities following discussion and agreement of supervising consultant and lead clinician.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is keen to support specialty doctors who wish to obtain further qualifications and experience. Those wishing to obtain specialist registration through the CESR route will be encouraged to do so and supported by the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is situated in an environment that offers an excellent quality of life. The Isle of Wight, Britain&#39;s own island in the sun is located off the south coast of England and has a population of 138,000. It has much to offer in the way of outdoor leisure pursuits, family living and is also home to the annual music festival. It is a beautiful place to live and relax after work. Connections to the mainland are frequent, fast and efficient, with a choice of crossings via catamaran, hovercraft, or car ferry, from Southampton or Portsmouth, both of which are 90 minutes by rail from London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For further information or an informal chat please contact Dr Adam Feather – Divisional director for Medicine, adam.feather1@nhs.net or Mrs Katy Davis, Assistant Operational Manager for Medicine Associate Director of Operations, Medicine. Both can be contacted via switchboard on 01983 822099.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Specialty Doctor General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253506", "validThrough": "2020-11-17T23:59:59+0000"}