{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T13:30:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Are you thinking about what you want for the future? Is it time to take control of your career and make the next step into a role where you will genuinely make a difference every time you come to work?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Then our Emergency Care Assistant role could be the role for you. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;We are recruiting in our HIGH WYCOMBE and WEXHAM stations ONLY. &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In the North East node (Wexham and High Wycombe) there is a high level of trauma cases due to the busy road networks (with one of the busiest road junctions in Europe) and a lot of country lanes. We could offer you a chance to develop and gain experience in a wide variety of work, along with opportunities to develop clinical decision making, as there are a number of hospital options to consider when managing your patients, including two Major Trauma Centres, as well as several cardiac and stroke centres.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The North East node is a welcoming, friendly area, and has a real family feel. With close links to London, this area could offer you what you are looking for!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Great news!&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt; We are now able to offer applicants wishing to be stationed at High Wycombe or Wexham station the chance of assistance in gaining your C1 entitlement. &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;We will support and fund this process for you and just ask that you have your provisional C1 entitlement on your licence when you apply.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for people who can demonstrate our values of Caring – Team Work – Professionalism and Innovation in all they do, so if you have experience of remaining calm under pressure, can demonstrate your caring and compassionate nature and don’t mind working shifts, then we want to hear from you now!&lt;/p&gt;\n&lt;p&gt;Detailed information regarding the criteria required for an Emergency Care Assistant is available within the Job Description and Person Specification, however, some of the essential criteria are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;C1 Provisional at point of application – evidence of this will be obtained from you before you are invited for interview&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;3 GCSE’s at Grade C (4) or above including English and Maths or equivalent qualification. If you can demonstrate experience equivalent to this level of qualification, particularly where this is combined with experience in a similar healthcare or caring role, may also be considered&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Please note &lt;/strong&gt;&lt;strong&gt;– original qualification certificates will be required, if you do not have copies of these, you will need to request replacement certificates please contact us if this is something you will require to do so we can provide you will a link to assist. &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please read the person specification and job description carefully and make sure that all the minimum requirements are clearly noted on your application form in the correct place.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An FAQ can be found attached &lt;strong&gt;(Please look at the Additional Information on the right-hand side titled &#39;Read this before applying&#39;)&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please demonstrate how you are suitable for this role and how you meet the person specification by detailing in your supporting statement your experience, knowledge and skills for the role. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please demonstrate how you are suitable for this role and how you meet the person specification by detailing in your supporting statement your experience, knowledge and skills for the role. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held in November and will be conducted via Teams, due to the tight timescale, we are unable to offer any alternative dates for interviews. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You must be able to commit to the 9 week training programme which consists of a full corporate induction, clinical training which includes basic life support skills, moving and handling and assisting the Paramedic. Our training takes place at our Education Centre in Bicester and a 4 week driver training course including Blue Light conditions is run from our Education Centres in Bicester or Newbury. (Training is non-residential, we do not provide mileage or accommodation during your training period)&lt;/p&gt;\n&lt;p&gt;Once you have successfully completed your training, you will continue on to a six month operationally monitored assessment-training programme, which is monitored locally by your Team Leader.&lt;/p&gt;\n&lt;p&gt;In return, we offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;· Opportunity to apply to be a student paramedic and other career development&lt;/li&gt;\n&lt;li&gt;· Access to apply for other continual professional development&lt;/li&gt;\n&lt;li&gt;· Access to apply for other educational qualifications&lt;/li&gt;\n&lt;li&gt;· Occupational Health support along with an Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;· Access to NHS negotiated discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We will close the advert as soon as we reach the required number of applications – so don’t delay apply now! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are an internal candidate already employed by SCAS and drive for the service we will be checking your internal licence in line with SCAS driving standards and the Trusts CPP V19 driving policy. We will accept up to and including 4 internal penalty points, if you have more than these specified points your application may be withdrawn. All checks will be completed after shortlisting but prior to an assessment or interview invite.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe &amp; Wexham", "postalCode": "HP11 2JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.629", "longitude": "-.762384"}}, "title": "Emergency Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254141", "validThrough": "2020-11-15T23:59:59+0000"}