{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-26T15:06:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Musculoskeletal Physiotherapist Outpatients/ First Contact Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 7&lt;/p&gt;\n&lt;p&gt;37.5 hours/ Part time and Job Share considered&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit a number of enthusiastic and motivated Band 7 Physiotherapists who are registered with the Health Care Professions Council to join the Musculoskeletal (MSK) Physiotherapy Service in the Midlands Partnership NHS Foundation Trust. With the establishment of our new First Contact Practitioner (FCP) roles in recently formed PCNs, we are looking to expand our workforce to meet this demand whilst also ensuring expertise within our existing Physiotherapy Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will involve both working within musculoskeletal outpatient clinic settings andas a Physiotherapy FCP in partnership with selected GP practices within the local area. Both roles require expert skills to assess/triage, diagnose, treat and manage a variety of MSK problems. Applicants must have relevant postgraduate MSK training and experience at a senior level within the NHS. The FCP role will involve seeing patients, without prior referral from their GP, establishing a rapid/accurate diagnosis, a management plan and arranging onward referrals; thus streamlining pathways of care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a highly skilled clinical team of experienced Band 7 physiotherapists and established Extended Scope Practitioners within our Staffordshire Care Group to help support you and develop your knowledge and skills. We are also currently working with the local University to develop our workforce. You will be part of an established network of advanced clinicians for peer support and professional development as well as having a yearly appraisal. The post holders will be expected to participate in evaluating the service, audit and research. As part of the job role post holders will also be required to supervise and provide training for band 6 and 5 physiotherapists, unqualified staff and undergraduate physiotherapy students.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holders will be based in both Primary care and Physiotherapy outpatient settings. You will need to be flexible and able to travel to work in various locations across the Trust as the service requires. This will include some lone working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and/ or an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ellinor Delicata&lt;/p&gt;\n&lt;p&gt;Operational Lead Physiotherapy&lt;/p&gt;\n&lt;p&gt;Physiotherapy Department&lt;/p&gt;\n&lt;p&gt;Leek Moorlands Hospital&lt;/p&gt;\n&lt;p&gt;Ashbourne Road&lt;/p&gt;\n&lt;p&gt;Leek&lt;/p&gt;\n&lt;p&gt;ST13 5BQ&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 0300 123 1984 ext. 3638&lt;/p&gt;\n&lt;p&gt;Mobile: 07766442556&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Email: Ellinor.Delicata@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Staffordshire", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Advanced Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243051", "validThrough": "2020-11-23T23:59:59+0000"}