{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34471", "minValue": "34471", "unitText": "YEAR", "value": "£34471.06 per annum plus enhancements"}}, "datePosted": "2020-10-01T17:13:41+0100", "description": "&lt;p&gt;The Priory Hospital Middleton St George is located in Darlington, County Durham and provides individualised treatment and care for people with mental health needs of adult working age and who present with complex and challenging behaviours, in a safe and supportive environment. Our comprehensive integrated services offer complete care pathways allowing service users to transfer effortlessly between the most appropriate care, meeting individual needs enabling recovery and re-engagement within the community and maximising life opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our multi-disciplinary teams provide care for male and female service users, working collaboratively with their commissioners, across our 7 wards and our nearby community house.  We deliver recovery and rehabilitation services which include a specialist female Personality Disorder service and have opened two new purpose built PICU units (one male one female). Our focus is on the delivery of excellent care, empowering service users to progress towards the least restrictive setting and towards independence. Our vision is to place our Service Users at the heart of our service provision, working closely with them and their carers to support their recovery and rehabilitation.&lt;/p&gt;\n&lt;p&gt;Of most recent note we have been assessed as &quot;outstanding&quot; by the CQC in November 2018 and we aim to continue to improve on our levels of performance and care delivery throughout 2020 and the coming years.      &lt;/p&gt;\n&lt;p&gt;The Priory Hospital Middleton St George have new and exciting opportunities for a motivated, experienced and skilled Clinical Team Leaders to work with and report directly to our Ward Managers. There is  also the oportunity to rotate posts through the different services on site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will have noticeable leadership skills along with a strong drive to develop other members of the team. This is an exciting opportunity to work within a talented multidisciplinary team and the candidate will be responsible for ensuring that the ward team possesses the skills, knowledge and motivation to deliver the highest quality of care to service users with complex mental health and self harming behaviour, and their families.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will possess excellent clinical, team and communication skills. You need to be able to demonstrate quality in delivery of nursing care and the clinical environment. The successful applicants will be forward-thinking Nurses, who will lead and coach staff by example.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will ensure that MHA and MCA standards are upheld and work to uphold NMC&#39;s code of practice whilst ensuring all relevant policies are in place, reviewed and updated as and when necessary (e.g. ward guidelines/patient information) in liaison with the Ward Manager and MDT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will provide support for the Ward Manager in delivering Clinical Leadership for the nursing team at all times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will participate in pre-admission assessments and the hospital clinical governance agenda and monitor standards of care through regular audit and take action where standards are not met.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will ensure clinical records are well maintained and systems are in place for staff to communicate effectively on clinical issues ensuring awareness of legal implications and ensure all ward management responsibilities are met and all reports are up to date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates must be a Registered Mental Health/Learning Disability Nurse (RNMH / RNLD).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What we’d like to give you:&lt;/p&gt;\n&lt;p&gt;•  A competitive salary&lt;/p&gt;\n&lt;p&gt;•  Disclosure check cost coverage&lt;/p&gt;\n&lt;p&gt;•  Comprehensive induction and commitment to ongoing training&lt;/p&gt;\n&lt;p&gt;•  25 days annual leave plus bank holidays&lt;/p&gt;\n&lt;p&gt;•  Birthday Holiday  - Your Birthday as an extra day’s annual leave&lt;/p&gt;\n&lt;p&gt;•  Free on-site parking&lt;/p&gt;\n&lt;p&gt;•  Access to our on-site gymnasium&lt;/p&gt;\n&lt;p&gt;•  Online benefits and cashback rewards&lt;/p&gt;\n&lt;p&gt;•  Cycle to work scheme&lt;/p&gt;\n&lt;p&gt;•  SMART Pension option&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will be required to apply for a disclosure at the required level from the Disclosure &amp; Barring Service (DBS).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DARLINGTON", "postalCode": "DL2 1TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5172", "longitude": "-1.43348"}}, "title": "CLINICAL TEAM LEADER (RMN/RNLD) Fixed Term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209465", "validThrough": "2020-11-27T23:59:59+0000"}