{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc HCAS"}}, "datePosted": "2020-10-22T09:00:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Ealing Community Partners: NHS, Ealing Council, voluntary and specialist providers working together to deliver health and social care for the people of Ealing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Community-based health care in Ealing offers integrated care. West London NHS Trust, in partnership with Central and North West London NHS Trust, (CNWL) the Hillingdon Hospitals NHS Trust and some other smaller providers, including third sector, have formed a partnership to provide integrated community health services in Ealing. The total value of the new 10 year contract is about £50m per year.&lt;/p&gt;\n&lt;p&gt;We have also committed to invest in improved links with local voluntary sector organisations (for example ECIL, Ealing Dementia Concern, Ealing Mind) and other community assets for innovation and flexibility.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated Band 5 Physiotherapist to work within the Ealing Community Musculoskeletal Physiotherapy Service. This is a full time post of 37.5hrs/week.&lt;/p&gt;\n&lt;p&gt;We have a commitment to clinical quality and service efficiency and can offer a supportive working and learning environment.&lt;/p&gt;\n&lt;p&gt;The physiotherapy team is integrated with our interface service and there is opportunity to work alongside Extended Scope Practitioners and Musculoskeletal Physicians, as well as experienced senior physiotherapists. This is a non-rotational MSK post and thus some previous experience as band 5 physiotherapist is required. We aim to provide a supportive environment with the chance be involved in a range of innovative service projects.&lt;/p&gt;\n&lt;p&gt;This role is an Ealing Community Partners role through CNWL&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMaitri PandyaJob titleExtended Scope Physiotherapist and Clinical Lead of MSK Physiotherapy serivceEmail addressmaitripandya@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Maitri Pandya (Extended Scope Physiotherapist and Physiotherapy Team Lead) on email maitripandya@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Community, Ealing", "postalCode": "W5 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4951", "longitude": "-.298876"}}, "title": "MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237643", "validThrough": "2020-11-08T23:59:59+0000"}