{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T11:31:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Stockport NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Staff Nurse - 37.5 hours per week &amp; 26.6 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stockport Together&lt;/strong&gt; is the name given to the partnership of the local NHS organisations and Stockport Council working with GPs and voluntary organisations to develop a single plan to improve health and social care services across the borough. The Stockport Together programme is changing the way in which we deliver health and social care services across Stockport. As part of this, new ways of working have been defined and we are now collaborating with each other across organisations towards common goals.&lt;/p&gt;\n&lt;p&gt;Over the next three years Stockport Together will continue to implement new models&lt;/p&gt;\n&lt;p&gt;of care that has been designed by patients, carers, clinicians and social care professionals based on evidence of what works best and what good care looks like.&lt;/p&gt;\n&lt;p&gt;Our work in &lt;strong&gt;Core Neighbourhoods &lt;/strong&gt;is at the very heart of Stockport Neighbourhood Care. Services will be offered seven days a week to help people remain healthy and build independence. The aim being that the “&lt;strong&gt;right care is delivered to the right people at the right time”.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stockport Together &lt;/strong&gt;is in the position to offer an exciting new opportunities to enthusiastic individuals who would be keen to support our integrated teams working across Adult Social Care and Stockport Foundation Trust. The post holders will work with the Community Nurses and Adults Social care staff to provide a first class service to the residents of Stockport.&lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, innovative practitioner with a variety of clinical skills. The District Nursing Service provides care in patients’ homes as well as residential homes caring for patients with complex needs and supporting carers.&lt;/p&gt;\n&lt;p&gt;Stockport District Nursing Service offers a supportive preceptorship programme for staff new to community and welcomes applications from newly qualified staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A 37.5 hour Band 5 Staff Nurse post to work in Stockport Integrated Community, based at Bridgehall Community Centre, Stockport to work with the Victoria District Nursing Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder should have good organisational and assessment skills be flexible.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of your duties you may be expected to help cover a busy treatment room when the need arises.&lt;/p&gt;\n&lt;p&gt;This post requires good communication and interpersonal skills and the ability to be adaptable, reliable and approachable. In addition you will need to be able to demonstrate up to date knowledge on relevant nursing issues with knowledge of Stockport Together and the integration of services in Stockport. The post holder will need to lone work, and be a car driver and have a car available for work.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS at a cost of £43.50. This will be deducted from your first Trust salary.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarina SchofieldJob titleDistict Nurse Team LeaderEmail addresscarina.schofield@nhs.netTelephone number07894 802730&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgehall Community Centre, Stockport", "postalCode": "SK3 8LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3939", "longitude": "-2.17223"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249956", "validThrough": "2020-11-20T23:59:59+0000"}