{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-15T15:03:37+0100", "description": "&lt;p&gt;East Lancashire is a great place to live and work short rail journeys to the vibrant cities of Manchester, Liverpool and Leeds but also within a short distance to stunning countryside and areas of natural beauty ideal for walking and cycling.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Permanent Band 5 Podiatrist to join the Podiatry service based within the East Lancashire Locality. The post offers the fantastic opportunity for you to further develop your clinical and leadership skills in the role of band 5 Podiatrist.&lt;/p&gt;\n&lt;p&gt;The ELHT Podiatry service provides a dynamic, flexible, responsive and solution focussed holistic service for a patient caseload including patients with Diabetes, Rheumatology, Vascular, Connective Tissue Diseases, Tissue Viability and Wound care conditions.&lt;/p&gt;\n&lt;p&gt;The Podiatry Service works very closely with primary and secondary care and social care and works with a wide range of health care professionals including Consultants, GPs, Social Services, District Nurses, Treatment Room staff, Nursing Staff.&lt;/p&gt;\n&lt;p&gt;The Podiatry Service undertakes primarily high risk clinical work including wound care, nail surgery, biomechanics, and emergency clinics. The Podiatry Service does not provide a social nail cutting service.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a corporate and local departmental induction with a dedicated mentor and will have a 6 month Preceptorship period during which they will complete a competency framework.&lt;/p&gt;\n&lt;p&gt;You will receive support from your locality Team Leader and Specialist Podiatrists and will be part of a large East Lancashire Podiatry Service with approximately 45 wte staff. You will receive regular clinical supervision and have an annual PDR from your designated mentor.&lt;/p&gt;\n&lt;p&gt;Applicants must be able to demonstrate evidence of recent learning and examples of continued professional and clinical development. The Podiatry service offers a comprehensive programme of supervision and clinical training opportunities and has a proactive approach to service development activities, in line with the trusts, divisional and service level objectives. Staff would be supported and encouraged to work closely together in order to deliver a holistic approach to patient care, following the six key elements of Care, Compassion, Courage, Competence, Communicating effectively and Commitment.&lt;/p&gt;\n&lt;p&gt;As we are a community based service it is essential that you are a car driver with access to a vehicle for work purposes.&lt;/p&gt;\n&lt;p&gt;The working hours may be worked over 7 days between the hours of 8am-8pm.&lt;/p&gt;\n&lt;p&gt;Responsibilities would also include supporting and mentoring more junior members of staff and participating in wider service development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDawn StalkerJob titlePodiatry Team LeaderEmail addressDawn.stalker@elht.nhs.ukTelephone number01282 805921&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To work accross East Lancashire Hospital trust, Burnley", "postalCode": "BB11 2DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7914", "longitude": "-2.23893"}}, "title": "Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228725", "validThrough": "2020-11-06T23:59:59+0000"}