{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-03T12:46:10+0000", "description": "&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Do you want to work for an NHS Foundation Trust rated OUTSTANDING by the CQC?&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for an OUTSTANDING Ward Administrator to join our patient focused team on Bay Ward at Berrywood Hospital.&lt;/p&gt;\n&lt;p&gt;Bay Ward is a 17 bed female acute mental health ward for adults predominantly between the ages of 18 and 65. The ward is &#39;AIMS&#39; accredited by the Royal College of Psychiatrists.&lt;/p&gt;\n&lt;p&gt;You will have excellent organisational skills and be proficient in the use of IT Systems. You must be proficient using Microsoft Office software. You will be expected to adapt to work proficiently in the health systems we use which include HealthRoster, Aggresso, SystmOne.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate excellent communication skills in order to provide timely and accurate correspondence to patients, carers and a wide variety of healthcare professionals. It is essential that you have a good telephone manner.&lt;/p&gt;\n&lt;p&gt;You will demonstrate that you will have the ability to work collaboratively within the service providing full administrative support for Bay Ward and the wider adult inpatient service at the direction of the Service Manager. You will be providing support to the clinical team by ensuring that reports, Health Roster, clinician appointments, data performance updates and minutes for team meetings are produced effectively and efficiently. You will be flexible in respect of completing other tasks as directed by the team, the Ward Matron and the Service Manager.&lt;/p&gt;\n&lt;p&gt;Whilst you will have a dedicated office, you will also be able to work in a busy nursing and therapy office and will be able to prioritise your tasks, taking into account the needs of the team and the service.&lt;/p&gt;\n&lt;p&gt;You will demonstrate a positive attitude which encompasses our Trust leadership behaviours of Working together, Taking Responsibility, Being Authentic and Embracing Change.&lt;/p&gt;\n&lt;p&gt;You will be an individual who is enthusiastic, compassionate, flexible and creative in their approach and can work alongside nursing staff and the wider multi-disciplinary team to provide quality and effective care.&lt;/p&gt;\n&lt;p&gt;You will demonstrate an enthusiasm for professional development and will be motivated to further your understanding and skills through various training opportunities which we will provide.&lt;/p&gt;\n&lt;p&gt;You will be part of a dynamic and supportive team, benefiting from a comprehensive supervision and appraisal system.&lt;/p&gt;\n&lt;p&gt;We will give you the opportunity to realise your full potential and support you to develop a career that is right for you. Make NHFT the right choice for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGail EverettJob titlePA to Assistant DirectorEmail addressgail.everett@nhft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Wayne Lawrence&lt;/p&gt;\n&lt;p&gt;Service Manager - Inpatient Service&lt;/p&gt;\n&lt;p&gt;01604 685449&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Berrywood Hospital, Northampton", "postalCode": "NN5 6UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2475", "longitude": "-.960105"}}, "title": "Ward Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254017", "validThrough": "2020-11-17T23:59:59+0000"}