{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 An element of unsocial hours pay"}}, "datePosted": "2020-11-03T15:46:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within LCHS for &lt;strong&gt;two&lt;/strong&gt; new positions, supporting the line management of the Operations Centre who work 24/7 across 365 days per week.&lt;/p&gt;\n&lt;p&gt;This is a real opportunity for strong people and process managers to make a difference to the heart of the organisation and support the Service Lines to deliver outstanding patient care.&lt;/p&gt;\n&lt;p&gt;We are looking to attract, flexible, organised and improvement focussed individuals to lead the teams based at Beech House in Lincoln.&lt;/p&gt;\n&lt;p&gt;The role holders will demonstrate strong leadership skills and be responsible for the delivery of first class patient services and organisation priorities, not only enabling clinicians to focus on providing great care, close to home but also ensuring processes are streamlined, safe and effective.&lt;/p&gt;\n&lt;p&gt;Role 1 – 37.5 Hours working Weds – Saturday 0800/1800.&lt;/p&gt;\n&lt;p&gt;Role 2 – 37.5 Hours working Sunday – Tuesday 0800/1800 and Weds 1330-2300&lt;/p&gt;\n&lt;p&gt;Reporting to the Operations Service Centre Manager, you will be responsible for ensuring the staff within, deliver a proactive and outstanding customer service across the organisation. This role is also responsible for identifying and setting performance levels for the team, leading process review and engaging with all key stakeholders across all levels and both internally and externally.&lt;/p&gt;\n&lt;p&gt;Other key elements of this role include; identifying a clear career pathway and development opportunities for all team members, enabling and supporting staff to work to agreed key performance indicators and ensuring everyone accessing LCHS services has a positive experience.&lt;/p&gt;\n&lt;p&gt;You must hold a relevant degree or the ability to demonstrate relevant work experience, in addition to evidence of relevant and continuing professional development (CPD).&lt;/p&gt;\n&lt;p&gt;NHS management experience and evidence of working in a busy customer service environment is essential, alongside the ability to build high performing teams, and work at high levels with managerial colleagues in other organisations and services.&lt;/p&gt;\n&lt;p&gt;We are looking for exceptional communication skills, a positive approach and commitment to delivering our business aims and the ability to develop and maintain professional and personal credibility.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the service and the type of information to be managed, you will need to be able to exercise a high degree of accuracy, sensitivity and confidentiality.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Minimum essential criteria must be met in order to be shortlisted&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMelanie RalphJob titleOperations Centre Service and Transformation LeadEmail addressMelanie.ralph1@nhs.netTelephone number07583127261&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beech House (Ability to undertake a mixture of home working due to Covid is available), Lincoln", "postalCode": "LN5 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2265", "longitude": "-.524149"}}, "title": "Operations Centre Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254620", "validThrough": "2020-11-17T23:59:59+0000"}