{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-09-30T16:00:15+0100", "description": "&lt;p&gt;&lt;span&gt;County Durham and Darlington NHS Foundation Trust is the largest integrated care provider in North East England, delivering a full range of community and secondary care to a population of 600,000 people through 2 acute hospitals, 6 community hospitals and 80 community bases. We employ 8,000 staff with an annual budget of £500 million. We are a high performing organisation with a track record of successful delivery and a strong reputation for education and research.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The diverse geographical nature of the region means you can be in the countryside in less than ten minutes from all our major towns and cities with some of the most stunning scenery and outdoor space in the country.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;There is a strong sporting and cultural heritage in the north east suiting a diverse range of interests, coupled with some fantastic school and academic institutions and readily available and reasonably priced properties to suit all needs.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Trust is based on two acute sites at Darlington Memorial Hospital and University Hospital North Durham with most acute medical services and specialties duplicated on each site. The acute stroke unit is based at University Hospital of North Durham. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Acute Medical Service has recently undergone a significant service re-design. The acute medical units, on both sites, have developed Same Day Emergency Care Units (SDEC) to facilitate early assessment and treatment of referrals from GPs and ED departments. Approximately 20% of all the 21000 medical referrals are seen and assessed in the SDEC units. Of these 85% are discharged home the same day. The SDEC units are supported by dedicated nursing staff and have agreed protocols for common medical presentations. There is rapid access to a wide range of diagnostic services such as radiology and lab services allowing admission avoidance or early discharge of patients.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;There is now significant scope to increase the capacity of the SDEC units with enhanced SDEC clinical areas co-located with Front of House services; these additional post would support the vision of excellent care provided in the right place first time. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Trust is investing in several new posts within Acute Care and these posts are to increase the consultant capacity within the acute medical team to meet our aim of providing high quality safe, compassionate, joined up care 7 days a week. Full time posts are based on a 10 PA contract. A ‘special’ interest (as defined by the Acute Internal Medicine curriculum or dual CCT) will be encouraged and welcomed as will less than full time working.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Pre-application enquires are welcome by contacting &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Mr Jeremy Cundall, Medical Director, Tel 01325 743620: email: j.cundall@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Dr Paul Peter, Care Group Director, email: paulpeter@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Allan Anthony – Consultant Clinical Lead, DMH: email: allananthony@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Saifuddin Chowdhury – Consultant Clinical Lead, UHND: email saifuddin.chowdhury@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Please note this position requires a Disclosure Barring Service check (DBS) formerly CRB.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington / Durham", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Consultant Physician in Acute and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207106", "validThrough": "2020-11-18T23:59:59+0000"}