{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-16T16:31:20+0100", "description": "&lt;p&gt;An exciting opportunity has arisen within the Complex Case Management Team which operates within the&lt;/p&gt;\n&lt;p&gt;Community and Intermediate Care Services Division&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will support improvements in discharge planning and patient flow to ensure that&lt;/p&gt;\n&lt;p&gt;ELHT can deliver its objectives of Safe, Personal and Effective care, for all of our patients across multiple&lt;/p&gt;\n&lt;p&gt;sites.&lt;/p&gt;\n&lt;p&gt;You will assist and provide a proactive and efficient service to all adult patients across ELHT and provide&lt;/p&gt;\n&lt;p&gt;education and advice to maintain high standards of discharge planning processes. You will ensure and promote the timely access to health and social care resources, mobilising discharge to assess pathways of care and working with our Home First delivery, to enable safe and effective discharge. An integral part of the role is to facilitate holistic patient centered care and work in partnership with other independent teams and services across the Health and Social Care Economy. We are looking for a highly motivated, dynamic individual with excellent communication skills and the ability to manage change. The postholder must have detailed understanding of discharge planning processes as well as recent experience within an acute hospital environment. You must have the confidence and skills to work effectively across organisational boundaries and understand the complex and sometimes conflicting priorities that this role entail&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerry HerronEmail addresskerry.herron@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across all East Lancashire Hospital Sites, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Integrated Discharge Service Therapy Complex Case Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231118", "validThrough": "2020-11-15T23:59:59+0000"}