{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365"}}, "datePosted": "2020-11-03T12:51:11+0000", "description": "&lt;p&gt;&lt;strong&gt;**THIS VACANCY IS ONLY OPEN TO EMPLOYEES OF WORCESTERSHIRE ACUTE HOSPITALS NHS TRUST**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Theatre Team Leader, Anaesthetic and Recovery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The operating department at Kidderminster Treatment Centre currently provides elective Day and Short stay surgery across a range of surgical specialities. Due to investment in staffing, recruitment and retention we are pleased to offer a position for an enthusiastic, motivated and professional Team Leader in our surgical team&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Treatment Centre at Kidderminster has four theatres, two treatment rooms, and a 6 bedded recovery area within the department. The department provides a five day a week surgical service and has a dedicated team of theatre practitioners and support workers led by a Management Team who are supported by the Clinical Theatre Manager and countywide Theatre Matron.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to delivering a high standard of care to all of our patients, reflected in our core 4ward values.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful candidate will have experience within the Anaesthetics and Recovery speciality, and will need to be a highly organized individual who can lead a team ensuring the highest standards of patient safety and care are maintained. &lt;/span&gt;&lt;span&gt;You will be able to monitor the use of equipment and resources, ensuring cost effectiveness and the best use of resources.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent communication skills and flexibility will be an essential characteristic of anyone wishing to apply for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Deputising for members of the Band 7 team will be a requirement of anyone wishing to apply for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The teaching and development of junior colleagues will be an important part of your role therefore it is essential that you are in possession of a relevant teaching certificate or experience. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Acting as a role model within your team, the department and as an ambassador for our organization will also be an expectation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post involves working Monday – Friday 8-6 but as our operating theatre teams are part of a countywide service these hours are subject to change. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Registered Operating Department Practitioner with recent Anaesthetic or Recovery and mentoring experience&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Or&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Registered Nurse with recent Anaesthetic or recovery and mentoring experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An important feature of your application will be your motivation to maintain standards and use evidence-based practice to underpin your role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact one of our senior team leaders Julie Stoten or Mark Southall on 01562 513077, or email: Julie.stoten@nhs.net or marksouthall@nhs.net for further information. We are happy to arrange a time for you to come and look round our department. Come join our journey.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kidderminster Treatment Centre", "postalCode": "DY11 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3852", "longitude": "-2.26133"}}, "title": "Team Leader - Anaesthetics &amp; Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254051", "validThrough": "2020-11-17T23:59:59+0000"}