{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-27T14:15:54+0000", "description": "&lt;p&gt;We currently have a vacancy for a Research Governance Facilitator. We are looking for a person with strong communication and organisational skills to support the administration of research studies within the trust.&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of Clinical Governance, the post holder will be responsible for checking that a valid documentation pack including appropriate approvals has been received prior to the commencement of any research study. They will ensure that accurate records are maintained for all research activity in the organisation to allow regular reporting to take place. The post holder will support the Head of Clinical Governance in performance monitoring and providing data for the trust reporting schedule.&lt;/p&gt;\n&lt;p&gt;The post holder will provide support and guidance to trust staff on research applications and queries and will actively promote the research function at the trust.&lt;/p&gt;\n&lt;p&gt;Hours per week:37.5 hours of which 30 hours are a permanent contract for research governance and 7.5 hours will be funded for a 12 month fixed term contract by the Greater Manchester Clinical Research Network to support in clinical trial set up.&lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Stephanie Ratcliffe Job title Head of Clinical Governance Email address stephanie.ratcliffe@nhs.net Telephone number 01625 661018&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Research Governance Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244913", "validThrough": "2020-11-10T23:59:59+0000"}