{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T16:16:34+0000", "description": "&lt;p&gt;We are looking to recruit to the Corporate Affairs Senior Officer position working across the three CCGs in Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;The postholder will be joining the Corporate Governance Team in ensuring that the CCGs have in place sound, integrated corporate governance arrangements, policies, procedures and structures to ensure compliance with legal and constitutional requirements.&lt;/p&gt;\n&lt;p&gt;The post will include managing a team and overseeing the corporate secretariat, corporate governance arrangements of statutory committees, maintenance and disclosure of statutory registers and documents. This includes managing the corporate affairs function with a strong customer-focused approach.&lt;/p&gt;\n&lt;p&gt;You will have knowledge and experience of compliance with corporate governance systems and processes, and management of corporate secretariat function and corporate and statutory committees. You will have a proven track record of experience of risk management, data protection and information governance, including Freedom of Information requirements and management of claims / legal cases. The post holder will be required to have excellent communication skills with the ability to communicate at all levels across the organisations and across external stakeholders, particularly in the management of the complaints and enquiries function.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDaljit BainsJob titleHead of Corporate GovernanceEmail addressdaljit.bains@eastleicestershireandrutlandccg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester and Leicestershire, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Corporate Affairs Senior Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254753", "validThrough": "2020-11-13T23:59:59+0000"}