{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 if Trainee"}}, "datePosted": "2020-10-23T16:16:02+0100", "description": "&lt;p&gt;Beds &amp; Herts Breast Screening Services are looking for&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Advanced practitioner – A4C BAND 7 - 37.5hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an advanced practitioner with a post graduate qualification in breast interventional procedures to join our friendly team.&lt;/p&gt;\n&lt;p&gt;We would also consider applications from radiographers with a post graduate certificate in mammography who have an interest in training for the interventional qualification.&lt;/p&gt;\n&lt;p&gt;The Beds &amp; Herts Breast Screening Service is one of the largest units in the country and provides breast screening and assessment services to women living across Bedfordshire and Hertfordshire.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to support symptomatic, screening, assessment and follow up clinics in the Breast Unit at the Luton and Dunstable Hospital and screening on 4 mobile units. The ability to get to the mobiles is essential.&lt;/p&gt;\n&lt;p&gt;Opportunities for role progression form an exciting part of our continuing service development plan. We currently have 10 mammographers working in advanced practice and have recently trained a consultant radiographer.&lt;/p&gt;\n&lt;p&gt;We can offer you the chance to join a great friendly team, aiming to provide the best service to our women.&lt;/p&gt;\n&lt;p&gt;This post has a GOQ under the Sex Discrimination Act 1975 Section 7 (2) and is therefore restricted to female applicants only.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;line-height: 1.35em;&quot;&gt;For further details / informal visits contact: please contact Anne- Marie Leach, deputy Screening Manager on 01582 497593 - anne-marie.leach@ldh.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust (formerly known as The Luton and Dunstable NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beds and Herts Breast Screening Unit, Luton", "postalCode": "LU40EY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8946", "longitude": "-.472776"}}, "title": "Mammographer / Advanced Practitioner Interventional", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241249", "validThrough": "2020-11-13T23:59:59+0000"}