{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:32:36+0000", "description": "&lt;p&gt;Barnet Emergency Department is an exciting place to work.&lt;/p&gt;\n&lt;p&gt;We are looking for band 6 Adult Nurses who want to be part of a caring and compassionate ED Family and build on their development in their career.&lt;/p&gt;\n&lt;p&gt;Barnet Emergency Department are passionate about getting it right for patients and their families. In order to achieve this we are looking to appoint passionate, enthusiastic, motivated and dynamic Band 6 Nurses who are ready to take the next step to develop their leadership and management skills.&lt;/p&gt;\n&lt;p&gt;Our department has an integrated Urgent Care Centre and children’s Emergency Department. The Urgent Care Centre within the Emergency Department has Emergency Nurse Practitioners working with the GPs to deliver an efficient and responsive service for patients presenting with minor injuries and illness. Furthermore, we are a Trauma Unit receiving trauma patients from across Hertfordshire and North London.&lt;/p&gt;\n&lt;p&gt;We are a busy unit receiving up to 90 ambulances per day and over 120,000 patients per year. We pride ourselves on our high quality, safe and effective handover process being forward thinking in our approach for our patients.&lt;/p&gt;\n&lt;p&gt;In addition to this there is a consultant led care of the elderly team who assess older patients for appropriate admission or, with our team of therapists, organise enhanced social care support in the community.&lt;/p&gt;\n&lt;p&gt;Training and support for all staff is key to a happy team and safe patient care, this is why we have a clinical practice education team dedicated to the development of our nurses. We are committed to developing and supporting a modern career framework for our nurses in the Emergency Department. You will be supported every step of your Emergency care career pathway by our senior nurses and Clinical Practice Education team. You will be allocated one of the facilitators to support you along with a team leader. We pride ourselves in continual development for our staff.&lt;/p&gt;\n&lt;p&gt;We aim to develop our nurses into accomplished senior emergency Nurses and provide opportunities to learn advanced clinical skills with our two university-accredited emergency nursing courses, advance life support course and advanced trauma nursing course. For adult nurses with an interest in children’s nursing we offer a secondment in the paediatric emergency department and the chance to attend our in house paediatric emergency nursing course&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We will help you develop your leadership skills with our in house development programme and support you to attend NHS Leadership Academy Courses and UCL Partners leadership development programmes.&lt;/p&gt;\n&lt;p&gt;Barnet ED understands the importance of our staff wellbeing. Therefore we are undertaking a Quality Improvement project in order to improve happiness at work. We hold mindfulness sessions during handover and encourage our team to take debrief time. The quality improvement ideas have been generated by our staff, for our staff. We have taken many steps towards encouraging wellbeing and happiness and are continually listening to our team and their needs. You will self-roster your own working month and consider shift patterns to meet your work life balance.&lt;/p&gt;\n&lt;p&gt;If you are interested in working at Barnet ED but not sure if it is for you, we can provide you with opportunities for taster days to shadow some of the team.&lt;/p&gt;\n&lt;p&gt;Band 6 opportunities include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Protected Supernumerary period&lt;/li&gt;\n&lt;li&gt;ALS&lt;/li&gt;\n&lt;li&gt;ATLS&lt;/li&gt;\n&lt;li&gt;Band 6 development competencies&lt;/li&gt;\n&lt;li&gt;Opportunities for a children’s ED secondment and internal children’s ED course for those wishing to experience paediatric nursing&lt;/li&gt;\n&lt;li&gt;Self rostering&lt;/li&gt;\n&lt;li&gt;Step up to lead (leadership courses)&lt;/li&gt;\n&lt;li&gt;Opportunities to be involved in Quality Improvement/change management&lt;/li&gt;\n&lt;li&gt;Mindfulness and wellbeing at work&lt;/li&gt;\n&lt;li&gt;IMPACT day – time for you to make an impact on your department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in working at Barnet but not sure Barnet is for you, we can provide you with opportunities for taster days to shadow some of the team. Candidates not local to the area will be supported by our accommodation and relocation team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding an interview. We will use Zoom and similar tools to conduct testing and interviews. Due to the challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dean Heuer - Clinical Practice Educator – 0208 216 6070: dean.heuer@nhs.net&lt;/p&gt;\n&lt;p&gt;Penny Soteris- Clinical Practice Educator- 02082166070 penny.soteris@nhs.net&lt;/p&gt;\n&lt;p&gt;Loraine Chowdry - Senior Matron – 0208 216 5012: loraine.chowdry@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 6 Junior Sister/Charge Nurse - Emergency Department Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244540", "validThrough": "2020-11-25T23:59:59+0000"}