{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-21T10:01:51+0100", "description": "&lt;p&gt;&lt;strong&gt;We are seeking an enthusiastic Paediatric or Learning Disabilities Staff Nurse to join our Short Breaks team, including applications from newly qualified nurses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Children&#39;s Short Breaks Team provides short breaks at a residential 4 bedded bungalow set in Aylsham in North Norfolk. Children who attend the unit are aged 8 - 18 years of age and have complex health needs and learning disabilities. We also provide care at children&#39;s homes for children aged 0 - 18years who have complex health needs. This post will be based predominantly at Squirrels, however may also involve working in the community based team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will be able to demonstrate experience of working in partnership with other key professionals and agencies, and working with parents as partners in their child’s care. Applicants will have experience of working with children or young people who have complex health needs and/or learning disabilities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A requirement of this role is to be able to work independently and as a team and have good communication skills. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role includes providing day to day nursing care to the children who receive short breaks, reviewing and updating assessments and care plans, use of electronic records, running the unit, and supervising staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post will require flexibility in working hours and includes a 24 hour rotation including long days, short days, nights, weekends and bank holidays. We are open throughout the year and support families across Norfolk. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All applicants should be able to demonstrate commitment to CPD.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Christine Fields, Clinical Lead, christine.fields@nchc.nhs.uk, 07796144938 or Julie Sabberton 01263 734938&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Squirrels, Aylsham", "postalCode": "NR11 6LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7941", "longitude": "1.23904"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235779", "validThrough": "2020-11-17T23:59:59+0000"}