{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata if part time"}}, "datePosted": "2020-11-05T10:01:15+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking for enthusiastic and motivated Children and Young people nurses to join our friendly team on our modern unit. All contract types available, including full time, part time or bank. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to be flexible and adaptable working on the Ward and the adjacent Day Assessment Ward and, to cover night duty covering various specialties with a varied workload. You should have good interpersonal and communication skills and have the ability to work well within the team. You will be committed to providing safe care with a compassionate and caring manner, and will have the ability to work with children and their families assessing, planning, implementing and evaluating individualised family centered care considering their individual needs and prioritising care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Children’s unit is a bright purpose built 9 year old unit and consists of Outpatients, Sarum Ward and Woodlands Day Assessment Unit. The unit has 16 beds for children aged 0-16 years and staff care for children with varying specialties; this includes general paediatrics, orthopaedics ENT, plastics, Burns, dermatology, general surgery etc. The unit is part of the Spires Cleft Centre and, are a Shared Care unit with Southampton University hospital for Children with Oncological Conditions. We work closely with ED, DSU and NICU and have previously seconded staff to these areas when required as part of staff professional development. We are developing outreach support to ED and DSU. We host Children and young people’s Student Nurses if you have experience with mentoring students and safeguarding, this would be advantageous.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The goal for our children’s unit is.....to provide an outstanding experience for every baby/child/young person and their family by our friendly responsive, cohesive team of professionals providing safe, caring and compassionate individualised care in an amazing environment! Informal visits very welcome and encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mandy Cooper&lt;/p&gt;\n&lt;p&gt;Job title Senior Sister&lt;/p&gt;\n&lt;p&gt;Email address Mandy.cooper3@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01722 336262 ext 2982&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;The department welcome informal visits over microsoft teams! Contact us to arrange&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury District Hospital, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Registered Nurse - Paediatrics (Sarum Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257157", "validThrough": "2020-11-19T23:59:59+0000"}