{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 p.a. inc. HCA (Pro Rata)"}}, "datePosted": "2020-10-16T15:32:10+0100", "description": "&lt;p&gt;Clinical Specialist Occupational Therapist – Paediatric Neuroscience&lt;/p&gt;\n&lt;p&gt;Evelina London Children’s Hospital&lt;/p&gt;\n&lt;p&gt;Fixed Term: 3 years&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Evelina London Children’s Hospital (ELCH) in the field of paediatric neurosciences.&lt;/p&gt;\n&lt;p&gt;Are you keen to develop both your clinical and leadership skills in paediatric occupational therapy? Excited by the opportunity to work in a unique service with a supportive team? We are looking for someone with energy and drive to innovate, who is excited by the possibility of working in and leading a cohesive team delivering a novel rehabilitation service.  .  You will have established expertise in working with children with neurodisabilities, ideally have undertaken further training in standardised assessment and have a knowledge of the evidence base for OT delivered interventions in paediatric neuroscience.  The ideal candidate will have experience of working with babies/infants at risk of cerebral palsy, and/or children and young people with cerebral palsy or acquired brain injury.&lt;/p&gt;\n&lt;p&gt;Within this varied role, you will hold day to day operational responsibility for the Evelina REACH rehabilitation service. As the clinical specialist you will lead this small team and be involved in strategic planning and development supported by the consultant occupational therapist. You will carry a caseload delivering best evidenced assessment and rehabilitation for children young people and families. In the capacity of a senior clinician you will also work within allied brain injury outpatient clinics with multidisciplinary colleagues.&lt;/p&gt;\n&lt;p&gt;You will be expected to be a proactive member of our senior leadership team within occupational therapy.  You will also be flexible and provide cover to support other services within paediatric occupational therapy as required.&lt;/p&gt;\n&lt;p&gt;As a dynamic innovative evidence informed occupational therapy service the post holder will have opportunities to develop their skills across the four pillars of practice, including research, audit, service transformation and knowledge translation.&lt;/p&gt;\n&lt;p&gt;Depending on the candidate there may be an opportunity extend the clinical aspects of the role to a full time post (37.5 hours).&lt;/p&gt;\n&lt;p&gt;If this sounds like a great opportunity for you in developing your career we would be keen to hear from you.&lt;/p&gt;\n&lt;p&gt;Due to the current impact of Covid-19 on NHS services, interviews will be held virtually unless otherwise notified.&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November 2020 at Midnight&lt;/p&gt;\n&lt;p&gt;Interviews will be held Friday 20th November 2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits, you are strongly encouraged to contact&lt;/p&gt;\n&lt;p&gt;Jill Massey, Clinical Specialist Occupational Therapist &lt;/p&gt;\n&lt;p&gt;jill.massey@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Evelina London Children&#39;s Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Clinical Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230907", "validThrough": "2020-11-08T23:59:59+0000"}