{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Medical and Dental"}}, "datePosted": "2020-10-20T09:35:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Health Education England – North East and North Cumbria&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Wilderness Fellowship&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;- Entry level: ST4+&lt;br /&gt;- To commence: February 2021&lt;br /&gt;- Duration: 24 months&lt;br /&gt;- Post Numbers: Maximum of 2&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The School of Acute Specialities and Health Education England North East and North Cumbria invite applications for a two-year Wilderness Fellowship hosted between the regional training programme Health Education England North East and the University Central Lancashire (UCLan). There are two posts on offer from February 2021, with teaching taking place at the National Centre for Remote and Rural Medicine (NCRRM) at the UCLan West Cumbrian Campus near Whitehaven; the Emergency Medicine clinical placement is at the Emergency Department Cumberland Infirmary Carlisle. 50% of the training year will be spent undertaking academic work; the remainder of the 50% will be spent undertaking clinical practice at the appropriate training grade for the trainee, developing their clinical portfolio. This will be one of two Fellowship posts.&lt;/p&gt;\n&lt;p&gt;The Fellowship content includes an academic portion that requires the trainee to undertake their learning “in situ”, logging their CPD activities and attendance at conferences and courses; this is brought together with the support of one of the UCLan tutors. The end point is an academic submission (for example a portfolio of learning) to demonstrate acquisition of knowledge which when combined with credit accumulated in the completion of other modules will result in the award of Postgraduate Certificate. Further learning can continue up to the award of MSc.&lt;/p&gt;\n&lt;p&gt;Trainees in programme will show their academic progress by a credit accumulation model. This involves showing attainment either by single modules or completion of whole programmes. The Trainee can exit at single module level with a CATS points transcript; PG certificate (60 credits), Diploma (120 credits) or Masters level (180 credits). Modules include: Working in Urgent Care Medical Services (20 credits) / providing Urgent Medical Care (40 credits) / Operational Practice and Using Technology in Urgent Care (20 credits) / Human Factors and Managing Safe Dispositions (20 credits) / Risk Management and Preparedness (20 credits). Modules can also be taken from the UCLan MSc Leadership / MSc Clinical Practice and MSc Medical Education programmes.&lt;/p&gt;\n&lt;p&gt;Clinical and Educational Supervision will be provided at Cumberland Infirmary Carlisle for all clinical Emergency Medicine work undertaken at this Local Education Provider. Supervision at UCLan is provided by appointed Tutor.&lt;/p&gt;\n&lt;p&gt;Training will start in line with the academic intakes at UCLan for the 2020 / 2021 academic year (semester 1 or semester 2).&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Essential requirements of the Fellowship&lt;/span&gt;:&lt;/p&gt;\n&lt;p&gt;Applications will be accepted from current Emergency Medicine trainees at ST4 and above. CT3 / ST3 applicants are welcome to apply and will be appointed provided that at the time of taking up post they are in the higher Emergency Medicine programme at ST4.&lt;/p&gt;\n&lt;p&gt;Applicants must be currently on the HEE North East Emergency Medicine Training programme, ACCS Emergency Medicine Programme or Higher Emergency Medicine programme.&lt;/p&gt;\n&lt;p&gt;At the time of appointment, trainees must be on an ARCP outcome 1, though specific outcome 2 details at ARCP will be taken into account.&lt;/p&gt;\n&lt;p&gt;Successful trainees will undertake progress review for their clinical components with annual ARCP. Trainees will undertake progress review for their academic and educational components by longitudinal progress review with their nominated Tutor. Issues with progress or attainment will involve review by either Head of School or academic Tutor or both, depending on the issues at hand. The Trainee will have access to all the training services at HEE NE during this time (e.g. educational support services / occupational health).&lt;/p&gt;\n&lt;p&gt;On completion of programme after two years, the trainee will return to full time Higher Emergency Medicine training at the appropriate progress training level. The Royal College of Emergency Medicine Training Standards Committee will make appropriate CCT adjustments.&lt;/p&gt;\n&lt;p&gt;Appointment will be by virtual interview.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;• Tim Sanders, Clinical Lecturer in Rural Medicine at UCLan - Tsanders2@uclan.ac.uk&lt;br /&gt;• Nigel Garret, School of Medicine Uclan - NJGarratt@uclan.ac.uk&lt;br /&gt;• Malcolm Jones, Emergency Medicine Consultant, Sunderland Royal Hospital and Head of School for Acute Specialties HEE NE - malcolm.jones@chsft.nhs.uk&lt;br /&gt;For more information or to apply, please visit Oriel, and search under Training Programme for: Academic – Management &amp; Leadership:&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lead Employer for Northern Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127674"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North East &amp; North Cumbria", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Wilderness Fellowship", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233601", "validThrough": "2020-11-17T23:59:59+0000"}