{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36561", "minValue": "31116", "unitText": "YEAR", "value": "£31,116 - £36,561 per annum (with enhancements)"}}, "datePosted": "2020-10-13T12:31:20+0100", "description": "&lt;p&gt;We are looking for a &lt;strong&gt;Registered Mental Health Nurse (RMN)&lt;/strong&gt; with a passion for delivering outstanding care.&lt;/p&gt;\n&lt;p&gt;You will be working 38.5 hours per week at Cygnet Hospital Harrogate. &lt;strong&gt;Cygnet Hospital Harrogate&lt;/strong&gt; is located in the lovely spa town of Harrogate with good links to the A1, Leeds and York.&lt;/p&gt;\n&lt;p&gt;Apply now to enjoy excellent career prospects while reaping the rewards of making a difference to others – every day.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Produce outstanding written reports based on your nursing assessments and observations&lt;/li&gt;\n&lt;li&gt;Work closely with the management team to develop the service, audit, and improve quality&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge and promote nursing&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines&lt;/li&gt;\n&lt;li&gt;Support for Preceptors – Cygnet Harrogate has a well led and established preceptorship programme. On completion of preceptorship we offer a good re-numeration package.&lt;/li&gt;\n&lt;li&gt;Support for Preceptors – Cygnet Harrogate has a well led and established preceptorship programme. On completion of preceptorship we offer a good re-numeration package.&lt;/li&gt;\n&lt;li&gt;Training -  As well as the statutory and mandatory training, Cygnet Harrogate provide an array of training courses for each individual with the ethos on personal development. These include CPD days and specific preceptorship training days.&lt;/li&gt;\n&lt;li&gt;Development pathways – There are various development opportunities within Cygnet. From Leadership and management to specialist roles. Cygnet Harrogate will support and assist within this area.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;RCNi membership &lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit- Providing you with Fitness Programmes, Nutrition consultation and Health checks&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experienced Registered Mental Health Nurse (RMN) with a current Pin Number&lt;/li&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;A good understanding of the latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to deputise in a clinical lead role&lt;/li&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt; has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Hospital Harrogate&lt;/strong&gt; is a long-established mental health hospital that provides an emergency admissions service across two acute wards.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Sanctuary Ward &lt;/strong&gt;is &lt;strong&gt;Cygnet Hospital Harrogate&lt;/strong&gt;’s emergency acute inpatient service for women. The ward can accept service users on an informal basis and also those detained under the Mental Health Act.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Haven Ward&lt;/strong&gt; is &lt;strong&gt;Cygnet Hospital Harrogate&lt;/strong&gt;’s mixed male and female emergency acute inpatient service. The ward can treat service users on an informal basis and also those detained under the Mental Health Act.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Service users have a named nurse and are reviewed by a consultant psychiatrist up to three times a week. Medical cover is provided round the clock. Referrals and admissions can be received at any time of the day or night by arrangement with the consultant psychiatrist and medical staff on call.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Click the link to apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate", "postalCode": "HG1 2JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9998", "longitude": "-1.54778"}}, "title": "Registered Mental Health Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224270", "validThrough": "2020-11-16T23:59:59+0000"}