{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T14:30:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a Community Paediatrician looking to join a dynamic and expanding Community Paediatric service with a strong emphasis on effective teamwork and departmental wellbeing? We invite you to apply for one of two new consultant posts in East Sussex. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These posts have been created as part of the ongoing expansion and development of the service, following work with the Trust and our Commissioners. You will be joining a strong and supportive multidisciplinary team including 10 Community Paediatricians, 2 Speech and Language Therapists, 2 Clinical Psychologists and a large Community and LAC Nursing team. We work closely with our local Children&#39;s Integrated Therapy Service, the ISEND service and Local Authority Children&#39;s Services to provide community paediatric services for our population of approximately 110,000 children aged 0-17. We are integrated with our general paediatric colleagues&lt;em&gt;.&lt;/em&gt; There is a well-established program of CPD and peer review. Regional networks are well established.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 1&lt;/strong&gt; is a general Community Paediatric post with the opportunity to develop a special interest to complement the team and meet departmental requirements. A specific opportunity exists for an honorary contract with Brighton and Sussex Medical School, for the development of an additional interest in Medical Education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 2&lt;/strong&gt; is a Community Paediatric post with a special interest in epilepsy. This post provides the opportunity to combine neurodevelopmental paediatrics while taking on a lead role for epilepsy. You will be working alongside a general paediatrician with a special interest in epilepsy and there is epilepsy nurse support in place. The rest of your clinical work will be in child development.&lt;/p&gt;\n&lt;p&gt;There is no on call commitment with these posts, although the opportunity exists to join the rota for the local county wide Paediatric SARC based in Brighton if this is of interest to the successful applicant.&lt;br /&gt;&lt;br /&gt;Applicants are required to be on the Specialist Register with CCT in General Paediatrics, and preferably subspecialty CCT for Community Paediatrics or Neurodisability (see person specification) or be within six months of obtaining it by the interview date. &lt;br /&gt;Full Registration with the GMC is essential. &lt;br /&gt;&lt;br /&gt;East Sussex Healthcare NHS Trust (ESHT) is commissioned to provide Community Paediatric and Child Health Services for East Sussex. The Trust has 2 acute sites in which the Community Paediatric Department is currently based; Eastbourne District General Hospital and Conquest Hospital, Hastings. Cross site working is encouraged dependent on special interest and service needs, and this is a Trust appointment. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The Trust’s vision is to be the healthcare provider of first choice for the people of East Sussex. It is making excellent progress in this regard as evidenced by the latest CQC ratings published in February 2020 which give an overall rating of Good. The domains of ‘Effective’ and ‘Caring’ were rated as Outstanding and Community Services and the Conquest Hospital also achieved an Outstanding rating.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Trust has teaching status and is linked with the University of Brighton. Experience and familiarity with UK hospital systems and practices or equivalent is essential. The successful candidates will be employed under Terms &amp; Conditions of Service for Consultants (England) 2003.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Tracey Ward , Consultant Community Paediatrician and Speciality Lead&lt;/p&gt;\n&lt;p&gt;01424 755255 x 8164&lt;/p&gt;\n&lt;p&gt;tracey.ward3@nhs.net&lt;/p&gt;\n&lt;p&gt;Mobile number:07827280946&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne District General Hospital/Conquest Hospital, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Consultant Community Paediatrician with an interest in Epilepsy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244955", "validThrough": "2020-11-10T23:59:59+0000"}