{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360-£77,126 pa"}}, "datePosted": "2020-10-30T11:31:46+0000", "description": "&lt;p&gt;We are looking to appoint enthusiastic, focused and forward-thinking Specialty Doctors to join our dynamic and highly supportive Emergency Department based in Glangwili General Hospital.&lt;/p&gt;\n&lt;p&gt;Our flexible Specialty Doctor posts are within Emergency Medicine in a friendly semi-rural Emergency Department.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales serving a population of 389,000. Right now we are building our future, setting the pace for care, with 4 hospitals within our remit. The Health Board is committed to delivering high quality emergency care and sees the provision of consistent emergency care as a key strategic priority.&lt;/p&gt;\n&lt;p&gt;Glangwili Hospital is a busy regional hospital and is the largest of the four Hywel Dda University Health Board’s Hospitals providing all general services for West Wales. Located in Carmarthen (the county town of Carmarthenshire) with its excellent transport links and close proximity to the M4 it has a lot to offer; both in terms of career and lifestyle choice.&lt;/p&gt;\n&lt;p&gt;The Emergency Department in Glangwili sees around 48,000 attendances per year. It provides acute care for the people of Carmarthenshire and adjacent parts of Pembrokeshire and Cardigan in an environment that permits sufficient time for rewarding interaction between staff and patients, yet also provides appropriate experience of high quality emergency medicine. The department consists of a resuscitation area, a major’s area (which includes monitored bays), a newly opened Minor Injuries Unit and a plaster room.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for people with a developing passion for Emergency Medicine, who want to take on middle-grade responsibilities, or those already confident with middle-grade duties and are looking to consolidate their experience. Candidates who are working towards MRCEM/FRCEM/CESR will be supported to complete these. The Health Board runs a successful mentoring and development scheme.&lt;/p&gt;\n&lt;p&gt;The posts will comprise of 80% standard ED clinical work and 20% Supporting Professional Activity (SPA) time. There are protected weekly teaching sessions and there will be opportunities to be involved with quality improvement projects / audits, and teaching of medical students and junior doctors. Successful applicants will also be encouraged to attend courses such as ATLS, EPALS etc.&lt;/p&gt;\n&lt;p&gt;The Postgraduate Department in Glangwili General Hospital has a fully developed programme of guest lectures and lunchtime meetings, including special interest groups and co-ordinated intra-practice activities and career counselling. The library offers a wide ranging book collection, with interlibrary lending network, excellent IT facilities, audio-visual and conferencing equipment.&lt;/p&gt;\n&lt;p&gt;Doctors wishing to apply for this post must have full registration with the General Medical Council and shall have completed at least four years’ full-time postgraduate training (or its equivalent gained on a part-time or flexible basis) at least two years of which will be working in the Specialty; or shall have equivalent experience and competencies. These posts provide a platform for Registrar level doctors to gain experience in the NHS and participate in protected teaching and training opportunities, and competency sign off.&lt;/p&gt;\n&lt;p&gt;The pace of life can be as fast or slow as you choose, with a diverse range of people sharing an envious work-life balance across the region. An excellent choice of schools and very reasonable property prices contribute to a high standard of living. Carmarthenshire is home to the Brecon Beacons, National Botanic Gardens of Wales and some of our longest and most beautiful beaches.&lt;/p&gt;\n&lt;p&gt;West Wales provides wonderful lifestyle opportunities. Carmarthenshire is a coastal county with beautiful coast line. There are opportunities to undertake many activities such as climbing and mountain biking as well as walking, surfing, fishing, sailing and hiking. Property prices are lower than many parts of the UK with excellent State and Independent Schools within the area. There are excellent road and rail connections to London and the larger cities. Wales has a low crime rate and is a safe and friendly place to live and work. Oversees applicants are encouraged to apply for these posts and although previous NHS experience is desirable it is not essential.&lt;/p&gt;\n&lt;p&gt;Additional benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full, structured induction into the NHS and the Department&lt;/li&gt;\n&lt;li&gt;Generous relocation package of up to £8,000&lt;/li&gt;\n&lt;li&gt;One month’s free hospital single accommodation on entry to the UK&lt;/li&gt;\n&lt;li&gt;NHS Discount / Staff Benefits Scheme&lt;/li&gt;\n&lt;li&gt;Pension – the NHS offers one of the UK’s best pension schemes&lt;/li&gt;\n&lt;li&gt;Employee Health &amp; Wellbeing Service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dr Ling Tan, Consultant in Emergency Medicine Tel: 01267 235151 extension: 3976&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Ling Tan, Consultant in Emergency Medicine Tel: 01267 235151 extension: 3976&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GLANGWILI HOSPITAL, CARMARTHEN", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Specialty Doctor in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249960", "validThrough": "2020-11-15T23:59:59+0000"}