{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 £19,337 pa"}}, "datePosted": "2020-11-05T18:31:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Within the Clinical Support Division, the Referral Management Centre and Outpatient Reception Team are looking for a Referral Management Centre Clinic Clerk/Receptionist to join our busy team. This is a key role as you would be the first point of contact for patients for their outpatient bookings.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Previous administration experience is advantageous as well as having excellent customer service, interpersonal and organisational skills. A flexible approach and being able to work on your own initiative is also required. You will need to be a dedicated team player who has the ability to work professionally in a busy / high pressure environment. Attention to detail and an understanding of patient confidentiality are essential.&lt;/p&gt;\n&lt;p&gt;You will be responsible for data entry on to the Maxims system and other Trust systems, processing and scanning all of referrals received in the Referral Management Centre. You will be supported in booking of new and follow up appointments for all specialties within the Referral Management Centre.&lt;/p&gt;\n&lt;p&gt;This role will also cover meeting and greeting of patients at their arrival to the Trust on the main reception area and also updating patients details on Maxims when they arrive.&lt;/p&gt;\n&lt;p&gt;You may also be required to cover other areas within the Clinical Support Division, including Radiology reception or bookings.&lt;/p&gt;\n&lt;p&gt;Training on all aspects of relevant software packages will be provided, and you will receive on the job training and support for this role.&lt;/p&gt;\n&lt;p&gt;For further information please contact Jane James, Outpatient Services Manager on 01432 383834 or Sheila Marshall on &lt;em&gt;01432 383760.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE THIS POST IS FOR INTERNAL WVT EMPLOYEES ONLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Only short listed candidates will be contacted&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "RMC Clerk/Outpatient Receptionist - WVT Employees only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258777", "validThrough": "2020-11-19T23:59:59+0000"}