{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "28890", "unitText": "YEAR", "value": "£28,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T11:17:00+0000", "description": "&lt;p&gt;**** UHNM EMPLOYEES ONLY ****&lt;/p&gt;\n&lt;p&gt;This post is advertised for current employees of University Hospital of North Midlands. We will not consider applications from outside the trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term 6 month position to cover Maternity Leave/Vacancy within Ward 217, Children’s surgical inpatient and Day care unit. – Band 7 Senior Sister&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the University Hospitals of North Midlands (UHNM) Child Health Directorate at the Royal Stoke University Hospital (RSUH) site,&lt;/p&gt;\n&lt;p&gt;An opportunity has risen for a Band 7 Senior Sister to support the Matron in the delivery of the Children’s surgical elective and non-elective surgical Services in the operational delivery of the Ward 217. This short fixed term position will support a Senior Children’s Nurse the opportunity to develop leadership and management skills in the delivery of a senior post within the Child Health Directorate under the guidance of the Child Health Senior Management team.&lt;/p&gt;\n&lt;p&gt;RSUH is a £350 million state of the art hospital development that, along with County Hospital in Stafford, serves the population of Staffordshire and beyond, with both local and specialist tertiary services.&lt;/p&gt;\n&lt;p&gt;The Child Health Directorate is a multifaceted and dynamic unit, it comprises of Children’s Emergency portals for Children’s ED and Children’s Assessment Unit, Children’s Outpatient services spanning over three sights, Medical and Oncology and Surgical Wards for elective and non- elective admissions. The unit is supported by a Children’s Intensive Care and High Dependency Unit. The ward also has links to the Trusts level 3 Neonatal Unit.&lt;/p&gt;\n&lt;p&gt;Ward 217 support’s the delivery of surgical services for the Specialized and Surgical Divisions within the Trust, The ward is a busy unit supporting acute admissions from the emergency portals of entrance and elective admissions for inpatient and day case surgery.&lt;/p&gt;\n&lt;p&gt;During the acute winter season sees’ the surgical ward supporting medical admissions to the unit to ensure access to all patients is available.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate that can demonstrate strong clinical leadership and communication skills, is innovative and flexible and committed to evidence based care and the Trusts quality agenda. Practical experience in innovation, leading change and implementing a quality initiative is essential as is experience of working within surgical services and strong relationships and networks within general surgery, trauma orthopaedics and specialised surgery.&lt;/p&gt;\n&lt;p&gt;If you can work independently and collaboratively with the Senior Management Team and Matron for surgical services to deliver the daily operational running of a busy surgical ward and have the desire to develop your career with our support within a Senior Sister position then please contact Senior Matron Janet Hagan and Deputy Matron Emma Kelsall for an informal discussion on 01782 675125/ 672401.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview for the post will be undertaken for the position 7 days after the closing date.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanet HaganJob titleSenior MatronEmail addressjanet.hagan@uhnm.nhs.ukTelephone number017852 675125&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Band 7 Senior Sister **UHNM EMPLOYEES ONLY**", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246253", "validThrough": "2020-11-11T23:59:59+0000"}