{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-11-03T11:16:26+0000", "description": "&lt;p&gt;Trainees who are nearing completion and waiting for ratified results are welcome to apply.&lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to join Time to Talk Coastal (West) at our Chichester base. We provide a range of NICE compliant face to face, telephone and group psychological therapies, including Step 2 and Step 3 psychological therapy interventions. &lt;br /&gt;&lt;br /&gt;The multidisciplinary team consists of Psychological Therapists (providing CBT, counselling, IPT, mindfulness and EMDR), Psychological Wellbeing Practitioners, Administrators and Employment Support Specialists, working together to deliver a comprehensive stepped care, primary care mental health service. &lt;br /&gt;&lt;br /&gt;The successful applicant will be a qualified Psychological Wellbeing Practitioner (PWP) eager to develop their career within an innovative, growing service, providing Step 2 guided self-help and CBT-based telephone interventions and online digital therapy. Due to the current climate there will not be any face to face or group work, but there may be the opportunity to facilitate this over video platforms. Patients present with a wide range of common mental health disorders and applicants will need to be emotionally resilient to manage a high volume caseload.&lt;br /&gt;&lt;br /&gt;You will receive support and supervision from the Senior Psychological Wellbeing Practitioner and will play an active role in the continued service development of Time to Talk.&lt;/p&gt;\n&lt;p&gt;We are working toward providing our patients with a service between 8am and 8pm, so you must be willing to work flexible hours.&lt;/p&gt;\n&lt;p&gt;We are currently only able to offer telephone, video and digital sessions, and to ensure social distancing measures in our bases you may be required to work remotely from home, for some or all of the week. IT equipment will be provided.&lt;/p&gt;\n&lt;p&gt;The successful candidates must be able to travel across our bases in West Sussex.&lt;/p&gt;\n&lt;p&gt;Please note interviews will be held via a video platform.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lauren Galloway&lt;/p&gt;\n&lt;p&gt;Senior Psychological Wellbeing Practitioner&lt;/p&gt;\n&lt;p&gt;lauren.galloway3@nhs.net&lt;/p&gt;\n&lt;p&gt;01273 265967&lt;/p&gt;\n&lt;p&gt;Helen Pearson - Senior Psychological Wellbeing Practitioner&lt;br /&gt;h.pearson3@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicentennial Building, Chichester, West Sussex", "postalCode": "PO19 8EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8317", "longitude": "-.783784"}}, "title": "Psychological Wellbeing Practitioner (PWP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253674", "validThrough": "2020-11-15T23:59:59+0000"}