{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "Band 7 - (£38,890 - £44,503 per annum)"}}, "datePosted": "2020-11-05T09:01:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical or Counselling Psychologist 1.0 wte.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Adult Mental Health Community Services, East Sussex. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eastbourne, Hailsham and Seaford Assessment and Treatment Service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the Eastbourne Assessment and Treatment Service (ATS) for an innovative, motivated, and enthusiastic Clinical or Counselling Psychologist to join our team. The post holder will be working within the Working Age Adults Mental Health Service part of the ATS, in the West Team. This is a permanent, full time band 7 position.&lt;/p&gt;\n&lt;p&gt;We are a friendly, professional service, based in the lovely seaside town of Eastbourne. This is close to the South Downs National Park and Brighton. Eastbourne has a vibrant shopping centre that includes many independent shops, restaurants and bars, and good public transport links to London and surrounding cities. The base is also located a fifteen minute walk from the beautiful seafront.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a caring and compassionate team, who work in a flexible and adaptable manner. You will be working alongside highly skilled and enthusiastic psychologists and psychological therapists, embedded within a cohesive and experienced multi-disciplinary team (MDT), which welcomes psychological interventions and collaborative working.&lt;/p&gt;\n&lt;p&gt;Although you will be working primarily in one geographically defined area, this post requires some travel between sites within the catchment area of Eastbourne, Hailsham and Seaford.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with experience of working with people with complex mental health needs in a community mental health setting. You will have skills in delivering evidenced based interventions, and will be expected to provide psychological assessments, formulations and interventions to clients, in addition to staff support such as reflective practice, supervision and training. The ability to work alongside the MDT in developing case formulations, managing complex risk, and contributing to team development will be essential. We are looking for a recovery focused Clinical or Counselling Psychologist with a strong commitment to team working and service user involvement. Applicants due to qualify in September 2020 are welcome to apply.&lt;/p&gt;\n&lt;p&gt;We are also currently developing streams of work in East Sussex, which ideally this post holder would contribute to. These include increasing our psychological offer to those in the community with psychosis, including an increase in the delivery of Family Interventions for psychosis; providing group and individual treatment to people with a diagnosis of Emotionally Unstable Personality Disorder; and creating a wide range of interventions for people with mood and anxiety disorders. We are also keen to establish Trauma Informed Care throughout our local service network. We also encourage each psychologist to lead on a group in the group programme.&lt;/p&gt;\n&lt;p&gt;Staff wellbeing is of central importance in the Trust as a whole and in East Sussex. There is an emphasis on encouraging and supporting our staff to develop, whilst working in psychologically safe environments, and being able to access a range of interventions and services to support a busy working environment. Sussex Partnership NHS Foundation Trust provides mental health, learning disability and substance misuse services in and across Sussex. It aims to realise the potential of everyone who uses its services and to enable staff to do a great job. Sussex Partnership has teaching status and is developing into one of the country’s leading teaching mental health trusts. The trust was rated as Good in the 2019 CQC inspection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Celia LesquerreAdditional contact information&lt;/p&gt;\n&lt;p&gt;We welcome informal discussions; for further information please contact&lt;/p&gt;\n&lt;p&gt;Dr Celia Lesquerre (Tues, Fri) 07738 757 857, Celia.Lesquerre@sussexpartnership.nhs.uk (Consultant Clinical Psychologist)&lt;/p&gt;\n&lt;p&gt;Or Dr Moz McQuillan (Mon-Thurs), (Principal Clinical Psychologist); Rhian Tucker (Mon-Fri) (Team Lead); or Jay Jameson-Allen (Mon-Fri) (Service Manager) on 01323 727 224&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Marys House, Eastbourne", "postalCode": "BN21 3UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7729", "longitude": ".28379"}}, "title": "Clinical or Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256982", "validThrough": "2020-11-19T23:59:59+0000"}