{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T11:16:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Accommodation incentive applicable to this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Free Critical Care team at Barnet Hospital is passionate about getting it right for patients and their families. In order to achieve this we are looking to appoint passionate, enthusiastic, motivated and dynamic Band 6 Registered Nurses who are either at the start of developing their leadership skills post their ICU course or have substantial band 6 experience and are looking for their first junior sister/charge nurse post. &lt;br /&gt;The Barnet Intensive Care unit comprises of 23 bed, 10 level 2 and 13 level 3. The unit admits in excess of 1,000 patients per year. Specialties include general medical and surgical patients, patients requiring renal replacement therapies, spinal, plastic and complex lower GI. &lt;br /&gt;&lt;br /&gt;In order to equip you with the correct knowledge, skills and attitude to become a competent and confident Band 6 critical care Registered Nurse we will provide you with:&lt;br /&gt;&lt;br /&gt;* Supernumerary orientation programme that will be individualised to your professional needs.&lt;br /&gt;&lt;br /&gt;* We will support your attendance on a mentorship course&lt;br /&gt;&lt;br /&gt;* We will help you develop your leadership skills with our in house programme and support you to attend NHS Leadership Academy Courses and UCL Partners leadership development programmes. &lt;br /&gt;&lt;br /&gt;* We also offer a postgraduate Liver Course that is 15 level 6 credits. &lt;br /&gt;As you can see we are committed to developing and supporting a modern career frame work for our Nurses in critical care .and you will be supported every step of your critical care career pathway by our Clinical Practice education team and senior team.&lt;br /&gt;&lt;br /&gt;Please note that these vacancies may close prior to the advertised closing date, subject to the high number of applicants anticipated. &lt;br /&gt;&lt;br /&gt;Applicants must be NMC Registered RGN, have a critical care course , relevant ICU experience , experience in teaching and mentoring, excellent communication skills and able to manage total patient care and work independently.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;Barnet Hospital is located in Barnet, a vibrant suburban London Borough with excellent schools, shops and restaurants and fantastic transport links to central London. As part of an exciting new initiative, the trust is offering financial support for those who need to relocate to take up particular roles at Barnet Hospital. The trust also has a dedicated accommodation team who can provide help and advice to new starters on private rental accommodation in the local area. Want to know more? Don&#39;t hesitate to get in touch, please contact our accommodation team (trevor.murtagh@nhs.net).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding an interview. We will use Zoom and similar tools to conduct testing and interviews. Due to the challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deny Chacko deny.chacko@nhs.net&lt;br /&gt;Mohammed Noor mohammad.noor@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Deborah Kirby, ITU Matron - deborahkirby@nhs.net / 020 8216 5304&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 6 Staff Nurse - ICU Barnet", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244179", "validThrough": "2020-11-25T23:59:59+0000"}