{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T11:15:55+0000", "description": "&lt;p&gt;&lt;span&gt;Please refer to the job description and the person specification for further details about the post. This is currently being approved by The Royal College. Successful candidate will be given approved JD &amp; PS.’&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health, Substance Misuse Division is seeking a Consultant Psychiatrist to join the Chapman Barker Unit Team.&lt;/p&gt;\n&lt;p&gt;The Chapman Barker Unit (CBU) is a 36 bed regional detoxification inpatient unit that offers a truly unique, medically managed and recovery-focused treatment package for people with substance misuse problems.&lt;/p&gt;\n&lt;p&gt;The unit has two admission pathways, pathway one is planned admissions for service users with complex substance misuse problems and co-existing physical and mental health concerns, and the second pathway is RADAR. The RADAR pathway is a bespoke 5-7 day rapid alcohol detoxification programme, whereby service users who present at A&amp;E with alcohol related injuries are transferred (where suitable) to the CBU.&lt;/p&gt;\n&lt;p&gt;The post holder will form part of an extensive Multi-Disciplinary Team; comprising of nurses, medics, therapy provision, peer mentors (volunteers with lived experience), physical health care team, social workers etc. The service has a dedicated admissions team who process referrals, develop treatment plans and support the overall admissions process.&lt;/p&gt;\n&lt;p&gt;As the post holder, you will be expected to clinically lead on the treatment for service users admitted to the Chapman Barker Unit and actively engage in managing waiting lists, ensuring those with the highest clinical need are prioritised and managed safely. The post holder will liaise with colleagues from mental health services and acute Trusts when needed. The post holder will be actively engaged in governance to safeguard patients and their carers.&lt;br /&gt;The Substance Misuse Division is clinically led and operationally partnered as we recognise many innovations come from clinical leads, like our RADAR ward. The post holder will be involved in strategic clinical leadership and business planning as a member of the Substance Misuse senior leadership team.&lt;/p&gt;\n&lt;p&gt;This post entails a ten session per work working arrangement, however there is flexibility to add general adult sessions if required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJonathan DewhurstEmail addressjonathan.dewhurst@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chapman Barker Unit, Prestwich", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Consultant Addiction Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249900", "validThrough": "2020-11-26T23:59:59+0000"}