{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-10-23T14:19:07+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Healthy Child Programme Nurses - Full Time / Part Time &lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Permanent all year round post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Exciting opportunities have arisen to join Healthy Together teams, working within Public Health Nursing to deliver the Healthy Child Programme. There are opportunities available across Leicestershire County and City across a number of areas.&lt;/p&gt;\n&lt;p&gt;We would love to meet you if you are an enthusiastic and self-motivated Registered Nurse who has experience of working with children, young people and families.&lt;/p&gt;\n&lt;p&gt;Public health nursing is a discipline of its own which seeks to promote and protect the health of our population. We do this by promoting healthy lifestyles and reducing the likelihood of ill-health through delivery of the Healthy Child Programme. Public health nursing is central to giving children the best start in their lives. We offer early intervention as physical and mental health issues emerge.&lt;/p&gt;\n&lt;p&gt;We are a 0-19 service which works with children, young people and their families to deliver care close to where they live their lives – at home, in Children’s Centres, school and GP practices.&lt;/p&gt;\n&lt;p&gt;Our teams are full of committed and skilled people who want to deliver the best possible care for children and their families. Healthy Together offers a range of services to meet the varying needs of the local population.&lt;/p&gt;\n&lt;p&gt;One example of this is LPT’s public health websites tailored to different age groups, such as Health for Under 5s. Working 0-5 it’s great to be able to signpost new and expectant mums to a whole range of online resources, such as Bumps to Babies antenatal programme, or weaning and portion size advice. There’s also the award-winning ‘Chat Health’ text messaging services which are available to both parents, as well as to young people of secondary school age. Working 5-19 there are opportunities to work with our digital offer carrying out health questionnaires with young people in schools.&lt;/p&gt;\n&lt;p&gt;We use SystmOne as our Electronic Patient Record and we are continually developing this to capture the great work our teams do.&lt;/p&gt;\n&lt;p&gt;Initially (for up to the first eighteen months) you will focus on either the 0-5 or 5-19 age groups, to make sure your knowledge is secure and you feel confident before moving to work across 0-19.&lt;/p&gt;\n&lt;p&gt;You will be supported through preceptorship and an extensive training programme covering areas such as sexual health, protective behaviours, Solihull, childhood nutrition and breastfeeding.&lt;/p&gt;\n&lt;p&gt;We really want to “grow our own” future public health nurses and so there will be opportunities to apply to enter onto a funded university course to become a Band 6 Specialist Community Public Health Nurse&lt;/p&gt;\n&lt;p&gt;You will need a full UK driving license and use of a car for this role.&lt;/p&gt;\n&lt;p&gt;All posts are subject to a 6 month probationary period.&lt;/p&gt;\n&lt;p&gt;These roles attract an incentive payment which pays £2000 over three years:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 months £500&lt;/li&gt;\n&lt;li&gt;18 months £500&lt;/li&gt;\n&lt;li&gt;36 months £1000&lt;/li&gt;\n&lt;li&gt;(Subject to tax and NI and non-pensionable)&lt;/li&gt;\n&lt;li&gt;Scheme rules apply which will be provided at interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see job description and person specification for full details. Details of qualifications and experience need to be clearly evidenced within your application form.&lt;/p&gt;\n&lt;p&gt;We would be happy to receive applications from candidates who are interested in working solely with the School Nurse Service who are adult trained with experience of working with children.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact: Siobhan.stack@leicspart.nhs.uk 07826923423 or Asha.day&#39;leicspart.nhs.uk 07867823359&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester City", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 5 Healthy Child Programme Nurse 0-19 / School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240900", "validThrough": "2020-11-20T23:59:59+0000"}