{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCA"}}, "datePosted": "2020-11-05T15:31:23+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a 12 month fixed-term, full-time post for a Research Nurse who has experience of delivering research in the NHS and is trained in paediatric phlebotomy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role represents an exciting opportunity to work within a respected multidisciplinary team led by Professor Deb Pal and be involved in a programme of research that could transform our understanding of childhood epilepsy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Epilepsy Research Nurse will be responsible for recruiting to, and following up, adult and paediatric patients within studies adopted by National Institute of Health Research (NIHR). The post holder will have particular responsibility for the development of the research programme, including the setting up of epilepsy/ neuroscience/ neurosurgical studies, recruitment of patients, and the acquisition of blood samples from adult and paediatric epilepsy patients. The post holder will also be involved in recruiting and following up epilepsy patients suitable for other studies/trials in epilepsy based in out-patient clinics. This will involve close working with multidisciplinary clinical teams and other researchers in the department and neighbouring hospitals of Princess Royal University Hospital in Bromley, Guy’s and St Thomas’ in South London, St George’s Hospital, Tooting. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will be based at King’s College London, Dept of Basic &amp; Clinical Neuroscience. The post holder will be expected to support covid-19 research recruitment where this is appropriate.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmber CollingwoodJob titleEpilepsy Research Programme ManagerEmail addressamber.collingwood@kcl.ac.ukTelephone number07787 156 460&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Epilepsy Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258345", "validThrough": "2020-11-19T23:59:59+0000"}