{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-19T08:54:17+0100", "description": "&lt;p&gt;&lt;strong&gt;*****Band 5 Occupational Therapy Rotation available*****&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an Occupational Therapist who is passionate about your profession? Do you have innovative ideas to help us improve the occupational well-being of people within Somerset? Are you seeking a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s the role? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic and inspiring Occupational Therapist to join our new Intermediate Care Service rotation and acute rotational opportunity in east somerset. You will have the opportunity to rotate through a variety of practice settings, developing a huge depth of experience as you progress through your career with us.&lt;/p&gt;\n&lt;p&gt;Currently the rotational scheme offers the following opportunities with further opportunities to follow:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discharge to assess (D2A) - supporting people at home after hospital stay&lt;/li&gt;\n&lt;li&gt;Rapid Response - Admission avoidance service&lt;/li&gt;\n&lt;li&gt;Community Integrated Rehabilitation&lt;/li&gt;\n&lt;li&gt;Acute elderly care / Frailty&lt;/li&gt;\n&lt;li&gt;Mental Health service - TBC&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are seeking a band 5 occupational therapists to join our fantastic service. Successful candidates will be directly supported by band 6 occupational therapists and a band 7 advanced practitioner/clinical specialist within the team.&lt;/p&gt;\n&lt;p&gt;You will be expected to carry out specific occupational therapy assessment which will include goal setting and treatment planning, assessing risk, promoting and enabling independent functioning. You will be committed to a person-centered approach to your work, have an ability to prioritise and work flexibly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Who are you?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you a fully qualified Occupational Therapist with an active HCPC registration?&lt;/li&gt;\n&lt;li&gt;Do you have a desire to enhance your post-graduate training and experience?&lt;/li&gt;\n&lt;li&gt;Do you want to get involved in a pioneering service that welcomes development initiatives and integration projects?&lt;/li&gt;\n&lt;li&gt;Keen to take an active role in developing and nurturing others, both personally and professionally?&lt;/li&gt;\n&lt;li&gt;Hoping to support the leadership of an engaged, friendly and supportive team?&lt;/li&gt;\n&lt;li&gt;Do you want to relocate to the countryside? We have a relocation policy (T&amp;Cc apply)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Did you answer yes to the above? Then please apply for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a highly motivated and committed team and a service that is at the centre of a developing service to meet the needs of the people of somerset. The service offers a superb career structure that supports occupational therapists with their career choices. We pride ourselves in the collaborative work that we do locally with our neighbouring organisations as well as the work we are involved in nationally.&lt;/p&gt;\n&lt;p&gt;Here in somerset, we are really proud of our colleagues and their amazing achievements and contribution that occupational therapists give toward our patients. We truly value all our people and their extraordinary commitment to our patients and our organisation - together, we are dedicated to working as one team to make a difference in people&#39;s lives.&lt;/p&gt;\n&lt;p&gt;We are keen to employ people who share the same vision and values as us. As an employer, we recognise that our staff are our truly greatest asset and we are committed to supporting them to achieve a rewarding and satisfying career.&lt;/p&gt;\n&lt;p&gt;Our teams are committed to achieving the highest possible outcomes. To achieve this we invest time and energy into training our staff. The service offers individualised programmes of teaching and training as well as a preceptorship programme of study for newly qualified occupational therapists, or those new to the NHS. The preceptorship programme includes training in; leadership training, coaching skills, therapeutic moving and handling, resilience training, quality improvement and much more.&lt;/p&gt;\n&lt;p&gt;Whether it’s our gorgeous countryside, buzzing towns or friendly attitudes, you’ll fall in love with Somerset and all the people that live here. Considering relocation? Please get in contact with our Recruitment team on 01278 432008 to discuss your options further and how we can support you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would welcome informal telephone call to discuss this role further.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have had time out from Occupational Therapy please get in touch. We offer a well established Return to Practice Programme…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "D2A East HUB / Yeovil District Hospital, East Somerset", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Occupational Therapist - Rotational", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231562", "validThrough": "2020-11-13T23:59:59+0000"}