{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-21T11:16:26+0100", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic Clinical Psychologist (Band 7) to join our Neurodevelopmental Services for children in Flintshire and Wrexham.&lt;/p&gt;\n&lt;p&gt;The service provides neurodevelopmental assessments and brief interventions for children with neurodevelopmental conditions and their families. The successful applicant will be required to work into multi-disciplinary teams providing a range of assessment and intervention work.&lt;/p&gt;\n&lt;p&gt;You will work under the management and guidance of an experienced clinical psychologist. You will be working into a very friendly and supportive environment in which regular supervision and continued professional development are highly valued. This post is part of a vibrant wider Child Disability Psychology team who have an emphasis on quality improvement. This gives the post holder the scope to develop clinical skills across these services.&lt;/p&gt;\n&lt;p&gt;We have an excellent relationship with Bangor Clinical Psychology Programme and provide teaching/placements on an ongoing basis.&lt;/p&gt;\n&lt;p&gt;Suitable candidates must be HCPC registered and have a determination to improve the lives of children with neurodevelopmental conditions and their families. Prior experience in working with children and their families is essential. Good interpersonal skills and ability to relate well with clinical teams is essential.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Melissa Smith, Principal Clinical Psychologist; &lt;br /&gt;melissa.smith@wales.nhs.uk; 03000 859112&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham Child Health Centre, Wrexham &amp; Flintshire", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Clinical Psychologist ND", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236085", "validThrough": "2020-11-18T23:59:59+0000"}