{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-10-28T11:17:45+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 2 – Clinical Support Workers – Aylesford Unit (Warwick)/Rigby Unit (Stratford upon Avon)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work within a very dedicated, supportive team at either the Aylesford or Rigby Unit.  This is a very diverse position and is very different to the standard CSW role in the hospital setting as it incorporates both clerical and clinical duties equally in a range of duties including Reception, Outpatient Clinic, Phlebotomy and Treatment Suite.  You will have the opportunity to train in venepuncture and undertake your own phlebotomy clinics.  It is an extremely varied and interesting role and the successful applicant needs to be both adaptable and resilient to meet the challenge and the role will present you with lots of opportunity to learn about many aspects of cancer and other disciplines.  Whilst it is not essential that you have both clinical and clerical skills, you must have a drive and ambition to learn and be keen to enhance your own professional development in these areas.     &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Rigby Unit - Information on the unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Rigby Unit was opened in August 2017 with support from the Rigby Foundation. The unit is an open, spacious and friendly environment and provides facilities to deliver chemotherapy and supportive care.  There are 12 chemotherapy treatment pods and two side rooms, a Macmillan Information and Support Centre and a range of facilities to support patients.  It also houses a complementary therapy room.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Aylesford Unit – Information on the unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opened in 2009 the Aylesford unit is a state of the art purpose build ambulatory cancer unit and provides diagnosis and treatment services for most cancers including blood cancers.  The unit has recently been refurbished and has had significant improvements in the treatment area which houses 12 chemotherapy chairs and two side rooms.  It also has a new addition of a very smart, spacious, airy new outpatient waiting area.  The Macmillan Information and Support Centre on site   provides support and guidance for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reception &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This part of the role is the most clerical part of the position and involves booking patients onto the hospital booking system and dealing with telephone queries and enquiries.  You will greet our patients on arrival and is a crucial function as it is often the first contact that our patients have with the Unit so it is vital that we welcome them in a warm, friendly way and start to build a relationship and rapport with them while they are undergoing their cancer journey. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Phlebotomy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the nature of their treatments our patients need regular blood tests to ensure that their medication is working and that they are fit for their treatment.  We hold our own in-house Phlebotomy clinics so part of the role is to train in venepuncture and then hold your own Phlebotomy clinics where you take bloods to support the patient journey.  This avoids unnecessary trips to outpatients which helps to keep our patients safe and they feel happier coming into the unit for this service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinic&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In clinic you will support the Consultants and Senior Nurses working in the Outpatient area in a range of ways including undertaking patients heights &amp; weights, taking observations when necessary ie temperatures and Blood pressures, and chaperoning while patients undergo examinations by their Consultant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Treatment&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role within the treatment suite includes bringing patients through for their chemotherapy treatments and weighing them on arrival.  You ensure that the area is always kept clean to protect our patients with lowered immunity. You ensure patients are comfortable and hydrated as this is really important for our users.  You would be responsible for collecting drugs and chemotherapy from Pharmacy, collecting milk and lunches from the kitchen and collecting blood products from blood bank so these shifts involve lots of walking but during this shift you have the most individual contact with the patients and you help to support patients during a very difficult time where they can feel very vulnerable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cancer Unit – learning?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a unit we encourage career progression and development of staff.  We have Band 3 roles within the units and we have supported many of our staff who have gone onto the various Nursing courses that the Trust offer. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Qualities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You need to be adaptable to an ever changing environment, be an excellent communicator and must be resilient in what can sometimes be an emotional environment but is also very rewarding at the same time.  Due to the level or clerical work involved in this role you need to have competent IT skills and be able to record information in an accurate and concise manner. You must be compassionate, caring and be empathetic. Experience of working as part of a team is essential but you should also be able to work independently.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for Cancer Services?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an award winning unit, having won the National Cancer award in 2016.  This award was based on the dedication, passion and commitment from the team to support our patient’s at the most difficult times.  We are a well-established, tight team that are both supportive and friendly.As a Clinical Support Worker at one of our units you make a key and fundamental contribution to the high quality care that we consistently give to our patients and this in turn is a rewarding and fulfilling experience for you.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SWFT Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SWFT is recognised as an ‘employer of choice’ and is highly recommended as a place to work. Our employees are as important to us as the care we give to our patients. We will provide a friendly work environment alongside other benefits such as a generous holiday entitlement, access to a great pension scheme plus many organisational benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact Claire Hawkins (Senior Resourcing Advisor) via email &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;claire.hawkins@swft.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Clinical Support Worker - Aylesford and Rigby Unit (Warwick &amp; Stratfo", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246282", "validThrough": "2020-11-08T23:59:59+0000"}