{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-29T15:31:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for 2 enthusiastic and dynamic orthoptists to join our large multi-disciplinary team. We would especially welcome applications from newly graduated orthoptists as this is a excellent opportunity to start your orthoptic career and have exposure to a wide variety of sub speciality, extended scope and advanced orthoptic work. &lt;br /&gt;&lt;br /&gt;Applications are welcomed for the 2 posts available&lt;br /&gt;Post 1 - Fixed term contract to cover maternity leave from January 2021 for 12 months - 37.5 hours per week &lt;br /&gt;Post 2 - Fixed term contract to cover maternity leave from February 2021 for 12 months - 30 hours per week. &lt;br /&gt;&lt;br /&gt;Manchester Royal Eye Hospital is a leading teaching hospital and tertiary referral centre and so the successful candidates will be involved in orthoptic clinics and very specialist clinics working alongside our neuro and paediatric ophthalmologists. . We have a large clinical teaching commitment of both undergraduate and post graduate students. &lt;br /&gt;&lt;br /&gt;You must have a degree in Orthoptics and be registered with the HCPC with up to date knowledge of current Orthoptic principles, practice and conditions. These posts are suitable for new graduate applicants and support will be given through pre-ceptorship and mentoring programmes. Excellent communication and clinical skills and a desire to practice in Manchester Royal Eye Hospital are essential. &lt;br /&gt;&lt;br /&gt;In return we will provide a comprehensive induction programme and the department will assist you in the development of knowledge and key skills where appropriate. &lt;br /&gt;&lt;br /&gt;Please state on your application if you wish to be considered for both posts if you are a new graduate or specific posts if you have some experience.&lt;br /&gt;&lt;br /&gt;Provisional dates for interview Wednesday 2nd December 2020&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVeronica GreenwoodJob titleHead of Orthoptic ServicesEmail addressveronica.greenwood@mft.nhs.ukTelephone number0161 276 5539Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details please contact&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Veronica Greenwood - Head of Orthoptic Services: veronica.greenwood@mft.nhs.uk or Lis Parry - Deputy Head Orthoptist: elisabeth.parry@mft.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel 0161 276 5539&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Eye Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Orthoptist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248875", "validThrough": "2020-11-15T23:59:59+0000"}