{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-30T11:18:11+0000", "description": "&lt;p&gt;&lt;strong&gt;The Rotherham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Acute Medical Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time - 37.5 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Acute Medicine Unit is looking for passionate, hardworking and friendly individuals to join the team on the Acute Medical Unit.&lt;/p&gt;\n&lt;p&gt;It is a really exciting time here at The Rotherham NHS Foundation Trust as we are&lt;/p&gt;\n&lt;p&gt;Currently transforming the way in which we deliver healthcare in Rotherham, to align with our vision as an organisation of becoming an outstanding trust, delivering excellent healthcare at home, in our community and in our hospital, to deliver this model of health care we are looking to recruit Band 5 Nurses across the division who will join us in our aim to become an outstanding division, delivering safe, effective, well led, responsive care to our patients by individuals and teams that are well led, kind, caring and compassionate.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit is able to offer a supportive working environment whilst offering you the experience of caring for medical patients in their acute phase of their admission to hospital from the Urgent and Emergency Care Unit and referrals from General Practitioner, as well as the ability to experience Same Day Emergency Care caring for our patients in an ambulatory care setting as well as working with the team to develop our rapid assessment area.&lt;/p&gt;\n&lt;p&gt;We appreciate the demands of a work life balance and we are always looking at ways to deliver flexibility to our colleagues while delivering a service to our patients and community, therefore we offer a number of flexible working arrangements which can meet your individual situation.&lt;/p&gt;\n&lt;p&gt;If you are interested to find out more about this exciting opportunity, please feel free to make contact with senior nursing colleagues (as below) we can offer informal visits and conversations. We look forward to hearing from you;&lt;/p&gt;\n&lt;p&gt;Please Contact;&lt;/p&gt;\n&lt;p&gt;Mrs Jennifer Benton, Matron for AMU Jennifer.benton1@nhs.net 01709 428205&lt;/p&gt;\n&lt;p&gt;Mrs Natalie Zuber, Deputy Ward Manager, AMU Natalie.zuber@nhs.net 01709 428252&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121484.png", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121484"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249916", "validThrough": "2020-11-26T23:59:59+0000"}