{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum (pro rata)"}}, "datePosted": "2020-11-06T14:46:27+0000", "description": "&lt;p&gt;Public Health England provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health. It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally, independent manner.&lt;/p&gt;\n&lt;p&gt;This senior post is positioned within the Tuberculosis Unit of the Tuberculosis; Acute Respiratory, Gastrointestinal, Emerging /Zoonotic Infections and Travel Health Division which is part of the PHE National Infection Service based on the Colindale Site. The unit brings together microbiological, clinical infection, public health and epidemiological expertise with the aim of working with others to reduce the disease burden and associated health inequalities with TB and other mycobacterial infections in the population.&lt;/p&gt;\n&lt;p&gt;This is a senior role within the TB Unit to provide leadership, management and oversight of the TB prevention function: early recognition and response to TB transmission incidents and outbreaks, monitoring and assessment of public health interventions, oversight of shared prevention programmes and improve diagnosis and management of active TB and prevention of TB transmission in England. As part of a restructured team, they will work with the Unit Head to deliver on key functions in support of PHE’s Infectious Disease Strategic Priorities and a collaborative 5 Year Action Plan with the NHS, towards the elimination of TB in England, in line with WHO goals. The team is also closely involved with the work of the NIHR-funded Health Protection Research Units, which are collaborative ventures involving PHE and academia.&lt;/p&gt;\n&lt;p&gt;The post holder will be a medical consultant with experience in NHS clinical medicine and mycobacteriology, including genomic medicine, public health infection and incident and outbreak management. They will be expected to provide expert public health and clinical input for the management of incidents and outbreaks of tuberculosis and other mycobacterial disease and to play a key role in developing, shaping and assuring the TB prevention function, which may include managing individuals and teams, working closely with partners, and ensuring delivery of high quality surveillance, response and support systems. The post holder will have responsibility for developing and maintaining close working relationships both internally and with partner organisations.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Nick Phin and/or Grace Smith by email: Nick.Phin@phe.gov.uk / Grace.Smith@phe.gov.uk or by telephone on 0208 327 7435&lt;/p&gt;\n&lt;p&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/p&gt;\n&lt;p&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website.&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale, London", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Consultant in TB Prevention - Public Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260195", "validThrough": "2020-11-27T23:59:59+0000"}