{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24907 to £30615"}}, "datePosted": "2020-10-27T15:38:04+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Opening Statement &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has been created to join our expanding team of healthcare professionals at DGS Health to be part of our primary care network team. The future of general practice will focus on working across multiple practices within networks, collaborating, building relationships and working as part of a multi-disciplinary team to provide safe, high quality integrated care to improve the health of population.&lt;/p&gt;\n&lt;p&gt;Working within a Primary Care Network offers both variety and flexibility, in terms of your day to day work, training and development, career progression but also opportunities to work flexibly across network locations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The roles&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Pharmacy Technician role involves complementing clinical pharmacists, community pharmacists and other members of the PCN multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;They will provide leadership for medicines management systems across PCNs, supporting practices with a range of services to get the best value from medicines by encouraging and implementing Electronic Prescriptions, safe repeat prescribing systems, and timely monitoring and management of high-risk medicines).&lt;/p&gt;\n&lt;p&gt;Responsibilities will include supporting the implementation of national prescribing policies and guidance within GP practices, care homes and other primary care settings. This will be achieved through undertaking clinical audits (e.g. use of antibiotics), supporting quality improvement measures and contributing to the Quality and Outcomes Framework and enhanced services. In addition, pharmacy technicians will assist in the delivery of medicines optimisation incentive schemes (e.g. medicines switches) and patient safety audits.&lt;/p&gt;\n&lt;p&gt;Pharmacy technicians’ core role responsibilities will cover clinical, and technical and administrative categories.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Local Area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Dartford, Gravesham and Swanley area is located in North Kent, only a 15 minute commute by train from London St Pancras, and our main GP Federation office is metres away from Ebbsfleet International Rail Station. This position will be based within Gravesend. The area is undergoing considerable housing, retail and leisure development including the Ebbsfleet Garden City Area. The area also boasts the Bluewater retail centre, and there are a good variety of high performing schools including state, grammar and independent schools. All practices in the area are members of the GP Federation and we work together to design and deliver clinically led and managerially enabled services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We place great value on our staff and recognise our success is a result of the quality and commitment of the staff we recruit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend", "postalCode": "DA12"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4123", "longitude": ".40887"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245234", "validThrough": "2020-11-10T23:59:59+0000"}