{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50400", "minValue": "50400", "unitText": "YEAR", "value": "Up to £50,400 Depending on Experience"}}, "datePosted": "2020-10-23T10:32:16+0100", "description": "&lt;p&gt;We invite applications for a Senior Clinical Scientist role from enthusiastic and motivated individuals with HCPC Clinical Scientist registration or those expecting to obtain registration within the next 6 months. .&lt;/p&gt;\n&lt;p&gt;The Reference Biochemistry Laboratories at King’s College Hospital (part of Viapath Analytics LLP) provides specialist service delivery using latest technology in a variety of laboratories (Metabolic, Immunochemistry, Porphyrins, Gastrointestinal, Steroids, and Diabetes). We also have close links to the integrated Toxicology and Trace Elements unit.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to participate in all areas of Reference Biochemistry, including clinical authorisation. The post holder will also be required to provide scientific leadership to our Metabolic Laboratory which is responsible for the delivery of a broad range of complex, specialised diagnostic procedures for both routine clinical and research applications. These include biogenic amines, markers of excess alcohol intake and of bile acid metabolism. All are based predominantly on LC-MS and capillary electrophoresis techniques. You will be expected to participate in original research / coordinate collaborative research (both locally and nationally).&lt;/p&gt;\n&lt;p&gt;Previous experience is not necessary as full training will be provided. More important is enthusiasm and a willingness to learn! We have a number of training activities in place in the department to help individuals progress towards FRCPath examinations.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on: July 16, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lea Ghataore&lt;/p&gt;\n&lt;p&gt;Principal Clinical Scientist&lt;/p&gt;\n&lt;p&gt;lea.ghataore@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Viapath Analytics LLP", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131534"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings College Hospital, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Senior Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240077", "validThrough": "2020-11-06T23:59:59+0000"}