{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-29T09:30:54+0000", "description": "&lt;ul&gt;\n&lt;li&gt;We have an exciting opportunity for a Band 5 Qualified Nurse with a background in Mental Health Nursing. The successful applicant will be based on the 15 bedded male Medium Secure Treatment and Recovery Ward, however there will be opportunities to work across the wider Service and this may include the Low Secure Service for males and Medium Secure Service for female. The Treatment and Recovery Service focuses on reintegrating patients back into the community prior to stepping down to low secure. As a nurse you will work in collaboration with other professionals and in a very patient centred way. We work to the principles of the “Secure Recovery Model “(Drennan &amp; Alred, 2012)and the “See Think Act” (Royal College of Psychiatrists publication) in collaboration with the peer support programme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The established team provide a high standard of care as evidenced in the most recent CQC inspection, they also rated the Forensic Service as good overall and outstanding in the ‘Effective’ category.&lt;/p&gt;\n&lt;p&gt;There is a good activity programme available for the patients to engage in which includes Therapeutic Groups, provision of leisure activities; we recently hosted a photo exhibition exploring narrative identity which appeared on BBC South East .We also offer patients the opportunity to engage in education and there is a variety of employment opportunities available to them such as working in the on-site cafes, gardening and cleaning. Patients are encouraged to maintain their living space, self-cater and budget for example. We have good links with the local radio station and we have a twitter account across the Service (twitter.com/hellinglycentre).&lt;/p&gt;\n&lt;p&gt;There are opportunities for staff development and promotion. A wide range of in house and external training is also available.&lt;/p&gt;\n&lt;p&gt;We are also aware that nationally there is a current shortage of RMNs which is why we want you to choose us. We have introduced the Hard to Recruit Premium for our band 5 and band 6 nurses. This supplement will follow the principles of Agenda for Change and will be based on the Fringe Allowance, which is 5% of salary or a minimum of £951 and a maximum of £1,649.&lt;/p&gt;\n&lt;p&gt;This post offers The Trust&#39;s Golden Hello for band 5 or 6 Nurses, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Loraine Hamilton, Ash Ward Manager&lt;/p&gt;\n&lt;p&gt;email loraine.hamilton@suessexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone 01323 444193.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellingly, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247735", "validThrough": "2020-11-12T23:59:59+0000"}