{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-04T11:01:25+0000", "description": "&lt;p&gt;This is an exciting new post made possible by the close collaboration between the South London and Maudsley NHS Foundation Trust (SLAM) and the Institute of Psychiatry, Psychology and Neuroscience (IoPPN) at King’s College London, both world-renowned organisations. The facilities for research and teaching are world-class, with full computing, statistical and IT support, and a large psychiatric library with superb on-line access&lt;/p&gt;\n&lt;p&gt;The post-holder will work 3 clinical days with the Croydon Recovery &amp; Rehabilitation team, along with an established consultant who works 2 clinical days. This is a well-established community team that offers specialist care for people in a Croydon-funded placement with primarily (but not exclusively) a psychotic illness who have complex needs in multiple domains.&lt;/p&gt;\n&lt;p&gt;The other 2 days will be with the Centre for Affective Disorders in the Department of Psychological Medicine at the IoPPN. The post-holder will join one of the world’s leading academic groups carrying out translational research in mood disorders and related illness. They will be encouraged to develop their own area of research interest, and will also have the opportunity to join projects that are part of the ongoing research programme in the department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Saj Malhi - Interim AMD - Email address: sukhjinder.malhi@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Resource Centre, Croydon", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Physician Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255499", "validThrough": "2020-11-18T23:59:59+0000"}