{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-11-04T09:59:39+0000", "description": "&lt;p&gt;Norfolk and Suffolk Foundation Trusts, Forensic and Secure Services, are looking to recruit a Staff Nurse to join our Forensic Low Secure Service &#39;Foxhall House&#39;, based in Ipswich. This post is ideal for someone who is interested in innovative patient led recovery and has the determination to drive quality improvements into the heart of the care we provide to our service users.&lt;/p&gt;\n&lt;p&gt;The Forensic service at NSFT is rated ‘good’ by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;Our Forensic services include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Medium and Low secure services at Northside House, Norwich&lt;/li&gt;\n&lt;li&gt;Low secure services at Foxhall House, Ipswich&lt;/li&gt;\n&lt;li&gt;The Women’s blended service Whitlingham Ward, Hellesdon Hospital&lt;/li&gt;\n&lt;li&gt;Norfolk and Suffolk Forensic Community Services.&lt;/li&gt;\n&lt;li&gt;Liaison and Diversion services across Norfolk and Suffolk&lt;/li&gt;\n&lt;li&gt;Secure Service for HMPs in Norfolk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Staff Nurse at the 16 bedded inpatient unit, you will play a key role as part of the multi-disciplinary team. You will need to be have experience in mental health settings.&lt;/p&gt;\n&lt;p&gt;We offer a comprehensive training package to support you on this exciting journey. You will have a good knowledge of risk assessment and management processes. You will possess a well-informed understanding of continuity of care and the value of recovery focused treatment. You will also demonstrate the ability to lead on maintaining and improving, by supervising staff, peer group sessions and quality improvement projects.&lt;/p&gt;\n&lt;p&gt;Who are we looking for?&lt;/p&gt;\n&lt;p&gt;We need individuals who have energy, determination and a desire to be part of something new and very special. We want creativity, innovative ideas and passion towards providing excellent patient care, working collaboratively with our People Participation Lead and Service users.&lt;/p&gt;\n&lt;p&gt;Good communication, of course, is an essential part of our craft. We are looking for someone who can communicate and collaborate in a professional manner with a wide spectrum of people to achieve the best outcomes for service users, whilst raising the standard of the service.&lt;/p&gt;\n&lt;p&gt;Excellent organizational and problem-solving skills are a must for this role as you will be working in an environment where creativity on how to approach situations is key.&lt;/p&gt;\n&lt;p&gt;However, most importantly and in keeping with our trust visons and values of Positively, Respectfully and Together, we are looking for someone who has exceptional people skills in order to influence change. We have an opportunity to make a difference in people’s lives; service users, carers and staff. If you think you are this person, then apply to be part of our fantastic team!&lt;/p&gt;\n&lt;p&gt;What can we offer in return?&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join NSFT Forensic Service as we commit to developing strong clinical leads as part of our workforce development strategy.&lt;/p&gt;\n&lt;p&gt;We have welcomed and embraced working with Quality Improvement and have been able to extend our network by attending National QI conferences which have helped to share learning and ideas with other NHS Trusts across the country. Norfolk and Suffolk Foundation Trust are committed to Quality Improvement (QI) and have paired up with East London Foundation Trust to train and develop our staff in the understating of QI and how to implement this on our wards.&lt;/p&gt;\n&lt;p&gt;We believe that staff, who feel valued by their employers and who are truly engaged, are able to provide better outcomes for our service users.&lt;/p&gt;\n&lt;p&gt;Why Suffolk and Ipswich&lt;/p&gt;\n&lt;p&gt;Surrounded by beautiful countryside and with good road and rail links, Ipswich is a town steeped in history and is the oldest Anglo Saxon town in England. It has a rich heritage and proud history. Its buildings match its glorious past with museums art, galleries and parks.&lt;/p&gt;\n&lt;p&gt;Bringing Ipswich up to date, is the University of Suffolk which sits on the stunning river front, part of the Ipswich Innovation Quarter. Adding to the transformation are the award-winning restaurants, fantastic shopping, annual festivals, and stunning parks. With excellent transport links to connect you to Cambridge, London and beyond but with lower than the national average house prices.&lt;/p&gt;\n&lt;p&gt;Interested?&lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other and are looking forward to welcoming you!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be set; you will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lindsay Sadler Job title Matron Email address lindsay.sadler@nsft.nhs.uk Telephone number 01473 322200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ribbans Park (Old St Clements Hospital site), Ipswich", "postalCode": "IP3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.05", "longitude": "1.19501"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255270", "validThrough": "2020-11-18T23:59:59+0000"}