{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T12:02:06+0000", "description": "&lt;p&gt;Job Overview&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Central Vale Cluster is seeking excellent advanced nurse practitioners to help build the team at our innovative unscheduled care hub. We are developing an exciting new model of primary care, where patients with acute medical issues are seen in a centralised location. This has been running successfully since December 2019, and we are now looking to recruit permanent members of staff. There is a vacancy for 1 WTE Band 8a, and 1 WTE Band 7 Advanced Nurse Practitioner. This nursing team will work in combination with our existing team of GPs and minor illness clinicians to provide acute unscheduled care services for the 64000 patients of the Central Vale Cluster. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Main duties of the Job&lt;/p&gt;\n&lt;p&gt;The post holder will be an experienced nurse, who is skilled and competent at dealing with a wide variety of primary care medical and surgical conditions. Although a GP is available for support when needed, a high level of autonomy is expected in dealing with clinical cases. The aim of the hub is to deal with acute medical and surgical problems in a timely fashion, allowing more chronic cases to be dealt with by individual practices. The post holder will be expected to triage cases by telephone, as well as see patients face-to-face, and undertake house visits as required. Coordination with the clinical teams from individual practices, and the wider primary care team will be needed. Both nurses will work together to support one another.&lt;/p&gt;\n&lt;p&gt;The hub currently runs 2 sessions, 0930 – 1330 and 1400- 1800.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;The Central Vale Cluster is a forward thinking and cohesive cluster, with a track record of developing innovative clinical projects. The hub was initially developed with winter pressures money (the only primary care in hours service within Wales in 2019 to obtain this funding). There is now high level interest in this model, and we hope to prove this concept is beneficial for patients, as well as keeping primary care sustainable. We hope to further build on this model, adding additional personnel and services over time to achieve an outstanding and fit for the future primary care service.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr James Martin Job title Central Vale Cluster Lead&lt;/p&gt;\n&lt;p&gt;Email address james.martin2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01446 722792&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Quay Medical Centre, Barry", "postalCode": "CF62 5QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3997", "longitude": "-3.27925"}}, "title": "Advance Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251957", "validThrough": "2020-11-16T23:59:59+0000"}