{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T17:15:37+0000", "description": "&lt;p&gt;Staff Nurses with Adult Critical/Intensive Care Experience Pursuing a Specialist Career;&lt;/p&gt;\n&lt;p&gt;Direct employment into a Band 5 position with a place on the next intake for the Post Graduate Certificate in Adult Critical Care&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hello!&lt;/p&gt;\n&lt;p&gt;My name is Trevor Venes. As part of the Matron Body, I am the Lecturer Practitioner for Adult Critical Care Services in Oxford. I am privileged to lead the specialist career development for our fantastic team of nurses; enabling them to become empowered, critical thinking nurse specialist to enhance and deliver complex and holistic care to our patients on the Churchill and John Radcliffe Intensive Care Units.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Within this role I am pleased to offer the opportunity to be employed as a Band 5 Staff Nurse with a direct path onto the next intake of our Post Graduate Certificate in Adult Critical Care. A Level 7 (MSc), 60 academic credits, course. The intakes are September and January each year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;I am very keen to hear from you if you have 12 months, or more, of Adult Critical Care experience in and Adult Intensive Care environment; evidence of completion of the STEP 1 National Competency Framework for Registered Nurses in Adult Critical Care (CC3N, 2015) or equivalent; evidence of Level 6 or 7 academic achievement; a passion for critical care and the drive to pursue a career in critical care and the Oxford Adult Critical Care Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in an informal discussion about the staff nurse role, the PG Cert in Adult Critical Care and the wealth of further career development opportunities, then I would be very pleased to speak with you. You are more than welcome to phone on the numbers below, or email, or, even better, make an appointment for me to show you around and answer your questions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Looking very forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Trev&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Trevor.venes@ouh.nhs.uk, 01865 227597&lt;/p&gt;\n&lt;p&gt;Or Deputy Matron&lt;/p&gt;\n&lt;p&gt;Nathan.smith@ouh.nhs.uk, 01865 235087&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe and Churchill Hospitals, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243557", "validThrough": "2020-11-15T23:59:59+0000"}