{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £30,401-£37,267 per annum + shif"}}, "datePosted": "2020-10-30T13:00:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an Electrical Shift Team Leader who will be responsible for the supervision of one of four Estates shift teams of Nottingham University Hospital at the City Campus.&lt;/p&gt;\n&lt;p&gt;As a working Shift Team Leader you will be responsible for providing both supervision and support to the shift team who will carry out planned preventative maintenance and reactive repairs on a wide range of hospital engineering services.&lt;/p&gt;\n&lt;p&gt;You will support the wider team by working towards an appointment as an Authorised Person following relevant training and qualification&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have knowledge of systems such as fire alarms, LV power systems and electrical infrastructure, emergency standby generators, ventilation, lifts and BMS would be desirable. Experience in the use of building management systems including access control would be advantageous.&lt;/p&gt;\n&lt;p&gt;You will be qualified to City &amp; Guilds Level 3 in Electrical Craft Studies or other approved training and hold a BTEC National Certificate (ONC or HNC) equivalent. Successful candidates will also have undertaken supervisory studies such as ILM Team Leader Award or have equivalent level of experience of working in a supervisory role.&lt;/p&gt;\n&lt;p&gt;The role will require working rotational 12 hour day and night shifts on a 4 on 4 off basis with three other shift teams. Shift enhancements are payable in addition to the base salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Briley (richard.briley@nuh.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Shift Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250280", "validThrough": "2020-11-13T23:59:59+0000"}