{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-10-27T12:32:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We have an exciting opportunity for an enthusiastic nurse to join our team to deliver clinical research in primary care in the Cambridgeshire and Peterborough region. The team forms part of the Clinical Research Network Eastern and is based at Victoria House in Fulbourn, Cambridge.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;As part of the team you will be working in GP practices and other community settings across the area. The role is patient focused involving recruiting participants into a wide range of research studies, receiving informed consent, conducting study procedures and the collection of baseline and follow up data in accordance with ICH GCP. The role can also involve office based work at times. You will be required to travel across the locality and wider throughout Eastern. &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You must be a Registered Nurse (with valid NMC) and possess excellent organisational, communication and interpersonal skills. Previous experience as a Research Nurse is highly desirable, but not essential as training can be provided, however a wide range of clinical experience is important. In addition, we offer a comprehensive training programme and on-going support, actively encouraging continuing professional development.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Closing date: 10 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 25 November 2020&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Siobhan Campbell&lt;br /&gt;Job title: Acting Locality Manager&lt;br /&gt;Email address: siobhan.campbell@nihr.ac.uk&lt;br /&gt;Telephone number: 07701279104&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division R&amp;D, Fulbourn", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244531", "validThrough": "2020-11-10T23:59:59+0000"}