{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 per annum"}}, "datePosted": "2020-10-28T11:31:26+0000", "description": "&lt;p&gt;&lt;strong&gt;2 Posts available - 1 Full Time &amp; 1 Part Time (22.5) hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England (HEE) oversees the delivery of workforce development and transformation opportunities alongside supporting multi-professional education and training. HEE supports the delivery of excellent healthcare and health improvement to the patients and public of England by working collaboratively with health and social care stakeholders to ensure the workforce of today and tomorrow has the right numbers, skills, values and behaviours, at the right time and in the right place.&lt;/p&gt;\n&lt;p&gt;A new NHS People Promise, sets out how the NHS will support, develop and empower everyone who works or is learning in the NHS. There is strong collaboration between HEE and NHS England &amp; NHS Improvement, and ICSs/STPs to drive local workforce transformation and improve education and training. This collaboration will be supported by new regional people boards and greater influence for ICSs/STPs over national decisions on education, training and workforce development.&lt;/p&gt;\n&lt;p&gt;Are you an experienced professional who can provide expert subject matter advice and act as an expert resource promoting and contributing to appropriate workforce research, information and analysis, modelling, strategy development, policy formulation, performance reporting and building capacity and capability. Alongside exceptional interpersonal and leadership skills and is keen to make a difference, promote excellence and drive innovation which will inspire, motivate and influence at all levels? We have an exciting opportunity for you to support the HEE South East Regional Senior team, in leading the Workforce Education Transformation and reform agenda in line with the People Plan and Long term plan. Successful delivery is dependent on collaborative working so the ability to demonstrate strong communication skills and develop enduring stakeholder relations across the health and care system is essential. The post holder will facilitate partners across the healthcare system in recognising the importance of workforce in driving service transformation, using knowledge and experience to support the system in developing actionable solutions and working through ICS/STP People Boards to ensure that the design of new models of care have workforce considerations central to their development.&lt;/p&gt;\n&lt;p&gt;You will be a key member in the HEE Workforce Education Transformation and Development team whose overarching goal will be to encourage, enable and support the delivery of this complex and exciting workforce transformation within an STP/ICS in the SE region.&lt;/p&gt;\n&lt;p&gt;Leading the HEE Workforce Education Transformation system facing team you will have an opportunity to influence the development of a thriving and evolving team and contribute to new workforce transformation activities, educational developments, and initiatives in partnership with HEE stakeholders and external partners.&lt;/p&gt;\n&lt;p&gt;We’ll be committed to your training and development from day one. Our learning and development strategy includes all the ways that we can support you to ‘shine’ and excel in your role and is open to our staff at every level in our organisation.&lt;/p&gt;\n&lt;p&gt;The post holder must be able to travel to meet the requirements of the role, including limited travel across offices within the south east region footprint.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 8b with a full-time starting salary of £53,168, with a pay step increase after 5 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Donna Poole&lt;/p&gt;\n&lt;p&gt;Head of Transformation, South East Region&lt;/p&gt;\n&lt;p&gt;Donna.poole@hee.nhs.uk or via PA Tina.Mcgrath@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Paul Newell, Head of Workforce Planning &amp; Intelligence&lt;/p&gt;\n&lt;p&gt;Email: paul.newell@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crawley Hospital, Crawley, Southern House, Winchester or Chancellor Court, Oxford", "postalCode": "RH10 7DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1156", "longitude": "-.153278"}}, "title": "Applied Workforce Planning Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246357", "validThrough": "2020-11-11T23:59:59+0000"}