{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18187", "minValue": "18187", "unitText": "YEAR", "value": "£18,187"}}, "datePosted": "2020-10-02T12:17:39+0100", "description": "&lt;p&gt;&lt;em&gt;Here at Omnes Healthcare we believe in innovation; we believe in listening to everyone; we believe in providing quality service; and we believe our employees will help us achieve our mission. We are looking for individuals&lt;/em&gt;&lt;em&gt;who share these values to join our growing organisation.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking Patient Healthcare Advisors to join the Omnes Healthcare Family. To become part of a company that makes a positive impact within Healthcare and to the patients we provide care for please apply today!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;em&gt;Location: Remote working and apx 1 days onsite per month (London or Southend)&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Salary: £18,187 per annum&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Who are Omnes Healthcare?&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Omnes Healthcare are a trusted partner in delivering primary and secondary NHS care services. Our quality services cover a wide range of specialities, including General Practice, and our aim is to provide accessible and patient-focused care by working collaboratively and embracing new ways of working, including the application of innovative technology.&lt;/p&gt;\n&lt;p&gt;We are dedicated to achieving better outcomes for our patients, whilst supporting the NHS. Our staff are rewarded by becoming an integral part of delivering excellent patient care, working within an innovative company and our attractive employee benefits, including remote working and your birthday off!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the purpose of the position?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As a Patient Healthcare Advisor, you will be tasked with taking on a variety of challenges and tasks both big and small. This is an important position within the business where you will be relied upon for a wide range of support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will be required to provide excellent patient services and high-quality administration duties, including letter writing&lt;/li&gt;\n&lt;li&gt;The post holder will have responsibility for inbound and outbound patient calls&lt;/li&gt;\n&lt;li&gt;The post holder must always work with autonomy and a high degree of confidentiality, sensitivity, discretion, empathy and tact&lt;/li&gt;\n&lt;li&gt;You will be self motivated and trustworthy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to join the Omnes Healthcare Family?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of clerical and administrative work&lt;/li&gt;\n&lt;li&gt;Clear thinking and have an analytical approach&lt;/li&gt;\n&lt;li&gt;Able to work as part of a team, to promote a good team spirit&lt;/li&gt;\n&lt;li&gt;Able to be sensitive and assertive as appropriate&lt;/li&gt;\n&lt;li&gt;Experience in a client facing/customer service position&lt;/li&gt;\n&lt;li&gt;Be motivated and able to work independently&lt;/li&gt;\n&lt;li&gt;Ability to work remotely with suitable broadband connection&lt;/li&gt;\n&lt;li&gt;Ability to attend our Head Office at London Bridge (Southend Onwards from Nov 2020) and | or GP and Secondary Care Practices as required to attend training sessions, participate in engagement activities and other duties when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Omnes Healthcare will offer you in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive organisation and the opportunity to make a difference&lt;/li&gt;\n&lt;li&gt;25 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;An extra day off to celebrate your birthday&lt;/li&gt;\n&lt;li&gt;NHS Discount&lt;/li&gt;\n&lt;li&gt;Remote working&lt;/li&gt;\n&lt;li&gt;And other fantastic benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What is available?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Permanent roles (Subject to availability)&lt;/li&gt;\n&lt;li&gt;Fixed Term Roles (May vary in length with a potential to become permanent)&lt;/li&gt;\n&lt;li&gt;Full Time and Part Time Hours (Subject to availability)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Apply today if you would like a rewarding job where you are able to make a difference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please be aware that all communications about this vacancy will be received to you via email. Always check your mailbox and junk mail folders and provide a UK mobile number if available.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;em&gt;&lt;em&gt;&lt;em&gt;&lt;em&gt;We have fully COVID compliant infection control policies in place.&lt;/em&gt;&lt;/em&gt;&lt;/em&gt;&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Remote | London &amp; Southend", "postalCode": "SS2 6DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5435", "longitude": ".70868"}}, "title": "Patient Healthcare Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210485", "validThrough": "2020-12-31T23:59:59+0000"}