{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-22T17:30:47+0100", "description": "&lt;h1&gt;Urgent and Integrated Care Division&lt;/h1&gt;\n&lt;h1&gt;DIETETICS DEPARTMENT&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;COMMUNITY DIETITIAN (BAND 6)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a new and exciting opportunity to work as a key member of our friendly team of Dietitians in the &lt;strong&gt;West Dorset Integrated Acute &amp; Community Dietitians &lt;/strong&gt;&lt;strong&gt;Service&lt;/strong&gt; based at Dorset County Hospital in Dorchester. If you are an HCPC registered dietitian looking to join a friendly and supportive team, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;West Dorset Integrated Acute &amp; Community Dietitians Service provides community services to the north and west of Dorset. We are looking to recruit a permanent Band 6 Community Dietitian for 4 days per week. You will be a vital resource to the area, providing scheduled clinics, patient/staff education sessions and community hospital inpatient services as well as responding creatively to ad-hoc requests, recommending innovative developments, representing the department and promoting the profession; all with patients as the priority.&lt;/p&gt;\n&lt;p&gt;You will be a key member of the department that provides a wide range of dietetic services across both the acute and community settings. We are pushing the boundaries of virtual service delivery, using technology to creatively deliver our services in these uncertain times. Although you will often be lone-working dietetically (as is usual for a Community role), you are part of the wider Dietetic Department of 25 Dietetic, Nurse and admin staff based at Dorset County Hospital and you will have easy access to them for peer and senior support. You will also build professional relationships with your non-Dietetic community colleagues in the GP surgeries, community hospitals etc.&lt;/p&gt;\n&lt;p&gt;You will have regular reviews/support with your line manager, who will help you develop your skills. The Department encourages CPD and benefits from good relationships with neighbouring Dietetic Teams, with twice-yearly Dorset-wide Dietetic CPD sessions in addition to monthly Departmental sessions. We offer a flexible working policy that allows you to take full advantage of opportunities for work-life balance.&lt;/p&gt;\n&lt;p&gt;Dorset is an ideal place to live and has captivated film-makers, poets and writers with the outstanding beauty of its towns, villages, landscape and coastline. There is more to Dorset than just stunning scenery – the history of this county is rich and vivid and there are a myriad of events and attractions to suit every taste.&lt;/p&gt;\n&lt;p&gt;What your colleagues say about their jobs&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;“I love the variety that comes with this community job and the access to the beautiful Dorset Countryside. Working with people in the community is very rewarding, you can really make a difference to their health and wellbeing and the relationships you build extend beyond the length of a hospital stay”&lt;/li&gt;\n&lt;li&gt;“I feel my dietetic expertise is highly valued by the community healthcare professionals whom I work closely with. I get a warm welcome from all the different teams and settings that I am part of here in West Dorset. Driving around in the pretty countryside is also an extra bonus!”&lt;/li&gt;\n&lt;li&gt;“I love the area, the team and the freedom of being able to come in and do the job as I want to do”.&lt;/li&gt;\n&lt;li&gt;“I can’t think of a nicer job”.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name: Kathryn Cockerell Job title: Chief Dietitian Email address: kathryn.cockerell@dchft.nhs.uk Telephone number: 01305254415&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121023.jpg", "name": "Dorset County Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121023"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset County Hospital, Dorchester", "postalCode": "DT1 2LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7115", "longitude": "-2.44917"}}, "title": "Community Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239533", "validThrough": "2020-11-08T23:59:59+0000"}