{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa plus HCAS"}}, "datePosted": "2020-10-23T13:46:43+0100", "description": "&lt;p&gt;&lt;strong&gt;Team Leader for OASIS Southwark and Lambeth.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Outreach and Support in South-East London Service (OASIS) is a world leading, innovative stand alone At Risk for Psychosis service that provides specialist assessment and treatment to young adults who are at high risk of developing psychosis. The service provides an extensive community outreach program which seeks to raise awareness and provide psycho-education about mental health to a variety of both statutory and non-statutory services including GPs, educational settings, multi-faith groups and local community organisations. One of the aims of this work is to encourage people to seek help as early as possible to try and prevent more serious mental health difficulties developing at a later stage.&lt;/p&gt;\n&lt;p&gt;OASIS is a multi-disciplinary clinical team providing a specialist service for young adults in South-East London who are at very high risk of developing a first episode of psychosis. The clinical work of the service is closely integrated with a well-developed research programme which comprises work on service development, health promotion, psychopathology, treatment effectiveness and structural and functional neuroimaging; there are strong working links with the Institute of Psychiatry to ensure the effective integration of research and clinical work. OASIS has teams across the boroughs of Lambeth, Southwark, Lewisham and Croydon liaising closely with Early Intervention services, CAMHS, A&amp;L and IAPT. As a service, the teams remit is to detect, assess and treat people between the ages of 14-35 with an At Risk Mental State (ARMS) for psychosis and has an open referral system whereby anyone can contact us to make a referral or ask for advice. We aim to provide a comprehensive assessment for anyone who meets the criteria for an At Risk Mental State within 14 days and to offer holistic care and support to clients and carers for up to 2 years, involving key-worker support, psychological therapies and medical reviews. The team also provides an extensive community outreach program which aims to raise awareness and provide psycho-education about mental health difficulties across different interfaces, including both primary and secondary care as well as local community groups and educational settings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To manage the OASIS service across Southwark and Lambeth and lead a multi-disciplinary team in delivering specialist assessment and treatment of people who are at high risk of developing psychosis. To lead a community outreach program to improve detection of those who are at high risk of developing psychosis and improve awareness and understanding of mental health across a variety of different community and health settings.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To have overall management responsibility for the delivery of care within the OASIS service, in accordance with Trust policies and procedures.&lt;/li&gt;\n&lt;li&gt;To lead a team of professional staff in the delivery of high quality evidence-based practice, ensuring that regular supervision and appraisal take place.&lt;/li&gt;\n&lt;li&gt;To manage administrative and operational resources in a cost-effective manner, evaluating the standard of service delivered.&lt;/li&gt;\n&lt;li&gt;To co-ordinate multidisciplinary working, maintaining excellent communication and working relationships with all team members, and other services within the Trust.&lt;/li&gt;\n&lt;li&gt;To liaise effectively across the boroughs of Lambeth and Southwark, and across Adult Mental Health and CAMHS services, and ensure successful integration of research and clinical practice within the team.&lt;/li&gt;\n&lt;li&gt;To ensure the ongoing development and provision of early detection services across SLaM and maintain close working relationships across both primary and secondary care services, educational settings, local community services as well as the Institute of Psychiatry.&lt;/li&gt;\n&lt;li&gt;To take a lead in developing and maintaining high standards of specialist assessment and treatment of people at high risk of developing psychosis and in leading a community outreach program which aims to raise awareness of mental health difficulties and improve accessibility to services.&lt;/li&gt;\n&lt;li&gt;The successful candidate will have access to specialist training in Early Detection and Early Intervention (including the Comprehensive Assessment of At Risk Mental States training) and will have the opportunity to be involved in research through OASIS’s close connection to the Institute of Psychiatry.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;OASIS Southwark and Lambeth team base is located in Kennington and is within walking distance of both Kennington and Vauxhall stations. OASIS also operates within the boroughs of Lewisham and Croydon and have teams based there as well.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits fro&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Mental Health Teambase, Kennington", "postalCode": "SE11 5DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4874", "longitude": "-.112846"}}, "title": "Team Leader - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240785", "validThrough": "2020-11-08T23:59:59+0000"}