{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-06T15:00:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Bank Theatre Nurse - Scrub, Anaesthetic &amp; Recovery (ODP/RGN)&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Theatre Nurse/ ODP in our Wessex Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;We’re looking for an exceptional Theatre Nurse or Practitioner with drive, passion and high standards. You might join us from the NHS or a private setting. Either way, you’ll discover unrivalled scope to work autonomously, make full use of your skills and knowledge and add value. This is nursing as it should be. You’ll be able to grow your career and be free of the constraints that prevent you from achieving job satisfaction. We know you thrive on the pressure and intensity of theatre work. So you’ll work closely with leading consultants and other like-minded professionals, who will respect and value what you bring to the close-knit multidisciplinary team. You’ll enjoy opportunities to work on a varied caseload using technology, equipment and facilities which are state-of-the-art. As well as supervising, supporting and developing junior staff, you’ll deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;We are now looking for staff to work in Anaesthetics, Recovery and Scrub roles (Orthopaedics, Ophthalmology, General surgery, ENT, Gynae etc).&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a registered Theatre Nurse or Operating Department Practitioner, you’ll have the qualifications and experience relevant to your registration, including NMC or HCPC. You’ll have post-registration experience, be an excellent communicator and team worker – flexible and motivated. As part of the wider hospital team you’ll interact with colleagues on the ward because you understand that continuity in patient care is key. Like us, you’re driven by quality. You don’t like to make compromises and we won’t ask you to. We’ll make sure you have everything you need to do a job you’re proud of.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our Pension Scheme.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Salary - Dependant on experience&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing Date - 04/12/2020&lt;br /&gt;Location - Chandlers Ford&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Bank Contract&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working on the bank means you are not contracted to a set number of hours per week, but instead work on an ad-hoc basis to suit the needs of the business and your availability.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wessex", "postalCode": "SO53 2DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9944", "longitude": "-1.36312"}}, "title": "Bank Theatre Nurse - Scrub, Anaesthetic &amp; Recovery (ODP/RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260243", "validThrough": "2020-12-04T23:59:59+0000"}