{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 £31,365 - £37,890 pa pro rata +"}}, "datePosted": "2020-10-29T11:01:00+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Childrens Speech &amp; Language Therapist, Band 6&lt;/strong&gt;&lt;/span&gt; &lt;br /&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;Salary £31,365 - £37,890 pa pro rata + HCAS £4,704 - £4,822 pa pro rata &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work for an organisation that is progressive, innovative and provides quality care for families in Bromley? To find out what its like to work for Bromley Healthcare please view our videos on YouTube, search for Bromley healthcare and you will get a flavour of Bromley healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently looking for a Children&#39;s Speech &amp; Language Therapist to join our dynamic, friendly team who are patient focused and thrive on providing quality care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bromley Healthcare are growing and continuing to expand our fantastic Children’s Speech and Language Therapy service with opportunities across the board covering a school buy in service and our core health activities.&lt;/p&gt;\n&lt;p&gt;Bromley is a fantastic place to live and work, with lots of open spaces and parks &amp; things to do, but only 20 mins away from Central London using the excellent transport available.&lt;/p&gt;\n&lt;p&gt;Come and join a friendly, supportive, enthusiastic team who have an excellent reputation with innovative ideas that are taken on board by the Service lead and implemented across the service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are keen to speak to experienced enthusiastic, flexible and highly motivated band 6 Speech and Language Therapists &lt;/strong&gt;&lt;strong&gt;to join our friendly and supportive team on a permanent all year or term time only basis. We have a range of opportunities to work in clinics, mainstream schools, specialist provisions / special schools with preschool and school aged children. You will need to be highly motivated and enthusiastic with an ability to work independently but also work well within a team.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;You will work with a mixed paediatric caseload who have a range of speech, language and communication needs. You will be responsible for the management, assessment and treatment of the children on these caseloads, with the support of peers and more senior colleagues. &lt;br /&gt;&lt;br /&gt;Successful band 6 applicants will contribute to in-service training within the department and to take responsibility for the supervision of students and more junior staff.&lt;br /&gt;&lt;br /&gt;We have an excellent system of appraisal, clinical supervision and training for all staff. You will be part of a dynamic, committed team of staff delivering high quality services to the population of Bromley. We believe in innovation and encourage staff to work in new and effective ways. Bromley Healthcare is an established social enterprise. As a shareholder you would have greater involvement and an opportunity to influence key decisions.&lt;/p&gt;\n&lt;p&gt;We are open to interested candidates coming into the service to meet the team and see the environment prior to interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please see attached JD and PS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmber CopseyJob titleChildrens Speech &amp; Language LeadEmail addressambercopsey@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Amber Copsey , Clinical Lead Children&#39;s SLT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ambercopsey@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125834.jpg", "name": "Bromley Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromley, Bromley", "postalCode": "BR6 0JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3748", "longitude": ".097333"}}, "title": "Children&#39;s Speech &amp; Language Therapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248013", "validThrough": "2020-11-12T23:59:59+0000"}