{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-29T16:46:04+0000", "description": "&lt;p&gt;An opportunity has arisen for 1 full time Band 6 senior nurse post within the Cardiology catheter labs. Are you interested in helping to develop and assist in leading a team within cardiology and the fascinating interventions that are constantly evolving in cardiac health care? Do you want to develop competence as a band 6 Nurse in this rewarding, cutting-edge specialism? Then you should consider our Band 6 senior Staff Nurse role in the cardiac catheterisation labs here at the Bristol Heart Institute, our internationally renowned centre of excellence.&lt;/p&gt;\n&lt;p&gt;This opportunity is open to experienced nurses who are ready to progress into a band 6 nurse leader and develop their leadership skills within the field of interventional cardiology.&lt;/p&gt;\n&lt;p&gt;This is an exciting and often intense place to work, with patients from all across the region brought in by helicopter or ambulance to our 24 hour primary angioplasty service. We are dynamic and innovative: Our trans-catheter aortic valve implantation (TAVI) service is expanding and we are embracing the Trust’s status as a Digital Exemplar, using the latest technology to enhance patient care.&lt;/p&gt;\n&lt;p&gt;Cardiology experience is essential, and a keen interest in the field is most important. We would expect applicants to be able to demonstrate evidence of proven leadership and management experience, and be able to demonstrate the skills required to manage a large team. Motivation and enthusiasm to want to develop into the next level of leadership is essential.&lt;/p&gt;\n&lt;p&gt;This is a full-time position at Band 6 working a combination of early, late and day shifts with a commitment to on-call.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Bohin - Sister&lt;/p&gt;\n&lt;p&gt;rachel.bohin@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0117 3426649&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Heart Institute, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Senior Staff Nurse - Cardiology Catheter Labs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249143", "validThrough": "2020-11-14T23:59:59+0000"}