{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T15:31:54+0000", "description": "&lt;p&gt;This is an exciting opportunity to work as part of a multi-disciplinary team within the Children’s Learning Disability Service is Central Lancashire. We are looking to employ a suitably qualified and experienced Practitioner, learning disability nurse, to take a key role in the delivery of high quality service provision, that promotes and improves the well-being of children and young people who have a learning disability and/or autism.&lt;/p&gt;\n&lt;p&gt;The Children’s Learning Disability Teams are part of Lancashire Care’s all age Learning Disability Service.&lt;/p&gt;\n&lt;p&gt;The post holder will, as part of a multi-disciplinary team, work towards addressing the psychological, emotional and behavioural needs of children and young people with a learning disability and/or autism. They will be responsible for their caseload and deliver a range of evidence based interventions.&lt;/p&gt;\n&lt;p&gt;The team provides a range of high quality assessment packages and interventions that are tailored for each individual and family. These include group based programmes for parents, wider family and individual work, behavioural interventions and sensory preferences and advice.&lt;/p&gt;\n&lt;p&gt;The team have developed a number of pathways to provide support to the families and carers of children and young people who meet our eligibility criteria, including behaviour, mental health, forensic and complex physical health. Multi-agency working is a core part of the team’s remit and we have strong links with local mainstream and specialist education providers, social care and voluntary organisations.&lt;/p&gt;\n&lt;p&gt;The post is based within the Preston team and in the main duties will be carried out within this team although there will be an expectation that you be able to travel across the locality.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maxine Rigby on 01695 684340&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ellen House, Preston", "postalCode": "PR1 7RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7691", "longitude": "-2.70654"}}, "title": "Community Learning Disabilities Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247211", "validThrough": "2020-11-11T23:59:59+0000"}