{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T11:16:59+0000", "description": "&lt;p&gt;We’re looking for an experienced and enthusiastic individual to join our UKAS accredited department of laboratory medicine at University Hospital Southampton NHS Foundation Trust (UHS) to become a Specialist Biomedical Scientist. This is an exciting opportunity to broaden your experience – working in a modern and well-equipped laboratory, providing an extensive repertoire of investigations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Biochemistry team is a diverse group of all different grades of Scientist, working together to further healthcare and provide the best service possible for patients.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Southampton Biochemistry lab is one of the largest labs in the area and provides a significant amount of specialist testing.&lt;/li&gt;\n&lt;li&gt;Our service is always expanding and looking to make improvements.&lt;/li&gt;\n&lt;li&gt;We are committed to our staff being the best they can be&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Initial training will be in clinical biochemistry, with future pathology training given as required by the needs of the service. There is the opportunity to complete a specialist portfolio and further qualifications if required. The department is fully committed to your continued professional and personal development, and the diverse training we can offer you will maximise your future employment and promotion prospects. As part of the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will make critical decisions about workflow&lt;/li&gt;\n&lt;li&gt;You will perform complex manual testing of specialist samples&lt;/li&gt;\n&lt;li&gt;You will be the voice of Biochemistry and communicate with wards and Doctors&lt;/li&gt;\n&lt;li&gt;You will contribute to providing a high quality service which consistently delivers on its turnaround times for critical samples.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking to appoint the successful candidate to band 6, but if the successful candidate does not meet the full essential criteria they will be recruited to band 5 and upon successful demonstration of the necessary competency and knowledge (completion of a specialist portfolio), the candidate will progress to band 6.&lt;/p&gt;\n&lt;p&gt;The expected time frame for completion of a specialist Portfolio would be a maximum of 2 years. Therefore if the successful candidate is a Band 5, they would be issued a fixed term contract at band 5 for 2 years and then on completion they would be given permanent Band 6 contracts.&lt;/p&gt;\n&lt;p&gt;You will be required to work 37.5 hours per week and will become a member of our 24/7 shift system upon completion of the required competencies&lt;/p&gt;\n&lt;p&gt;The department is fully committed to your continued professional and personal development; the diverse training we can offer you will maximise your future employment and promotion prospects.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC registered and have experience within blood sciences especially Biochemistry&lt;/li&gt;\n&lt;li&gt;An excellent communicator&lt;/li&gt;\n&lt;li&gt;Well organised&lt;/li&gt;\n&lt;li&gt;Enthusiastic and self-motivated&lt;/li&gt;\n&lt;li&gt;Flexible and willing to adapt&lt;/li&gt;\n&lt;li&gt;Ready to take a multi-disciplinary approach to healthcare delivery&lt;/li&gt;\n&lt;li&gt;Prepared to be challenged&lt;/li&gt;\n&lt;li&gt;Passionate about Biochemistry&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Thursday, 26 November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Doherty&lt;/p&gt;\n&lt;p&gt;Section Lead&lt;/p&gt;\n&lt;p&gt;Sarah.doherty@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381206956&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Specialist Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248051", "validThrough": "2020-11-12T23:59:59+0000"}