{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76885", "minValue": "46534", "unitText": "YEAR", "value": "£46,534-£76,885 per annum"}}, "datePosted": "2020-10-13T13:45:17+0100", "description": "&lt;p&gt;Are you looking to become a Civilian Dental Practitioner (CDP) and work in a friendly and exciting environment? Then this is the job for you. As a CDP you will work on improving and maintaining the dental health and operational fitness of personnel for whom you are responsible. Benefits to the role include free parking and access to a gym.&lt;/p&gt;\n&lt;p&gt;Your primary duties will include but not be limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Inspecting all personnel for whom you are responsible at intervals in accordance with guidelines and providing follow up treatment as required.&lt;/li&gt;\n&lt;li&gt;Providing an occupational oral health assessment, being fully conversant with Dental Fitness categorisation and dental input into the Joint Medical Employment Standard for Service personnel.&lt;/li&gt;\n&lt;li&gt;Ensuring that notes are recorded on individuals’ integrated electronic healthcare records for all episodes of care.&lt;/li&gt;\n&lt;li&gt;Ensuring that surgery management, documentation including consumable stores, the safe custody of personal sensitive data and the maintenance of equipment is kept to a high standard at all times.&lt;/li&gt;\n&lt;li&gt;Onward referral of personnel to enhanced practitioners, specialists or consultants for treatment as appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered with the GDC; and either; have undertaken Foundation Dentist Training (or have qualified before foundation training became compulsory in the NHS); or have evidence of adequate clinical experience (either in the UK or abroad) to be able to practice independently.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Managing a Quality Service&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;This post does not offer any assistance with relocation allowances.&lt;/p&gt;\n&lt;p&gt;Due to COVID 19, there is now a requirement for dental clinical staff to be fit tested for a FFP3 mask, which has to be worn when managing a patient who is undergoing an aerosol generating procedure (AGP). The successful candidate will be fit tested prior to commencing employment.&lt;/p&gt;\n&lt;p&gt;This is a Fixed-term Appointment as a Civilian Dental Practitioner in the Defence Primary Healthcare. Your responsibilities will be as described in this job advert. The reason why you are appointed for a fixed period is because ATR(W) Winchester is planned for closure in 2024. This post will therefore begin on your appointment and will end on 20/12/2023. You should be aware that when your Fixed-term Appointment at MOD comes to an end, arrangements will be made in line with the FTA policy.&lt;/p&gt;\n&lt;p&gt;If you are a permanent MoD civil servant and are found successful for an advertised Fixed-term Appointment (FTA) you should move into the post under a Temporary Transfer (for up to a maximum of 3 years). At the end of the posting you will return to your previous MoD Business area. If this posting is at a higher grade, your promotion will be temporary, and you will return to your substantive grade at the end of the Temporary Transfer. If a Temporary Transfer cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA and Change of Work Location in the UK policy for further information.&lt;/p&gt;\n&lt;p&gt;If you are transferring to MoD from another government department (OGD) you should join the MoD on an inward loan. At the end of the loan you will return to your home (OGD) department. If a loan cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA policy for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO22 6NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0903", "longitude": "-1.33834"}}, "title": "Civilian Dental Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224530", "validThrough": "2020-11-08T23:59:59+0000"}