{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-11-06T15:16:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Coding Audit and Training Lead Band 8a (Indicative)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you our new Clinical Coding Audit and Training Lead? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the necessary skills, experience and personality to lead our audit and training function?&lt;/p&gt;\n&lt;p&gt;The Dartford and Gravesham Clinical Coding Service is benefitting from a significant investment to support our growth. The result is a department re-structure delivering effective leadership, career progression and excellent benefits.&lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;We are a centralised coding team with an outreach at Queen Mary’s Hospital in Sidcup. Our source documentation for coding is a mix of paper and electronic documents, with an emphasis on moving towards a fully electronic patient record.&lt;/p&gt;\n&lt;p&gt;This is a busy, friendly department, in an easily accessible location that is well served by road and rail links from Kent and London.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide a vital and dynamic role within a busy but supportive team by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Having responsibility for the development and delivery of an in- house audit programme to satisfy internal data quality and Data Security and Protection requirements.&lt;/li&gt;\n&lt;li&gt;Implementing and delivering regular approved training sessions for clinical coders, clinicians and managers to improve knowledge of clinical coding and related topics both internally and externally to the Organisation.&lt;/li&gt;\n&lt;li&gt;Accessing, analysing and reporting on audit/validation outcomes, providing recommendations that impact on the wider trust services and processes to the Head of Coding on the training needs, performance of coders and ways to improve the trusts data quality/services&lt;/li&gt;\n&lt;li&gt;Supporting the Head of Clinical Coding in delivering a quality service throughout the Trust and flying the flag for robust data recording&lt;/li&gt;\n&lt;li&gt;Having a strong team working ethos&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants with either one or both Audit and/or Training qualification are very welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSheniz BahriyeliJob titleHead of Clinical CodingEmail addresssheniz.bahriyeli@nhs.netTelephone number07841572733&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darent Valley Hospital, Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Clinical Coding Audit Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260313", "validThrough": "2020-11-08T23:59:59+0000"}