{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata - unsocial h"}}, "datePosted": "2020-10-27T13:01:30+0000", "description": "&lt;p&gt;Do you want to progress your career in paediatric pharmacy?&lt;/p&gt;\n&lt;p&gt;Are you driven by the desire to improve paediatric patient care?&lt;/p&gt;\n&lt;p&gt;Are you keen to provide and partake in the learning opportunities offered from working in a specialist area?&lt;/p&gt;\n&lt;p&gt;If so, this is the post for you.&lt;/p&gt;\n&lt;p&gt;Royal Manchester Children’s Hospital is world renowned, and provides care to complex patients including oncology, haematology, metabolic medicine, surgery, critical care, renal medicine, rheumatology, endocrinology, cardiology, respiratory and neurology.&lt;/p&gt;\n&lt;p&gt;Our Women’s and Children’s Pharmacy Team is seeking applications for a Specialist Paediatric Pharmacist to join our well established Haematology-Oncology clinical pharmacy team providing front-line services in paediatric haematology, oncology and Haemopoietic Stem Cell Transplant.&lt;/p&gt;\n&lt;p&gt;Royal Manchester Children&#39;s hospital hosts one of the largest Primary Treatment Centres for children&#39;s cancer services in the UK. We deliver an expanding and innovative JACIE accredited BMT service, which includes CAR-T cellular therapy. We also work in partnership with the Christie Hospital to provide Proton Beam services to children from around the UK.&lt;/p&gt;\n&lt;p&gt;With new therapies emerging for the management of haemoglobinopathies and haemophilia, we have an opportunity to develop the clinical pharmacy service to these patients and support gene therapy trials.&lt;/p&gt;\n&lt;p&gt;In this role you will be part of a team of senior Women’s and Children’s Pharmacists and supported by band 6/7 Pharmacists to provide a high level Pharmacy service to the Women’s and Children’s Hospitals.&lt;/p&gt;\n&lt;p&gt;Working within the Women’s and Children’s pharmacy team can offer you support in developing your expertise and skills through formal training courses, mentoring and regular appraisals. Our team has a wealth of clinical knowledge in a wide range of clinical specialities with a strong team of senior pharmacists. We have excellent links with local universities and CPPE, as well as a variety of clinical national networks.&lt;/p&gt;\n&lt;p&gt;Passion, dedication and motivation are essential here; you will need to be a confident communicator, comfortable working in hospital teams and solving problems under pressure, with an enthusiasm for learning and personal development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact&lt;/p&gt;\n&lt;p&gt;Danielle Timoney&lt;/p&gt;\n&lt;p&gt;Lead Pharmacist for Women&#39;s &amp; Childrens Services&lt;/p&gt;\n&lt;p&gt;(Danielle.timoney@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 701 5506&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Manchester Children&#39;s Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Senior Paediatric Pharmacist - Haematology Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244655", "validThrough": "2020-11-09T23:59:59+0000"}