{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 £37,638-£44,780 pa Incl"}}, "datePosted": "2020-11-03T15:01:10+0000", "description": "&lt;p&gt;&lt;span&gt;A vacancy has become available within the Paediatric Nursing Team at St George’s Hospital in Tooting, South London; we are looking for an experienced nurse with experience in discharging patients from a variety of inpatient services to their own home and outreach services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Clinical Nurse Specialist the post holder will be expected to coordinate the discharge of patients within the ward and PICU settings often, including complex and contentious situations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This exciting position offers the right opportunity for an individual to work autonomously with their own patient case load&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The main hospital site is situated a short walk from Tooting Broadway station and is easy to access from across London and beyond. St George’s is a tertiary and quaternary referral centre so your workload with be varied, complex and interesting. The role will require collaborative working with the safeguarding children’s and adults team, specialist midwives, Independent Domestic Violence Advisor, Red Thread (youth gang/crime/violence reduction team), various multi-agency professionals and several multi-disciplinary professionals in the health community in and around South West London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be a credible point of contact for staff, providing informed advice, education and support in relation to the safe and effective discharge children from our services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will liaise with a wide variety of colleagues from time to time, but the ability to work effectively with children’s social care staff, as well as Trust colleagues, will be particularly important.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; Informal enquiries about the role are very welcome and should be directed to&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tania Haughton&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Matron, Inpatient Paediatrics&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tania.haughton@stgeorges.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Paediatric Discharge Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254468", "validThrough": "2020-11-22T23:59:59+0000"}