{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 FTC 12 months funding"}}, "datePosted": "2020-10-28T08:16:24+0000", "description": "&lt;p&gt;An opportunity has arisen to join our Cellular Pathology Team as the Project Manager for the implementation and early operational phases of Digital Pathology for primary diagnostic use within service.&lt;/p&gt;\n&lt;p&gt;The Project manager will assist in the development of this transformational project. This includes taking responsibility for outlining the detailed project plans, ensuring that there is engagement from all key stakeholders and delivering the project to the agreed milestones and outcomes.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure that Pathologists, Laboratory personnel and A+C staff engage with and support the pathway redesign to deliver a high quality efficient diagnostic service.&lt;/p&gt;\n&lt;p&gt;The success of the role will require persuasive skills to engage all stakeholders and staff in Cellular Pathology, negotiating and motivating them to engage in the change process to deliver service improvement and redesign. This will include working in collaboration with all members of the project team, ICT services, Finance and Procurement teams, estates and facilities and external suppliers for this Project.&lt;/p&gt;\n&lt;p&gt;Close liaison with counterparts within Cellular Pathology services in the Midlands and East 2 network and the PathLAKE consortium is also required.&lt;/p&gt;\n&lt;p&gt;Experience of project management in the NHS setting is essential and an understanding of the clinical use of digital pathology and the potential applications of artificial intelligence would be advantageous for this role.&lt;/p&gt;\n&lt;p&gt;The Cellular Pathology department, which is based on 2 campuses, currently receives and processes approximately 66,000 surgical histology requests per year, resulting in the production of over 310,000 slides for microscopical examination. The use of digital pathology for primary diagnostics will see the majority of slides, scanned and resulting images used by our Consultant pathologists for diagnostic assessment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name-Andrea Gooding&lt;/p&gt;\n&lt;p&gt;Job title-Cellular Pathology Services manager&lt;/p&gt;\n&lt;p&gt;Email address-andrea.gooding@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01159 9249924 ext 63530&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG72UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Project Manager Digital Pathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245707", "validThrough": "2020-11-10T23:59:59+0000"}