{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-20T15:15:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity is available for a skilled, experienced and enthusiastic Advanced Occupational Therapist to join our Neighbourhood Teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Integrated Neighbourhood Team model has led to the development of 6 neighbourhoods teams across Barnsley, with the aim of improving outcomes for people and maximising access to services through integrated working. The Neighbourhood Teams aim to maintain people within their own homes/communities wherever possible and facilitate earlier discharge from hospital through delivering a more co-ordinated approach to care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone with the skills and knowledge to support our neighbourhood teams and provide skilled support for patients with complex needs in relation to enduring pathways and people with long-term physical and/or neurological conditions. You will however, be working across neighborhoods using your skills in appropriate occupational therapy pathways.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide clinical leadership of the neighbourhood Occupational Therapy Team, working within the community. You should have excellent communication skills, time management skills, and strong clinical skills, including knowledge of cognitive assessment and rehabilitation and complex physical rehabilitation. You will have a strong commitment to patient centered and evidence-based care, and be innovative, creative, and dynamic. This role includes facilitating service development and leading development projects as we continue to transform and modernise patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you feel you have the appropriate skills and experience for the post, and you are forward thinking, enthusiastic and have a passion for working with adults who may have complex conditions/longer-term therapy needs, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The use of a vehicle to undertake any necessary travel in connection with the duties of the post is essential along with the ability to work flexibly including evenings, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in this exciting new opportunity and would like an informal discussion regarding this role please contact Bob Senior on 01226 644213 / 01226 644387 / bob.senior@swyt.nhs.uk or Lisa Lenton on 01226 644252 / lisa.lenton@swyt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.547", "longitude": "-1.45462"}}, "title": "Advanced Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234949", "validThrough": "2020-11-12T23:59:59+0000"}