{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T10:30:03+0000", "description": "&lt;p&gt;&lt;strong&gt;**Please note this position is for current East Cheshire NHS Trust employee’s only**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Business Planning department is looking for a Business Planning Co-ordinator to work as part of this dynamic and exciting team. The purpose of this team is to provide an agile response to business planning opportunities and issues presented to the Trust and wider health and social care economy. This is in addition to playing a key role in the Trust’s delivery of a challenging financial savings target, supporting the directorates to develop operational service line and efficiency plans, and contributing to the annual business planning cycle.&lt;/p&gt;\n&lt;p&gt;The role helps deliver the Trust’s efficiency savings programme through the identification, monitoring and reporting of identified savings and analysis of new opportunities. The role will also provide planning and project facilitation for a programme of work supporting the key business issues of the Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;monitor and report on the trust efficiency programme&lt;/li&gt;\n&lt;li&gt;proactively liaise with internal and external stakeholders to ensure outcomes are achieved&lt;/li&gt;\n&lt;li&gt;provide project management support to various programmes of work&lt;/li&gt;\n&lt;li&gt;Undertake information validation, analysis and benchmarking to identify areas of opportunity.&lt;/li&gt;\n&lt;li&gt;contribute to the planning, co-ordination and production of plans to meet the Trust’s vision, objectives and priorities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This vacancy will provide an interesting and varied workload and would ideally suit an enthusiastic and adaptable individual. The successful applicant will have extensive opportunities to develop their existing skills as well as learning new transferable skills within a healthcare provider setting. They will learn about a range of systems and processes used within the department and the approaches required for the Trust to operate effectively and efficiently.&lt;/p&gt;\n&lt;p&gt;The role requires the post holder to have excellent interpersonal skills, experience of project management, be highly numerate with well developed computer and data analysis skills and able to organise and prioritise a busy workload. They should have the ability to manage their own work with direction from their manager.&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: 22.5 - 28&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Julia Cazalet Job title Associate Director of Finance Email address julia.cazalet@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Business Planning Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251569", "validThrough": "2020-11-08T23:59:59+0000"}