{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 p.a inc with Fringe HCAS"}}, "datePosted": "2020-11-06T12:31:28+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;This vacancy will attract the Golden Hello, a welcome incentive of up to £2500. Please see attached document for full terms and conditions.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for new challenges? Do you want to work in an ever changing environment where no two days are the same? Do you want to feel that you really make a difference? Want to provide truly holistic nursing care? Fed up of routine and regular?&lt;br /&gt;&lt;br /&gt;Have you answered yes to these questions?&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This might be the job for you…&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are looking for Primary Care Nurses to join us as part of the Primary Care team within the prison of HMP Coldingley.&lt;br /&gt;&lt;br /&gt;Primary Care in prison? Yes, this is an opportunity to use all of your clinical and interpersonal skills, an opportunity to develop new skills and work with a unique population group who need your nursing skills. &lt;br /&gt;&lt;br /&gt;We work with a range of men who are sentenced, some of whom have been sentenced for life. For some it is the first time in prison, for others it&#39;s their twentieth. Every person we work with could be someone’s father, son, husband or brother. Our job is not to judge, our job is to provide exceptional care with kindness and compassion. Our motto? Caring not judging. &lt;br /&gt;&lt;br /&gt;Health and wellbeing is one of the pathways to reducing re-offending. It could be through your interactions that changes the way a man thinks about his future, thinks about his health needs, and feels about himself and others. &lt;strong&gt;You&lt;/strong&gt; could make a difference.&lt;br /&gt;&lt;br /&gt;This is a varied role working within a Primary Care setting and involves assessing, treating and carrying out effective care planning. It takes a very special, dedicated, resilient and caring nurse to provide care in such an ever changing, dynamic environment and you will be joining like-minded exceptional healthcare professionals.&lt;br /&gt;&lt;br /&gt;Working alongside the Mental Health and Substance Misuse team affords us the benefit of being able to work in a truly holistic manner, responding to the needs of both physical and mental well-being in partnership. &lt;br /&gt;&lt;br /&gt;Want to learn more about our Offender Care Services?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a real passion for delivering high quality clinical care. You will be self-motivated, flexible and work well within a team but be able to work autonomously.&lt;/p&gt;\n&lt;p&gt;You do not need to have prison experience as we will provide you with a full induction and training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarol CasbierdJob titlePrimary Care Team LeadEmail addresscarol.casbierd@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;We encourage applicants to book informal visits before applying&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Coldingley, Bisley, Woking, Surrey, Woking", "postalCode": "GU24 9EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.323", "longitude": "-.642147"}}, "title": "Staff Nurse - HMP Coldingley", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259670", "validThrough": "2020-11-13T23:59:59+0000"}