{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49228", "minValue": "39045", "unitText": "YEAR", "value": "£39,045 - £49,228 per annum pro rata"}}, "datePosted": "2020-10-19T15:32:01+0100", "description": "&lt;p&gt;We have an exciting opportunity for an exceptional business development professional to lead the implementation and development of Here’s Business Development plan.&lt;/p&gt;\n&lt;p&gt;This is a challenging and varied role which will require you to establish, build and maintain relationships with key stakeholders to increase awareness of Here’s capabilities and strengths, as well as leading the organisation’s response to relevant local and national procurement exercises and other business opportunities. It would be an advantage to have Senior-level business development experience, preferably in the Health and social care sector.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Here&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here is a not-for profit, social enterprise, membership organisation delivering NHS services. Our members are local GPs, practice managers, practice nurses and our own staff. Our purpose in the world is care unbound: to create more possibilities for care in every moment.&lt;/p&gt;\n&lt;p&gt;As an organisation we have invested heavily in our workforce and culture, embedding teal organisational principles of purposeful working, wholeness and self-management. We are influenced by systems thinking approaches to clinical care, and radically innovate within health services to place people at the heart of their healthcare journey. We are committed to cultivating a culture of inclusion and connectedness. We are able to grow and learn better together with a diverse team and welcome the unique contribution people can bring by drawing on and celebrating the differences in who we are, what we’ve experienced and how we think.&lt;/p&gt;\n&lt;p&gt;Please note, if we receive enough good quality CVs and 1 page profile before the closing date we will close the advert.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Next Steps - please read.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in this role, please send your CV and the attached 1 page profile to bics.hr@nhs.net (document attached under the Job Description and Person Specification).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 6th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will take place week commencing 16 November 2020 (day to be confirmed)&lt;/p&gt;\n&lt;p&gt;Contact for any questions Sarahbartholomew@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Here are committed to equality and valuing diversity.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care Unbound Limited, trading as Here", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130037"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN1 6AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8384", "longitude": "-.148266"}}, "title": "Senior Business Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232947", "validThrough": "2020-11-06T23:59:59+0000"}