{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 inc Frindge HCAS"}}, "datePosted": "2020-11-02T09:01:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist within the Intensive Support Team, Surrey and Borders Partnership NHS Foundation Trust. 2.5 or 3 days (18.75 – 22.5 hours) based within the Surrey Heath and NE Hants &amp; Farnham CMHTOPs (team bases in Frimley, Surrey and Aldershot, Hampshire)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Would you like to be part of an innovative team that has been shortlisted for the Royal College of Psychiatrists ‘Team of the Year’ award in 2019-2020?&lt;/li&gt;\n&lt;li&gt;Are you keen to gain specialist skills in the field of Positive Behaviour Support and behaviours that challenge?&lt;/li&gt;\n&lt;li&gt;Do you want to develop your supervision and clinical leadership skills?&lt;/li&gt;\n&lt;li&gt;If you are looking for a new challenge, please see below for more information about this exciting opportunity!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for an enthusiastic and innovative qualified Clinical Psychologist to provide high quality services to people with dementia who are displaying behaviours that challenge within care homes.&lt;/p&gt;\n&lt;p&gt;This is a 0.5 or 0.6 WTE (18.75 - 22.5 hours per week) permanent post and applications are welcomed from both experienced and newly qualified candidates.&lt;/p&gt;\n&lt;p&gt;This exciting role will involve working with a degree of autonomy in conducting detailed assessments, formulations, therapeutic interventions and neuropsychological assessments for older people with dementia and complex behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;Under supervision, you will also support the development of Care Home Pathway services within the Frimley ICS region (which includes two CMHTOPs that both have a dedicated Care Home Pathway function).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Supervision and training opportunities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be professionally supervised by a Senior Clinical Psychologist as well as receiving line management supervision from the IST Lead. In addition, you will be able to access neuropsychology group supervision from a Clinical Neuropsychologist and peer supervision spaces arranged within the department. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining an active department of approximately 18 qualified Psychologists who connect regularly to share experiences, campaign for the rights of older people and shape local services. We have strong links with the Clinical Psychology Doctoral Training Programme at the University of Surrey, as well as our Trust’s Research &amp; Development team.&lt;/p&gt;\n&lt;p&gt;You will be well supported within the psychology department, where Continuing Professional Development and staff support are highly valued. There will also be opportunities for you to meet regularly with other Psychologists across the Trust for CPD events and service development/transformation projects.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that we have other part-time posts within the OP psychology department (both within community and inpatient services) that can be paired with this position if you are seeking full-time hours.As a Trust, we support flexible working and are happy to explore your preferences for desired hours/working patterns at interview.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Any job offer will be dependent on HCPC registration and we require successful applicants to have a UK driving licence and access to a car for work-related purposes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you would like more information, please contact Dr Katy Lee (IST Lead and Principal Clinical Psychologist)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley, Aldershot, Fleet, Camberley, Farnham", "postalCode": "GU16 7ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3164", "longitude": "-.747554"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251375", "validThrough": "2020-11-29T23:59:59+0000"}