{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-27T09:41:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you seeking an exciting, rewarding and fulfilling job role where every day is different?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about the delivery of safe and effective patient centred care and ensuring the delivery of effective clinical governance?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If so…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A new and exciting opportunity has arisen within the Medical Division here at the Northern Devon Healthcare Trust. As a Clinical Matron your portfolio of work will focus on the care of the elderly, which will include overseeing 3 medical wards. Along with ward level oversight you will line manage and support a number of speciality driven clinical nurse specialists that will feed into the divisional clinical strategy and the governance structure. The speciality has recently seen the appointment of a new care of the elderly consultant alongside strong therapy leadership. The edition of a clinical matron will strengthen the clinical leadership and multi-professional pathways for our patients across acute and community services. You will be expected to work in partnership with the other matrons in the division and across the organisation to support delivery of the quality agenda.&lt;/p&gt;\n&lt;p&gt;If successful in application you will be an integral member of the division’s management team and the senior nursing team, developing a clear nursing vision for our patients and staff. On a rotational basis you will be part of Clinical Matron rota covering staffing giving the opportunity to support all acute teams across the Trust. This will involve the occasional weekend shift.&lt;/p&gt;\n&lt;p&gt;You will also have the opportunity to expand your operational management through the out of hours by joining the silver command duty manager rota providing support and guidance for the Clinical Site Managers. By coming to work for us we can offer you a supportive forward thinking environment, there will be plenty of opportunities to further develop your nursing career and strengthen styles of leadership which could be supported by our in house leadership programme.&lt;/p&gt;\n&lt;p&gt;The hours for this post are 37.5 per week.&lt;/p&gt;\n&lt;p&gt;For any further information please contact Paul Schofield, Associate Director of Nursing, Medical Division on 01271 322577 ext 2933 or email p.schofield2@nhs.net&lt;/p&gt;\n&lt;p&gt;Interviews are scheduled for the 11th December 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** As this post is in a shortage occupation code it qualifies for the Trust’s Recommend a Friend Scheme, please find further information on the attached link**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22 November 2020 &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Clinical Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243858", "validThrough": "2020-11-22T23:59:59+0000"}