{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-21T10:41:47+0100", "description": "&lt;p&gt;An opportunity has arisen for a full-time RGN to join our busy Endoscopy team at The Yorkshire Clinic in Bingley. As an NMC Registered nurse you will be required to provide quality care for patients in the Endoscopy Unit. Good communication and evidence of continuing development are essential. Previous experience of working with an Endoscopy unit is preferred although we will support candidates who are looking to learn the skills required to work within an Endoscopy unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Purpose &amp; Core Responsibilities:&lt;/strong&gt;&lt;br /&gt;• Optimise patients prior to their Endoscopy Procedure through robust Pre-assessment: Assessment and planning of care&lt;br /&gt;• Assess, plan, implement and evaluate care during the patients’ journey ensuring all care is delivered in line with national guidelines and Ramsay policies&lt;br /&gt;• Work in the Endoscopy procedure room supporting the Consultant and patient during Endoscopy procedures&lt;br /&gt;• Ensure all equipment is maintained and used correctly&lt;br /&gt;• Ensure care delivered is aligned to the Joint Advisory Group on Gastrointestinal (JAG) quality standards&lt;br /&gt;• Deliver care using the Ramsay Core Values of ‘People Caring for People’&lt;br /&gt;• Apply legislation, policies and procedures correctly&lt;br /&gt;• Provide appropriate support and advice, utilising members of the MDT as required&lt;br /&gt;• Record, monitor and interpret patient’s vital signs&lt;br /&gt;• Report to nurse in charge appropriately when required&lt;br /&gt;• Attend ILS/AIM training&lt;br /&gt;• Respect the patient&#39;s dignity, privacy, wishes and beliefs&lt;br /&gt;• Ensures that a clean working environment is maintained&lt;br /&gt;• Liaise with internal customers to ensure all service requirements are met&lt;br /&gt;• Ensures that stock levels are maintained in line with department requirements’&lt;br /&gt;• Disposes all of decontaminated waste in accordance with statutory policies and procedures&lt;br /&gt;• Maintain accurate records in accordance with statutory policies and procedures&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Knowledge/ Skills/ Qualifications:&lt;/strong&gt;&lt;br /&gt;• Registered Practitioner with NMC registration&lt;br /&gt;• Previous Endoscopy experience desirable&lt;br /&gt;• Good interpersonal and communication skills&lt;br /&gt;• Ability to work as part of a team&lt;br /&gt;• Experience of applying clinical reasoning skills across a range and varied patient case mix and competent across a range of skills&lt;br /&gt;• Demonstrable experience in working in a busy, changing environment&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us:&lt;/strong&gt;&lt;br /&gt;The Yorkshire Clinic is one of West Yorkshire&#39;s leading private hospitals set in three acres of woodland in the grounds of Cottingley Hall near Bingley. The hospital opened in 1982 and has 57 bedrooms all with en suite facilities. The Endoscopy unit is a designated unit within the hospital. By investing in advanced medical technology, the hospital offers a wide range of treatments and services.&lt;br /&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“The Ramsay Way” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return, we offer the successful candidate:&lt;/strong&gt;&lt;br /&gt;• Negotiable salary dependent upon skills and qualifications + enhancements for unsocial hours and on-call&lt;br /&gt;• 25 days annual leave&lt;br /&gt;• Contributory Pension scheme&lt;br /&gt;• Private Healthcare&lt;br /&gt;• Life Assurance&lt;br /&gt;• Ongoing training and development&lt;br /&gt;• Free parking &amp; subsidised staff restaurant&lt;/p&gt;\n&lt;p&gt;All offers of employment in respect of this appointment will be subject to receipt of a satisfactory Enhanced Disclosure Certificate from the Disclosure &amp; Barring Service.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Committed to quality, equality and opportunity for all.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD16 1TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.832", "longitude": "-1.818"}}, "title": "Staff Nurse - Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235939", "validThrough": "2020-11-06T23:59:59+0000"}