{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17820", "minValue": "16632", "unitText": "YEAR", "value": "£16,632 - £17,820 This is a training contract (Ann"}}, "datePosted": "2020-11-06T11:15:45+0000", "description": "&lt;p&gt;Would you like an opportunity to train in Pharmacy to become a pharmacy professional? Then why not train as a Pharmacy Technician?&lt;/p&gt;\n&lt;p&gt;You will be working in a busy, friendly department and will be given full training, support and supervision throughout the 2 year training contract to achieve the skills required to be become a qualified Pharmacy Technician.&lt;/p&gt;\n&lt;p&gt;This Advanced Apprentice post is designed to give the trainee the technical experience and knowledge to be able to register and work as a Pharmacy Technician on completion of the two year training post and end point assessment.&lt;/p&gt;\n&lt;p&gt;To achieve this, it requires participation and completion of a rigorous training and competency programme covering the various areas of pharmacy including dispensing different prescription types, working on the hospital wards with the clinical pharmacy staff, performing the final accuracy check on dispensed items and pharmacy distribution and stores.&lt;/p&gt;\n&lt;p&gt;Training is based on a two year programme leading to a BTEC Level 3 Diploma in the Principles and Practice for Pharmacy Technicians qualification. You will be required to attend college one day a week via distance learning, and in the workplace you will undertake a comprehensive in-house training programme provided by our own pharmacy team. You will also have some dedicated time during the day to undertake private study, in concert with personal study at home. Progression from year one to year two of the course is dependent on successful completion of all assignments and assessments set in year one. This post holder will be based at St. Richards hospital for the length of the training.&lt;/p&gt;\n&lt;p&gt;Applicants should have a minimum of 4 GCSE’s at grade C/level 4 or above (or equivalent), to include Mathematics, English Language and a 2 Science subjects (dual award sciences acceptable). Note - if higher qualifications have been gained (e.g. A levels/diploma/degree), it is essential that GCSE subjects and grades (or GCSE equivalents) are also clearly stated on the application form to enable a full assessment of the individuals ability to meet the essential person specification criteria.&lt;/p&gt;\n&lt;p&gt;For further information please contact John Pescott, Senior Technician Education and Training (St Richard’s Hospital) on 01243 831519 or email john.pescott@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJohn PescottJob titleSenior Pharmacy Technician - Education and trainingEmail addressjohn.pescott@nhs.netTelephone number01243 831519&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Richards Hospital, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Pre registration Trainee Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259365", "validThrough": "2020-11-22T23:59:59+0000"}