{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-29T11:30:54+0000", "description": "&lt;p&gt;&lt;span&gt;LOCUM CONSULTANT DIAGNOSTIC NEURORADIOLOGIST&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join a busy and aspiring department of 6 neuroradiologists who provide a comprehensive specialist diagnostic and interventional service. The new postholder will join the team to support diagnostic neuroradiology to cover maternity leave and maintain the efficient running of the Neuroradiology department.&lt;/p&gt;\n&lt;p&gt;Currently Neurosciences is undergoing an exciting period of investment for expansion and a new build to be completed by 2021. Brighton &amp; Sussex NHS trust is a teaching hospital offering tertiary neurosciences services across Sussex &amp; Surrey counties. We are a busy teaching hospital supporting about 2 million population. We have a Regional Neurosciences Unit, a level one Trauma centre and a Hyperacute Stroke Unit with a budding mechanical Thrombectomy service. A key consideration in advertising this post is in taking forward plans to offer a consistent Mechanical Thrombectomy service.&lt;/p&gt;\n&lt;p&gt;In early 2019 Care Quality Commission’s (CQC) published its report following its inspection of Brighton and Sussex University Hospitals (BSUH) which showed a significant improvement in our rating to the second-highest possible: ‘Good’. It also rated the trust as ‘Outstanding’ for caring.&lt;/p&gt;\n&lt;p&gt;The successful applicant should possess FRCR (or equivalent), should have undertaken accredited diagnostic and interventional Neuroradiology training and should be included on the Specialist Register within 6 months of CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;When completing the application form please ensure you complete the section relating to your CCT date. If you have already have your CCT please confirm when you will be on the GMC Specialist Register. Please be aware you only have 12 months from your CCT to join the specialist registrar otherwise you will have to go through the CESR Route.&lt;/p&gt;\n&lt;p&gt;In addition to supplying us with your referee details for the last 3 years please also provide us with the contact details of your Responsible Officer for Appraisal and Revalidation&lt;/p&gt;\n&lt;p&gt;In the interest of equal opportunities, we want to make sure that information about candidates is provided in the same format so all applicants should fill in the standard application form on the NHS Jobs website and attach their cv.&lt;/p&gt;\n&lt;p&gt;For more information prospective candidates are welcome to contact Ram Vundavalli, Lead Consultant Neuroradiologist (sriram.vundavalli@bsuh.nhs.uk) 01444441881 extension 5722/5718 or 07793754525. Please refer to the person specification in the job description with regards to CCT requirements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSriram VundavalliJob titleLead clinician, Training lead and Consultant NeuroradiologistEmail addressSriram.vundavalli@bsuh.nhs.ukTelephone number01444441881 ext.5722/5718 or 07793754525&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Locum Consultant Diagnostic Neuroradiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248122", "validThrough": "2020-11-26T23:59:59+0000"}