{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum pro rata for Part time"}}, "datePosted": "2020-11-03T11:01:07+0000", "description": "&lt;p&gt;Southend University Hospital NHS Foundation Trust is looking for a Chief Cardiac Physiologist. We are an busy department who are able to provide a wide range of investigations for both Cardiology and Respiratory, and are looking for someone who is a motivated individual to join our existing team in our expanding department. &lt;br /&gt;&lt;br /&gt;We have a dynamic and inter professional cardiology team consisting of 6 Consultant Cardiologists who offer a wide range of invasive and non invasive services across the cardiac spectrum to our local community. &lt;br /&gt;&lt;br /&gt;The department currently offers physiologist led exercise testing, MIBI, ambulatory services and a busy device clinic covering pacemaker, ICD and CRT follow ups.&lt;br /&gt;&lt;br /&gt;For the echocardiogram service, we currently offer Transthoracic Echocardiography, Transoesophageal echocardiography, stress echocardiography, exercise echocardiography and contrast studies. &lt;br /&gt;Our philosophy is to deliver an excellent standard of patient focused care in line with NICE guidelines, National Service Frameworks and evidence based practice.&lt;br /&gt;&lt;br /&gt;To be successful in this post you should be self-motivated, well organised and demonstrate excellent interpersonal skills. For this role, you will be encouraged to expand on your current knowledge and will help assist the Principal Physiologist with the day to day running of the department. This will involve some service development, equipment evaluation, training and general day to day organisation of that area. &lt;br /&gt;&lt;br /&gt;In this role you should have BSc in Clinical Physiology/HTEC/MPPM or equivalent. Demonstrate your ability to perform a full range of invasive and non-invasive tests on a variety of patients, i.e. children and adults, as well as analyse results and produce technical reports for the doctors and staff.&lt;br /&gt;&lt;br /&gt;This is a full time permanent post of 37.5 hours per week. &lt;br /&gt;&lt;br /&gt;At Southend Hospital NHS Trust we strongly believe in patient care and want to attract like-minded people to help build and maintain a supportive and enjoyable place to work. We have set our trust values to reflect our passion for patient care; we believe ‘Care with Compassion, Working Together and being Professional and Accountable’. &lt;br /&gt;&lt;br /&gt;Southend University Hospital Staff benefits:&lt;br /&gt;•Salary Sacrifice Car Scheme&lt;br /&gt;•Large range of discounts which continues to grow and includes; gym memberships, large retail stores, local builders and mechanics, travel agents, phone line providers, local beauticians and much more.&lt;br /&gt;•Occupational Health and Wellbeing service&lt;br /&gt;•An initial guaranteed annual leave entitlement of 27 days (pro rata) rising to 33 days (pro rata) after 7 years’ service&lt;br /&gt;•An onsite nursery with discounted prices for staff members&lt;br /&gt;•Competitive pension&lt;br /&gt;&lt;br /&gt;To gain a better understanding of our Trust’s vision and work ethic, please read our hospital Magazine &#39;The Look&#39; via our hospital website or follow our videos on YouTube under &#39;SouthendHospitalNHS&#39;.&lt;br /&gt;&lt;br /&gt;The Area:&lt;br /&gt;Southend is a lively and vibrant seaside town, most famous for having the world’s longest pier. It boasts excellent road and rail communications – central London is less than an hour away by train and the newly-expanded airport is introducing new routes all the time. The town is renowned for its wide variety of cultural and sporting opportunities, with top-class theatres, arts and music festivals and water sports. It also prides itself on offering a buzzing nightlife with clubs, excellent restaurants and bistros. There are outstanding shops as well as plenty of parks and open spaces.&lt;br /&gt;&lt;br /&gt;If you are interested in the role and believe you hold the qualities we require then apply today!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola BainesJob titlePrinciple Physiologist/General Manager for CardiologyEmail addressnicola.baines@southend.nhs.ukTelephone number01702 435555 x6102Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about the post or organise a tour of the department then please contact: &lt;br /&gt;&lt;br /&gt;Katy Donaldson on: 01702 435555 exec 8209 or Katy.donaldson@southend.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital, Westcliff on Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Chief Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253598", "validThrough": "2020-11-17T23:59:59+0000"}