{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 pa. Incl of HCAS (15%)"}}, "datePosted": "2020-11-03T11:16:20+0000", "description": "&lt;p&gt;Do you have a real passion for caring for children in the Emergency Department? If so, Kingston Hospital NHS Trust is the place for you! We have vacancies for registered Children’s nurses within our Emergency Department, rated “Outstanding” by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a great time to join our team and make a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Band 5 Children’s nurses with a passion for child centred care to join our friendly team in ED. The applicant should have excellent communication and organizational skills and the ability to work in a fast moving environment. You will be responsible for ensuring the delivery of safe and effective care to our service users and in guiding and supporting families whilst providing this care.&lt;/p&gt;\n&lt;p&gt;We have a dedicated Paediatric Emergency Department and a newly built Children’s Resuscitation Bay and Urgent Treatment Centre. The Paediatric Emergency Department sees approximately 29,000 children per year.&lt;/p&gt;\n&lt;p&gt;Our Practice Development Nurse, ED Senior Sister and Paediatric ED Matron will support and encourage you to develop both clinically and managerially and offer a comprehensive induction programme, preceptorship, teaching sessions and in-house training. We run paediatric simulations regularly, led by Consultants in the resus bay in ED. We also have an ED Resus Team who will support you in resus scenarios.&lt;/p&gt;\n&lt;p&gt;Applicant must be flexible in shift working pattern to include weekday, night and weekend.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital NHS Trust is based in Kingston upon Thames, a bustling riverside town on the borders of London and Surrey. Kingston offers a wide variety of bars, cafés, restaurants and clubs. Richmond Park is just a 5 minute walk from the Hospital, which is well served by public transport with Norbiton Station on the doorstep. This allows you to jump on a train and arrive in central London, 12 miles away, in less than 30 minutes.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital NHS Trust recognises that everyone is different, and values the unique contribution that individual experiences, knowledge and skills make in delivering quality healthcare and becoming a model employer. We will continue to promote equality and challenge discrimination in all service provision, recognising and meeting the needs of the diverse communities we serve. We will strive to provide an environment in which people want to work and to be a model employer leading in good employment practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health and Wellbeing &amp; Staff Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust understands that benefits go beyond just financial rewards and offers a wide range of benefits that recognise staff contribution, provide opportunities for career development and offer initiatives to promote a healthy work life balance &lt;em&gt;Our Health Heroes Awards 2018 – Staff Retention and Wellbeing Employer of the Year&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Working together to deliver exceptional, compassionate care – each and every time&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application to include the names and contact details of referees (that should cover your last 3 years of employment), one of whom should be from your current or last employer. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Leila Saadi, Paediatric ED Senior Sister, or&lt;/p&gt;\n&lt;p&gt;ED Matron via main switchboard 020 8546 7711&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital, Kingston", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Paediatric Staff Nurse - A&amp;E", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253670", "validThrough": "2020-11-17T23:59:59+0000"}