{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T12:28:00+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Ward/Recovery/ ENDOSCOPY Nurse&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;TIVERTON Day Surgery UNIT&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Critical Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;ROYAL&lt;/strong&gt;&lt;strong&gt; DEVON &amp; EXETER HOSPITAL&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.**&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking to appoint a dynamic, dedicated Ward/Recovery/ Endoscopy Nurse. The sucessful candiate will plan and manage the implementation of individual care programmes for patients as part of the team within the Tiverton Day Surgery Unit with the flexibility to support the other community Day Case Units. The successful applicates will be valuable in delivering high quality care in a professional and friendly environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; Here at the Royal Devon and Exeter NHS Foundation Trust, we are very proud of being Exeter&#39;s biggest employer, with over 6,000 dedicated employees. As one of the UK&#39;s leading Trusts, at the forefront of improving international healthcare, we have a passion for pursuing perfection across all areas of our operations and excellent career development opportunities wherever you join us. &lt;br /&gt; &lt;br /&gt; This post requires enthusiasm, motivation, excellent communication skills and a commitment to work flexibly within a multidisciplinary team and with other Community Day Case Units, as well as on our main Wonford site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; If you are a good communicator, have excellent interpersonal skills, are hard working and would like to make a real difference within this service, we would like to hear from you.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Salary: &lt;/span&gt;£24,907 - £30,615 &lt;span&gt;per annum&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Lizzy Charlton-Anne, Sister for Tiverton Day Surgery Unit on 01884 235503 / 235505 or Sarah Taverner, Clinical ODP Manager 07875023232&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post has been identified as involving access to vulnerable adults and/or children and in line with Trust policy successful applicants will be required to undertake an Enhanced Criminal Records Bureau Disclosure Check.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that you will be notified via email regarding the result of your application. If you are successful in obtaining an interview you will be given a minimum of 1 weeks notice, prior to your interview date. &lt;strong&gt;If you have not received any correspondence from us within 1 week of the closing date please contact the recruitment team on 01392 403758/403936/402367. It is not Trust policy to contact successful candidates in any other form than by email.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are appointed to a position within the Trust you will be required to provide original documents to verify your identity prior to your start date. This must be a valid passport or full birth certificate (specifying the names of the holder’s parents) together with proof of your national insurance number. Your contract of employment with the Trust may be invalidated in the event that you are unable to provide this documentation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We accept qualifications from abroad, where these are nationally recognised as valid for the vacancy. The relevant UK professional bodies can advise on whether overseas qualifications are valid to allow the holder to practise in their profession. NARIC can advise what level overseas qualifications are equivalent to, in the UK system. (For example, they will say whether particular overseas qualifications are equivalent to a UK degree.)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to equal opportunity for all and encourage flexible working arrangements including job sharing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to recruiting and supporting a diverse workforce and so we welcome applications from all sections of the community, regardless of age, disability, gender, race, religion or sexual orientation, maternity/pregnancy, marriage/civil partnership or transgender status.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note all authority for advertising RD&amp;E posts rests solely with HR and any such requests should be made direct to them only.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tiverton", "postalCode": "EX16 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9095", "longitude": "-3.49297"}}, "title": "Endoscopy / Ward Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244483", "validThrough": "2020-11-10T23:59:59+0000"}