{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum (pro rata if part time)"}}, "datePosted": "2020-10-22T10:39:20+0100", "description": "&lt;p&gt;&lt;span&gt;We have an exciting opportunity for a highly motivated Band 5 Nurse to join the Defence Primary Healthcare (DPHC) Team located within Medical Centre Woolwich, London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;DPHC is a vibrant and fast-moving organisation that aims to provide the very best primary healthcare to Defence personnel and in some locations, their families and dependants. In addition to General Practice, DPHC provides rehabilitation services, occupational health advice and community mental health support. The patient population is generally young and healthy and much of the work relates to occupational health, minor injuries and sports medicine.&lt;/p&gt;\n&lt;p&gt;Duties and responsibilities of the role include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing safe, evidence-based, cost-effective and individualised patient care.&lt;/li&gt;\n&lt;li&gt;Supporting the care of patients with chronic illnesses e.g. Asthma, Diabetes, Chronic Health Conditions and hypertension ensuring continued maintenance of the Chronic Disease Register.&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Working as part of a multidisciplinary primary healthcare team delivering primary healthcare nursing including elements of occupational health.&lt;span&gt;&lt;span&gt;You will be working with the Senior Practice Nurse or Senior Medical Officer within the medical facility (MF).&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Providing high-quality person-centred care which always considers people’s safety, privacy and dignity using advanced clinical knowledge that is evidence based.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Monitoring and improving standards through supervision, evidence-based practice, clinical audit, research and education.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Acting as a role model, delivering high quality practice and promoting clinical effectiveness in care.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;You will have training and clinical supervision responsibilities for Healthcare Assistants (HCAs) and Military Medics.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;Monitoring the effectiveness of own clinical practice through the quality assurance strategies such as the use of audit and peer review.&lt;/li&gt;\n&lt;li&gt;Working within the NMC Code of Practice and MOD/DPHC policies and maintaining professional registration and being professionally accountable for the standard of care provided to the patient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;For more information regarding the role of Band 5 Nurse, please refer to the Job Description and Person Specification link&lt;/strong&gt;.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The successful candidate with be entitled to an NHS High Cost Outer London Allowance, subject to MoD policy.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The successful candidate must have professional/clinical knowledge acquired through training to degree/diploma level and must be registered with Nursing and Midwifery Council.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The sift for this vacancy will be CV based. Interviews will be competency based. The following NHS Framework will be tested:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC1 - Communication&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC2 - Personal &amp; People Development&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC3 - Health, Safety &amp; Security&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC4 - Service Improvement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC5 - Quality&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHSC6 - Equality and Diversity&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Successful candidates must meet the security requirement before they can be appointed. The level of security needed is security check.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying - this document contains NHS pay scale information.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical Centre Woolwich, London", "postalCode": "SE18 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4878", "longitude": ".059746"}}, "title": "Band 5 Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237967", "validThrough": "2020-11-09T23:59:59+0000"}