{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T08:16:49+0000", "description": "&lt;p&gt;&lt;strong&gt;PLEASE NOTE: INTERNAL APPLICANTS ONLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 Medical Device Integration Lead (Clinical Engineering)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to lead the support and development of Medical Device Integration across the Royal Berkshire NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This role is a key part of the support for integration with Cerner. The first wave includes anaesthetic machines, patient monitors, surgical video systems, maternity CTG machines with other high risk medical devices following soon.&lt;/p&gt;\n&lt;p&gt;This role involves coordinating the support, including during extended hours, to provide prompt resolution of problems. This will frequently involve replacement of components that are integrated with these and other medical devices.&lt;/p&gt;\n&lt;p&gt;Provision of advice and guidance to the Cerner implementation team on optimum ways to integrate other medical devices during subsequent waves of the project. Following agreement of the programme, to coordinate the ordering and implementation of the technology in order to meet the programme objectives.&lt;/p&gt;\n&lt;p&gt;Principal responsibilities include:&lt;/p&gt;\n&lt;p&gt;1/ To be a key member of each MDI project team and provide programme level support and insight for Trust management teams&lt;/p&gt;\n&lt;p&gt;2/ Provide a responsive MDI support service, agreed and aligned with specialist teams&lt;/p&gt;\n&lt;p&gt;3/ Establish KPIs for response and rectification of MDI issues.&lt;/p&gt;\n&lt;p&gt;4/ Provide reports on MDI performance.&lt;/p&gt;\n&lt;p&gt;5/ Ensure stock of MDI components are maintained.&lt;/p&gt;\n&lt;p&gt;6/ Contribute to the process development for triaging and transferring MDI calls to and from other partners.&lt;/p&gt;\n&lt;p&gt;7/ Provide guidance and advice in planning and implementation of subsequent waves of MDI.&lt;/p&gt;\n&lt;p&gt;8/ Reciprocate with other technical support staff from anaesthetic and critical care to ensure continuity of support.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Marcus Durand (Head of Clinical Engineering) on 0118 322 6918 or marcus.durand@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Medical Device Integration Lead (Clinical Engineering) - INTERNAL ONLY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255074", "validThrough": "2020-11-14T23:59:59+0000"}