{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-05T17:16:07+0000", "description": "&lt;p&gt;Post title&lt;/p&gt;\n&lt;p&gt;Senior Occupational Therapist Band 6&lt;/p&gt;\n&lt;p&gt;Service/ward/department&lt;/p&gt;\n&lt;p&gt;Inpatients, Older People&lt;/p&gt;\n&lt;p&gt;Borough&lt;/p&gt;\n&lt;p&gt;Stockport&lt;/p&gt;\n&lt;p&gt;Band&lt;/p&gt;\n&lt;p&gt;6&lt;/p&gt;\n&lt;p&gt;Hours of work&lt;/p&gt;\n&lt;p&gt;30 hours&lt;/p&gt;\n&lt;p&gt;Status&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a passionate Occupational Therapist looking for a new and exciting challenge with older adults? An opportunity has arisen for a senior Occupational Therapist to join our inpatient team based in Stockport, working on our step down ward for older people, Saffron Ward. Our patients come to us from the acute hospital when they have experienced a delirium and need more time for skilled assessment and rehabilitation in order to achieve optimal level of functioning and avoid inappropriate placements. Patients have a variety of physical and mental health conditions. The Occupational Therapy role is crucial in ensuring patients health, wellbeing and independence are appropriately assessed and facilitated. A significant part of the role is discharge planning, working closely with our ward discharge social workers, including assessments on the ward and in the home setting. We have active involvement of physiotherapy, speech and language therapy and therapy support workers on the ward as part of a supportive team of therapists you will work alongside. This post would suit an OT who has experience of working with older adults with complex needs either in a physical or mental health setting who can provide holistic assessments and interventions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have the support of other Occupational Therapists based at the Meadows on our mental health wards and community services, as well as the broader network of AHPs on the unit. You will have regular one to one supervision and will also be able to take part in peer supervision, journal club and in delivering training to health and social care staff, students, service users and carers. The team of AHPs at the Meadows has good links with Salford University and the University of Manchester; we deliver teaching on a number of courses, offer innovative student placements and engage in audit and research. If you would like to know more about this post, please contact us for further information.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth ChaplinJob titleClinical LeadEmail addressrchaplin@nhs.netTelephone number716 4505 (option 3)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Meadows, Stockport", "postalCode": "SK2 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3989", "longitude": "-2.121"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258691", "validThrough": "2020-11-19T23:59:59+0000"}