{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-11-03T08:16:27+0000", "description": "&lt;p&gt;Applications are invited for the post of Advanced Nurse Practitioner in Colposcopy at the Royal Cornwall Hospitals Trust (RCHT), Truro.&lt;/p&gt;\n&lt;p&gt;The Colposcopy Department is a forward thinking, innovative, service with a wealth of expertise from nursing and consultant staff. The service focuses on holistic physical and mental health provisions to deliver a high standard of care to all patients.&lt;/p&gt;\n&lt;p&gt;The Colposcopy Service forms an integral part of the NHS cervical screening network across the southwest, liaising closely with Bristol NHS Trust cytology laboratory, Royal Cornwall Histopathology Department, sexual health services and primary care sample takers in Cornwall.&lt;/p&gt;\n&lt;p&gt;The post holder will be a NMC registered colposcopy nurse and able to demonstrate a wealth of experience in colposcopy and exhibit innovation, drive and leadership skills in their existing position to help further expand on the portfolio of quality service provided at RCHT.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity that invites highly competent, adaptable and dependable applicants, who can apply key skill sets to their clinical and managerial duties and also to quality management, research and training roles.&lt;/p&gt;\n&lt;p&gt;The successful applicant is expected to take a lead role in their duties and work collaboratively with the existing team and wider teams that network with the service.&lt;/p&gt;\n&lt;p&gt;This is the perfect opportunity to work within a highly motivated, collaborative team to sustain a quality focused, modern, efficient and effective patient-centred service.&lt;/p&gt;\n&lt;p&gt;This is a full-time permanent post, working 37.5 hours per week. A flexible attitude to working hours is essential. Hours are currently within a framework of 08:00 - 17:00.&lt;/p&gt;\n&lt;p&gt;Relocation expenses and assistance with a move cmay be available for the right candidate.&lt;/p&gt;\n&lt;p&gt;Based in the city of Truro, the Royal Cornwall Hospitals NHS Trust provides comprehensive healthcare to the people of Cornwall and the Isles of Scilly.&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful county which offers an outstanding quality of life. There are plenty of opportunities for outdoor activities with its sailing waters, surfing beaches and rugged coastal pathways. There is a thriving arts and theatre scene and an interesting variety of eating-places.&lt;/p&gt;\n&lt;p&gt;The A30 trunk road has been much improved over the last 5 years; there is a good rail service through the county and an excellent airport service from Newquay to many cities throughout the UK and abroad.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lee Russ, Lead Nurse Colposcopist/ANP leeruss@nhs.net 01872 252360&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Cornwall Hospital, Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Advanced Nurse Practitioner Colposcopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253140", "validThrough": "2020-11-17T23:59:59+0000"}