{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "Band 4-  £21,892 - £24,157  Pro rata"}}, "datePosted": "2020-10-23T11:46:07+0100", "description": "&lt;p&gt;We are excited to announce that there are now New Nurse Associate positions available at Mill View Hospital, as part of an expansion of our inpatient team. You must have or be working towards the required qualification (NMC-approved nursing associate programme.) for this role.&lt;/p&gt;\n&lt;p&gt;You must meet the following criteria before applying for this role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nursing Associate on the NMC register •Educated to a minimum level 5 Foundation degree level specific to nursing associate practice Within our hospital, we have 5 wards and a hospital place of safety and we are currently able to offer positions on two of these wards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Caburn ward&lt;/p&gt;\n&lt;p&gt;A 20 bed female acute ward. It has had a challenging year for the team on Caburn but full of improvement, which has been driven by a skilled, caring and passionate team- There has been a drive to improve both patient care and staff welfare as well as job satisfaction, which has been reflected in staff and patient feedback.&lt;/p&gt;\n&lt;p&gt;Supervision: Supervision has consistently high for the last 6 months on average between 90-100% completion.&lt;/p&gt;\n&lt;p&gt;Reflective Practice: There is twice weekly reflective practice facilitated by the ward psychologist with the option of a one to one reflective session&lt;/p&gt;\n&lt;p&gt;Team Meetings: There has been a consistent team meeting held by the ward leadership that is held weekly&lt;/p&gt;\n&lt;p&gt;Safewards: This has started on Caburn, with a number of interventions in the implementation phase which is really exciting. Safewards is a new model of care designed to reduce conflict (aggression, rule breaking) and containment (coerced medications, restraint and seclusion) in our acute adult mental health inpatient units.&lt;/p&gt;\n&lt;p&gt;Training: There is a huge variety of training, including some specialist training in personality disorder which is a 2 day course. As a member of the team, you would be supported and encouraged to go on a number of different training opportunities.&lt;/p&gt;\n&lt;p&gt;Here at Mill View hospital, we are proud of each of our wards teams, yet what makes us special is how as a hospital, we work together as a team to provide outstanding care to those that use our services.&lt;/p&gt;\n&lt;p&gt;Our hospital vision statement and commitment &quot;Is to listen and to look after each other whilst creating a safe space for everyone&quot; Lets be brave, curious and creative together and be proud of what we can achieve.&lt;/p&gt;\n&lt;p&gt;We value the importance of supervision and on-going training and development. Local to Brighton and Hove, we have weekly bite sized training for nurses and each of our wards are committed to regular team away days. We hold daily hospital safety huddles and we are quite unique that we always have a senior nurse (B6 or B7 out of the numbers) on duty 24 hours a day to provide additional support and leadership.&lt;/p&gt;\n&lt;p&gt;We would welcome you to make contact with us to arrange an informal visit and see for yourself some of the really great work that is taking place here in Brighton and Hove.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would welcome you to make contact with us to arrange an informal visit and see for your self some of the really great work that is taking place here in Brighton and Hove.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@Millview_SPFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you choose to apply, please state which ward you are interested in working on.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information and to arrange to meet one of our ward managers or matrons, please contact;&lt;/p&gt;\n&lt;p&gt;Alex Rhind, Matron&lt;/p&gt;\n&lt;p&gt;07471034152&lt;/p&gt;\n&lt;p&gt;Alex.Rhind@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mill View Hospital, Brighton &amp; Hove", "postalCode": "BN3 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.842", "longitude": "-.189739"}}, "title": "Inpatient Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240370", "validThrough": "2020-11-06T23:59:59+0000"}