{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17265", "minValue": "17265", "unitText": "YEAR", "value": "£17,265.85 Dependant on experience"}}, "datePosted": "2020-11-03T11:05:49+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Burton Park is a 50 bedded neurobehavioural locked rehabilitation hospital for patients with acquired brain injury and neuro-progressive conditions. The multi-disciplinary team includes psychology, nursing, occupational therapy, speech &amp; language therapy, physiotherapy, social workers and medical professionals. Burton Park is a member of the Independent Neurorehabilitation Providers Alliance (INPA).&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Burton Park provides specialist neurobehavioural rehabilitation for people with an acquired brain injury, including traumatic brain injury and stroke or a progressive neurological condition to reduce challenging behaviour and optimise functional skills. &lt;/p&gt;\n&lt;p&gt;Burton Park is a 50 bedded inpatient rehabilitation service, across three units and patients are supported to maximise their level of independence.  A variety of care pathways can be offered, including intensive or slower stream neurobehavioural rehabilitation which can optimize patients living in the least restrictive setting. &lt;/p&gt;\n&lt;p&gt;As part of the intensive neurorehabilitation provided on-site at Burton Park, there is a large emphasis placed upon community rehabilitation in order to prepare the patient to move back to their local area as independently as is possible. Burton Park is situated in the historic town of Melton Mowbray, a thriving market town. Here patients can access local amenities such as a leisure centre, cinema, shops, restaurants and cafés to support their full rehabilitation programme.  The TDT includes full time Neuropsychologists, Psychiatrists. Occupational Therapists, Physiotherapist, Speech and Language Therapists, Social Work along with Qualified Nurses and Rehabilitation Assistants. Outcome measures are routinely collected and individual’s progress tracked.&lt;/p&gt;\n&lt;p&gt;Burton Park boasts a range of facilities utilised by the TDT and patients as they work through their specialist individual rehabilitation plan.&lt;/p&gt;\n&lt;p&gt;A critical member of the Ward team, supporting and assisting Registered Nurses in the assessment, planning and implementation of patient care. Delivering care to the patient as prescribed by the individual care plans and liaising with family members as appropriate.&lt;/p&gt;\n&lt;p&gt;Main Duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; Assists qualified staff with the assessment and implementation of individual patient care plans undertaking routine tasks and activities as directed to facilitate the wellbeing, dignity and treatment of all patients.&lt;/li&gt;\n&lt;li&gt;Provides practical support and responsive care to patients who require assistance with intimate personal needs such as dressing, bathing and toileting activities ensuring that such activities comply with procedures and the relevant healthcare legislation.&lt;/li&gt;\n&lt;li&gt;Observes and monitors the wellbeing of patients ensuring that any unusual physical, mental or emotional occurrences are promptly referred to senior staff/the primary nurse and documented as appropriate.&lt;/li&gt;\n&lt;li&gt;Provide specific interventions with patients as delegated by a Registered Nurse, and following training and competency attainment. Such interventions include Observation and Engagement with Patients, escorting patients on leave, and being involved in de-escalation and management of violence and aggression.&lt;/li&gt;\n&lt;li&gt;Contribute to a team approach to patient care in conjunction with all members of the multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Participate in regular ward meetings and attend other meetings as requested.&lt;/li&gt;\n&lt;li&gt;To assist in the maintenance of stock levels, including pharmaceutical products.&lt;/li&gt;\n&lt;li&gt;To assist in the maintenance of ward cleanliness and tidiness and adhere to infection control policy and procedures at all times.&lt;/li&gt;\n&lt;li&gt;Develops and maintains a good professional relationship with patients, colleagues and visitors responding promptly and courteously to requests and enquiries.&lt;/li&gt;\n&lt;li&gt;Help promote and maintain an environment conducive to meeting the needs of the patient / relatives and carers.                                                            &lt;/li&gt;\n&lt;li&gt;Ensure service users are gaining a quality service that is value for their money.&lt;/li&gt;\n&lt;li&gt;To receive and convey information from telephone or personal enquiries in a courteous manner and ensure all persons visiting the ward are greeted and assisted in a welcoming and supportive manner.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Knowledge/ Education/ Skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to a minimum NVQ 1 or GCSE’s in Mathematics and English.&lt;/li&gt;\n&lt;li&gt;Understands the need for strict confidentiality&lt;/li&gt;\n&lt;li&gt;Basic IT literacy&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melton Mowbray, Leicestershire", "postalCode": "LE13 0RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7567", "longitude": "-.886951"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253621", "validThrough": "2021-01-10T23:59:59+0000"}