{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T11:31:54+0000", "description": "&lt;p&gt;Do you want to be Part of an innovative dynamic IAPT service ? Are you passionate about step 2 evidence based psychological therapies for people with common mental health problems (depression and anxiety disorders), delivered in a variety of modalities including over the telephone, face to face, or online, both individually and in groups ?&lt;/p&gt;\n&lt;p&gt;The IAPT Psychological Wellbeing Practitioners will play a critical role in helping shape the future direction of the North Yorkshire IAPT service by delivering high quality evidence based interventions. The role is a deliberately varied one which has a balance between undertaking assessments and holding a clinical caseload. All PWP’s are involved in delivering Guided Self Help, Psychoeducation Courses and Computerised programmes.&lt;/p&gt;\n&lt;p&gt;The North Yorkshire IAPT service is wellknown for its innovative approaches to working with perinatal women, Vulnerable Veterans, older adults and our commitment to staff wellbeing. We currently have ‘champion roles’ currently occupied by our PWP’s. The service also has a strong commitment to in house and external CPD and places high importance on clinical and caseload management supervision to support you in developing your career. We are keen to hear from suitably experienced, enthusiastic and motivated individuals who are focused on providing patient centered care of the highest quality. The successful candidate will also have the benefit of living and working in a beautiful part of the country as our service covers Hambleton, and Richmond area.&lt;/p&gt;\n&lt;p&gt;The IAPT service currently operates Monday- Friday covering some evening work.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carla Webb Team Manager, 01748 831964&lt;/p&gt;\n&lt;p&gt;carlawebb@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Innovate Business Centre, Catterick/Colburn", "postalCode": "DL9 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3764", "longitude": "-1.69221"}}, "title": "IAPT Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253753", "validThrough": "2020-11-25T23:59:59+0000"}