{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro-rata"}}, "datePosted": "2020-10-30T16:16:24+0000", "description": "&lt;p&gt;As a department we are ambitious and continually look to be at the forefront of medicines management and we are committed to the development of our staff. We are looking for an ambitious, motivated pharmacist to be a part of our bright future.&lt;br /&gt;&lt;br /&gt;We are looking for a dynamic and experienced pharmacist who will manage, develop and deliver our clinical service to the women and childrens SDU for a period of 6 months as a jobshare. The Directorate comprises of Maternity (pre and post natal) maternity theatres, paediatric day care, paediatric wards and neonatal intensive care. The Trust has recently been awarded funding for a new paediatric A&amp;E department and short-stay ward. &lt;br /&gt;&lt;br /&gt;You will join a small team of pharmacists who are well integrated into the multi-disciplinary teams within the directorate. The post holder will provide high level patient focused clinical pharmacy support for patients &amp; their carers to ensure medicines optimisation from the point of admission through to discharge for patients within the Directorate. You will provide specialist pharmaceutical advice to clinicians, nursing &amp; midwifery staff and patients/families to ensure the safe and optimal use of medicines. You will have the opportunity to participate in consultant led multidisciplinary ward rounds including neonatal parenteral nutrition, develop clinical guidelines, undertake audit work, participate in ADHD pharmacist-led clinics and advise on medicines expenditure. Your role will also include teaching &amp; training other healthcare professionals and supporting the development of pre-registration and junior pharmacists. &lt;br /&gt;&lt;br /&gt;This is an excellent opportunity for an experienced band 7 or current band 8 pharmacist wishing to further develop their skills, both clinically and managerially.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, then please call Rachel Cox, Associate Director of Pharmacy, Governance and Clinical Services 07788 906746 rachel.cox13@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital (with cross site working), Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Lead Advanced Pharmacist, Women and Children", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250893", "validThrough": "2020-11-12T23:59:59+0000"}