{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T14:16:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Gynaecology Healthcare Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Gynaecology Outpatients and EPAU Department for us to appoint someone to a position of Band 3 Senior Gynaecology Healthcare Assistant to Support the Gynaecology Outpatient Services and Early Pregnancy Assessment Unit.&lt;/p&gt;\n&lt;p&gt;The service has recently undergone change within the senior nursing team, with the recent recruitment of a new Gynaecology Nursing Manager in charge of the gynaecology outpatients department and EPAU, who is working towards strengthening the gynaecology services. You will join a highly progressive team of health professionals working hard to ensure that a very high quality of care is provided to our patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate’s duties will include supporting the Hysteroscopy, Colposcopy and General Gynaecology Outpatient Clinics and our Early Pregnancy Assessment Unit.&lt;/p&gt;\n&lt;p&gt;Where appropriate you will support the team to streamline the service through assisting to provide triage/phlebotomy and cannulation and assist in the delivery of ambulatory outpatient care and minor procedures.&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate collaboration, compassion, empathy and the ability to care for patients who have gynaecological complications.&lt;/p&gt;\n&lt;p&gt;As part of our team you will be encouraged to develop your career within our NHS Trust while helping us deliver excellent care and treatment to our patients.&lt;/p&gt;\n&lt;p&gt;If you have a keen interest in advocating for women during their care for gynaecology procedures and treatments and have developed excellent communication skills, this may be the job for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Italo Costanzo Gynaecology - Outpatients Manager&lt;/p&gt;\n&lt;p&gt;Email: italo.costanzo@qehkl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01553 613866&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Senior Gynaecology Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250504", "validThrough": "2020-11-13T23:59:59+0000"}