{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44000", "minValue": "44000", "unitText": "YEAR", "value": "Up to £44,000 FTE per annum DOE"}}, "datePosted": "2020-11-04T14:24:27+0000", "description": "&lt;p&gt;&lt;strong&gt;I help to make a difference!&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for something different?&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a Senior Primary Care Nurse with an interest in BBV to join our healthcare department at HMP Bullingdon. This will mean working inside the prison. HMP Bullingdon is a local Prison holding both remanded and sentenced prisoners. HMP Bullingdon also accommodates young adults between the ages of 18-21.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The salary range for this role is up to £44,000 per annum – dependent on experience. &lt;br /&gt;We offer a variety of benefits including:&lt;br /&gt;&lt;br /&gt;Training and development opportunities&lt;br /&gt;Company contributory pension scheme&lt;br /&gt;25 days annual leave plus 8 bank holidays&lt;br /&gt;Staff well-being&lt;br /&gt;Access to bank hours&lt;br /&gt;CPD and re-validation support&lt;br /&gt;Cycle to work scheme as well as online retail discounts and other onsite benefits&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Nurse you will work as part of an integrated healthcare team, utilising your clinical expertise, decision making and problem solving skills to provide skilled and evidence based nursing care for patients in the prison. You will work within your scope of practice, in accordance with Care UK and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;br /&gt;&lt;br /&gt;You&#39;ll be responsible for leading and developing a team providing clinical supervision to all staff.&lt;br /&gt;&lt;br /&gt;Are you new to prison healthcare?&lt;br /&gt;Do not worry... you will be supported and mentored throughout your first 6 months with Practice Plus Group by experienced teams of highly skilled nurses and practitioners as well as management.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;Next Steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by an Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn the recruiter will arrange an interview for you to attend at HMP Bullingdon if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The work is interesting and varied and is an opportunity to make a difference to peoples’ lives, enabling them to improve and maintain their health and wellbeing.&lt;br /&gt;&lt;br /&gt;This is a permanent role with the hours being 37.5 per week.We are also looking at Part time applications so if part time work is better suited please do apply. The salary will be up to £44,000 FTE per annum - dependent on experience.&lt;br /&gt;&lt;br /&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Pracatice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Senior Primary Care Nurse - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256206", "validThrough": "2020-11-18T23:59:59+0000"}