{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 pa (pro rata)"}}, "datePosted": "2020-11-03T14:46:33+0000", "description": "&lt;p&gt;The Intermediate Care Unit at Lewes Victoria Hospital are looking to recruit staff nurses to join our friendly team. Whether you are experienced, a student looking for your first job or looking to return to practice we are happy to support and develop you in your career.&lt;/p&gt;\n&lt;p&gt;We are a 26 bed medical ward delivering excellent care at the heart of the community. We are compassionate and caring, and work together to achieve patient-centred care.&lt;/p&gt;\n&lt;p&gt;We bridge the gap between home and acute hospital services. Patients who are too unwell or incapacitated to stay at home in the short term, but do not require acute intervention, get admitted to our unit to help them recover and return to baseline function. In addition patients who have had an acute episode but are not yet ready to return home will come to us for a short period of rehabilitation to ensure they are safe to return home&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse on the ward you will play an important part in your patients&#39; recovery. Working as part of the multidisciplinary team, you will have the opportunity to use and develop key skills, providing holistic assessment and patient care. You will be responsible for contributing to care, observing, monitoring and recording patients’ progress whilst communicating and managing effectively any changes in their conditions and planning their safe discharge. Liaising with external partners and patients&#39; families is a very important part of the role. We also work closely with our community hospitals at Uckfield and Crowborough.&lt;/p&gt;\n&lt;p&gt;We have free parking on site which can be used by staff.&lt;/p&gt;\n&lt;p&gt;The post holders will be required to work flexibly on both day and night shifts. Full time, part time and flexible working patterns will all be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameZena SaleJob titleWard ManagerEmail addresszena.sale1@nhs.netTelephone number01273 402522Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lewes Victoria Hospital, Lewes", "postalCode": "BN7 1LR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8742", "longitude": "-.00576"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254393", "validThrough": "2020-11-29T23:59:59+0000"}