{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa, Based on Full Time Hours"}}, "datePosted": "2020-11-05T11:15:24+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you currently a nursing associate or due to qualify in 2020? Would you like to join a team that offers outstanding clinical supervision and mentorship? If so we would love to hear from you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bluebird House currently offers 15 &lt;em&gt;medium secure&lt;/em&gt; beds across two wards (Stewart and Moss Ward) for young people aged 12-18 years of age with highly complex mental health needs and challenging behaviour.&lt;/p&gt;\n&lt;p&gt;The clinical team consists of psychiatrists, nurses, psychologists, occupational therapists, teachers and a family therapist. There is a wide range of experience in this exciting and enthusiastic team, where high standards of care and a positive learning environment are highly valued.&lt;/p&gt;\n&lt;p&gt;You will be working with the qualified nurses and other members of the MDT to deliver individual treatment packages with an emphasis on collaborative care that focuses on recovery and the need to work towards discharge. Please refer to the job description for a full breakdown of duties&lt;/p&gt;\n&lt;p&gt;Bluebird House operates 24 hour cover therefore, you are required to work shifts which will include nights. There are a variety of shifts available and we aim to be as flexible as possible to ensure your working pattern helps with childcare and gives you plenty of free time to spend with your family and friends!&lt;/p&gt;\n&lt;p&gt;We also offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ongoing professional development, including opportunities for training and career progression across the trust&lt;/li&gt;\n&lt;li&gt;Our specially designed preceptorship to help support you&lt;/li&gt;\n&lt;li&gt;Free parking on site&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to discuss the opportunity further please contact Laura on laura.adams2@southernhealth.nhs.uk or call 02380 475160&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The advertised salary is indicative of average earnings including Forensic Lead (£3,000 per annum) and weekend enhancements based on working an average of 1 in 3.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to Talk Flexible Working- all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@Southern_NHSFT&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2RZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.5288"}}, "title": "Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257394", "validThrough": "2020-12-03T23:59:59+0000"}