{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18238", "minValue": "15717", "unitText": "YEAR", "value": "£9.35 - £10.85 per hour (plus enhancements)"}}, "datePosted": "2020-11-02T09:06:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge? Would you like to work in a Specialist Centre where you have time to provide high quality care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for enthusiasticand passionateChildren’s Support Assistants to join our Bank Care Service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joining our Bank Team is a great way to gain clinical skills while working in a flexible way to suit your lifestyle.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our ambition is for all children with brain injury and neurodisability to have the opportunity to live the best life possible. Operating within our existing shift patterns, which includes rotational day, evening and night shifts, you will provide an outstanding service to the children and families we support.&lt;/p&gt;\n&lt;p&gt;You will be based in any one of our unique services: Intensive Rehabilitation, Step down from Hospital to Home, Continuing Care, Long-Term Ventilation and Short Breaks or in one of our Residential Houses attached to The Children’s Trust School.&lt;/p&gt;\n&lt;p&gt;Operating within our existing shift patterns, which includes rotational day, evening and night shifts, you will work within a Multidisciplinary Team providing a high quality of care to children/young people and their families, ensuring their care, education &amp; therapy needs are met.&lt;/p&gt;\n&lt;p&gt;Adapting to each service, and maintaining your professional skillset and availability for The Children’s Trust will be key to this role.&lt;/p&gt;\n&lt;p&gt;As part of our on-boarding process you will work 3 shadow shifts working alongside a buddy in different areas, such as rehabilitation, school and short break houses. You would be expected to complete these shifts within 6 weeks of your Induction.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is desirable that you hold the Regulated Qualifications Framework Level 3 (Residential Childcare) to work within a Bank capacity within The Children’s Trust.&lt;/strong&gt;The QCF (Qualifications and Credit Framework)Level 3Diploma inHealth and Social Care will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact the People Operations Team who will be more than happy to help you on 01737 365 880 or email recruitment@thechildrenstrust.org.uk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please review our attached job description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that our early shift commences at 7amand you will need to be available to fulfil this shift in order to be successfully shortlisted.Please also note public transport is limited for certain shifts and this will needto be considered when applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: Sunday, 15 November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date(s)&lt;/strong&gt;: Every Tuesday and Thursday.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Strictly no agencies please.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is the UK’s leading charity for children with acquired brain injury, providing expert rehabilitation, education, therapy and care at our national specialist centre in Tadworth, and to children and their families across the UK, via our Brain Injury Community Service.&lt;/p&gt;\n&lt;p&gt;Boasting a beautiful 24-acre site in Surrey, we are located just outside of London, close to the M25 (accessible via Junction 8, A217 to Tadworth) and easily accessible via National Rail, by way of: Clapham Junction, Sutton and Epsom.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is fully committed to protecting children and young people. All posts at The Children&#39;s Trust are subject to an enhanced DBS check. If you are applying to The Children&#39;s Trust, and are already registered with the DBS update service, this will speed up the recruitment process significantly. We are an equal opportunities employer, and welcome applications from all suitably qualified candidates, regardless of their race, sex, disabilities, religion/beliefs, sexual orientation, or age.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "The Children's Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tadworth", "postalCode": "KT20 5RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.295", "longitude": "-.226042"}}, "title": "Bank Children&#39;s Support Assistant - Temporary/Bank Opportunities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251376", "validThrough": "2020-11-15T23:59:59+0000"}