{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-11-06T12:16:14+0000", "description": "&lt;p&gt;Hull University Teaching Hospitals NHS Trust is a great place to work.&lt;/p&gt;\n&lt;p&gt;Are you an experienced Senior Midwife or Matron motivated and ready for an exciting development opportunity? If so, there has never been a better time to join the Senior Midwifery team at Hull University Teaching Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;We provide care to over 5,000 families; we are a large maternity unit delivering exceptional care in partnership with women, families and external stakeholders. We are proud to have developed sustainable models for continuity of carer and this work is progressing to ensure we can meet the national maternity transformation ambitions, improving outcomes for mums and babies.&lt;/p&gt;\n&lt;p&gt;This post requires an enthusiastic and motivated midwife with excellent leadership and communication skills who can demonstrate commitment to embedding a culture of quality improvement and shared learning across the service and the Humber Coast and Vale Local Maternity System. Excellent management and leadership qualities are central in maintaining a forward thinking maternity service that places women and their family’s needs at the heart of what we do, as well as creating a dynamic and innovative environment for staff. You will have the necessary skills and confidence to practice autonomously and be committed to ensuring that women, babies and their families receive the care and support required to promote optimum outcomes and positive experiences.&lt;/p&gt;\n&lt;p&gt;The Women and Childrens Hospital sits within the Humber, Coast and Vale Local Maternity System (LMS) and is committed to ensuring the implementation of Better Births by 2021. This senior midwifery post will provide an opportunity for the successful applicant to explore innovative ways of working locally and within the LMS.&lt;/p&gt;\n&lt;p&gt;The post will be demanding so we are looking for candidates who are ready for the challenge and share our values of care, honesty, and accountability.&lt;/p&gt;\n&lt;p&gt;If shortlisted, you will be invited to an interview at Hull Royal Infirmary where you will find out more about the role and working at HUTH.&lt;/p&gt;\n&lt;p&gt;Interested?&lt;/p&gt;\n&lt;p&gt;Please contact Lorraine Cooper Lorraine.cooper@hey.nhs.uk for additional details. Or contact Angela Rymer Labour Ward Matron angela.rymer@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;Good luck with your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lorraine Cooper, Lead Midwife lorraine.cooper@hey.nhs.uk 01482 607472&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Lead Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259618", "validThrough": "2020-11-20T23:59:59+0000"}