{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 PA"}}, "datePosted": "2020-11-05T15:31:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Imaging and Medical Physics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Guy’s &amp; St Thomas’ NHS Foundation Trust or Trust Wide&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Diagnostic Radiologist with Subspecialty Interest in Cardiothoracic Imaging&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;From £82,096 p.a excl. LZ pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time 10PAs (8 DCC / 2 SPA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Guy’s and St. Thomas’ NHS Foundation Trust is made up of two of London’s best known teaching hospitals and employs over 13,650 staff and have over 2 million patient contacts a year. Our annual turnover is now £1.3 billion.&lt;/p&gt;\n&lt;p&gt;Radiology Services is seeking to appoint a new-full time (10 PA) Consultant radiologist (8 DCC / 2 SPA split) with an interest in cardiothoracic imaging to join its established diagnostic radiology team. This post is required to meet increasing demand for diagnostic radiology services and to help further advance the cardiac and thoracic imaging services. It is expected that the post holder will be involved in the full range cardiothoracic imaging. This involves but is not limited to specialist reporting for lung cancer, interstitial lung disease, COPD / lung volume reduction, pulmonary hypertension and cardiac CT for coronary artery disease and structural interventional planning. There is also the opportunity for cardiac MRI reporting should the applicant be trained in this.&lt;/p&gt;\n&lt;p&gt;The post will be based at Guy’s and St. Thomas’ Hospitals. The hospitals are a regional centre for thoracic surgery including lung cancer surgery, severe respiratory failure and ECMO as well as interstitial lung disease. The cardiac CT service is one of the largest in the country with an active research arm, accredited level II training course and offers advanced structural imaging with cardiac CT for device / percutaneous valve planning as well as grown up and paediatric congenital heart disease CT imaging. Subspecialist meetings are run by the cardiothoracic radiologists for lung cancer, interstitial lung disease, pulmonary hypertension, COPD/ lung volume reduction, lung nodule follow up as well as a general chest meeting. This is an excellent opportunity to join a first class team within a larger group of diagnostic radiologists with other areas of wide ranging expertise. In addition to supporting the established diagnostic radiology services, the post holder will be expected to take an active interest in research and development and to participate in the teaching programs of the department.&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the GMC/GDC and hold License to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent at interview stage.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years) and therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;As an organisation, we are committed to developing our services in ways that best suit the needs of our patients. This includes asking certain groups of staff to work more flexibly so that we can offer services to patients in the evenings and at weekends. We regard this flexibility as essential if we are to continue to provide first class patient care in the future. As a result, any offer of employment to a consultant post will be subject to you agreeing to work a new more flexible pattern of working in the future if required and in accordance with the provisions of the new Guy’s and St. Thomas’ NHS Foundation Trust consultant contract.&lt;/p&gt;\n&lt;p&gt;For further information and to apply online, please go to our website quoting reference number CON661&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca PrestonJob titleConsultant Radiologist, Cardiothoracic LeadAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For more details please contact Dr Rebecca Preston, Thoracic Imaging Lead, &lt;/span&gt;Rebecca.Preston@gstt.nhs.uk&lt;span&gt; and Dr Audrey Jacques, Clinical Lead, &lt;/span&gt;Audrey.Jacques@gstt.nhs.uk&lt;span&gt;.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Consultant Diagnostic Radiologist with Subspecialty Interest in Cardi", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258360", "validThrough": "2020-11-15T23:59:59+0000"}