{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc pro rata"}}, "datePosted": "2020-10-27T10:01:57+0000", "description": "&lt;p&gt;This is an exciting opportunity for experienced or newly qualified counsellors to join the Brent Talking Therapies Service, which is an IAPT service delivering psychological interventions for anxiety and depression within the borough of Brent. We are looking for enthusiastic practitioners, with strong clinical backgrounds in brief counselling treatments and IAPT primary care experience to join the team.&lt;/p&gt;\n&lt;p&gt;The post holder must hold a counselling qualification (minimum being d Diploma in Counselling) from a recognised and accredited counselling training provider and &lt;span&gt;&lt;strong&gt;be registered with the UKCP, BPC, HCPC or an equivalent professional bodies or accredited with BACP&lt;/strong&gt;&lt;/span&gt;.&lt;span&gt;&lt;strong&gt;Applicants must state clearly their professional body and current accreditation status in their application form with registration number in order to be shortlisted. &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holders will be expected to carry a clinical caseload and provide brief focused counselling treatments for common mental health problems at step 3 level of the service. The postholder will receive clinical and managerial supervision via the Senior Counsellor and Lead Counsellor.&lt;/p&gt;\n&lt;p&gt;The post holders will be expected to offer appointments to clients during early mornings and late evenings as part of extended hours clinics offered by the service between 8.00 am to 8.00 pm and do one evening clinic a week. We welcome applicants who want to work part-time the proviso that Wednesdays be one of the days offered as well as either a Tuesday or a Thursday.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who have enthusiasm for and experience of working in a primary care setting and within an IAPT service, who are adaptable, enjoy variety, and are able to work independently as well as within a team context. Candidates should be competent in providing brief focused counselling using an evidence based approach eg focal psychodynamic, client centred, solution focused, humanistic. Applicants who can deliver therapy in other languages are encouraged to apply.&lt;/p&gt;\n&lt;p&gt;Brent Talking Therapies (IAPT) Service was established in 2010 with a central hub housing all the IAPT staff team. It is a large and well established service, and is undergoing further expansion to meet the needs of the local population. The Brent Talking Therapies (IAPT) Service provides individual and group based treatments for the population of Brent in many different languages. The service is responsible for the provision of Low intensity and High Intensity therapies within the standards of stepped care model. The counselling service is part of step 3 provision and includes generic brief focused counselling from different approaches, including DIT, Counselling for depression and couples counselling.&lt;/p&gt;\n&lt;p&gt;The service meets a high level of need given current resources and has good links with local community and voluntary sector organisations. The service, also has good recovery rates. There are clear and well defined systems for triaging and screening of incoming referrals, allocation of clients to step 2 and step 3, management of waiting lists and stepping up and stepping down clients as appropriate.&lt;/p&gt;\n&lt;p&gt;The central hub is currently a comfortable building with the required IT resources which is located in Kingsbury. The staff team provide services from the satellite hub in the Willesden area and within GP surgeries as well as in other sites including health centres and community organisations.&lt;/p&gt;\n&lt;p&gt;The post holder will receive regular clinical supervision and support from the Senior Counsellor as well as work collaboratively with senior staff within the overall team. The Brent Talking Therapies (IAPT) team has close links with other teams within the Brent Mental Health Service. There are also wider links with other IAPT services within CNWL Foundation Trust and the Trust-wide clinical psychology services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Details:&lt;/strong&gt; please note that due to the current pandemic, all interviews will be held via Zoom. If successful in being shortlisted for the interview, candidates will need to ensure that they have set up a zoom account and are familiar with its use. Details will be sent out with the interview appointment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarolyn EmanuelJob titleLead CounsellorEmail addresscarolyn.emanuel@nhs.netTelephone number02082063924Additional contact information&lt;/p&gt;\n&lt;p&gt;Carolyn Emanuel, Lead Counsellor, CNWL Talking Therapies Brent, Fairfields House, Kingsbury NW9 0PS on 02082063924&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CNWL Talking Therapies Service Brent, Kingsbury", "postalCode": "NW9 0PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5865", "longitude": "-.263085"}}, "title": "Counsellor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243919", "validThrough": "2020-11-11T23:59:59+0000"}