{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Equivalent Band 6 depending on experience"}}, "datePosted": "2020-11-06T10:22:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Section Lead | Pathology| Equivalent Band 6 depending on experience | Manchester | Fantastic team, opportunity to progress and flexible hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Manchester is looking for a Biomedical Scientist (BMS) to Lead Microbiology and Virology section. This is your opportunity to join one of the UK’s best leading hospitals and take your career to the next level. The laboratory provides the pathology service to Spire Manchester Hospital and also serves as a Hub Laboratory for the Spire Healthcare Hospitals from the Midlands to the North of the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Manchester Hospital is a brand new, £65m state-of-the-art healthcare facility offering patients a wide range of integrated surgical, medical and diagnostic services. The rapidly expanding team in Manchester consists of over 500 colleagues, who thrive in the welcoming atmosphere that is friendly, supportive and progressive.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful Biomedical Scientist will be expected to work within the microbiology and virology section of a multidiscipline laboratory. You will plan, analyse, assess and report pathology investigations, ensuring the pathology service are provided in an accurate, efficient and cost effective manner. The pathology department offers extensive in-house training and continual professional development opportunities. We are passionate about developing our staff in order for them to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC Registered with laboratory experience in Microbiology and virology&lt;/li&gt;\n&lt;li&gt;Previous experience of leadership or deputising a team is desirable.&lt;/li&gt;\n&lt;li&gt;Communication/organised/role model/showcase excellent patient care etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little 07860 407360 grace.little@spirehealthcare.com&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M20 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4149", "longitude": "-2.23507"}}, "title": "Biomedical Scientist -Microbiology and Virology Section Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259200", "validThrough": "2020-12-06T23:59:59+0000"}