{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Volunteer"}}, "datePosted": "2020-10-16T12:34:54+0100", "description": "&lt;p&gt;At Mid Cheshire Hospitals Foundation Trust volunteers contribute a great deal to the patient experience and to assisting staff. During these uncertain times volunteers have never been more critical to supporting the services we provide.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a number of Temperature Screening Volunteers at Leighton Hospital, Crewe, Victoria Infirmary, Northwich and Eaglebridge, Crewe for temp screeners to assist and support temperature check screening to meet the needs of patients attending appointments at these locations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In light of the current COVID-19 pandemic before you apply you must ensure you are over 18 years of age and not in one of the high risk or very high risk groups as listed by the UK government. If you are we cannot take you at this time, and by ignoring this advice you may place yourself and your family at risk.&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Volunteer to meet and greet visitor/patients ensuringvisitors follow infection control guidance for publicby asking screening questions.&lt;/li&gt;\n&lt;li&gt;Ensuring allpatients/visitors have used hand sanitiser provided and to wear a face covering.&lt;/li&gt;\n&lt;li&gt;Volunteer to check the patient’s temperature(Volunteer does not need to record the temperature),and follow clear guidance for next steps dependant on temperature.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Volunteers will be provided with all necessary PPE (including mask, visor, gloves and apron) and will have clear instructions and guidance from the volunteer crib sheet.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Leighton Hospital, Crewe (Outpatients/Eye Care Centre) - &lt;/strong&gt;Monday to Wednesday Shifts available, either 9am-1pm or 1pm-5pm&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Victoria Infirmary Northwich - &lt;/strong&gt;Monday to Friday Shifts available, 9am-5pm (am and pm shift times available)&lt;/p&gt;\n&lt;p&gt;The minimum age for volunteering at the Trust in this role is 18 years old. All new Volunteers are required to complete mandatory online E-learning as part of their induction, which includes infection control, data awareness and fire safety. In addition, new volunteers will receive one to one training / shadowing in their role, these sessions equip you for volunteering in a hospital environment.&lt;/p&gt;\n&lt;p&gt;We request volunteers give a minimum of 3 hours of their time once a week, for a minimum of 6 months. Volunteers, who successfully complete their training and at least 6 months volunteering, will automatically qualify for an interview upon receipt of a fully completed application, for MCHFT Bank vacancies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full training will be provided, however good people and communication skills are essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that confidentiality of all information, at all times, must be observed, no matter how trivial it may appear. The privacy and dignity of patients must always be protected.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "VOLUNTEER", "hiringOrganization": {"@type": "Organization", "name": "Mid Cheshire Hospitals NHS Foundation Trust ; Volunteers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Patient Temperature Screening Volunteer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230220", "validThrough": "2020-11-06T23:59:59+0000"}