{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36069", "unitText": "YEAR", "value": "£36,069.75 - £42,712 (Eqv. B6)"}}, "datePosted": "2020-10-28T08:07:55+0000", "description": "&lt;h2&gt;&lt;strong&gt;Specialist Speech and Language Therapist (&lt;/strong&gt;&lt;strong&gt;Equivalent to Band 6) - &lt;/strong&gt;&lt;strong&gt;The Children’s Trust School&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Full Time: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £36,069.75- £42,712per annum (dependent on experience and inclusive of Outer London Weighting)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and passionate Children&#39;s Speech and Language Therapist to join our Specialist Centre rated as Outstanding in care by CQC. The post holder will support the delivery of a multi-tiered approach within our school and residential homes for children with neurodisability and complex health needs. The team is well resourced with opportunities for intensive therapy. The service offers generous CPD support and a range of opportunities to be involved in audit, research and service evaluation.&lt;/p&gt;\n&lt;p&gt;Knowing what it takes to deliver speech and language therapy, you will possess a sound knowledge of speech and language therapy assessment, and an excellent understanding of supporting children and young people with communication needs, speech and language difficulties and eating and drinking management. With experience of working in a complex environment, across a large and diverse workforce, you will be exceptionally organised with a high-level of attention to detail. You will naturally possess excellent inter-personal skills, and an ability to consult and positively engage with key stakeholders across the organisation.&lt;/p&gt;\n&lt;p&gt;Our ambition is for all children with brain injury and neurodisability to have the opportunity to live the best life possible. This is a chance to develop your skills where you will provide an outstanding service to the children and families we support.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to develop a career where you make a significant and lasting difference to the lives of thousands of children and families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the role please contact the People Operations Team, email: recruitment@thechildrenstrust.org.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: &lt;strong&gt;Sunday, 15 November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date(s)&lt;/strong&gt;: &lt;strong&gt;To be confirmed usually ten days from closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Strictly no agencies please.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is the UK’s leading charity for children with acquired brain injury, providing expert rehabilitation, education, therapy and care at our national specialist centre in Tadworth, and to children and their families across the UK, via our Brain Injury Community Service.&lt;/p&gt;\n&lt;p&gt;Boasting a beautiful 24-acre site in Surrey, we are located just outside of London, close to the M25 (accessible via Junction 8, A217 to Tadworth) and easily accessible via National Rail, by way of: Clapham Junction, Sutton and Epsom.&lt;/p&gt;\n&lt;p&gt;The work we do is highly rewarding, and in addition to an attractive salary, we offer a valuable range of benefits, including: free on-site parking; subsidised cafeteria; on-site staff accommodation (subject to availability); the ability to retain your NHS pension (where applicable) or the opportunity to join an alternative scheme; and the opportunity to develop and implement your expertise in an environment that is as unusual in its beautiful historic nature, as it is unique in its state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is fully committed to protecting children and young people. All posts at The Children&#39;s Trust are subject to an enhanced DBS check. If you are applying to The Children&#39;s Trust, and are already registered with the DBS update service, this will speed up the recruitment process significantly. We are an equal opportunities employer, and welcome applications from all suitably qualified candidates, regardless of their race, sex, disabilities, religion/beliefs, sexual orientation, or age.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Children's Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tadworth, Surrey", "postalCode": "KT20 5RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.295", "longitude": "-.226042"}}, "title": "Specialist Speech &amp; Language Therapist: (Equiv. to B6) TCT School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245699", "validThrough": "2020-11-15T23:59:59+0000"}