{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T15:01:09+0000", "description": "&lt;p&gt;This is an exciting opportunity for professional development and to implement service change within a supportive environment. We are looking for an innovative, enthusiastic Pharmacy Technician to join our existing Community Resource Team, delivering community services to adults in the Bridgend Locality.&lt;/p&gt;\n&lt;p&gt;The Community Resource Team is an integrated health and social care service which provides a range of short-term interventions to people in their own homes to promote their independence. Working as part of a team the successful candidate will need to work flexibly and pro-actively to deliver effective time limited medicine management interventions to support people to remain independent in their own homes.&lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a defined case load providing evidence based interventions to promote independence and quality of life&lt;/p&gt;\n&lt;p&gt;Excellent communication and organisational skills are essential within this post. The successful candidate will need to plan and manage their time effectively, ensuring prioritisation and completion of both clinical and non-clinical tasks, to ensure effective workload management and the ability to respond flexibly to the needs of the service. Cwm Taff Morgannwg is committed to providing professional supervision and supporting continuing Professional development.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jill Craig or Caroline Roberts&lt;/p&gt;\n&lt;p&gt;Pharmacy Technician(Jill Craig) or Caroline Roberts Assistant Team Manager - Short Term assessment &amp; Reablement- CRT&lt;/p&gt;\n&lt;p&gt;caroline.roberts2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01656 815888&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trem Y Mor, Bettws", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258216", "validThrough": "2020-11-19T23:59:59+0000"}