{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50068", "minValue": "31841", "unitText": "YEAR", "value": "£31,841 - £50,068 per annum"}}, "datePosted": "2020-10-27T12:16:53+0000", "description": "&lt;p&gt;University Hospitals Coventry and Warwickshire is located in the West Midlands and is home to one of the largest teaching hospitals in England. Our mission to Care, Achieve and Innovate is demonstrated in our reputation for innovation, teaching and research and high quality patient care. University Hospital in Coventry is one of the most modern healthcare facilities in Western Europe with £200 million of new medical and research equipment and a hospital that is at the forefront of digital imaging and technology.&lt;/p&gt;\n&lt;p&gt;We provide general acute hospital services to approximately 500,000 people from Coventry and Rugby and specialist hospital services to over one million people from Coventry, Warwickshire and beyond. The Trust has a revenue budget of approximately £569 million, we employ 5,639 staff, manage 1,380 beds and 32 operating theatres.&lt;/p&gt;\n&lt;p&gt;The Trust is made up of the following hospitals:&lt;/p&gt;\n&lt;p&gt;University Hospital Coventry&lt;/p&gt;\n&lt;p&gt;Hospital of St Cross – Rugby&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint 10 experienced and enthusiastic Senior House Officers/Junior Clinical Fellows within the Medicine Group for a 12 month fixed term contract.&lt;/p&gt;\n&lt;p&gt;The post holders will need to be flexible and adaptable in their approach to work as well as having excellent communication skills and attention to detail and must be available for work with immediate effect or at short notice. It includes responsibility for the provision of a specialised, comprehensive and confidential patient-centred service in accordance with Departmental, Trust and National standards, policies and procedures&lt;/p&gt;\n&lt;p&gt;****&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date:&lt;/strong&gt; Please be advised that this job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/p&gt;\n&lt;p&gt;****&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note that UHCW NHS Trust does not sponsor applications for GMC registration and therefore successful candidates must already be registered with a licence to practice.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Applicants are strongly encouraged to contact Dr N Murthy, Consultant Physician on extension 02476 965970 email: narasimha.murthy@uhcw.nhs.uk for an informal discussion or Dr A Ali, Head of Clinical Services (Group A) email: asad.ali@uhcw.nhs.uk 02476 967698&lt;/p&gt;\n&lt;p&gt;To arrange visits please contact Kerry Nelson via kerry.nelson@uhcw.nhs.uk or telephone 02476 966238&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW NHS Trust, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "General Internal Medicine/Specialist Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244443", "validThrough": "2020-11-08T23:59:59+0000"}