{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22000", "minValue": "19000", "unitText": "YEAR", "value": "£19 - 22,000 WTE"}}, "datePosted": "2020-10-26T23:16:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Looking for a Clinical Administrator / Notes Summariser interested in joining a friendly, local GP surgery.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Opportunities available at 3 sites in South East London&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knights Hill Surgery, West Norwood, London SE27 0DF&lt;/li&gt;\n&lt;li&gt;Penrose Surgery, Walworth, London SE17 3DW&lt;/li&gt;\n&lt;li&gt;Kingfisher Medical Centre, Deptford, London SE8 5DA&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;: Full Time or Part-Time, weekdays&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;: £19 – 22,000 FT depending on experience. Overtime paid if required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working with our in-house clinical and non-clinical team including close contact with our experienced GPs to support the delivery of the highest quality primary care service to our patients. More specifically, our Clinical Administrators are responsible for helping to manage the administrative aspects of our patients care.&lt;/p&gt;\n&lt;p&gt;The day to day responsibilities include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Understanding and sorting incoming patient letters (either via post or email) to ensure that they are filed correctly and any that require action are flagged&lt;/li&gt;\n&lt;li&gt;Checking incoming lab reports and test results – segregating into normal (for filing) and abnormal (for a GP to check)&lt;/li&gt;\n&lt;li&gt;Data entry of relevant information from incoming letters, tests and reports (e.g. looking for diagnoses, investigations, results, history, medication etc.)&lt;/li&gt;\n&lt;li&gt;Processing and following up on patient referrals as instructed by the clinical team including 2 week wait urgent cancer referrals&lt;/li&gt;\n&lt;li&gt;Processing and completing medical report requests from patients or third parties&lt;/li&gt;\n&lt;li&gt;Summarising newly registered patient records and ensuring the maintenance of existing medical records&lt;/li&gt;\n&lt;li&gt;Managing, actioning and responding to your workflow and tasks in EMIS (including much of the above)&lt;/li&gt;\n&lt;li&gt;Communicating with patients, our team and external teams to ensure these tasks are completed in a timely and appropriate manner&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The right candidate will demonstrate a strong eye for detail maintained for prolonged long periods of time and excellent organisational skills. You will also need strong analytical skills to understand all of the incoming information and good communication skills to work with all the people involved.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Minimum requirements: In depth knowledge of medical terminology, human anatomy, biochemistry, general medicine and strong keyboard/computer skills. Previous experience working with EMIS preferred but not required. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a small group of close-knit surgeries in South East London on a mission to give our patients the best healthcare in London. We use a multidisciplinary approach – bringing together GPs, Nurses, HCAs, Pharmacists, Paramedics and Mental Health Nurses to deliver an efficient and effective service with strong outcomes for patients.&lt;/p&gt;\n&lt;p&gt;With high levels of patient satisfaction and low waiting times, we’ve been able to grow to almost 50,000 patients and we continue to grow at a rapid pace.&lt;/p&gt;\n&lt;p&gt;We serve our patients across 7 CQC ‘Good’ rated sites in Lambeth, Southwark and Lewisham, with each site having its own dedicated multidisciplinary team. You’ll join one of these site-based teams but you’ll be part of the larger Penrose Health family as well!&lt;/p&gt;\n&lt;p&gt;As part of Team Penrose, you will be covered by our Vitality Private Health Insurance, you’ll have the choice of a NOW or NHS pension and you’ll benefit from a comprehensive sick pay scheme after your first year with us.&lt;/p&gt;\n&lt;p&gt;On top of the employment benefits, this year we have seen a month dedicated to appreciating our team members, offered art on line classes, enjoyed ice cream from a visiting ice cream van, enjoyed surprise gifts, thank you self-care bags, fresh fruit deliveries, hosted a group-wide bake-off and this month we&#39;ll be having some Halloween fun! These are just some (but not all) of the things we do to make this a great place to work! Underneath all of this, you will also find a core strength and camaraderie that exists in each of our surgery teams and across the group – we really are a family.&lt;/p&gt;\n&lt;p&gt;All our team are enthusiastic, friendly and we want to make a real difference to our patients – come and be a part of the team!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Penrose Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130018"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE8 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4819", "longitude": "-.030477"}}, "title": "Clinical Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243653", "validThrough": "2020-11-09T23:59:59+0000"}