{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa (pro rata)"}}, "datePosted": "2020-10-20T16:16:53+0100", "description": "&lt;p&gt;An exciting opportunity has arisen to join a dynamic, innovative and friendly team within Wirral Community Health and Care NHS Foundation Trust’s GP Out of Hours Service; which operates during evenings, overnight, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;Are you an experienced nurse with a passion for high quality nursing care? Perhaps you have a background in Acute Medicine, Emergency Care or Community Nursing. Could you deliver high quality acute nursing interventions in an unplanned care environment?&lt;/p&gt;\n&lt;p&gt;We are looking for candidates with strong clinical skills and experience and who are patient and team focused. The successful candidate will show they are willing to support innovation, and are committed to service improvement in an extremely interesting, and challenging environment, which treats both adult and paediatric patients.&lt;/p&gt;\n&lt;p&gt;You will be working as part of a highly supportive and motivated team with strong clinical guidance and leadership, aiding your own professional development.&lt;/p&gt;\n&lt;p&gt;We welcome applicants from a range of backgrounds including emergency nurses, primary care and acute medicine as well as nurses from community backgrounds who have experience as an autonomous practitioner.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join our team and be supported to enhance your scope of autonomous practice further. Please read the job description and person specification to ensure that your application reflects the appropriate level of experience and qualifications required for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Zahida Adam, Governance Lead on 0151 201 4190 Ext 6683&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All Day Health Centre - Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Senior Nurse Clinician (GP OOH Service)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235217", "validThrough": "2020-11-15T23:59:59+0000"}