{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "57903", "minValue": "57903", "unitText": "YEAR", "value": "£57,903 per annum"}}, "datePosted": "2020-10-23T11:00:23+0100", "description": "&lt;p&gt;&lt;span&gt;QE Facilities (QEF) is a wholly owned subsidiary company of Gateshead Health NHS Foundation Trust (GHNT), based in the North East of England.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We provide a range of non- clinical services to GHNT and other NHS organisations. Our services include: estates, facilities services, procurement, medical engineering and devices, endoscopy decontamination and sterile services, transport, out-patient pharmacy, and prevention &amp; management of violence &amp; aggression training (PMVA). In addition we provide consultancy services, advising clients on all aspects of establishing a subsidiary company within an NHS body to the provision of VAT compliance advice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Base location: &lt;/strong&gt;North East England &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Reporting to the Head of Estates, you will be responsible for property management, building and engineering services, maintenance, grounds &amp; gardens and for the strategic development of the estates service for QEF &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be the Company’s adviser on all building, engineering issues providing specialist advice to customers. Leading the formulation of long-term strategic plans for the all sites and premises, whilst managing the operational delivery of the breakdown/maintenance service and out of hour’s service provision in an efficient and cost effective manner. In addition you will have a significant input on building and engineering design in connection with new build capital projects and refurbishments of existing premises in accordance with agreed timescales and budgets.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will be accountable for the maintenance of comprehensive records and co-ordinate/manage collection of data for compliance returns including: Estates Returns Information Collection (ERIC) return and Carbon reduction commitment (CRC), along with the management and delivery of agreed service level agreement and KPIs &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will form a crucial part of the estates leadership team, driving innovation and change to deliver efficiency and value to our customers. The ideal candidate will be an experienced operational, technical minded leader, with an extensive track record in the delivery of a high quality, customer focused estates service whilst driving efficiency, improvement and innovation. You will demonstrate well developed communication skills, the ability to play a key part in leadership of the department, giving confidence to our key stakeholders and customers whilst ensuring every member of your team understand the part they play in the delivery of the best possible service. Experience of healthcare estates management is essential to appreciate the resilience planning and complexity of services required of estates to ensure hospitals can continue to safely operate day to day. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an exciting role to join a rapidly expanding, can do, customer focused organisation. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal enquiries are welcomed by Tony Pratt, Head of Estates, 0191 445 2457 or email &lt;/span&gt;&lt;span&gt;anthony.pratt1@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;To apply go to NHS Jobs &amp; search job reference 297-QEF220-20 &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Note: All new appointments are subject to 6 months’ probation period.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event of exceptionally high levels of response, we reserve the right to close the post before the date stated in order to prevent the number of applications received being unmanageable. You are advised to submit your completed application as soon as possible to have the best chance of being considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are short listed for interview you will be contacted by the Employment Services Team via your NHS Jobs account, please ensure you check your NHS Jobs account and your e-mail account on a regular basis.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121054.PNG", "name": "Gateshead Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121054"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Senior Estates Manager - Grade E", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240175", "validThrough": "2020-11-06T23:59:59+0000"}