{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-27T12:46:30+0000", "description": "&lt;p&gt;Are you looking for an opportunity to advance your career in Paediatric Occupational Therapy? Come and work for us in the beautiful surroundings of East Sussex.&lt;/p&gt;\n&lt;p&gt;We are a highly successful integrated therapy service with a pooled budget across health and social care since 2013. Our service has a great opportunity for a full time Band 7 OT with a minimum of 4 years paediatric experience to join the team on a full time permanent contract.&lt;/p&gt;\n&lt;p&gt;Flexible working will be considered for the right candidate, including working a 9 day fortnight. Experience in complex neurodisability, equipment knowledge is required and assessments to inform EHCP outcomes will be advantageous.&lt;/p&gt;\n&lt;p&gt;We are an integrated team of occupational therapists, physiotherapists, speech and language therapists and integrated therapy assistants.&lt;/p&gt;\n&lt;p&gt;Although based in East Sussex, we are employed by KCHFT which is one of only nine community trusts in the UK identified by the Health Service Journal as ‘Best Places to Work in 2015’.&lt;/p&gt;\n&lt;p&gt;KCHFT are an outstanding trust, having become the third community trust in the country in July to be judged as &lt;strong&gt;‘outstanding’ &lt;/strong&gt; in England and we are the only community provider trust in the south east to have this rating. &lt;/p&gt;\n&lt;p&gt;The role will involve working with children, young people and their families (from age 0-19 years) within clinic, home and school environments including special schools. There is opportunity to utilise your skills across a wide range of conditions including Cerebral palsy, ASD, DCD and Learning Difficulties.&lt;/p&gt;\n&lt;p&gt;We have a successful strategy to continue to nurture and grow our own OT workforce by offering robust internal and external training opportunities. We have strong links with the University of Brighton and are continually developing the service using evidence-based practice. As an integrated therapy service we promote collaborative working with other health, education and social care professionals.&lt;/p&gt;\n&lt;p&gt;We have embraced new ways of working since COVID and this includes telehealth, working from home as appropriate and introduction of saturday clinics.&lt;/p&gt;\n&lt;p&gt;Please note due to COVID restrictions some work is completed remotely using telehealth. Some experience using telehealth is desirable but not essential.&lt;br /&gt;&lt;br /&gt;Band 6 opportunities are also available for the right candidate. Anyone interested in gaining further information or wishing to do an informal visit are very welcome.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;Interviews will be held on 30th November 2020 via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fiona Middlemass - Professional Lead OT&lt;/p&gt;\n&lt;p&gt;Email: fiona.middlemass@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: 03001232650&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ore Clinic, Ore", "postalCode": "TN35 5BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8734", "longitude": ".609711"}}, "title": "Clinical Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244593", "validThrough": "2020-11-18T23:59:59+0000"}