{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-04T08:18:45+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Band 5 Occupational Therapist vacancy - full and part-time hours available!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward and Community work available depending on your experience and preference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic, motivated and compassionate Band 5 Occupational Therapist?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit to the South Somerset Integrated Rehabilitation Team (IRT). We have a number of vacancies both ward and community based due to exciting internal promotion.&lt;br /&gt; &lt;br /&gt; This position will provide the opportunity for you to develop and enhance your holistic occupational therapy assessment and intervention skills as part of a multidisciplinary team. This is an opportunity to develop your rehabilitation and clinical skills, deepen your knowledge base and strengthen your clinical reasoning in a structured, supportive environment.&lt;br /&gt; &lt;br /&gt; As part of this role you must have outstanding communication and team working skills, have the ability to inspire and motivate your patients to maximise their physical and functional abilities.&lt;br /&gt; &lt;br /&gt; So if you are passionate about person centred rehabilitation, want to experience community or ward working and continue to develop your skills come and join our team in South Somerset. &lt;br /&gt; &lt;br /&gt; If you are interested in applying for this post and would like an informal discussion please give us a call, we&#39;d be delighted to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Somerset", "postalCode": "BA6 9JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1505", "longitude": "-2.71608"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255080", "validThrough": "2020-11-19T23:59:59+0000"}