{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-37,890 per annum (pro rata for part time)"}}, "datePosted": "2020-11-02T08:15:48+0000", "description": "&lt;p&gt;Are you an enthusiastic Band 6 Mental Health Nurse committed to service delivery and improvement? Do you have the ability to work under pressure whilst providing excellent communication skills? If &#39;Yes&#39; then we may have the position for you at HM Naval Base, Sunny Walk, Portsmouth.&lt;/p&gt;\n&lt;p&gt;As a Band 6 Mental Health Nurse you will be a psychological therapist with qualifications in Cognitive Behavioural Therapy (CBT) and with experience of working in adult mental healthcare. The Community Mental Health Practitioner will work autonomously within a multidisciplinary team to provide a specialised/occupational mental health service for all Service and entitled personnel within the Department of Community Mental Health (DCMH) area of responsibility (AOR) and the Defence Primary Healthcare (DPHC) Region as required.&lt;/p&gt;\n&lt;p&gt;Duties of a Band 6 Mental Health Nurse include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a rapid, timely and high-quality mental health service to all patients referred to the DCMH for assessment and treatment of mental health problems and implementing changes as and when necessary.&lt;/li&gt;\n&lt;li&gt;Providing initial assessment and formulation of the mental health and treatment needs for referred patients, planning, implementing and evaluating care with a high level of autonomy.&lt;/li&gt;\n&lt;li&gt;Maintaining professional knowledge and registration and/or accreditation in line with the code of conduct and standards of their UK professional regulatory body.&lt;/li&gt;\n&lt;li&gt;Delivering up to date, evidence-based interventions for mental health problems based on guidance from the National Institute for Clinical Excellence (NICE) and the National Treatment Agency (NTA).&lt;/li&gt;\n&lt;li&gt;Maintaining confidentiality of patient information and case notes within the constraints of an occupational mental health service, following Caldicott principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Selection Process Details&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have current registration with the Nursing and midwifery Council (NMC)&lt;/li&gt;\n&lt;li&gt;You will be a registered Mental Health Nurse with experience working at Band 5 or above and in a Community Mental Health setting.&lt;/li&gt;\n&lt;li&gt;You must also have demonstrable experience of using NICE recommended Psychological interventions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Or&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Post Graduate /Graduate Certificate in evidence based psychological treatments with experience in Community Mental Health role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Technical Skill Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB3 – Protect of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB5 – Provision of Care&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS General – NHS G6 – People Management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further Information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a Fixed-term Appointment as a Band 6 Mental Health Nurse in Defence Primary Healthcare. Your responsibilities will be as described in this job advert. The reason why you are appointed for a fixed period is due financial review. This post will therefore begin on your appointment and will end on 31/8/21. You should be aware that when your Fixed-term Appointment at MOD comes to an end, arrangements will be made in line with the FTA policy.&lt;/p&gt;\n&lt;p&gt;If you are a permanent MoD civil servant and are found successful for an advertised Fixed-term Appointment (FTA) you should move into the post under a Temporary Transfer (for up to a maximum of 3 years). At the end of the posting you will return to your previous MoD Business area. If this posting is at a higher grade, your promotion will be temporary, and you will return to your substantive grade at the end of the Temporary Transfer. If a Temporary Transfer cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA and Change of Work Location in the UK policy for further information.&lt;/p&gt;\n&lt;p&gt;If you are transferring to MoD from another government department (OGD) you should join the MoD on an inward loan. At the end of the loan you will return to your home (OGD) department. If a loan cannot be agreed between all parties then a transfer on an FTA contract is possible, read the FTA policy for further information.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HM Naval Base, Sunny Walk, Portsmouth, PO1 3LT", "postalCode": "PO1 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7995", "longitude": "-1.11001"}}, "title": "Band 6 Mental Health Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251292", "validThrough": "2020-11-25T23:59:59+0000"}