{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91228", "minValue": "60455", "unitText": "YEAR", "value": "£60,455 - £91,228 per annum"}}, "datePosted": "2020-10-23T12:31:13+0100", "description": "&lt;p&gt;Come and be part of MFT Emergency Department, one of the most interesting and forward looking centres in the UK. We are offering a 12-month post combining the provision of medical education and clinical emergency care.&lt;/p&gt;\n&lt;p&gt;MFT are looking to employ General Practitioners to join a dynamic Emergency Department Team on a bank basis. We are looking for dedicated enthusiastic individuals with an interest in working in an Emergency Care setting.&lt;/p&gt;\n&lt;p&gt;The pay scale is as per the trust agreed GP pay scale. We have part time roles also available to suit your needs.&lt;/p&gt;\n&lt;p&gt;The sessions available are normally 10 hour sessions 7 days a week. The role of the General Practitioner is to see more complex patients requiring a range of primary care skills.&lt;/p&gt;\n&lt;p&gt;Potential of developing extensive experience in various aspects of emergency care, such as resuscitation, paediatric emergency medicine and minor injuries etc.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;About The Trust&lt;/span&gt; - Manchester University NHS Foundation Trust (MFT) is one of the largest acute Trusts in the UK, employing over 20,000 staff.&lt;/p&gt;\n&lt;p&gt;We are responsible for running a family of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;We are the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology, Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;Key Figures: The Trust employs over 20000 Staff, has 2500 beds and an annual turnover of almost £1.6 billion. Our staff attend more than 1,725000 outpatients per year, deliver over 13000 babies and carry out in excess of 189000 operations per year and see in excess of 405000 patients in our A&amp;E departments. The Trust is the largest provider for undergraduate training and the R&amp;D department is the largest in the North West.&lt;/p&gt;\n&lt;p&gt;Our vision is to improve the health and quality of life of our diverse population by building an organisation that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excels in quality, safety, patient experience, research, innovation and teaching&lt;/li&gt;\n&lt;li&gt;Attracts, develops and retains great people&lt;/li&gt;\n&lt;li&gt;Is recognised internationally as a leading healthcare provider&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust is one of the UK’s largest employers, with a wide ranging portfolio of specialty work and a strong academic record. In partnership with The University of Manchester and other collaborators we are rapidly making Manchester the centre of cutting-edge research to improve healthcare worldwide.&lt;/p&gt;\n&lt;p&gt;Our organisation is working to provide a single hospital service across the city of Manchester and in 12-18 months will also include the services currently provided by North Manchester General Hospital. These changes will make a real difference to the health outcomes and quality of life for the people of Manchester. That’s why this really is an extremely exciting and challenging period in the delivery of health and social care in Greater Manchester and one that provides a wealth of career opportunities for great people right across our Group.&lt;/p&gt;\n&lt;p&gt;Wythenshawe Emergency Department has recently undergone a 15 million pound regeneration scheme, providing a state of the art clinical workspace which will allow our team to thrive in providing exceptional patient care every day.&lt;/p&gt;\n&lt;p&gt;Manchester’s Regional Burns Unit and the North West Heart and Lung Centre are both located on site meaning that the department receives a wide range of complex patients via road and air ambulance; whilst a dedicated GP service located in Minors ensures that low acuity patients are seen and treated appropriately.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaith SultanEmail addresslaith.sultan@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "General Practitioner - Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240543", "validThrough": "2020-11-08T23:59:59+0000"}