{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc HCA"}}, "datePosted": "2020-10-23T15:45:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Nursing is rewarding and fulfilling but sometimes it can be tough.&lt;/strong&gt; At Guy’s and St Thomas’ Hospital we recognise that. It’s why we prioritise staff development, career progression, work-life balance and staff well being so that you can be the best nurse for your patients.&lt;/p&gt;\n&lt;p&gt;To us these aren’t just buzz words. They are values that we pride ourselves on.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From in-house specialist training academies to our close links with Kings College University whichever speciality you choose to work in, there will be a structured training programme for you to follow. Each of our clinical directorates has a team of practice development nurses who will work with you to identify your learning needs and appropriate training courses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career progression&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want all our staff to achieve their potential with us. Whether you are looking for a career in management, as a specialist nurse, in education or as a future head of nursing, our dedicated retention team and career coaches will talk to you about your options, career pathways and most importantly, what we can do you help you achieve your goals. Our mobile career advice trolley visits clinical sites regularly bringing the support to you and our internal transfer policy makes it easy for you to make the most of opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work-life balance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We know that working shifts and juggling life can be hard and at GSTT we want to ensure that our staff are given support to help them achieve a healthy balance.&lt;/p&gt;\n&lt;p&gt;We have a flexible working policy that encourages staff to have conversations with their managers about their individual circumstances ensuring that all requests are given fair consideration. Our ward managers receive training from our amazing e-roster team to help them create equitable staff rotas. These are monitored by the nursing workforce team to ensure that there is safe staffing across clinical areas and also to ensure that all staff are working reasonable shift patterns.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Wellbeing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you join GSTT, you are joining a family. We are committed to looking after the physical, emotional and mental health of all of our staff and have a number of different schemes to promote staff well being.&lt;/p&gt;\n&lt;p&gt;From 24 hour free counselling, to reduced membership at our onsite gym and swimming pool, there is something for everyone.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to know more?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We know that nursing at GSTT is fulfilling but don’t just take our word for it. To see what our staff have to say about their jobs and the organisation, click on some of the staff stories which are located alongside the job description.&lt;/p&gt;\n&lt;p&gt;For more information or if you have any questions, email us at: nursingjobs@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applying for a job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have staff nurse vacancies across all of our clinical directorates - if you are interested in a job, and you have an active NMC pin number please use the link in this advert to apply.&lt;/p&gt;\n&lt;p&gt;You will receive an interview to our next assessment day where we are looking forward to meeting with you and getting your career with GSTT started.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHEN APPLYING PLEASE STATE YOUR PREFERENCE OF SPECIALTY IN THE SUPPORTING STATEMENT.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing Date: 11th November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;Assessment Date: 18th November 2020 (alternate dates available)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note due to the current situation we will not be doing face to face interviews and offering alternative online methods of interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERNAL STAFF NEED NOT APPLY&lt;/strong&gt; (please contact nursinginfo@gstt.nhs.uk about Internal Transfers)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namelaura hemmingsAdditional contact information&lt;/p&gt;\n&lt;p&gt;Nursing Recruitment Team&lt;br /&gt;nursingjobs@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s and St Thomas&#39; Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Experienced Adult Nurses - Trust Wide (NOT Open to Newly Qualified)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241155", "validThrough": "2020-11-11T23:59:59+0000"}