{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 pa"}}, "datePosted": "2020-09-25T12:31:50+0100", "description": "&lt;p&gt;&lt;strong&gt;This advert is open to student nurses who are due to qualify in February 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you ready for a new challenge? Do you take enormous pride in delivering safe, compassionate care, resulting in a high quality patient experience? If so we want you to join our Trust.&lt;/p&gt;\n&lt;p&gt;Opportunities exist for Newly Qualified Nurses across a range of specialities, including Acute Medicine, Older Persons Medicine, Theatres , oncology and Surgery. Please identify your area of interest on your personal statement.&lt;/p&gt;\n&lt;p&gt;Royal Bournemouth Hospital is a responsive, innovative and dynamic acute foundation trust hospital with an excellent reputation that we are proud of. The Trust is an acknowledged leader in many of the services we provide, for instance Cardiology, and Dementia care, and work in close collaboration with Bournemouth University.&lt;/p&gt;\n&lt;p&gt;At the Royal Bournemouth &amp; Christchurch Hospitals we are committed to developing our Newly Qualified nurses and providing an excellent foundation on which to build future careers in Nursing, with opportunities available in all specialities across the Trust.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be able to demonstrate a willingness and capability to work flexibly and to adapt to the varying dynamics within the Trust. In an environment such as this, dealing with potentially stressful and challenging situations, a commitment to team working is absolutely essential.&lt;/p&gt;\n&lt;p&gt;We are looking for compassionate nurses who can demonstrate:&lt;/p&gt;\n&lt;p&gt;Quality dignified nursing care&lt;/p&gt;\n&lt;p&gt;Commitment&lt;/p&gt;\n&lt;p&gt;Conscientiousness&lt;/p&gt;\n&lt;p&gt;Empathy&lt;/p&gt;\n&lt;p&gt;Excellent communication skills&lt;/p&gt;\n&lt;p&gt;Team working&lt;/p&gt;\n&lt;p&gt;Knowledge and ownership of your own Personal Development needs&lt;/p&gt;\n&lt;p&gt;Flexibility&lt;/p&gt;\n&lt;p&gt;The Trust is able to offer:&lt;/p&gt;\n&lt;p&gt;A supportive atmosphere for all staff&lt;/p&gt;\n&lt;p&gt;Opportunities for staff to develop and enhance potential&lt;/p&gt;\n&lt;p&gt;Opportunities to work within excellent Clinical teams&lt;/p&gt;\n&lt;p&gt;Generous holiday allowance&lt;/p&gt;\n&lt;p&gt;Excellent Pension scheme&lt;/p&gt;\n&lt;p&gt;Accommodation on site&lt;/p&gt;\n&lt;p&gt;Salary sacrifice for a new car or bicycle&lt;/p&gt;\n&lt;p&gt;Salary sacrifice for Professional Fees&lt;/p&gt;\n&lt;p&gt;Childcare Vouchers&lt;/p&gt;\n&lt;p&gt;NHS Discounts&lt;/p&gt;\n&lt;p&gt;On site nursery&lt;/p&gt;\n&lt;p&gt;Children’s holiday play scheme&lt;/p&gt;\n&lt;p&gt;The Trust is committed to personal and professional development and supports staff to achieve their full potential. The applicant will receive support and training to deliver the care requirements of the speciality, and will become integral to the wider multidisciplinary team, initiating and delivering care. We have a strong nursing team and commitment to quality and patient experience.&lt;/p&gt;\n&lt;p&gt;If successful in gaining a position within the Trust, we are able to offer our Newly Qualified nurses a structured 12 month ‘Preceptorship’ Program, with regular study days and support in practice. For further information relating to Preceptorship, please contact Professional Development 01202 704004. Please only call Professional Development about Preceptorship and NOT general enquires relating to this advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is anticipated that the Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust and Poole Hospital NHS Foundation Trust will merge in 2020 to University Hospitals Dorset NHS Foundation Trust. It is a condition of employment that all staff being recruited in the period before merger will work across all sites pre and post-merger&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on Saturday 28th November 2020 and will include an introduction to the Trust and a Tour of the Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sue Davis&lt;/p&gt;\n&lt;p&gt;Job title Matron&lt;/p&gt;\n&lt;p&gt;Telephone number 0330 019 5801 bleep 2260&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bournemouth Hospital, Bournemouth", "postalCode": "BH7 7DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.8205"}}, "title": "Newly Qualified Nurse - All Areas", "url": "https://www.jobs.nhs.uk/xi/vacancy/916200538", "validThrough": "2020-11-15T23:59:59+0000"}