{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-04T14:46:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultants in Emergency Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“Right now we are building our future”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit enthusiastic, innovative and progressive Consultants to join our Emergency Medicine Consultant team. You will join a single team of Emergency Medicine Consultants working across both our acute sites until they merge and work together on one site at the Midland Metropolitan University Hospital. All new consultants join the Trusts well established New Consultants Leadership Program.&lt;/p&gt;\n&lt;p&gt;Please note, there is also an opportunity to apply for the Clinical Director post within Emergency Care. Please note there will be a separate interview for this role which can take place on the same day of the AAC but not part of the AAC.&lt;/p&gt;\n&lt;p&gt;A community of half a million is eagerly anticipating the brand new Midland Metropolitan University Hospital. The opening will be the beginning of a fresh chapter in our ambitious journey to be the nation’s leading provider of integrated care. The new state of the art acute hospital in Grove Lane, Smethwick will bring together all acute services onto one site. This will lead to a merger of the current two Emergency Departments (at City and Sandwell Hospitals) on to the single site promoting better patient safety and patient experience.&lt;/p&gt;\n&lt;p&gt;The single-site Acute Hospital will benefit from co-located specialist services which will support the new Emergency Department with dedicated imaging facility and Assessment Units. It will provide state-of-the-art treatment and care for patients from Sandwell and across the region and will become the civic heart of the area and a point of pride for the community.&lt;/p&gt;\n&lt;p&gt;You will be joining a busy Emergency Medicine team that currently sees approximately 200,000 patients per year across two hospital sites with a vision to move towards the new single site Emergency Department in Midland Metropolitan Hospital seeing 140,000 patients per year. This will make the Emergency Medicine department one of the largest and busiest in the country. A co-located primary care centre will see an additional 30,000 patients and a further 40,000 will be seen at a separate urgent care centre in Sandwell.&lt;/p&gt;\n&lt;p&gt;The Trust is a key partner with the local commissioning group and the local authorities in the Right Care Right Here program which seeks to deliver a redevelopment of local health services. The program includes one of the largest investments in the UK with new facilities in both the acute and community sectors. Included within this is the new Midland Metropolitan University Hospital.&lt;/p&gt;\n&lt;p&gt;The Trust has a very good reputation for undergraduate and postgraduate teaching with strong links to the University of Birmingham and Health Education West Midlands. The post holders would have opportunities to be a Clinical and/or Educational Supervisor to trainees in the Emergency Department; in addition you will have an opportunity to take on specific service development roles. The Trust is home to a number of University departments and we are now looking to develop research capacity in a number of specialties in the Trust including Emergency Medicine so there is likely to be opportunities to become involved in research activities.&lt;/p&gt;\n&lt;p&gt;Birmingham is a vibrant, multi-cultural city and it is a very exciting place to live and work. It has a population of 1.1 million, the youngest in Europe. Its residents speak over 140 languages and blend different cultures and nationalities with history that is rich in industrial heritage.&lt;/p&gt;\n&lt;p&gt;The area boasts affordable housing with popular residential districts such as Harborne and Sutton Coldfield an easy commute to either of the main hospital sites. There are a number of very good schools and colleges locally (including a number of independent and grammar schools such as the King Edwards Schools). Birmingham is a very green city with more than 8,000 acres of green space including impressive parks around the city. Due to our central location and good motorway connections we are in easy reach of a number of beautiful rural locations including the Peak District, Cannock Chase, the Lickey Hills and the Cotswolds.&lt;/p&gt;\n&lt;p&gt;The Trust offers a competitive relocation package.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact:&lt;/p&gt;\n&lt;p&gt;Dr Saurav Bhardwaj, Specialty Lead - Emergency Medicine on 0121 507 2404, email- saurav.bhardwaj@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Chetan Varma, Group Director – Medicine and Emergency Care on 0121 507 6439.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 03/12/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERVIEW DATE: 18/12/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sandwell and West Birmingham Hospitals NHS Trust is committed to equality of opportunity and is a no smoking organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSaurav BhardwajJob titleSpecialty Lead - Emergency MedicineEmail addresssaurav.bhardwaj@nhs.netTelephone number0121 507 2404&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham Hospital NHS Trust, Birmingham", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256282", "validThrough": "2020-12-03T23:59:59+0000"}