{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "6976", "minValue": "6976", "unitText": "YEAR", "value": "£4.15 Apprenticeship national minimum wage"}}, "datePosted": "2020-10-29T13:01:11+0000", "description": "&lt;p&gt;Would you like to start an exciting career in the NHS, learning new skills and knowledge of Grounds and Gardens, whilst achieving a nationally recognised apprenticeship qualification?&lt;/p&gt;\n&lt;p&gt;Do you want a paid job with great prospects to grow &amp; develop your skills?&lt;/p&gt;\n&lt;p&gt;Everyone who joins our Trust is given every opportunity to increase skills and confidence through training and development&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit an apprentice in a Grounds and Garden Operative role to develop within our organisation. Apprentices must be over the age of 18.&lt;/p&gt;\n&lt;p&gt;You will provide excellent customer services and the role will involve a range of duties to ensure the smooth running of the organisation. Your role will maintain a high standard of professionalism and provide services in line with our values and behaviours.&lt;/p&gt;\n&lt;p&gt;You will be employed on a fixed term contract for 2 years whilst undertaking your apprenticeship and work 37.5 hours per week - Monday to Friday.&lt;/p&gt;\n&lt;p&gt;There are great benefits to undertaking an apprenticeship. Through your apprenticeship with us you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Earn a salary&lt;/li&gt;\n&lt;li&gt;Get valuable and practical work experience&lt;/li&gt;\n&lt;li&gt;Gain new skills&lt;/li&gt;\n&lt;li&gt;Achieve nationally recognised qualifications&lt;/li&gt;\n&lt;li&gt;Work alongside and learn from our highly skilled and knowledgeable staff&lt;/li&gt;\n&lt;li&gt;Get ongoing help and support from colleagues as well as a dedicated mentor&lt;/li&gt;\n&lt;li&gt;Be able to enjoy our fantastic employee benefits&lt;/li&gt;\n&lt;li&gt;Kick start your new career within one the UK&#39;s most valued institutions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The apprenticeship scheme is run in partnership with local training providers and is delivered in the workplace and through on-line learning in conjunction with the YMCA. You will attend a planned induction and additional training events and given time to complete your studies.&lt;/p&gt;\n&lt;p&gt;This post is subject to a standard Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £29.50, the cost of which will be deducted from first salary&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anthony Whittaker - Hard FM Estates Manager&lt;/p&gt;\n&lt;p&gt;anthony.whittaker@nwbh.nhs.uk / 01925 664000&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hollins Park Hospital, Winwick, Warrington", "postalCode": "WA2 8WA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4284", "longitude": "-2.60844"}}, "title": "Apprentice Grounds &amp; Gardens", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248430", "validThrough": "2020-11-12T23:59:59+0000"}