{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-13T15:15:52+0100", "description": "&lt;p&gt;Northumbria Foundation Healthcare NHS Trust is seeking to appoint a Consultant Rheumatologist to enhance our present team.&lt;/p&gt;\n&lt;p&gt;The Northumbria Rheumatology team is an enthusiastic, multidisciplinary group providing outpatient rheumatology services across North Tyneside and Northumberland. As well as Consultants and two specialist registrars, we have a number of specialist nurses, Occupational Therapists, Physiotherapists and Podiatrists. We have interests in osteoporosis, osteoarthritis, musculoskeletal USS, rheumatology education, quality improvement and we would welcome applicants with complementary interests and skills.&lt;/p&gt;\n&lt;p&gt;Applicants who are dual accredited in Rheumatology and G(I)M, and wish to continue that interest are invited to apply and may join the acute care physician team contributing to MAU cover at Northumbria Specialist Emergency Care Hospital. There is no out-of-hours specialist rheumatology on call included in this post. The rheumatology consultants all contribute to a a 5 day per week within-hours rheumatologist of the day telephone advice service and the successful applicant would be expected to contribute to this.&lt;/p&gt;\n&lt;p&gt;Essential criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MRCP&lt;/li&gt;\n&lt;li&gt;Fully registered on the UK General Medical Council&#39;s Specialist Register for Rheumatology ; or Specialist Registrars may apply if within 6 months of CCT at date of interview.&lt;/li&gt;\n&lt;li&gt;Full accreditation with the appropriate Royal College.&lt;/li&gt;\n&lt;li&gt;Full GMC Registration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post will be based at North Tyneside General Hospital but the post holder may be required to work at other sites within the Trust.&lt;/p&gt;\n&lt;p&gt;Northumbria Healthcare NHS Foundation Trust is committed to ensuring a safe and high quality of patient care underpinned by our Trust values. It is expected that all employees demonstrate their commitment to these in their daily activity.&lt;/p&gt;\n&lt;p&gt;Northumbria Healthcare NHS Foundation Trust is committed to the highest standards of recruitment to ensure we attract and employ the very best of candidates. To meet this standard we have developed a detailed and thorough selection event for our shortlisted candidates.&lt;/p&gt;\n&lt;p&gt;The recruitment process is based upon the following key elements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competency based recruitment interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;The completion of two behavioural / thinking style psychometric tests which will be validated as part of the recruitment interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A clinical assessment which will be validated with you at the recruitment interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;An opportunity for you to meet the team and visit the department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Dr Iain Goff, Consultant Rheumatologist and Head of Service on iain.goff@northumbria-healthcare.nhs.uk or 0191 2934150.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Tyneside General Hospital", "postalCode": "NE29 8NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0257", "longitude": "-1.46636"}}, "title": "Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224831", "validThrough": "2020-11-10T23:59:59+0000"}