{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa, based on full time hours"}}, "datePosted": "2020-10-30T12:45:29+0000", "description": "&lt;h2&gt;Amazing Health Visitors required to join our outstanding team!&lt;/h2&gt;\n&lt;p&gt;These are exciting times for our Health Visiting Service in Hampshire and we want you to be part of it. If you’re a Health Visitor and you are looking to join a thriving, innovative service which puts children, young people and their families at the centre of all that they do, then this is the job for you.&lt;/p&gt;\n&lt;p&gt;Some of the great innovations include the introduction of ChatHealth, our new 0-5 Health Visiting Text Message Advice Service, the facilitation of Ready Steady Mums, a community based exercise movement for mums run by mums and the creation of a mental health support group for mothers called “Knowing Me, Knowing You”. All of which have been rolled out across Hampshire. Southern Health NHS Foundation Trust is also an accredited Baby Friendly Initiative organisation.&lt;/p&gt;\n&lt;p&gt;We’re looking for a Health Visitor with an inspirational and motivational personality and someone who is highly skilled in communication, with a strong approach to teamwork. The individual will be someone who can lead in the delivery of the Healthy Child Programme, especially the 6 High Impact Areas in the community using evidence based practice.&lt;/p&gt;\n&lt;p&gt;Working as a team player, your role will require excellent assessment skills and effective partnership working including developing close relationships with our Barnardo’s workers to develop preventative community-based approaches and personalised care to support to the local population.&lt;/p&gt;\n&lt;p&gt;In Southern Health we are committed to ensuring that our values are the foundation of everything we do and we offer great opportunities for ongoing learning and development for all staff by providing a robust induction programme, comprehensive safeguarding and clinical supervision as well as offering access to a broad suite of training to help with your professional development. For newly qualified practitioners we have a preceptorship programme in place to aid your development.&lt;/p&gt;\n&lt;p&gt;If improving outcomes for children and families interests you, as well as doing so in a supportive working environment, we look forward to receiving your application. Good Luck.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note we can only accept applications from qualified health visitors.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal discussion contact: Sandra.Pain@southernhealth.nhs.uk or S&lt;strong&gt;iri.Dennis@southernhealth.nhs.uk&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aldershot or Farnborough", "postalCode": "GU11 1AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2543", "longitude": "-.765632"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250226", "validThrough": "2020-11-22T23:59:59+0000"}