{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-09T11:00:38+0100", "description": "&lt;p&gt;The North West, North Wales and Isle of Man Congenital Heart Disease Operational Delivery Network is seeking to recruit two inspiring and experienced project managers with a background of improvement methodologies to our small but rapidly expanding Operational Delivery Network team. Hosted by Alder Hey Children’s Foundation NHS Trust, the Network covers a wide geographical area and a population of 7.5 million people.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team; we need your passion, skill and tenacity to help us shape ‘lifelong ‘Congenital Heart Disease Services for our patients. Collaborative working and project management approaches underpin our planning and decision making, our small Network team is creative and innovative and we have passion and drive to improve how we inform service development, strategy and measure outcomes.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have high level analytical skills, presentation and communication skills.&lt;/li&gt;\n&lt;li&gt;Have experience of working within the NHS; you will be driving innovation, leading on specific projects and managing project implementation as well as monitoring outcomes.&lt;/li&gt;\n&lt;li&gt;Build effective relationships nationally and locally and work collaboratively across multi organisations, individuals and teams; building and maintain good working relationships with a wide range of clinicians ,managers and teams will be key to your role.&lt;/li&gt;\n&lt;li&gt;Work in partnership with other team members to report progress on project development, delivery, KPI’s and risks to relevant work streams, you will have the freedom to innovate and be creative.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you wish to discuss this opportunity further then please contact: Denise Szpunar Network Manager-denise.szpunar@alderhey.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219863", "validThrough": "2020-11-10T23:59:59+0000"}