{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T12:16:22+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 6 Junior Sister/Charge Nurse to join our team on the Altrincham Dialysis Unit .&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a highly motivated and an innovative nurse leading our team and helping to deliver high quality care to our patients. You will demonstrate excellent knowledge and previous experience in renal medicine and have skills in Haemodialysis. You will be working collaboratively with other MDT members, in addition to being confident in working under your own initiative in order to prioritise your clinical care and workload accordingly.&lt;/p&gt;\n&lt;p&gt;The Unit offers outpatient dialysis treatment 6 days a week for patients across Manchester. Renal Medicine is fast paced, exciting and provides the opportunity for the successful applicant to make a significant impact on the renal patient experience. You will support the Ward Manager with all aspects of management and leadership, promoting a positive patient experience.&lt;br /&gt;&lt;br /&gt;Join us and you’ll have the opportunity to lead the team. To succeed, you’ll need to be committed to delivering high quality, patient focused care with pride and respect, You should have excellent interpersonal and communication skills and be able to provide evidence of personal and professional development.You should show an aptitude for supporting and mentoring junior staff and act as a role model as part of a dedicated team that supports each other and operates with consideration and dignity at all times.&lt;br /&gt;&lt;br /&gt;You will support the Ward Manager and Renal Matron&#39;s in delivering Trust and National objectives . You will have a proven record of embracing a culture of continuous improvement and can demonstrate how you can work within the service improvement methodologies to improve patient outcomes.&lt;/p&gt;\n&lt;p&gt;In return for your skills, enthusiasm and commitment, we offer fantastic development and career opportunities and a supportive management structure in which to develop and achieve your potential as a Band 6 Sister/ Charge Nurse.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane RedshawJob titleWard ManagerEmail addressJane.Redshaw@mft.nhs.ukTelephone number0161 413 7756Additional contact information&lt;/p&gt;\n&lt;p&gt;Renal Matron Emily Raybould&lt;/p&gt;\n&lt;p&gt;Emily.Raybould@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Renal Dialysis Unit - Altrincham, Manchester", "postalCode": "WA14 2RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3849", "longitude": "-2.35154"}}, "title": "Junior Sister/Charge Nurse - Renal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240484", "validThrough": "2020-11-08T23:59:59+0000"}