{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T08:24:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for two motivated and dedicated Pharmacy Technicians to join our successful Medicines Management team working across the newly formed Sussex NHS Commissioners (NHS West Sussex CCG, NHS East Sussex CCG and NHS Brighton and Hove CCG).&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work quickly, accurately and proactively to deliver high quality support as part of the Medicines Management team. The post holder will be expected to use their initiative in ensuring matters are dealt with efficiently and appropriately. At times, the post holder may be dealing with highly sensitive matters and confidentiality will be essential.&lt;/p&gt;\n&lt;p&gt;As part of the Medicines Management team, the post holder will work closely with GP practices and other health and social care providers across Brighton and Hove and the High Weald Lewes Havens area of East Sussex to promote and deliver quality, safe, cost-effective, evidence based prescribing by supporting the implementation of the medicines optimisation work plan and strategy.&lt;/p&gt;\n&lt;p&gt;Part of the role will be to analyse prescribing data using ePACT and other databases, informing the team of potential areas of prescribing that are not cost effective or best practice. ePACT and MS Office experience would be desirable, however full training will be given to the successful applicant.&lt;/p&gt;\n&lt;p&gt;Due to the COVID pandemic, this role will be working from home initially, although your base will be Hove Town Hall or Sackville House, Lewes. &lt;em&gt;This position will be kept in review in line with CCG policy.&lt;/em&gt; Interviews for this post will take place remotely via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about this role please contact Natalia Guerrero, Senior Medicines Optimisation Pharmacy Technician –on 07880002580 or email: natalia.guerrero@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex NHS Commissioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton&amp;Hove/ Lewes", "postalCode": "BN3 4AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8288", "longitude": "-.17033"}}, "title": "Medicines Optimisation Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243707", "validThrough": "2020-11-08T23:59:59+0000"}