{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-02T13:45:52+0000", "description": "&lt;p&gt;Midlands and Lancashire CSU is a highly successful organisation delivering top quality support to an ever growing number of clients, recently being successful in winning contracts for Birmingham, Worcestershire, Cheshire &amp; Mersey, Leicestershire and Derbyshire.&lt;/p&gt;\n&lt;p&gt;The base location for this role is Chester.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and capable individual to join our Midlands and Lancashire CSU IT Asset and Change Management team as the IT Asset and Change Lead - North.&lt;/p&gt;\n&lt;p&gt;The team provides IT Asset Management and Centralised IT Change Management Service support to clients in all regions. IT Asset Management responsibilities include regular stock takes, receiving deliveries, asset register management, delivering stock to site, maintaining stock and managing the secure disposal of assets. The team also orders and configures mobile devices and is in control of the mobile phone billing for the entire mobile estate. The successful candidate will be expected to manage and maintain stock levels as well as order and distribute mobile stock for the north region, handling the lifecycle of requests and incidents via the IT Service Management System in a professional manner; escalating requests where required.&lt;/p&gt;\n&lt;p&gt;IT Change Management Service is responsible for ensuring all change requests for all regions are processed and actioned in accordance with Change Management policies and procedures. The successful candidate will be expected to ensure change management requests are handled in accordance with procedures ensuring all change activities are logged and recorded within the change management module on the IT Service Management system. Regular attendance at the weekly Change Advisory Board (CAB) will be required, and ensuring the co-ordination, preparation and circulation of any relevant CAB documentation prior to the meeting taking place.&lt;/p&gt;\n&lt;p&gt;The post holder will also be expected to take an active role within the team and contribute to service improvement.&lt;/p&gt;\n&lt;p&gt;The role is primarily based in Cheshire, with a requirement to flexibly support services in other regions for all clients across Midlands and Lancashire CSU&#39;s entire geography.&lt;/p&gt;\n&lt;p&gt;We are looking for a team player with a confident outlook, good communication skills, excellent technical skills/knowledge appropriate to 1st line support and to be able to deliver objectives within an agreed time frame under pressure. Excellent people and communication skills are essential to maintain effective communication links. Previous experience of working in IT Asset Management and IT Change Management with knowledge and experience of using service management tools would be advantageous.&lt;/p&gt;\n&lt;p&gt;Please be advised - Interviews may need to be conducted remotely via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGemma HendryJob titleDeputy IT Asset and Change Lead - NorthEmail addressgemma.hendry1@nhs.netTelephone number07904767034&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "1829 Building, Countess of Chester Health Park, Chester", "postalCode": "CH2 1UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "IT Asset and Change Lead - North", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252277", "validThrough": "2020-11-06T23:59:59+0000"}