{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 equivalent"}}, "datePosted": "2020-10-21T11:59:25+0100", "description": "&lt;p&gt;&lt;strong&gt;ODP| Anaesthetic | Band 5/6 equivalent | Full time- Flexible hours – no over nights or Sundays working | Fully Funded Training Programs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Montefiore  has an exciting and rewarding full time opportunity for a ODP with a focus on Anaesthetic to join their committed team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Montefiore Hospital is rated  “O&lt;strong&gt;utstanding” by the Care Quality Commission (CQC). We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, cardiology and general surgery all delivered through our expert and caring clinical team. &lt;/strong&gt;&lt;/strong&gt;&lt;strong&gt;The hospital is well positioned to maximise the excellent local public transport. There are buses that stop in the vicinity and is also walking distance of both Hove and Brighton train station&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prepare the operating theatre/anaesthetic room for surgery in relation to instrumentation, equipment and supplies required for specific operative procedures, ensuring waste is kept to a minimum&lt;/li&gt;\n&lt;li&gt;Ensure the Patient Record is completed in a timely and accurate way&lt;/li&gt;\n&lt;li&gt;Run a theatre list without supervision&lt;/li&gt;\n&lt;li&gt;Perform anaesthetic duties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered  ODP; with proven  experience within Anaesthetic&lt;/li&gt;\n&lt;li&gt;You will be an enthusiastic, dedicated team player who is also used to working under minimum supervision&lt;/li&gt;\n&lt;li&gt;You will be providing exemplary planned care for patients within the perioperative stage and assisting in the management and organisation of care provision in the operating theatre.&lt;/li&gt;\n&lt;li&gt;You will have the opportunity to hone your skills as the unit performs various surgical procedures ranging from General Surgery, Orthopaedic, ENT, Plastics and Ophthalmic&lt;/li&gt;\n&lt;li&gt;ALS and Airway Maintenance certifications would be desirable, though not essential – Training opportunities are available&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sherine Lowers  on sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN3 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8318", "longitude": "-.154902"}}, "title": "Operating Department Practitioner- Anaesthetic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236232", "validThrough": "2020-12-21T23:59:59+0000"}