{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T15:00:24+0000", "description": "&lt;p&gt;&lt;strong&gt;POST: &lt;/strong&gt;Biomedical Scientist– Band 5 (BMS)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LOCATION:&lt;/strong&gt; &lt;strong&gt;Department of MICROBIOLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HOURS: &lt;/strong&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DURATION: &lt;/strong&gt;12 months fixed term&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SALARY: &lt;/strong&gt;BMS (Agenda for Change band 5): £24,907 – £30,615 per annum&lt;/p&gt;\n&lt;p&gt;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitable applicants to join the team of Biomedical scientists (BMS) in the busy Department of Microbiology laboratory at Derriford Hospital. Applicants mustbe HCPC registered, and should have experience of working in a diagnostic NHS Microbiology laboratory.&lt;/p&gt;\n&lt;p&gt;The Department has over 55 staff and processes over 480,000 samples per year. It has full UKAS accreditation and is a recognised training laboratory. The successful applicant will rotate through the Bacteriology and Virology sections of the laboratory, and helping to deliver the SARS-COV-2 testing for the Plymouth area. They will be expected to examine a wide range of clinical samples from patients, in order to determine the laboratory diagnosis and the appropriate treatment of infection due to bacteria, viruses, fungi or parasites. Staff are encouraged to further their own development and assist with CPD related activities. The laboratory is well equipped and is fully computerised.&lt;/p&gt;\n&lt;p&gt;This is a 12 month Fixed term, full time post Monday to Friday. There are early (08:00-16:30), core 09:00-17:30) and late shifts (14:00-22:00) in operation on a rotational basis. There is also a commitment to participate in a weekend and overnight rota. All weekend work is paid at an enhanced rate.&lt;/p&gt;\n&lt;p&gt;University Hospitals Plymouth NHS Trust includes many medical specialities including Renal Transplant, Cardiothoracic, Plastic Surgery, Neurosurgery and Oncology. It is situated in one of the most attractive locations in the UK with Dartmoor and Cornwall nearby, but still easily accessible to the rest of the country via the motorway and rail networks.&lt;/p&gt;\n&lt;p&gt;For more information please contact Allan Speirs (Microbiology Laboratory Manager) a.speirs@nhs.net t: 01752 433270.&lt;/p&gt;\n&lt;p&gt;University Hospitals Plymouth NHS Trust is an Equal Opportunities employer. The Trust operates a Green Commuter Strategy.&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252509", "validThrough": "2020-11-16T23:59:59+0000"}