{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-06T13:00:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Support Worker – Theatres (Modern Apprentice opportunities) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Seven day cover comprising of early and late shifts, Long days, weekends and night duties.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Wirral University Teaching Hospital is seeking to recruit a team of Clinical Support Workers to join our dynamic operating theatre team. Whether you have experience or are looking to start a career in the operating theatre, WUTH is the organisation for you. The position for a Clinical Support Worker will be within our operating theatres based in Orthopaedic Theatres which consists of 6 theatres across 2 sites . We need support workers to deliver and support high standards of perioperative care to our patients across our Orthopaedic specialities. These include Elective and Trauma . The post available is a full time position&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work as part of a highly motivated team with real commitment to providing a high standard of patient care with a significant amount of patient interactions as the majority of our patients have their surgery performed under local anaesthetic . The role requires you to support other members of the theatre team, such as scrub practitioners, operating department practitioners (ODP), surgeons and anaesthetists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer a Fixed Term Modern Apprentice Training Scheme -&lt;/strong&gt; &lt;strong&gt;successfully appointed applicants will be paid under the annex 21 pay scale.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking to develop a career in the operating theatre? We can offer you a comprehensive training package supporting you to gain a perioperative qualification in support work. Through enrolment into an apprenticeship, you will be expected to complete your apprenticeship within 15 months of your start date (part time applicants will have extended period). Your initial apprenticeship pay rate is defined by the duration of the apprenticeship; your pay will increase throughout the duration of your apprenticeship when specific milestones are met. Following successful training you will be offered a full time position. This scheme is open to all who want to develop in operating theatres.&lt;/p&gt;\n&lt;p&gt;In order to apply you will need to provide evidence of your GCSE Maths and English. Don’t have them – don’t worry we can support you with functional maths and English development. Unfortunately if you hold other qualifications you may not be suitable for a Modern Apprentice post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time positions - successfully appointed applicants will be paid in accordance with national agenda for change pay scale.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you hold a nationally recognised qualification in perioperative practice (NVQ/QCF) and are looking to join our team. We can offer you a framework of development to support advancement of your career in operating theatres. Following a period of induction you will form part of our excellent team to deliver high quality patient care in our operating theatres.&lt;/p&gt;\n&lt;p&gt;By joining us we will give you the support and development you need to become a practitioner of the future. With an initial internal training program and assessment you will achieve competence enabling you to develop your patient care skills. In return for your dedicated care Wirral University Teaching Hospitals can provide you with opportunities to develop into perioperative practitioners of the future. Being part of our #PROUD team we can offer you staff benefits including Lease Car Scheme, Smoking Cessation Services, Childcare and Family Support and other healthcare related support packages. If you seek to work in a specialised team and wish to build an exciting and fulfilling career at Wirral University Teaching Hospital, then this is the role for you.&lt;/p&gt;\n&lt;p&gt;This role is currently Monday to Friday, but may include late shifts and weekend work.&lt;/p&gt;\n&lt;p&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Brioney Gibb&lt;/p&gt;\n&lt;p&gt;Orthopaedic Theatre Coordinator.&lt;/p&gt;\n&lt;p&gt;Telephone: 0151 6047243 for APH and 01513344000 ext 4359 for CBH&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Theatre Clinical Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259782", "validThrough": "2020-11-22T23:59:59+0000"}