{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-10-23T14:16:18+0100", "description": "&lt;p&gt;We are looking for a Deputy Director of Personalised Care to lead the continued adoption of the Comprehensive Model for Personalised Care by the NHS. This is a permanent role.&lt;/p&gt;\n&lt;p&gt;As Deputy Director, the post holder will have accountability and responsibility for the strategic direction and oversight of the Comprehensive Model for Personalised Care and the associated commitments in the Long Term Plan. This includes, but is not limited to, responsibility for areas such as Social Prescribing and several additional roles in primary care, and personal health budgets. The functions this post is responsible for include all national levers and incentives work, oversight of national targets and commitments for personalised care, enabling support and delivery through NHSE&amp;I regional teams and in SPT/ICS, CCG and PCN localities, and policy work across a wide range of internal and external stakeholders. The role also ensures the voices and experiences of people with lived experience are threaded throughout all of the work of the Personalised Care Group. For the full set of responsibilities, please read the job description.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive, proven experience of leading and delivering complex change and strategy development in a politically sensitive and complex environment&lt;/li&gt;\n&lt;li&gt;Leading, directing and motivating a large number of staff across different teams, ensuring business plan and objectives are met, with deliverables that are timely, to the required standards and within budget.&lt;/li&gt;\n&lt;li&gt;Highly advanced relationship skills and polished communication skills, ranging from writing policy/position papers to speaking publicly at high profile events&lt;/li&gt;\n&lt;li&gt;Ability to make decisions autonomously, when required, on difficult issues&lt;/li&gt;\n&lt;li&gt;Representing the Director of Personalised Care and the Personalised Care Group in sensitive and political situations, delivering difficult messages where required to high-level audiences&lt;/li&gt;\n&lt;li&gt;Integrity, respect and a passion for improving outcomes for people&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interviews will take place via Microsoft TEAMS&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rich Watts, Head of Strategy; rich.watts@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London/ Quarry House Leeds", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Deputy Director of Personalised Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240881", "validThrough": "2020-11-08T23:59:59+0000"}