{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-11-04T09:46:22+0000", "description": "&lt;p&gt;***Please note this is an INTERNAL VACANCY ONLY for NUH employees, therefore only current employees of Nottingham University Hospitals NHS Trust will be considered for the post.***&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our existing team to support Mortuary and Pathology Services for the Trust and surrounding Coronial jurisdictions. Nottingham University Hospital Bereavement Service manages approximately 6,400 deaths a year and performs 2,400 post-mortems including CT Scans. Established departmental specialties include neuropathology, paediatric and perinatal pathology and forensic pathology. The department also has specialist expertise in dealing with patients considered to be at high risk for infective processes including Creutzfeldt-Jakob disease.&lt;/p&gt;\n&lt;p&gt;As a Mortuary Assistant, the post holder will be a member of the Mortuary team in the delivery of a quality driven, cost effective, patient focused service consistent with the Trust&#39;s objectives and provide that service in a manner commensurate with the profession. The post holders’ main role is to participate in the daily work carried out in the various areas of the Mortuary. Other duties will include the receipt and release of deceased patients from the Trust and surrounding community. You will also be expected to assist with the transfer and viewings of deceased patients, and support their relatives.&lt;/p&gt;\n&lt;p&gt;The post holder will not be training to perform post-mortems but may be required to assist in the general duties of the Post-mortem Room. Ideally, you will be of a caring disposition and it is essential that the post-holder sets and maintains high standards of personal presentation, as well as communication etiquette.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at QMC &amp; City Campuses. You will be required to learn all aspects of basic Mortuary duties and require computer and keyboard skills.&lt;/p&gt;\n&lt;p&gt;This is a temporary fixed term/secondment contract for 12 months. Normal hours are 08:00 – 16:30 Monday to Friday with a one hour lunch break. You would be expected to have a flexible approach to your hours to cover extended service provision, leave and sickness when required and until competent under supervision. Once competent you may also be required to work weekends, should the service permit this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameScott RavenJob titleMortuary ManagerEmail addressscott.raven@nuh.nhs.ukTelephone number63338&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Mortuary Assistant ***NUH APPLICANTS ONLY***", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255238", "validThrough": "2020-11-08T23:59:59+0000"}