{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41334", "minValue": "36602", "unitText": "YEAR", "value": "£36,602 - £41,334 p.a."}}, "datePosted": "2020-10-26T12:46:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a motivated, dynamic and passionate about developing services for people with severe and enduring mental health problems. If so please read on:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nationally it has been recognised that rehabilitation is an area that has often been overlooked for investment and modernisation. We are proud to say the Trust in conjunction with our local Dorset Clinical Commissioning Group have recently completed a review of our Rehabilitation Services in Dorset and secured significant additional funding to redevelop and expand the services that we provide. This includes a brand new dedicated pan Dorset Community based Rehabilitation Team (CRT). The CRT will support people who have chronic and disabling mental health problems that may be treatment resistant and who have previously spent long periods in hospital. Our vision is to provide a community team in the east and a community team in the west of the county.&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Clinical Psychologist to join the Dorset Community based Rehabilitation Team (West Dorset – Inpatient Unit and Community), please review the associated Job Description for further specific information on this role. We are looking for people who are reliable, committed and dedicated with excellent communication and organisational skills and the ability to prioritise their work.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;There will be two teams in the East and West of Dorset. The CRT East team will be based at Kings Park Hospital/Boscombe and the CRT West will be Mid/West Dorset (exact location to be confirmed). This post will be based in the CRT West team.&lt;/li&gt;\n&lt;li&gt;These are part time, permanent post working 30 hours per week, Monday to Friday.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All post holders will work as part of an integrated multi-disciplinary team including &lt;strong&gt;Mental Health Practitioners, Occupational Therapists, Psychologists, Psychology Assistants, Support Time Recovery Workers, Employment Specialists, Clinical Team Leaders, Admin Assistants, Advanced Nurse Practitioners and Medical Staffing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you want to be part of this newly established dynamic, forward thinking service, we would keen to hear from you. Please submit an application as soon as possible. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The caseload numbers will reflect the complexity of the client base that Mental Health Practitioners will be care coordinating in the community. It is anticipated that these clinicians will manage between 10 and 12 clients in the community including those transitioning from Inpatient Rehabilitation Services. It is also anticipated that the other clinical roles within the CRT will not hold a caseload.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will need to have a valid driving licence and use of a car as they will be required to assess and monitor patients in their own homes and within other community settings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jon Boakes, Lead Psychologist at JON.BOAKES@nhs.net / 01202 584301&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset", "postalCode": "BH17 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7402", "longitude": "-1.97751"}}, "title": "Clinical Psychologist, Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242491", "validThrough": "2020-11-09T23:59:59+0000"}