{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Very Senior Manager/Consultant"}}, "datePosted": "2020-10-20T15:46:58+0100", "description": "&lt;p&gt;Vacancy: Medical Director&lt;/p&gt;\n&lt;p&gt;Salary: VSM or Consultant grade&lt;/p&gt;\n&lt;p&gt;We are looking for a caring, passionate, inspirational and dedicated leader to join United Lincolnshire Hospitals NHS Trust as our Medical Director. We provide care to a population of over 700,000 people and believe they deserve Outstanding Care Personally Delivered.&lt;/p&gt;\n&lt;p&gt;There is much to be proud of in our Trust. We have examples of leading-edge care, from our heart centre to the end-of-life hospice service. However, we recognise that to consistently meet our aspirations for patients and to do so within our budget, we need to transform and to do so at pace.&lt;/p&gt;\n&lt;p&gt;We have the ingredients to do so; fantastic staff and strong partnerships within the Lincolnshire Sustainability and Transformation Partnership (STP) and with the University of Lincoln, including the newly launched medical school. We are looking forward to engaging with the public and our staff formally around the STP review of acute service provision in Lincolnshire.&lt;/p&gt;\n&lt;p&gt;This means that our Medical Director will join us at a challenging time. She or he will require inspirational leadership skills and capability to sustain and build on our progress to date, playing their full part in our improvement journey as a member of the Board.&lt;/p&gt;\n&lt;p&gt;We anticipate that this role will appeal to doctors who have experience of supporting Trusts with significant challenges, including those in special measures. Above all we wish to assess leadership skills and values as much as professional expertise. This is a key appointment for our patients, our staff, our senior leadership team and our regional health and care system.&lt;/p&gt;\n&lt;p&gt;The Trust is at a pivotal point in its history and this presents a great leadership opportunity for a leader intent on making a difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is Friday 20th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, to request the candidate briefing pack or to arrange informal discussion about the role, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Jane Ablewhite (PA to the Chief Executive)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;email: jane.ablewhite@ulh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;tel.: 01522 573977&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please apply through NHS jobs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Medical Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235125", "validThrough": "2020-11-20T23:59:59+0000"}