{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa + hcas"}}, "datePosted": "2020-11-06T15:01:06+0000", "description": "&lt;p&gt;The Chemotherapy Day Unit at the Mount Vernon Cancer Centre is looking to recruit an enthusiastic and flexible Chemotherapy Nurse.&lt;br /&gt;&lt;br /&gt;The Chemotherapy Day Unit treats both male and female patients with a wide variety of systemic anti cancer therapies.&lt;br /&gt;&lt;br /&gt;The successful candidate would ideally have some experience of working within oncology and delivery of SACT however full training could be provided to the right candidate. &lt;br /&gt;&lt;br /&gt;Part time applicants would be considered. Our staff are important to us so you will be given opportunities to develop and also to engage in improving services for patients and staff.&lt;br /&gt;&lt;br /&gt;The unit is currently opened Monday to Friday and we work closely with other units one on site and one at our acute trust site. Mount Vernon is one of the largest single site Cancer Centres in England and is an innovative and exciting place to work. We are internationally renowned for radiotherapy, chemotherapy, patient support services and research and therefore, you will be joining a cancer centre offering significant career development opportunities.&lt;br /&gt;&lt;br /&gt;In addition, you will receive a High Cost Area Supplement of 15% of your basic salary, subject to a minimum payment of £3,722 and a maximum payment of £4,743 per annum pro rata&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mount Vernon Cancer Centre is a well-respected, non-surgical cancer centre based in Northwood in Middlesex – providing chemotherapy, radiotherapy and immunotherapy treatments to over 5,000 patients a year. It is currently run by East and North Hertfordshire NHS Trust (ENHT) and consistently receives positive patient feedback. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking to maintain and expand the Cancer Centre staff as we move to an exciting new future. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from those who would relish the opportunity to be part of new and developing cancer service, building on the &lt;span&gt;excellent reputation, research and patient experience the Cancer Centre already delivers.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You can find out about the recent review of services and what this means in the attached files section. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;The unit manager, Aolat Adisa on 0203 826 2237, Informal visits are encouraged&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mount Vernon Cancer Centre, Northwood", "postalCode": "HA6 2RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6149", "longitude": "-.445801"}}, "title": "Registered Nurse - Chemotherapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260246", "validThrough": "2020-11-20T23:59:59+0000"}