{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751"}}, "datePosted": "2020-10-16T10:45:28+0100", "description": "&lt;p&gt;Fixed Term Specialty Doctor in Radiology (12 Months)&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Speciality Doctor in Radiology. This is a fixed term post and Normal Working Days only.&lt;/p&gt;\n&lt;p&gt;January 2021 – December 2021 – Normal Working Days only (Monday – Friday 09.00-17.00).&lt;/p&gt;\n&lt;p&gt;The salary scale for this post is basic salary£41,158 - £76,751&lt;/p&gt;\n&lt;p&gt;West Suffolk Hospital is a busy and popular hospital, serving a population of 280,000 and is run by a forward-thinking Foundation Trust. We have an excellent teaching and research base. Our undergraduate and post-graduate medical education programmes delivered jointly with Cambridge University are popular and consistently achieve excellent results.&lt;/p&gt;\n&lt;p&gt;Clinical supervision, and education are part of the package; Specialty doctor will have an Educational Supervisor with provision for study leave with full funding.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work in an award-winning Trust and to build on an already high level of patient satisfaction, staff engagement and public confidence for the quarter of a million people served by the West Suffolk NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust has close links with Papworth Hospital, Cambridge, and Cambridge University Medical School. Situated in the heart of East Anglia, the cathedral town of Bury St Edmunds is a pleasant place to live and work, providing sophisticated facilities in a traditional and unspoilt rural town setting. There is also easy access to the Midlands, London and the East Coast.&lt;/p&gt;\n&lt;p&gt;Our vision is to deliver the best quality and safest care for our community – which we benchmark against the best. Our values, developed with staff and patients, have been clear since 2008 - &lt;strong&gt;FIRST&lt;/strong&gt; - &lt;strong&gt;F&lt;/strong&gt;ocused on patients; &lt;strong&gt;I&lt;/strong&gt;ntegrated team working; &lt;strong&gt;R&lt;/strong&gt;espectful and courteous; &lt;strong&gt;S&lt;/strong&gt;taff focused and supportive; &lt;strong&gt;T&lt;/strong&gt;wo-way open communication.&lt;/p&gt;\n&lt;p&gt;To find out more or to arrange an informal visit please contact Dr Roshdy Guirguis, Consultant Radiologist on 01284 712778&lt;/p&gt;\n&lt;p&gt;Closing date: TBC&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome. However, Non-EEA candidates who require Tier 2 sponsorship may not be shortlisted or appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post, as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Border Agency requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill this post&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Fixed Term Specialty Doctor in Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229698", "validThrough": "2020-11-19T23:59:59+0000"}