{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42500", "minValue": "42500", "unitText": "YEAR", "value": "42500"}}, "datePosted": "2020-11-02T13:04:56+0000", "description": "&lt;p&gt;Role&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;Role Type&lt;/p&gt;\n&lt;p&gt;Full Time - 37.5hr&lt;/p&gt;\n&lt;p&gt;Location&lt;/p&gt;\n&lt;p&gt;Practice Plus Group Hospital, Gillingham&lt;/p&gt;\n&lt;p&gt;Salary&lt;/p&gt;\n&lt;p&gt;£36,000 - £42,500 per annum&lt;/p&gt;\n&lt;p&gt;Are you an experienced nurse looking for a rewarding role, maybe the next step in your career? If you are looking to join an energetic and vibrant organisation that truly makes a difference to people’s lives on a daily basis we would like to hear from you. We are looking for a Ward Manager to join our team. Whether you’re coming from an NHS or private hospital we’ll give you time to use your nursing skills – and help you build a fulfilling career.&lt;/p&gt;\n&lt;p&gt;Our focus at all times is on ensuring that our patients receive high quality treatment quickly, in clean and comfortable surroundings. Our wards boast great nurse to patient ratios and Practice Plus Group Hospital, Gillingham has been rated Good by the CQC, putting it at the very top of the regulator’s quality ratings.&lt;/p&gt;\n&lt;p&gt;If you are a practitioner outside of the local area we would welcome your application and there is a very generous relocation package available to support you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our inpatients team is comprised of experienced nurses and healthcare assistants, supported by our welcoming Head of Nursing and Clinical Services, Paula. You will be a crucial member of our multi-disciplinary team, taking responsibility for coordinating and facilitating the care of patients within the department.&lt;/p&gt;\n&lt;p&gt;Your leadership and clinical skills will help you to support all staff working on the Ward. All of our work is planned so you will be able to plan your week with ease knowing your work schedule won’t change.&lt;/p&gt;\n&lt;p&gt;Your sound clinical and Infection control knowledge combined with your ability to solve problems and think both literally and laterally will enable you to coach and support others in your team. We encourage sharing of best practice across our site to develop your skills and take advantage of our excellent clinical leadership knowledge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In turn we will support you to help you grow in your role and take your career in the direction you want to go. We’ll help you be the best you can be. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career.&lt;/p&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. As a CQC Outstanding rated hospital we believe in developing and nurturing our people.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact &lt;strong&gt;martyn.kingsbury@practiceplusgroup.com&lt;/strong&gt; in our friendly resourcing team, or call 01189 521921. Martyn will also be happy to arrange an informal call with Paula, our Head of Nursing and Clinical Services should you wish to speak with her ahead of making a formal application.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME8 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3808", "longitude": ".57658"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252171", "validThrough": "2020-11-06T23:59:59+0000"}