{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 pa pro rata"}}, "datePosted": "2020-10-28T13:46:22+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking to appoint a Principal Finance and Analytics Manager to work short-term and part-time primarily to lead a team of analysts undertaking financial and data analysis. This person will lead collaboration with GIRFT clinical leads and other senior external stakeholders They will lead work to deliver financial and other analysis to support the writing of GIRFT National Reports, and will lead work to translate GIRFT coding algorithms into a standard format to support reporting of metric values in Model Hospital. The post-holder will report to the GIRFT Chief Information Officer.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Getting It Right First Time (GIRFT) programme aims to improve clinical quality and efficiency within the NHS by reducing unwarranted variation. The programme offers an opportunity to deliver a real difference to hundreds of thousands of patients and to the NHS in general. GIRFT supports NHS Trusts to implement change that results in patients spending less time in hospital and clinicians providing care safely. GIRFT also works with national organisations to change policy and processes where these changes support improvement in NHS clinical services.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post-holder will be part of a virtual team who deliver financial and analytical support to a significant clinical improvement programme. Highly developed financial and analytical skills, the ability to work independently and the experience to lead and develop a virtual team are key requirements for the position. The selected person will understand the delivery of NHS services and financial aspects of the commissioning and provider relationship, as well as understanding NHS data and data flows including how these relate to and have been used in the GIRFT programme.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that&lt;span&gt; this vacancy can be closed earlier as soon as sufficient applications are received. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Interviews to be held on 11th or 12th November 2020&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / contact:&lt;/p&gt;\n&lt;p&gt;Jamie Day Chief Information Officer jamieday@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Home Based", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "GIRFT Principle Finance and Analytics Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246816", "validThrough": "2020-11-11T23:59:59+0000"}