{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T03:46:27+0000", "description": "&lt;p&gt;CAMHS Practitioner Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time 37.5 hours per week flexible to meet the needs of the service may include evening and weekend work when required as part of the Out-of-Hours Service across the Care Group &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an innovative and dynamic CAMHS team that has recently been selected to be part of the first wave of sites to implement the proposals for new Mental Health Support Teams in schools? An exciting opportunity has arisen for an experienced CAMHS Practitioner to join our CAMHS Team.&lt;/p&gt;\n&lt;p&gt;The practitioner will provide consultation, formulation and guidance to children, young people, their families and associated professional networks which may include Education, Children’s Services, GP’s and other agencies. The focus will be upon securing the timely and effective provision of evidenced based approaches to assist children and young people with their emotional welfare via robust formulations and collaborative guidance&lt;/p&gt;\n&lt;p&gt;The successful candidate will have an exciting and varied opportunity to apply their clinical skills in offering specialist assessments and also their skills in multi-agency working by providing ongoing consultation, formulation and guidance to the wider professional systems working with the children, young people and families within Doncaster&lt;/p&gt;\n&lt;p&gt;The appointed clinician will also need to demonstrate an ability to maintain a high standard of patient care; be professionally responsible for the collaborative formulation of care needs and engage in the development, implementation and evaluation of the Consultation and Advice process. The applicant must have a high standard of record keeping; demonstrate effective service user and multi-agency engagement within the assessment/consultation process and demonstrate a truly collaborative approach to multi-agency formulation and care planning.&lt;/p&gt;\n&lt;p&gt;The successful candidate needs to have experience to undertake Mental Health assessment and develop appropriate Risk Management Plans for young people who are experiencing a wide variety of mental health disorders/illnesses or difficulties that are impacting on their life that present in a Mental Health Crisis during in and out of hours to the service&lt;/p&gt;\n&lt;p&gt;You will have:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A high level of enthusiasm and dedication to providing quality, community based mental health services to children, young people and their families&lt;/li&gt;\n&lt;li&gt;Access to transport or have the ability to travel to a variety of venues as part of the working day&lt;/li&gt;\n&lt;li&gt;Experience in undertaking Mental Health Assessments, providing interventions &amp; formulations to address the needs of the client group&lt;/li&gt;\n&lt;li&gt;Experience of working under pressure and in a demanding environment&lt;/li&gt;\n&lt;li&gt;To have the skill to adapt and the flexibility to think on your feet due to the nature of your role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 8QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4948", "longitude": "-1.14598"}}, "title": "CAMHS Practitioner (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251259", "validThrough": "2020-11-16T23:59:59+0000"}