{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "AfC Band 5 £24,907 rising to £30,615 pro rata"}}, "datePosted": "2020-10-26T16:36:34+0000", "description": "&lt;p&gt;Would you like to work in a happy, friendly supportive team to provide a public health nursing service to the school aged population?&lt;/p&gt;\n&lt;p&gt;South Gloucestershire School Health Nursing service is a workforce of Specialist Community Public Health Nurses and Registered Nurses who provide expert advice, support and interventions to children, young people (5-19) and their families and help empower them to make decisions that affect their families future health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The service supports interventions to children, young people (5-19) and their families and help empower them to make decisions that affect their families future health and wellbeing. Supporting all pupils attending primary and secondary schools within South Gloucestershire, the service works in partnership with multi-disciplinary health teams within community and acute services, local authority and voluntary sector teams to deliver a clinically effective, high quality health service to the school aged population.&lt;/p&gt;\n&lt;p&gt;This position is with the Patchway team, comprised of very experienced, supportive nurses who will provide an excellent experience for the successful candidate.&lt;/p&gt;\n&lt;p&gt;This post is for 22.5 hours a week, working during term time only.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work both as an autonomous practitioner and as part of a wider public health nursing team in a variety of settings to provide care to children, young people and their families as specified in our core offer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Patchway Hub, South Glos", "postalCode": "BS34 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5313", "longitude": "-2.5768"}}, "title": "School Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243458", "validThrough": "2020-11-22T23:59:59+0000"}