{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-23T11:16:19+0100", "description": "&lt;p&gt;The Adult Mental Health Team, forming part of Oxford Health NHS Trust, based in the heart of Oxford City, are keen to hear from individuals who are interested in joining a unique administrative team. We are dedicated to supporting Doctors and other medical staff who provide support to Adults of working age experiencing Mental Health issues.&lt;/p&gt;\n&lt;p&gt;This is a special administrative role, which can be demanding, challenging and requires skill to handle all contacts with confidence, compassion, patience and professionalism. It sits within a larger team that is extremely supportive and together we all make a real difference in the community. Good communication skills are essential together with high levels of emotional resilience. In return you will receive support and development from the team and the Trust itself, such as continuing professional development, opportunity to undertake apprenticeships, yearly appraisals etc.&lt;/p&gt;\n&lt;p&gt;Supporting everyone with their mental health has always been important to us but, never more so than now. So, if you have admin experience, preferably from within a Health Care or Social Care background and are interested in working in a Mental Health setting this could be the opportunity for you and just the team member we are looking for!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise DalyJob titleMental Health Office &amp; Admin ManagerEmail addresslouise.daly@oxfordhealth.nhs.ukTelephone number01865 902200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warneford, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Mental Health Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240269", "validThrough": "2020-11-15T23:59:59+0000"}