{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22450", "minValue": "22450", "unitText": "YEAR", "value": "Up to £22,450 (Pro-Ratqa)"}}, "datePosted": "2020-10-26T10:58:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Contract - Up to 9 Months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join Turning Point’s Leicestershire Substance Misuse Services as a Recovery Worker. You will join our large integrated service which delivers treatment across the whole of Leicester City, Leicestershire and Rutland. We are specifically looking to fill vacancies in our Loughborough and Coalville offices but the vacancies could be in any team across Leicester, Leicestershire and Rutland.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Recovery Worker you will manage a caseload, undertake assessments, develop person centred recovery plans individually and in small clusters and run evidence based substance misuse interventions in a group basis and individually. Your work will make a real difference; supporting individuals to make changes in their substance use and improving their overall quality of life.&lt;/p&gt;\n&lt;p&gt;You will work as part of a team made up of Recovery Workers, Managers, Doctors, Nurses and Peer Mentors. You will be assigned initially to one of our recovery teams in either the city or the county and throughout your time in role may get the opportunity to work from any of our teams or locations across the city and county, including in our specialist criminal justice team.&lt;/p&gt;\n&lt;p&gt;A driving licence and car access is desirable but flexibility in travel across the county is essential.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a highly effective communicator, efficient and organised and have a real passion for supporting service users to achieve recovery.&lt;/p&gt;\n&lt;p&gt;We are looking for a Recovery Worker for a fixed term post in our Leicester City service until the 31st August 2021. &lt;/p&gt;\n&lt;p&gt;Whilst this post will commence as a temporary position to cover maternity leave it is likely that there will be opportunities for this to become a permanent post before the end of the temporary contract.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester, Coalville, Loughborough", "postalCode": "LE1 3QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6376", "longitude": "-1.12764"}}, "title": "Recovery Worker - Leicester, Leicestershire and Rutland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242097", "validThrough": "2020-11-09T23:59:59+0000"}