{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "Circa £30,000 Pro Rata Plus Enhancements"}}, "datePosted": "2020-10-26T15:39:25+0000", "description": "&lt;p&gt;We are recruiting for a Senior Staff Nurse to work within the Hospice at Home Team, to deliver high standards of holistic, individualised care and support to patients and their families in their own home at the end of life. You will be advising patients and their families in relation to their illness and their specific needs and to enable expression of preferences and wishes in relation to their care and assess and manage symptoms with support from the multi-disciplinary team, pre-empting preventable, physical symptoms and reducing psychological distress. You will be working as part of a small team on a rota basis covering early and late shifts including weekends.&lt;/p&gt;\n&lt;p&gt;To apply you will need to be a Level 1 registered nurse with a minimum of 3 years post registration experience. Palliative care/oncology experience and working with imminently dying patients is essential..&lt;/p&gt;\n&lt;p&gt;The Hospice @ Home service operates from 8.30am to 10pm seven days per week and shifts will be 7.5 hour shifts from 8.30am to 4.30pm or 2pm to 10pm and will include weekends and bank holidays on a rota basis. Please note that the post is based at our Head Office in Welwyn Garden City and you will need to travel to see patients in their own homes in the community either in pairs or as a lone worker dependent on patient requirements. You will therefore need to have a full driving licence and use of your own car. Mileage is paid at the rate of .45p per mile.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isabel Hospice ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welwyn Garden City", "postalCode": "AL7 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8009", "longitude": "-.194002"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243182", "validThrough": "2020-11-09T23:59:59+0000"}