{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-27T10:02:15+0000", "description": "&lt;p&gt;Consultant Haematologist (1 Post)&lt;/p&gt;\n&lt;p&gt;Applications are invited for a full time Consultant Haematologist at Kettering General Hospital NHS Foundation Trust to join our friendly and dynamic team of haematologists. This is a replacement post. The successful candidate will join a team of 4 other full time consultant haematologists to provide a high quality comprehensive haematology service to the local area. You will be based at Kettering General Hospital. The post holder will contribute to all aspects of the general haematology and haemato-oncology work including active participation in departmental meetings, teaching and supervising registrars and helping with audit and research. The post includes ward cover, outpatient clinics and on call commitment in haematology. The post will be paid at 11 PAs with a commitment to a 1:4 on call rota.&lt;/p&gt;\n&lt;p&gt;Kettering General Hospital NHS Foundation Trust is an Affiliated Teaching Hospital with circa 600 beds providing a service to approximately 360,000 people in North Northamptonshire and South Leicestershire. The Trust treats patients in a range of specialties including medicine, surgery, obstetrics and gynaecology and paediatrics. The Trust is a designated Cardiac Centre and provides a 24/7 Regional Primary PCI Emergency Service for the County. There is a wide range of imaging services including CT, Cardiac and general MRI, access to nuclear medicine and PET scanning.&lt;/p&gt;\n&lt;p&gt;Kettering has good links with Leicester Medical School and awarded affiliated teaching hospital status. Kettering receives medical students from the medical school for teaching and training as well as foundation doctors, core and specialty trainees on rotation from HEEM (Health Education England, East Midlands).&lt;/p&gt;\n&lt;p&gt;Kettering is centrally located with easy access to London in less than 1 hour by rail. By road, Kettering is within easy reach of 5 international airports and 75% of the country can be reached within 2 hours.&lt;/p&gt;\n&lt;p&gt;The Trust is going through a period of transformation and improvements will lead to a stronger focus on providing Safe and Compassionate care to our patients and this will give you the opportunity to learn, develop and expand your career. We believe that providing excellent education, training and development for our staff is essential. We offer a wide range of benefits, for example access to childcare vouchers, home-electronic scheme giving you discounted prices for home –electronics, salary sacrifice for cars and access to staff discount for local restaurants and gyms. So while we aim to continue improving, you can improve your skills too - within a professionally challenging yet exciting environment.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly committed and motivated individual to join our team of haematologists in providing general and BSH level 2b care in Haemato-oncology for North Northamptonshire and neighbouring areas.&lt;/p&gt;\n&lt;p&gt;The post you are applying for will be subject to satisfactory DBS Check, Occupational Health clearance and all other pre-employment checks that are required by the Trust.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the GMC specialist register or within 6 months of obtaining a CCT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Candidates are encouraged to attend an informal visit. Potential applicants interested in further discussion of the post may contact Dr Mark Kwan, Consultant Haematologist or Gwyn McCreanor, Clinical Director Pathology, Haematology and Oncology via their secretaries:&lt;/p&gt;\n&lt;p&gt;Dr Gwyn McCreanor&lt;/p&gt;\n&lt;p&gt;Consultant Clinical Biochemist&lt;/p&gt;\n&lt;p&gt;Clinical Director, Pathology / Clinical Haematology and Oncology Directorate&lt;/p&gt;\n&lt;p&gt;Tel 01536 493731 (sec)&lt;/p&gt;\n&lt;p&gt;Dr Mark Kwan&lt;/p&gt;\n&lt;p&gt;Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;Kettering General Hospital NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Tel 01536 492629 (sec)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243932", "validThrough": "2020-11-24T23:59:59+0000"}