{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T08:16:36+0000", "description": "&lt;p&gt;Prescott House CMHT, a fast paced, friendly, welcoming achieving CMHT in Salford is looking for motivated, forward thinking Band 6 Registered Mental Health Nurses&#39; to join us.&lt;/p&gt;\n&lt;p&gt;We are a friendly and supportive team who recognise that staff&#39;s health and well being is a priority, we promote staff development and it is an excellent opportunity to expand knowledge base and experience in the field of mental health.&lt;/p&gt;\n&lt;p&gt;This post looks for experience of working within mental health in a community setting, however consideration will be given to candidates who have experience and transferable skills from other areas.&lt;/p&gt;\n&lt;p&gt;This post provides a challenging opportunity to work within an established fully integrated supportive Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint individuals who will work proactively with service users and their carers, within a multi-disciplinary setting.&lt;/p&gt;\n&lt;p&gt;You will hold and manage a caseload of people and have Care Coordinating responsibilities under the Care Programme Approach Guidelines. By assessing your clients and carers needs you will be able to access and sign post to a wide range of community resources and provider services available in Salford. The post holder will be expected to participate in providing quality first line psychosocial assessments as part of GMMH’s Functional CMHT’s duty role and work proactively in forging professional working relationships with multi-agencies. There is an expectation to work weekends /BH’s as part of GMMH’s Acute Care Pathway provision of care. This is on a rota basis between the four community teams.&lt;/p&gt;\n&lt;p&gt;The post is challenging and rewarding and the successful candidates will enjoy an excellent practitioner experience within a large and friendly team.&lt;/p&gt;\n&lt;p&gt;They will also receive regular supervision and developmental appraisal thus enhancing your current practice and future career prospects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary SleemanJob titleSenior Practitioner for Mental HealthEmail addressMary.sleeman@gmmh.nhs.ukTelephone number01613571202Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mary Sleeman ( Senior Practitioner for Nursing) 0161 357 1202&lt;/p&gt;\n&lt;p&gt;Tracey Booth ( Team Manager) 0161 357 1202&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prescott House CMHT, Worsley", "postalCode": "M280ZA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5258", "longitude": "-2.41137"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245713", "validThrough": "2020-11-11T23:59:59+0000"}