{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T16:01:24+0000", "description": "&lt;p&gt;If you’re looking for a role where you can develop your existing skills and learn something new every day, then this may be the role for you&lt;/p&gt;\n&lt;p&gt;We have an exciting fixed term / secondment opportunity for 12 months for a talented Senior support worker to assist in establishing the hep c service across Lancashire and South Cumbria focusing on working within hard to reach communities in differing settings including a clinical van and within our local prisons.&lt;/p&gt;\n&lt;p&gt;This post has some potential for agile working due a mix of base across 4 provider trusts, various community settings and third party settings and on a clinical van. An office base has been identified and this will shared and rostered within the team - Please see Agile working policy attached.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Substantial experience (minimum 3 years) at band 3 in a related setting or prison is essential for this role. You should ideally be qualified at NVQ level 3 in a health related subject .We are looking a senior support worker with a real passion for developing clinical skills and pathways in an environment that is ever changing. You must be self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to working in a wide range of situations.&lt;/p&gt;\n&lt;p&gt;You must have a flexible approach working within a team that encourages new ideas and opinions on how to improve the service.&lt;br /&gt;The role is specific to hepatitis C management working as part of the wider Hepatology teams across Lancashire and South Cumbria. You will assist the Registered Nurses in establishing outreach services within multiple settings across the region including accessing difficult to reach populations via a clinical van, homeless shelters, community kitchens and prisons.&lt;/p&gt;\n&lt;p&gt;The Lancashire and South Cumbria ODN will offer training and development within our friendly and supportive multidisciplinary team to develop this role&lt;/p&gt;\n&lt;p&gt;The role will also involve some administrative and clerical duties related directly to hepatitis C including the collecting and recording of data on electronic databases and candidates should be familiar with the use of Microsoft Office, particularly Excel spread sheets&lt;/p&gt;\n&lt;p&gt;Car owner / driver is essential&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;Jane Grassham – Project Manager – jane.grassham@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Ioannis Gkikas – Clinical lead – Ioannis.gkikas@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane GrasshamJob titleproject ManagerEmail addressjane.grassham@elht.nhs.ukTelephone number07763440181&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Accrington Victoria Hopsital - But will work across Lancashire and Cumbria Sites, Across Lancashire and Cumbria Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Senior Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258474", "validThrough": "2020-11-13T23:59:59+0000"}