{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-06T12:16:06+0000", "description": "&lt;p&gt;Be part of an exciting Change Programme to improve our working processes and patient care by helping clinicians have the right information, in the right place and at the right time. We are looking for individuals who are enthusiastic to learn, have a positive attitude, are willing and have a can-do mind set.&lt;/p&gt;\n&lt;p&gt;MTW is committed to rolling out a full Electronic Patient Record, including order communications and test results, e-prescribing, clinical documentation and Sunrise Mobile Care. It will deploy Emergency Care in its A&amp;E department and Sunrise Surgical Care in theatres.&lt;/p&gt;\n&lt;p&gt;The configuration role will involve helping to configure the Sunrise system to support clinicians’ work processes. The way of working will focus on proactively engaging with clinical and operational staff across all functional areas of the new Electronic Patient Record System (EPR) supplied by Allscripts. They will be involved with you to inform the design of the system.&lt;/p&gt;\n&lt;p&gt;You will be learning how to design, configure and test the new Electronic Patient Record System (EPR) supplied by Allscripts.&lt;/p&gt;\n&lt;p&gt;Please be aware when you apply for the Configuration roles that attending the Sunrise Clinical Manager Configuration training will be an essential part of the role. We want to ensure that you are fully equipped to take on this role with the support from the Allscripts technical lead.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The project office is in Magnitude House, New Hythe Lane, Larkfield, Kent, ME20 6WT. However, the nature of the work will require working closely with the users and will involve travelling to Maidstone and Tunbridge Wells Hospitals.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Wednesday 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: Friday 27th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJason HallJob titleConfiguration ManagerEmail addressjasonhall3@nhs.net&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Magnitude House, Larkfield", "postalCode": "ME20 6WT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3162", "longitude": ".456462"}}, "title": "EPR Configuration Analyst - Internal Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259613", "validThrough": "2020-11-18T23:59:59+0000"}