{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5 / 6 equivalent dependent on experience"}}, "datePosted": "2020-10-08T16:44:40+0100", "description": "&lt;p&gt;&lt;strong&gt;Perioperative Practitioner | Theatres | Band 5 / 6 dependent on experience | Parkway | Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Parkway have an exciting opportunity for a perioperative practitioner to join their team on a full-time basis.&lt;/p&gt;\n&lt;p&gt;Spire Parkway Hospital in Solihull, West Midlands offers a comprehensive range of private hospital services. Our hospital is rated Good by the CQC for all parts of the inspection except for Patient Care, which is rated Outstanding. The report states, “Staff treated patients with compassion and kindness, respected their privacy and dignity, took account of their individual needs, and helped them understand their conditions. They provided emotional support to patients, families and carers.”&lt;br /&gt; &lt;br /&gt; Our dedicated hospital team are passionate about excellent patient care and we offer a range of specialist treatments to patients across Birmingham, Warwickshire and the West Midlands. This includes diagnostic services, rehabilitation, cutting-edge surgical procedures and excellence in specialist fields like orthopaedics, women’s health and cancer care. We have 51 bedrooms and five operating theatres.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within a highly supportive as a perioperative practitioner at Spire Parkway you will be responsible for providing excellent patient care to a range of surgical patients. You will scrub for a range of surgeries including ENT, Thyroid and Maxfacs. You will be required to order and store specialised kits used for these types of surgeries. You will keep preference cards for the surgeons and keep these up to date with any changes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be a qualified Nurse or ODP with a valid registration with no restrictions or conditions.&lt;/li&gt;\n&lt;li&gt;You must have previous scrub experience within ENT and other specialities would be a bonus&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Rebecca O’Neill on Rebecca.o’neill@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Solihull", "postalCode": "B91 2PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4219", "longitude": "-1.76313"}}, "title": "Perioperative Practitioner – ENT and General Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219167", "validThrough": "2020-11-08T23:59:59+0000"}