{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc. Fringe HCAS"}}, "datePosted": "2020-10-27T10:04:06+0000", "description": "&lt;p&gt;An excellent opportunity has arisen to come and be part of our dynamic and forward thinking Occupational Therapy service. As a service we have developed innovative ways of delivering occupational therapy in the Community Mental Health Recovery Services to support people in their individual recovery journey including a variety of occupationally focused programmes. The post will include delivering both individual and group occupational therapy interventions within a clear care pathway, these interventions include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Occupation Matters Programme – a 20-week group which utilises Lifestyle Redesign© principles. This programme was developed within the Trust and has had a really positive impact on the lives of people who access our services&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Recovery through Occupation – 6-week group which uses the Re-Motivation process to improve an individual’s motivation and social skills. Participants make significant improvements on the Volitional Questionnaire during this intervention. This is co-facilitated with Community Connections&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;New Horizons – our occupational therapy led discharge pathway enabling people to reconnect with their communities and previous roles to support a smooth transition from secondary services&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Individual occupational therapy&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Comprehensive occupational therapy assessments&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We use Model of Human Occupation to guide all our occupational therapy assessments and interventions. We are particularly focusing on embedding occupational science and neuroscience into our practice this year.&lt;/p&gt;\n&lt;p&gt;The occupational therapy leadership team is committed to an extensive, co-ordinated CPD programme including a robust supervision structure, care group meetings, Trust wide and core competence training and an annual conference. Staff are valued for their expertise in occupationally focussed interventions and specialist group therapy.&lt;/p&gt;\n&lt;p&gt;This post is suitable if you have had previous experience of working in mental health, you want to consolidate your knowledge of occupational therapy and be involved in delivering high quality, evidence based, outcome measured occupational therapy interventions. This post also gives you an opportunity to develop skills in care coordinating service users with an occupational therapy focus and being part of the assessment team - 50% pure occupational therapy and 50% providing care coordination for people who have occcupational needs. .&lt;/p&gt;\n&lt;p&gt;Surrey and Borders Partnership NHS Foundation Trust (SABP) is one of the largest Mental Health Trusts in the South East working collaboratively with health, social care and voluntary organisations. We also work in partnership with university colleagues to develop research projects and funding streams.&lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licence.&lt;/p&gt;\n&lt;p&gt;Full time hours are 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;If you are creative, committed to lifelong learning, good at using your initiative and are committed to providing a high quality occupational therapy with recovery on your agenda, then apply today.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Do check out the you tube link and see our OTs talking about why they love working at SABP!&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Theta Building, Lyon Way, Frimley, Camberley", "postalCode": "GU16 7ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3164", "longitude": "-.747554"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243944", "validThrough": "2020-11-12T23:59:59+0000"}