{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T17:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse, Adult Intensive Care, Oxford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities available on&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Adult Intensive Care Unit, John Radcliffe Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;and&lt;strong&gt; Churchill Intensive Care Unit, Churchill Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have vacancies within both our general adult intensive care unit (AICU) and our specialist intensive care unit (CICU). Both areas offer work that is varied and exciting and provide a challenging but supportive environment in which to build your critical care career. To enable you to gain a diverse range of experience the opportunity to rotate between the two units is available.&lt;/p&gt;\n&lt;p&gt;The general intensive care is located at the John Radcliffe Hospital, the major trauma centre for the Thames Valley. AICU is a sixteen bedded tertiary referral unit which takes a diverse mix of admissions from the wards and the emergency department. It also supports elective spinal and vascular surgery.&lt;/p&gt;\n&lt;p&gt;CICU is an eight bedded purpose built unit located in the Cancer and Haematology Centre on the Churchill site where we look after a wide range of patients with complex medical and surgical conditions, including Haematology, Renal, GI and Head and Neck specialties. We accept emergency and elective admissions and are a tertiary referral centre. We support one of the largest transplant centers in Europe, caring for patients following kidney- pancreas and bowel transplants.&lt;/p&gt;\n&lt;p&gt;For graduate (newly qualified) nurses we offer a 1 year Foundation Programme. The first year comprises of the Critical Care Foundation Programme and the second year is aimed at developing your leadership and mentoring abilities. Our next Critical Care Foundation Programme is due to start in September 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Critical Care Foundation Programme will provide you with the foundation required for a career in adult intensive care nursing. This predominately competency based programme includes an extensive orientation programme and fully supported supernumerary period in which you work with a mentor. This is followed by a buddy period to ensure you always feel supported as you put theory into practice.&lt;/p&gt;\n&lt;p&gt;For those who have ICU experience we will tailor make a development package to suit your learning needs. This will include study days and clinical support from our dynamic education team. We also offer you an extensive orientation package and fully supported supernumerary period in which you work with a mentor.&lt;/p&gt;\n&lt;p&gt;Following on from the Foundation Course we are proud to offer a supportive environment which provides an extensive ongoing development programme. This includes a Post Graduate Certificate in Adult Intensive Care Practice, and a comprehensive supported leadership programme comprising of study days and clinical support to help you progress to a Band 6. We also offer a range of development and learning opportunities through the use of simulation and specialist courses to equip you with the knowledge and skills required to care for the complex patient population within the Oxford ICUs. Currently following the course and given certain conditions are met an additional pay premia of 10% is applied to basic salary.&lt;/p&gt;\n&lt;p&gt;To assist you in your career in intensive care it may be an advantage to have acute nursing experience prior to application however, it is not essential. We look for enthusiasm and a desire to provide high quality care for critically ill patients and an ability to work as part of our dedicated and ever developing team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMelissa LovellAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit for AICU please contact Senior Sister Melissa Lovell (melissa.lovell@ouh.nhs.uk) or call AICU on 01865 220625&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit for CICU please contact Senior Sister Clare Morris (clare.morris@ouh.nhs.uk) or call CICU on 01865 235078&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe and Churchill Hospitals, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243528", "validThrough": "2020-11-15T23:59:59+0000"}