{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890"}}, "datePosted": "2020-10-16T09:32:44+0100", "description": "&lt;p&gt;We have an ideal opportunity for an enthusiastic and motivated pharmacist to join us at the Royal Devon &amp; Exeter Hospital. The RD&amp;E is a top-ranked NHS Trust and teaching hospital that provides a full range of acute hospital services to the people of Devon that has just gone live with a new electronic prescribing system as part of the MY CARE programme which is increasing the involvement and engagement of patients, carers and staff, transforming clinical services and care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a development role with plenty of learning opportunities within a welcoming, committed and aspiring department, with a strong team-working and patient-focused culture that will allow you to improve your medicines expertise and work at the cutting edge of patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be part of a team of rotational pharmacists covering a range of clinical and core services. You will gain a wide range of experience including dispensary, aseptic services, community services, medicines information and on call duties. Clinical duties will include cardiology, respiratory, trauma and orthopaedics, gastroenterology, acute medicine, acute surgery, care of the elderly. Learning from our senior and specialist pharmacists and alongside our team of experienced medicines management technicians.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The successful candidate will benefit from our in-house training programme. This will be supplemented by support for an appropriate postgraduate qualification such as clinical certificate or diploma aligned with development against the Foundation Pharmacy Framework. &lt;br /&gt; &lt;br /&gt; This role also involves on-call duties and weekend and bank holiday rosters. &lt;br /&gt; &lt;br /&gt; Hours: 37.5 + on-call duties.&lt;/p&gt;\n&lt;p&gt;Salary: £31,365 - £37,890 (+ payment for on-call duties)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details please contact: Marco da Matta Coelho, Patient Services Clinical Pharmacist on (01392) 404809.&lt;/p&gt;\n&lt;p&gt;This post has been identified as involving access to vulnerable adults and/or children and in line with Trust policy successful applicants will be required to undertake a Criminal Records Bureau Disclosure Check/Enhanced Disclosure Check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that you will be notified via email regarding the result of your application. Interviews will take place on &lt;strong&gt;Tuesday 24th of November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Rotational Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229457", "validThrough": "2020-11-15T23:59:59+0000"}