{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-29T12:31:05+0000", "description": "&lt;p&gt;The North Wales Cancer Treatment Centre (NWCTC) is part of Glan Clwyd Hospital on the North Wales coast close to Snowdonia with excellent access to Chester, Liverpool and Manchester. The NWCTC provides a wide range of cancer services for adult oncology and haematology patients including complex chemotherapy, chemo-radiotherapy, radiotherapy, clinical trials and immunotherapy treatments.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and forward thinking individual to lead an established dedicated team of clinical pharmacists in the NWCTC Pharmacy.&lt;/p&gt;\n&lt;p&gt;The successful applicant will lead, promote and support the continued development of integrated clinical pharmacy services and patient care to cancer patients in the inpatient, outpatient, daycase and home care settings.This will be achieved through team leadership, multidisciplinary and collaborative working, while working closely alongside the Cancer Services Lead Pharmacist for North Wales, and the Pharmacy Production Services Team Leader.&lt;/p&gt;\n&lt;p&gt;Research and development opportunities will be available and we actively encourage career progression by offering funded places on the Independent prescribing course and the Advanced Clinical Practice MSc.&lt;/p&gt;\n&lt;p&gt;You should have a significant amount of post registration experience in hospital pharmacy in oncology and haematology and experience of leading a team is highly desirable.&lt;/p&gt;\n&lt;p&gt;This is a full-time permanent post (37.5 hours) although part-time hours (30 hours or more) would be considered.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rhys Davies Patient Safety Lead Pharmacist&lt;/p&gt;\n&lt;p&gt;rhys.davies4@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01745 448788 ext.3789 or 07557 312856&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glan Clwyd Hospital, Bodelwyddan", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Cancer Centre Lead Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248319", "validThrough": "2020-11-12T23:59:59+0000"}