{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-29T13:46:41+0000", "description": "&lt;p&gt;We are inviting applicants for a full time consultant radiologist with specialist head and neck &amp; neuro imaging skills. The successful candidate will be able to develop their career at one of the largest teaching hospitals, with opportunities for research, education at all levels, and radiological innovation. The Head and Neck imaging workload will be diverse, but will include CT and MRI staging / follow, petrous bone and cochlear implant imaging, sinus imaging, sialography and TMJ / other maxillo-facial imaging. The post holder will be responsible for the weekly head and neck MDT, and there will be the option to undertake some fluoroscopy / video swallow work if desired. Neck ultrasound experience would also be very valuable. Time will be divided with the diagnostic neuro radiology service providing a full range of imaging to the Wessex Neurologiacl Centre and supporting the skull base MDT.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is a major centre for teaching/ research in association with the University of Southampton, offering opportunities for undergraduate /postgraduate teaching, and partners including the Medical Research Council and Wellcome Trust with excellent facilities for research and clinical care. The Hospital treats around 112,000 inpatients/ day patients, including about 50,000 emergency admissions, approximately 375,000 people at outpatient appointments/around 110,000 cases in the Emergency Department.&lt;/p&gt;\n&lt;p&gt;Southampton has a busy head and neck cancer service treating patients from the local area plus Salisbury, Winchester and the Channel Islands. All patients are discussed in a weekly MDT and seen and treated by comprehensive and cohesive team of maxillofacial, ENT and onco-plastic surgeons, oncologists, SALT, dieticians and CNSs. The MDT benefits from specialist radiology and histo-pathology expertise. UHS is a high recruiting centre for national head and neck cancer trials and for commercial studies of new chemotherapy agents. The Head &amp; Neck Radiology service is currently provided by a lead ENT radiologist&lt;/p&gt;\n&lt;p&gt;The Wessex Neurological Centre provides a dedicated, integrated 24 hour acute neurosurgical and neurological assessment, investigation and treatment service to adults and children of the former Wessex Region, West Sussex and the Channel Islands. Southampton is a Multitrauma centre, and neuoradiologists support imaging of brain and spinal trauma.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The job will involve reporting benign and oncological ENT imaging studies (CT &amp; MRI staging investigations, cochlear implant imaging, sinus imaging maxillofacial imaging, sialography) including inpatient / emergency work. The successful applicant will support the head and neck MDT meeting (with support from colleagues in oncology radiology) and have involvement in the skull base MDT meeting. They will work closely with clinicians in the relevant specialties and provide consultations and imaging reviews as part of their job plan. Ideally, the post will also involve neck ultrasound lists and associated FNA / biopsy procedures.&lt;/p&gt;\n&lt;p&gt;Involvement with the Diagnostic Neuroradiology service would include general reporting as well as participation in the on call rota for the Wessex Neurological Centre and the trust as a whole. Subspecialist interests could be developed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a consultant radiologist with subspecialist head and neck &amp; neuro radiology experience and associated procedures is also desirable. The applicant should demonstrate organisational, communication and professional skills to a level to effectively undertake the consultant role. They should have enthusiasm for teaching and be able to work well in a team&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;Job Reference: MT0365 - This vacancy closes on or before: 15th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Alex King&lt;/p&gt;\n&lt;p&gt;Consultant Radiologist&lt;/p&gt;\n&lt;p&gt;alex.king@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 8388&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Jason MacDonald&lt;/p&gt;\n&lt;p&gt;Consultant Radiologist&lt;/p&gt;\n&lt;p&gt;jason.macdonald@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Consultant radiologist - head &amp; neck &amp; neuroradiology service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248555", "validThrough": "2020-11-15T23:59:59+0000"}