{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum pro rata"}}, "datePosted": "2020-10-30T13:45:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Substantive Consultant, Intensive Care Medicine, Adult Critical Care Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job reference number; 290-CONA304R&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to substantiate existing locum consultant posts and expand our team; There is ongoing work within the directorate to undergo transformation and a potential expansion plan. Imperial College Healthcare is the largest sector provider for Intensive Care in North West London and the advertised posts are across 2 main hospital sites: St Mary’s Hospital, Charing Cross Hospital . The case mix on each site within Imperial College Healthcare NHS Trust varies, but is heavily biased towards complex and emergency work. Whilst appointments will be made for a specific site base, appointments are to the Trust, and there will be an opportunity for Consultants to move between sites, whether to gain clinical or leadership experience. It is anticipated that in addition to substantive posts further locum posts will also be offered. Where consultants practice in a base specialty outside of Intensive Care the Trust will work to support appointees in continuing to practice within this area. Configured for full time working these posts will attract 10-11 PAs, and it is anticipated that with Core, Educational and Governance components PAs posts will attract a minimum of 2.0 SPAs.&lt;/p&gt;\n&lt;p&gt;Charing Cross hospital is a leading specialist centre in Neurosciences including stroke with an acute cerebrovascular thrombectomy service, complex Head and Neck surgery, Urology, Cancer, General Medicine and a busy Emergency Department. The Intensive Care unit on this site has 24 beds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hammersmith Hospital provides cardiothoracic and cardiology services, haem-oncology, haematology, upper GI and hepatobiliary surgery and is the site of the Queen Charlotte’s Hospital specializing in women’s health and the North West London Renal Centre. The Intensive Care unit on this site has 32 beds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Mary’s Hospital a Major Trauma Centre with tertiary and quaternary Vascular Surgery, Acute Abdominal Surgery, Paediatrics General Medicine and a busy emergency department. The Intensive Care unit on this site has 32 beds.&lt;/p&gt;\n&lt;p&gt;Maximising GPICSv2 compliance is a priority of the Trust. The units are all widely compliant with the latest GPICS guidance generally, and these appointments coincide with a workforce expansion and transformation designed to ensure consultant and resident staffing is fully compliant, and on the most acute sites established resident staffing exceeds the standards set in GPICS. The transformation work includes expanding ICU follow-up. All units were rated “Good” by the CQC in 2019, and have achieved very positive feedback in peer reviews.&lt;/p&gt;\n&lt;p&gt;All units within our directorate are busy, friendly departments fully accredited for training in Intensive Care Medicine with an expanding research profile led by an academic team and Professors Anthony Gordon and Steve Brett, which has been independently rated as one of the top 10 departments for Critical Care research in the world. There are many opportunities for appointees to become involved in research, education, simulation, governance, management, and quality improvement within the department and several colleagues have been principle investigators in prominent studies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All of the intensive care units are fully computerised and our systems assist in audit and quality improvement as well as research. Imperial College Healthcare NHS Trust has a close working relationship with Imperial College London, one of the world’s leading academic institutions. Hammersmith Hospital is situated in West London with excellent transport links and easy access to Central London.&lt;/p&gt;\n&lt;p&gt;Closing date- 15th November 2020&lt;/p&gt;\n&lt;p&gt;Online applications only and late applications will not be accepted&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Sohna Njie on 0203 312 6129 or at s.njie@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Consultant in Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250389", "validThrough": "2020-11-15T23:59:59+0000"}