{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45998", "minValue": "40074", "unitText": "YEAR", "value": "£40,074 - £45,998 per annum"}}, "datePosted": "2020-10-23T16:01:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Number: &lt;/strong&gt;919-SH-13087303-EXT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Diet, Obesity and Physical Activity&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£40,074 - £45,998 per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; Wellington House, London&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: &lt;/strong&gt;10 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;19/20 November 2020 (MS Teams)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Nutrition Advice, Senior Nutrition Scientist (SEO)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;The Diet, Obesity and Physical Activity (DOPA) division is seeking to recruit a senior nutrition scientist to work within the Nutrition Advice team.&lt;/p&gt;\n&lt;p&gt;The post requires an experienced individual with a good understanding of the role of food and nutrition in health. Previous experience of policy development and an understanding of this in relation to public health is also important.&lt;/p&gt;\n&lt;p&gt;The role will support the development, assessment and delivery of nutrition advice to a range of stakeholders including other PHE teams, Other Government Departments, Local Authorities (via PHE centres), voluntary and industry sectors, and the public.&lt;/p&gt;\n&lt;p&gt;The post holder will need to have excellent organisational and project management skills and have experience of working in a fast paced and pressured environment. With a graduate or postgraduate degree in nutrition or closely related subject, the post holder will also have excellent written and oral communication and delivery skills.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To find out more about how we champion diversity and inclusion in the workplace, visit: PHE Website&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute of Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate consultation prior to any formal transfer taking place.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Elizabeth Tydeman on elizabeth.tydeman@phe.gov.uk (0207 654 8488).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Senior Scientific Officer (Nutrition Advice)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241220", "validThrough": "2020-11-10T23:59:59+0000"}