{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a inc HCA"}}, "datePosted": "2020-11-04T11:46:24+0000", "description": "&lt;p&gt;Evelina London Children’s Hospital is at the heart of a network of children’s health services across South East England, and the first children&#39;s hospital to be rated &#39;Outstanding&#39; by the Care Quality Commission. We provide a comprehensive range of children’s healthcare services and we continue to evolve and grow, transforming our services. So come and meet us and let us transform your career.&lt;/p&gt;\n&lt;p&gt;Snow Leopard provides a unique service looking after children who are on Long Term Ventilation, Neurorehabilitation or under the Children Sleep medicine department.&lt;/p&gt;\n&lt;p&gt;We have six &lt;strong&gt;Long Term Ventilation&lt;/strong&gt; beds and as a unit we pride ourselves on creating Home from Home environment, helping to ease the move from hospital to home for long-term ventilated children and their families.&lt;/p&gt;\n&lt;p&gt;We have two &lt;strong&gt;Neurorehabilitation&lt;/strong&gt; beds, offering a programme of inpatient rehabilitation to children and young people up to 16 years of age with acquired brain and spinal cord injuries. Our focus is to develop or regain skills to minimise the impact of a brain or spinal cord injury on their everyday life.&lt;/p&gt;\n&lt;p&gt;We have five &lt;strong&gt;Children’s Sleep Medicine beds&lt;/strong&gt;. We work closely with our colleagues in the Children’s Sleep Medicine Department to support them in providing a range of sleep evaluations, from simple diagnostics to complex sleep studies. The department is one of the busiest in the UK.&lt;/p&gt;\n&lt;p&gt;Are you looking for the opportunity to work autonomously? Would you like to develop leadership skills? Would you like to work closely with Long Term Patients, creating Home from Home Environment? Is expanding/gaining new knowledge about Ventilation, something you would like to achieve? Come and join us!&lt;/p&gt;\n&lt;p&gt;We are looking for a nurse who has experience in being in charge of a ward or a ward area and is looking for their next step on their career pathway. If you feel that you have limited specialist experience and would like a chance to expand your knowledge, we are able to support you in your career as we are privileged to have an inspirational team of Clinical Educators and Clinical Nurse Specialists who will help you bridge that gap and make you the highly skilled senior nurse that you know you can be. You will be allocated supernumerary period to ensure that you feel confident and competent in your new role.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;We can also offer this post to an experienced Band 5&lt;/strong&gt;&lt;/span&gt; who is not ready yet for Band 6- but is willing to come to us, and develop skills within our department to become a Band 6 Senior Staff Nurse. These candidates will need around 18 months of experience in paediatrics.&lt;/p&gt;\n&lt;p&gt;We have a reputation for running a dynamic nurse led, patient cantered service, where research, ideas and individuals are valued. We actively encourage staff development through education programmes and in-house training and provide training in all areas of the specialties we look after on Snow Leopard.&lt;/p&gt;\n&lt;p&gt;Have we interested you in the post?&lt;/p&gt;\n&lt;p&gt;Unfortunately we cannnot offer informal visit, but we could schedule a phone call so that we can talk to you about the opportunities our ward can offer, and answer any questions you may have.&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you!&lt;/p&gt;\n&lt;p&gt;Closing Date - 23 November, 2020&lt;/p&gt;\n&lt;p&gt;Interview Date- 01 December, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEwa BenevidesAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact&lt;/p&gt;\n&lt;p&gt;Lead Nurse- Ewa Benevides at ewa.benevides@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Clinical Educator Emma Whitombe at Emma.Whitcombe@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas&#39; Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Senior Staff Nurse - Snow Leopard Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255677", "validThrough": "2020-11-23T23:59:59+0000"}