{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata, per annum"}}, "datePosted": "2020-10-29T12:00:55+0000", "description": "&lt;p&gt;The Stroke Early Supported Discharge Team in Trafford General Hospital is looking to recruit a dynamic full-time band 7 Occupational Therapist with previous experience of working within a multidisciplinary stroke team in the acute or community setting.&lt;/p&gt;\n&lt;p&gt;You will be working as part of a dynamic, multidisciplinary team, alongside experienced Physiotherapists, Occupational Therapists, and rehabilitation assistant staff, to provide an integrated approach to address the stroke service users’ holistic needs.&lt;br /&gt;&lt;br /&gt;Experience of working with stroke patients, and confidence in working collaboratively within a multi-disciplinary team, whilst possessing excellent clinical and communication skills are essential. The team will provide in reach and specialist rehabilitation post discharge for stroke patients of all complexity levels within a number of settings including the home environment, nursing or residential homes.&lt;/p&gt;\n&lt;p&gt;The post holder will be treating patients on the community Stroke ESD service but may cover and support with in-patients on the Trafford General Hospital’s Stroke ward when needed.&lt;/p&gt;\n&lt;p&gt;You will be required to work 37.5 hours per week Monday – Friday.&lt;/p&gt;\n&lt;p&gt;You will be self-motivated and able to work both independently and as part of a team. You will have relevant post qualification experience and should be keen to further develop your experience in Community Stroke Rehabilitation&lt;/p&gt;\n&lt;p&gt;The post holder must have the ability to travel to different geographic locations either through use of a car or access to a means of mobility to travel across the Trust footprint in line with service needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSen KuppuswamyJob titleClinical Lead Occupational TherapistEmail addresssenthil.kuppuswamy@mft.nhs.ukTelephone number0161 746 2109&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trafford General Hospital, Manchester", "postalCode": "M41 5SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4541", "longitude": "-2.37068"}}, "title": "Senior Specialist Occupational Therapist / Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248228", "validThrough": "2020-11-08T23:59:59+0000"}