{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19797", "unitText": "YEAR", "value": "£19,797 - £21,142 pro rata"}}, "datePosted": "2020-11-03T09:16:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Contract: Fixed term/Secondment until end of June 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 30 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you wish to apply for this role on a secondment basis please seek permission from your current line manager before applying for the position.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic person with recent secretarial experience to join the Secretarial Team at York Teaching Hospital. You will provide support to the Medical Secretaries and their Consultant teams within the Gastro-Intestinal sub-specialty of General Surgery.&lt;/p&gt;\n&lt;p&gt;Excellent administration/secretarial skills and audio-typing qualifications are vital, as well as a good understanding of customer relations. You will regularly be required to deal with queries from patients, consultants and GPs.&lt;/p&gt;\n&lt;p&gt;You will be responsible for typing clinical and administrative letters, answering telephone enquiries and dealing with patient referral queries, as well as covering the Medical Secretaries during periods of absence. Other responsibilities will be the diary management for the Consultant Surgeons and general administrative tasks, including recording information from Multi Disciplinary Team meetings.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work well under pressure, with the ability to prioritise the demands of a busy office and manage their time and workload effectively. They will also be required to work unsupervised and communicate with Consultant Surgeons on a regular basis. Audio-typing qualifications are essential and knowledge of medical terminology would be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not reapply. Please note, the vacancy may close early if significant numbers of applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Denise Goodwin, Service Manager&lt;/p&gt;\n&lt;p&gt;denise.goodwin@york.nhs.ukTelephone&lt;/p&gt;\n&lt;p&gt;01904 724068&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Kimberly Wright&lt;/p&gt;\n&lt;p&gt;01904 724186&lt;/p&gt;\n&lt;p&gt;Kimberly.wright@york.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Assistant Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253259", "validThrough": "2020-11-17T23:59:59+0000"}