{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-28T09:45:17+0000", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals Plymouth NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Title: Consultant Interventional Radiologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please apply via NHS Jobs, uploading your CV.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A post is now available for an Interventional Consultant Radiologist to join our team here at University Hospitals Plymouth. This post is necessary to meet the increasing demand for image guided therapy, to contribute to the establishment of a viable on-call rota and to support the major trauma status of the Hospital. The post will be based within Derriford Hospital, which is a major teaching hospital located on the outskirts of the city of Plymouth and is part of Plymouth Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;Most of the regional specialist units are located in the Hospital, including GI, Hepatology, Urology, Cardiothoracic and Neurosurgery. The hospital was declared a Major Trauma Centre in the early part of 2012. The Peninsula Radiology Academy Radiology is situated a short distance from the site and provides an excellent environment for teaching. Strong links to the University of Plymouth provide excellent opportunities for research.&lt;/p&gt;\n&lt;p&gt;The successful applicant will complement a team of 4 existing interventional radiologists to deliver a broad range of procedures. There is the opportunity to contribute to the development of subspecialist intervention in oncology, the provision of services to the Trauma Centre as well as vascular intervention. The department currently has 2 interventional rooms but plans for a purpose designed interventional theatre are well under way with a completion of the autumn of 2021.&lt;/p&gt;\n&lt;p&gt;There has been financial investment into the Department within last three years to upgrade its CT, a specific CT to service the emergency department, MRI, Ultrasound and Radiology with further investment planned over the next 3 years in a new Interventional suite composing of 4 theatres , Two new 3T MRI’s (March 2020).&lt;/p&gt;\n&lt;p&gt;All radiologists are provided with personal office equipped with individual PACS workstation and high speed internet access.&lt;/p&gt;\n&lt;p&gt;The successful candidate would contribute to the establishment of a viable IR rota whilst there are separate rotas for neuro- and general radiology.&lt;/p&gt;\n&lt;p&gt;The post offers the opportunity to live in an area of outstanding natural beauty with:&lt;/p&gt;\n&lt;p&gt;• Highly desirable country and executive properties at realistic prices&lt;br /&gt; • An excellent standard of education from both state and private schools&lt;br /&gt; • Good road and rail communications&lt;br /&gt; • Easy access to the moors and the coasts of Devon and Cornwall&lt;/p&gt;\n&lt;p&gt;Any person who is unable to work full time for personal reasons, will be eligible to be considered for the post. Changes to the job plan and content would be discussed on a personal basis if such a person was appointed, in consultation with Consultant colleagues. Suitably qualified job share candidates will receive proper consideration.&lt;/p&gt;\n&lt;p&gt;Candidates are welcome to visit the department.&lt;/p&gt;\n&lt;p&gt;Applicants must be eligible for inclusion on the Specialist Register or be within 6 months of your expected CCT in Radiology or equivalent at the time of the interview. Candidates are welcome to visit the Department and initial contact should be made with one of the following:&lt;/p&gt;\n&lt;p&gt;Dr Miladen Macanovic ( IR Lead) on 01752 432516 or the Service Line Radiology Manager on 01752 431577.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Undergraduate Medical Education&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Plymouth University Peninsular School of Medicine and Dentistry (PUPSMD) has been praised by the GMC for its innovative approach to undergraduate medical education. The curriculum is based around problem based learning and has been highly ranked by our graduates in how they felt prepared for postgraduate medicine. Your role will include important opportunities to engage with undergraduate education, in both the hospital environment and the school itself, to continue this vital job of producing tomorrow’s doctors and allied health care professionals&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Consultant Interventional Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245861", "validThrough": "2020-11-25T23:59:59+0000"}