{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum pro rata"}}, "datePosted": "2020-11-04T11:17:31+0000", "description": "&lt;p&gt;&lt;span&gt;As one of the largest and busiest NHS Trusts in the country, Portsmouth Hospitals NHS Trust is an organisation with great ambition. With a turnover of £600m, we employ a dedicated and committed workforce that is over 7,300 strong. Every day, this dedicated and committed workforce strives to provide excellent care for the communities we serve across South East Hampshire and beyond. The Trust is also a major provider of training and education to a wide range of health professionals and has a strong national Research and Innovation profile. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are delighted to have recently been rated “good” overall by the Care Quality Commission (CQC) following the most recent comprehensive inspection of the organisation in October and November 2019. Our improved overall rating and ratings of “good” for being well led and “good” for our use of resources demonstrates the positive progress made, against a backdrop of an increase in attendances and admissions. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;While we have made progress in many areas, we know that there is still more to do. We are currently in the process of selecting a strategic partner to work with us on the design and implementation of the ‘Delivering Excellence’ framework. &lt;/span&gt;&lt;span&gt;This will be our core operating model and forms the PHT approach to solidifying our improvement capability while embedding a Quality Management System within the organisation to support the next phase of our improvement.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Networked Services is a truly diverse Division, providing an exciting array of services that are arranged in 3 distinct Care Groups: Cancer service including the Regional Cancer Centre, Renal and Transplantation services and Women and Children’s services. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Networked Services Division is one of the largest Divisions in the Trust with an annual budget of almost £140m and almost 1,400 staff. &lt;/span&gt;&lt;span&gt;It is the lead Division for overseeing the delivery of the 9 key national cancer standards on behalf of the organisation and also includes the Wessex Kidney Centre which provides tertiary renal services across multiple sites.&lt;/span&gt;&lt;span&gt;Our busy maternity service delivers approximately 5,000 babies each year across 5 locations including homebirths.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As Divisional Operations Director you will work closely with the triumvirate team to deliver the effective integrated clinical, operation and financial performance of the Division. We provide services mainly from our site at the Queen Alexandra Hospital in Portsmouth; however, we don’t just cover Portsmouth. We provide services across South East Hampshire and the Isle of Wight, at a range of locations and in conjunction with our system partners. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As Divisional Operations Director you will be responsible for ensuring national and local targets are achieved, along with ensuring all aspects of people, performance and financial objectives are delivered as per the Divisional and Trust business plan. &lt;/span&gt;&lt;span&gt;You will provide strong leadership at a divisional level, ensuring that there are appropriate systems and processes in place to deliver objectives and drive forward the service to improve the operational effectiveness of the division. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As an experienced leader, you will bring a well-developed track-record of operational delivery in a complex acute setting alongside expertise in performance improvement and clinical transformation. You will join a fast-paced and hugely supportive team working within a highly rewarding environment.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;&lt;span&gt;We are utilising the services of Odgers Berndtson to assist in ourrecruitment to this role.If you are interested to learn more, please contact &lt;span&gt;helen.childs@odgersberndtson.com&lt;/span&gt; quoting the reference 80507&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;Friday 4th December 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Interview date:&lt;/span&gt;&lt;/strong&gt;&lt;span&gt; To be confirmed - January 2021&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Alexandra Hospital, Cosham, Portsmouth, Hampshire", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Divisional Operations Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255582", "validThrough": "2020-12-04T23:59:59+0000"}