{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30242", "minValue": "30242", "unitText": "YEAR", "value": "UPTO £30,242 (pro-rata)"}}, "datePosted": "2020-10-14T10:19:43+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Registered Nurse - Part Time – Renal Dialysis Unit&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you an NMC Registered Nurse seeking an exciting new opportunity to learn specialist skills in renal dialysis nursing?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;ORare you an NMC Registered Nurse with renal experience, looking to take your next career steps with the world’s largest provider of dialysis products and services?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whatever experience you can bring, with the right attitude and aptitude, we have an opportunity for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Who is Fresenius Medical Care?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are theleading provider of dialysis servicesto the NHS, operating57 partnership dialysis unitsthat together provide regular dialysis treatment to over3,500 NHS patients in the UK. We are part of a global company treating over325,000 patients worldwideacross3,815 clinics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We also operate 41 production sites on all continentsto provide dialysis products such as dialysis machines, dialysers and related disposables. 1 in every 2 of all dialysis machinesused around the globe are manufactured by Fresenius Medical Care and we are the 3rd largest medical devices company in the world.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a growing and ambitious company who invests in talent and creates an environment where you can grow too. Come on our journey with us, see your skills develop and be rewarded for the exceptional care you give!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What can we offer you?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Here at Fresenius Medical Care we provide excellent and continuous Training and Development throughout your career, supported by dedicated Clinical Teachers. On joining, you will enroll on our 8 week Fundamental Dialysis Programme, which is accredited by the European Dialysis and Transplant Nurses Association/European Renal Care Association. Thereafter, we continue to provide training and education opportunities which significantly exceed the CPD hours required for NMC revalidation, and help take your career to the next level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer a competitive salary UPTO £30,242 (pro-rata) – if you are offered less than the top end your salary will increase in guaranteed yearly increments until you reach it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Alongside this we offer a wealth of other fantastic benefits listed below (pro-rata):&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•No Sunday or Night Shift Working&lt;/p&gt;\n&lt;p&gt;•Company Pension Scheme&lt;/p&gt;\n&lt;p&gt;•Life Assurance&lt;/p&gt;\n&lt;p&gt;•33 Days Holiday (inclusive of 8 days bank holiday) increasing with service&lt;/p&gt;\n&lt;p&gt;•Christmas Day and New Year’s Day off&lt;/p&gt;\n&lt;p&gt;•Overtime (time and a half after completing full-time hours – 150 hours every 4 weeks)&lt;/p&gt;\n&lt;p&gt;•Paid Breaks&lt;/p&gt;\n&lt;p&gt;•Positive Attendance Vouchers (up to £200 bonus per year)&lt;/p&gt;\n&lt;p&gt;•Long Service Vouchers&lt;/p&gt;\n&lt;p&gt;•Refer a Friend Scheme (£1000 per referral if successful)&lt;/p&gt;\n&lt;p&gt;•Sick Pay&lt;/p&gt;\n&lt;p&gt;•Free Uniform&lt;/p&gt;\n&lt;p&gt;•Free Tea &amp; Coffee&lt;/p&gt;\n&lt;p&gt;•Free Flu Vaccine&lt;/p&gt;\n&lt;p&gt;•Free Christmas Meal&lt;/p&gt;\n&lt;p&gt;•Cycle to Work Scheme&lt;/p&gt;\n&lt;p&gt;•Sponsorship for training where applicable for career development&lt;/p&gt;\n&lt;p&gt;•EAP Portal – Confidential Employee Assistance Helpline with qualified counsellors 24/7&lt;/p&gt;\n&lt;p&gt;•IChoose – Employee saving scheme with great discounts including phone contracts&lt;/p&gt;\n&lt;p&gt;•Possible Relocation Allowance upto £4,000&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What does the role involve?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dialysis nursing requires commitment and passion along with the skills and competencies to juggle the technical nursing aspect whilst giving holistic care. You will be working autonomously, responsible for the assessment of care needs and the development, implementation and evaluation of care for dialysis patients with chronic kidney disease or acute kidney injury.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Scarborough Dialysis Unit operates 10 haemodialysis stations, serving up to 30 patients, in partnership with Hull &amp; East Yorkshire Hospitals NHS Trust using only the latest equipment.  Nursing is planned at a ratio of 1:4 patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a part time role of 23 hours per week. Current days are working various shifts between 6.30am to 6.00pm Monday/Wednesday/Friday and 6.30am to 12.30pm Tuesday/Thursday/Saturday.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nurse posts will be subject to an enhanced DBS Disclosure&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Fresenius Medical Care is an equal opportunities employer&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Fresenius Medical Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "SO53 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9814", "longitude": "-1.38891"}}, "title": "Registered Nurse - Part Time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225693", "validThrough": "2020-11-27T23:59:59+0000"}