{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T16:31:42+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;em&gt;&lt;strong&gt;For applicants within the Dorset ICS only&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Are you committed to protecting children and young people at risk, from harm or abuse? Dorset CCG have a secondment opportunity for 5 months for a specialist safeguarding nurse to support Primary Care and to attend Child Protection Conferences virtually to share and analyse health information.&lt;/p&gt;\n&lt;p&gt;The role of the specialist safeguarding nurse  is to provide support to the GP&#39;s in primary care in the quality assurance of safeguarding practice and also to represent health at Child Protection Case Conferences, of school aged children, where there is no health professional routinely engaged; to provide health information, analyse and interpret information, forwarding any actions to the school nursing service.You will need a good understanding of safeguarding practice at an operational level.&lt;/p&gt;\n&lt;p&gt;You will join our friendly team within the Quality Directorate which is committed to improving health outcomes and safeguarding our children and adults within Dorset. You will be based in Dorchester, need to be prepared to work virtually and travel across the county.This is a secondment for full time post, for five months, and will provide anyone interested in safeguarding to gain some experience. If  you would like further information please email Liz Plastow Head of Safeguarding liz.plastow@dorsetccg.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vespasian House, Dorchester", "postalCode": "DT1 1TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Safeguarding Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256667", "validThrough": "2020-11-18T23:59:59+0000"}