{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum - pro rata."}}, "datePosted": "2020-11-04T11:57:00+0000", "description": "&lt;p&gt;Ward 1 is a 19 bedded medical ward specialising in Respiratory Medicine. Our patients have a variety of complex respiratory conditions such as COPD, Asthma, lung cancer, pulmonary embolism, tracheotomy, pneumothorax and require a range of interventions such as chest drains, oxygen therapy, continuous positive airway pressure (CPAP) and non-invasive ventilation (NIV).&lt;/p&gt;\n&lt;p&gt;Ward 1 is a well led organised ward where you will receive 4 weeks supernumerary preceptorship and work alongside mentors to develop knowledge, confidence, competence and clinical skills. The ward is also supported by Respiratory Medical Consultants, and a number of clinical respiratory specialist nurses which affords learning within a supportive team environment. You will also have an opportunity to spend time and work alongside our divisional specialist teams, and other divisional teams such as critical care outreach to help link theory to practice to reward you with professional growth and career development.&lt;/p&gt;\n&lt;p&gt;This dynamic ward offers a great opportunity to develop high level skills in the field of respiratory nursing. We are looking for dynamic, highly motivated, compassionate and caring nurses with a thirst for knowledge and a desire to provide individual care for our patients to ensure we put our patients first. This is a fast paced and challenging area, dealing with advanced and complex care with an exceptional team.&lt;/p&gt;\n&lt;p&gt;Applicants should hold 1st level registration and we welcome and encourage applications from all specialities and this is also a great opportunity for newly qualified nurses to join our exceptionally friendly team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please contact Lisa Brookes on 01527 503030 ext 44960&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexandra Hospital Redditch", "postalCode": "B98 7UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2798", "longitude": "-1.91212"}}, "title": "Staff Nurse Respiratory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255696", "validThrough": "2020-11-18T23:59:59+0000"}