{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T13:16:42+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that NEL At-Risk candidates will be given priority consideration ***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a talented and experienced individual to lead on non-acute data analysis for the North Central London CCGs. The successful applicant will be responsible for interpreting and presenting detailed data to commissioners, and will develop new reports and modelling to support non-acute contract management and commissioning.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have experience of working with non-acute (mental health and/or community) data in the NHS, and will be a skilled analyst, adept at identifying patterns in data, who enjoys working with Excel and has strong SQL skills.&lt;/p&gt;\n&lt;p&gt;The post holder will be a proactive team player with strong communication skills, and will be able to foster strong working relationships with a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work across North Central London locations.&lt;/p&gt;\n&lt;p&gt;Applicants who can clearly demonstrate how they meet our role profile requirements will be shortlisted for an interview. To enquire about your application or inform us of any changes in your circumstances please ensure you quote your application reference number.&lt;/p&gt;\n&lt;p&gt;If the candidate successfully passes the interview stage, the candidate will then be asked to complete an Excel and SQL test under virtual supervised conditions to support the decision making process.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMitesh ShahJob titleSenior Business Intelligence ManagerEmail addressmitesh.shah@nhs.netTelephone number02036881046&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Business Intelligence Manager (Non-Acute)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242620", "validThrough": "2020-11-09T23:59:59+0000"}