{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-14T11:46:16+0100", "description": "&lt;p&gt;All your hard work has nearly paid off! After many long hours, balancing shifts and assignments (and probably lots of coffee), you are very nearly there. In 2021, you will finally become a qualified nurse and we are SO excited for you! After all that hard work, the final hurdle is to find your dream job. At Royal Cornwall Hospitals NHS Trust (RCHT) we are confident we can make your dream job become a reality.&lt;/p&gt;\n&lt;p&gt;We could go on for hours about Cornwall’s 300+ beaches, where you can swim with seals, jump from cliffs or explore caves from a kayak. You could become an adventurer for the day, discovering our stunning coastal paths, woodland walks, moors and mines. Or you might be more interested in our multicultural foodie, comedy and music scene. In Cornwall, we really know how to make a party, festival or event out of any occasion. We even have our very own RCHT staff festival every year, with fabulous headliners, to say thank you for all your hard work!&lt;/p&gt;\n&lt;p&gt;If you speak to your friends and family, we probably don’t really need to tell you why Cornwall is so wonderful. What you may not know is how fantastic our hospitals are too! At Royal Cornwall Hospitals NHS Trust, we deliver services across three sites: Truro, Penzance and Hayle. We also work closely with the local community Foundation Trust, who have sites all across Cornwall.&lt;/p&gt;\n&lt;p&gt;At RCHT, we are never standing still. We pride ourselves on being innovative and exciting. As an ambitious organisation, we are continuously looking for ways to enhance and improve the services we offer to our patients and staff alike. We are highly focussed on research and training and we will equip you with the skills and confidence you need to make positive change on your journey with us.&lt;/p&gt;\n&lt;p&gt;As a newly qualified nurse at RCHT, there are many diverse areas that you could work in to launch your career. We will help you develop your skills, knowledge and professional confidence. To ensure the best possible start for newly qualified nurses, the RCN recommends undertaking a high quality Preceptorship programme – at RCHT we offer just that. During our 18 month Preceptorship programme, we will support your transition from student to competent practitioner.&lt;/p&gt;\n&lt;p&gt;From day one, you would be placed within one of our dynamic and supportive teams and allocated a Preceptor who will have relevant experience in your chosen clinical area. They will guide and support your development in practice and review this at regular intervals. You will also receive additional support via the Trust Practice Development Team. We will ensure you have the opportunity to put your skills into practice and you will be fully supported throughout the experience.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on providing a supportive environment for our newly qualified staff nurses and you will soon feel part of a team and organisation that cares about you and your future nursing career. At RCHT, we understand that our colleagues are our most valuable asset and, therefore, your health and wellbeing is very high on our list of priorities. By joining us, you will have access to a wide range of clubs and societies, fantastic discounted restaurant facilities, free counselling, free financial advice, discounted leisure memberships, a Cycle to Work scheme and much, much more!&lt;/p&gt;\n&lt;p&gt;If you think we are the place for you, click “Apply Now”! If you would like to hear more before making your application, a member of our Recruitment Team would be delighted to hear from you on 01872 255755. When making your application, please declare in your supporting statement three clinical areas you would like your application to be considered for and we will try our best to accommodate your preferred options.&lt;/p&gt;\n&lt;p&gt;Upon making a successful application, you will be invited to our recruitment selection day on Saturday 23rd January. We hope to see you there!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Recruitment Services on Tel: 01872 25 5755, option 1, followed by option 2&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Preceptee Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226049", "validThrough": "2020-12-13T23:59:59+0000"}