{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-23T08:17:17+0100", "description": "&lt;p&gt;Do you want to influence the development of an evolving service as part of our leadership Team? Do you want to be part of a vibrant and passionate multi-disciplinary team working alongside Clinical Psychologists, Positive Behavior Analysts, Systemic Therapists, Learning Disability Nurses, Psychiatrists, Speech and Language Therapists and Outreach Workers?&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a motivated and forward thinking clinician who can work flexibly and is committed to supporting CYP and their families across Hertfordshire and the full PALMS’ team. The Positive behaviour, Autism, Learning disability, Mental health Service (PALMS) team is friendly, cohesive and proactive. We value feedback and empower all team members to contribute to the continuous development of the service and welcome innovation and change.&lt;/p&gt;\n&lt;p&gt;PALMS offers individually tailored support for children and young people (CYP), aged 0-19 who have a global learning disability and/or Autistic Spectrum Disorder, helping families to manage challenging behaviour and/or to support mental health needs. PALMS aims to keep children and young people with their families within Hertfordshire thereby improving outcomes for all family members. PALMS provides intervention and where necessary, intensive support to families reaching crisis with a step up and step down approach throughout their care journey. Interventions include workshops, groups, individual therapy, and therapeutic work with parents/carers/siblings. PALMS has embraced virtual working and we have been creative in using video conferencing to undertake our interventions. Virtual working offers flexibility to both team members and families and is now embedded in PALMS life.&lt;/p&gt;\n&lt;p&gt;The post will be based in St Albans Children’s Centre however the role is across Hertfordshire. This post will be full time and fixed term for 2 years however as the team continues to evolve, we secure additional funding year on year. PALMS are open to flexible working and therefore part time / job share would be considered, working a minimum of 0.6 WTE.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate about combining both clinical and leadership skills and have a desire to contribute to change in a vibrant NHS team&lt;/li&gt;\n&lt;li&gt;Able to make highly skilled evaluations and decisions about treatment options taking into account both theoretical and therapeutic models and highly complex factors concerning historical and developmental processes that have shaped the individual, family or group.&lt;/li&gt;\n&lt;li&gt;Able to provide expert clinical support and advice to team members&lt;/li&gt;\n&lt;li&gt;To be able to lead in the coordination and monitoring of various systems within the service&lt;/li&gt;\n&lt;li&gt;Able to formulate risk management plans and be able to support other team members in doing so.&lt;/li&gt;\n&lt;li&gt;Able to provide specialist advice and consultation to clinicians responding to emergencies as part of the Priority Pathway.&lt;/li&gt;\n&lt;li&gt;Able to provide clinical supervision and line management for some members of the team.&lt;/li&gt;\n&lt;li&gt;Able to delegate effectively to peers&lt;/li&gt;\n&lt;li&gt;Able to provide cover for the Service Lead in times of absence&lt;/li&gt;\n&lt;li&gt;Able to maintain a high degree of professionalism when working in settings where there is a highly emotive atmosphere.&lt;/li&gt;\n&lt;li&gt;Flexible in their approach and have resilience under pressure&lt;/li&gt;\n&lt;li&gt;Able to work both in a team environment and autonomously&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular clinical and professional supervision&lt;/li&gt;\n&lt;li&gt;Regular appraisal, personal development planning and opportunities for continuing professional development. This includes specific support with regards to fulfilling the PALMS’ role.&lt;/li&gt;\n&lt;li&gt;Regular opportunities to meet as a team including peer reflection and Intervision.&lt;/li&gt;\n&lt;li&gt;Opportunities to work closely with a multi-disciplinary team and learn from other evidence based frameworks and approaches.&lt;/li&gt;\n&lt;li&gt;Opportunities to provide clinical supervision and line management to other members of the PALMS team as appropriate.&lt;/li&gt;\n&lt;li&gt;Involvement in providing training.&lt;/li&gt;\n&lt;li&gt;27 days annual leave, 29 if you have worked for the NHS for 5 years and 33 if you have worked for the NHS for 10 years, in addition to 8 days bank holidays.&lt;/li&gt;\n&lt;li&gt;Entitlement to the NHS pension scheme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Closing date for applications will be midnight on Wednesday 11th November 2020 with shortlisting being completed on 13th November 20202 and Interviews running on Friday 20th November 2020. Interviews will be run using Microsoft Teams and full details and instructions will be provided to successful candidates.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Anna Dillon&lt;/p&gt;\n&lt;p&gt;Job title: Consultant Clinical Psychologist Service Lead&lt;/p&gt;\n&lt;p&gt;Email address: hct.palms@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01727 582122&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Albans Children&#39;s Centre, St Albans", "postalCode": "AL3 5JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7551", "longitude": "-.343673"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239678", "validThrough": "2020-11-11T23:59:59+0000"}