{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "38694", "unitText": "YEAR", "value": "£38694 - £49036"}}, "datePosted": "2020-10-30T08:55:18+0000", "description": "&lt;p&gt;Applications are invited for vacancies in ST1 Community Sexual and Reproductive Health training programmes across England starting August 2021.&lt;br /&gt; &lt;br /&gt; The specialty training programme is a six-year run-through training programme commencing at ST1.&lt;/p&gt;\n&lt;p&gt;The curriculum comprises Basic Training for 3 years in Obstetrics and Gynaecology and Sexual and Reproductive Health. Trainees will follow different competencies from O&amp;G trainees which are focused towards medical Gynaecology rather than Labour Ward expertise. Gynaecological competencies will need to be maintained throughout training.&lt;/p&gt;\n&lt;p&gt;The MFSRH Part 1 must be achieved before entering intermediate training. Intermediate training (Years 4 and 5) will extend the strand of Gynaecology and SRH, which includes unplanned pregnancy and Abortion Care, and also encompass training in Genitourinary Medicine, Public Health, Sexual Assault and Sexual Problems.&lt;/p&gt;\n&lt;p&gt;The MFSRH Part 2 must be achieved before entering advanced training. Advanced Training (Year 6) will be a year of completing all outstanding competencies but with opportunities for shadowing and preparing for a role as a consultant. Throughout the programme the trainee will undergo training in leadership and management. The programme develops the skills required to lead and manage the community based Sexual Health services of the future and lead large multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;The application window opens on Thursday 5th November 2020 at 1000 hours (UK time) and closes on Tuesday 1st December 2020 at 1600 hours (UK time). You will not be able to submit your application after this time. Please ensure that you have completed all relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via the online Oriel recruitment system; this can be accessed from the link provided. Please note when you visit the Oriel recruitment system, you will need to ensure you are on the ‘new oriel system’. Registration is available to applicants now; however, you will not be able to begin an application until the official opening date of Thursday 5th November 2020 at 1000 hours (UK time).&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Specialty Training website which can be accessed from Oriel.&lt;/p&gt;\n&lt;p&gt;Please visit Health Education England East of England website for vacancy details, applicants’ guide and further recruitment information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "EOE Medical Specialty Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Specialty Registrar in CSRH ST1", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249380", "validThrough": "2020-12-01T23:59:59+0000"}