{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-29T08:15:54+0000", "description": "&lt;p&gt;ST GEORGE&#39;S UNIVERSITY HOSPITALS NHS FOUNDATION TRUST&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ST GEORGE&#39;S HOSPITAL&lt;/strong&gt;, &lt;strong&gt;LONDON SW17 0QT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time - Consultant in Paediatric Respiratory Medicine - Substantive&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a dynamic Consultant in Paediatric Respiratory Medicine to join our team at St George’s Hospital. This is a replacement post following retirement. We are looking for an enthusiastic colleague to drive further developments in our service and to complement the current team. The post holder will contribute to the general respiratory and asthma service and be encouraged to develop specific areas of interest in line with their experience and the needs of the department. In particular, but not exclusively, this may include further development of services for children with difficult to treat asthma and children with respiratory complications of sickle cell disease.&lt;/p&gt;\n&lt;p&gt;The respiratory team comprises a multidisciplinary team of four consultants, seven clinical nurse specialists, three physiotherapists and two physiologists and dedicated psychology support for children with difficult asthma. We currently run weekly respiratory and asthma clinics and a number of other joint clinics with other specialties. The team actively supports PICU, NICU, haematology &amp; oncology (in conjunction with the Royal Marsden Hospital), fetal medicine, paediatric surgery and infectious diseases. Due to COVID-19, many clinics are now partly remote via telephone or video.&lt;/p&gt;\n&lt;p&gt;The asthma service has developed substantially over the past five years both within the hospital and the locality. There is a team of four clinical nurse specialists who assess all children admitted to the hospital with wheeze / asthma. There is a weekly joint physiotherapy/psychology clinic for children with breathing pattern disorders, The service is also keen to develop a research profile and is linked to the pan London asthma research group. We are developing the use of home spirometry.&lt;/p&gt;\n&lt;p&gt;The LTV service is supported by a highly specialised respiratory physiotherapist and a WellChild LTV nurse specialist. Children are currently managed between NICU, PICU and a PHDU.&lt;/p&gt;\n&lt;p&gt;The respiratory service is supported by a dedicated paediatric physiology service with facilities for spirometry, plethysmography and gas exchange and exhaled nitric oxide. The physiologists also run sleep studies including respiratory semi-polysomnography (no EEG) and oxy-capnography, predominantly as domiciliary studies.&lt;/p&gt;\n&lt;p&gt;The aim of this post is to continue to innovate and drive change to improve respiratory health in our diverse population and to link into services across SW London via networks. The post holder will receive referrals from other consultants and specialties, from PICU and NICU, and from General Practice. These will be seen as either inpatients or outpatients as appropriate. Patients may be local or from outside the region. The post holder would be fully responsible for the management of such patients. We operate a 1:4 consultant of the week rota with out of hours telephone support for the acute hospital teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St George’s paediatric department is a highly rated teaching and training centre and there is opportunity to contribute to undergraduate and postgraduate teaching.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Richard Chavasse&lt;/p&gt;\n&lt;p&gt;Job title: Consultant Respiratory Paediatrician&lt;/p&gt;\n&lt;p&gt;Email address: Richard.Chavasse@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 8725 2456&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Sijo Francis, Clinical Director&lt;/p&gt;\n&lt;p&gt;Sijo.Francis@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges&#39;s Hospital, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Consultant in Paediatric Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247626", "validThrough": "2020-11-29T23:59:59+0000"}