{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-10-02T11:55:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Have you thought of working for the Evington Centre?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We recognise that many of our elderly patients have combined mental and physical health needs and welcome applicants from either a mental, physical health or learning disability nursing background.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Students are a key part of our team and you will provide mentorship to learners on the ward.&lt;/li&gt;\n&lt;li&gt;You will have a clear understanding of clinical supervision and participate in reflective practice groups with team members.&lt;/li&gt;\n&lt;li&gt;You will show a keen interest in developing your skills and knowledge in the inpatient environment as an effective member of the inpatient care team.&lt;/li&gt;\n&lt;li&gt;The role will include working as the Named Nurse for individual patients to assess, plan, implement and evaluate care and participate in clinical team review meetings.&lt;/li&gt;\n&lt;li&gt;All candidates must be computer literate and have a firm understanding of information governance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you think you have the right skills to offer us at this exciting time then we would very much like to hear from you. You will need to be able to work a rotating shift pattern to cover our 24 hour 7 days a week service.&lt;/p&gt;\n&lt;p&gt;We support you with your personal development and training needs, offering opportunities to rotate between organic and functional wards. You will be encouraged to take part in group and individual activities in collaboration with the Occupational Therapist and Nursing colleagues. Your role will include working with carers and families to provide support during the acute admission phase.&lt;/p&gt;\n&lt;p&gt;The service has recently undergone significant remodelling to offer improved clinical leadership on the wards to aid learning and support to employees by increasing the numbers of qualified staff per shift.&lt;/p&gt;\n&lt;p&gt;Our service has evolved to include increased numbers of Staff Nurses and Deputy Ward Managers, in addition to a Ward Manager and Matron. Each ward will also benefit from the experience of dedicated Ward Consultants. It is an exciting time to join our evolving Mental Health Services for Older People.&lt;/p&gt;\n&lt;p&gt;Apply now for this fantastic opportunity…&lt;strong&gt;you could be the next one working for a fantastic organisation like LPT!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE5 4DQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6393", "longitude": "-1.08116"}}, "title": "Band 5 Registered Nurse- RMN, RGN or RNLD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210383", "validThrough": "2020-11-06T23:59:59+0000"}