{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-27T12:46:32+0000", "description": "&lt;p&gt;Hours: 37.5 Hours per week&lt;/p&gt;\n&lt;p&gt;Contract: Permanent&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for someone to join our centralised Waiting List Team at York Hospital. As a member of the team, you will assist with managing waiting lists for elective surgery and working in accordance with Government Access targets to ensure patients are treated in line with Trust Access policies.&lt;/p&gt;\n&lt;p&gt;This post is varied and includes contact with patients and many Health Care Professionals associated with admitting patients for surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual with excellent interpersonal skills and the ability to work in an environment where demands and priorities change quickly.&lt;/p&gt;\n&lt;p&gt;We are looking for someone educated to a minimum of A level standard or with equivalent relevant experience, with a minimum of one year experience working in a patient/customer focused environment. An awareness of Government Access targets would be desirable. You must be well organised, able to work on your own initiative and demonstrate confidence in independent decision making.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that previous applicants need not apply and this vacancy may close early should we receive a high volume of applications, therefore please submit your application as soon as possible to avoid disappointment,&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJan WrightJob titleWaiting List ManagerEmail addressJan.Wright@york.nhs.ukTelephone number01904 721263Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Waiting List Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244594", "validThrough": "2020-11-10T23:59:59+0000"}