{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/pro rata"}}, "datePosted": "2020-10-27T13:46:00+0000", "description": "&lt;p&gt;Macmillan Haemato-oncology Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Division : Planned Care&lt;/p&gt;\n&lt;p&gt;Care Group: Cancer Services&lt;/p&gt;\n&lt;p&gt;Band: 7&lt;/p&gt;\n&lt;p&gt;Salary: £38,890 - £44,503 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date: Week Commencing 30th November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for a fixed term period of 12 months for a Haemato-oncology Clinical Nurse Specialist who shares our ambition and vision to deliver the &lt;strong&gt;&lt;em&gt;Best of Care by the Best People&lt;/em&gt;&lt;/strong&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be expected to be a named key worker with the expectation to work collaboratively with others to develop and use appropriate strategies and opportunities to share knowledge with, deliver interventions and influence the practice of colleagues with the Haemato-oncology service. To provide a holistic service for the optimum care of and ongoing support to individuals diagnosed with a haematological malignancy. The post holder will, in conjunction with the multidisciplinary team, build on established links with the level ¾ centre at Kings College hospital, London and Primary care to provide a seamless care pathway for Haemato-oncology clients. Maintain links with other Haemato-oncology clinical nurse specialists across the Kent and Medway Cancer Network.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Haemato-oncology Clinical Nurse Specialist&lt;/strong&gt; you will ensure that in conjunction with the Haemato-oncology team, be responsible for the provision of specialist nursing, advice and ongoing support for individuals diagnosed with haematological malignancies.&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Haemato-oncology Clinical Nurse Specialist&lt;/strong&gt; will work in partnership with other haematology practitioners and allied health professionals. Communicate and coordinate effectively with other professionals involved in the individual’s care pathway ensuring a seamless patient journey. Act as a resource to other health professionals, either within the Trust or within Primary Care.&lt;/p&gt;\n&lt;p&gt;The role will assess individual’s holistic needs, using a range of assessment methods that are evidence based and appropriate for the individual. Empower individuals and groups to promote their own health and wellbeing, offering appropriate advice, information and support. Provide nurse led clinic support to individuals post bone marrow transplant, acting at all times within agreed protocols. Provide nurse led clinic support for patients with stable MPN, CLL &amp; MGUS, acting at all times with agreed protocols.&lt;/p&gt;\n&lt;p&gt;In addition, you will be self-aware, innovative and proactive in developing and improving own competencies. Work collaboratively with others to develop and use appropriate strategies and opportunities to share knowledge with, deliver interventions and influence the practice of colleagues within the Haemato-oncology service.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVicky KidnerJob titleMacmillan Lead Nurse for ChemotherapyEmail addressvicky.kidner@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Macmillan Haemato-Oncology Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244789", "validThrough": "2020-11-16T23:59:59+0000"}