{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-23T11:30:29+0100", "description": "&lt;p&gt;Staff Nurse – Critical Care (Registered and Newly Qualified)&lt;/p&gt;\n&lt;p&gt;An excellent opportunity to join the critical care nursing team here at Royal Papworth Hospital has arisen.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic, motivated and compassionate registered nurses to join our highly specialist and internationally renowned mutli-disciplinary team. Our 46 bedded Critical Care is one of the largest and busiest in the region, with state of the art facilities, we are able to provide outstanding compassionate and holistic care to our patients.&lt;/p&gt;\n&lt;p&gt;As a tertiary referral centre we look after some of the sickest patients who are referred to us for a variety of specialist services such as our ECMO (extra corporeal membrane oxygenation) service, heart and lung transplant, PCI pathway. Working in this environment is challenging and rewarding in equal amounts.&lt;/p&gt;\n&lt;p&gt;To care for our patients we need a highly skilled and innovative team, we will support your development through every stage of your career with our dedicated Critical Care education team.&lt;/p&gt;\n&lt;p&gt;Our well established programme for registered nurses will be tailored to you, combining theoretical knowledge and practical skills required for you to excel in your role. You will have access to expert clinical mentors and higher education programmes such as the Critical Care Course at degree or master’s level, funded places at international conferences, Critical Care rotations and careers coaching for progression in more specialist roles.&lt;/p&gt;\n&lt;p&gt;In addition to this we have a £1,000 welcome waiting for you *&lt;/p&gt;\n&lt;p&gt;If any of this appeals to you please apply.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Regular shortlisting takes place and you will be contacted for a Skype interview if you are shortlisted for interview.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*£1,000 welcome payment applicable to those who commence on substantive contracts with a commitment to remain with the Trust for a minimum of 12 months (excludes Bank contracts).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Staff Nurse B5 - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240318", "validThrough": "2020-11-29T23:59:59+0000"}