{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-04T14:00:49+0000", "description": "&lt;p&gt;Ward 5 is located at the Newsam Centre in Leeds. It is an 18 bedded complex male recovery ward that endeavours to deliver rehabilitation and recovery to service users with enduring mental illness. This exciting and rewarding role will require a humane and compassionate individual who is committed to high quality service user focused care. The ward provides a holistic bio-psychosocial approach to support service users to build up their life skills and to improve the quality of their life. The post suits an individual who thinks out of the box and is open minded to new ways of working. You would join a dedicated and hardworking multi-disciplinary team who are eager to make a difference through providing an integrated service that focuses on recovery. As such we are looking for an individual who values team working, one who seeks to work in an inclusive manner. We are service user focused and we value the contributions from friends, families and carers of service users for this post we are seeking an individual with a similar philosophy. You will be supported via clinical and management supervision and you will have opportunities to develop yourself personally and professional.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Don’t delay, apply now! Like to know more first? Talk to Samuel Jamera, Ward Manager on 0113 8556521, email samuel.jamera@nhs.net or Kurt Maloney, Operational Manager, on 0113 8556413, email kurt.maloney@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS14 6UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8066", "longitude": "-1.47091"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256117", "validThrough": "2020-11-18T23:59:59+0000"}