{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc hcas"}}, "datePosted": "2020-10-28T15:46:12+0000", "description": "&lt;p&gt;The Royal Marsden has a vital role in championing change and improvement in cancer care through research and innovation, education and leading-edge practice. We are incredibly proud of our international reputation for pushing the boundaries and for our ground-breaking work ensuring our patients receive the very best and latest in cancer treatment and care.&lt;/p&gt;\n&lt;p&gt;This is a pivotal role and you will be part of a team of qualified and skilled medical and nursing staff. You will take part in the complex set-up and running of a highly specialised and expansive portfolio as well as having a key role as the operational lead for the unit and line manager to the administrative trial team.&lt;/p&gt;\n&lt;p&gt;Ideally with previous clinical research and hospital experience, you will work within the guidelines and policies for the conduct of clinical trials, ensuring high standards of practice in accordance with the principles of GCP.&lt;/p&gt;\n&lt;p&gt;The post is based at our Chelsea, London location; the successful applicant should have a flexible approach to their duties and the ability to work both as part of the team as well as independently. In addition you will have excellent communication, administrative and IT skills and be supportive and open to new initiatives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mark Terry, Clinical Research Operations Manager, Mark.Terry@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Marsden Chelsea Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Senior Trial Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247240", "validThrough": "2020-11-25T23:59:59+0000"}