{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-04T15:00:57+0000", "description": "&lt;p&gt;The post is an opportunity for Nurses and Operating Department Practitioners looking for a new and exciting career challenge.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Theatre Practitioners - Scrub (Band 5) within our first-class progressive Operating Theatre Department at the Royal Hospital Site. We currently have 20 operating theatres covering all major specialities, including: Trauma and Orthopaedics, Vascular, Urology (including robotic), Breast and Endocrine. Renal Transplant, Upper G I, Colorectal, Hepatobiliary and Emergency surgery.&lt;/p&gt;\n&lt;p&gt;So what can you bring to our team? &lt;br /&gt;&lt;br /&gt;We are seeking newly qualified or experienced, enthusiastic, motivated and resilient professional Theatre Practitioners who are looking to begin their career or seek out a new challenge. You will be flexible, adaptable and willing to maintain our pace and drive having strong communication skills that enable you to be a real team player. In order to provide the finest possible care we aim to attract, train and provide on-going support to the right people who can join our existing team of highly skilled professionals, all of whom are committed to making a positive difference to our patients. Whether you are an experienced scrub NMC Registered Nurse or HCPC registered ODP, or newly qualified you will receive support, guidance and robust mentoring throughout your development as a Theatre Practitioner. All staff are required to participate in the &quot;on call &quot; commitment for emergency surgery and out of hours rota covering 24/7 that would also include weekends and late shift patterns. Above all we need professionals with a &quot; can do &quot; attitude who will deliver high quality services with care, compassion, courage, communication, competence and commitment. There are fantastic career opportunities open to you here at the Royal and Broadgreen University Hospitals. &lt;br /&gt;&lt;br /&gt;Temporary accommodation may be considered for a 4 week period to anyone who is considering re-locating to the area.&lt;br /&gt;&lt;br /&gt;Therefore please come and join our team and look forward to a rewarding and challenging career within our peri-operative environment at the Liverpool University Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise WoodsJob titleUnit ManagerEmail addresslouise.woods@liverpoolft.nhs.ukTelephone number01512823782Additional contact informationlouise.woods@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or Contact Louise Woods by phone on 0151 282 6782&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool University Hospitals NHS Foundation Trust, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Theatre Practitioner/ODP - Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256333", "validThrough": "2020-11-18T23:59:59+0000"}