{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-07T11:29:07+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Geriatric Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Great Western Hospital is pleased to be able to offer the opportunity to Consultant Geriatricians to join the existing team within the Department of Medicine for the Elderly (DOME) to enhance and drive forward the ongoing development of our services.&lt;/p&gt;\n&lt;p&gt;Are you looking to start your career as a Consultant in one of the most supportive and caring Elderly Care Trusts in the country, or are you an existing Consultant looking for a new and exciting change where you can really make a difference? Either way, we are a dynamic, cohesive and expanding team who are focussed on giving the very best care to our elderly patients at all times and we would love to have you on board.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and innovative Consultant Geriatricians to help shape the services that we deliver to our older patients, who we care so passionately about. We are continually looking to develop flexible and creative ways of working and would relish the opportunity to see what skills and ideas potential candidates could bring to our steadily expanding team. We always promote professional development and are keen to nurture personal interests which candidates may have in any field of geriatric medicine.&lt;/p&gt;\n&lt;p&gt;The DOME team are located in the Betjeman Centre, which is on the ground floor of GWH. This is home to the department’s outpatient clinic rooms and office space for the consultant team and their secretarial support. There are currently 10 consultants within the department who manage inpatients on our three geriatric medicine wards (Jupiter, Woodpecker and Teal) and trauma ward as well as covering Older Persons’ Short Stay Unit. There are also rehabilitation services for orthogeriatric and stroke patients. We are also developing and expanding a very successful acute geriatric service at the front door consisting of geriatricians, advanced clinical practitioners (ACPs) and therapists working closely together to provide comprehensive geriatric assessments and help support timely discharges. A full complement of outpatient services are provided including clinics in general geriatrics, stroke, falls, syncope, orthogeriatrics and movement disorders.&lt;/p&gt;\n&lt;p&gt;In the last few years we have achieved much within our department including establishment of a 15 bedded Older Persons Short Stay Unit, an acute front door geriatric service, refurbishment of our first dementia friendly ward, as well as successful recruitment of 3 new consultants, 6 ACPs and two Admiral Dementia Specialist Nurses. During this time we have also won national recognition and accolades for our orthogeriatric service and frailty pathways. Our track record demonstrates that we are an ambitious and progressive team who are motivated to develop our services in order to provide outstanding care for our local population.&lt;/p&gt;\n&lt;p&gt;Any successful applicant will also be expected to participate in the medical consultant on call rota with a 1 in 8 weekend on call commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Great Western Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;GWH is a vibrant hospital into which there has been much recent investment and significant development. Work has recently commenced on the construction of a £2.9m radiotherapy centre. Additionally, we have been successful in securing £15m to improve urgent and emergency care at GWH by replacing our current Urgent Care Centre with a new Urgent Treatment Centre. This is in addition to our successful bid for £30m to expand and improve our emergency services as part of our Way Forward Programme. As part of this programme are plans to build a new state of the art rehabilitation centre which the DOME team are already involved in.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Swindon, Wiltshire and The Cotswolds&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Swindon is a thriving town set between the Cotswolds to the North and West, the Upper Thames valley to the East and the Marlborough Downs to the South. London, Bristol and Oxford are all within easy reach, approximately one hour by car with good links by public transport. The rail journey to London Paddington from Swindon is approximately 55 minutes and Heathrow Airport is only an hour away from Swindon by car. Heading west by train, are Bristol, Bath and Cardiff, all within an hour’s travel.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates are required to be within 6 months of CCT at the time of interview or currently hold CCT or equivalent. Development of special interests within this role are encouraged and will be supported as much as possible. The successful candidate should also be trained in all aspects of General Internal Medicine.&lt;/p&gt;\n&lt;p&gt;Before you apply, please feel free to visit the trust, discuss your ideas and ask any questions you may have. Dr Sarah White, Clinical Lead for Geriatric Medicine can be contacted on 01793 605112, email sarah.White33@nhs.net or you can contact Dr Tobenna Onyirioha, Deputy Medical Director on 01793 646303, email t.onyirioha1@nhs.net&lt;/p&gt;\n&lt;p&gt;To apply please complete the online application form and upload your CV (please avoid using a PDF document).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is 6th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Consultant in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216215", "validThrough": "2020-11-06T23:59:59+0000"}