{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum, pro rata"}}, "datePosted": "2020-10-28T10:32:00+0000", "description": "&lt;p&gt;We are looking for a part time General Adult Consultant Psychiatrist with Eating Disorder expertise and experience to join our Eating Disorder Service in Manchester. This is a newly commissioned post created by service redesign and added investment.&lt;/p&gt;\n&lt;p&gt;We are a dynamic and innovative Trust providing an excellent environment in which employees can develop and progress in their career. We value work- life balance and support our staff in achieving this.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our dedicated teams to support further development of our community mental health services following the development of a new Greater Manchester Mental Health NHS Foundation Trust. The Trust was rated as “Good” in February 2018 by CQC, with “outstanding” Substance Misuse services and “outstanding” for being Well Led.&lt;/p&gt;\n&lt;p&gt;We wish to recruit a Consultant Psychiatrist with considerable experience in the assessment and treatment of Eating disorders in a community setting. This will include a thorough knowledge and practice of working within NICE Guidelines for anorexia nervosa, bulimia and OFSED , diagnosing and treating physical and psychiatric co-morbidities where appropriate. The post holder will deliver complex assessments, undertake physical examinations and order and interpret baseline investigations and provide expert medical input to the Eating Disorder MDT and to the wider system. Given the interdisciplinary approach and emphasis of expert psychological formulation and treatment within this Service we are looking for someone who thrives on team working and thinking in a psychologically informed way about this patient group whilst providing medical expertise. Experience of working within a Medical Psychotherapy setting would be an advantage&lt;/p&gt;\n&lt;p&gt;The Consultant will provide joint clinical leadership for the Eating Disorder service with the Clinical Lead Mr Ian Gill,&lt;/p&gt;\n&lt;p&gt;The consultant will work flexibly in consultation with the team and service manager, the local Head of Operations and the Lead Consultant. In addition to the usual clinical duties associated with a post of this type, it is expected that the post- holder will take on some additional responsibilities in line with the time available, including close working with partners and stakeholders, service development work, service evaluation and a clear responsibility for service leadership in conjunction with the operational managers.&lt;/p&gt;\n&lt;p&gt;The Team has access to the walk- in Broomwell ECG and phlebotomy clinic 5 days per week to for accessible and efficient cardio-metabolic monitoring.&lt;/p&gt;\n&lt;p&gt;There is weekly Central Manchester Community meeting which alternates peer supervision group with Managerial support and updates,&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the Central East Team which will be working towards Royal College Accreditation. You will form part of the newly established Senior Management Team for the Central CMHTs and will be expected to be closely involved in Quality and Governance , particularly leading on learning from incidents and supporting the physical health agenda.&lt;/p&gt;\n&lt;p&gt;Consultants are actively supported by the Lead Consultant and encouraged to develop special interests within SPA time. Research time and support from Manchester academics can be facilitated.&lt;/p&gt;\n&lt;p&gt;It may be possible to have an additional paid SPA for research or Special Interest. This can be discussed with Dr Clarke for interested candidates.&lt;/p&gt;\n&lt;p&gt;The Trust offers a generous study budget and leave allowance which would be available pro rata for this post.&lt;/p&gt;\n&lt;p&gt;We are also interested in candidates who would be interested in part time or flexible working arrangements or combining part time CMHT with a specialism.&lt;/p&gt;\n&lt;p&gt;It is also expected your role would include liaison with other agencies including the Local authority, Child Protection teams and Voluntary Sector Agencies. You will need you have an excellent knowledge of safeguarding of vulnerable adults and children.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRosemary ClarkeEmail addressRosemary.clarke@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gaskell House, Swinton", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Consultant Psychiatrist in Eating Disorder", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246093", "validThrough": "2020-11-25T23:59:59+0000"}