{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-19T13:59:29+0100", "description": "&lt;h2&gt;&lt;span&gt;&lt;span&gt;Bespoke Rotational Posts available &lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Whether you’re newly qualified or have years of experience behind you, you will be vital to the smooth running of the inpatient wards at Redwoods Centre in Shrewsbury.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As a Registered Mental Health Nurse, you will be responsible for delivering high quality clinical service to service users and their families and carers. You will participate in therapeutic group work programmes as well as taking the lead where appropriate. You will be required to administer medication and assess each individuals’ care needs in order to develop, implement and evaluate programmes of care. You will also be required to support student nurses on placement.&lt;/p&gt;\n&lt;p&gt;You will need to be NMC registered and you will be required to work within the NMC Code of Practice and Professional guidelines.&lt;/p&gt;\n&lt;p&gt;Redwoods Centre is situated in the rural town of Shrewsbury, Shropshire. The services there include Dementia, Older Adults and Forensic and Acute.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Laurel Ward is a male only Adult Acute, made up of 16 beds&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Birch Ward is a mixed gender ward, Adult Acute, made up of 16 beds&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Oak Ward is a mixed gender, Dementia Service ward, made up of 16 beds&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Holly Ward is a mixed gender, Older Adults ward, made up of 16 beds&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You may already live in Shropshire or are considering relocation.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here are 10 reasons to apply for a role within MPFT in Shropshire:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;We are truly passionate about developing our staff and will support you on your career journey every step of the way&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We support our nursing staff to take on leadership roles&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We will work with you to design bespoke rotational posts in line with your interests, if that is what you want - whether you choose inpatient services, CAMHS, dementia or complex personality disorders to name but a few…&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We offer an excellent Preceptorship Programme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Average house prices in Shropshire are well under national average at £217k&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Shropshire schools consistently outperform and there is an array of excellent state schools and colleges&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Look after your own health and wellbeing - Shropshire Hills are a designated area of Outstanding Natural Beauty&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Spend your days off visiting Shropshire’s 57 castles and forts and its 2 World Heritage Sites!&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Shropshire is perfect for growing families - the traditional market towns with their high quality shops and restaurants contrast with hi tech Telford new town and its plentiful job opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Fantastic transport links to Shrewsbury and Telford, should you need to commute!&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you would like to arrange an informal visit to one of our friendly teams / sites or would like further information, we would love to hear from you! &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please contact Amy Smith, our Senior Nursing Recruitment Advisor via email at &lt;/span&gt;&lt;span&gt;recruitment.services@mpft.nhs.uk&lt;/span&gt;&lt;span&gt; and we will point you in the right direction.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shropshire", "postalCode": "SY5 8DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6168", "longitude": "-2.85039"}}, "title": "Registered Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232593", "validThrough": "2020-12-30T23:59:59+0000"}