{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Consultant salary scale + 5% on"}}, "datePosted": "2020-10-13T11:46:41+0100", "description": "&lt;p&gt;&lt;strong&gt;OXFORD UNIVERSITY HOSPITALS NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT IN VASCULAR SURGERY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Consultant Vascular Surgeon in the Department of Vascular Surgery, John Radcliffe Hospital, Oxford University Hospitals NHS Trust, Headley Way, Headington, Oxford, OX3 9DU.&lt;/p&gt;\n&lt;p&gt;The post-holder will join the consultant team of the Thames Valley Vascular Network.&lt;/p&gt;\n&lt;p&gt;The Thames Valley Vascular Network provides care to approximately 1.45 million patients across Buckinghamshire, Oxfordshire, and West Berkshire. The Network consists of three NHS trusts:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Buckinghamshire Healthcare NHS Trust (BHT)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Foundation Trust (OUHFT)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Royal Berkshire Hospitals NHS Foundation Trust (RBHFT)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These trusts work collaboratively to centralise elective major arterial surgery and non-elective surgery in the John Radcliffe Hospital (OUHFT) whilst maintaining day case surgery, outpatient appointments at the local hospitals in Buckinghamshire and West Berkshire as well as some local inpatient treatment and review where appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will be employed by OUHFT and work in both Buckinghamshire healthcare Trust and Oxford University Hospitals NHS Trust. It is expected that the post-holder will adhere to the local policies of trusts when delivering services at all trusts, and work collaboratively with colleagues at all trusts to develop effective and efficient patient pathways.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is based at the John Radcliffe hospital with clinical commitments in Buckinghamshire Hospitals NHS Trust. The successful applicant will join 2 other consultants delivering local care to patients in Buckinghamshire and Oxfordshire.&lt;/p&gt;\n&lt;p&gt;This is a substantive, full-time (minimum 10Pas) post with the successful applicant joining the Oxford vascular and endovascular team in delivering the highest level of care to patients with both standard and complex vascular conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We seek a dynamic individual who will work closely with all consultant vascular surgeons, clinical nurse specialists, consultant interventional radiologists in the Network, and local GPs across both Oxfordshire and Thames Valley Vascular Network to develop local services and streamlined pathways for vascular patients requiring inpatient care in Oxford.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of eight consultant vascular surgeons across the network, thirteen consultant interventional radiologists, and seven vascular clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details, please refer to the job description and personal specification. For further information, please contact Mr Ed Sideso, Clinical Lead for Vascular Surgery, Oxford University Hospitals NHS Trust, The John Radcliffe (Email: Ed.sideso@ouh.nhs.uk/ Tel: Oxford (01865) 221288)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mr E Sideso&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant &amp; Lead for Vascular/ Endovascular Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ed.sideso@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jr with travel to other site sin BOB STP, OXFORD", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Consultant Vascular Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224118", "validThrough": "2020-11-15T23:59:59+0000"}