{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata"}}, "datePosted": "2020-11-05T13:31:55+0000", "description": "&lt;p&gt;We are a large mental health trust in South East England. We&#39;re looking for people to help us provide high quality services for the patients, carers and local communities we serve.&lt;/p&gt;\n&lt;p&gt;We want patients and staff to recommend our organisation as a place where they would be happy for their friends and family to be treated. You can help us to this be bringing your skills, experience and commitment to Sussex Partnership.&lt;/p&gt;\n&lt;p&gt;Would you like an opportunity to develop your skills? Are you thinking about a flexible part-time&lt;/p&gt;\n&lt;p&gt;Personal Assistant role? If you are we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;The Allied Health Professions (AHP) Directorate are looking for a PA to the Director of Allied Health Professions. You will be working directly with our two job share AHP Directors and the wider AHP Leadership Team covering Occupational Therapy, Speech and Language Therapy and Physiotherapy. We are looking for a dynamic PA who will be able to provide a comprehensive and efficient administrative support service whilst maintaining a highly professional and confidential approach. You will need to be able to juggle priorities, work under your own initiative and as a member of a team. Excellent organisational and interpersonal skills and attention to detail are essential. We are really keen to employ someone who has knowledge and experience of using various social media platforms so we can promote our brilliant AHP professions. We can offer excellent training and the opportunity to contribute to the achievements of our services.&lt;/p&gt;\n&lt;p&gt;The postholder will be based at Aldington House in Hove but with COVID restrictions administrative staff are mainly working from home at present&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Lucy Locks&lt;/p&gt;\n&lt;p&gt;Director of Allied Health Professions&lt;/p&gt;\n&lt;p&gt;lucy.locks@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Janet Cox&lt;/p&gt;\n&lt;p&gt;AHP Business Support Manager&lt;/p&gt;\n&lt;p&gt;janet.cox@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aldrington House, Brighton &amp; Hove", "postalCode": "BN3 4AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8301", "longitude": "-.184206"}}, "title": "PA to Director of Allied Health Professions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257905", "validThrough": "2020-11-12T23:59:59+0000"}