{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-02T13:15:12+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant Radiologist with a specialist interest in Gastrointestinal Radiology&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a position as a Consultant Radiologist with a specialist interest in GI GU Radiology within University Hospitals Birmingham NHS Foundation Trust.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;University Hospitals Birmingham NHS Foundation Trust (UHB) is the leading university teaching hospital in the West Midlands, serving a regional, national and international population. It is one of the most consistently high performing trusts in the NHS and has been rated &quot;excellent&quot; for leadership by the Healthcare Commission.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 1&lt;/span&gt;&lt;span&gt;st&lt;/span&gt;&lt;span&gt; April 2018 UHB merged with Heart of England NHS Foundation Trust. Our multiple sites, Birmingham Heartlands Hospital, the Queen Elizabeth Hospital Birmingham, Solihull Hospital and Community Services, Good Hope Hospital in Sutton Coldfield and Birmingham Chest Clinic allow people to be treated as close to home as possible.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;University Hospitals Birmingham NHS Foundation employs around 20,000 staff and provides services to 2.2m patients every year, from a single outpatient appointment to a heart transplant. We are a regional centre for cancer, bone marrow transplants, trauma, renal dialysis, burns and plastics, HIV and AIDS, as well as respiratory conditions like cystic fibrosis; thoracic surgery and have the largest solid organ transplantation programme in Europe. We also provide a series of highly specialist cardiac, liver and neurosurgery services to patients from across the UK.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are offering the opportunity to join an established and proactive Consultant Radiologist team in order to respond to the need of our growing service. UHB has a large radiology training scheme so an enthusiasm and aptitude for teaching and training would be an advantage. The candidate would be expected to participate with colleagues in any out-of-hours provision that is required. Applicants must be on or eligible for GMC specialist register for Radiology. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested candidates are invited to contact:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Madava Djearaman&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical Service Lead of Imaging (Birmingham Heartlands Hospital, Good Hope Hospital, Solihull Hospital)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Email: &lt;/span&gt;&lt;span&gt;madava.djearaman@heartofengland.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tel. 0121 424 5259&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If a completed online application and CV is not forwarded by the closing date the application will not be considered.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull) - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Consultant Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252186", "validThrough": "2020-11-30T23:59:59+0000"}