{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on experience"}}, "datePosted": "2020-10-27T17:00:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Anaesthesia Associate (AA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Band 7 (£31 072 - £40 964) or 8a (£44 606 - £50 819) at Dudley Group NHS Foundation Trust&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;37.5 hours&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Permanent&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an Anaesthesia Associate to join our Anaesthetic Department working in both Operating Theatres and Pre-operative Assessment Unit. The post holder will join our Departmental team of 36 Consultant Anaesthetists and three existing AAs based at Russells Hall Hospital. Our workforce strategy includes the development of a larger AA team to work in several areas of the operating theatres and pre-operative assessment unit. Some sessions may be based at the Corbett Hospital. Depending on skills and experience, the successful candidate will undertake sessions in theatre (2:1 and 1:1), ophthalmic surgery (performing sub-Tenons blocks) and preoperative assessment clinic.&lt;/p&gt;\n&lt;p&gt;To be successful, the appointee will need be a qualified AA who has worked within the operating theatre environment and ideally within pre-operative assessment. They will become part of the anaesthetic team, and will be expected to take part in departmental activities, such as audit and teaching. The appointee will be self motivated and committed to their ongoing personal and professional development.&lt;/p&gt;\n&lt;p&gt;Based in the heart of the Black Country, The Dudley Group NHS Foundation Trust is proud to serve more than 400,000 people living in Dudley and the surrounding areas. The first hospital trust in the area to be awarded coveted Foundation Trust status in 2008, we provide a wide range of medical, surgical and rehabilitation services. With a workforce of over 4,500 working across three hospital sites and several community locations we are proud to have over a million patient contacts per year. Our hospitals are among some of the most technologically advanced in the country, where state-of-the-art equipment and modern, purpose-built buildings combine to create the highest standards of patient care. We have a strong reputation for leading the way in patient safety and quality improvement. We have excellent staff engagement and a state of the art environment and big ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Andrea Gait&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Anaesthetic Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245517", "validThrough": "2020-11-24T23:59:59+0000"}