{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-02T15:31:53+0000", "description": "&lt;p&gt;Our new Northern Care Alliance NHS Group unites five local hospitals to deliver high quality care across the North East of Greater Manchester.&lt;/p&gt;\n&lt;p&gt;The Alliance provides the benefits of scale but delivers this locally through multiple hospital sites which make up four new Care Organisations – Bury/Rochdale, North Manchester, Oldham and Salford. Using our mantra of ‘Saving lives, Improving lives’, the aim is for our Care Organisations to work closely with the communities they serve to deliver safe, high quality and reliable care, which are trusted, connected and pioneering.&lt;/p&gt;\n&lt;p&gt;Our Care Organisations are designed to operate within our group arrangement of hospitals, community and healthcare services which bring together over 17,000 staff and the services of The Pennine Acute Hospitals NHS Trust and Salford Royal NHS Foundation Trust. Our size and geographical reach means we are creating an environment each individual will be inspired and empowered by to be the best they can be. This is a really exciting time to join our new team.&lt;/p&gt;\n&lt;p&gt;As the Healthier Together plans continue across Greater Manchester the Oldham Care Organisation (Royal Oldham Hospital) is planned to play a crucial role and has been identified as a hub hospital for the area providing a specialist high acuity site for high risk elective and emergency general surgery across North East Manchester.&lt;/p&gt;\n&lt;p&gt;The innovative plans will see Royal Oldham benefit from around £25 million investment to bring patient activity under the full scope of Healthier Together. This will include a state of the art new build for critical care over the next two to three years.&lt;/p&gt;\n&lt;p&gt;Taking into account these exciting plans for expansion the Oldham Intensive Care is looking to appoint enthusiastic, patient focussed Consultant Intensivists to join their team. Our service provision currently includes upto 22 Critical Care Beds, playing a pivotal role for the acutely unwell patient and their families across our hospital. Working with a number of multi-disciplinary teams from across the Alliance, we are a team with passion to deliver the best possible care for our communities’ loved ones and look forward to welcoming like-minded individuals to our team; in addition to clinical work there are four FICE mentors among the substantive consultants; the unit is also active in research, currently focusing on Covid studies. The team is particularly proud of the strong Quality Improvement workstream within Intensive Care.&lt;/p&gt;\n&lt;p&gt;We offer a flexible job plan and would welcome applications for full or part time contracts. In addition to Anaesthetists, applications from candidates with other base specialties are encouraged.&lt;/p&gt;\n&lt;p&gt;OUR COMMITMENT TO YOU&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An energetic and dynamic leadership team with clear vision for the continued success of their units&lt;/li&gt;\n&lt;li&gt;Opportunities to be involved in the training and mentoring of both junior doctors training in ICM and ACCPs&lt;/li&gt;\n&lt;li&gt;Support for your own personal development utilising our strong links with local universities&lt;/li&gt;\n&lt;li&gt;A flexible approach to job planning that delivers a working environment to best suit you and your team&lt;/li&gt;\n&lt;li&gt;An opportunity to develop and be part of a new and innovative critical care team benefiting from a state of the art, purpose built facility.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;YOUR VALUED CONTRIBUTION&lt;/p&gt;\n&lt;p&gt;This is a determined team with exciting plans for growth and development in the future. We are looking for a skilled professional with equal vision, tenacity and flexibility in their approach. A strong team player, you will be someone who remains calm under pressure, with an ability to take charge when needed in an encouraging and supportive style. Your clear passion for high quality and compassionate patient care will be second to none.&lt;/p&gt;\n&lt;p&gt;We’d welcome the opportunity to meet you and show you what working with our brilliant team could mean for your future career.&lt;/p&gt;\n&lt;p&gt;Applicants who are unable, for personal reasons, to work full time are eligible to apply and, if successful, modification of the job content will be discussed on a personal basis in consultation with consultant colleagues.&lt;/p&gt;\n&lt;p&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. You are advised to check Spam and Junk folders as emails can sometimes go to these folders. Although references are not requested until a conditional offer is made, we would be grateful if you could provide us with email addresses for your referees when prompted by the application form&lt;/p&gt;\n&lt;p&gt;We are an equal opportunities employer, positive about disabled people and a no smoking organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Redmond Tully, Clinical Director Intensive Care Medicine Royal Oldham Hospital&lt;/p&gt;\n&lt;p&gt;0161 627 8829&lt;/p&gt;\n&lt;p&gt;redmond.tully@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Jane Lane, Directorate Manager&lt;/p&gt;\n&lt;p&gt;0161 778 5248&lt;/p&gt;\n&lt;p&gt;Jane.Lane@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Oldham Hospital, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Consultant Intensive Care Medicine and Anaestheisa or other base spec", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252622", "validThrough": "2020-11-23T23:59:59+0000"}