{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-11-05T09:31:05+0000", "description": "&lt;p&gt;Are you a dynamic, organised, motivated and enthusiastic person who would like to join our team as a Medical Secretary, who will provide support to the Clinical Business Unit (CBU) within the Emergency &amp; Medicine Division where we are committed to the continued development and improvement of a first class service.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to cover a variety of administration tasks which will include secretarial and audio typing. You will need to be able to work efficiently and accurately and work flexibly and confidentially across the Trust independently and as part of a team.&lt;/p&gt;\n&lt;p&gt;The post will be based predominately at Hinchingbrooke, but on occasion you may be required to work from Peterborough/Stamford.&lt;/p&gt;\n&lt;p&gt;If you are resilient, proactive and tenacious with a fun and friendly manner, please apply today.&lt;/p&gt;\n&lt;p&gt;As a larger organisation we have increased opportunities to enhance services ensuring we provide the best patient experience and clinical outcomes which means our staff can experience a wide and varied career within the one organisation.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting your career in an environment where your skills and ideas are valued, you are supported in developing your full potential and where your individual contribution will be recognised, respected and rewarded. to experience a wide and varied career within one Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Trust vision is&lt;em&gt; “Working together to be the best at providing outstanding care for local communities”&lt;/em&gt; and so look to appoint people who are as passionate about patient care as we are!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gillian Barber or Sue Martin on&lt;span style=&quot;text-decoration: underline;&quot;&gt;nwangliaft.mfopneurohh@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hinchingbrooke, Hinchingbrooke", "postalCode": "PE29 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3334", "longitude": "-.202658"}}, "title": "Medical Secretary - Hinchingbrooke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257062", "validThrough": "2020-11-16T23:59:59+0000"}