{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-06T12:31:18+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a fantastic opportunity for a qualified nurse/clinical trials coordinator to come and join our busy, dynamic team in the Haematology Research Unit at Denmark Hill. This is an opportunity to develop experience and knowledge of clinical research and to be part of a trials team committed to delivering high quality patient care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Being a research nurse combines traditional patient care and nursing duties with the involvement in dynamic and innovative studies which will shape the future of health care. The post holder will support an established team of research nurses and trial coordinators working across Haematological Medicine, in oncology and non-malignant disorders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for enthusiastic and motivated individuals who will be responsible for managing a portfolio of phase II and phase III clinical trials within the lymphoid and non-malignant disease areas. This is an exciting opportunity for a registered nurse with an interest in clinical research to develop clinical knowledge and research skills pertaining to novel treatment therapies for haematological patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will lead on the coordination and delivery of CLL, Lymphoma, Myeloma, Porphyria, Sickle Cell and PNH clinical trials, supported by the Lymphoid and Non-Malignant trials team at KCH. They will be key to study set-up, recruitment, ensuring protocol related assessments are completed and will be integral to the coordination of the patients enrolled into each trial. The successful candidate will be interested in clinical research, be committed to delivering a high standard of care and enjoy the challenge of working in a dynamic clinical environment. They will be supported in their professional development by an experienced Senior Research Nurse to enhance and develop clinical as well as research skills. Candidates should have excellent communication and coordination skills and attention to detail. Experience within haematology / oncology is an advantage but required training will be provided. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post can be offered as a secondment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview Dates: w/c 23rd November 2020.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDonna CassidyJob titleSenior Research NurseEmail addressdonna.cassidy1@nhs.netTelephone number02032997681&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Research Nurse/ Clinical Trials Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259664", "validThrough": "2020-11-15T23:59:59+0000"}