{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T12:16:25+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM FOR 1 YEAR DUE TO &lt;/strong&gt;&lt;strong&gt;MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from enthusiastic and motivated qualified Audiologists to join the Gwent Audiology team, which provides a full range of services throughout Gwent. This post would be suitable for newly or recently qualified Audiologists who would like to start or further their career as part of our busy and successful team. Applicants should be registered with RCCP or in the process of applying for registration.&lt;/p&gt;\n&lt;p&gt;The post is based at the Royal Gwent Hospital, Newport but the Gwent Audiology service covers two other hospitals and outlying clinics in the area, and the successful applicant will need to be prepared to travel to other clinics as required. This comprehensive service comprises full adult diagnostic and rehabilitative audiology, tinnitus management and hearing therapy, a direct access multi-professional balance clinic, audiological assessments and rehabilitation services for children of all ages from birth, a community paediatric audiology and school hearing screening, and an expanding Primary Care service. The service uses the Auditbase Audiology database and is currently fully equipped with GN Otometrics Aurical equipment at all sites.&lt;/p&gt;\n&lt;p&gt;The service is also heavily involved in training and mentoring of BSc Audiology students and supports seven ENT Consultants. The Audiology team consists of one Audiological Scientist, twenty Audiologists (including one Hearing Therapist), three Associate Audiologists and clerical support.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 22nd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Thomas, Head of Service or Wendy Trump, Head of Adult Audiology&lt;br /&gt;Tel: 01633 234390 / anne.thomas4@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital, Newport", "postalCode": "NP20 2UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5798", "longitude": "-2.99816"}}, "title": "Audiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259626", "validThrough": "2020-11-22T23:59:59+0000"}