{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T12:45:12+0000", "description": "&lt;h1&gt;&lt;strong&gt;SPECIALIST DIETICIAN&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;NEURODEVELOPMENTAL SERVICES&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Band 6&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Permanent- 0.6 wte &lt;br /&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Welcome to Your Healthcare Community Interest Company (CIC), we are a not for profit social enterprise, proud of delivering patient-led, high quality health and social care community services for people registered with a GP or residing in Kingston or Richmond.&lt;/p&gt;\n&lt;p&gt;Working as a CIC, our status allows us to invest any surplus or profit back into front line services, where it is needed most by our community. Our organisation offers access to the NHS pension scheme, career development, staff discounts, Agenda for Change terms and conditions.&lt;/p&gt;\n&lt;p&gt;We are looking for a dietitian to provide a specialist dietetic service to the Neurodevelopment (NDS) service for adults with learning disabilities living in Kingston and Richmond boroughs. You would work independently in the community but also be an integral part of a well-established and dynamic multi-disciplinary team. We can offer flexibility in working schedule (22.5 hours a week).&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic dietitian who can offer specialist dietetic advice, consultation and interventions to an agreed caseload of service users, some of whom have complex health needs and profound disabilities. The caseload includes patients with tube feeds and those who present with critical changes to food and fluid intake.&lt;/p&gt;\n&lt;p&gt;Your interventions would form part of the multidisciplinary interventions provided by the Neurodevelopmental service and so excellent communication and clinical skills are required.&lt;/p&gt;\n&lt;p&gt;If you would like to contact us to discuss any aspects of this role please contact: Deborah Green, Principal speech and language therapist, Tel: 0208 339 8005 or email&lt;/p&gt;\n&lt;p&gt;Deborah.Green@yourhealthcare.org&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the post including clinical contact with vulnerable adults the successful candidate will be required to undertake or evidence an Enhanced DBS check&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are successful at interview, please note we will take up references covering your last 3 years’ work history.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERVIEWS: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your Healthcare is an equal opportunities employer and positively encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Your Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surbiton", "postalCode": "KT5 9AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3865", "longitude": "-.292844"}}, "title": "Specialist Dietician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257696", "validThrough": "2020-11-26T23:59:59+0000"}