{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 Per Annum"}}, "datePosted": "2020-10-30T09:45:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Professional and Corporate Lead - Nutrition and Dietetics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Plymouth NHS Trust has a unique and exciting opportunity for a motivated enthusiastic and progressive individual to join our team as corporate nutrition lead and Professional Lead for the Dietetic department The successful candidate will lead the department on professional and clinical governance issues and be a source of professional expertise in the field of nutrition and dietetics for the Trust. Contributing to the Strategic Direction of the Trust, the post holder will be actively involved in service, planning and development, patient experience, retail catering and will engage with the wider Dietetic profession across the local healthcare community.  &lt;/p&gt;\n&lt;p&gt;The post holder will need to have broad demonstrable clinical experience with specialist proven knowledge in an identified clinical area and advanced proven knowledge of nutritional content and food analysis; being up to date with the NHS Agenda, national directives and modernisation initiative. The post holder should have extensive demonstrable experience of clinical supervision and line management of staff in acute and community settings and demonstrable operational management experience within a Therapy department at senior level. Demonstrable experience of service audit, evaluation, and integration of research into practice, proven knowledge of clinical governance and evidence of development of protocols are essential.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a large friendly Dietetic team who currently deliver acute inpatient , outpatient and community adult and paediatric services. You will be supported by the Therapies Service Line Manger and join the wider leadership team within Therapies and wider Trust working in close collaboration with the Director/deputy director of nursing.&lt;/p&gt;\n&lt;p&gt;If you are interested in the post and would like more information please contact Donna Pike Therapies Service Line Cluster Manager: donna.pike@nhs.net, Tel: 01752 432230.&lt;/p&gt;\n&lt;p&gt; ***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Professional and Corporate Lead - Nutrition and Dietetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249523", "validThrough": "2020-11-15T23:59:59+0000"}