{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-10-23T12:01:27+0100", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic and motivated individual to join our friendly team as an Audio Typist in the Gastro-intestinal Team within the Surgery Care Group at York Teaching Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post mainly involves the typing of dictated letters from digital dictation relating to patient care, as well as other administrative tasks such as filing, scanning, photocopying. Due to the nature of the letters in a cancer sub-specialty, there are tight deadlines for these to be produced. It is essential to have typewriting examinations and skills, and a typewriting test will form part of the interview process to check knowledge of layout and typewriting speed. Any applicant not meeting the essential criteria within the person specification will not be shortlisted.&lt;/p&gt;\n&lt;p&gt;The successful candidate must have a knowledge of office procedures and also be able to demonstrate the ability to work well under pressure, to prioritise the demands of a busy office, and manage their time and workload effectively. You will need to work unsupervised using your own initiative and able to respond quickly and efficiently. You will also need to have the ability to work as part of a team. A knowledge of medical vocabulary would be an advantage, although full training will be given.&lt;/p&gt;\n&lt;p&gt;The post is full time, although consideration will be given to suitable applicants wishing to work part time (minimum of 18.75 hours). Working days are Monday to Friday, with flexible start and finish times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Please note this vacancy may close early should we receive a high volume of applications, therefore please submit you application as soon as possible to avoid disappointment**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw, as well: as a member of our team, you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Denise Goodwin - Service Manager &lt;/p&gt;\n&lt;p&gt;denise.goodwin@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;01904 724068&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;Kimberly Wright&lt;/p&gt;\n&lt;p&gt;kimberly.wright@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;01904 724186&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Audio Typist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240433", "validThrough": "2020-11-08T23:59:59+0000"}