{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pro rata"}}, "datePosted": "2020-10-28T15:01:20+0000", "description": "&lt;p&gt;&lt;span&gt;Applications are sought from senior doctors, both hospital and community -based, for the part-time role of Medical Examiner of death at Kettering General Hospital. Additional posts are being created to join a newly-established and thriving Medical Examiner Department, as the workload expands to cover all community deaths as well as in-hospital deaths from April 2021, as required by national legislation .&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates for these posts need to evidence broad medical experience (with a minimum of 5 years post-full registration) and will need to be able to offer a regular weekly session. Applications are welcomed from General Practitioners as well as experienced hospital doctors, who are ideally in substantive career posts. Mandatory training is available on e-Learning for Health and the core modules must be completed before interview; candidates must also commit to undertake the national Face-to-Face training as soon as practicable after appointment, and to undertake the additional modules as added to the national curriculum.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Medical Examiner will act as an independent reviewer of patient deaths, will liaise with the attending team to ensure accuracy of completion of the Medical Certificate of Cause of Death (MCCD) or referral to the Coroner as appropriate. They will offer communication with the bereaved concerning the cause of death and any concerns raised. The Medical Examiner will work closely with the Medical Examiners&#39; Officers, other Medical Examiners, Mortuary staff, and with the Coroner and Registration Services. They will, as a result of their scrutiny, highlight any learning points to feed back to governance or through the Morbidity and Mortality meetings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexibility will be required because of the variable nature of the workload. Spare capacity may be used to contribute to the Trust&#39;s Mortality screening and Learning from Deaths process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Medical Examiners will have professional independence in screening deaths but will be accountable to the Medical Director, and report to the local Lead, Dr L. Twohey, and thence to the Regional and National Medical Examiners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible Working will be required - We encourage staff both Full Time and Part Time to apply. We have up to a maximum of 3 PA’s to recruit to and would encourage those who are interested and would like further information to please contact Dr Linda Twohey (&lt;/span&gt;l.twohey@nhs.net&lt;span&gt;) or Dr Manjula Natarajan (&lt;/span&gt;manjula.natarajan@nhs.net&lt;span&gt;&lt;span&gt;&lt;span&gt;). &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Hayden Barker&lt;/p&gt;\n&lt;p&gt;Job title Mortality Manager&lt;/p&gt;\n&lt;p&gt;Email address haydenbarker@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01536 492941&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Medical Examiner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247087", "validThrough": "2020-11-11T23:59:59+0000"}