{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24970", "unitText": "YEAR", "value": "£24,970 - £30,615 per annum"}}, "datePosted": "2020-11-04T17:40:36+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Rotational Registered Nurse&lt;br /&gt; Band 5&lt;br /&gt; Swale Community Services. (Sittingbourne and Isle of Sheppey)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you an engaged and caring newly qualified nurse? If so, we may have the perfect position for you! &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We know it’s not an easy task to decide which specialist area to work in once finishing your studies without gaining that hands on experience. Therefore, we are offering an innovative opportunity to complete a rotational programme across our teams to allow you to find the area that suits you best! This post is open to newly qualified nurses or nurses with experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Valued &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As one of our Registered Nurses you’ll be working as part of the NHS system in Kent where we deliver services across Dartford, Gravesend, Swale and Swanley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’ll offer you:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;AfC 20/21 salary and terms and conditions, including an NHS pension&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Flexible working to provide you with that true work / life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt; You will become part of the Virgin Tribe. This grants you access to premier offers such as discounted experience days, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;In addition to the above, you could receive an additional one-off payment of up to £2,000 as a welcome to our service – a Golden Hello from us, to you, linked to appointment and satisfactory performance.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We&#39;re looking for Band 5 Nurses with an RGN qualification and license to practice, to join our rotational scheme. This is an ideal opportunity for a new graduate but we are also looking for more skilled band 5 clinicians who want to consolidate their clinical skills and start to develop specialist skills, undertake some project work, and enhance their team working. Rotations are for 6 months and will include:  &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Community Hospital Ward&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Community Nursing &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Rapid Response &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Working closely with our other nurses, GP&#39;s and other Health care professionals you’ll be responsible for contributing to the holistic assessment, planning delivery and evaluation of care to patients within their own homes. You will be expected to implement, monitor and maintain high standards of care delivery at all times. You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an opportunity to put your NMC/ 1st level registration to great use, you will have the ability to work both independently and also as part of a wider multidisciplinary team. It is expected that you should have strong communication and organisation skills and a flexible approach which will ensure you deliver positive experiences to patients at every stage of their healthcare journey. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work to help us continue to change things for the better. We feel passionate that everyone should feel valued when they come into contact with our organisation, whether that&#39;s you, someone we care for or the wider community we operate in.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;&lt;strong&gt;Feel the Difference &lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;If you are a community nurse with NMC/1ST level Adult RN1 registration we’d love to talk to you about having you join the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Tom Noonan, Recruitment Advisor via email: &lt;/span&gt;&lt;span&gt;tom.noonan@virgincare.co.uk&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sittingbourne", "postalCode": "ME10 4DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3346", "longitude": ".73682"}}, "title": "Registered Nurse (Rotational Role)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256830", "validThrough": "2020-11-18T23:59:59+0000"}