{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-03T12:15:51+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Digital Integration Specialist&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;World renowned ROYAL PAPWORTH HOSPITAL NHS Foundation Trust has an exciting opportunity for a dynamic experienced Integration Specialist&lt;/p&gt;\n&lt;p&gt;ROYAL PAPWORTH HOSPITAL has moved to a new state of the art hospital based on the Cambridge Biomedical campus and we are looking for an experienced Integration Specialist to join our existing Applications Development team, who develop applications to support The Trust’s digital strategy and facilitate the integration of commercial systems within The Trust’s network. Key components of this are The Trust’s integration engine, Viaduct and The Trust’s data warehouse which underpins much of the BI required by The Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have technical knowledge of any Integration Engine and will have experience of integrating various clinical systems. They will require a high level of IT knowledge related to integration such as HL7 messaging and knowledge of FHIR APIs would be a distinct advantage.&lt;/p&gt;\n&lt;p&gt;In addition, specialised software such as Visual Studio and the .NET Framework, and a range of programming languages and tools such as C#, JavaScript, WinForms, MVC, WPF, MS SQL, T-SQL and SQL Server Reporting Services and SQL Server Integration Services would also be useful in this role.&lt;/p&gt;\n&lt;p&gt;A solution focused individual with a willingness to learn and adapt to the needs of the business. The candidate must have good technical and communications skills and must be able to work closely with IT, clinical and management colleagues at all levels within the Trust and has the capability to follow through on projects from inception to delivery and beyond.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity to extend your experience and knowledge in a new and exciting environment with new projects on the horizon. The successful candidate will be an enthusiastic, flexible individual with a high level of technical skills and a proven track record of delivering at pace and scale in a demanding 24/7 health care environment.&lt;/p&gt;\n&lt;p&gt;For more information please contact david.wilcox1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Cambridge Biomedical Campus, Papworth Road, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Developer - Integration Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253914", "validThrough": "2020-11-13T23:59:59+0000"}