{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a."}}, "datePosted": "2020-11-05T18:00:41+0000", "description": "&lt;p&gt;A rare and exciting opportunity has arisen at HMP Woodhill, Milton Keynes following the development of the new and innovative Enhanced Mental Health Day Unit.&lt;/p&gt;\n&lt;p&gt;The development of an Enhanced Mental Health Day Unit within HMP Woodhill will provide intensive support for those people in the prison environment who are most vulnerable and who may engage in harmful or disruptive behaviours, by providing an enhanced level of care and intervention. The unit will be psychologically informed and driven by evidence-based treatment models that aim to reduce a range of behaviours that are associated with personality difficulties and early trauma.&lt;/p&gt;\n&lt;p&gt;This post is suitable for someone who is either looking to continue to develop their skills by working within the male secure estate, or for an experienced individual who would like the challenge of working in a different environment.&lt;/p&gt;\n&lt;p&gt;You will be a confident and compassionate Clinical, Counselling or Forensic Psychologist with experience of working with complex needs and a real passion for providing support to some of the most vulnerable in society. We want to see someone who will work well with a range of professions, both within the established MDT and also with the wider prison staff, respecting and integrating a range of opinions and approaches to provide the best outcome for the men. A clinical interest in trauma informed approaches would be advantageous.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate a commitment to the provision of excellent clinical practice within secure environments. They will have excellent written and oral communication skills and be able to work with a wide range of stakeholders. Experience working in partnership and a clear understanding of the challenges of working in prison healthcare are both essential.&lt;/p&gt;\n&lt;p&gt;You will join the Mental Health team in providing evidence based and high quality care to patients. You will be a part of the wider Healthcare Team at HMP Woodhill which is comprised: Primary Care, Addictions and Pharmacy. You will also join the Offender Care team consisting of a team of multi professional clinicians and managers.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like more information, please contact Enya Chahal (Head of Healthcare) on enya.chahal1@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEnya ChahalJob titleHead of Healthcare, HMP WoodhillEmail addressenya.chahal1@nhs.netTelephone number01908 722077&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Woodhill, Milton Keynes", "postalCode": "MK4 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0147", "longitude": "-.807332"}}, "title": "Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258757", "validThrough": "2020-11-19T23:59:59+0000"}