{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-22T12:30:29+0100", "description": "&lt;p&gt;Staff Nurse - Oncology (Bank)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you want to work in an environment where you have the ability to dedicate time to care to for your patients? Do you want to work for the UK’s leading not-for-profit healthcare provider? If so, Nuffield Health is looking for an exceptional Staff Nurse at the Manor Nuffield Health Oxford Hospital. Get in touch or apply today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Oncology department currently in North Staffordshire Hospital have an opportunity for a qualified Senior Nurse to join our Oxford site. Start your journey with us whilst we’ll support you to be your best.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you are currently in the NHS or a private setting, we’re sure you will find your career with us motivating and rewarding. Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The opportunity&lt;br /&gt;&lt;br /&gt;With our consultant / nurse -led service, you will be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities. Some of the key duties, but not limited to are;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Administering systemic anti-cancer therapy&lt;/li&gt;\n&lt;li&gt;Assisting consultants during Clinics&lt;/li&gt;\n&lt;li&gt;Supporting Patients through their Cancer Journey&lt;/li&gt;\n&lt;li&gt;Providing care for Acute Oncological emergencies.&lt;/li&gt;\n&lt;li&gt;You’ll interact with practitioners from other departments because you understand the importance of continuity in patient care.&lt;/li&gt;\n&lt;li&gt;Being part of a team that constantly look for new and innovative ways to improve the care that is delivered&lt;/li&gt;\n&lt;li&gt;Educate patients in the management of their care&lt;/li&gt;\n&lt;li&gt;Be part of a family not only a team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Staff Nurse - Oncology Nurse you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;It would advantageous to have experience of Oncology Nursing&lt;/li&gt;\n&lt;li&gt;To have, or be working towards a Qualification in the administration of systemic anti-cancer therapy&lt;/li&gt;\n&lt;li&gt;To work flexible hours to suit the department Monday to Friday&lt;/li&gt;\n&lt;li&gt;To be an excellent communicator and team worker – flexible and motivated.&lt;/li&gt;\n&lt;li&gt;Have the ability to fully understand each patient’s needs and provide individual attention.&lt;/li&gt;\n&lt;li&gt;Mentor staff in the administration of SACT and be part of the education of the wider team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Qualifications&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RGN or equivalent qualification&lt;/li&gt;\n&lt;li&gt;Has or working towards a university accredited course in the administration of systemic anti-cancer therapy with hands on experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - £ 25/hour&lt;br /&gt;Location - Oxford&lt;/p&gt;\n&lt;p&gt;Hours - Bank contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7603", "longitude": "-1.21546"}}, "title": "Bank Oncology Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238427", "validThrough": "2020-11-21T23:59:59+0000"}