{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T12:01:19+0000", "description": "&lt;p&gt;Are you passionate about working with working age adults with acute mental health needs?&lt;/p&gt;\n&lt;p&gt;We are seeking a Band 5 Occupational Therapist who is motivated and able to work in a recovery focused way to join our inpatient multi-disciplinary team at Ward B2 currently based at Bassetlaw Hospital. In the near future, there is a potential move to a new site on the outskirts of Mansfield.&lt;/p&gt;\n&lt;p&gt;You need to be a motivated and compassionate individual who is committed to delivering high quality person-centred care with a clear focus on recovery. You will receive supervision from the ward manager and Senior Occupational Therapist. Occupational Therapy service delivery meetings offer opportunities to network with OT colleagues across the directorate, provide peer support and training that contributes to continuing personal and professional development.&lt;/p&gt;\n&lt;p&gt;As an Occupational Therapist you are a key member of the multidisciplinary team working in partnership with adults; undertaking specialist occupational therapy assessments and contributing to multi-disciplinary treatment and care planning.&lt;/p&gt;\n&lt;p&gt;You will need to have a BSc in Occupational Therapy or equivalent. You need to have current HCPC registration. It is essential that you have experience in working with people with mental health conditions and have a working knowledge of occupational therapy assessments and interventions for this client group. You will need to have good risk assessment skills and be able to manage your own caseload often with service users who have complex needs. It is also essential for you to have a positive attitude towards people with mental health needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Clare Middleton, Acting Ward Manager on claire.middleton@nottshc.nhs.uk or 01909 572032&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please feel free to make contact with the ward to arrange a visit or discuss further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bassetlaw Hospital, Worksop. Moving to Mansfield", "postalCode": "S81 0BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248244", "validThrough": "2020-11-10T23:59:59+0000"}