{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754"}}, "datePosted": "2020-11-06T13:00:17+0000", "description": "\n\n\n\n\n&lt;p&gt;&lt;strong&gt;  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join the RUH Team and be part of the &quot;the biggest, boldest, hospital building programme in a generation … [initiating] more than 40 new hospital projects across the country” (SoS) (HIP2). &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As one of 21 hospitals selected as part of phase 2 (HIP2) the Royal United Hospitals Bath (RUH) NHS Foundation Trust has ambitious plans to seize this opportunity to achieve better outcomes and experiences for patients and families through integrated care using innovations that work&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As the Senior Programme Manager, working with a team of colleagues,  you will be responsible for the planning, development, implementation and management of a comprehensive HIP2 Programme Management Function across all asepcts of the RUH HIP2 Programme.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a senior post within the RUH HIP2 Programme Team and, working with Programme/Project Workstream Leads, you will be responsible for planning, identifying and reporting against key metrics, the preparation of reports and ultimately the development and implementation of high-quality standards ensuring that the Programme is managed and delivered effectively.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will ideally possess a programme management qualification and have a good understanding of how programmes and projects should be effectively managed and governed in a healthcare capital projects environment, demonstrating the ability to apply such knowledge and experience in a practical way.  You will also need to demonstrate an ability to work effectively and proactively with programme and project workstream leads and the wider organisation in order to deliver outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reporting directly to the Programme Director you will establish swiftly effective delivery relationships with Members of the Programme Board, workstream leads as well as with specialist advisors and staff within and out with the HIP2 Programme Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n\n\n\n\n\n&lt;p&gt;&lt;strong&gt; If you possess the commitment, enthusiasm and resilience to fill this high profile new role we would like to hear from you.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "HIP2 Senior Programme Manager - Band 8D", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259777", "validThrough": "2020-11-20T23:59:59+0000"}