{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata Per Annum"}}, "datePosted": "2020-11-03T15:16:01+0000", "description": "&lt;p&gt;&lt;strong&gt;This post offers full time (37.5 hours per week) and part time hours &lt;/strong&gt;&lt;strong&gt;(minimum of 15 hours)&lt;/strong&gt; &lt;strong&gt;for experienced Health Care Assistant positions, within our emergency department at Doncaster Royal Infirmary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join our welcoming and helpful Trust as a highly valued team member providing safe and effective care to our patients.&lt;/p&gt;\n&lt;p&gt;Our Healthcare Assistants (HCAs) provide some of the most personal and fundamental support to our patients so if you are kind, compassionate and you always act in the best interests of others, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;You will work alongside nurses and other healthcare professionals to provide a positive experience to our patients and their relatives at times of need. You will support patients in various ways such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;washing and dressing&lt;/li&gt;\n&lt;li&gt;toileting&lt;/li&gt;\n&lt;li&gt;bed making&lt;/li&gt;\n&lt;li&gt;serving patients meals/assisting with feeding&lt;/li&gt;\n&lt;li&gt;helping people to mobilise&lt;/li&gt;\n&lt;li&gt;assisting with patients&#39; overall comfort&lt;/li&gt;\n&lt;li&gt;monitoring patients&#39; conditions by taking temperatures, pulse, respirations and weight – national early warning scores (NEWS)&lt;/li&gt;\n&lt;li&gt;providing encouragement to lifestyle and behaviour changes&lt;/li&gt;\n&lt;li&gt;developing skills associated with being a new parent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The care that you will provide is paramount to our ability to provide high quality and safe services which run 24 hours 7 days a week. You will be required to work flexibly as your working rota will include nights, weekends, and bank holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an excellent communicator, able to prioritise considering the variety of patients’ needs and also able to follow instructions.&lt;/p&gt;\n&lt;p&gt;We have a variety of vacancies for Health Care Assistants including part-time (minimum of 15 hours) and full-time positions working within the Accident &amp; Emergency Department. All Healthcare Assistants will complete an Induction programme and the Care Certificate if required.&lt;/p&gt;\n&lt;p&gt;We believe that the best care to our patients and community is provided by a professional and motivated team, so we invest heavily in training and education. There will also be lots of opportunities to support your development and improve your skills.&lt;/p&gt;\n&lt;p&gt;At Doncaster &amp; Bassetlaw Hospitals NHS Foundation Trust you’ll be backed and rewarded by a team that’s proud to support its staff in all aspects of their lives. If you are up to the challenge, submit an application to become part of team DBTH.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note you will have to provide evidence of your original certificates for NVQ2, Diploma, QCF Intermediate apprenticeship in health and social care if your application is successful. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Jacqueline Crossland - Matron, jacqueline.crossland@nhs.net, 01909 572184&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bassetlaw, Worksop", "postalCode": "S81 0BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Trained Healthcare Assistant - A&amp;E - BDGH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254505", "validThrough": "2020-11-17T23:59:59+0000"}