{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Salary dependent on experience"}}, "datePosted": "2020-10-29T15:40:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistant | Theatres | Salary dependent on experience | Bushey | Full Time/Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bushey Hospital are looking for an experienced Healthcare Assistant to join our Theatres team on a full time basis. You will be working on a rota that covers the hours of 7am – 9pm Monday to Friday and on average one Saturday per month.&lt;/p&gt;\n&lt;p&gt;Spire Bushey Hospital is one of North London and Hertfordshire’s leading private hospitals, with an excellent reputation for delivering high-quality private hospital treatment. The hospital has been treating patients for over 35 years and has over 400 consultants. All of our consultants are highly experienced and many enjoy national and international reputations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assisting the Theatre team in the provision of exemplary patient care&lt;/li&gt;\n&lt;li&gt;Contributing to the support and monitoring of patients&lt;/li&gt;\n&lt;li&gt;Identifying and reporting any significant changes that might affect the patient’s health and well-being to the appropriate person&lt;/li&gt;\n&lt;li&gt;Assisting with the movement of patients in line with hospital policies&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience of working as an HCA (or equivalent) in a theatre environment&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills are essential&lt;/li&gt;\n&lt;li&gt;NVQ Level 2 or 3&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bushey", "postalCode": "WD23 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6375", "longitude": "-.331543"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248900", "validThrough": "2020-11-29T23:59:59+0000"}