{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-26T09:46:31+0000", "description": "&lt;p&gt;We are looking to appoint an enthusiastic Deputy Chief Pharmacist who is keen to use their extensive experience, clinical knowledge and skills to deliver outstanding pharmacy services. It is an exciting time to join the Shrewsbury &amp; Telford NHS Trust which is undergoing a period of transformational change following £312m of NHSE capital investment. This will fund significant infrastructural development with a strong focus on improving patient safety and outcomes whilst adding value to the Trust and the wider NHS.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have been in roles involving managing hospital pharmacy services, demonstrating excellent clinical leadership skills and be a strategic thinker with an ability to drive sustainable quality improvement.&lt;/p&gt;\n&lt;p&gt;We need someone who will be a role model for our pharmacy service, having strong leadership, organisational and governance skills. The post holder will manage a team of senior pharmacists and pharmacy technicians, build effective relationships across the Trust and ensure that robust governance systems are in place and work with other key clinical colleagues to develop new models of providing patient centred care.&lt;/p&gt;\n&lt;p&gt;Applicants must have a track record of leading change, delivering improved outcomes and working with a variety of clinical teams in different care settings.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for overseeing the delivery of the Pharmacy elements of the Trusts Hospital Transformational Plan, improving digital systems such as EPMA and planning for the development of a sustainable clinical pharmacy workforce across the health economy . They will be required to deputise for the Chief Pharmacist internally and externally at local and regional forums.&lt;/p&gt;\n&lt;p&gt;You should have significant experience within hospital pharmacy and be able to demonstrate your ability to effectively lead a team and develop productive working relationships across the multidisciplinary team and as part of wider pharmacy networks. We are committed to supporting you to develop your clinical pharmacy practice and will work with you to identify opportunities based on your previous experience, for example non-medical prescribing within a clinical specialty.&lt;/p&gt;\n&lt;p&gt;Shropshire is an area of outstanding natural beauty and offers extensive outdoor recreational opportunities and easy access to North Wales and the Welsh Coast. Housing standards are high across the county with good local state and private Schools. The M54 motorway starts just outside Shrewsbury and provides quick access to the national motorway network.&lt;/p&gt;\n&lt;p&gt;If you are interested in this role and considering applying, we would encourage you to get in touch with us to arrange an informal discussion and/or visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Deputy Chief Pharmacist- Medicines Optimisation and Transformation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241906", "validThrough": "2020-11-09T23:59:59+0000"}