{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T09:16:15+0000", "description": "&lt;p&gt;Band 6 Occupational Therapist Fixed term contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Band 6 Community Occupational Therapist who wishes to further develop their clinical and leadership skills within the Rehabilitation and Enablement team based in Dunstable. This will be for a fixed term of 1 year to cover maternity leave. This multi-disciplinary team aims to prevent unnecessary hospital admissions and accelerate hospital discharges. The team comprises of Community Occupational Therapy, Community Physiotherapy, Intermediate Care and Neurological Rehabilitation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining a friendly, dedicated and supportive team where professional guidance is readily available from Band 6 colleagues and our Band 7 physiotherapist and occupational therapists. You will need excellent communication and time management skills, and sound clinical knowledge. A flexible approach is required to accommodate the changing needs of the service along with the drive to influence service development.&lt;/p&gt;\n&lt;p&gt;We are passionate about patient centred care, support our clinicians to lead and deliver excellent and compassionate services and value our clinical teams as the real heart of the NHS.&lt;/p&gt;\n&lt;p&gt;Our Trust is known for offering excellent training, personal development programmes, supportive coaching and competency frameworks; all to support enhanced skills and career development which meet the goals and aspirations of the individual.&lt;/p&gt;\n&lt;p&gt;It is essential that you possess a full valid driving licence and have access to a car to use regularly for business purposes. Good IT skills are required for electronic patient records and equipment ordering.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to work flexibly across 7 days covering weekends and Bank Holidays on a rota basis.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post further or if you would like to visit the service, please contact Louise Hughes 07967 170547 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DUNSTABLE", "postalCode": "LU6 3JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8831", "longitude": "-.519879"}}, "title": "Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249458", "validThrough": "2020-11-22T23:59:59+0000"}