{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "From £31,365 per annum"}}, "datePosted": "2020-11-03T16:16:49+0000", "description": "&lt;p&gt;BANES IAPT is recruiting a HI CBT Therapist to work as part of the IAPT programme. You will be part of a multi-professional workforce that is significantly increasing access to treatment for people with depression, anxiety and other mental health conditions, within a community setting. You will be enthusiastic, hard-working and have the capability to meet specified targets. You will have experience in working within an IAPT service and an understanding of the stepped care model of service delivery.&lt;/p&gt;\n&lt;p&gt;Avon and Wiltshire Mental Partnership NHS Trust (AWP) is a significant provider of high quality mental health services across a core catchment area covering Bath and North East Somerset (B&amp;NES).&lt;/p&gt;\n&lt;p&gt;The post-holder will work within the service to provide, the delivery of brief, high intensity psychological interventions. The post holder will also offer assessments, reviews and treatment for people presenting to the service. As a service we offer flexible appointments, which will involve evening working.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join an established team and will be supported by a Clinical Lead and Clinical Supervisors.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication skills and the ability to work in a high volume service.&lt;/p&gt;\n&lt;p&gt;Part Time working will also be considered - minimum of 30 hours per week&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:   Tammy Ridlington or Rachael Armstrong 01225 675150&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillview Lodge, Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Band 6 Senior Psychology Practitioner - Hillview Lodge, Bath", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254764", "validThrough": "2020-11-17T23:59:59+0000"}