{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa"}}, "datePosted": "2020-11-03T15:30:12+0000", "description": "&lt;p&gt;&lt;strong&gt;THE ROTHERHAM NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow in Anaesthetics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Appointment for a period of one year&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is looking to appoint two Senior Clinical Fellows to join our expanding anaesthetic team at The Rotherham NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;These posts would be for twelve months initially, extended up to twenty-four months’ subject to mutual agreement. Applications are invited for those with greater than eighteen months of anaesthetic and/or critical care experience.&lt;/p&gt;\n&lt;p&gt;The successful applicants will work as part of a dynamic and experienced team to deliver the anaesthetic and critical care service at Rotherham, covering a range of surgical specialities commensurate with a busy 600 bed hospital with obstetric and paediatric services.&lt;/p&gt;\n&lt;p&gt;The successful candidates would benefit from directly supervised lists and the opportunity to develop areas of expertise as outlined in the job pack.&lt;/p&gt;\n&lt;p&gt;We have strengths and expertise in research, regional anaesthesia, day case anaesthesia and education and management and would welcome enquiries about specific opportunities in these and other areas. The fellows would participate in an on call rota up to a 1:8 frequency covering theatres, obstetrics and critical care working as part of a team and under the supervision of consultant colleagues.&lt;/p&gt;\n&lt;p&gt;We are confident that we can deliver an excellent experience tailored to the successful individuals who would be valued members of our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are strongly encouraged to visit the department. For further information and to arrange a visit, please contact Katy Shuker, Fellowship Consultant Lead katy.shuker@nhs.net or Alison Colhoun, Consultant alison.colhoun1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Senior Clinical Fellow in Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254552", "validThrough": "2020-11-20T23:59:59+0000"}