{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive + enhancements for OOH shifts"}}, "datePosted": "2020-11-02T09:33:56+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Greenbrook Healthcare – Together, we deliver the future of Urgent Care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Emergency Practitioner&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible shifts available on weekdays, weekends, evenings and overnight&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Bank or SLA&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Competitive hourly rates plus enhancements for OOH shifts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Location: Posts available at various locations in our South East London region of services (see below for further information)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ref: GB02EP-SE&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for qualified and experienced Emergency Nurse Practitioners/Emergency Care Practitioners to join us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Greenbrook Healthcare is the leading provider of primary care led urgent treatment centres across London and the surrounding areas, leading innovation in this field to deliver and continuously improve high quality patient focused care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our urgent treatment centres are designed to see, treat and discharge or refer both walk-in and ambulatory patients whose injuries or illnesses are not so serious as to need full emergency department care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Greenbrook, our first priority is to our patients, providing them with excellent, safe, high quality and timely care. We understand that to achieve this, our emergency practitioners need to have the time to do the work they trained for – treating patients, so we ensure our clinicians and operational staff are well supported by strong clinical and operational management teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations and Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have full or part time positions available in each of our services across our South East London region, these are:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Urgent Treatment Centres&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Princess Royal University Hospital UTC (Orpington, South East London)&lt;/li&gt;\n&lt;li&gt;Beckenham Beacon UTC (Beckenham, South East London)&lt;/li&gt;\n&lt;li&gt;Queen Elizabeth Hospital UTC (Woolwich, South East London)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an emergency nurse/care practitioner you will work alongside a wider team of emergency practitioners (ENPs and ECPs), general practitioners and operational staff to deliver unscheduled care to patients that present with complex and/or chronic illness and injuries.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will autonomously undertake assessment of wide array of patient presentations to determine a clinical diagnosis, provide treatment and appropriately discharge, while maintaining patient records.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our emergency practitioners typically treat patients with minor injuries and support our general practitioners in seeing and treating minor illnesses where they have the relevant training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A full list of duties and responsibilities can be found in the job description.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Requirements&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join a leading provider pioneering the future of Urgent Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our ideal candidate will be an experienced Emergency Nurse or Emergency Care Practitioner with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minor injuries training (level 6 or above) – including x-ray interpretation, suturing, plastering, management of complex wounds and injury skills&lt;/li&gt;\n&lt;li&gt;A minimum of one-year consolidated practice as an Emergency Practitioner&lt;/li&gt;\n&lt;li&gt;Competence in autonomous assessment, examination, diagnosis and treatment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It will be highly beneficial if you have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minor illness training (level 6 or above) – including common minor illness&lt;/li&gt;\n&lt;li&gt;A prescribing qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work with us? We can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive hourly rates plus enhancements for OOH shifts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexibility in how and when you choose to work for us – pick up ad-hoc sessional work by joining our bank of nurses or secure guaranteed shifts through an SLA&lt;/li&gt;\n&lt;li&gt;An opportunity to work across multiple UTCs, creating your own portfolio role, built around your interests and availability&lt;/li&gt;\n&lt;li&gt;Access to internal educational events, peer to peer learning sessions and more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Apply now or contact our recruitment team for further information or to arrange an informal visit to any site listed above: 020 8607 1915 or recruitment@greenbrookhealthcare.com&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Disclosure and Barring Service Check&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/133614.jpg", "name": "Greenbrook Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133614"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South East London", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Bank Emergency Nurse/Care Practitioner (ENP/ECP) (Band 7-8a) SE London", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251433", "validThrough": "2021-01-31T23:59:59+0000"}