{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15469", "minValue": "14404", "unitText": "YEAR", "value": "£14,404 - £15,469 pro rata"}}, "datePosted": "2020-11-06T13:46:17+0000", "description": "&lt;p&gt;An opportunity has arisen for enthusiastic Band 2 Community Support Workers to join our Intermediate Care Rehabilitation Therapy team her in the East Dorset Locality. We aim to deliver a high quality rehabilitation/care service to patients in both their homes and within the local Community Hospital.&lt;/p&gt;\n&lt;p&gt;Are you looking for a career in the NHS then apply and become an integral part of the team providing high quality care/rehabilitation to patients, learning from colleagues, including nurses, physiotherapists and Occupational Therapists.&lt;/p&gt;\n&lt;p&gt;There is opportunity to progress within this role and the Trust also offers career development via Apprentership’s. Working for Dorset Community Health Services can offer you many benefits including, membership of the NHS Final Salary Pension Scheme, generous annual leave and occupational entitlements etc.&lt;/p&gt;\n&lt;p&gt;You will need to hold a valid UK Driving License and have access to a car for work.&lt;/p&gt;\n&lt;p&gt;Our shift patterns are: Early 08.00 – 18.00hrs / Late 10.00 – 20.00hrs, 7 days a week on a rota system, this includes some weekend working.&lt;/p&gt;\n&lt;p&gt;If this job is what you are looking for then please apply.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Van den Akker, Team Lead, Email address: sue.vandenakker@nhs.net, Telephone number: 01202584209&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "STL, Hants", "postalCode": "BH24 2RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8179", "longitude": "-1.85603"}}, "title": "Community Support Worker, Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259976", "validThrough": "2020-11-22T23:59:59+0000"}