{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66227", "minValue": "56060", "unitText": "YEAR", "value": "KCL Grade 8 £56,060 - £66,227 per annum inc LWA"}}, "datePosted": "2020-10-02T10:20:49+0100", "description": "&lt;p&gt;This role provides an exciting opportunity for a dynamic and enthusiastic individual to join the leading clinical PET centre in the UK. The Centre is part of both King&#39;s College London&#39;s Faculty of Life Sciences and Medicine, and Guy&#39;s and St Thomas&#39; NHS Foundation Trust. It includes a purpose designed scanning suite with two GE Discovery 710 PET-CT scanners and a Siemens Biograph mMR PET-MR scanner at St Thomas’, and a third Siemens Biograph PET-CT scanner in the Cancer Centre at Guy&#39;s. Our work includes providing a clinical PET service for &gt;8,000 patients per year from across South East London as well national referrals from other UK centres. We also carry out clinically related research with collaborators from the Hospital, the Medical School and other institutions. Clinical and research imaging capabilities are greatly enhanced by our on-site cyclotrons and radiochemistry laboratories, with tracers produced to GMP standards.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the day to day management of the PET Centre facilities and staff, ensuring the provision of high quality, safe clinical and research PET-CT and PET-MR imaging services to patients, referrers, research subjects and researchers. They will report to the Head of the PET Imaging Centre and the School Director of Clinical and Research Imaging Operations. They will work closely with clinical and academic leads within the PET Centre, and will also link with the School’s wider Imaging Clinical Research Facility that includes 3 x 3T, 2 x 1.5T and a 7T MRI system.&lt;/p&gt;\n&lt;p&gt;Key qualities required for this post are the ability to manage all aspects of the operational and business activity of the PET Centre, including personnel, budget planning, monitoring and reporting, marketing and strategic planning. Whilst applicants who are already experienced in radio-isotope imaging may be preferred, we would also encourage those with other NHS management experience to apply for this post. An important criterion for selecting the successful post holder will be their drive and vision to grow and support the research imaging portfolio in tandem with delivering the clinical services in line with NHSE contracts and expectations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will be based mainly at St Thomas’ Hospital and the post holder will be required to work flexibly between 8:30am and 7:00pm, as requested. Occasional weekend work may also be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;This post is subject to Disclosure and Barring Service and Occupational Health clearance.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;This advertisement does not meet the requirements for a Certificate of Sponsorship under Home Office regulations and therefore the university will not be able to offer sponsorship for this role.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4953", "longitude": "-.091064"}}, "title": "PET Centre Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210025", "validThrough": "2020-11-08T23:59:59+0000"}