{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T15:46:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Emergency Care Manager - &lt;/strong&gt;Band 8a&lt;/p&gt;\n&lt;p&gt;City and County base with some home working and travel&lt;/p&gt;\n&lt;p&gt;The Leicester, Leicestershire and Rutland (LLR) CCGs are progressing plans to appoint to a single senior leadership team.&lt;/p&gt;\n&lt;p&gt;The Integration and Transformation Directorate is a newly formed directorate with the mandate to design and deliver health and care services for the population of Leicester, Leicestershire &amp; Rutland. The directorate portfolio includes primary care, community care, urgent care services, planned care and cancer services, children and maternity services and mental health and LD services.&lt;/p&gt;\n&lt;p&gt;The Emergency Care Manager is a key role within the Urgent and Emergency Care team and plays and important part in helping to improve and manage the urgent care system across LLR.&lt;/p&gt;\n&lt;p&gt;The post will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post is responsible for providing service improvement, redesign and project management expertise including development of schemes within the Urgent &amp; Emergency Care transformation programme.&lt;/li&gt;\n&lt;li&gt;The post holder will have particular responsibility in the first instance for schemes relating to reducing demand for emergency care and preventing ‘inflow’ to emergency departments, although specific project areas may change over time.&lt;/li&gt;\n&lt;li&gt;The post holder will define current processes, identify opportunities for improvement, facilitate discussions and advise how best practice might be adopted in the definition of future processes, document new processes as they are agreed and oversee their delivery including developing business cases for approval and supporting implementation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be shortlisted, you will need to demonstrate the essential criteria in the job description, summarised below.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education / Training / Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Masters degree or equivalent demonstrable post graduate level learning or equivalent experience&lt;/li&gt;\n&lt;li&gt;Evidence of continuing professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Knowledge &amp; experience &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of planning and delivering programmes across organisational boundaries with multiple stakeholders&lt;/li&gt;\n&lt;li&gt;Track record of delivery of significant change programmes through professional knowledge and skills including working with clinical staff&lt;/li&gt;\n&lt;li&gt;Experience of developing business cases&lt;/li&gt;\n&lt;li&gt;Experience of leading patient and public involvement activities&lt;/li&gt;\n&lt;li&gt;Experienced in using service improvement techniques such as demand and capacity modelling, pathway redesign and process mapping.&lt;/li&gt;\n&lt;li&gt;Experience of all commissioning activities; needs assessment, procurement, service design, redesign and review, service specification development, market development, contract and performance management and review.&lt;/li&gt;\n&lt;li&gt;Knowledge of competition and procurement policies and processes.&lt;/li&gt;\n&lt;li&gt;Knowledge of developing QIPP/Cost improvement and efficiency plans&lt;/li&gt;\n&lt;li&gt;Awareness of Equality &amp; Valuing Diversity Principles and experience of using these in service improvement projects&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Abilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Analyse and provide highly complex, sensitive and contentious information,&lt;/li&gt;\n&lt;li&gt;Persuade board and senior managers of the respective merits of different options, innovation and improvement opportunities.&lt;/li&gt;\n&lt;li&gt;Negotiate on difficult and very complex and detailed issues.&lt;/li&gt;\n&lt;li&gt;Ability to analyse complex facts and situations and develop a range of options.&lt;/li&gt;\n&lt;li&gt;Takes decisions on difficult and contentious issues where there may be a number of courses of action.&lt;/li&gt;\n&lt;li&gt;Strategic thinking – ability to anticipate and resolve problems before they arise.&lt;/li&gt;\n&lt;li&gt;Ability to carry out procurements for highly detailed, high value contracts that require analysis, comparison and assessment.&lt;/li&gt;\n&lt;li&gt;Ability to work under pressure and to tight and often changing deadlines&lt;/li&gt;\n&lt;li&gt;Ability to make decisions autonomously, when required, on difficult issues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interpersonal Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Able to negotiate, communicate effectively, and build rapport and effective relationships at senior and junior levels&lt;/li&gt;\n&lt;li&gt;Able to provide and receive highly complex, sensitive or contentious information; negotiate with senior stakeholders on difficult and controversial issues, and present complex and sensitive information to large and influential groups.&lt;/li&gt;\n&lt;li&gt;Can work across organisational boundaries to build and operate within or lead effective cross-functional teams to achieve goals&lt;/li&gt;\n&lt;li&gt;Good facilitation skills; able to lead meetings with senior managers effectively.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Mobility &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Car driver / owner or reasonable alternative due to travel required across Leicestershire, and other locations as required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interviews for this post will take place via MS teams w/c 19th October 2020&lt;/p&gt;\n&lt;p&gt;Closing date 7th October&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTamsin HootonAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to discuss your application, please contact Tamsin Hooton 07714 750062&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester City CCG, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Emergency Care Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256480", "validThrough": "2020-11-22T23:59:59+0000"}