{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 to £39,681 pa inc. HCAS"}}, "datePosted": "2020-11-05T12:45:14+0000", "description": "&lt;h1&gt;&lt;strong&gt;A&amp;E Band 6 Deputy Sister / Charge Nurse&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Ashford and St Peter’s Hospitals NHS Foundation Trust’s Adult Emergency Department is based at St. Peter’s Hospital and is undergoing major process and building redesign and we are looking for band 6 Deputy Sister / Charge Nurses to help drive through improvement and service redesign. We are looking for staff to join us who are enthusiastic, hardworking, dedicated and have a passion for delivering the best care to all our patients. We are a dynamic, friendly and supportive team rising to the challenges and hard work required in achieving our Clinical Quality Indictors.&lt;br /&gt; &lt;br /&gt; The department encourages staff to develop both clinically and managerially and we provide a comprehensive induction programme, weekly multi-disciplinary teaching sessions and in-house training. Duties for this post will include clinical duties such as assessing, planning, delivery and evaluation of nursing care, supporting colleagues in providing care, and providing leadership to the nursing team. &lt;br /&gt; &lt;br /&gt; We are looking for RGN level 1 nurses ideally with a minimum of 18 months post registration experience at Senior Band 5 or equivalent. ENB 199 (Accident &amp; Emergency Nursing Course), study to Degree (Level 6) in a clinically focused Emergency Care Course or equivalent are desirable. Experience in the use of extended roles would be an advantage. &lt;br /&gt; &lt;br /&gt; Working with the multi-disciplinary team, you will need to have excellent communication skills, both written and verbal, and the ability to motivate and manage, adapting, driving and leading rapidly changing situations. &lt;br /&gt; &lt;br /&gt; If you require any further information or would like an informal visit please contact Tina Taylor or Sarah Moth, Acute Care Matrons on 01932 7222091 or via email at martina.taylor1@nhs.net or sarah.moth1@nhs.net .&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Deputy Sister/Charge Nurse, Emergency Department - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257697", "validThrough": "2020-11-26T23:59:59+0000"}