{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 per annum"}}, "datePosted": "2020-10-28T17:01:02+0000", "description": "&lt;p&gt;&lt;strong&gt;The East Suffolk and North Essex Foundation Trust recognises to meet the needs of the population it serves, a multidisciplinary workforce that delivers and promotes advance practice, skills and knowledge is essential. Therefore the Older Persons services are looking to expand its medical cover across the community hospitals to include the Advanced Clinical Practitioner role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As the Advanced Clinical Practitioner you will be integral in supporting the Multidisciplinary Team in the provision and delivery of the day to day acute and complex care within community hospital setting. You will be a pioneering practitioner who is clinically sound with up-to date knowledge of older person’s medicine and care, providing the highest standard of individualised care to patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for candidates who have either completed the qualification, or are currently on the Master’s Degree course. However this role has the opportunity to be a developmental post, enabling suitable candidates to develop through the completion of a Master’s Degree in Advanced Clinical Practice. As a minimum, suitable trainee candidate should already possess an Independent Non-Medical Prescribing and Clinical Assessment qualification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will be supported by the completion of all clinical and academic practice demonstrated by the completion of a trust competency document within a set timeframe and will encompass a 7-day working pattern across all shifts. In due course the role will be incorporated on to the wider Older Peoples medical Rota.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Nurse Renée Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone 01473 712233 ext 6318 Email Address renee.ward@esneftl.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich, Suffolk", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247452", "validThrough": "2020-11-08T23:59:59+0000"}