{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T12:12:57+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Are you a Registered Band 5 or about to qualify as an Adult Nurse&lt;/strong&gt;&lt;span&gt; looking for a challenge in a community setting? Come and join our Community Nursing Teams in the Crediton, Moretonhampstead and Okehampton Cluster and help us to continue providing high quality and innovative care to the people of Okehampton in the comfort of their own homes within a beautiful rural environment and vibrant Market Town. We have a supportive and dynamic management team who truly value staff wellbeing and development.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be part of an integrated health and social care team consisting of GP’s, Nursing staff, OT’s, Physio’s, Urgent Community Response Support workers and Social care team, who are responsible for the planning, implementation and evaluation of the patients’ needs and the delivery of high quality care. You will be supported in your role by a Nurse Specialist (Community) and the operational management team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for a nurse who has a current driving license and attributes to form part of a dynamic team to deliver innovative care to our patients. For those wishing to further their career within the community setting the Trust offers the opportunity to undertake the Specialist Practitioner Qualification in District Nursing. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you ready for a challenge? If you have the appetite to work as part of a team that is setting out on this transformational journey and want to play a part in our change story we would love to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome enquiries about this role before or during your application process and strongly encourage applicants to visit. If you would like to find out more or arrange an informal visit then please feel free to contact Nigel Biernacki (Community Nurse team manager) nigel.biernacki@nhs.net 07595 245 021&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We look forward to hearing from you!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Okehampton", "postalCode": "EX20 1PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7419", "longitude": "-3.99737"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240454", "validThrough": "2020-11-13T23:59:59+0000"}