{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-26T09:21:00+0000", "description": "&lt;p&gt;Applications are invited for a full time (10 PAs + 1 additional programmed activity) Consultant Psychiatrist in Learning Disabilities.&lt;/p&gt;\n&lt;p&gt;At Mersey Care we are passionate about mental health and wellbeing, and delivering the best possible care for the people we serve. Quality, recovery and wellbeing are at the heart of everything that we do.&lt;/p&gt;\n&lt;p&gt;We are offering a 10 PA position. The post holder will have responsibility for the assessment, management and care of patients with intellectual disability within Sefton community LD team which includes GPs within the Southport and Formby CCG patch. This will include providing medical support to patients who have suspected or established comorbid mental disorder or significant behavioural disturbance. This will involve clinics at the team base and home visits. There is the provision of 1 core trainee and 1 specialist trainee which is jointly shared with the south sefton consultant. The community LD team comprises of nurses, support workers, psychology, speech therapy, occupational therapy and physiotherapy.&lt;/p&gt;\n&lt;p&gt;We offer dedicated administrative support and office accommodation which co-located with general psychiatry services. The current team base is undergoing new development to a new purpose built site in Southport by 2020.&lt;/p&gt;\n&lt;p&gt;The Trust is focused on driving change and innovation by supporting and enhancing the leadership role of our senior clinicians and this role would offer opportunities for you to lead and develop excellent practice in the field.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;** Job Description Updated April 2019 **&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Sakib Shamas-Ud-Din&lt;/p&gt;\n&lt;p&gt;sakib.shamas-ud-din@merseycare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hesketh Centre, Southport", "postalCode": "PR9 0LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6561", "longitude": "-2.99243"}}, "title": "Consultant Psychiatrist in Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241832", "validThrough": "2020-11-24T23:59:59+0000"}