{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "63792", "minValue": "54959", "unitText": "YEAR", "value": "£54,959 - £63,792 per annum (incl of HCAS)"}}, "datePosted": "2020-10-22T14:00:43+0100", "description": "&lt;p&gt;&lt;strong&gt;Principal&lt;/strong&gt;&lt;strong&gt; Clinical Psychologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Older People’s Mental Health &lt;/strong&gt;&lt;strong&gt;Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newbury/Reading/Wokingham – Host Locality to be determined&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8b, full time permanent post (part time considered)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to join a well-established multi-disciplinary service for older people with dementia and complex mental health problems. The post will be based in one of our locality teams although you will be required at times to work across Berkshire to deliver responsive services.&lt;/p&gt;\n&lt;p&gt;You will be enthusiastic about leading psychological provision within multi-disciplinary teams to improve the experience and outcomes for older people. We need you to have a good grounding in evidence-based psychological interventions of relevance to the client group and neuropsychological assessment.&lt;/p&gt;\n&lt;p&gt;You will be joining a supportive service, where psychologists work closely with other professionals and agencies to offer high-quality care. You will be expected to work autonomously within professional guidelines and according to relevant policies and procedures and to lead on service developments and governance initiatives both within the locality and across the Trust as required. You will be supported in your continuing professional development.&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare is committed to compassionate care and is rated ‘Outstanding’ by CQC. It offers the full range of mental health and community services, and psychologists contribute to these as integrated members of clinical teams. Whilst there is a strong ethos of multi-disciplinary team working, you will also be part of a network of psychologists and psychological therapists across Berkshire. We have excellent links with the Oxford Clinical Psychology Course, Reading University and the Charlie Waller Institute and provide regular trainee clinical and counselling psychologist, and psychotherapist placements.&lt;/p&gt;\n&lt;p&gt;Candidates must hold a UK recognised qualification in clinical psychology and have current UK professional registration with the Health and Care Professions Council as such. In addition, they must have undertaken further specialist training relevant to older people’s services. An enhanced DBS check is required, and you will need to travel between bases in Berkshire as required.&lt;/p&gt;\n&lt;p&gt;If you share our values and are ready to take on a leading role in our developing services, we look forward to receiving your application. Please contact Dr Stephanie Lawrie, Consultant Clinical Psychologist on 07720 811636 stephanie.lawrie@berkshire.nhs.uk or Vicki Matthews, Older People’s Mental Health Service Development Manager, on 07795 416572 for a conversation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OPMH Services Wokingham, Wokingham", "postalCode": "RG41 2RE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4105", "longitude": "-.846196"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238791", "validThrough": "2020-11-15T23:59:59+0000"}