{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc."}}, "datePosted": "2020-11-04T15:01:25+0000", "description": "&lt;p&gt;We have an exciting opportunity for an experienced occupational therapist to join our private patient facility as Band 6 OT here at the Royal National Orthopaedic Hospital, &lt;strong&gt;the largest orthopaedic hospital in the UK, and is regarded as a leader in the field of orthopaedics both in the UK and world-wide. We will be moving and expanding into a brand new facility in October 2018. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic occupational therapist to join our friendly and progressive team to enable the provision of a dedicated 7 day service to the 18 bedded Private Patient Unit. This post will suit established occupational therapists who are eager to develop their career to specialize in orthopaedics.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to develop your clinical skills within a tertiary in-patient orthopaedic setting. You will be responsible for the occupational therapy assessment and treatment of an interesting and complex caseload pre and post operatively that includes but is not limited to the acute inpatient treatment of upper and lower limb joint reconstruction, including sarcoma limb salvage work and spinal surgery.&lt;/p&gt;\n&lt;p&gt;You should have at least 2 years clinical experience in a broad range of specialities which includes elective adult orthopaedics. You will need good communication skills, be a team player and demonstrate a flexible approach to your caseload. In addition you will need strong clinical reasoning skills to ensure our private in-patient orthopaedic occupational therapy service is evidence based and delivered to a high standard. You will need to liaise closely with the Private Patient Unit therapy team lead and the unit is supported by Clinical Specialist and ESP’s within the wider therapy department.&lt;/p&gt;\n&lt;p&gt;Additional benefits of working at RNOH include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On site facilities include sports centre and swimming pool&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Well established in service training programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Personal development is always at the top of our list&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support on National Courses and Conferences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Only 40 minutes from central London by tube&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Esha Shah, PPU Therapy Lead on 0208 385 3018 or Supriya Nerlekar, Clinical Specialist Manager, Therapies on 0208 909 5563.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal National Orthopaedic Hospital, Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Occupational Therapist - Private Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256351", "validThrough": "2020-11-18T23:59:59+0000"}