{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10000", "minValue": "10000", "unitText": "YEAR", "value": "from £10,000 per session"}}, "datePosted": "2020-11-02T08:04:24+0000", "description": "&lt;p&gt;Do you want to join a forward-thinking, friendly GP practice as a part-time doctor in a bustling city set in one of the most beautiful parts of England?&lt;/p&gt;\n&lt;p&gt;SSP Health has vacancies at our two practices in historic Carlisle – both rated ‘Good’ by the CQC.&lt;/p&gt;\n&lt;p&gt;SSP Health is a federation of practices so our GPs benefit from exceptional working conditions, which brings our doctors an enviable work/life balance, flexible hours and little very admin. As we have 37 practices across the North West, there are excellent opportunities to switch between surgeries, comprehensive in-house CPD support and many chances to progress your career and specialise. We are a licensed Tier 2 sponsor, so we welcome inquiries from outside the UK.&lt;/p&gt;\n&lt;p&gt;On the doorstep of both the Lake District and Northumberland national parks, Carlisle is the economic capital of Cumbria and south-west Scotland. Enjoying a long history and with a rich cultural heritage, Carlisle is famous for having stunning countryside but also all the benefits of a modern, thriving university city. Directly on the M6 motorway, Carlisle is by train just over an hour to Glasgow and Edinburgh, just over two hours to Manchester Airport and three-and-a-half hours direct to London. People in the city enjoy a low cost of living with house prices well below the national average.&lt;br /&gt;&lt;br /&gt;Our modern, efficient GP practices use the latest technology and processes and pride themselves on giving excellent healthcare to our patients. Come and join our team!&lt;/p&gt;\n&lt;p&gt;NHS Pension available.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "SSP Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA1 1EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8938", "longitude": "-2.92851"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251291", "validThrough": "2020-11-16T23:59:59+0000"}