{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712"}}, "datePosted": "2020-10-27T12:16:49+0000", "description": "&lt;p&gt;An exciting opportunity has arisen on Medical receiving Unit, which is Assessment unit, for a Band 6 unit sister&#39;s post. MRU is a 30 bedded Assessment unit which cares for patients that are acutely unwell, with the aim being to safely discharge our patients within 48 hrs, and support the transfer of those who need additional care and management to the various specialties.&lt;/p&gt;\n&lt;p&gt;The preferred applicant would ideally need to have a good knowledge base of Acute Assessment, Ambulatory Care or Emergency Department patient care. The applicant will be expected to work closely with the MDT, Consultants and Specialist nurses. They need to demonstrate excellent communication and motivational skills in order to continue the excellent team work currently displayed on the ward. Expectations will include continuing with creating a ward that is supportive to all staff but particularly those that are new and junior and to also continue to develop an environment of quality and innovation, encouraging team thinking and creativity.&lt;/p&gt;\n&lt;p&gt;If you are motivated, flexible and passionate about patient care, we would love to hear from you! Informal visits to our departments are currently suspended; however we can arrange a virtual meeting with you. For further details please contact: Bridget Martinez, Senior Sister on ext. 3202 or Bridget.Martinez@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Oyinda Agoro, Recruitment Advisor, on 01708 435000 ext. 2291.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 6 Junior Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244440", "validThrough": "2020-11-10T23:59:59+0000"}