{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T13:15:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Rehabilitation (37.5 hours per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Excellent opportunities for anyone interested and committed to rehabilitation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about rehabilitation and helping patients to achieve their potential and improve their quality of life? If so, this could be the opportunity for you!&lt;/p&gt;\n&lt;p&gt;We are recruiting to our band 6 community rotation which includes, Community Therapy Teams in Middlesbrough and Redcar and Cleveland, Redcar Primary Care Hospital and East Cleveland Primary Care Hospital In Patients, A&amp;E Therapy Team at The James Cook University Hospital (JCUH) and Pulmonary Rehabilitation Team. Each rotation lasts for 9 months.&lt;/p&gt;\n&lt;p&gt;There is an expectation the post holder will take part in the acute on call rota for either JCUH or Friarage Hospital (FHN).&lt;/p&gt;\n&lt;p&gt;Working in the community, you will provide rehabilitation in patients’ own homes and group settings, working closely with statutory and voluntary services to promote and maintain independence. You will also contribute to the rapid response admission avoidance service, which covers 7 days a week 0800-2000.&lt;/p&gt;\n&lt;p&gt;As services are delivered 7 days a week and over a wide geographical area; there is an expectation that you will have an ability to work flexibly across 7 days a week and travel independently throughout the localities.&lt;/p&gt;\n&lt;p&gt;Support and in-service training will be provided to develop your skills, knowledge and understanding of the role. There are supervision structures in place to provide support and ensure that you continue to deliver the best possible service to the patients in our care.&lt;/p&gt;\n&lt;p&gt;South Tees Hospitals NHS Foundation Trust is one of the largest teaching hospital trusts in the country, close to the North Yorkshire Moors and within easy reach of Newcastle and Leeds. It comprises two acute hospitals, James Cook University Hospital and Friarage Hospital Northallerton and a number of community hospitals and community services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sarah Clifford (Community Therapy Team Lead)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 01287 284473&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community based, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Senior Physiotherapist (Rotational)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250316", "validThrough": "2020-11-13T23:59:59+0000"}