{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-05T12:01:13+0000", "description": "&lt;p&gt;Are you looking for a full-time, rotational Band 6 post with an opportunity to develop your clinical and leadership skills? We enjoy developing our staff and offer regular supervision, support and coaching by the experienced OTs within the team and there is an active Band 6 development and support group that meets regularly. The rotational posts offer opportunity to work in a range of in-patient, community settings and integrated teams, thereby developing knowledge of services and pathways across the whole system. Clinically the rotation offers experience throughout the whole patient pathway including acute, rehabilitation, stroke, mental health and re-enablement settings throughout Cwm Taf Morgannwg UHB as well as working as part of our community equipment service&lt;br /&gt;&lt;br /&gt;The post holder will be flexible to service needs, possess excellent self management skills and administer their caseload efficiently to ensure effective intervention focused on preventing avoidable admissions, rehabilitation and efficient discharge planning, depending on setting.&lt;br /&gt;&lt;br /&gt;The successful candidate will work closely with the MDT, Principal OT, Discharge Liaison Team and Local Authorities to ensure effective cross boundary and agency working. Supervision will be provided within the team and by the professional line manager.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachael Gdesis-Evans&lt;/p&gt;\n&lt;p&gt;Principal Occupational Therapist&lt;/p&gt;\n&lt;p&gt;rachael.gdesis-evans@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01656 752161&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cwm Taf Morgannwg University Health Board Wide, Cwm Taf Morgannwg University Health Board Wide", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257558", "validThrough": "2020-11-19T23:59:59+0000"}