{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Consultant"}}, "datePosted": "2020-10-06T13:41:19+0100", "description": "&lt;p&gt;This is an exciting opportunity for a Consultant Psychiatrist to join our Community Children and Adolescent Mental Health Team on the Isle of Wight. The IOW NHS Trust community CAMHs team is CQC rated Good, the team is a multidisciplinary team of 29 staff who provide services to children and young people on the Island that are experiencing emotional health and wellbeing difficulties. The total population of 0-18 year olds on the Isle of Wight is 26823. The successful candidate must be comfortable working as a team, be flexible in approach and display exceptional communication, diplomacy and negotiating skills.&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity for an ambitious psychiatrist to work in a unique NHS trust going through transition providing opportunity for those wanting to get involved into developing state of the art Mental Health services fit for the needs of the population. The trust has identified a strategic mainland partner which will help with this service development and there is aMental Health transition team working towards establishing this service in line with the MH sustainability and transformation plan.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced clinician to join the team to ensure the service continues to deliver good quality, compassionate care. They will work as part of a multidisciplinary team to provide specialist support and intervention to children, young people and their families within a range of settings, these include direct therapeutic work in the form of individual therapy, group work and parent workshops as well as consultation and training to professionals. They will be passionate about ensuring the child’s voice is central to the work they do and work in partnership with families and other agencies to achieve the outcomes desired by the child or young person. The service is a fully inclusive service giving you the opportunity to work with children and young people including young people with intellectual disabilities if there is a comorbid mental health diagnosis. Consultant sessions are provided to the Early Intervention in Psychosis team for young people 14 to 18. We also offer a specialist Eating Disorder Team within generic CAMHS. There is a nurse inreach/outreach service for ward assessments following self-harm and more intensive and crisis work to reduce off island inpatient placements. The paediatricians provide assessment and management of ADHD. Autism assessments are commissioned separately.&lt;/p&gt;\n&lt;p&gt;Applications for less than whole time working are welcome.Assistance with moving to the island and initial accommodation will be offered and a relocation/retention package is on offer to suitable candidates.&lt;/p&gt;\n&lt;p&gt;If you enjoy being part of a team, are flexible and approachable and are looking for a stimulating role in psychiatry, we would be delighted to hear from you. Please contact either Professor Jeremy Turk or Dr Lynne Oldman on 01983 523602 or alternatively the CCAMHS Team Leader, Cally Wareham on the same number.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214875", "validThrough": "2021-04-06T23:59:59+0100"}