{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-29T15:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an enthusiastic and experienced clinical pharmacist to work in the Pharmacy Clinical Team alongside the Principal pharmacist for Specialist Services working with a multi-professional team to further develop the clinical pharmacy service and to provide clinical Pharmacy leadership across the three sites of the Wrightington, Wigan and Leigh Teaching Hospitals NHS Foundation Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Normal working hours are Monday to Friday 9.00 - 5.30pm with Weekends, late nights, bank holidays and on-call all on rotational basis. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;p&gt;Have a specialist interest with musculoskeletal surgery including elective and trauma, providing specialist knowledge to a wide range of healthcare professionals to support the care of complex patients and training of healthcare professionals.&lt;/p&gt;\n&lt;p&gt;Work closely alongside the Principal Pharmacist, Specialist Services to manage and improve clinical and support services provided to the rheumatology, dermatology and assisted conception patients.&lt;/p&gt;\n&lt;p&gt;Utilise your planning skills to support the pharmacy department at Wrightington hospital, working alongside specialist nursing staff to ensure pre-assessment of patients, reviewing test results and assessing their safety to proceed to treatment.&lt;/p&gt;\n&lt;p&gt;Understanding and supporting the ever increasing work with the clinical trials team to achieve new treatments for patients.&lt;/p&gt;\n&lt;p&gt;Supporting the Dermatology Department to ensure Bluteq, NICE and GMMMG guidance is followed&lt;/p&gt;\n&lt;p&gt;Working with junior colleagues to create a robust training plan for rotational pharmacists to support their learning.&lt;/p&gt;\n&lt;p&gt;Education and training of pharmacists, technicians and other members of the MDT. Participation in practice research and audit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a dynamic and experienced clinical pharmacist with good organisational and communication skills and the ability to lead a team. You should have significant experience in hospital pharmacy, including experience in a directorate role and managing high cost drugs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You should have completed a diploma in clinical pharmacy or have equivalent experience and completed a prescribing qualification. Previous experience of managing a team would be an advantage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently involved in a Staff Engagement project to improve the way we work and are reviewing our in house training, aligning our CPD, appraisals and personal development plan to a nationally recognized competency framework.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The department is fully modernized and has ARX robot, EMIS software and has successfully implemented All scripts Electronic Prescribing in the last 5 years.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wrightington Wigan and Leigh NHS Foundation Trust is situated close to the major conurbations of Manchester &amp; Liverpool and is accessible from both the M6 &amp; M61 motorways which run close by. Wigan is also well served by rail and bus links.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will be expected to attend COVID + wards, providing they don&#39;t have a positive Risk Assessment. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates are required to present original certificates for qualifications at the interview stage.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jayne Dormand&lt;/p&gt;\n&lt;p&gt;Principal Pharmacist&lt;/p&gt;\n&lt;p&gt;jayne.dormand@wwl.nhs.uk&lt;/p&gt;\n&lt;p&gt;07795146506&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Albert Edward Infirmary, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Highly Specialist Pharmacist - Specialist Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248795", "validThrough": "2020-11-12T23:59:59+0000"}