{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-03T08:16:07+0000", "description": "&lt;p&gt;About the Role &lt;br /&gt;An exciting opportunity has arisen for a band 5 registered nurse to join the highly motivated and hardworking team on the Patience 2 - Urology Ward / Burns and Plastic Surgery Unit in a rotational post ; we are looking for an enthusiastic, motivated and caring nurse who wants to develop their professional knowledge and ability. The post holder will work on the urology in patient ward (Patience 2 Ward) for 6 months and will rotate to Burns unit for 6 months this includes a 3 month development period in the Burns Unit outpatient dressing clinic, both areas manage patients who are emergency admissions as well as having elective surgery for both specialities.&lt;br /&gt;&lt;br /&gt;About You (Candidate)&lt;br /&gt;Both ward areas have a supportive, caring and skilled team of nurses dedicated to the delivery of exceptional patient care. Excellent communication skills, flexible working and a team approach are essential for this role. &lt;br /&gt;You will be offered great opportunities to develop your nursing skills and abilities. You will have a supernumerary induction period and have time to visit areas within Burns and Urology specialties. Personal and professional development is actively supported and there are numerous opportunities for staff development. &lt;br /&gt;&lt;br /&gt;You should be educated to 1st level RGN, have excellent verbal and written communication skills and be able to prioritise workload and work well as a team member. As a caring and positive person you will be committed to delivering high quality care whilst adhering to the trust values and behaviours. &lt;br /&gt;&lt;br /&gt;About the Division / Speciality / Service :-&lt;/p&gt;\n&lt;p&gt;Patience 2 Ward is a 27 bedded mixed sex urology ward with patients from not only Nottingham but also the Sherwood Forest Hospital. Patients are both elective and emergency admissions and is a fast paced ward.&lt;/p&gt;\n&lt;p&gt;The Burns and Plastic Surgery unit is a regional service based at City Hospital campus, Nottingham University Hospital NHS Trust. &lt;br /&gt;An 18 bedded unit with an outpatient dressing clinic, and is a designated unit level service within the Midland Burn Operational Delivery Network&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name-Job title-Email addressemily.sale@nuh.nhs.ukTelephone number-Additional contact information&lt;/p&gt;\n&lt;p&gt;Emily Sale, Patience 2 Ward Manager on 0115 9691169 ext. 71972&lt;/p&gt;\n&lt;p&gt;Kirsty Johnson, Burns Unit Ward Manager on 0115 9691169 ext. 54492 /56403&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham University Hospitals NHS Trust (City Hospital), Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Staff Nurse.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253126", "validThrough": "2020-11-16T23:59:59+0000"}