{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T12:16:45+0000", "description": "&lt;p&gt;This is an exciting opportunity for a Palliative medicine consultant (1 WTE) to join a successful and committed team in providing Specialist palliative care services in Dudley, both at Russells Hall hospital and in the community.&lt;/p&gt;\n&lt;p&gt;The post will be focused on providing high quality specialist palliative care and clinical expertise to patients in both hospital and community settings. It will involve working closely alongside a team of well-established Specialist Palliative care Clinical Nurse Specialists and other palliative medicine consultants to provide this care, and support the development and improvement of the service. The post holder will contribute to the 1:12 cross city on call rota covering Compton Care, and the local hospitals and communities in Dudley, Walsall and Wolverhampton. The addition of this post will also provide the resource within the Palliative Medicine Consultants working in Dudley to be in a position to provide support for Mary Stevens Hospice as a consultant group.&lt;/p&gt;\n&lt;p&gt;The successful applicant must be on the specialty register for palliative medicine or within six months of joining the register at the time of the interview.&lt;/p&gt;\n&lt;p&gt;Please note that only electronic applications can be accepted for this post&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For further information please contact Dr Joanne Bowen through the team secretary at Russells Hall hospital (01384) 244238&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Consultant in Palliative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244438", "validThrough": "2020-11-26T23:59:59+0000"}