{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-03T14:30:42+0000", "description": "&lt;p&gt;An adaptable, motivated, innovative and resourceful Team Administrator is required to enable the efficient and effective function of administration within the Restormel ICMHT (Integrated Community Mental Health Team) and Fowey CC&amp;D (Complex Care &amp; Dementia) Teams.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to be sensitive to the team&#39;s dynamics and needs, and have the ability to supervise and carry out appraisals and supervision for a team of Medical Secretaries, Team Secretaries and Receptionists/Team Clerks based within Alexandra House.&lt;/p&gt;\n&lt;p&gt;The ability to prioritise roles and tasks for self and others, finding solutions to process problems and to structure own workload whilst working as part of a team is essential. In addition, the ability to remain calm and present an understanding approach at all times are essential criteria for this post, along with excellent IT skills with experience in spreadsheets and databases, excellent communication, interpersonal and organisational skills.&lt;/p&gt;\n&lt;p&gt;You should have substantial experience of working in an office environment with both secretarial and clerical experience including reception duties preferably working within the NHS or very similar setting.&lt;/p&gt;\n&lt;p&gt;There will be a requirement for the successful applicant to demonstrate a caring and sensitive approach to their work and be able to communicate effectively with clients, carers, colleagues, the general public and representatives from other hospitals and organisations.&lt;/p&gt;\n&lt;p&gt;This is a full-time post working 37.5 hours per week, Monday to Friday, 8.45 a.m. – 5.15 p.m.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy ClementsJob titleLocality Admin ManagerEmail addressamyclements@nhs.netTelephone number01726 873377Additional contact information&lt;/p&gt;\n&lt;p&gt;Amy Clements - Locality Administration Manager (Mid AMHLD &amp; CC&amp;D) - 01726 873377&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexandra Road, St Austell, PL245QN, St Austell", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "Team Administrator - Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254347", "validThrough": "2020-11-17T23:59:59+0000"}