{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T17:15:47+0000", "description": "&lt;p&gt;The Respiratory Investigation Department is seeking a part/full-time Clinical Physiologist (Respiratory) to join our multi-disciplinary team and help deliver a comprehensive respiratory diagnostic service for Buckinghamshire Healthcare NHS Trust.&lt;br /&gt;&lt;br /&gt;The department provides a broad range of respiratory physiological measurements including full PFT’s, allergy testing, exercise tests, Cardio-pulmonary exercise test, hypoxic challenge, methacholine challenge and a home oxygen assessment and review service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The holder of this post will be expected to liaise with patients, carers and other healthcare professionals (across primary and secondary care) to provide and improve respiratory services. &lt;br /&gt;&lt;br /&gt;Continuous professional development is encouraged and you will have opportunities to develop further your skills and knowledge. This will include: &lt;br /&gt;• Support to attend relevant professional courses&lt;br /&gt;• Opportunities to gain additional experience and build on new skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In addition to appropriate experience, the successful candidate must possess a Clinical Physiology degree or equivalent qualification (see person spec.) and be registered with RCCP (or be working towards registration).&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact Chris McGillicuddy, Principle Clinical Physiologist (Respiratory) on 01494 426927&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wycombe Hospital, High Wycombe", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Respiratory Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247477", "validThrough": "2020-11-11T23:59:59+0000"}