{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-09T12:15:48+0100", "description": "&lt;p&gt;Salisbury is a beautiful cathedral city with excellent schools (including grammar schools for boys and girls), a vibrant arts culture, easy road access to the New Forest, South Coast, Winchester and Bath and a direct rail link to London in under 90 minutes.&lt;/p&gt;\n&lt;p&gt;This is an established full-time post based at Fountain Way, Salisbury, offering a high quality work-life balance. You will be working with a friendly team and a newly established Associate Specialist.&lt;/p&gt;\n&lt;p&gt;Our objective is for Beechlydene Ward to be the best provider of working age adult in-patient care in the region. It is a 21 bed service with integrated psychology, occupational therapy services and gym.&lt;/p&gt;\n&lt;p&gt;The Medical Team currently comprises a full-time Consultant, Associate Specialist, ST4 doctor (when allocated) and two full-time Foundation Doctors (F1 and F2).&lt;/p&gt;\n&lt;p&gt;The Fountain Way site benefits from modern facilities, a hospital library and shop and a new primary care centre. Nine consultants are based at the site with ten junior medical staff as well as visiting medical students from the University of Southampton. There is an in-house weekly teaching programme.&lt;/p&gt;\n&lt;p&gt;We seek a candidate with enthusiasm for developing the service and Team members’ skills. Clinicians will be supported if they also wish to pursue a special interest, e.g. research, psychotherapy, CBT or medical management.&lt;/p&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are committed to your development, making the very best of your talent and helping you to achieve your career aspirations.&lt;/li&gt;\n&lt;li&gt;As an NHS employer we offer one of the most competitive and flexible benefits packages.&lt;/li&gt;\n&lt;li&gt;Relocation package of up to £8,000.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Dr Ian Ellison-Wright&lt;/p&gt;\n&lt;p&gt;Consultant Psychiatrist &amp; Medical Lead (South Wiltshire)&lt;/p&gt;\n&lt;p&gt;Email address:  ian.ellison-wright@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fountain Way, Salisbury", "postalCode": "SP2 7FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0717", "longitude": "-1.80907"}}, "title": "Consultant in General Adult Psychiatry, Inpatient Services, Salisbury", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220147", "validThrough": "2020-11-26T23:59:59+0000"}