{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 per annum"}}, "datePosted": "2020-11-03T10:00:50+0000", "description": "&lt;p&gt;Health Education England is seeking applications for a Corporate Affairs Support Officer. This role will form part of the national Corporate Affairs Team and the successful candidate will be based from their nearest local HEE office.&lt;/p&gt;\n&lt;p&gt;The Corporate Affairs Support Officer will work across a number of Regions or Directorates as part of a dynamic team in delivering an effective Corporate Affairs function supporting managers and staff across the organisation.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Corporate Affairs Team to support delivery of work streams with services which are planned and managed effectively and assisting in their successful delivery, including maintaining systems for good corporate governance, assurance and compliance within a national framework and team structure.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for overseeing the corporate management mailboxes, dealing with enquiries efficiently, signposting as appropriate. Will maintain all relevant documentation for the team, ensuring high quality records are kept on a range of issues, whilst maintaining a high level of confidentiality at all times. They will provide support to the wider team with meetings, updating calendars, agendas and supporting papers and maintaining meeting planners along with booking of training sessions and general administrative support. They will be a point of contact within the Corporate Affairs team, assisting with general enquiries, and providing general support across the whole of HEE&lt;/p&gt;\n&lt;p&gt;You will need to be a team player, used to working with colleagues at all levels, innovative and solution focused.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £24,907, with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;Due to Covid-19 this role will operate on a working from home basis until further notice, all equipment required will be provided. Travel may be expected, at a time that it is safe to do so.&lt;/p&gt;\n&lt;p&gt;If you would like to speak to someone to find out more about this role, please contact:&lt;/p&gt;\n&lt;p&gt;Claire Parker 07833059132 or Simon Baughan on 07795 800222&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Claire Parker&lt;/p&gt;\n&lt;p&gt;Job title: Corporate Affairs Manager&lt;/p&gt;\n&lt;p&gt;Email address: Claire.Parker@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07833059132&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Simon Baughan,&lt;/p&gt;\n&lt;p&gt;Corporate Affairs Senior Business Partner&lt;/p&gt;\n&lt;p&gt;Simon.Baughan@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;07795 718 485&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southern House Otterbourne, Winchester", "postalCode": "SO21 2RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.009", "longitude": "-1.33424"}}, "title": "Corporate Affairs Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253348", "validThrough": "2020-11-17T23:59:59+0000"}