{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42000", "minValue": "42000", "unitText": "YEAR", "value": "Up to £42, 000 per annum DOE"}}, "datePosted": "2020-10-11T23:52:36+0100", "description": "&lt;h2&gt;&lt;strong&gt;Are you a chartered physiotherapist with experience in neurological and general rehabilitation? &lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Are you looking for a new challenge within an exciting new service where you can use your skills and knowledge to make a real change to service delivery?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;The Specialist Care Unit (SCU) is an innovative new service opening early 2021 based at HMP Stafford. It will support patients from around the region, including Staffordshire and Worcestershire Prisons in addition to HMPs Birmingham and Stoke Heath.&lt;/p&gt;\n&lt;p&gt;Our new service will provide enhanced care to patients who need additional support because their needs are complex and/or unstable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You will be part of a forward thinking, innovative health care team based in HMP Stafford; including GPs, nurses, pharmacists and occupational therapists, delivering high quality, best practice treatment. The service will consist of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A bed based service, offering up to 8 beds. Accommodating 2 long term beds and up to 6 short term (assessment/reablement) beds.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A therapy led outreach service across the region providing assessment, advice and guidance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be closely supported and mentored by our Clinical Lead, and this combined with our well-developed appraisal system, in-service training and funding for external clinical courses, you will be provided with an excellent supportive learning environment.&lt;/p&gt;\n&lt;p&gt;As part of the Specialist Care Unit’s service, you will be part of the regional outreach service so will be expected to travel to sites and hospitals within the Midlands region to carry out assessments. So, you will be based at HMP Stafford and will also work off-site across our region’s sites and hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This role requires the advanced assessment, planning and delivery of rehabilitation programmes for patients within the offender healthcare setting who may have complex and/or chronic presentation. You will be responsible for determining clinical diagnosis and clinical treatment indicated, and to maintain contemporaneous records as an autonomous practitioner.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and organizational skills and be willing to learn and develop.&lt;/p&gt;\n&lt;p&gt;You will have a Physiotherapy BSc (Hons) degree level qualified (or equivalent) with current HCPC registration. Additional to this, you will have proven post-registration experience in the assessment and treatment of inpatients with neurological and general rehabilitation needs along with proven continued professional development.&lt;/p&gt;\n&lt;p&gt;Due to the scope of this role, you will be based at Stafford and also will provide support across the Midlands region. As some sites and hospitals are remote and difficult to access via public transport we would require applicants to have a valid driving licence and access to their own car.&lt;/p&gt;\n&lt;p&gt;We are looking for our future team member to be self-motivated and happy to work independently, but also happy as part of a wider MDT team in order to meet the needs of the patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About us…&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Practice Plus Group manage the healthcare services at HMP Stafford including the SCU. We are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care&lt;/p&gt;\n&lt;p&gt;HM Prison Stafford is a closed training prison which holds 751 category C people convicted of sexual offences. The prison has the original Victorian buildings for the majority of the residential wings. Modern buildings include Reception, Visits, Education, Kitchen, a 40 bed house block, Sports Hall and with a site adjacent to the prison was as an industrial workshop complex. 50% of our patients are over the age of 55 which leads healthcare services to have an emphasis on chronic disease management, frailty, complex case management, cancer care, palliative care and care of the dying.&lt;/p&gt;\n&lt;p&gt;The Specialist Care Unit is an exciting new addition to the Healthcare provision at HMP Stafford, enabling us to be a regional resource to support and treat patients with complex health needs for an agreed period of time based on their individual needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;In return for your hard work...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We offer a salary of up to £42,000 per annum, dependent on experience.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, cycle to work scheme and onsite parking (free parking subject to a one-off £10 parking permit fee).&lt;br /&gt; &lt;br /&gt; We are also proud to support our employees with continued professional development opportunities and further education.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by our Internal Recruiter, Amelia Smith, who will then submit your CV to the hiring manager. If you are suitable for the role, Amelia will arrange interviews.&lt;/p&gt;\n&lt;p&gt;This is a full-time role, working 37.5 hours per week, with a start date 01/03/21. You will be required to hold a driving licence and access to your own car to ensure you are able to commit to travelling to rural sites.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Group Terms and Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting (arranged locally by the prison).&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford", "postalCode": "ST16 3AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8115", "longitude": "-2.11843"}}, "title": "Physiotherapist - HMP Stafford", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221473", "validThrough": "2020-11-08T23:59:59+0000"}