{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "Band 5 - (£24,907 - £30,615 per annum)"}}, "datePosted": "2020-11-02T08:16:39+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, motivated, caring and creative Band 5 Community Mental Health Nurse to work as part of High Weald, Lewes &amp; Havens Havens Assessment and Treatment Service based in Newhaven. The role will involve working with clients with complex needs and their families. Although you will be working primarily in one geographically defined area you may on occasion need to work outside of this area in meeting the overall demands of the rural service.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible and adaptable as modern mental health services are constantly changing in response to best practice. You will be joining a committed and dynamic team and will be fully supported and empowered to make a difference to creatively develop many new ways of working, towards building safe and responsive quality mental health services fit for the future.&lt;/p&gt;\n&lt;p&gt;You will be required to have strong communication and people skills and demonstrate a desire and ability to meet community service demands in an ever changing landscape. You will be working closely with existing current team members in identifying best use of resources in a needs led service utilising patient focused evidenced interventions.&lt;/p&gt;\n&lt;p&gt;You will be joining a committed and dynamic multidisciplinary team and will be fully supported and empowered to make a difference to creatively develop many new ways of working, towards building safe and responsive quality mental health services fit for the future.&lt;/p&gt;\n&lt;p&gt;In return we can offer a supportive working environment and access to training opportunities to assist you to realise your potential and achieve a greater degree of job satisfaction.&lt;/p&gt;\n&lt;p&gt;As a Trust employee you will enjoy the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent starting salary&lt;/li&gt;\n&lt;li&gt;NHS Pension contributions&lt;/li&gt;\n&lt;li&gt;27 days holiday allowance plus bank holidays&lt;/li&gt;\n&lt;li&gt;Flexible Working patterns&lt;/li&gt;\n&lt;li&gt;Child care vouchers&lt;/li&gt;\n&lt;li&gt;Excellent training and development opportunities&lt;/li&gt;\n&lt;li&gt;NHS Discounts&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post offers The Trust&#39;s Golden Hello for band 5 or 6 Nurses, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information about the post or to arrange an informal visit, please contact Joy Makotore (Team Lead) or Service Manager Simon Hellyer (Service Manager on 01273 616440.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillrise, Newhaven", "postalCode": "BN9 9HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7903", "longitude": ".041381"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251308", "validThrough": "2020-11-16T23:59:59+0000"}