{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-06T15:57:52+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;LOCUM CONSULTANT IN RHEUMATOLOGY&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Worcestershire Acute Hospitals NHS Trust&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a locum consultant post to join our countywide Rheumatology team. The posts will consolidate our multidisciplinary team that work effectively to provide a “Hub and Spoke” model across the County. Facilities at our base hospital, Worcestershire Royal Hospital, include specialist physiotherapy (including musculoskeletal ultrasound), occupational therapy, a large hydrotherapy pool, the Rheumatology Day Case Unit, and access to in-patient beds for acute admissions. Therapy support services are also available at the Kidderminster Treatment Centre and the Alexandra Hospital in Redditch.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time as we re-think service delivery post Covid and expand collaboration with our health economy partners. There are opportunities for developing outreach services at alternative community hospitals and specialist services including links with our Renal, Dermatology and Orthopaedic colleagues. There are excellent prospects for personal development and the post holder will be encouraged to develop their clinical interests, with particular opportunities in research and medical education. There is no GIM or on call commitment with these posts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The existing multidisciplinary team includes 6 Consultant Rheumatologists (including the post being advertised) with dedicated supporting Specialist Nurses, pharmacist and physiotherapist. The Department supports undergraduate medical student teaching from the University of Birmingham, as well as the West Midlands Specialist Training Scheme for Rheumatology. We are active in research, and have developed links with the local CLRN and the University of Worcester. The department is also engaged with training in the innovative Physicians Associate MSc Course at the University of Worcester and support for the development of the new Three Counties Medical School.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These are 10 PA full time posts however, we are happy to consider applications for more or less than full time work/ flexible job plans. Applicants must have full GMC Registration and be on the specialist register for Rheumatology or be within six months of proposed CCT date. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For more information, to arrange a visit, or to discuss any aspect of this post, please contact Professor Ashok Rai, Clinical Director for Rheumatology on 01562 826353/ext: 53720, or Dr. Caroline Cardy on 01905 763333/ext: 33470 or Dr Adrian Farrell on 01905 763333/ext: 33435.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Locum Consultant in Rheumatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260484", "validThrough": "2020-11-20T23:59:59+0000"}