{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-05T14:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Education plays a significant role in the current context and future ambition of the University Hospitals Bristol and Weston NHS &lt;/strong&gt;&lt;strong&gt;Foundation Trust, and an ongoing commitment to education is a core part of the Trust’s strategy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Now is an exciting time to join the Trust Services’ education team at UHBW which supports a wide and diverse range of education for both clinical and non-clinical development across the Bristol and Weston locations. Following the implementation of an education strategy, and as part of a newly merged organisation, a new and existing vacancy has become available to help support the Trust and our external partners’ ambition, to become a beacon of outstanding education.&lt;/p&gt;\n&lt;p&gt;If you would like to join us on this journey and help us shape the future of Medical Education at UHBW, we would invite you to apply for this exciting role.&lt;/p&gt;\n&lt;p&gt;The appointee will join the Trust, as we embark upon a greater focus of blended learning in our delivery of education. As a new role, the post holder will be instrumental in supporting and developing an innovative Medical educational offer, as aligned to the Trust’s educational strategy.&lt;/p&gt;\n&lt;p&gt;The role will support and develop technological solutions to support Medical Education and training provision within the Trust. The post holder will lead, develop and maintain oversight of the digital technology and digital Medical educational offer to support blended learning, as part of the educational strategy. In addition they will be the lead resource for innovative teaching methods in Medical Education through the use of digital technology and will work alongside other internal and external stakeholders. The post holder will support other Medical education leads in the development and implementation of technological learning resources and blended learning methods.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJames MurrayJob titleMedical Education ManagerEmail addressjames.murray@uhbw.nhs.ukTelephone number01173420065&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals Bristol and Weston NHS Foundation Trust, Bristol", "postalCode": "BS2 8AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.458", "longitude": "-2.59615"}}, "title": "Medical Education Technology and Innovation Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258080", "validThrough": "2020-11-19T23:59:59+0000"}