{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-10-29T13:46:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within Tower Hamlets Talking Therapies for two enthusiastic and highly motivated Senior Psychological Wellbeing Practitioners to join the IAPT team on a full time, permanent basis. &lt;br /&gt;Based in East London we have provided psychological therapy services to general practice and the local community for over 30 years. We are a stepped care service offering evidence based interventions at steps 2 and 3. Our team consists of Psychological Wellbeing Practitioners, Cognitive Behaviour Therapists and Clinical &amp; Counselling Psychologists. As a service, we actively encourage different theoretical interests and offer specialist areas of development such as LTC/Eating Disorders/Perinatal.&lt;br /&gt;We have a firm commitment to CPD and offer high quality supervision as well as the opportunity to participate in team initiatives. The team works closely with a variety of trained professionals across a range of therapeutic orientations including, DIT, Systemic, IPT, CBT and Psychodynamic. &lt;br /&gt;The post holder will: &lt;br /&gt;Hold a qualification (Post grad dip/cert) in Low intensity working or Primary Care Mental Health work &lt;br /&gt;Have at least one-year post qualification experience&lt;br /&gt;Offer evidence-based practice in guided self-help, cCBT and Step 2 treatment groups&lt;br /&gt;Develop and support Trainee Psychological Wellbeing Practitioners&lt;br /&gt;Provide line management, case management and clinical supervision to Trainee and Qualified PWPs in the service&lt;/p&gt;\n&lt;p&gt;For more information, please contact: &lt;br /&gt;Jenisha Maisuria &lt;br /&gt;Step 2 and Community Lead/Senior High Intensity Therapist &lt;br /&gt;Jenisha.maisuria@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November 2020&lt;br /&gt;Interview Date: 19th November 2020&lt;br /&gt;How to apply: Please complete the NHS Jobs application form. If you are shortlisted for an interview you will be notified via email. &lt;br /&gt;Due to the COVID-19 pandemic, interviews are likely to place remotely via Microsoft Teams. &lt;br /&gt;Important Information:&lt;br /&gt;Please ensure you check your emails regularly as this is how we will communicate with you throughout the recruitment process. If you are shortlisted you will be notified by email within 2 weeks of the advert closing.&lt;/p&gt;\n&lt;p&gt;Due to the high volumes of applications we receive for certain posts, we reserve the right to close any adverts before the published closing date once we have received a sufficient number of applications.&lt;/p&gt;\n&lt;p&gt;These vacancies are offered as permanent posts, with the expectation that all clinical staff work one late evening per week (11am until 7pm).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePeter CrosbieEmail addresspeter.crosbie@nhs.netTelephone number07957717241Additional contact information&lt;/p&gt;\n&lt;p&gt;Peter CROSBIE, telephone 07957717241, email peter.crosbie@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS TH Adults IAPT, LONDON", "postalCode": "E1 0AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5116", "longitude": "-.050843"}}, "title": "Senior Psychological Wellbeing Practioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248562", "validThrough": "2020-11-08T23:59:59+0000"}