{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa plus HCAS"}}, "datePosted": "2020-10-29T14:46:27+0000", "description": "&lt;p&gt;NOTICE: This vacancy is also for Band 5 Nurses who will be supported to a Band 6 Position within 1 year following the EIP Band 5 to Band 6 Developmental Plan.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking to recruit an enthusiastic, committed and experienced Band 5 or band 6 Community Psychiatric Nurse (CPN), Social Worker (SW) or Occupational Therapist (OT) in our EIP service, full time position, for our Hounslow Early Intervention in Psychosis Service based at Lakeside, West Middlesex.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;West London believes that our staff are central to delivering the breadth of our service vision and have an excellent record in offering a range of comprehensive support and training to enable clinicians to build a career of which they can be proud.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for dynamic and compassionate staff who have a good knowledge of the issues and guidance around working with psychosis and have some experience of working with young people and adults aged 14years to 65 years with a range of complex mental health issues. You will gain a range of skills in evidence based intervention, teaching and supporting others and will be facilitated to develop supervision skills within a well-established clinical team with an excellent reputation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for individuals who are keen to play a key role in on-going development and who are looking for an opportunity to be involved in a range of service innovations. Staff have regular access to on-going support, supervision and development opportunities.&lt;/p&gt;\n&lt;p&gt;Our trust has just been rated as ‘Good’ by the CQC and we continue on our journey of improvement and the attainment of excellence. There is a growing culture of Quality Improvement within the trust in which all staff are encouraged to participate. &lt;br /&gt;For further information about the role please contact:&lt;/p&gt;\n&lt;p&gt;Our Mission&lt;br /&gt;“Promoting hope and wellbeing, together”&lt;br /&gt;Our Vision&lt;br /&gt;Our vision is to be an outstanding healthcare provider, committed to improving quality, and caring with compassion.&lt;br /&gt;Our Values&lt;br /&gt;As a member of West London, you can expect to be a respected member of staff at all times. We work to a set of Trust Values and uphold these in all of our interactions. Our Values are like our moral compass, reminding us of the things that matter most when we are caring for people in need. Our Trust Values are: &lt;br /&gt;Togetherness Responsibility Excellence Caring&lt;br /&gt;If you feel you are a person who lives our Trust Values then we’d like to meet you! You can watch videos on our website which shows what our Trust Values mean across our organisation:&lt;br /&gt;&lt;br /&gt;Rewards&lt;br /&gt;We offer an extensive reward package to our staff alongside an exciting and fulfilling career with our Trust. Some of the benefits you can enjoy when you join our team are:&lt;/p&gt;\n&lt;p&gt;• A competitive relocation package meaning you can claim up to £8k in expenses when moving over 40 miles to join the Trust. &lt;br /&gt;• Up to 33 days annual leave as well as the opportunity to buy even more days or sell some leave days that you don’t need.&lt;br /&gt;• Childcare vouchers &lt;br /&gt;• Cycle to work Scheme&lt;br /&gt;• Car Lease Scheme&lt;br /&gt;• Support towards career development and promotion opportunities within the Trust.&lt;br /&gt;• Flexible Working&lt;br /&gt;• A supportive environment to develop clinical skills.&lt;br /&gt;• Access to a comprehensive online library of training, development, and resources.&lt;br /&gt;• Discounted gym membership – from £10 per month at our on-site gym! (St Bernard’s site)&lt;br /&gt;• Staff discounts at high street retailers.&lt;br /&gt;• Paid DBS application upon offer.&lt;/p&gt;\n&lt;p&gt;NOTICE: This vacancy is also for Band 5 Nurses who will be supported to a Band 6 Position within 1 year following the EIP Band 5 to Band 6 Developmental Plan.&lt;/p&gt;\n&lt;p&gt;For further information about the role please contact:&lt;br /&gt;Candace Dore Telephone: 07984362126 Candace.Dore@westlondon.nhs.uk&lt;br /&gt;Hodo EID Telephone: 02084851447/144 Hodo.Eid@westLondon.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHodo EIDEmail addressHodo.Eid@westLondon.nhs.ukTelephone number02084851447Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Early Intervention Team - Houn, Isleworth", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248752", "validThrough": "2020-11-15T23:59:59+0000"}