{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 pro rata"}}, "datePosted": "2020-11-05T11:16:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Nurse Bank - Theatre Nurses and ODPs - The Royal Stoke and The County Hospital Stafford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you seen UHNM on Chanel Five, Critical Care Documentary series ? – this is a brilliant opportunity to become involved at UHNM to support and care for our patients and more importantly, to save lives.&lt;/p&gt;\n&lt;p&gt;We have the most modern and specialist operating theatres in Europe, if you don’t believe me – come and have a look.&lt;/p&gt;\n&lt;p&gt;Our Trust cares for over two million people who come to us for Emergency treatment, planned operations and medical care. More than 165,000 patients attend our A&amp;E department and many emergency patients are brought to us from a wide area by both helicopter and land ambulance because of our Major Trauma Centre status&lt;/p&gt;\n&lt;p&gt;We are a teaching hospital in partnership with Keele University and a patient-centred clinical research facility providing state-of-the-art facilities. We specialise in cancer diagnosis and treatment, cardiothoracic surgery, neurosurgery, renal and dialysis, neonatal and also paediatric intensive care. We are also recognised for our particular expertise in trauma, respiratory conditions, spinal surgery, upper gastro-intestinal surgery, complex orthopaedic surgery, laparoscopic surgery and the management of liver conditions.&lt;/p&gt;\n&lt;p&gt;We have band 5 Theatre Nurse and ODP vacancies on our Nurse Bank, which will give you an opportunity to work what hours you want in our specialty theatres, allowing you to gain a variety of skills, knowledge and expertise in trauma and specialist treatments and care.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join the UHNM. We can also support anyone wishing to move into a more permanent post via the bank if you feel that you want to take on a permanent role in one of our ward areas.&lt;/p&gt;\n&lt;p&gt;We provide a full corporate induction, local area induction and supernumerary shifts to help you settle in if you have not worked in an acute trust for some time. Lots of in-house training is available for your personal development and we help you with your revalidation also.&lt;/p&gt;\n&lt;p&gt;Our hourly pay rate fluctuates according to the month as we may offer a higher rate during winter pressures.&lt;/p&gt;\n&lt;p&gt;We are presently able to offer a comprehensive hourly rate with some premium shifts earning up to £29.50 per hour.&lt;/p&gt;\n&lt;p&gt;The interviews will take place via Microsoft Teams as there are no face to face interviews due to social distancing.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke On Trent / Stafford, Stoke on Trent/ Stafford", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Bank Operating Department Practitioner/ Theatre Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257423", "validThrough": "2020-11-20T23:59:59+0000"}