{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-05T11:16:29+0000", "description": "&lt;p&gt;A Locum consultant is required to support the department of Critical Care.&lt;/p&gt;\n&lt;p&gt;The Department&lt;/p&gt;\n&lt;p&gt;The successful candidates will be welcomed into a department with a current substantive consultant establishment of 8 with a funding to expand into 10. Shared with the Department of Anaesthetics, the trainee establishment consists of 7 CTs, together with 9 ST3+s all rotating from the East Midlands School of Anaesthesia (EMSA).&lt;/p&gt;\n&lt;p&gt;The department also has two Foundation doctors on 4-month rotations. As colleagues, we are expected to actively participate in service development, departmental management, clinical governance &amp; education. In doing so, we expect colleagues to treat each other with courtesy and respect at all times.&lt;/p&gt;\n&lt;p&gt;In keeping with the ethos of Critical Care, our team is truly multidisciplinary including doctors, nurses, physiotherapists, cleaning/domestic staff, dieticians, microbiology/infection control, pharmacists, admin staff, all having their part to play. We undertake regular MDTs for our patients including families and patients to contribute, along with parent clinical teams&lt;/p&gt;\n&lt;p&gt;We manage our service with open discussion; listening to and respecting everyone’s views. The clinical speciality leads have the responsibility to facilitate change and improvements in the service supported by the leadership team. We encourage everyone to be both leader and follower to help deliver improvements. Active participation in service development, departmental management, clinical governance &amp; education is required.&lt;/p&gt;\n&lt;p&gt;You will work with Consultants in Anaesthesia, Critical Care, Divisional Managers, other members of the Anaesthetic Department, Other consultant colleagues, senior nursing staff and management of the hospital.&lt;/p&gt;\n&lt;p&gt;Key tasks:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Maintenance of the highest clinical standards in the management of patients.&lt;/li&gt;\n&lt;li&gt;Teaching and training of junior staff and medical students&lt;/li&gt;\n&lt;li&gt;To actively participate in both departmental and Trust matters concerning Clinical Governance, service development and general management&lt;/li&gt;\n&lt;li&gt;To have responsibility for ensuring active participation in continuing medical education&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All consultants are required to live within a reasonable distance of the Trust, and be able to attend within thirty minutes when on call.&lt;/p&gt;\n&lt;p&gt;Eligibility&lt;/p&gt;\n&lt;p&gt;In order to be eligible to apply for this position you must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Entry on GMC Register with no restrictions&lt;/li&gt;\n&lt;li&gt;Eligible for entry on Register or within six months of receipt of Certificate of Completion of Training (CCT) at time of interview &lt;span style=&quot;text-decoration: underline;&quot;&gt;or&lt;/span&gt; significant consultant level experience either in NHS or outside UK&lt;/li&gt;\n&lt;li&gt;Completed a recognised national training programme/advanced fellowship in Intensive Care Medicine&lt;/li&gt;\n&lt;li&gt;Partially/fully completed EDIC, FFICM, FRCA or other relevant college diploma&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;These are full-time positions but candidates wishing to work part-time or in a job-share are encouraged to apply.  If a part-time or job-share person is appointed modification of the job content will be discussed with the appointee on a personal basis.  They will be required to devote substantially the whole of his/her time for the appointed sessions to the duties of the post and to give them priority at these times.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Locum Consultant in Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257419", "validThrough": "2020-11-25T23:59:59+0000"}