{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour"}}, "datePosted": "2020-11-06T09:46:13+0000", "description": "&lt;p&gt;About the Role: We have a vacancy for you to join a small existing friendly team, supporting individuals with a learning disability to lead a full and meaningful life. You will have the opportunity to develop your skills, share your experiences and really make a difference to the lives of those we support.&lt;/p&gt;\n&lt;p&gt;As a support worker you will help residents learn new skills and be a vital part in supporting them to achieve their outcomes in life. You will support them to get out and about visiting family and places of interest, enjoying hobbies, leisure interests and much more.&lt;/p&gt;\n&lt;p&gt;It may be that you want a change, fresh start or just want to bring your skills to a new service, where at the same time you can benefit from support and guidance from the management team. There will be an opportunity for you to access our bespoke training package.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post will have experience in supporting people with mental health conditions (however this is not essential as training will be provided). Within this role you will need an understanding of, medication procedures, safeguarding policies and procedures, motivation skills, be self-motivated, flexible and organised.&lt;/p&gt;\n&lt;p&gt;About the Service: Situated in the market town of Denbigh, The satellite homes consist of a cluster of four homes, Brynfynnon, Glasfryn and Garth provide community facing residential care for up to 7 adults who have a primary diagnosis of a mental health disorder.&lt;/p&gt;\n&lt;p&gt;The four separate homes provide a home from home environment, compromising of two, three bedroom terraced house and one, one bedroom terraced house accommodating up to 7 individuals... The satellite homes provide a step down for residents ready to move to a more independent living setting.&lt;/p&gt;\n&lt;p&gt;Skills: Strong communicator, creative, motivated, ability to cope in challenging situations, understand and support individuals to lead a good quality of life whilst achieving positive outcomes along the way.&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking available, Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Enhanced payments for Night Shifts and Bank Holidays&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package, Progression Opportunities, We also offer Health &amp; Social Care QCF qualifications&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;Salary: £8.76 per hour&lt;/p&gt;\n&lt;p&gt;Desirable/ Requirements: QCF Level 2 Health &amp; Social Care &amp; willingness to work towards QCF level 3&lt;/p&gt;\n&lt;p&gt;Hours of Work: 37.5 per week, working on a rolling rota basis&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;*Please note, successful candidates must be aged 18 or over*&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denbigh", "postalCode": "LL16 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1852", "longitude": "-3.41514"}}, "title": "SUPPORT WORKER - SATELLITE HOMES", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259092", "validThrough": "2020-12-06T23:59:59+0000"}