{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-15T14:22:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Bank Mammographer&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are looking for a bank mammographer withcurrent experiencewho will also be required to carry out some general radiography. This post is available as a bank position.&lt;br /&gt;&lt;br /&gt;You’ll have a BSc degree in diagnostic radiography or equivalent and have current registration with the Health and Care Professions Council (HCPC) . A postgraduate qualification in Mammography is essential.&lt;br /&gt;&lt;br /&gt;At Nuffield Health, your role calls for equal excellence in technical and people skills. You’ll need high levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail. You’ll also need a caring nature and the ability to see each patient as an individual and carry out this role with understanding and empathy. Here, you’ll deliver a high quality diagnostic imaging service for a very varied caseload - within MR and CT but also in the general radiography when required.&lt;br /&gt;&lt;br /&gt;We value expertise at Nuffield Health. It’s our combination of expert knowledge, innovative thinking and passion for care that has enabled us to become Britain’s largest not for profit healthcare provider. It has also helped us to build a unique network delivering connected healthcare - from hospitals, to Fitness and Wellbeing Clubs, to specialist services including physiotherapy. Across our network, brilliant people benefit from our commitment to invest every penny in our services and people. With more time and greater scope to do what you love, the specialist in you will thrive here.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Holiday in line with the Working Time Directive.&lt;/li&gt;\n&lt;li&gt;Access to our Pension Scheme.&lt;/li&gt;\n&lt;li&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;- £18.00 per hour&lt;br /&gt;&lt;strong&gt;Location -&lt;/strong&gt;Plymouth&lt;br /&gt;&lt;strong&gt;Bank Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4187", "longitude": "-4.11449"}}, "title": "Bank Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228558", "validThrough": "2020-11-30T23:59:59+0000"}