{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35745", "minValue": "30451", "unitText": "YEAR", "value": "£30,451 - £35,745"}}, "datePosted": "2020-11-02T11:21:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Grade/Band: J-K  &lt;br /&gt; Vacancy Hours: 37 and 18.5  &lt;br /&gt; Contract Type: Permanent  &lt;br /&gt; Weekend Working Yes at present to meet the demands of Covid 19. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt; North Yorkshire County Council is proud of a successful track record as a leading care service provider and consistently appears amongst the top performing County Councils in the country.&lt;br /&gt; We have opportunities for Social Workers (Social Care Assessors) on both a full time and part time permanent basis in the Ryedale teams.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt; NYCC has been privileged to have been the finalists for the Social Work of the Year awards 2016 and for best Social Work Employer. There has never been a better time to start a career with North Yorkshire County Council, the time for change and innovative approaches to delivering care is something you could be part of. We are fortunate to be able to invest in new professional leadership in Social Work as well as developing wider career paths for staff. &lt;br /&gt;&lt;br /&gt; Our skill mix is a 2:1 ratio of qualified practitioners in recognition of the increasing complexity of clients in Adult Social Care. We fully recognise the need to support staff development and enhance skills and experience which we deliver through senior professionals within the service.&lt;br /&gt;&lt;br /&gt; Through recent advertising we have made great staffing additions to our teams which provide us with the experience, skills and creativity of both long established colleagues and newcomers to the county. As a Social Worker you will undertake a range of asset and strength based assessments and interventions to ensure that adults with care and support needs and their carers achieve their desired outcomes and wellbeing to live independent lives. This will also include developing personalised care and support plans that represent best value. You will determine eligibility for adults with care and support needs against the national standards and ensure they are safe from harm. Where harm or abuse is identified you will ensure the safety of the person and undertake the relevant safeguarding enquiries.&lt;br /&gt;&lt;br /&gt; Please ensure you have read the requirements of the role in the job profile document provided alongside this advertisement. You must have a good working knowledge of current adult social care legislation and application of the legislative principles including the Care Act 2014.&lt;br /&gt;&lt;br /&gt; What makes us a great employer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We promote a safe culture of support and learning&lt;/li&gt;\n&lt;li&gt;We promote and enable a better work/life balance which we recognise is of great importance&lt;/li&gt;\n&lt;li&gt;We support the ASYE programme for newly qualified Social Workers and we will ensure you have an excellent training and learning provision to progress from band J to band K.&lt;/li&gt;\n&lt;li&gt;We offer rotation across teams over time to gain a wider exposure, experience and depth of knowledge.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Join our team and you can:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be part of a committed and supportive team&lt;/li&gt;\n&lt;li&gt;access a range of benefits including generous leave entitlement, flexible working, a local government pension scheme, salary sacrifice and employee discount benefits&lt;/li&gt;\n&lt;li&gt;access health and wellbeing advice and support for you and your family&lt;/li&gt;\n&lt;li&gt;utilise new technology enabling modern ways of working and supporting flexible working.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; We would encourage you to contact us for an informal discussion and we would be happy to provide more information about the roles available. Please contact Team Manager Kate Wright on 01609 536113 or Team Manager Miranda Horne on 01609 536564 &lt;br /&gt;&lt;br /&gt;&lt;br /&gt; Enhanced Level DBS Disclosure is required for appointment  &lt;br /&gt;&lt;br /&gt;&lt;br /&gt; NYCC are committed to directly recruiting staff and will not accept applications nor services from agency suppliers in respect of our vacancies. &lt;br /&gt;&lt;br /&gt; We are committed to meeting the needs of our diverse community and aim to have a workforce reflecting this diversity. We are also committed to safeguarding and promoting the welfare of children, young people and adults. We expect all staff and volunteers to share this commitment. &lt;br /&gt;&lt;br /&gt; North Yorkshire County Council (NYCC) advertise vacancies on behalf of schools and external organisations (third parties) in North Yorkshire. NYCC are not responsible for the recruitment/employment practices of third parties and accept no liability in relation to the vacancy and any subsequent recruitment/employment processes. Enquiries regarding the vacancy or practices should be made directly with the third party.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Yorkshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129517"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ryedale House, Malton", "postalCode": "YO17 7HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1392", "longitude": "-.789358"}}, "title": "(062683) Social Care Assessor Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251764", "validThrough": "2020-11-15T23:59:59+0000"}