{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa (based on full time hours)"}}, "datePosted": "2020-10-30T12:45:30+0000", "description": "&lt;p&gt;We are seeking an innovative and enthusiastic registered practitioner to fulfil a new role being developed within the Fareham and Gosport Area. A new Same Day Access role has been created to help support the triaging and appropriate onward referral of individuals attending the Same Day Access services within this area. The role will be responsible for working within the services providing the appropriate support, guidance to colleagues around mental health presentations as well as providing the assessments of those where further support and onward referral may be required.&lt;/p&gt;\n&lt;p&gt;The role will work out of the two Same Day Access Centres one in Gosport and one in Fareham and would manage their time and diary accordingly to provide the required support and resource to both services as part of an extension of the local Community Mental Health Team, managed and supervised from that team.&lt;/p&gt;\n&lt;p&gt;The role holder will need to be competent and confident in the assessment of an individual’s mental health needs as well as being able to flex to required demand and prioritise appropriately. &lt;strong&gt;Needs to have previously worked in a mental health service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO12 3PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7931", "longitude": "-1.14807"}}, "title": "Same Day Access Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250228", "validThrough": "2020-11-13T23:59:59+0000"}