{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14658", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 per hour"}}, "datePosted": "2020-11-05T09:07:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Vacancies for 111 Health Advisors&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full-time rotapattern will include weekday evenings and weekends.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;£8.72-10.30 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Crutes House – Stockton-on-Tees&lt;/p&gt;\n&lt;p&gt;Are you looking for a career path into healthcare yet have no medical background? Are you looking for a career change or a role to enhance existing skills? If you are passionate about helping others and want to make a difference, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Vocare/Totally PLC work in partnership with the NHS to provide accessible and high-quality integrated health care services. The Integrated Urgent Care (IUC) service operates 24/7, 365 days a year. It provides access to telephone triage, face to face and digital online access points for patients and health care professionals in order to deliver urgent care services for people who live, work or visit the area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS 111 service is currently expanding, and we need dedicated and passionate Health Advisors to join our team.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you have excellent communication skills, and a passion to work for the NHS?&lt;/li&gt;\n&lt;li&gt;Are you caring, empathetic and do you want to help make a real difference to people’s lives?&lt;/li&gt;\n&lt;li&gt;Are you confident on the phone and willing to train to be able to provide guidance to patients in a calm and logical way?&lt;/li&gt;\n&lt;li&gt;Are you resilient and resourceful and able to manage calls that may potentially be distressing or an emergency?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If your answer to the above is yes, please come and meet us to explore joining our service.&lt;/p&gt;\n&lt;p&gt;This role is in a busy, patient focused environment, handling calls from members of the public regarding health problems. While not every 111 call we deal with is a life-threatening emergency, our Health Advisors triage calls through a medical assessment tool called NHS Pathways and advise of the most appropriate level of care for the patient. A Clinical Advisor and Clinical Navigator within the IUC are always there to provide support. As a Health Advisor, you will be answering telephone calls directly from the public and health care professionals, directing the caller to the most suitable service to meet their needs. This may include escalating certain patient calls to our Clinical Advisors and/or dispatching an ambulance in the case of an emergency or referring onto other available services.&lt;/p&gt;\n&lt;p&gt;Training is structured and intense in line with the NHS Pathways licence. You must be able to commit to a full-time training course for a minimum of 3 weeks. Training times are Monday to Friday 9am-5pm.&lt;/p&gt;\n&lt;p&gt;Once you have successfully completed your live call assessments you will be working as part of the regular team within the call centre.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Expectations:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our IUC service operates 24/7 and 365 days a year. If you choose to apply and join our team your application will be subject to Disclosure and Barring Service checks. If you are successful you will be required to work during both in hours and out of hours periods. This will include weekends/bank holidays and may include night duty. Once you commence with us there is a period of probation. This is generally six months&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career Development:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a successful applicant when you are offered a role you will be paid to complete your induction and the full NHS Pathways and system training to prepare you for the role.&lt;/p&gt;\n&lt;p&gt;There are also on-going development opportunities once you have completed your probation period. These are in line with NHS Pathways and NHS England’s workforce blueprint, as well as with personal developments you may identify in your probation reviews or appraisal which relate to your role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of joining us:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;28 days pro rata holiday entitlement (including bank holidays)&lt;/li&gt;\n&lt;li&gt;Company Pension Scheme&lt;/li&gt;\n&lt;li&gt;Perkbox staff benefit scheme&lt;/li&gt;\n&lt;li&gt;Shift working&lt;/li&gt;\n&lt;li&gt;Eye test scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Company sick pay after one year of service&lt;/li&gt;\n&lt;li&gt;Company Maternity/Paternity pay after one year of service&lt;/li&gt;\n&lt;li&gt;Access to updates and courses&lt;/li&gt;\n&lt;li&gt;Being part of a supportive and innovative team with scope for progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing date forALLapplications is 28th October 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the following shortlisting approach will be applied:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 1&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 2&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 3&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please assume you have been unsuccessful with your application if you have not heard back from us within 2 weeks of the closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful applicants will be subject to a DBS Check&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton on Tees", "postalCode": "TS17 6EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5633", "longitude": "-1.30244"}}, "title": "111 Health Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257002", "validThrough": "2020-11-11T23:59:59+0000"}