{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T20:15:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Title Children and Young People’s Diabetes East Midlands Network Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band&lt;/strong&gt; 7&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hosted&lt;/strong&gt; by Kettering General Hospital NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Accountable to the Chair of the Children and Young People’s East Midlands Diabetes Network and its constituent members you will be responsible for all aspects of the smooth running of the network and its work programme. The network is made up of clinicians, commissioners and other managers, the voluntary sectors, parents and carers of children with diabetes and meets regularly to share good practice and receive updates nationally and on the work of its subgroups. It is a vibrant group of people who have a huge commitment to improving care for children and young people with diabetes.&lt;/p&gt;\n&lt;p&gt;Working with clinicians who deliver children and young people’s diabetes care you will use a high level of facilitation and organisation skills to ensure that the network aims are met; this will be through full network meetings and meetings of its subgroups whilst building relationships with the healthcare teams and the other organisations that make up the network. The post is hosted by Kettering General Hospital NHS Foundation Trust but will work across the full network region and will involve considerable travel.&lt;/p&gt;\n&lt;p&gt;The role is to manage the activities of the Children and Young People’s East Midlands Diabetes Network by supporting the Network Chair and ensuring the delivery of the actions from the network work programme. This involves organising a variety of meetings, developing and implementing a work programme of actions, budgetary management, line-managing the network administrator and communicating at a high level with children and young people’s diabetes units and others to ensure service improvement through the sharing of good practice. The role will also influence children and young people’s diabetes units to improve the quality of their patient care and complete various data sets for information reporting and sharing including the requirements of the regional registers and the National Paediatric Diabetes Audit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Marie Atkins&lt;/p&gt;\n&lt;p&gt;Job title Children and Young People with Diabetes Network Manager for East and West Midlands&lt;/p&gt;\n&lt;p&gt;Email address Marie.Atkins@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07786 541 423&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Children and Young People East Midlands Diabetes Network Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253081", "validThrough": "2020-11-16T23:59:59+0000"}