{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-11-03T12:00:54+0000", "description": "&lt;p&gt;&lt;strong&gt;The Parenteral Services Unit (PSU) of the Bristol Haematology and Oncology Centre are looking to recruit an enthusiastic and motivated Band 4 pharmacy technician into a fixed term post, who wishes to develop their technical expertise while working in our busy aseptic unit. The unit provides cytotoxic chemotherapy treatments and Parenteral Nutrition to the BHOC, St. Michael&#39;s Hospital and the Bristol Royal Children’s Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining our dynamic team of pharmacists, technicians and assistants at an exciting and challenging time in developing a first class aseptic service.&lt;/p&gt;\n&lt;p&gt;Good communication &amp; interpersonal skills are essential and you must be motivated, flexible, adaptable and able to work well in a team. Aseptic preparation experience is not essential as full training will be given and the successful candidate will train towards gaining the South West pre and in-process Checking Accreditation.&lt;/p&gt;\n&lt;p&gt;Candidates are required to be registered, or be eligible for registration (pre-registration technicians), as a pharmacy technician with the General pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston NHS Foundation Trust is a lively and thriving group of hospitals in the heart of Bristol. The Pharmacy Parenteral Services Unit (PSU) is a specialist aseptic preparation unit based in the Bristol Haematology and Oncology Centre (BHOC). Bristol is a vibrant and culturally diverse city, and the unit is only walking distance from Bristol city centre, the main shopping area of Broadmead, Clifton, and the harbourside - all of which have a variety of shops, restaurants, cafes and bars. The hospital is also close to a number of transport routes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Connett, Senior Pharmacy Technician - emma.connett@uhbw.nhs.uk 0117 342 4466&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parenteral Services Unit; Level 8; Bristol Haematology and Oncology Centre, Bristol", "postalCode": "BS2 8ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4583", "longitude": "-2.59763"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253853", "validThrough": "2020-11-15T23:59:59+0000"}