{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23000", "minValue": "21450", "unitText": "YEAR", "value": "£21,450.00 – £23,000.00 per year"}}, "datePosted": "2020-11-06T10:19:57+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking to recruit an enthusiastic and well-motivated Assistant Psychologist to work within our Care Centres.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working under supervision of our Consultant Clinical Neuropsychologist, the role of Assistant Psychologist will be to undertake a broad range of psychological assessments, including the use of psychometrics, self-report measures, rating scales, direct and indirect structured observations. This includes monitoring resident’s mood, anxiety levels and behaviour, reporting and charting change and progress. In addition, you will be required to assist in the formulation and delivery of psychological support plans, and review reports for all residents and will be an integral part of our Multi-Disciplinary Team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to possess excellent communication skills and have a bachelor’s degree in Psychology or equivalent, and experience as an Assistant Psychologist or a Carer in resident care working with adults who have neurological conditions, including dementia and acquired brain injury or proven awareness of Clinical Psychology services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In support you will receive regular clinical supervision in accordance with professional practice guidelines from the Consultant Neuropsychologist and enjoy a wide range of benefits on offer to all our staff members including 25 days annual leave.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;PJ Care is one of the Sunday Times 100 Best Companies to Work For in 2019 and is a leading provider of specialist neurological care and neuro rehabilitation for people with progressive or acquired neurological conditions. We specialise in the care and treatment of adults and our residents are at the heart of everything we do. Dignity, independence and holistic wellbeing is achieved through specialist care models, in-house therapies and activities provided.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "P J Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134817"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5925", "longitude": "-.287674"}}, "title": "Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259192", "validThrough": "2020-11-20T23:59:59+0000"}