{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a., pro rata for part time"}}, "datePosted": "2020-10-30T16:45:50+0000", "description": "&lt;p&gt;Through an innovative and collaborative approach with primary care and Dorset’s NHS Foundation Trusts. It brings together NHS 111, a new clinical assessment service, non-core hour’s primary care, a single point of access for professionals, urgent care treatment centres, minor injuries units and night nursing services.&lt;/p&gt;\n&lt;p&gt;Joining us as a Clinical Advisor in our 111 service will provide you with a great opportunity to make a real difference by working for an organisation dedicated to delivering safe, responsive and patient focused service to people requiring healthcare advice and assistance. The 111 service is available 24 hours a day, 7 days a week, 365 days a year.&lt;/p&gt;\n&lt;p&gt;We are looking for Band 5 Clinical Advisors to join our Integrated Urgent Care Service as telephone triage clinicians based at the 111/CAS Clinical Hub, St. Leonards, Dorset. &lt;br /&gt;&lt;br /&gt;You will be line managed by an Operational Duty Manager, and would be clinically accountable to a Clinical Manager. Clinical Managers will provide clinical direction to all IUC Clinical and Senior Clinical Advisors.&lt;br /&gt;&lt;br /&gt;You must currently be registered with either the NMC (Nurse) or HCPC (Paramedic). &lt;br /&gt;&lt;br /&gt;You will be responsible for providing and ensuring a consistently safe, responsive and patient-focused service to those requiring assistance and advice from the Integrated Urgent Care Service. This role allows the clinician to work with other healthcare professionals to ensure the patient receives the most appropriate care. There is also the opportunity for face to face patient contact working within the Treatment Centres situated across Dorset.&lt;br /&gt;&lt;br /&gt;In the Hub the clinician will perform a telephone triage assessment for members of the public. You will manage calls from Healthcare Professionals and support IUC Health Advisors who answer the initial calls from the public. Once competent in core duties you will undertake a Continuous Quality Improvement course to allow them to audit and support peers. Further development will allow the clinician to act as the Clinical Team Leader for the shift whilst on duty, supporting the multi-disciplinary team and offering clinical advice where necessary.&lt;br /&gt;&lt;br /&gt;You will be provided with training for the NHS Pathways system and will be expected to commit to a detailed training and supervised practice programme.&lt;/p&gt;\n&lt;p&gt;Full or part-time hours are available. You must be able to demonstrate flexibility across the hours you can work; including overnight; weekends and/or Bank Holidays. Once sufficiently experienced in the role the Trust are also able to explore clinicians working remotely from home or at other Trust locations to further enhance the resilience of the operation at times of high demand.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nurse Ollie Watts, Telephone number: 07825755464&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ferndown", "postalCode": "BH24 2RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8179", "longitude": "-1.85603"}}, "title": "NHS 111 Clinical Advisor, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250978", "validThrough": "2020-11-15T23:59:59+0000"}