{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T17:15:49+0000", "description": "&lt;p&gt;The Pain Service at Epsom and St Heliers University Hospitals NHS Trust is offering the opportunity for the correct candidate to be appointed to the role of Locum Consultant in Pain and Anaesthesia for an initial period of&lt;strong&gt; 6 months&lt;/strong&gt; in the first instance, it is likely that this post will be renewed or become permanent.&lt;/p&gt;\n&lt;p&gt;The candidate will be expected to work across sites cross site working depending on the needs of the service . The job plan will include 10 Programmed Activities with a 1 in 12 on call commitment that will be agreed with the Clinical Lead&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate must be dedicated to the pursuit of excellence, always placing the patient first.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Epsom and St Helier University Hospitals NHS Trust provides a range of medical services to approximately 420,000 people living across southwest London and northeast Surrey. In addition, we provide more specialist services, in particular renal and neonatal intensive care to a wider area covering parts of Sussex and Hampshire.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Epsom &amp; St Helier Anaesthetic department is aligned with the STG teaching programme for medical students and the South Thames School of Anaesthesia training programme. We have ACSA Accreditation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is a well established Simulation teaching programme which may give opportunities for suitably qualified applicants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We score highly in national Hip Fracture audit data and are one of the busiest 5 units in London.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a dedicated daycase Paediatric Hospital with visiting Surgeons from St Georges and a very busy Obstetric Unit which accepts outside referrals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We serve an area that is rich in diversity, with a mix of urban and rural areas, and differing levels of quality of life. We cover some of the most prosperous postcodes in the country, as well as some poorer areas. Together with our colleagues at NHS Surrey and NHS Sutton and Merton, we work to make sure that we deliver the best possible care to the communities we serve.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sara Bustamante Job title Clinical Lead - Pain &lt;br /&gt;Email address Sara.bustamante@nhs.netT elephone number 020 8296 2102&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier Hospital, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Locum Pain Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254901", "validThrough": "2020-11-15T23:59:59+0000"}