{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-11-06T13:31:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Palliative Care Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a skilled, motivated and compassionate nurse with relevant experience in caring for children with life threatening/limiting conditions.&lt;/p&gt;\n&lt;p&gt;Focus of care will be on quality of life, supporting the child/young person and family through their palliative care journey and end of life phase whilst in their own home. We require someone who is passionate about palliative care and is able to make a difference to the lives of children/young people and their family.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to support families with assertive caseload management to ensure all aspects of social, emotional, practical and nursing needs are met.&lt;/p&gt;\n&lt;p&gt;Post holder will be expected to provide leadership and supervision to the Children’s Community Nurses and act as a role model for the delivery of excellent palliative care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;RSCN Child Branch&lt;/p&gt;\n&lt;p&gt;Community qualification at degree level desirable&lt;/p&gt;\n&lt;p&gt;Palliative care qualification desirable&lt;/p&gt;\n&lt;p&gt;Independent non medical prescribing qualification desirable&lt;/p&gt;\n&lt;p&gt;Applicants must be a car driver.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachael WilliamsJob titleClinical Lead, Children&#39;s Palliative CareEmail addressRachael.williams@bhamcommunity.nhs.ukTelephone number07974785098&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lansdowne Health Centre, Birmingham", "postalCode": "B18 7EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4892", "longitude": "-1.93388"}}, "title": "Band 6 Palliative Care Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259922", "validThrough": "2020-11-20T23:59:59+0000"}