{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-12T18:07:17+0100", "description": "&lt;p&gt;We have recently been awarded a 10 year contract for Adult Community Health Services across Bristol, North Somerset &amp; South Gloucestershire (BNSSG) which is a really exciting opportunity for us in Sirona care &amp; health.&lt;/p&gt;\n&lt;p&gt;The growth and development of Sirona is a new and exciting chapter. This will enable us, together with our colleagues across the system, to work with individuals, carers and families to transform out-of-hospital services to support people to live longer and healthier lives, accessing care and support close to where they live and ensure consistency and equity across BNSSG.&lt;/p&gt;\n&lt;p&gt;We are working towards setting up Integrated Network Teams (INT) aligned to Primary care networks.&lt;/p&gt;\n&lt;p&gt;There will be 18 INTs across BNSSG. These teams will be fully integrated ‘out of hospital’ health care services, delivered in close collaboration with primary and social care.&lt;/p&gt;\n&lt;p&gt;These teams will support and empower people to stay and age well, reduce the demand for emergency hospital services and long term care placements. Integrated multidisciplinary teams, offer both planned and unplanned interventions to improve outcomes for service users and support more people to self-care.&lt;/p&gt;\n&lt;p&gt;Each INT will be made up of the following;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Community Matrons/Advanced Care Practitioners - Long term conditions&lt;/li&gt;\n&lt;li&gt;Registered nursing &amp; therapy professionals&lt;/li&gt;\n&lt;li&gt;Highly skilled support staff including nurse associates, assistant practitioners and support workers&lt;/li&gt;\n&lt;li&gt;Public health nursing (Active Ageing service)&lt;/li&gt;\n&lt;li&gt;Dedicated administrators&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Integrated network teams will offer a consistent service from 8am to 8pm, 7 days a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you clapped for us in April then we want you to come join us and help support our community, these are all new posts due to extra funding as the fight continues over winter…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you ready to take on a new challenge and join our established Community Rehabilitation Team (CRT) supporting the residents of Bristol, North Somerset &amp; South Gloucestershire to make meaningful improvements in their lives and enhance their physical and emotional well-being?&lt;/p&gt;\n&lt;p&gt;Do you have a passion to deliver exceptional Community-based therapy and support to our service users to improve their quality of life and optimise their function? If the answer is yes, you could be the one for us!&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic and innovative staff to join our busy and dynamic team working to prevent hospital admissions for service users and to facilitate a timely hospital discharge to their homes when safe to do so. You will work in a Community setting (usually in service user’s homes) to promote independence and choice for our service users and their carers, providing help with activities of daily living, improving service users mobility and supervising and progressing home exercise programmes. Previous experience in health or social care is desirable but a comprehensive induction and skills-based training programme will make sure you are able to confidently undertake your role. You will be working within a team that includes Physiotherapists and Occupational Therapists and can expect regular support and supervision from these team members, including 1:1 sessions and a peer group specific In-service training programme. We also work closely with our community nursing colleagues and other health and social care providers.&lt;/p&gt;\n&lt;p&gt;We have full and part time positions available - full driving licence and access to a car are essential.&lt;/p&gt;\n&lt;p&gt;Please read the full job description attahced and do get in touch if you have further questions: Jayrah - sirona.recruitment@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol, North Somerset &amp; South Gloucestershire", "postalCode": "BS15 9TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4627", "longitude": "-2.50131"}}, "title": "Community Rehabilitation Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223366", "validThrough": "2020-11-15T23:59:59+0000"}