{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa Incl"}}, "datePosted": "2020-11-05T12:16:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Highly Specialist Speech and Language Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mainstream Schools Service - DLD specialism&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 1.0wte (part time would be considered for the right candidate)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Wandsworth Mainstream Primary Schools&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: St John’s Therapy Centre, Battersea, SW11 1SW &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Georges Healthcare Trust is responsible for improving the health of a culturally diverse population of people in south west London. Wandsworth is located in the heart of south west London with a vibrant and multicultural community. There are excellent public transport links to Central London and many shops, restaurants, cafes and bars in the area.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, motivated and dynamic speech and language therapist to take up an exciting opportunity available within our primary school therapy service. To achieve our commitment to delivering evidence based, high quality and progressive services, we have implemented an innovative way of working in mainstream schools delivering SLT services at the universal, targeted and specialist levels. You will have the opportunity to use and develop your skills in delivering therapy services at all levels whilst working in a model that promotes a ‘whole school’ approach to meeting children’s speech, language and communication needs.&lt;/p&gt;\n&lt;p&gt;The post holder will take on lead roles within the SLT team to ensure delivery of a high quality service to schools. The role will encompass line management and support of junior speech and language therapists and speech and language therapy assistants. The post holder will also have a lead role as leading on DLD within the wider team.&lt;/p&gt;\n&lt;p&gt;The role will give you the opportunity to be involved in training educational staff and parents, the encouragement and opportunity to be involved in research, journal clubs and peer supervision. Twice a year the team completes a ‘skills hub’ which allows time for observation and learning directly from other members of the wider Therapist team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of and highly specialist skills working with a diverse paediatric caseload in mainstream primary schools&lt;/li&gt;\n&lt;li&gt;Experience of supporting the evaluation of service delivery in mainstream schools&lt;/li&gt;\n&lt;li&gt;Experience in developing and delivering universal and / or targeted level offers to schools&lt;/li&gt;\n&lt;li&gt;Ability to work effectively as part of a multi-agency team&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly and independently where necessary&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Enthusiasm, imagination and initiative&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We will provide: &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;The opportunity to work within a highly skilled and experienced team of Speech &amp; Language Therapists&lt;/li&gt;\n&lt;li&gt;Access to a structured and supportive professional development process&lt;/li&gt;\n&lt;li&gt;Access to regular line management and clinical supervision&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The post holder will report to:&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Clinical Team Leader – Mainstream Primary Schools &amp; Resource Bases&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;For further information about this post please contact Jo Harrington Hill (CTL) on 0208 812 4024 jo.harrington-hill@stgeorges.nhs.uk&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Appointment is subject to an enhanced Criminal Record Bureau (CRB) check&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information about this post please contact Jo Harrington Hill (CTL) on 0208 812 4032 / 24 jo.harrington-hill@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St John&#39;s Therapy Centre, Wandsworth, London", "postalCode": "SW11 1SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4603", "longitude": "-.179609"}}, "title": "Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257624", "validThrough": "2020-11-19T23:59:59+0000"}