{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 per annum pro rata"}}, "datePosted": "2020-10-07T17:23:22+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for passionate and pro-activeAdvanced Practitioners (AP) to provide support and delivery to the integrated urgent care service within &lt;strong&gt;London Central and West Unscheduled Care Collaborative (LCW).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;LCWUCC is a GP-led Social Enterprise organisation providing Integrated Urgent Care services (NHS111 and GP OOH) as well as several urgent care services across North West and North Central London.&lt;/p&gt;\n&lt;p&gt;The organisation has in its 26-year history expanded its portfolio of services and our skill mix of clinicians who now include GPs, Advanced Nurse Practitioners, Nurses, Paramedics, and Pharmacists. In addition, we have grown our non-clinical support team. Most of our work is in the urgent care environment working in partnership with Commissioners, Acute and Community Trusts, GP Federations and other health and social care organisations in the development of integrated services.&lt;/p&gt;\n&lt;p&gt;LCW is a consistently high performer in all aspects of service delivery as well as other patient safety initiatives and compliance with best practice and statutory regulation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will the role involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for AP’s who will be responsible for providing triage and home visit support. This role will involve the management of cases as you normally would in the call centre- identifying, planning and prioritising with the ever-changing demands. You will be expected to build upon your personal development and enhance your clinical problem-solving skills and visiting housebound patients.&lt;/p&gt;\n&lt;p&gt;You will be using the Adastra system template that the GPs currently use. Training of this template will be provided during induction. Direct supervision and enhanced auditing will be provided in the immediate term. You will also be supported by the wider management team in the long term.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for APs who must be current qualified non-medical prescribers, with appropriately accredited clinical competencies to undertake face to face and telephone triage shifts within a Primary Care/Out of Hours setting.&lt;/p&gt;\n&lt;p&gt;You will ideally have previous experience of working in Integrated Urgent Care or experience of rapid response and/or primary care.&lt;/p&gt;\n&lt;p&gt;You must demonstrate evidence-based autonomous practice, safe clinical decision making and patient centred care to the highest standards. You will also be required to work collaboratively within a supportive and dynamic multi-disciplinary team committed to meeting the needs of a wide and diverse patient population and delivery of the best possible clinical outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Services: &lt;/strong&gt;UCCs (24hr), 111 (in hours &amp; CAS ED), GP OOH (Tel Triage and Home Visiting), Planned Care GP Practices Pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;£40,000 per annum pro rata (see job description for further details)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Competitive rates&lt;/li&gt;\n&lt;li&gt;Opportunity to work in a diverse clinical team&lt;/li&gt;\n&lt;li&gt;Supportive work environment&lt;/li&gt;\n&lt;li&gt;Monthly clinical feedback&lt;/li&gt;\n&lt;li&gt;Regular clinical and safeguarding updates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in this exciting role, please submit your CV and you will be contacted in due course. We look forward to your application and bringing you on board to help deliver urgent care services in these challenging times.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "London Central and West Unscheduled Care Collaborative (LCW UCC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Advanced Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217447", "validThrough": "2020-11-13T23:59:59+0000"}