{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-15T11:14:30+0100", "description": "&lt;p&gt;&lt;strong&gt;GP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Self Employed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an experienced Doctor, you’ll be making a difference every day. At Bupa, feel less pressured in a flexible and dynamic role to offer insight to our customer’s health and lifestyle and help them improve their wellbeing.&lt;/p&gt;\n&lt;p&gt;With a supportive network and a healthy work-life balance, expect autonomy and an environment where collaboration is celebrated.&lt;/p&gt;\n&lt;p&gt;You will be reporting into Lead Physician clinically and Centre Manager operationally. We currently have a growing team of GPs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Southampton Bupa health centre is located on the outskirts of city with free parking at the centre and good transport links to Southampton train station. The centre is just off the M271, providing easy access from either Bournemouth, Winchester or Portsmouth.&lt;/p&gt;\n&lt;p&gt;The Bupa health clinic is located in the Spire Southampton Perform centre which is the dedicated physiotherapy unit for the hospital. Other facilities on site include hydrotherapy and gait analysis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a varied number of Monday to Friday clinics between 09.30 and 18.00. Choose to run an all-day clinic or a morning or afternoon session.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you&#39;ll be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join one of our Bupa Clinics. This role will consist of providing the doctor element of the health assessments. We have a network of dedicated Bupa Health Clinics across the UK (which have superb CQC reports), and you will be joining a community of over 200 GP’s delivering services and treatments to everyone – not just those with health insurance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s a typical day?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Essentially, being a Bupa screening doctor means a rewarding role with more time to explore patient needs, more time to listen, and ultimately more job satisfaction.&lt;/p&gt;\n&lt;p&gt;We have an innovative approach to healthcare - with a real focus on customer satisfaction. You will be supported by a team of administrative and clinical support staff all working to provide a seamless service for our clients.&lt;/p&gt;\n&lt;p&gt;You will find your time is protected to ensure you are as productive as possible and have the appropriate time needed with each patient.&lt;/p&gt;\n&lt;p&gt;We are committed to offering a work life balance – this site only operates Monday to Friday, with no late evening appointments or extended hours&lt;/p&gt;\n&lt;p&gt;We nurture a friendly and supportive environment along with giving opportunities to explore your own potential and develop your professional skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we’re looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An experienced, confident GP with ideally 2 years recent experience working independently in a private or NHS surgery, although we would also consider applicants with less experience providing you have some NHS experience along with:&lt;/p&gt;\n&lt;p&gt;A professional, but not robotic manner - your caring nature should extend across patients and colleagues.&lt;/p&gt;\n&lt;p&gt;Great time management and flexibility in both your approach to health screening as well as changes in IT and developments to assessments.&lt;/p&gt;\n&lt;p&gt;Demonstrating clinical excellence, and professionalism across the role and taking pride in your work and in doing the best job you can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.43272"}}, "title": "GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227893", "validThrough": "2020-11-08T23:59:59+0000"}