{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Attractive packages available"}}, "datePosted": "2020-10-29T15:02:22+0000", "description": "&lt;p&gt;Recruitment Open Day - Clinical&lt;/p&gt;\n&lt;p&gt;Have you wondered what working in a clinical role in a private setting may look like? Are you considering a move into the independent sector but just don’t know enough about it?&lt;/p&gt;\n&lt;p&gt;We are hosting a virtual recruitment open day at Oaklands Hospital on Thursday 12th November for you to find out more about Ramsay Health Care UK and where we are going, meet our Senior Clinical Team and our Hospital Director, and find out about all of our opportunities at Oaklands&lt;/p&gt;\n&lt;p&gt;We are keen to speak to Nurses, Newly Qualified Nurses, ODP’s, Radiographers and Physiotherapists, to book your place on our virtual open day please register using the links below&lt;/p&gt;\n&lt;p&gt;Date: Thursday12th November&lt;/p&gt;\n&lt;p&gt;Event Type: Zoom&lt;/p&gt;\n&lt;p&gt;11:00 -click here to register for 11am&lt;/p&gt;\n&lt;p&gt;14:00 -click here to register for 2pm&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about these events, please emailNorth.Recruitment@ramsayhealth.co.ukwhere a member of our team will be in touch&lt;/p&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;Oakland’s Hospital is a part of Ramsay Health Care UK one of the leading providers of NHS and private patient services in England with a network of over 30 acute hospitals and treatment centres. Rated as GOOD by the Care Quality Commission, Oakland’s Hospital located in Salford, Manchester is a busy private hospital that delivers high quality private and NHS treatments and services.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“The Ramsay Way” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success. Click here to find out more.&lt;/p&gt;\n&lt;p&gt;Committed to quality, equality and opportunity for all.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greater Manchester", "postalCode": "M6 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4923", "longitude": "-2.32106"}}, "title": "Clinical Recruitment Event", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248797", "validThrough": "2020-11-12T23:59:59+0000"}