{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T12:45:56+0000", "description": "&lt;p&gt;Are you a Psychotherapist who is passionate about working with parents, infants and children under 5 years? Are you interested in working in an expanding service able to be creative and well-supported by colleagues and partners working with parents and children? If you are enthusiastic about helping this client group then this 12 month fixed term post will be an excellent opportunity.&lt;/p&gt;\n&lt;p&gt;Are you a Child Psychotherapist passionate about working with parents, infants and children&lt;br /&gt;under 5 years? Are you interested in working in an expanding service, alongside local&lt;br /&gt;colleagues and partners working with parents and young children? If you are enthusiastic&lt;br /&gt;about helping this client group then this 12 month fixed term post will be an excellent&lt;br /&gt;opportunity.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Parent Infant Mental Health service within Trafford is expanding to support parents and&lt;br /&gt;children 0-5year olds within the new umbrella of an Early Attachment Service. The service&lt;br /&gt;will be a small team of clinical psychology and psychotherapy with dedicated IAPT adult&lt;br /&gt;mental health practitioners who work closely with health visitors and others including&lt;br /&gt;children’s social care, specialist perinatal team, midwifery and Homestart to ensure parents&lt;br /&gt;and infants are well supported in the early years. We are looking for a qualified Child&lt;br /&gt;Psychotherapist who is able to join the team to work effectively and autonomously within&lt;br /&gt;this multi-agency context.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have experience of working with young children and their families who present with&lt;br /&gt;a range of relationship and social / emotional development needs and risk. It would be helpful&lt;br /&gt;to have skills and experience in supporting infants and their parents in the early years to&lt;br /&gt;develop secure attachments despite challenges.&lt;br /&gt;You will manage your own caseload, providing a range of high quality care appropriate to the&lt;br /&gt;infant, child and parent’s needs. You must have a demonstrable range of skills and&lt;br /&gt;knowledge base to deliver clinical aspects of the role and be competent to do this work as an&lt;br /&gt;autonomous practitioner within professional practice guidelines and a structured supervision framework. You must be confident and experienced in communication, due to the high level of liaison needed between the Parent Infant team and other services. This post is a clinical post and the expectation of time management is that the majority of time will be spent in face to face clinical practice. This is intended to be a full time post but part time hours would be considered.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Due to the nature of the role it is essential that applicants are able to travel independently&lt;br /&gt;across Trafford and have access to a suitable vehicle for business purposes. If necessary&lt;br /&gt;adjustments can be considered in accordance with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine TigheJob titleSenior Clinical PsychologistEmail addressc.tighe@nhs.netTelephone number0161 7164747Additional contact information&lt;/p&gt;\n&lt;p&gt;Candidates wishing to discuss the post, please contact Dr Catherine Tighe, 0161 716 4747.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waterside, SALE", "postalCode": "M33 7ZF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4251", "longitude": "-2.32"}}, "title": "Band 7 Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255901", "validThrough": "2020-11-10T23:59:59+0000"}