{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa"}}, "datePosted": "2020-10-26T14:01:56+0000", "description": "&lt;p&gt;Are you passionate about transformation and improvement in healthcare to deliver sustainable improvements in quality, patient care and financial sustainability?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Programme Manager to the join the Trust’s QI &amp; Transformation team, the team’s remit being to support the successful delivery of the Trust’s transformational plans as well as localised improvement initiatives, and to embed continuous improvement through QI.&lt;/p&gt;\n&lt;p&gt;As Lead Programme Manager, you would have a key role in the development and implementation of substantial cross-cutting transformational change, often involving largescale service re-design and organisational change.&lt;/p&gt;\n&lt;p&gt;You would also lead the development and management of the Trust’s Cost Improvement Plan, from idea to delivery, working closely with the Head of QI &amp; Transformation and the organisation to develop the plan as well as track and support delivery.&lt;/p&gt;\n&lt;p&gt;Along with the wider team, part of the role is also to help establish and embed a consistent Trustwide change framework which builds capabilities to effectively manage and deliver successful change.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have experience managing substantial transformational programmes to improve care pathways for patients, preferably within a healthcare environment. You will also have experience managing cross-cutting cost improvement programmes, with good financial acumen.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent interpersonal skills to quickly build strong working relationships, working with teams in Operations, Finance and HR, at both Executive and Divisional level, to influence the pace of implementation to ensure financial and operational outputs are delivered to plan.&lt;/p&gt;\n&lt;p&gt;The role will require an experienced, pro-active and resilient individual with excellent communication skills, who is comfortable working in a changing environment.&lt;/p&gt;\n&lt;p&gt;For further information/informal chat please contact Debbie Hawkins on debbie.hawkins1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital / Aylesbury Hospital / Remote working, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Lead Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242825", "validThrough": "2020-11-09T23:59:59+0000"}