{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T15:49:31+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting training opportunity has arisen for a Band 5 nurse, who wants to develop their skills in the field of Sexual Health and Contraception, and ultimately become a Nurse Specialist in Sexual Health. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will be based at Abbey View Clinic in Bury St Edmunds. There is the expectation that hours will be worked flexibly to meet the needs of the service and will include early morning and evening working. There may also be a requirement to travel to our spoke clinic in Haverhill.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is usually a two year training programme, however, a nurse with previous sexual health and/or contraception experience may not require the full two years.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be expected to enhance their knowledge and skills, undertaking the FSRH Diploma and the BASHH Sexually Transmitted Infections foundation course. We fully support the training and development of our staff, and expect a positive commitment to learning and a proactive approach to self-development and independent learning in the post holder.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Following completion of this training, and having achieved the relevant competencies, you will become a Clinical Nurse Specialist able to deliver a high quality integrated sexual health service and progress to band 6 within iCaSH.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a highly motivated, enthusiastic nurse, with a real interest in Sexual Health. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role within sexual health is challenging and the post holder would be expected to work on their own initiative, whilst having the support of colleagues. It is essential therefore, that candidates are committed to the provision of a holistic model of sexual health care, possess outstanding communication and interpersonal skills and an ability to work to a high standard within a small multi-disciplinary team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Hours: 37.5 hours per week, worked flexibly to meet service needs, including one early, 07.30, start and one late finish at 20.00&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested and would like an informal chat please call Sue Fuller CNM or Chris Leathers Dep CNM on 01284 731843 &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St Edmunds", "postalCode": "IP33 2AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2409", "longitude": ".721734"}}, "title": "Associate Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258433", "validThrough": "2020-11-20T23:59:59+0000"}