{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478.00 - £51,069.00 PA plus LW"}}, "datePosted": "2020-10-27T13:16:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow in Paediatric Neurology (ST4-ST8 equivalent)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Chelsea Children’s Hospital is currently recruiting for a senior clinical fellow in Paediatric Neurology. They will join our team of senior registrars/clinical fellows in paediatrics and cover our growing Paediatric Neurology service. The post is to commence as soon as possible for a six months on a fixed term contract.&lt;/p&gt;\n&lt;p&gt;The post provides an excellent opportunity for the post holder to develop and expand clinical skills in all areas of paediatric neurology at a tertiary setting and is suitable for those not currently in the training program, as well as for trainees looking for out of program experience or want to start a special interest module (SPIN)&lt;/p&gt;\n&lt;p&gt;Chelsea Children’s Hospital offers services in general paediatrics and paediatric subspecialities including Gastroenterology, Endocrinology, Paediatric High Dependency, Neurodisability and community paediatric services. The successful candidate will be working with the Paediatric Neurology team, covering outpatient clinics, in patient reviews and day case assessments will liaise with teams from other referring hospitals and will participate in 1 in 10 out of hour’s middle-grade rota providing cover to the general paediatric inpatients and emergency admissions. Out of hour shifts are very well supported with a resident Paediatric Consultant, a Paediatric Surgical Registrar and a Medical and Surgical Paediatric SHO on site.&lt;/p&gt;\n&lt;p&gt;Even though this post is not recognised for training, it provides excellent training opportunities. The post holder is expected to keep a training portfolio, will have regular assessments with their allocated educational supervisor and will be encouraged to participate in audit and quality improvement projects and demonstrate progression in the field of paediatric neurology during their tenure. Our paediatric Neurology department has an active research component and participates in national studies, giving the opportunity to the post holder to participate and gain experience in clinical research&lt;/p&gt;\n&lt;p&gt;Please note that the advert may close earlier should we receive high volume of interest. Interviews will take place shortly thereafter.&lt;/p&gt;\n&lt;p&gt;For further enquiries regarding the posts please do not hesitate to contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr James Ross, Service Director Acute Paediatrics Email: James.Ross@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Kyriaki Alatzoglou, Consultant, RCPCH College Tutor Email: Kyriaki.Alatzoglou@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;George Anastopoulos - Deputy General Manager george.anastopoulos@chelwest.nhs.uk - 02033156165&lt;/p&gt;\n&lt;p&gt;Dr Bisola Laguda, Service Director Paediatric Medical Sub-specialties&lt;/p&gt;\n&lt;p&gt;Email: bisola.laguda@chelwest.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminster, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Senior Clinical Fellow - Paediatric Neurology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244703", "validThrough": "2020-11-10T23:59:59+0000"}