{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:01:16+0000", "description": "&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;We have opportunities for Community Mental Health Nurses to join our team as a Care Coordinator.&lt;/li&gt;\n&lt;li&gt;You must have minimum of two years post qualification experience in clinical work within the mental health service, experiencing a range of mental health problems&lt;/li&gt;\n&lt;li&gt;•You must have experience of supervising staff, experienced in acting as a mentor/assessor of student staff&lt;/li&gt;\n&lt;li&gt;•You need to be able to work as part of a multidisciplinary team and have experience of assessing, planning and implementing and reviewing care needs.&lt;/li&gt;\n&lt;li&gt;You must be able to travel around the area of work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;------------&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Two exciting full time opportunities have arisen for the West Preston Community Mental Health Team, we are looking for motivated and enthusiastic innovative registered mental health nurses, occupational therapist or social worker to join the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder would be expected to have post-registration experience in community working and be passionate about an integrated approach to care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Duties of the role include assessing individuals on referral to the team, acting as a key worker throughout a person&#39;s care journey with the Community Mental Health team, having an allocation of a caseload of individuals where mental health is the primary need in addition to other long term conditions and complexities, liaising with relevant services already involved or that require involvement to meet the individuals care needs, working alongside the multi-disciplinary team (MDT) to formulate risk assessments and management plans, and the planning of holistic whole person care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your communication skills will be paramount in ensuring strong links with G.P practices and other members of the multi professional team who include professionals from both your own and other healthcare and social care organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will play a big part in supporting and empowering individuals who present with long term health conditions or complex health needs to manage and emotionally cope with their conditions within the community ensuring the right support is offered by the right professional at the right time. You will form therapeutic supportive relationships with those that you key work, their families and carers a role described by a professional in the team as &quot;back to the grass roots of nursing care in the community, that is hugely rewarding&quot; Service user and family/carer feedback for the team has been superb and we are looking for someone who really thrives on improving quality and offering assurance to individuals that they are the &quot;center&quot; of all that we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have read this advert and the post appeals to you then please apply ensuring that your personal specification reflects how you meet the needs of this role in particular.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jenna Jamison or Liz Forster on 01772 401 650&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Strand, Preston, Preston", "postalCode": "PR1 8UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7607", "longitude": "-2.71949"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254236", "validThrough": "2020-11-17T23:59:59+0000"}