{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34400", "minValue": "29025", "unitText": "YEAR", "value": "£29,025.38 - £34,400.45"}}, "datePosted": "2020-11-05T14:10:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Substance Misuse Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HMP Parc, Bridgend&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary range £29,025.38 - £34,400.45 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full-Time (40 hours per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the world’s leading security solutions group with operations in over 100 countries and more than 610,000 employees worldwide, G4S is a truly unique company. We’re bigger, more diverse and involved in more fascinating, cutting-edge projects than many people would imagine and we now have an opportunity for a Substance Misuse Nurse to join our team at HMP Parc, a category B prison, In Bridgend, South Wales, currently holding over 1600 men and young people in a secure but modern environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At HMP &amp; YOI Parc, we take very seriously the difficulties surrounding substance misuse and provide a service for those who wish to address their drug and alcohol problems, with the aim of supporting residents to live a substance free lifestyle and minimising harm to themselves and others. We do this by focussing on disrupting supply, reducing demand and providing treatment, support and throughcare. We will raise awareness of the health and social implications of using illicit drugs through education and counselling. We are also committed to working with a range of other agencies to provide continuity of care on release so that opportunities for positive outcomes are maximised.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinical services include substitute prescribing for opiate dependence, prescribing for detoxification from alcohol, and relapse prevention prescribing for both opiates and alcohol. All clinical services are overseen by G4S Health sessional doctors, with substance misuse nurses supporting the effective delivery of these services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clients will be offered a full range of support in order to assist them in overcoming their substance misuse; this will include harm reduction focused work delivered directly by Substance Misuse Nurses. Treatment will be individualised, and will seek to support clients to address their substance misuse as well as to raise motivation to address wider social and health issues.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Substance Misuse Nurses will deliver services in line with National Guidance, in addition to G4S/Kaleidoscope Operational Policies and Standard Operating Procedures (SOPs), ensuring that care is safe, undertaken to a high standard and informed by up-to-date, evidence-based practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will work with people who have recognised substance misuse issues. S/he will have excellent communication skills, be able to work closely with other multi-disciplinary agencies and flexibly and efficiently within a small team, to ensure services are delivered equitably and at times to suit the client.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;S/he will have a non-judgmental approach to people who have substance misuse problems and be able to provide a welcoming and accessible service to existing and potential service users.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Individual supervision will be provided six weekly for one to two hours as required. There will be an induction period, during which training will be provided in specific areas. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills as a Substance Misuse Nurse:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;● Part 1 NMC registration&lt;br /&gt;● Able to work within challenging and complex situations&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Desirable Skills as a Substance Misuse Nurse:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;● Evidence of further development of own clinical practice&lt;br /&gt;● Experience of working within a secure environment&lt;br /&gt;● RCGP 1 and 2 in substance misuse&lt;br /&gt;● Hold a Nurse Prescriber qualification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At G4S, the philosophy of our prisons is to rehabilitate offenders and equip them to re-integrate into mainstream society on release. Our aim is to create an environment in which staff and prisoners feel safe and causes of prison stress are minimised. Central to our philosophy is the relationship between staff and prisoners. Our training and operational practices emphasise the need to treat prisoners with dignity and respect and G4S staff build positive and supportive relationships with the prisoners in their care. We are seeking to recruit a caring, pro-active and confident professional to help make a real difference to their lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you join us, you will find a secure, friendly and professional working environment and be given all the support, training and encouragement you need to build and develop a successful career with us. Our benefits are as you would expect from a large organisation and include a company pension, comprehensive training, career development, generous holiday entitlement, uniform and access to our on-site gym.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Equality and Diversity is an important part of G4S Custodial and Detention Services. We actively encourage applications from all diverse groups.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that these vacancies are subject to a 10 year checkable history and the strict vetting standards set by G4S and the Secretary of State for the Home Office and are exempt from the Rehabilitation of Offenders Act.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be eligible to work in the UK and must have been resident in the UK for a minimum period of 5 years. You will also need to provide full details of your employment and education history for the last 10 years as part of the security screening process for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP &amp; YOI Parc is committed to a clean air policy for the wellbeing of its staff, and to protect them from the risks of passive smoking. Our prison is a smoke-free environment, and smoking is not permitted in any area of the establishment. The conveyance of smoking paraphernalia (including tobacco, cigarettes and e-cigarettes) through the Keylock and into the prison will be considered a disciplinary offence under the company’s Disciplinary Policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131154.JPG", "name": "G4S", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgend", "postalCode": "CF35 6AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.531", "longitude": "-3.56316"}}, "title": "Substance Misuse Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258043", "validThrough": "2020-11-17T23:59:59+0000"}