{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T09:15:45+0000", "description": "&lt;p&gt;You will play a lead role in building effective relationships within the Trust and support the development of a continuous improvement culture, through the delivery of high quality performance data and information. This is an important role, in which you will be responsible for data quality and benchmarking as well as ensuring information is reported accurately, consistently and effectively for performance reporting and providing information that supports business decisions. You will be involved in analysis, ad hoc reporting, root cause analysis of key issues for the Trust, and production of various performance papers and reports.&lt;br /&gt;&lt;br /&gt;You will need to have excellent knowledge of data analysis and strong communication and interpersonal skills. You will need to be able to demonstrate proven experience working in an information-related role and in extracting information from a variety of systems. NHS information management experience would be an advantage but is not essential.&lt;br /&gt;&lt;br /&gt;Experience of using Microsoft Excel at an advanced level is essential, and experience and knowledge of SQL Server Reporting Services (SSRS) and using SQL to query and manipulate data is desirable. The use of Microsoft Visual Studio is also desirable.&lt;br /&gt;&lt;br /&gt;You will provide information to Programme Managers, Executive Directors, Business Intelligence Managers, Locality management teams, Contract and Commissioning managers across all organisations. Consequently, excellent reporting and interpersonal skills are required, as is a professional approach.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andrew Haws&lt;/p&gt;\n&lt;p&gt;Head of Information Management and Business Intelligence&lt;/p&gt;\n&lt;p&gt;Email - a.haws@nhs.net&lt;/p&gt;\n&lt;p&gt;01244 393150&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redesmere, Countess of Chester Health Park, Liverpool Road, Chester, CH2 1BQ, Chester", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241821", "validThrough": "2020-11-09T23:59:59+0000"}