{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-13T14:31:34+0100", "description": "&lt;p&gt;University Hospitals of Morecambe Bay NHS Foundation Trust (UHMBT) invites applications for a Consultant Histopathologist (general) based at Royal Lancaster Infirmary, Lancaster.&lt;/p&gt;\n&lt;p&gt;This is a replacement post and would complete a team of 7 Consultant Histopathologists and one Associate Specialist providing histopathology, cytology and autopsy services for Morecambe Bay Hospitals and surrounding general practices. The department is warm, friendly, open and supportive and has a professional and friendly working relationship with clinicians through the MDT’s.&lt;/p&gt;\n&lt;p&gt;The post is available full time, 10PA&#39;s up to a maximum of 12PA&#39;s, or part time.&lt;/p&gt;\n&lt;p&gt;The department has two slots on the North West histopathology training rotation and is popular amongst trainees.&lt;/p&gt;\n&lt;p&gt;The posts are based in the centralised histopathology laboratory at the Royal Lancaster Infirmary, Lancaster. The trust serves all the specialties expected within a busy district general hospital and in addition provides bowel and breast screening services for North Lancashire and South Cumbria. An interest in bowel pathology would be a particular advantage but is not essential.&lt;/p&gt;\n&lt;p&gt;All pathologists participate in a general reporting rota but have areas of specialist interest and lead for one or more cancer groups. It would, however, be possible to accommodate a successful applicant who felt unable to report in certain specialties. Cervical cytology reporting is not required. Participation in the autopsy service is welcomed but not essential.&lt;/p&gt;\n&lt;p&gt;The trust has close ties with Lancaster University, and its recently opened medical school, offering the appointee the opportunity to be involved in medical student teaching and research&lt;/p&gt;\n&lt;p&gt;Much of the Morecambe Bay area lies within areas of outstanding natural beauty including the Lake District National Park, allowing a good life work balance. Housing costs are reasonable and local schools excellent. There are good road and rail communications, it being only two and half hours by train to London or Edinburgh and only one hour to Manchester.&lt;/p&gt;\n&lt;p&gt;You should hold the FRC Path or equivalent and be on the Specialist register or within 6 months of obtaining CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;A generous relocation package is available for successful applicants and enhanced rates of pay are available for additional work undertaken beyond contracted hours.&lt;/p&gt;\n&lt;p&gt;Interview expenses will be paid from point of entry to the UK&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Matthew Brown, Histopathology Clinical Lead:&lt;/p&gt;\n&lt;p&gt;Email: matthew.brown@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01524 512246&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224706", "validThrough": "2020-11-29T23:59:59+0000"}