{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 plus on-call"}}, "datePosted": "2020-10-23T08:16:41+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an opportunity for an experienced Pharmacist to join our forward thinking, patient focused Clinical Pharmacy service. We welcome applications from motivated and driven Pharmacists with excellent clinical and communication skills. You must be efficient, organised, able to work as a team and autonomously and also be innovative and resourceful. It is an exciting role that will require interaction with a variety of people, including patients, specialist nurses and consultants on a one-to-one basis.&lt;/p&gt;\n&lt;p&gt;This post will provide you with an outstanding breadth of experience in a comprehensive portfolio of specialised areas including: Infectious diseases, Critical Care, Coronary Care Unit, Medicines Information, Medical Admissions, and Medical Specialties including Cardiology, Respiratory, Endocrinology and Community Services.&lt;/p&gt;\n&lt;p&gt;You will join the Pharmacy team at a very exciting time for the Trust as our Acute Medical Unit at North Manchester expands to deliver safer care to patients. The unit is being transformed as part of an innovative approach which will deliver truly integrated services by continuing to strengthen links with primary care, integrated care and community care.&lt;/p&gt;\n&lt;p&gt;You will work as part of an expanded Pharmacy team that will provide effective, high standard pharmacy support across seven days a week. You will complete medicines reconciliations to reduce risks of drug errors and interactions that ensure harm free care for patients. You will work as an integral part of the multi-disciplinary team by providing expert advice regarding medication management, supporting medical staff to ensure safe and cost-effective prescribing and to provide accurate information to primary care and community care providers on discharge.&lt;/p&gt;\n&lt;p&gt;This position is ideal for a Pharmacist looking to develop clinical skills in a dynamic working environment, who is working towards a Post- graduate qualification in clinical pharmacy or equivalent. Consideration may be given to current band 6 Pharmacists who can evidence current experience to an acceptable level and who are committed to achieving a clinical diploma in an agreed timescale.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Walker&lt;/p&gt;\n&lt;p&gt;Principal Pharmacist&lt;/p&gt;\n&lt;p&gt;rebecca.walker@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 625 8336&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, North Manchester Care Organisation, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Rotational Specialist Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239655", "validThrough": "2020-11-08T23:59:59+0000"}