{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a."}}, "datePosted": "2020-11-05T14:01:11+0000", "description": "&lt;p&gt;Are you looking for an interesting new challenge? We are currently recruiting for a full-time administrator to join our friendly and supportive Mental Health Legislation team based at St. Ann’s Hospital, Poole. The team provides administration and advice around the use of the Mental Health Act, Mental Capacity Act and Deprivation of Liberty safeguards across the organisation. Although the vacant post is at St. Ann’s Hospital, applicants may need to support our other office based at Forston Clinic, Dorchester during times of need within the team.&lt;/p&gt;\n&lt;p&gt;As a team we are passionate about supporting service users and their relatives in understanding mental health legislation and how it affects them. We also work closely with many of the clinical areas within the Trust by providing advice on the use of legislation and how to apply relevant Codes of Practice. In addition we work with many external agencies and professionals such as Local Authorities, Ministry of Justice, Courts and Tribunals Judiciary and solicitors.&lt;/p&gt;\n&lt;p&gt;We believe this is the ideal job for those who enjoy an administrative role and desire a job where they will continue learn through the course of their employment. Some of the tasks an applicant might find themselves undertaking include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;organising service user appeals against their section;&lt;/li&gt;\n&lt;li&gt;ensuring service users are lawfully detained&lt;/li&gt;\n&lt;li&gt;supporting clinicians to meet statutory timescales for pieces of work&lt;/li&gt;\n&lt;li&gt;ensuring service users have been informed of their rights&lt;/li&gt;\n&lt;li&gt;sending notifications to the Care Quality Commission about care and treatment patients have received&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The team is looking for a motivated, hardworking and friendly individual who is an excellent administrator. The successful candidate will need to have an excellent eye for detail, be a quick learner and be able to work under pressure and to deadlines. The team is in regular communication with external agencies such as the Care Quality Commission, Mental Health Tribunal Service, Ministry of Justice, therefore excellent communication skills are required.&lt;/p&gt;\n&lt;p&gt;Working knowledge of the Mental Health Act, Mental Capacity Act and/or Deprivation of Liberty Safeguards would be advantageous. However, on-the-job training can be provided for the right applicant.&lt;/p&gt;\n&lt;p&gt;The post is full time based on 37.5 hrs, over 5 days a week (Mon-Fri). The job role may also involve travelling to Forston Clinic and other mental health units and community hospitals within Dorset, therefore applicants must be able to drive and have access to transport.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires a Standard Disclosure and Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gavin Macfarlane, Mental Health Legislation Manager, Email address: gavin.macfarlane1@nhs.net, Telephone number: 07920 206150&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;Simon Culy&lt;/p&gt;\n&lt;p&gt;Deputy Mental Health Legislation Manager&lt;/p&gt;\n&lt;p&gt;simon.culy@nhs.net&lt;/p&gt;\n&lt;p&gt;07734 254305&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH13 7LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6986", "longitude": "-1.92791"}}, "title": "Mental Health Legislation Administrator, Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258018", "validThrough": "2020-11-19T23:59:59+0000"}