{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-13T16:42:50+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant Paediatrician with an interest in Neurodevelopmental Paediatrics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is to cover a consultant vacancy and the department is looking to make further substantive consultant appointments within the next year.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post-holder will have a 10 PA contract and &lt;/strong&gt;&lt;strong&gt;participate in the Child Safeguarding 1 in 6 on-call rota.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Poole Hospital forms part of university Hospitals Dorset and has a large fully integrated General Paediatric Department serving a population of approximately90,000 children. There are 26 bedded medical and surgical inpatient facilities including high dependency and a further 9 bedded paediatric assessment unit. There is a separate child development centre. There are approximately 5000 deliveries (in Poole and Bournemouth) and approximately 420 neonatal admissions per annum.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The neonatal unit has 4 intensive care cots, 6 high dependency cots and 10 special care cots. We have a consultant team of 9 acute paediatricians, 5 neonatologists and 5 consultant community paediatricians. There is a tier of middle grade paediatricians who cover both the general paediatric wards and the neonatal unit, and separate rotas at junior level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The department is well respected and has a high standard of care with four Goods and one Outstanding in its last CQC inspection. It is a friendly and supportive department working within the excellent Wessex region paediatric area, and has an active research portfolio. See the video link to get a feel for the unit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The hospital is situated in one of the most beautiful parts of the country, with easy access to the countryside and to coastal areas. There is an excellent rail and road network to other major cities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal visits please contact Dr Sarah Morris Neurodevelopmental Paediatrician on 0300 019 3034 or sarah.morris@uhd.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Poole Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120849"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Locum Consultant Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225098", "validThrough": "2020-11-11T23:59:59+0000"}