{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 dependent on experience"}}, "datePosted": "2020-10-22T10:31:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Surgical Ward | Band 6 dependent on experience | Bristol | Full Time.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bristol Hospital is looking for a band 6 Registered Nurse to work 37.5 hours per week. Possible part time role available minimum of 22.5 hours&lt;/p&gt;\n&lt;p&gt;As the only private hospital in the South West with an Intensive Care Unit, Spire Bristol Hospital has been providing excellent care, expertise and knowledge in a supportive and progressive environment for over 32 years. We bring together the very best of facilities and people that modern medicine can offer. We are dedicated to providing quality treatment and aftercare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Hospital covers a wide variety of surgical procedures including Cardiac, Spinal and Orthopaedics. You will support in assessing patient’s health and well-being across a complex and changing caseload, assisting in the delivery of care to meet the patient’s needs. You will actively promote best practice and contribute towards quality improvements, collect collate and organise data, interpret all of the information and make a justifiable assessment, making this available to relevant others. There is a mixture of day cases and inpatient workload, multiple admissions and discharges on the same day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 3 years surgical nursing experience.&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 or email carly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Surgical Ward Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237922", "validThrough": "2020-11-22T23:59:59+0000"}