{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-28T16:01:06+0000", "description": "&lt;p&gt;We are recruiting to a permanent part time Band 7 post specialising in neuro/stroke and medicine/medicine for older people within the acute adult dietetic team at University Hospital Southampton NHS Foundation Trust (UHS). This role is for 22.5 hours per week. The post holder will provide clinical cover to the neuro wards and lead service developments across clinical areas.&lt;/p&gt;\n&lt;p&gt;We are looking for an HCPC registered dietitian with a passion for improving patient outcomes with the best nutritional care to lead on service developments and projects in these clinical areas and to lead the dietetic service in these areas. You will have significant experience of managing all forms of oral and enteral nutrition support and dealing with potential complications encountered.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;UHS is a leading teaching hospital, hosting a wide range of specialist tertiary services and a nutrition biomedical research centre. The department of dietetics and speech and language therapy employs approximately 100 staff, with clinical experts working across the range of specialties, providing both acute and community services.&lt;/p&gt;\n&lt;p&gt;You will join the acute adult dietetic team based at Southampton General Hospital. This is a busy, hardworking team known for its friendliness, support and development opportunities. As a team lead dietitian you will work closely with the other adult team lead dietitians responsible for other clinical specialties, ensuring adequate clinical cover is provided across the adult service and providing support and supervision of junior staff. You will also work closely with our Speech and Language Therapy colleagues on joint projects in these specialities.&lt;/p&gt;\n&lt;p&gt;Opportunities for training in leadership development will be supported as part of this role. You will report to the Adult Leads for Dietetics/SLT with professional support from the Head of Dietetics/SLT.&lt;/p&gt;\n&lt;p&gt;Our service operates Monday to Friday. The working days of the week for this role can be negotiated with the successful applicant.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be responsible for the day to day operational management of dietitians working across neuro/stroke, acute medicine and medicine for older people, providing supervision and support for junior staff and ensuring adequate cover is in place during periods of staff absence.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Complete appraisals for designated staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Attend regular meetings with the other team leads and managers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be responsible for recruitment and selection of junior staff as vacancies arise&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Lead on assigned projects within speciality areas&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be a weekly facilitator for dietetic students on B and C placements with responsibility for weekly reviews of learning outcomes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide a clinical service to patients with neurological conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Work closely with MDT colleagues in the planning and delivery of clinical services and initiatives&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Represent dietetics at relevant meetings&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Lead service developments, audits and specific projects&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide training to ward staff and MDT colleagues.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for someone who has a keen interest and experience in nutrition support and, with evidence of relevant, strong clinical skills. Flexibility and the ability to prioritise and manage a busy, complex caseload is essential. You must have excellent communication skills as well as an empathic nature. You must be able to demonstrate the ability to work within an MDT as a highly specialist dietitian, and have the confidence to present and discuss your professional opinion with colleagues. Experience of nutrition support is essential along with the ability to independently plan and prioritise a busy caseload in an efficient and organised manner. An understanding of service development and previous experience of supervision and line management would be helpful.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Tuesday, 24 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Claire Wood&lt;br /&gt;&lt;br /&gt;Head of Dietetics/Speech and Language Therapy&lt;br /&gt;&lt;br /&gt;Claire.wood@uhs.nhs.uk&lt;br /&gt;&lt;br /&gt;023 8120 6072&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Team Lead Dietitian (Neuro/Medicine)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247296", "validThrough": "2020-11-11T23:59:59+0000"}