{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 Pa inc"}}, "datePosted": "2020-10-26T21:15:19+0000", "description": "&lt;p&gt;Band 8a Lead Research Nurse and Peart Rose Research Unit Manager, Cardiovascular&lt;/p&gt;\n&lt;p&gt;This is an opportunity for an experienced, dynamic and self-motivated senior research nurse to join the Peart Rose Research Team within the Surgery, Cancer and Cardiovascular Division at Imperial College Healthcare NHS Trust. You will lead a team of research delivery staff, who support a portfolio of approximately 60-70 studies directly and also support the unit’s operational and strategic business development.&lt;/p&gt;\n&lt;p&gt;You will be a key part of the Senior Divisional Research Management team. You will lead on various initiatives to help deliver an ambitious research strategy for the growth and development of the cardiovascular research, with a vision to make the unit one of a kind, noteworthy of global attention. You will also be responsible for the leadership and management of the team – this includes Research Nurses, Practitioners and Assistant Practitioners. You will develop, implement and deliver an innovative research training, development and sharing of best practice programme to grow the capacity and capability of the team, maximising staff retention and education. This will include a clear career progression structure for your staff, practitioners as well as nurses.&lt;/p&gt;\n&lt;p&gt;You will lead on the active integration of research into clinical services within the cardiovascular directorate, actively engaging in Divisional nursing initiatives to enhance communication and collaboration between clinical research staff and clinical staff. This will include offering research training and resources to clinical nurses and clinical areas, the development of a research secondment and/or split time programme, with you and your research team being embedded into clinical structures, aligned to research activity and PI/s of the area.&lt;/p&gt;\n&lt;p&gt;You will be competent to prepare and deliver reports on a variety of information, tailoring it as appropriate to different audiences. You’ll work together with your Divisional Research Manager to ensure value for NHS money and to plan and manage funding for your teams posts. You’ll be proficient in costing clinical trials when relevant to nursing/practitioner time and procedures, and in identifying funding opportunities for new posts - able to submit bids to secure funding with minimal support.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be an experienced research nurse, who will operate a visible and inspirational leadership model, with excellent influencing and interpersonal skills. The ability to manage, motivate and develop staff is crucial, recognising and responding to factors which impinge upon staff morale and delivery of research. The post holder will be politically astute and able to nurture and maintain close working relationships with PIs, engaging new clinicians and clinical areas in research and ensuring the appreciation of your team. The role is patient facing and includes working in Covid pathways; the ability to advise on and be proficient in clinical skills relevant to research practice - e.g. cannulation, venepuncture, ECG recording - are essential.&lt;/p&gt;\n&lt;p&gt;You will be capable of delivering your own nurse-led research (with support available from the Lead Nurse for Research for the Trust), as well as putting suitable support and strategies in place to encourage other nurses/practitioners to lead their own research, applying for fellowships and/or to become PI’s themselves.&lt;/p&gt;\n&lt;p&gt;Please note, the ability to work flexibly and across hospital sites is an essential aspect of this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants are encouraged to speak with the Team and Unit beforehand via contacting:&lt;/p&gt;\n&lt;p&gt;Donna Copeland, Divisional Research Manager for SCCS (donna.copeland@nhs.net).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Interview date: &lt;/strong&gt;&lt;/em&gt;17th November (pm)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Who should applicants contact for more information in regards to the post?&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Name: &lt;/strong&gt;&lt;/em&gt;Donna Copeland&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Email: &lt;/strong&gt;&lt;/em&gt;donna.copeland@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hammersmith Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 8a Lead Research Nurse and PRRU Manager, Cardiovascular", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243643", "validThrough": "2020-11-09T23:59:59+0000"}