{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on Experience"}}, "datePosted": "2020-10-14T13:01:40+0100", "description": "&lt;p&gt;You will be working within a dynamic and supportive team that have a long track record of delivering high quality care&lt;/p&gt;\n&lt;p&gt;We offer ample opportunities for our doctor’s professional development and opportunities .&lt;/p&gt;\n&lt;p&gt;You will be welcomed and supported in developing your skills and contributions to the borough, the wider organisation and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• Specialty Doctor in Psychiatrist required supporting the exciting and developing borough of Oldham in an inpatient setting with full team and a wonderfully refurbished ward setting. The Psychiatry Department is fully staffed covering a range of specialties including CAMHS, Working Age, ID, Older Age, full A&amp;E Mental Health Liaison services 24/7 covering the The Royal OIdham Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have opportunities to develop your management and leadership skills and to get involved in the development of services in the borough and beyond .&lt;/p&gt;\n&lt;p&gt;Please feel free to phone and discuss your specific needs directly with the Lead Consultant, Dr. Micheal Kurkar and we can support your specific needs and developmental goals&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Role Summary:&lt;/p&gt;\n&lt;p&gt;The Oldham Mental Health inpatient service is located at Parklands House on the Royal Oldham Hospital site. The purpose-built unit was opened in 1998, and has undergone an extensive refurbishment in 2018 and the estate is to a very high standard throughout. There are two 22-bedded admission wards for adult patients aged 18-64. The wards are single-sex and are the first such wards in the trust in keeping with developments and CQC requirements.&lt;/p&gt;\n&lt;p&gt;The SAS doctor in this post will be involved in for the care of all the patients on Aspen ward (except those already under the Intellectual Disability consultant, who then remains their RC through the admission). They will have the opportunity to lead ward rounds under consultant supervision.&lt;/p&gt;\n&lt;p&gt;Key Responsibilities of the Post:&lt;/p&gt;\n&lt;p&gt;The post holder’s responsibilities will include ensuring that patients are admitted in accordance with agreed gatekeeping procedures; that newly admitted patients receive a thorough and prompt assessment; that patients are reviewed regularly as needed, usually being seen face-to-face by the medical team ; that the MHA Code of Practice is followed appropriately; and that care and effective treatment is organised on a multidisciplinary basis, drawing in community-based staff and making safe arrangements for discharge and the transfer of information.&lt;/p&gt;\n&lt;p&gt;Inpatient services are integrated across the Pennine Care footprint, to help ensure that people in need of inpatient care are admitted without undue delay. This means that, like other wards in the Trust, this ward will provide care for a number of patients outside the Oldham area. Nevertheless, the majority of patients will be from Oldham.&lt;/p&gt;\n&lt;p&gt;The Trust has a commitment to progress towards all its premises becoming smoke-free areas. At present, patients are allowed to smoke in designated areas within and around Parklands House. As with similar wards in other hospitals, this presents predictable challenges for the staff team.&lt;/p&gt;\n&lt;p&gt;The ward has an establishment of 25 WTE staff, approximately half being registered mental health nurses. The ward manager is a band 7 nurse, supported by two Band 6 deputies. The ward also has a full-time housekeeper, a Recovery and Inclusion Worker, and a ward clerk. A team of five staff, including two occupational therapists, organises a programme of therapeutic group activities for both admission wards, including sessions for relaxation, anxiety management, education about medication and physical health, cooking, art, social events and community meetings. Nursing and medical staff may also contribute to this programme. There are a gym and a laundry shared between the two admission wards.&lt;/p&gt;\n&lt;p&gt;The wards at Oldham are able when appropriate to refer patients to the Trust’s Psychiatric Intensive Care Unit based at Stepping Hill Hospital in Stockport. There are also well established pathways of referral to low secure rehabilitation services for patients with relevant needs.&lt;/p&gt;\n&lt;p&gt;The Oldham Mental Health service has one dedicated pharmacist, supported by a pharmacy assistant, and they work closely with medical staff to ensure good practice in prescribing.&lt;/p&gt;\n&lt;p&gt;The ward receives approximately 200 admissions a year. Around half the patients on the ward at any one time are subject to detention under the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;The ward has a locked door and an airlock. Accordingly, explicit arrangements are in place to safeguard the rights of voluntary patients&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Micheal KurkarJob titleClinical DirectorEmail addressmicheal.kurkar1@nhs.netTelephone number0161 716 2120&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aspen Ward, Royal Oldham Hospital, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Specialty Doctor in Psychiatry - Inpatient", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226371", "validThrough": "2020-11-11T23:59:59+0000"}