{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 to £43,772 pa"}}, "datePosted": "2020-10-28T10:52:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Practitioner Sonographer – Band 7 – Radiology – 37.5 hours per week – Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;By joining WSFT Ultrasound department you will benefit from an R&amp;R incentive in addition to a Band 7 salary.&lt;/p&gt;\n&lt;p&gt;We provide a comprehensive ultrasound service for inpatients and outpatients, including community settings. We pride ourselves on providing patient-centred care, in an organised environment where all staff are valued.&lt;/p&gt;\n&lt;p&gt;WSFT is committed to the training and development of staff in line with the evolving requirements of a busy ultrasound department and available opportunities.&lt;/p&gt;\n&lt;p&gt;Although primarily an obstetric and gynaecological role, consideration will be given to sonographers specialising in general medical and vascular ultrasound.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part-time hours and flexible working will be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For full details or an informal chat please contact:&lt;/p&gt;\n&lt;p&gt;Jane.marling@wsh.nhs.uk or Karen.freeman@wsh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel 01284 713259&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Advanced Practitioner Sonographer - Band 7 - Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246185", "validThrough": "2020-11-11T23:59:59+0000"}