{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-02T11:35:44+0000", "description": "&lt;p&gt;If you are looking for a change, a new challenge and career development…then we would love to hear from you, as this may be the opportunity you are looking for!&lt;/p&gt;\n&lt;p&gt;We currently have a part time vacancy for a Band 5 Staff Nurse working alongside a friendly and supportive nursing team at the East Bristol Intermediate Care Centre, St George and the South Bristol Rehab Centre in Knowle. This team works to support people who are unable to safely return directly home following a hospital stay or who are struggling in their own homes and require a short period of intensive inpatient rehabilitation to help them return safely home.&lt;/p&gt;\n&lt;p&gt;You will work as a key member of the community beds nursing team to assess, diagnose, plan and implement care for a group of identified service users and will provide and maintain a high standard of patient focussed care that ensures patient safety; dignity and respect are paramount to the care delivered. We actively promote a multi-disciplinary model on the unit, where nursing staff work closely with therapists, GPs and other Acute and Community colleagues to ensure the person we are supporting is kept at the centre of all decision making. This is an ideal opportunity to work within a supportive, friendly rehabilitation setting which is focussed on providing individualised care and which offers regular training.&lt;/p&gt;\n&lt;p&gt;We seek nurses with passion and commitment who hold patient experience and care at the heart of their nursing practice and share our organisational values. In return we offer you day to day support along with excellent training and a real commitment to your personal development plan with opportunities for continued professional development and study.&lt;/p&gt;\n&lt;p&gt;The skilled and established nursing team work across two bases, providing a 7 day a week nursing service with nursing hours spread between the hours of 08:00-18:00. Previous community nursing experience is desirable but nor essential.&lt;/p&gt;\n&lt;p&gt;If you would like to hear more abot thie exciting oppertunity please contact MandyNewport 01173534733/ 07826910296 or Fiona Deriszon 0117 9038392 or 077708288661&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS4 1TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4203", "longitude": "-2.5953"}}, "title": "Registered Nurse - Rehab Beds", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251842", "validThrough": "2020-11-15T23:59:59+0000"}