{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 -  £37,890 per annum plus outer London HCA"}}, "datePosted": "2020-10-28T14:16:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Enfield Therapies Service, Personality Disorder Stream &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Specialist Practitioner Band 6 Full time 37.5hrs &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;span&gt;&lt;span&gt;An exciting and rarely available opportunity has arisen for an enthusiastic and motivated Mental Health Nurse, Occupational Therapist, Psychological Therapist, Psychologist or Social Worker to join our team.   We are looking for candidates who are highly skilled with relevant experience to work as a  clinician in the Personality Disorder Stream within the Enfield Therapies Service   &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will have experience with and an interest in working with patients who have Personality Disorder s/he will be based at Chase Farm Hospital, Chase Building.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;ETS provides a range of psychological therapies to patients who have non psychotic presentations.  The Team is divided into three streams, Complex PTSD, Personality Disorder and the  psychological  and a single intervention service which offers a range of standalone psychological interventions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will join our PD Treatment Stream.  The PD stream offers various modalities of treatment. Mentalization, DBT and Structured Clinical management as well as a small provision for patient who require care coordination.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mentalization-based treatment (MBT) is a modified form of psychodynamic psychotherapy, adapted and developed to work effectively with the problems encountered by people diagnosed with borderline personality disorder.   In house training will be available in this model. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Structured Clinical Management (SCM) is a structured time-limited evidence based  treatment  for patients diagnosed with Borderline Personality Disorder.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Personality Disorder stream has been developed from the model at the Halliwick Personality Disorder Service and was the birth place of MBT where the treatment was developed and manualised by Peter Fonagy and Anthony Bateman.   &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is an emphasis on team based multi-disciplinary decision making in the treatment planning which lends itself to creating a supportive environment for staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will be expected to hold a caseload of patients within the stream who may be part of the MBT programme or Structured Clinical Management,  on CPA and as a Key Clinician, meaning they are the point of contact for the patient and other professionals involved in the patient’s care.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Within the PDS the successful applicant will have a broad range of duties; including contributing to the provision of both group and individual psychological work.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A psychological focus is central to the treatment programmes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Supervision is central to the work we do. You will receive both Group and individual supervision. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service as a whole aims to promote excellence and innovation in the provision of care to patients with challenging and complex presentations.   There is an emphasis on CPD and this is actively supported and encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the national transformation programme within the NHS, BEH Community mental health services are currently starting to undergo a re- organisation. We do not foresee this process greatly affecting the posts in the Personality Disorder Stream.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;strong&gt;&lt;span&gt;All candidates must hold a live registration with a professional body allied to their Core Profession.&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For further information please contact:, &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Karen O’Shaughnessy PDS Lead on 020 8702 5522/5020 or email   karen.oshaughnessy@nhs.net&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Simon Brunert Team manager on 0208 702 6414 or email &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;S.Brunert@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;span&gt;Two references will be required, one from your current or most recent employer, the other from your previous employer. The referees should be from persons with management responsibility. If you have been unemployed for a period of four years or more, please give your last employer and one character referee of your choice (not members of your family). &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please be aware that your documents e.g. Passport/NI Card will be electronically scanned using Home Office accredited Verification System. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Closing date:  Thursday 26&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November 2020 &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Interview date:                &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chase Farm Hospital, Enfield", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Clinical/Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246955", "validThrough": "2020-11-26T23:59:59+0000"}