{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 bank holiday working is a part o"}}, "datePosted": "2020-11-03T13:31:04+0000", "description": "&lt;p&gt;&lt;em&gt;An excellent opportunity has arisen to join the Paediatric Dietetic Department at the highly recognised Oxford Children’s Hospital (John Radcliffe Hospital).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are looking for an enthusiastic Band 7 Paediatric Dietitian to work with our dynamic team to provide a highly specialist dietetic service to paediatric patients at the Oxford Children’s Hospital. You will be working with a busy, friendly and energetic team of 12 paediatric dietitians who are well thought of members of the children’s therapies team and continue to have close links with the adult dietetic department of 40 plus dietitians. We work alongside well-established paediatric specialist Multidisciplinary Teams contributing to the care of infants and children with varied clinical and complex conditions. These include intensive care, gastroenterology, surgery, oncology, diabetes, cystic fibrosis, neonates and allergy in both inpatient and outpatient settings.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post would suit a paediatric dietitian with strong leadership capabilities, wanting to further develop their skills in a paediatric hospital with a varied and challenging caseload. Experience or demonstrated knowledge in paediatric dietetics would include: nutritional support, food allergies, gastrointestinal disorders, children with complex needs and home enteral feeding. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You should be able to demonstrate the ability to work within a changing environment, commitment to team working, have good communication skills and provide evidence of ongoing professional development relevant to this post. Regular supervision and support will be provided. With guidance from the team lead you will be expected to support students, manage junior staff, and work alongside the other senior dietitians in supporting leadership roles within the department and lead in your clinical area. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For more information about this exciting opportunity, please contact Katheryn Hodgetts, Paediatric Dietetic Team Lead, on 01865-231234 or Anne Marie Frohock Advanced Paediatric Diabetes Dietitian on 01865 231227 / 07785927038.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&#39;Interviews planned for the week of the 30th November 2020, Skype/Zoom may be available to support current social distancing requirements. However depending on the first round we may need to run a second face to face interview. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaty HodgettsJob titleTeam Lead- Children&#39;s DieteticsEmail addresskatheryn.hodgetts@ouh.nhs.ukTelephone number01865 231234&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Children&#39;s Hospital, John Radcliffe., Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Children&#39;s Dietitian- Deputy Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254152", "validThrough": "2020-11-23T23:59:59+0000"}