{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £28,050 - £36,644 pa pro rata"}}, "datePosted": "2020-10-30T12:16:39+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for a permanent Band 6 position for an experienced band 5. This will be an ideal post for someone who is looking for career progression and ready to take on the role of a Band 6 wanting to progress their career but only able to work part time.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berrow ward is a 26 bedded joint speciality ward General Medical and Gastroenterology.&lt;/p&gt;\n&lt;p&gt;It will be a great opportunity for those looking to be part of the team.&lt;/p&gt;\n&lt;p&gt;The successful candidate can expect to have the opportunity for career development. They will be given support and training to develop leadership and management skills and will be responsible for looking after a small group of staff.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be proactive in improving patient safety and driving standards of care forward.&lt;/p&gt;\n&lt;p&gt;Have excellent nursing skills and be proactive in the care and management they provide to their patients.&lt;/p&gt;\n&lt;p&gt;Your main role as a Band 6 is to co-ordinate the daily ward routine, which will involve admissions and discharges from the 26 bedded ward and maintaining the safety of patients throughout this process. This is a challenging but rewarding role and the applicant must have excellent communication and problem solving skills. Have the ability to adapt to changing situations when under pressure.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be flexible, a good team worker, bring with them a passion to excel and ensure high standards are adhered to and exceeded, to be innovative within a team environment and thrive on a fast paced ward.&lt;/p&gt;\n&lt;p&gt;You will also be required to deputise in the absence of the Senior Sister. You will also be responsible for the support of junior nurses in the team.&lt;/p&gt;\n&lt;p&gt;There are opportunities to develop your assessment skills as the Trust supports a wide range of training opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helena Chase, Senior Sister, helena.chase@nhs.net, 01934 636363 Ext 3130&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston-super-Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Junior Sister - Berrow Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250125", "validThrough": "2020-11-13T23:59:59+0000"}