{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43000", "minValue": "37000", "unitText": "YEAR", "value": "£37,000 - £43,000 (DOE)"}}, "datePosted": "2020-11-05T09:58:30+0000", "description": "&lt;ul&gt;\n&lt;li&gt;Are you an Independent Prescribing Pharmacist, experienced in Primary Care?&lt;/li&gt;\n&lt;li&gt;Do you have a good knowledge of QOF, QIPPP, Auditing, NICE?&lt;/li&gt;\n&lt;li&gt;Do you have excellent IT skills and communication skills?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are thinking yes, then DMC Healthcare would love to hear from you. DMC Healthcare has been a trusted provider of services to the NHS for over 50 years.&lt;/p&gt;\n&lt;p&gt;An excellent opportunity to join DMC Healthcare team of Pharmacist in primary care environment. As Independent Prescribing Pharmacist you will be working within a multi-disciplinary team under the supervision of a GP Clinical Lead who will be responsible for your personal development within this role. You will have a pivotal role, as the pharmacy member within the primary care team contributing to the quality of care and operational efficiencies of a large, modern, GP training practice, with a passion to deliver excellent service.&lt;/p&gt;\n&lt;p&gt;DMC Healthcare continue to see steady growth in the services we provide and we now have an opportunity for Prescribing Pharmacist to join our modern practice Albion Place Medical Practice in Maidstone, Kent.&lt;/p&gt;\n&lt;p&gt;You need to be a highly motivated individual, passionate about patient care, with excellent IT skills and an ability to communicate effectively with clinicians, patients and other members of the primary care team.&lt;/p&gt;\n&lt;p&gt;An understanding of primary care is desirable and you will be required to maintain a good knowledge of QOF, QIPPP, Auditing, NICE guidelines and other developments in relation to the Primary Medical Services Contract.&lt;/p&gt;\n&lt;p&gt;For the successful applicant; it is a stepping stone into a future career with a rapidly growing and diverse healthcare organisation where pharmacists are valued and where ambition is rewarded&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in this position then we would love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone, Kent", "postalCode": "ME14 5DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2742", "longitude": ".529529"}}, "title": "Prescribing Pharmacist - Albion Place", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257130", "validThrough": "2020-11-19T23:59:59+0000"}