{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-10-29T14:15:34+0000", "description": "&lt;p&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/p&gt;\n&lt;p&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/p&gt;\n&lt;p&gt;• Integrated pathways across the health and care system&lt;br /&gt;• Innovative new roles&lt;br /&gt;• Training to up skill our workforce&lt;/p&gt;\n&lt;p&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/p&gt;\n&lt;p&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/p&gt;\n&lt;p&gt;Two posts one at UHND one at DMH.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to recruit to a new band 7 role in Elderly Care and Rehabilitation at both UHND and DMH. The successful applicant will join the inpatient physiotherapy team to support the service clinically and developmentally, covering elderly care, ortho-geriatrics and medical rehabilitation. The successful applicant will work within this strong team and provide therapy within a 7 day service and overnight respiratory on call service to clients within the acute hospital setting.&lt;/p&gt;\n&lt;p&gt;The clinical work consists of covering across the acute elderly care ward, trauma orthopaedic ward and acute medical wards at UHND/DMH including a caseload of frail elderly patients with cardio-respiratory, neurological, mental health and orthopaedic issues. The post holder will work alongside the two inpatient team leads as part of the inpatient physiotherapy team, supporting band 6, band 5 and assistants.&lt;/p&gt;\n&lt;p&gt;The successful applicant will utilise their outstanding organisation and communication skills in order to support with the rehabilitation and discharge planning from the acute setting into the sub-acute and community settings whilst achieving outstanding physiotherapy outcomes.&lt;/p&gt;\n&lt;p&gt;The role requires a dynamic and innovative individual who can apply their clinical expertise to drive the inpatient physiotherapy service forward in this new role in elderly care and rehabilitation. The post holder will work with the elderly care clinicians in order to provide an exemplary service to frail elderly patients. The post holder will be expected to attend specialist interest group meetings for example falls or palliative care.&lt;/p&gt;\n&lt;p&gt;The team are very committed to providing an in-service training programme which the post holder will encouraged to take an active part in developing, leading and benefitting from sessions towards maintaining CPD. The team are expected to cross cover colleagues when required across sites. The trust has a robust in house training programme and the post holder will also have opportunities to participate in external training as appropriate.&lt;/p&gt;\n&lt;p&gt;Please contact Jessica Mansfield for more information regarding the post at UHND, Jessica.mansfield@nhs.net.&lt;/p&gt;\n&lt;p&gt;Please contact Kelly Huitson for more information regarding the post at DMH, khuitson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Durham x 1, Darlington Memorial Hospital x 1", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Band 7 Specialist Physiotherapist in Elderly Care and Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248654", "validThrough": "2020-11-12T23:59:59+0000"}