{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive"}}, "datePosted": "2020-11-02T12:31:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert Wording:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is part of the Compliance &amp; Risk Team within the Trust. The Compliance &amp; Risk Facilitator will provide comprehensive administrative support to the Team, with particular emphases as described below:&lt;/p&gt;\n&lt;p&gt;The CQC Compliance processes are currently being developed and the Compliance &amp; Risk Team Facilitator will be expected to undertake administrative duties related to these as and when they are implemented. It is expected that they will include preparation of audit documentation in line with an audit programme; assisting completion of entries into the CQC database and maintenance of the Trust CQC Evidence files.&lt;/p&gt;\n&lt;p&gt;The postholder will be part of the Trust Compliance &amp; Risk Tam and will take part in internal audits/reviews against requirements and standards with which the Trust needs to comply.&lt;/p&gt;\n&lt;p&gt;The postholder will provide cover for the Central Alerting System when required, including: acknowledgement of received Alerts in line with the given deadlines: distribution to the relevant staff within the Trust; receiving and evaluating responses and updating of the DoH CAS website. The postholder will also facilitate Task &amp; Finish Groups for Patient Safety Alerts, when requested.&lt;/p&gt;\n&lt;p&gt;The postholder will also be an internal ISO auditor and have knowledge of ISO9001 or be prepared to undertake training.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Debra Linford debra.linford@nhs.net telephone 01708 503185 or ext 3537&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Advisor, on 01708 435000 ext. 3861.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Compliance, Risk &amp; Clinical Audit, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 5 Compliance Team Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252064", "validThrough": "2020-11-16T23:59:59+0000"}