{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata"}}, "datePosted": "2020-11-03T10:56:23+0000", "description": "&lt;p&gt;NAViGO Health and Social Care CIC provide health and social care services to a population of 158,000. We are a progressive and ambitious organisation that aims to support those living with a mental health illness, their carers and families in the simplest and most effective ways. We are different because we know working with the same methods doesn’t work forever; and we will continue to challenge the way we do things to create the best services that are centred on the people who use them.&lt;/p&gt;\n&lt;p&gt;Working together across Humber, Coast and Vale&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The PPE Stores Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;27.5 hours flexible across Monday to Friday as per buisness requirements&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In March 2020, as part of the COVID 19 pandemic response, NAViGO stepped up to help colleagues in the local community who were finding it increasingly difficult to access PPE for their staff. The organisation formed a Mutual Aid facility, using a NAViGO team to come to the assistance of smaller organisations who were struggling. It is now time for our staff to resume their substantive roles meaning we are seeking to recruit a dedicated team of people to continue the PPE supply facility for the foreseeable future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The PPE Stores Assistant will be an integral part of this team handling PPE requirements both internally for NAViGO staff but also supplying product to the whole of the N E Lincolnshire health and social care community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will work alongside others to accurately pick and pack PPE equipment to fulfil pre-planned orders for the community and assist in actively ensuring all NAViGO staff have adequate PPE provision at all times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;PPE Stores Assistants will be supervised at all times but will be required to use initiative in the role and to handle limited face to face and telephone enquiries.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;MAIN DUTIES / RESPONSIBILITIES:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Handballing of PPE products on deliveries coming into the store and ensuring all stock is correctly placed once offloaded (training will be given initially after which post holder will be expected to carry out this role unaided)&lt;/li&gt;\n&lt;li&gt;Picking stock to be issued to both NAViGO and Community on request and in a timely manner against written orders prepared by the PPE Coordinators (training will be given initially after which post holder will be expected to carry out this role unaided)&lt;/li&gt;\n&lt;li&gt;Preparing stock orders ready for delivery or collection both internally and via community delivery driver as directed by the PPE Coordinators (training will be given initially after which post holder will be expected to carry out this role unaided)&lt;/li&gt;\n&lt;li&gt;Ensure the return of stock items that are not required are returned to the correct place in the store and that returns are logged by the PPE Coordinators (training will be given initially after which post holder will be expected to carry out this role unaided)&lt;/li&gt;\n&lt;li&gt;Ensuring, as guided by the PPE Coordinators, that expired, discontinued, quarantined and wasted stock is not selected when picking orders&lt;/li&gt;\n&lt;li&gt;Liaise with NAViGO drivers to push out daily, weekend and emergency orders across NAViGO sites&lt;/li&gt;\n&lt;li&gt;Assist in carrying out regular checks on stock to ensure levels are not running low&lt;/li&gt;\n&lt;li&gt;Liaise with NAViGO staff and community organisations (in the absence of the PPE Coordinators) and handle PPE queries taking/conveying messages where appropriate&lt;/li&gt;\n&lt;li&gt;Where required, provide a high level of customer service; communicating with the general public, colleagues and external agencies at all levels both face to face and on the telephone (in the absence of the PPE Coordinator)&lt;/li&gt;\n&lt;li&gt;Where required, deliver stock to other sites when regular drivers are not available&lt;/li&gt;\n&lt;li&gt;Able to use Excel to produce end of day stock control figures (only for cover when PPE Coordinator is on leave)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see Job Description for further details.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will take place on the 12th &amp; 13th of November.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates must be available for an immidate start (subject to pre-employment checks).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All positions are subject to the receipt of satisfactory references and medical clearance. Evidence of valid professional registration and appropriate DBS clearances will also be required where relevant. All posts will also be subject to successful completion of a 12 week probationary period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that all new employees joining NAViGO will be able to contribute to the NHS pension.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is classed as exempted for the purposes of the Rehabilitation of Offenders Act 1974, even those convictions that are classed as spent must be declared on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NAViGO CIC takes its responsibility for the Safeguarding of Children &amp; Adults at risk seriously. Every member of staff must comply with the NAViGO Safeguarding policies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will ensure that all applicants are contacted within 2 weeks of the closing date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Navigo will keep details of unsuccessful applicants on file for a period of 6 months. Where further positions arise which we believe may be suitable we may contact those applicants with information and to advise of the further vacancy, should they wish to apply. Application at this subsequent stage/position would be voluntary and via open competition. Applicants may opt out of this by informing the recruitment team via NHS Jobs if they do not wish for details to be retained for this purpose.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NAViGO CiC Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 0QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5631", "longitude": "-.088785"}}, "title": "PPE Store Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253571", "validThrough": "2020-11-09T23:59:59+0000"}