{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-02T08:16:32+0000", "description": "&lt;p&gt;Founded in October 2006, NHS Informatics Merseyside is an established NHS healthcare technology organisation based in Merseyside, North West England.&lt;/p&gt;\n&lt;p&gt;Our role is to ensure technology and innovation is used effectively as an enabler to better health and care – helping to drive efficiency and support new models of care through improved and more collaborative ways of working.&lt;/p&gt;\n&lt;p&gt;We are proud to be one of only two health care organisations globally to achieve 4 star certification from the Service Desk Institute. (SDI) SDI’s Service Desk Certification programme is the only industry, standard based accreditation programme designed specifically to certify service desk quality.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to respond to and resolve incidents and service requests within SLA defined timescales and will provide 1st / 2nd line support as part of the Service Desk function. This role is highly visible, and requires a combination of IT technical skills, customer care, and business awareness - the Service desk being the single point of contact for all customer communications. The post holder will be required to respond to service desk phone calls, Live Chats and Self Service portal incidents, monitoring other routes to the service desk, record incidents following clearly defined procedures, and resolve the majority of incidents at first point of contact. The role encompasses reactive and pro-active elements of Incident management as defined in the IM Incident Management process.&lt;/p&gt;\n&lt;p&gt;1 x Full Time position advertised working a shift pattern of 5 days on and 4 days off including weekends 8am - 8pm on week days and 8am - 2pm on weekends&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 10th November.&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 16th &amp; 17th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBev Bromilow or Sarah Di CaprioJob titleIT Service Desk Manager and IT Service Desk Team LeaderEmail addressbev.bromilow@imerseyside.nhs.ukTelephone numberBev Bromilow on 0151 296 7055 or Sarah Di Caprio on 0151 296 7596Additional contact information&lt;/p&gt;\n&lt;p&gt;Bev Bromilow on 0151 296 7055 or Sarah Di Caprio on 0151 296 7596&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Saturn House, Liverpool", "postalCode": "L34 9GJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4635", "longitude": "-2.87144"}}, "title": "IT Service Desk Engineer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251303", "validThrough": "2020-11-09T23:59:59+0000"}