{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82.096 - £110,683 per annum"}}, "datePosted": "2020-11-06T14:16:38+0000", "description": "&lt;p&gt;Locum Consultant Emergency Medicine&lt;/p&gt;\n&lt;p&gt;East Sussex Healthcare NHS Trust requires a Locum Consultant in Emergency Medicine based at Conquest Hospital.&lt;/p&gt;\n&lt;p&gt;East Sussex Healthcare NHS Trust operates two 24 level 1 emergency departments at Eastbourne DGH and Conquest Hospital in Hastings.&lt;/p&gt;\n&lt;p&gt;Forming part of the Sussex Trauma Network the Conquest is a designated Trauma Unit and Eastbourne a Local Emergency Hospital. The Conquest receives approximately 400 TARN eligible cases per year and activates around 30 trauma calls per month.&lt;/p&gt;\n&lt;p&gt;Conquest Hospital is in the South East corner of the UK amidst a country and beachside setting with easy access to London, Gatwick and Brighton. On site accommodation can be arranged (subject to availability)&lt;/p&gt;\n&lt;p&gt;Conquest Emergency Department saw around 63,000 patients last year(18/19). It currently has 4 full time consultants,7 specialty doctors and 1 associate specialist together with 3 FY2s, 2 ACCS ST1/CT1s, 3 GP ST1s, 2 ST4-ST6 trainees ,1 ST3 trainee and 4 “trust grade” posts.&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of consultant in emergency medicine. The appointee will join the existing consultants to complete a team of five at each emergency department. Duties will be based at Conquest but may on occasion work cross-site at Eastbourne with 1 in 6 weekends and 1 in 5 weekdays on call. It is anticipated that when all posts are filled the timetabled PAs of all consultants will allow shop floor cover for the following hours:-&lt;/p&gt;\n&lt;p&gt;A rotation between Monday-Fri shop floor cover 0800-1700 (or 1900 if on call)&lt;/p&gt;\n&lt;p&gt;Sat-Sun 0800-1600 shop floor and 1in 6 on call.&lt;/p&gt;\n&lt;p&gt;Candidates must have full GMC registration, be on the Specialist Register or be within 6 months of gaining CCT at the time of the interview.&lt;/p&gt;\n&lt;p&gt;Interview date to be confirmed&lt;/p&gt;\n&lt;p&gt;10 reasons why you should live and work in Sussex&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt; Its natural beauty&lt;/strong&gt; &lt;br /&gt;Sussex has some fantastic natural features such as the Seven Sisters National Park, and many areas of outstanding natural beauty that include the medieval heathland and forests of the High Weald.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Its beaches and harbours&lt;/strong&gt; &lt;br /&gt;Hastings still boasts the largest beach-launched fishing fleet in Europe, as well as the UK’s steepest funicular. Meanwhile, Eastbourne offers a traditional Victorian seafront combined with the Sovereign Harbour marina.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt; Places to stay&lt;/strong&gt; &lt;br /&gt;There’s a rich array of accommodation options, ranging from the five star Grand Hotel on Eastbourne seafront to quaint B&amp;Bs set amid beautiful Sussex countryside.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Its weather&lt;/strong&gt; &lt;br /&gt;Often referred to as ‘The Sunshine Coast’, both Eastbourne and Hastings regularly top the UK list for locations that enjoy the most hours of sunshine.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Birthplace of English History&lt;/strong&gt; &lt;br /&gt;The legacy of the Battle of Hastings still colours the entire town and the remains of William the Conqueror’s first English castle still stand today.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt; Its travel connections&lt;/strong&gt; &lt;br /&gt;London is just over two hours away by car or train, whilst Gatwick Airport, Eurostar and regular ferry crossings allow easy access to mainland Europe.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Its White Cliffs coastline&lt;/strong&gt; &lt;br /&gt;The stunning and world famous White Cliff coastline includes the iconic Beachy Head and The Seven Sisters, as well as Seaford Head and Hope Gap.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt; Its places of cultural interest&lt;/strong&gt; &lt;br /&gt;East Sussex offers a rich array of culture, with art galleries such as Towner Gallery in Eastbourne and Jerwood Gallery in Hastings and an array of theatre and entertainment venues such as the De La Warr Pavillion in Bexhill, Congress &amp; Deveonshire Park Theatres in Eastbourne and the White Rock Theatre in Hastings.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Its open spaces&lt;/strong&gt; &lt;br /&gt;Explore the beautiful South Downs Way, 1066 Country Walk, The Weald Way and the picturesque villages of Alfriston, Lewes, Rye, Hartfield and Burwash.&lt;/li&gt;\n&lt;li&gt;&lt;br /&gt;&lt;strong&gt; Its festivals&lt;/strong&gt; &lt;br /&gt;To name but a few, these include Glyndbourne Opera Festival, the Lewes Bonfire Celebrations, Hastings Pirate Day and Eastbourne’s Airbourne international air show.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Paul Cornelius, , Mr Ghassan Youssef or Mr Mohammed Alam on 0300 131 4500 Ext 735152.&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Nicola Anslow - Head of capacity and Flow - 07540 832245&lt;/p&gt;\n&lt;p&gt;nicola.anslow@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest Hospital/Eastbourne District General Hospital, St. Leonards-On-Sea/Eastbourne", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "Locum Consultant - Emergency Medicine- Conquest Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260104", "validThrough": "2020-11-22T23:59:59+0000"}