{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 - £29,000 per annum"}}, "datePosted": "2020-11-02T14:46:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced Data Analyst looking to work for an organisation that is driven by quality and innovation? Then we could have just the role for you. We have an exciting opportunity to join the team at Practice Plus Group Hospital, Shepton Mallet.&lt;/p&gt;\n&lt;p&gt;Our focus at all times is on ensuring that our patients receive high quality treatment quickly, in clean and comfortable surroundings. The hospital has been rated Outstanding by the CQC, putting it at the very top of the regulator’s quality ratings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to Senior Finance Manager, Kat, you will develop and provide and information service to both internal and external stakeholders. This will mean ensuring the effective collation, recording and monitoring of data quality as well as assisting in the development of management information and reporting systems to support managers in the delivery of operational services.&lt;/p&gt;\n&lt;p&gt;You will have recent and relevant experience in a similar role, interpreting and analysing data and monitoring the level of data quality. Your excellent computer, analytical and numeric skills are key in this role as well as your ability to work under pressure and manage your own workload.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too.We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghvi in our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Data Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252488", "validThrough": "2020-11-27T23:59:59+0000"}