{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-12T10:51:58+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Relocation package up to £8K&lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are searching for an exceptional consultant psychiatrist to provide community psychiatric services to adults with intellectual disabilities living within the Teignbridge (South Devon), Torbay, South Hams &amp; West Devon.&lt;/p&gt;\n&lt;p&gt;You will be a professionally qualified clinician with extensive experience of delivering community-based mental healthcare service to adults with intellectual disabilities. You will have a commitment to collaborative working and be able to confidently interact with other health and social care professionals and agencies.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the effective day-to-day provision of clinical guidance, leading on the coordination of care and treatment. Our focus is on preventing out of county placement, placement breakdown, in-patient admissions and, if unavoidable, reducing the length of admission. You will be expected to embody these principles, delivering recovery-focused care that has the patient at its centre – promoting independence.&lt;/p&gt;\n&lt;p&gt;The post holder will be working with 2 community teams (Intensive Assessment &amp; Treatment Teams – IATT) with one base at Estuary House, Newton Abbot a vibrant market  town and civil parish and the other at Follaton House, Totnes (West Devon, IATT) a historic market town.  Following agreement the post holder can be based at either of these locations. The post-holder will be fully-embedded in the Learning Disability Intensive Assessment and Treatment Team (IATT), in line with the ‘New ways of working approach’.&lt;/p&gt;\n&lt;p&gt;The IATT service is established and highly effective. We are searching for a consultant with vision, who can help us to develop the service we provide – delivering high-quality, patient centred care for everyone who needs it.&lt;/p&gt;\n&lt;p&gt;We value your professional development, giving you the chance to grow in the role though teaching opportunities, funded CPD and academic support.&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;You will be an experienced mental health professional with a detailed and current knowledge of NHS, local government and national strategies and policies. Registered with the GMC, you will be eligible to hold Approved Clinician status at appointment.&lt;/p&gt;\n&lt;p&gt;You will have recent experience of working in a community intellectual disability team, with a demonstrable history of delivering effective care and a proven commitment to improving care quality. We welcome applications from those who can demonstrate a special interest in intellectual disability psychiatry.&lt;/p&gt;\n&lt;p&gt;An established professional, you will have the skills to work with a large, multi-disciplinary team – explaining your decisions and views clearly. Embedded within the IATT team, you will develop relationships with colleagues inside and outside of the trust, working together to ensure people are able to live productive and rewarding lives in the community.&lt;/p&gt;\n&lt;p&gt;You will be able to understand – and apply – the most up-to-date research, interpreting it for colleagues.  Personally, you will be a confident communicator, able to support and inspire colleagues at all levels. You will enjoy the challenge of undergraduate teaching, lecturing and clinical supervision, inspiring the next generation of mental health professionals.&lt;/p&gt;\n&lt;p&gt;At Devon Partnership Trust we are committed to continual improvement and welcome applications from those who can demonstrate introducing new ideas into service delivery and a track record of implementing new initiatives.&lt;/p&gt;\n&lt;p&gt;Personally you will be committed to our core principles of recovery-based care that puts the person at the centre. This includes providing care that supports people to maintain their independence and retain their dignity – delivered by people who care.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;The Intensive Assessment and Treatment Teams in Devon offer secondary care interventions to people with an Intellectual Disability referred to our service by supporting people with a learning disability who are experiencing or causing in others high levels of distress.&lt;/p&gt;\n&lt;p&gt; IATT’s are not a crisis intervention service, mental health, physical or social care crisis should be dealt with through universal services. However IATT will support and advise those services offering guidance where appropriate.&lt;/p&gt;\n&lt;p&gt;Referrals to the teams are received directly from service users, primary/secondary health care services, families, care providers and Social care. The teams are responsible for triaging referrals in the respective locality; sign posting patients to adequate services, undertaking assessments and determining care pathway within our Secondary Specialist Service.&lt;/p&gt;\n&lt;p&gt;You will be expected to take part in on-call rota, providing robust cross-cover arrangements. Our consultants are supported by a dedicated full-time medical staffing department.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive.&lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;32 days of annual leave per year plus bank holidays, increasing to 34 days after 7 years, so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Living here - Great place to work. Great place to live.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "follaton House, Totnes", "postalCode": "TQ9 5NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4315", "longitude": "-3.70916"}}, "title": "Consultant Psychiatrist in Intellectual Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221965", "validThrough": "2020-11-29T23:59:59+0000"}