{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "Up to £33,000 DOE"}}, "datePosted": "2020-11-04T16:40:22+0000", "description": "&lt;h1&gt;&lt;strong&gt;I treat more than just symptoms&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Situated in Exeter, HMP YOI Exeter is an adult/young offenders institution accepting males ages 18 and over; with an operational capacity of 550+. It accepts all adult and young offenders committed to prison by the courts from Cornwall, Devon, Dorset &amp; West Somerset.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP Exeter we’re looking for a Substance Misuse Nurse to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What do we need from you so you can do the job?&lt;/h1&gt;\n&lt;p&gt;As a Substance Misuse Nurse you will work as part of a multi-disciplinary team, whilst being a support and resource to less experienced members of staff. You must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users. You will work with individuals, on a 1-1 basis, providing advice and information. You will support in group work delivery and liaise with prescribers and Recovery Practitioners on clinical interventions. You will occasionally be required to support dispensing. You must have an understanding and commitment to recovery and a person centred approach. This is an exciting role to support and motivate individuals to take control of their lives and to make changes to overcome dependence on substances and move onto a life free of offending.&lt;/p&gt;\n&lt;p&gt;With proven experience of working with Substance Misusers and sound clinical substance misuse knowledge; you’ll have an awareness of health issues relating to substance misuse and ideally hold RCGP 1 in Substance Misuse / RCGP 2 in Substance Misuse – these are desirable but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Receive an annual salary of up to £33,000 depending on experience.&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Exeter if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Additional Information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a full-time role, working 37.5 hours per week on a 24/7 rota basis. The salary for this role is up to £33,000 FTE per annum - dependent on experience. We also welcome part-time and bank applications.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX4 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.728", "longitude": "-3.53224"}}, "title": "Substance Misuse Nurse - HMP Exeter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256679", "validThrough": "2020-11-18T23:59:59+0000"}