{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,615 + 5% HCA"}}, "datePosted": "2020-10-29T15:44:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Dorking Hospital Inpatients&lt;br /&gt;&lt;br /&gt;Registered Staff Nurse - Band 5 - Full time, 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a partnership between the three GP Federations, community trust and acute trust, Surrey Downs Health and Care is delivering true transformational change for adult community services across Surrey Downs to the benefit of patients and the local healthcare system. Our delivery model is formed around a shared vision and innovative use of the wealth and diversity of both the clinical and managerial experience that the partnership brings and as such it will provide a truly holistic, person-centred service that no one partner could provide on its own.&lt;/p&gt;\n&lt;p&gt;The model focusses on care being provided through distributed clinical leadership using Primary Care Networks (networks of GP practices working together with combined practice populations of around 50,000); integrated community bedded services and specialist services with the development of pathways into and out of the acute trust.&lt;/p&gt;\n&lt;p&gt;Registered Staff Nurse - Band 5 - Full time, 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently recruiting dedicated and motivated registered and unregistered bank nurses to our Adult Services inpatient rehabilitation team at Dorking Hospital. Ranmore Ward is a 28 bedded ward providing physical rehabilitation to the local population. The ward has been recently refurbished to a high standard and within dementia friendly guidelines. Individuals will be expected to deliver and maintain a high standard of clinical and professional Nursing Care; and to assist in the delivery of all aspects of individualised patient care.&lt;/p&gt;\n&lt;p&gt;Do you want:&lt;/p&gt;\n&lt;p&gt;• To be an integral member of a dedicated team&lt;/p&gt;\n&lt;p&gt;• To join a forward thinking, innovative organisation which puts its patients first&lt;/p&gt;\n&lt;p&gt;• To contribute to the provision of high quality care within your local community.&lt;/p&gt;\n&lt;p&gt;We can offer flexible working, attractive salaries, development opportunities and much, much more.&lt;/p&gt;\n&lt;p&gt;Early (0730 to 1530), Late (1230 to 2030), Night (2000 to 0800) and Long Day (0730 to 2030) shifts are available however there is some flexibility with timings.&lt;/p&gt;\n&lt;p&gt;Dorking Hospital has free onsite parking.&lt;/p&gt;\n&lt;p&gt;While this post remains within CSH, the post will be seconded to TBC. This will not impact on any of your terms of employment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking Community Hospital", "postalCode": "RH4 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2259", "longitude": "-.332936"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248906", "validThrough": "2020-11-12T23:59:59+0000"}