{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata for part time"}}, "datePosted": "2020-11-03T10:16:36+0000", "description": "&lt;p&gt;Sheffield Teaching Hospitals are commencing the transition to the latest, innovative PACS Enterprise Imaging software technology, EI 8.1 to enable the provision of a single, common imaging environment across the Trust, with improved efficiencies and overall user experience.&lt;/p&gt;\n&lt;p&gt;An exciting and challenging opportunity has arisen within the Medical Imaging and Medical Physics (MIMP) Directorate for the recruitment of an enthusiastic Radiographer, to work as part of a core PACS Project Team that is responsible for the delivery of this large scale change project.&lt;/p&gt;\n&lt;p&gt;Being at the forefront of this development, this unique opportunity will enable you to both apply your existing clinical and professional knowledge and skills, and develop a range of new skills. Working as a key Radiographer Business Change Lead within Radiology, you will effectively champion the transition of the service to the latest Enterprise Imaging software, and will actively lead on a range of activities to ensure the successful implementation of EI 8.1 that meets the needs of users across the Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will engage with a range of medical and non-medical stakeholders to facilitate the identification of new ways of working within the service, and be involved in the configuration and testing of the new software, including the resolution of any issues.&lt;/p&gt;\n&lt;p&gt;Essential to the role will be the generation of clinical EI 8.1 user guidance and the provision of clinical training and support to key users to the required standards pre and post go-live to assist a smooth transition into service, and the realisation of any key benefits.&lt;/p&gt;\n&lt;p&gt;The post holder will also support the radiographers as required, enabling them to participate in key PACS E1 8.1 activities whilst ensuring a continual smooth running of the service.&lt;/p&gt;\n&lt;p&gt;You will work between the hours of 8am and 5pm Monday-Friday but flexibility to work outside of normal working hours will be required, particularly during the pre and post go-live periods.&lt;/p&gt;\n&lt;p&gt;You will report into and be line managed by the PACS / RIS Delivery Manager. The position is offered up to a 9 month fixed-term basis.&lt;/p&gt;\n&lt;p&gt;Sheffield Teaching Hospitals Foundation Trust (STH) is one of the UK&#39;s biggest and most successful providers of hospital and community based healthcare, providing a comprehensive range of NHS services to Sheffield, South Yorkshire, Mid Yorkshire and North Derbyshire and specialist services to all parts of the UK. As one of three major trauma centres in Yorkshire and the Humber, STH operates across 5 hospitals and over 40 key community locations. The Trust has 16,500 staff providing services to over two million patients a year, including 150,000 accident and emergency attendances.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Directorate of Medical Imaging and Medical Physics &lt;/strong&gt;is one of the largest and most diverse Directorates within Sheffield Teaching Hospitals NHS Foundation Trust. The role of the Directorate is two-fold:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The provision of diagnostic and interventional imaging procedures.&lt;br /&gt;• The provision of high quality scientific and technical services in Medical Physics and Clinical Engineering.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Medical Imaging department provides a comprehensive range of diagnostic and interventional services to the full range of patients across all five Sheffield Teaching Hospitals sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and committed Radiographer to join the PACS Project Team, who has a keen interest in Business Change, and would enjoy the Trust wide challenge of transitioning to the latest PACS EI 8.1 technology. Applicants must have strong interpersonal and stakeholder management skills in order to promote and implement change of the highest quality across the Trust. You will also have sound analytical and problem solving skills, with the ability to work to tight deadlines using your own initiative.&lt;/p&gt;\n&lt;p&gt;This vacancy is advertised on a fixed term contract basis for the maximum period of 9 months. Where there is potential, the secondment/fixed term contract may finish early, or in the first instance, the secondment/fixed term contract may be extended due to the internal/external secondment of the substantive post holder. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts and secondments in relation to the substantive post holder&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFarouk NassimJob titlePACS ManagerEmail addressfarouk.nassim@nhs.netTelephone number0114 271 5369&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Radiographer Business Change Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253397", "validThrough": "2020-11-12T23:59:59+0000"}