{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-02T11:21:49+0000", "description": "&lt;p&gt;We’re looking for exceptional General Radiographer/MRI Radiographer with a passion for working to the highest standards.&lt;strong&gt; &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Whether you’re currently working in the NHS or in a private setting, now’s the time to apply to Nuffield Health if you want to be respected for your professionalism and grow your career.&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;About the role&lt;/strong&gt;&lt;br /&gt;This role requires excellent technical and people skills. You’ll need high levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail. You’ll also need a caring nature – to see each patient as an individual and carry out this role with understanding and empathy.&lt;br /&gt;&lt;br /&gt;Reporting to the Radiology Manager, you’ll deliver a high quality diagnostic imaging service for a very varied caseload. You’ll have opportunities to work with leading practitioners and to experience new practices, equipment and facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your key accountabilities will be to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Perform radiological procedures within the department, on the ward and in theatre, as required, in accordance with department protocols and Ionising Radiation (Medical Exposure) Regulations (IRMER)&lt;/li&gt;\n&lt;li&gt;Provide the clinical lead either within a specialist field or as a team leader&lt;/li&gt;\n&lt;li&gt;Review policies, procedures and protocols, and make recommendations regarding their content and application within area of responsibility&lt;/li&gt;\n&lt;li&gt;Provide supervision and development of more junior staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Nuffield Health, everything we do is dedicated to helping people to make the most of their lives. With a unique approach to complete health and wellbeing we bring together diagnosis and treatment with prevention and fitness services across one, groundbreaking network. And our not for profit status means that people - our patients and members, and our colleagues - always come first. Join us, and we’ll help you make the most of your time, both in and outside of work.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff Bay", "postalCode": "CF11 0SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4532", "longitude": "-3.18908"}}, "title": "MRI - Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251763", "validThrough": "2020-11-30T23:59:59+0000"}