{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 pa"}}, "datePosted": "2020-11-05T12:46:29+0000", "description": "&lt;p&gt;This is an exciting opportunity to provide overall leadership around the delivery of psychologically-informed care in our specialist palliative care services in NHFT. This newly-created post will work closely with senior clinical and managerial colleagues to develop psychological approaches at a number of different levels to support patients, families and staff across the specialist palliative care pathway. The post-holder will be responsible for the overall vision and leadership of psychological approaches across the pathway, as well as providing training, supervision and support for the delivery of psychological approaches and interventions.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced clinician and leader, ideally with specialist clinical experience in the field of palliative care or physical health. Equally important is the ability to work closely with multi-disciplinary colleagues to create a whole-team approach to psychological therapy which is delivered at a number of different levels of expertise and complexity. In addition, you would need to be able to work closely with commissioners to evidence the outcomes of a psychological approach as well as being able to deliver against key performance indicators. Highly developed interpersonal skills and ability to influence and negotiate successfully are essential. We are looking for an innovative and resilient clinical leader with evidenced training and supervision expertise who can operate with confidence and credibility to provide leadership around psychological approaches in this service.&lt;/p&gt;\n&lt;p&gt;The Specialist Palliative Care pathway includes two hospices (based in Northampton and Kettering) with a total of 25 beds, as well as community specialists, and a wellbeing group programme which operates on a day-patient basis. The team value psychological approaches highly, and are looking forward to working closely with the successful candidate to develop both clinical approaches and staff support systems for responding to the emotional demands of the clinical work.&lt;/p&gt;\n&lt;p&gt;Northamptonshire Healthcare Foundation NHS Trust was rated as “Outstanding” by CQC in 2018 and is a great place to work. We are proud of the Psychology provision within the Trust, and feedback has consistently been that we have a well-developed Psychology network in the Trust which offers a strong sense of professional identity, support and strategic influence. Psychology and psychological approaches are highly valued in the Trust, and Psychologists have the opportunity to shape clinical and organisational strategy as well as provide clinical services. We believe that supporting and involving our staff means that they enjoy their work more, and that our clinical services are better as a result.&lt;/p&gt;\n&lt;p&gt;The successful applicant(s) would receive professional support and be supervised by the Professional Head of Psychological Services.&lt;/p&gt;\n&lt;p&gt;There are a significant number of psychologists employed within the Trust working across different specialties and there are excellent opportunities for professional development through regular monthly psychology meetings and active peer supervision networks. The Trust enjoys good links with both Oxford and Leicester Doctoral training courses.&lt;/p&gt;\n&lt;p&gt;Northamptonshire is a pleasant area with a mix of rural and urban locations and is within easy distance of other key locations in the Midlands with excellent rail and road links.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard GlasspoolJob titleService Manager - Specialist Palliative CareEmail addressrichard.glasspool@nhft.nhs.ukTelephone number07795 110290Additional contact information&lt;/p&gt;\n&lt;p&gt;or Paul Flecknoe - Head of Psychological Therapies&lt;/p&gt;\n&lt;p&gt;paul.flecknoe@nhft.nhs.uk or 07795 445342&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cynthia Spencer Hospice, Northampton", "postalCode": "NN3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2651", "longitude": "-.863493"}}, "title": "Consultant Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257719", "validThrough": "2020-11-29T23:59:59+0000"}