{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31414", "minValue": "28411", "unitText": "YEAR", "value": "£28411.50- £31,414.50 per annum"}}, "datePosted": "2020-11-05T09:18:11+0000", "description": "&lt;p&gt;We are currently seeking &lt;strong&gt;&lt;strong&gt;Staff Nurses (RMN / RNLD) &lt;/strong&gt;&lt;/strong&gt;and would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt; NHS.  &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;You&#39;ll  join our &lt;strong&gt;&lt;strong&gt;Adult Mental Health and Intellectual Disabilities Low Secure Service,&lt;/strong&gt; &lt;/strong&gt;located in the village of &lt;strong&gt;&lt;strong&gt;Barham, &lt;/strong&gt;&lt;/strong&gt; 6 miles from &lt;strong&gt;Canterbury&lt;/strong&gt; and 10 miles from &lt;strong&gt;Dover&lt;/strong&gt;.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would like to welcome all nurses joining our permanent team with a ‘Welcome Bonus’ of £1000.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive organisational change for the better.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Hospital, Cedar House- near Canterbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital is a 40 bed &lt;strong&gt;low secure hospital&lt;/strong&gt; that provides specialist assessments, treatment and care for adults with intellectual disabilities, personality disorders or autistic spectrum disorders, including those with challenging behaviours and forensic histories.&lt;/p&gt;\n&lt;p&gt;We work collaboratively with our patients and their families or carers and provide person-centred care and support. We employ staff in a variety of different roles and provide ongoing support with comprehensive training, learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;The hospital is located in the village of&lt;strong&gt; Barham&lt;/strong&gt;, &lt;strong&gt;9 miles South East of Canterbury&lt;/strong&gt; and &lt;strong&gt;less than one mile from the A2. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Registered Nurses&lt;/strong&gt; play an instrumental role in the lives of individuals, supporting and encouraging them to achieve their goals and ambitions. When you join The Huntercombe Group as a&lt;strong&gt; Part Time Staff Nurses (RMN/RNLD)&lt;/strong&gt;, you will be part of a company that is understanding, strives towards excellence, is innovative, reliable and accessible and above all puts people first.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a&lt;strong&gt; Part Time Staff Nurse (RMN/RNLD)&lt;/strong&gt; working in our Adult Mental Health and Intellectual Disabilities Low Secure Service, your main duties will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Taking day to day leadership responsibility for the clinical and operational running of a ward within the service, ensuring care and treatment needs are met and task allocation is completed.&lt;/li&gt;\n&lt;li&gt;Contributing towards MDT working, by providing nursing knowledge and inputs to a range MDT processes&lt;/li&gt;\n&lt;li&gt;Acting as Primary Nurse to a small number of patients, taking overall responsibility for the nursing input they receive, through nursing assessments and care planning.&lt;/li&gt;\n&lt;li&gt;Providing written nursing reports for a range of statutory and clinical review processes such as CPA’s, MHA Hospital Managers Hearings and First Tier MHA Review Tribunals.&lt;/li&gt;\n&lt;li&gt;Contributing to risk assessment and management, to enable positive risk taking and care pathway planning.&lt;/li&gt;\n&lt;li&gt;Contributing towards a programme of on-going clinical improvement, through participation is CPD events, governance and audit arrangements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a &lt;strong&gt;Staff Nurse (RMN/RNLD)&lt;/strong&gt; you will:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold current NMC PIN registration and adhere to the NMC Codes of Conduct at all times&lt;/li&gt;\n&lt;li&gt;Have a person centred ethos, showing empathy and a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Have the ability to motivate, lead and supervise a team&lt;/li&gt;\n&lt;li&gt;Be able to demonstrate initiative and creativity&lt;/li&gt;\n&lt;li&gt;Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Have a desire to expand your professional development and support organisational change Have a legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A ‘Welcome Bonus’ of £1000.00&lt;/li&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A fantastic preceptorship programme&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;Reimbursement for NMC registration fees&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Support for BSc and MSc&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;li&gt;Relocation allowance of up to £8000.00&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click Apply now.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website&lt;/p&gt;\n&lt;p&gt;Posting Date: 5th November 2020&lt;/p&gt;\n&lt;p&gt;Closing Date: 7th December 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barham, Canterbury", "postalCode": "CT4 6PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2019", "longitude": "1.17601"}}, "title": "Staff Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257032", "validThrough": "2020-12-07T23:59:59+0000"}