{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-11-04T08:16:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a GPhC registered Pharmacy Technician to join our Pharmacy team in support of the Eastern Hepatitis Network. This new post offers an exciting opportunity to establish a role within our multi-disciplinary team, ensuring that patients with Hepatitis C get continued access to these valuable treatments, and that we continue to increase the number of patients accessing treatment for Hepatitis C.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Eastern Hepatitis Network was established in 2015 to oversee an increase in treatment of patients with Hepatitis C. We are an ambitious and successful network, and are expanding our team to support our on-going work to safely treat the largest possible number of patients each year, meeting the NHS England challenge to eliminate Hepatitis C in the UK by 2025.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will support the network MDT in increasing opportunities for patients to receive treatment and monitoring the success of treatments used to treat Hepatitis C in the region. This will include overseeing the safe and timely provision of medication to patients treated in our outpatient and outreach clinics at CUH, and supporting blood testing initiatives to ensure sustained viral response (SVR) is measured.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will also support in the logistics of ensuring treatment is continued successfully for patients transferring between care settings in the network, or between the 22 national networks.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be self-motivated and able to work autonomously to oversee these core aspects of treatment for Hepatitis C, with a focus on patient-centred care. You will also be able to work as part of a larger multidisciplinary team to highlight different ways of working to help increase the number of patients receiving treatment, or to improve the provision of our service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Pharmacy Department have a high level of commitment to staff development and we would support opportunities to develop or maintain core technical skills within the department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is offered as Fixed Term/Secondment for 12 months and will be based at Addenbrookes Hospital, Cambridge.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;/p&gt;\n&lt;p&gt;This vacancy will close on 22nd November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held week commencing 30th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul SelbyJob titleAdvanced Clinical PharmacistEmail addresspaul.selby@addenbrookes.nhs.ukTelephone number01223 217611&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital - Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Pharmacy Technician – Eastern Hepatitis Network", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255049", "validThrough": "2020-11-22T23:59:59+0000"}