{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (based on full time hours)"}}, "datePosted": "2020-11-03T12:30:24+0000", "description": "&lt;p&gt;&lt;span&gt;Job Title: Occupational Therapist/Physiotherapist&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Salary band: Band 5 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Hours: will consider both part time and full time applicants.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Location: South East Hampshire&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Would you like to play a vital part in making a difference to a patient’s quality of life, providing the care they need with the compassion they deserve?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you interested in being a part of an evolving service with opportunities for personal and service development?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Due to expansion of our team we are looking for Occupational Therapists and Physiotherapists to join the Rapid Therapy team.  Working collaboratively with the Integrated intermediate Care service to support the Discharge to assess model within our local health system.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work in a community setting to provide high quality therapy intervention and rehabilitation to a range of patients who have either been recently discharged from acute hospital or admission avoidance and support to those living in the community to maximise their independence and self-management in order to prevent hospital admissions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service covers the whole of the Portsmouth and Southeast Division.  Based in Fareham &amp; Gosport and Havant &amp; Waterlooville, There is opportunities for work in both locations, although there is an expectation to provide cross cover support across both sites as the service requires.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to work flexibly as a member of the community therapy service.  Currently the team work a 5 day working model, however with the development of the integrated intermediate care model, this could be expanded to include 7 day working and change in working hours in future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Ideally the successful applicant will possess excellent communication skills and be competent in liaising with the larger multidisciplinary team. You will have the opportunity to complete a period of induction, mentorship and take part in supervision of staff and students within the team.   &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To Support you within your role, Southern Health NHS Foundation Trust have an excellent learning and development program to help further develop your clinical and leadership skills.  There is a trust preceptorship programme in place for all new starters.  We are committed to supporting the development of your career and have a competency based approach to clinical training and development as well as a strong supervision and peer support process in place, which will ensure you are able to apply your newly developed skills in a safe and effective way.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applicants required to have professional registration and full drivers licence and access to a car.  (mileage allowance payable).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome informal visits and questions, for more information please contact Charlotte Land 07788418551.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;-&lt;strong&gt; all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO13 0GY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8231", "longitude": "-1.16234"}}, "title": "Band 5 Occupational Therapist/Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253974", "validThrough": "2020-11-24T23:59:59+0000"}