{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 Per Annum Inc"}}, "datePosted": "2020-11-05T16:16:15+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;In line with the national transformation programme for perinatal mental health, SLaM has been developing its community perinatal mental health service across all four boroughs. In each borough, a full multi-disciplinary team has been established, including psychiatrists, nurses, nursery nurses and OTs. In line with the NHS Long Term Plan, further expansion of perinatal mental health services is underway, with a specific focus on increasing access to a wider range psychological therapies to a wider group of women in the perinatal period.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are therefore excited to be seeking to recruit a Consultant Clinical / Counselling Psychologist to join the Community Perinatal Service serving the boroughs of Croydon, Lewisham, Lambeth and Southwark. The successful candidate will be responsible for leading, managing and planning the delivery of a highly specialist psychology and psychotherapy service embedded within the community perinatal mental health teams and for the systematic and effective provision of professional supervision as well as personally providing expert clinical input.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be part of a friendly and supportive psychological therapies service that offers excellent opportunities for research and continuing professional development. The post holder will contribute to enabling other staff, service users and carers from diverse backgrounds to flourish by working to create a psychologically safe environment. Regular professional and clinical supervision will be provided by the Head of Psychology and Psychotherapy in Specialist Services.&lt;/p&gt;\n&lt;p&gt;Please note, the successful candidate will be expected to travel across all 4 community perinatal mental health teams.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You qill be based at Maudsley Hospital, Denmark Hill, London, SE5 8AZ&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanice RigbyJob titleConsultant Clinical Psychologist and Joint Professional Head of Psychology and Psychotherapy.Email addressjanice.rigby@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, Denmark Hill, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Consultant Clinical / Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258517", "validThrough": "2020-11-12T23:59:59+0000"}