{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34443", "minValue": "34443", "unitText": "YEAR", "value": "£20.49 per hour"}}, "datePosted": "2020-11-06T14:32:09+0000", "description": "&lt;p&gt;Work 8 hours a week as a Part-Time Specialist Dietician at Badby Park in Daventry where you will be valued and supported as you help people build a brighter future. &lt;/p&gt;\n&lt;p&gt;You will be working alongside the clinical teams at Badby Park to care for people with neurological illnesses, acquired brain and spinal cord injuries.&lt;/p&gt;\n&lt;p&gt;As a Dietician, you will manage a clinical caseload where you will provide dietetic management, assessment, diagnosis, treatment programmes to individual service users and will be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;Liaising with community dieticians and GPS, you will agree, monitor and implement service user’s clinical nutrition and diet health plans throughout Badby Park. &lt;/p&gt;\n&lt;p&gt;You will provide advice, guidance and information to your peers, service users and their family as you support them through their recovery journey, including nutritional requirements and menu planning with the catering department.&lt;/p&gt;\n&lt;p&gt;Working as part of a multidisciplinary team, you will be supported regionally and will have access to a variety of training and online courses to support your career development and growth. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Implement dietetic audits.&lt;/li&gt;\n&lt;li&gt;To undertake comprehensive assessment of resident’s clinical needs in a holistic manner using specialised clinical knowledge and skill.&lt;/li&gt;\n&lt;li&gt;To negotiate and agree dietary or nutritional goals with individual service users and/or their carers/families.&lt;/li&gt;\n&lt;li&gt;To aim to meet these goals using appropriate nutrition interventions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;     &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hourly rate of £20.49&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Daventry", "postalCode": "NN11"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2202", "longitude": "-1.18748"}}, "title": "Part-Time Dietician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260147", "validThrough": "2020-12-06T23:59:59+0000"}