{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24124", "unitText": "YEAR", "value": "£24,124 - £30,112 pa pro rata"}}, "datePosted": "2020-11-06T10:46:20+0000", "description": "&lt;p&gt;We&#39;re not currently hiring overseas nurses - must have NMC Registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Get paid weekly whilst working on our Staff Bank.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;This is a great time to consider a role on our bank. Agencies are going to have to pay you less over coming months when the price cap comes into force and we think moving to our bank gives you a great alternative. We can offer the flexibility, the variety, and the training that any agency would across our main hospitals in Warwick, Leamington Spa, Ellen Badger and Stratford – Upon – Avon. In addition, we think being part of a great team is worth so much more.&lt;br /&gt;&lt;br /&gt;To be part of our Bank team you will need to be a registered nurse with a valid NMC number. We will want to see that you are a reliable, enthusiastic and a self-motivated individual. We will also need you to have excellent communication skills and be adaptable to changing situations.&lt;br /&gt;&lt;br /&gt;We can offer you regular or occasional nursing work in a friendly supportive environment.&lt;br /&gt;&lt;br /&gt;We need bank staff who are available to work a variety of shift types, sometimes at short notice. To work across a wide variety of areas in the Acute Hospital including medicine, surgery, orthopaedics, out patients, theatres, isolation facility, or in one of our Community Hospitals.&lt;br /&gt;&lt;br /&gt;We also offer:&lt;br /&gt;• Flexible hours to suit you&lt;br /&gt;• Monthly and Weekly pay options&lt;br /&gt;• Variety of work in all clinical areas.&lt;br /&gt;• Paid induction, mandatory updates and training.&lt;br /&gt;• Access to NHS Pension.&lt;br /&gt;• Free uniform.&lt;br /&gt;&lt;br /&gt;We think South Warwickshire NHS Foundation Trust is a great place to work. We hope you will too.&lt;br /&gt;&lt;br /&gt;RECRUITMENT CONTACT&lt;br /&gt;&lt;br /&gt;Should you wish discuss the recruitment process further please contact either Matt Clarson or Claire Hawkins on 01926 495321 ext 4595/ 8437.&lt;br /&gt;&lt;br /&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire HawkinsJob titleSenior HR AdvisorEmail addressclaire.hawkins@swft.nhs.ukTelephone number07887628247Additional contact information&lt;/p&gt;\n&lt;p&gt;Anne Marie Greger&lt;br /&gt;anne-marie.greger@swft.nhs.uk&lt;br /&gt;01926 495321 ext 8444&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Nurse - Bank Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259274", "validThrough": "2020-11-22T23:59:59+0000"}