{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-06T14:54:09+0000", "description": "&lt;p&gt;&lt;strong&gt;The Posts:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant Orthogeriatrician – 12 month Fixed Term Contract to cover maternity leave.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 X Posts Available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time to join the Department of Healthcare for Older People at University Hospitals Birmingham NHS Foundation Trust. For the first time, we are working as a system with health and social care partners to deliver a truly integrated service for older people, spanning Birmingham and Solihull as part of the STP ‘Ageing Well’ strategy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The recent acute Trust merger has led to further developments within our specialty becoming a transformation priority. Our vision is for older people to be as happy and healthy as possible, living self-sufficient, independent lives, able to have choice and control over what they do and what happens to them.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We expect our workforce, at all grades and professions to be highly skilled and motivated, delivering individualised care to older people at the time they need it, and in the best possible place for them, which could be within their own home, or a hospital bed. Such personalised care also encompasses the needs of the person’s support network, including carers, family, friends and the wider community. Birmingham is a diverse city, and we recognise that we have to work in a joined-up way, both internally and with our partners to deliver the best outcomes for patients and the communities we serve.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for enthusiastic individual who will bring their skills, knowledge and experience to our existing teams in the continued development of the department. You will work closely with colleagues in Acute Medicine and the Emergency Department as well as community services. &lt;/span&gt;&lt;span&gt;University Hospitals Birmingham NHS Foundation Trust has a reputation for upholding the highest standards of quality of care, and as a department we pride ourselves in being part of this. Clinical governance, education, training and research are key to this, and the successful candidate will have ample opportunity to contribute and become active members of the department, both within their base hospital and cross-site.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Consultant team work within a culture of mutual respect and colleague support. This extends to all new members who we welcome to our team. Candidates with areas of clinical special interest will be welcomed and such skills and knowledge will be accommodated whenever possible. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post is a whole time appointment, however applicants wishing to work part-time, especially those with small and school-aged children will also be considered and the job plan modified accordingly. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The posts are to join our current established workforce of 14 consultants, on the Heartlands Hospital site&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will work 10 programmed activities, or fewer if candidate preference, for University Hospitals Birmingham NHS Foundation Trust, and in addition to the services outlined above will also include the on-call rota. Prospective cover for annual leave is also expected. &lt;/span&gt;&lt;span&gt;The job plan will include PAs for direct patient care and SPAs to support activities required for revalidation including CPD and educational supervision / teaching.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates must possess MRCP or equivalent, and be on the Specialist Register in Geriatric and General Medicine or be within 6 months of CCT in Geriatric and General Medicine. Applicants must be entered onto the GMC register&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;span&gt;Interested candidates should contact &lt;/span&gt;&lt;span&gt;-&lt;/span&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;Dr Angeline Simons, Clinical Lead at Heartlands on 0121 424 0769&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull) - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Locum Consutant In Elderly Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260223", "validThrough": "2020-11-27T23:59:59+0000"}