{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T14:16:47+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 4 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Site Specialty Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join the Medical Directorate management team in Ysbyty Gwynedd. This is an exciting opportunity for an ambitious and highly motivated individual to develop their operational management career in a supportive and forward thinking Division. This role is essential to ensuring the smooth and efficient running of the Department, the delivery of key performance metrics and providing high quality support to the team. Working in a multi-disciplinary team, you will work collaboratively to solve problems and ensure systems and processes are in place to deliver an effective service for patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a proven ability to build excellent working relationships, be able to calmly and confidently prioritise to manage competing demands and have the necessary skills to identify and mitigate risks as they arise. They will be an effective communicator with methods to ensure all stakeholders in the Department are kept informed and included in developments, an ability to effectively influence and motivate and have an excellent understanding of the requirements needed to deliver performance standards.&lt;/p&gt;\n&lt;p&gt;This role would be an ideal opportunity for an experienced operational manager to expand their portfolio or for someone looking to develop their leadership experience in a dynamic operational role. The post will also provide exposure to Divisional working through inclusion in Directorate wide programmes of work.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Clare McGrath Job title Interim Lead Manager&lt;/p&gt;\n&lt;p&gt;Email address clare.mcgrath@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number03000850837&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Keith Jones, Lead Manager, 03000 850839&lt;/p&gt;\n&lt;p&gt;Clare McGrath, Interim Lead Manager - 03000 850837&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Gwynedd, Bangor", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Site Specialty Manager - Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252400", "validThrough": "2020-11-16T23:59:59+0000"}