{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-11-06T09:45:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in the LNWH NHS trust for a Specialty Grade Doctor in Clinical Haematology to work in our Directorate of Oncology and Haematology based at Northwick Park Hospital (NPH).&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join an established and vibrant department in the further expansion and development of clinical and diagnostic Haematology within the North West London sector. Although all posts are based at NPH, doctors are expected to work at all Trust sites delivering outpatient care and to liaise with colleagues regarding referrals and laboratory queries. The appointees will join 7 Specialist Trainees in delivering clinical, laboratory, diagnostic, administrative, research and teaching responsibilities. The successful applicant should have training in Haematology and acute medicine with experience in the management of patients&lt;/p&gt;\n&lt;p&gt;The applicants will be expected to work with the multi-disciplinary teams on the ward, supporting the Consultants and providing supervision to junior medical staff. This is an opportunity to develop further skills and gain experience in Clinical Hematology.&lt;/p&gt;\n&lt;p&gt;Applicants should have full GMC registration and experience, evidence of Clinical Hematology training.&lt;/p&gt;\n&lt;p&gt;We offer excellent training and development opportunities, a friendly working environment and flexible working.&lt;/p&gt;\n&lt;p&gt;We welcome applications to reflect our diverse local populations of age, gender, race and disability.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Siamak Arami - Haematology Consultant - siamak.arami@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Specialty Grade Doctor - Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259076", "validThrough": "2020-11-20T23:59:59+0000"}