{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pro rata per annum"}}, "datePosted": "2020-11-05T15:15:16+0000", "description": "&lt;p&gt;The Mid Yorkshire Hospitals NHS Trust has been on a fantastic improvement journey providing acute hospital services to more than half a million people living in the Wakefield and North Kirklees districts of West Yorkshire. It offers services in three main hospitals – Pinderfields (Wakefield), Dewsbury and District and Pontefract. In addition, The Trust provides community services to the people of Wakefield in a range of community settings such as health centres, clinics, GP surgeries, family centres and in people’s own homes. This means our patients benefit from hospital and community services working more closely together to ensure they receive their care in the most appropriate place for them – when and where they need it.&lt;/p&gt;\n&lt;p&gt;Approximately 6300 babies are born each year at The Mid Yorkshire Hospitals NHS Trust and we offer women personalised care and a choice of home birth, freestanding birth centre, alongside birth centre and multi-disciplinary care on our labour ward.&lt;/p&gt;\n&lt;p&gt;This is an exciting 34.5 hour role which will require a compassionate individual who has good communication and organizational skills. You would join a dedicated and hardworking multi–disciplinary team who are eager to ensure to make a difference. As such we are looking for an individual who values team work and for who patients experience is of the upmost importance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Ward Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258274", "validThrough": "2020-11-20T23:59:59+0000"}