{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 PA inc. HCAS"}}, "datePosted": "2020-10-28T13:30:59+0000", "description": "&lt;p&gt;Do you want to work for an organisation that is dynamic and innovative? Then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Central London Community Health Care Trust (CLCH) has exciting opportunities for passionate and committed Health Visitors to join us in Merton. We are looking for candidates with excellent clinical and communication skills who are passionate about delivering high quality care. We are looking to recruit practitioner to join our 0-19 teams contributing to the delivery of the Healthy Child Programme. You will help make a tangible difference to people’s lives and enjoy the best that London has to offer on your doorstep.&lt;/p&gt;\n&lt;p&gt;In our last CQC inspection CLCH was awarded a “GOOD” rating, we are listed amongst the Top NHS organisations to work for by HSJ.  In 2019 CLCH achieved sustained UNICEF level 3 status of the prestigious Baby Friendly Award in recognition of our outstanding support for breast feeding mothers and we are currently working towards the GOLD award. We are one of the few boroughs to offer specialist breast feeding advice from an ICBC registered lactation consultant.  Merton Health Visitors and School Nurses are co-located in Children’s Centre’s across the borough. We have strong links with our colleagues in Early Years and the Local Authority.&lt;/p&gt;\n&lt;p&gt;CLCH welcomes applications from newly qualified and experienced Health Visitors. Some of the benefits of working with CLCH include: a robust preceptorship programme for the first 12 months, outstanding safeguarding support from our safeguarding team and a comprehensive suite of training for health visiting to support revalidation, professional development opportunities and clinical supervision. CLCH also has its own Academy with London South Bank University as an HEI partner. Our annual staff awards celebrate the outstanding contributions made by our staff.&lt;/p&gt;\n&lt;p&gt;We offer flexible working arrangements; this can be considered on successful completion of your 6 month probation period.&lt;/p&gt;\n&lt;p&gt;Car drivers are desirable but not essential. Business permits provided.&lt;/p&gt;\n&lt;p&gt;We have full and part-time posts available.&lt;/p&gt;\n&lt;p&gt;If you would like to join our innovative, forward thinking team and make a difference to the lives of families, children and young people In Merton we would like to hear from you&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merton", "postalCode": "CR4 3HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4117", "longitude": "-.164958"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246786", "validThrough": "2020-11-11T23:59:59+0000"}