{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-06T11:15:51+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Specialist Speech and Language Therapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post is part of the Mental Health inpatient service at Prospect Park Hospital (PPH).&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available within the Mental Health inpatient service at Prospect Park Hospital. The Mental health inpatient service at PPH is based on the ward and predominantly focuses on dysphagia and training relevant staff members.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about Inpatient Service at PPH?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Therapy Team at Prospect Park Hospital comprises of Occupational Therapy, Physiotherapy, Dietetic and Speech and Language Therapy staff. You will receive clinical supervision and be supported to attend specialist clinical excellence groups through the RCSLT. You will work directly with Psychiatrists, Psychologists, Nursing Staff, and the Therapy Team. You will provide specialist Speech and Language Therapy assessment and intervention to working age and older adults within the mental health hospital. The role will also involve delivering the Dysphagia and Airway Obstruction in Mental Health training to all professional groups and staff in the hospital.&lt;/p&gt;\n&lt;p&gt;The wider BHFT Adult SLT services have excellent links with the University of Reading, the University of West London and the Royal Berkshire Hospital. Clinical education placements are provided for SLT students and for other HCP students such as OTs, Psychologists and CPNs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Through strong clinical and evidence based practice leadership, the Specialist Speech and Language Therapist will provide specialist Speech and Language Therapy assessment and interventions to patients on their caseload. The post holder will ensure that all patients are treated with compassion, dignity and respect placing value on the diversity of the local community and beyond. The Specialist Speech and Language Therapist’s key responsibility is to ensure that the patient experience and clinical record is of the highest quality inspiring patient and public confidence. This will be achieved through high visibility and accessibility on the wards and in the Community Team. The post holder will be expected to work in clinical practice for the majority of their time and will be a specialist in the clinical area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21) and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have and you would be very welcome to arrange to visit our unit. Please don’t hesitate to contact Jack Cairns on 0118 960 5170 or email Jack.Cairns@berkshire.nhs.uk who would be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259368", "validThrough": "2020-11-22T23:59:59+0000"}