{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa + £2000 Recruitment Premium"}}, "datePosted": "2020-11-05T16:31:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Nurse Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Wilton Community Team&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Various Hours Available (full and part-time opportunities)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and motivated Band 5 Community Nurses to working within our Wilton Community Team, based in South Wiltshire. Wilton is a quintessential Wiltshire market town with a history spanning more than 200 years. Just 3 miles down the road is Salisbury, which was crowned the best place to live in the UK by the 2019 Sunday Times Guide.&lt;/p&gt;\n&lt;p&gt;As a county we are proud of the services our community teams provide. They are developing new ways of working to help patients to better manage their own conditions, stay out of hospital and use the latest systems and technology to provide the most efficient and effective health care possible. Our multi-disciplinary community team in Wilton has developed considerably over the past few years and we need excellent people to continue their journey of innovation and development.&lt;/p&gt;\n&lt;p&gt;Lots of our patients have long-term health conditions and complex health needs. Working with us, you could develop your skills in a number of areas ranging from complex wound care management, catheter care, medicines management, rehabilitation, and end of life care, as well as developing a high standard of holistic assessment and care planning skills. Comprehensive training and support is available for the successful applicant.&lt;/p&gt;\n&lt;p&gt;The service operates from 7am until 10pm, 7 days a week. Applicants will be expected to work weekends and bank holidays on a rota basis.&lt;/p&gt;\n&lt;p&gt;To be successful within our community team you will need to be able to demonstrate how your excellent clinical skills are delivered through behaviour which meets our WHC values. Ideally you will have experience of working in a community setting however if you don’t have this experience but have a passion to work in the community then we still want to hear from you. Working in the community means you need to be flexible and able to travel.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For informal enquiries regarding this exciting opportunity, please call Beth Palmer (Team Leader) on 07771 872431. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Please note that this post is eligible for the WHC recruitment premium of £2000 (payable over 2 payments, £1000 on appointment and £1000 following successful completion of probationary period)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wilton Health Centre", "postalCode": "SP2 0HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0799", "longitude": "-1.86314"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258586", "validThrough": "2020-11-19T23:59:59+0000"}