{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 - 30,615.00"}}, "datePosted": "2020-10-30T17:11:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 5 &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Livingstone Community Hospital&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Full and part time opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;Are you a motivated and caring Registered Nurse based in the Kent area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a band 5 nurse you will receive an AFC 20/21 salary and terms and conditions including an NHS pension, plus a 5% high cost area allowance. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. We will offer a combination of in house eLearning, workshops and courses to support your development &lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers as discounts on Virgin Products such as holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.All this, and flexible working patterns to help support your work/life balance. Oh, and did we mention the free tea and coffee?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We&#39;re looking for Band 5 Nurses with an RGN qualification and license to practice. We currently have opportunities across our localities in Livingstone within the great county of Kent!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a band 5 nurse working for Virgin Care, you will work both independently and closely with our multi-disciplinary teams and be responsible for contributing to the holistic assessment, planning delivery and evaluation of patient care. You will also put to use your strong communication and organisation skills, along with a flexible approach, will ensure you deliver positive experiences to patients at every stage of their healthcare journey.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work to help us continue to change things for the better. We feel passionate that everyone should feel valued when they come into contact with our organisation, whether that&#39;s you, someone we care for or the wider community we operate in.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired – We won Team of the Year at FTD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Big congratulations to the North Kent CCC team for winning the Team of the Year Award, you deserve it! This just shows what a fantastic team this is to work with! #FTDAwards &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact Tom Noonan on Tom.Noonan@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’re welcome to come in for an informal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in Kent and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Livingstone Community Hospital", "postalCode": "DA1 1SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4426", "longitude": ".226873"}}, "title": "Registered Nurse - Ward Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251040", "validThrough": "2020-11-13T23:59:59+0000"}