{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "120000", "minValue": "86000", "unitText": "YEAR", "value": "£86,000 to £120,000"}}, "datePosted": "2020-10-21T13:46:30+0100", "description": "&lt;p&gt;&lt;strong&gt;General Practitioners (GP) – Out of Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary £86k to £120k per annum for 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Part time posts available, flexible working options&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Winter Contracts (5 months)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;OOH Spalding and Stamford (weekends and evenings)&lt;/p&gt;\n&lt;p&gt;Are you a GP looking for a different way of working?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are Lincolnshire Community Health Services NHS Trust (LCHS), the primary community healthcare provider in Lincolnshire delivering community-based services aimed at supporting people to manage their own health at home and reducing the need for people to go into hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We care for thousands of patients every day, in partnership with other health and social care services, to deliver joined-up care in community settings. The intention is to provide good out of hospital care and avoid admissions into acute hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;By providing community-based services aimed at preventing health problems from getting worse, we help to reduce the need for people to go into hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for proactive, dedicated and dynamic individuals who can be part of a fast- moving, innovative and ambitious team, dedicated to supporting members of our communities to manage their own health at home and reduce the need to go into hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are rated ‘Outstanding’ by the Care Quality Commission (only 4 community trusts in the country who are) and are playing an integral part in shaping future health service provision countywide alongside partner health and social care organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We currently are looking for outstanding, committed GPs to support our Community Hospitals and Out of Hours services due to expansion of beds and services over this winter – we have opportunities to suit everyone and these can be discussed individually with candidates!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Just a flavour of these roles:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing a wide and reaching case load, dealing with a wide range of presenting health care needs and undiagnosed problems across our 24/7 services&lt;/li&gt;\n&lt;li&gt;Provide remote support to telephone consultations&lt;/li&gt;\n&lt;li&gt;Triage a variety of calls and cases ranging from base appointments up to more complex cases requiring hospital admissions or referrals to specialists.&lt;/li&gt;\n&lt;li&gt;Work towards completing 6 quality telephone consultations per hour or 4 base visits per hour.&lt;/li&gt;\n&lt;li&gt;Integrated teams within our in-patient community hospitals; step-down patients for rehab from local acute hospitals; step-up patients from the community requiring investigation and medical management of problems; end of life care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return, we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bespoke GP salary package of up to £120k&lt;/li&gt;\n&lt;li&gt;Supporting Professional Activity – 1 x SPA session per week pro rata&lt;/li&gt;\n&lt;li&gt;Study leave including mandatory training + 4 additional days to suit staff member pro rata&lt;/li&gt;\n&lt;li&gt;GP engagement and networking events&lt;/li&gt;\n&lt;li&gt;Outstanding CQC rating&lt;/li&gt;\n&lt;li&gt;Flexible working patterns&lt;/li&gt;\n&lt;li&gt;Varied, interesting and challenging work&lt;/li&gt;\n&lt;li&gt;Medical leadership structure to provide support and mentoring&lt;/li&gt;\n&lt;li&gt;Free medical indemnity cover&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Health &amp; Wellbeing service&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Not only will you have the opportunity to flourish in a successful NHS Trust, Lincolnshire offers some of the best schools in the country, affordable housing, a world class golf course in Woodhall Spa and a great standard of living in one of the many picturesque market towns, villages or a thriving city.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Low cost of living/house prices – Rightmove Lincolnshire&lt;/li&gt;\n&lt;li&gt;Excellent schools – Schools in Lincolnshire&lt;/li&gt;\n&lt;li&gt;City, Countryside, Coast – Visit Lincoln&lt;/li&gt;\n&lt;li&gt;Direct rail connections by LNER, East Midlands Railway and Northern Rail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;LCHS Way&lt;/p&gt;\n&lt;p&gt;We Listen, We Care, We Act, We Improve&lt;/p&gt;\n&lt;p&gt;We listen: we engage with everyone we work with, we are united, we are always positive We care: everyone is valued, respected and developed, knowledge and skills are nurtured, success is celebrated&lt;/p&gt;\n&lt;p&gt;We act: clear goals and right resources, freedom coupled with accountability, emphasis on simplicity&lt;/p&gt;\n&lt;p&gt;We improve: we are creative, resourceful and innovative, integrated and collaboration is the way forward, we’re always striving to do better&lt;/p&gt;\n&lt;p&gt;....Fit for now, fit for the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanine ElsonJob titleDeputy Medical Director LCHS NHS TrustEmail addressJanine.Elson@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To view the full advert and job description which includes specific details regarding the role, or apply for any of our medical vacancies please visit our website,&lt;/p&gt;\n&lt;p&gt;If you would like to discuss further or to arrange a visit, please contact;&lt;/p&gt;\n&lt;p&gt;Dr Janine Elson, Deputy Medical Director at janine.elson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stamford, Stamford", "postalCode": "PE91UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6554", "longitude": "-.468739"}}, "title": "General Practitioner Out Of Hours", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236674", "validThrough": "2020-11-09T23:59:59+0000"}