{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-20T11:30:40+0100", "description": "&lt;p&gt;&lt;strong&gt;MORTIMER WARD, STONEBOW Unit – Mental Health Inpatients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;STAFF NURSE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 HOURS PER WEEK – DAYS AND NIGHTS ROTATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Herefordshire offers excellent living and working prospects. Nearby are the Wye Valley, an Area of Outstanding Natural Beauty; the Forest of Dean; the Malvern Hills; the Brecon Beacons National Park; with easy access to the M5 and M50. The area also has the benefit of outstanding schools. Surrounding the small city of Hereford there are many attractive villages set in beautiful countryside and five busy small market towns.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking a highly motivated and committed Band 5 Nurse to complement our current team of professionals working on Mortimer Ward within the Stonebow Unit. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mortimer Ward is a 21 bedded ward for adults that have function mental illness and require hospital admission for inpatient treatment. It was rated as ‘Outstanding’ by the CQC, and working on Mortimer Ward will give you the opportunity to develop a range of skills including observing and recording changes in service users behavioral, physical and mental health.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As the ideal candidate for this post you would be an RMN qualified Nurse seeking an opportunity to make a real difference to people’s lives, with excellent communication skills and a passion for helping those experiencing a mental health concern. You will have the opportunity to work in a small, motivated team alongside a number of other health professionals and at times you will be given the opportunity to supervise and support junior members of the team and students within the ward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We provide a service to our patients 7 days a week, 24 hours a day, so we are looking for flexible people who would like to work on this rewarding service to cover shifts throughout the week at varying times of the day.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your commitment we will provide the opportunity to participate in a comprehensive induction and Mental Health Nurse development programme which ensures that you feel fully supported with the right tools to undertake this challenging but rewarding job. Professionals will participate in a variety of practice development initiatives. We will provide you with access to Post Registration training courses including those in teaching and assessing and a range of other training to help staff meet both their own development needs and the developing needs of this service. CPD will be provided by our academic local university partners.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you think that you would like to be involved in this rewarding service and would like to find out further information about this opportunity please contact Ian Bloore, Ward Manager on 01432 364046 or email ian.bloore@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The qualification, training and experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/p&gt;\n&lt;p&gt;Herefordshire Mental Health and Learning Disability Services aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Herefordshire Mental Health and Learning Disabilities Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234146", "validThrough": "2020-11-16T23:59:59+0000"}