{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-05T08:30:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Higher Specialist Biomedical Scientist / Team Leader- Band 7&lt;/strong&gt; &lt;br /&gt;&lt;strong&gt;Molecular Covid testing laboratory Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Person&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from enthusiastic and suitably qualified individuals for the post of Higher Specialist Biomedical Scientist / Team Leader in Virology within the Department of Pathology. You must be a HCPC Registered Biomedical Scientist preferably with an MSc in Medical Microbiology. Experience of virology would be an advantage.&lt;/p&gt;\n&lt;p&gt;The department will also consider applications from candidates currently undertaking a funded MSc in Medical Microbiology or Virology that is due for completion by August 2021. Please state in your application if there are requirements for attendance at University sites.&lt;/p&gt;\n&lt;p&gt;You must also have substantial experience in a clinical diagnostic department, proven supervisory skills and leadership qualities. As a senior member of staff you will lead this area within the department and participate in management meetings, co-ordination and delivery of training, quality assurance, audits, and various aspects of clinical governance.&lt;br /&gt;We are looking for an enthusiastic, friendly and well-motivated individual who is a good team player. You will be expected to work flexibly within the service who&#39;s operating hours are currently between 6am to 10pm including, Saturdays, Sundays and Bank Holidays .&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Role&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Working under the leadership of a Pathology Care Group , the role is critical to the successful operations of the service. The role encompasses management of a team within this area of the service, which will require specialist knowledge in microbiology. In particular the role is designed to fulfil the following functions:&lt;br /&gt;• To organise the day to day operational management of a section of the laboratory ensuring optimal performance of equipment, materials and staff&lt;br /&gt;• You will use your extensive specialist knowledge to help advise the management and medical team on issues that arise within the laboratory. &lt;br /&gt;• You will be working as part of a team to help deliver additional service related roles within the areas of training, quality, and health &amp; safety&lt;br /&gt;• To provide leadership and line management for the staff of the section, including work planning, rosters, training and mentoring, performance management and other HR issues&lt;br /&gt;This role offers the opportunity to develop the covid testing service and day to day management of the laboratory. Working as part of the team you will contribute to the provision and further development of a high quality cutting edge diagnostic service.&lt;/p&gt;\n&lt;p&gt;This post is currently based at the Queen’s Medical Centre Campus which is part of Nottingham University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Working as part of the team you will contribute to the provision and further development of a high quality cutting edge diagnostic service.&lt;/p&gt;\n&lt;p&gt;Informal visits are available. For further information contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Szolin, Pathology Care Group General Manager&lt;/p&gt;\n&lt;p&gt;07812 268765&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephanie SzolinJob titlePathology General ManagerEmail addressStephanie.szolin@nuh.nhs.ukTelephone number07812 268765&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Higher Specialist Biomedical Scientist / Team leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256931", "validThrough": "2020-11-18T23:59:59+0000"}