{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-29T14:00:25+0000", "description": "&lt;p&gt;12 months training contract with a view to gaining full time employment after successful completion of the University delivered training course.&lt;/p&gt;\n&lt;p&gt;If you are passionate about engendering parity of esteem between physical and mental health and would like to retrain to facilitate this passion, we want to hear from you! If you are that person who has genuine interest in helping someone live well emotionally with their long term physical health condition, this could certainly be the opportunity you have been looking for. We all know living with long term physical health conditions can be a struggle, just think what it would be like knowing you are learning how to make a difference?&lt;/p&gt;\n&lt;p&gt;We are looking for four trainee psychological wellbeing practitioners who will deliver low intensity cognitive behavioural therapy to people presenting with common mental health problems e.g. anxiety and depression, which will add value to our expanding team. That’s an opportunity for four people who want to work integrative with our colleges in physical health. This could be a welcomed opportunity for you if you are looking for a career change or a career that could see you utilising your pre-existing skills set. Perhaps you currently work or have worked in a physical health setting or have a special interest in mental health and its links with physical health, your interest would be of interest to us, especially interest in long term health conditions e.g. respiratory conditions or diabetes. We would like to hear what you have to say.&lt;/p&gt;\n&lt;p&gt;If you truly want to make that difference why not apply? You will learn all about common mental health problems, how to assess and deliver a range of evidence-based treatments including psycho-education and guided self-help, either face-to-to-face, over the telephone or via video conferencing.&lt;/p&gt;\n&lt;p&gt;Whilst you will attend University one day a week, this role will often mean working independently within community settings, under the supervision of an experienced practitioner, therefore you would need to be confident with this be able to work autonomously. We are also looking for someone who has the motivation and capacity to help develop our service and improve overall patient care.&lt;/p&gt;\n&lt;p&gt;Anyone joining our team can rest assured the team they are joining are proficient in delivering evidence-based psychological interventions, which you will be trained to deliver but also our staff have an abundance of passion, care and commitment for, and to the patients they work with, something you will need demonstrate to join our team.&lt;/p&gt;\n&lt;p&gt;Who are we:-&lt;/p&gt;\n&lt;p&gt;Doncaster Improving Access to Psychological Therapies Long-Term Conditions (IAPT-LTC) service. The service launched 2 years ago due to evidence that over a third of people with long term physical health conditions e.g. cardiovascular disease or diabetes and medically unexplained symptoms have co-existing mental health problems, which can lead to greater harm and distress. Our mission is to break down equality and ensure our patients have the same access to NICE-recommended psychological interventions as others, so that mental health is truly on par with physical health. To achieve this our aim is to provide help for people with long term health conditions or medically unexplained symptoms who are struggling emotionally, by accessing our service at the right time, typically when they need it the most. We provide the right form of talking therapy, delivered by the highest quality staff, always aiming to empower people to make informed choices and changes to improve their well-being, all whilst managing their long term physical health condition or medically unexplained symptoms.&lt;/p&gt;\n&lt;p&gt;The interviews follow a two stage process. The dates for the University interviews are to be confirmed.&lt;/p&gt;\n&lt;p&gt;Closing date 7 November 2020&lt;/p&gt;\n&lt;p&gt;The initial interviews with the service will be held throughout the week commencing 30th November 2020.&lt;/p&gt;\n&lt;p&gt;For further information contact Joanne Goulding, Team Manager of Doncaster IAPT- LTC at joanne.goulding2@nhs.net.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.506", "longitude": "-1.07477"}}, "title": "Trainee Psychological Wellbeing Practitioner (Band 4)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248605", "validThrough": "2020-11-07T23:59:59+0000"}