{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T15:45:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Emotional Wellbeing and Mental Health (CAMHS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 CAMHS Specialist Mental Health Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South Warwickshire Trailblazer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2.0 wte equivalent – permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Coventry and Warwickshire Partnership Trust, in partnership with South Warwickshire CCG have been successful in securing funding as part of the National Trailblazer programme for Mental Health in Schools Teams and the 4 Week Wait programme. As a 4 week wait trailblazer site we are committed to being a responsive mental health service that delivers assessment and intervention to children, young people and their families sooner. We will also be working very closely with our newly commissioned mental health in schools team who will be providing interventions to children in schools to promote their mental health and wellbeing.&lt;/p&gt;\n&lt;p&gt;As a service working with Children and Young People we welcome people to apply who have a clear passion to want to make a difference, are motivated and enthused with the core belief of prevention and resilience. We are a service that is known for being creative and responsive to the needs of our Children and Young People who no matter what level of need to support their emotional wellbeing and mental health receive the right support as they need it.&lt;/p&gt;\n&lt;p&gt;In addition our partnership with CW Mind is bringing about a changing culture and is influencing the system to see emotional wellbeing and mental health as everyone’s business. We are with schools, social care and organisations supporting Children and our youth; all working together to support our Children and Young People to have resilience and healthy emotional wellbeing working towards the aim of prevention and reduced stigma&lt;/p&gt;\n&lt;p&gt;We are also part of the CYP IAPT initiative and work in partnership with the Reading CYP-IAPT collaborative where we have on going opportunities for further training. Embedded in our model are pathways that are built upon evidence based practice and ensure a supportive supervision structure that allows for effective care delivery as well as the development of staff skills and knowledge.&lt;/p&gt;\n&lt;p&gt;If you are excited about change and want to be part of this new and exciting model with the aspiration to really make a difference we would very much welcome your application.&lt;/p&gt;\n&lt;p&gt;You will be a qualified professional with current registration with a relevant professional body and experience of working in Child and Adolescent mental health . You will hold a caseload of young people with complex mental health needs and will take responsibility for providing assessments and therapeutic treatment programmes and supporting the service changes around the 4 week wait initiative&lt;/p&gt;\n&lt;p&gt;We as a service are looking for professional staff to have skills, knowledge, passion and expertise in working with Children and young People. If you have skills in Mental Health assessments and treatment, groups, CBT, DDP, interest in Neurodevelopment, Children Looked after and other vulnerable groups, crisis support and liaison with paediatric wards then these vacancies will apply to yourself.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hannah Pyburn - Team Lead, email: hannah.pyburn@covwarkpt.nhs, Tel: 01926 881640&lt;/p&gt;\n&lt;p&gt;Chris Heydon – Trailblazer Service Manager, email: christine.heydon@covwarkpt.nhs.uk or Sarah Talbot, Tel: 01926 881640&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire, Leamington Spa", "postalCode": "CV31 1JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2848", "longitude": "-1.52344"}}, "title": "CAMHS Practitioner - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247231", "validThrough": "2020-11-11T23:59:59+0000"}