{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 / £24,157"}}, "datePosted": "2020-10-26T14:08:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Healthy Child Programme Practitioner - &lt;strong&gt;Band 4 &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Full time and part time posts - Various posts and locations available across Leicester City and Leicestershire. &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Pattern: Monday to Friday&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and self-motivated individuals to work as effective and conscientious members of our Healthy Together 0-19 Teams. The role involves working as part of skill mixed teams with Specialist Community Public Health Nurses (health visitors and school nurses)&lt;/p&gt;\n&lt;p&gt;Providing high quality and compassionate care within the remit of the Healthy Child Programme;&lt;/p&gt;\n&lt;p&gt;Delivering universal services and targeted packages of care to children, young people and their families.&lt;/p&gt;\n&lt;p&gt;As a Healthy Child Programme Practitioner you will be expected to contribute to identifying health needs, improving outcomes and reducing health inequalities by providing a comprehensive neighbourhood based service to meet the needs of local children, young people and their families.&lt;/p&gt;\n&lt;p&gt;The emphasis of the Public Health component within Healthy Together requires an organised, keen and proactive practitioner to drive activity within the team which promotes key health messages to communities in effective and creative ways. This will reflect both local and national campaign agenda’s throughout the year.&lt;/p&gt;\n&lt;p&gt;We currently &lt;strong&gt;have a number of full time and part time vacancies&lt;/strong&gt; as a Band 4 Healthy Child Programme Practitioner to work with our Teams in Leicestershire County and Leicester City. Excellent communication skills are a key requirement as the successful applicant will hold an integral role within the team providing broader responsibility to children and young people across the whole 0-19 age range.&lt;/p&gt;\n&lt;p&gt;The desire to build positive working relationships with our partnership agencies and other members of our multidisciplinary team would also need to be a focus of continued attention and commitment as well as creative approaches which inspire self-sustained support systems within communities.&lt;/p&gt;\n&lt;p&gt;The values of our Families, Young Peoples and Children’s Services Team are compassion, trust, respect and integrity. You would need to embrace these and in return we shall provide you with great opportunities to develop your practice and service improvement skills.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have an NVQ Level 3 qualification in Children&#39;s care, learning and development or can evidence an equivalent qualification which provides similar knowledge base and skills to early years to support this. Previous experience of working with children and young people within the community setting would be desirable but not essential. We have excellent support within the team as well as comprehensive training opportunities to support the successful applicant.&lt;/p&gt;\n&lt;p&gt;Do you want to work in an organisation that will ensure that every local child or young person gets the best start in life and whose parents / carers feel well supported by a team of professionals? If the answer is yes, then see further information.&lt;/p&gt;\n&lt;p&gt;If you would be interested in this post and would like to meet a member of our team prior to the interview date please contact Rebecca Fowler (Clinical Team Leader) Tel 07818095353.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester, Leicestershire and Rutland", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 4 Healthy Child Programme Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242838", "validThrough": "2020-11-16T23:59:59+0000"}