{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-04T10:31:59+0000", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated individual to work within our Antimicrobial Pharmacy Team to assist the Lead Antimicrobial Pharmacist in delivering our antimicrobial stewardship programme at University Hospitals of Leicester.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to champion antimicrobial stewardship across the Trust, working closely with the Pharmacy, OPAT, Microbiology, Infection Prevention and wider multidisciplinary teams. As a clinical role model, you will need to consistently demonstrate the ability to provide safe, clinically effective and cost efficient use of antimicrobials, and promote optimal antimicrobial prescribing practice. While participating in the core antimicrobial pharmacy service, you will provide clinical pharmacy support to a large OPAT service, and lead antimicrobial stewardship education for pharmacy as well as other healthcare professionals.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who have strong interpersonal and influencing skills, and a desire to improve patient’s quality of care. You will thrive on the opportunities and challenges provided by a busy and varied supportive work environment.&lt;/p&gt;\n&lt;p&gt;The role is predominantly based at the Leicester Royal Infirmary in the first instance; travel to and working from other sites is to be expected. Candidates will be expected to participate in the department’s on-call and weekend rota.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Corrine Ashton - Lead Antimicrobial Pharmacist&lt;/p&gt;\n&lt;p&gt;corrine.ashton@uhl-tr.nhs.uk - 0116 2502770 or 07950882918&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross site, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Advanced Specialist Pharmacist - Antimicrobials", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255401", "validThrough": "2020-11-18T23:59:59+0000"}