{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-14T10:01:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Substantive&lt;/strong&gt; &lt;strong&gt;Consultant in Respiratory and General Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity for a forward looking and enthusiastic respiratory physician to join our expanded team. The post holder will be responsible for the continued delivery and further development of an already well-established respiratory service at Lewisham and Greenwich NHS Trust. The post will be based at University Hospital Lewisham, replacing a colleague who has chosen to practice within the EU.&lt;/p&gt;\n&lt;p&gt;This post will support the aim of dealing with the overall increasing demand for respiratory care and allow development and improvement in services. The successful applicant will be part of the current team of ten respiratory Consultants across both sites. The respiratory teams include and are supported by 4 specialist registrars and a team of junior doctors. In addition there are 4 respiratory specialist nurses, 4 clinical physiologists, a team of TB specialist nurses, a lung cancer MDT coordinator and 3 lung cancer clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt;Lewisham and Greenwich NHS Trust was established in October 2013, following the integration of Lewisham Healthcare NHS Trust and Queen Elizabeth Hospital in Woolwich. The Trust provides a comprehensive portfolio of high quality acute healthcare services to a critical mass of more than c.526,000 people living across the London Boroughs of Lewisham, Greenwich and North Bexley.&lt;/p&gt;\n&lt;p&gt;We are looking for persons with a sub-specialty interest which would complement our existing establishment which includes TB, Lung Cancer, Sleep/Ventilation, COPD, Pleural Disease and Cystic Fibrosis. As well as general Respiratory out-patient clinics, we have also sub-specialist clinics for Lung Cancer, Sleep/Ventilators, TB and Cystic Fibrosis. There are bronchoscopy sessions at both sites and dedicated pleural clinics. We are in the process of developing a hub and bespoke endobronchial ultrasound across the network.&lt;/p&gt;\n&lt;p&gt;Applicants should be fully registered with the GMC and hold a Licence to Practise and possess a CCT in Respiratory and General Internal Medicine (or be within 6 months of obtaining CCT at date of interview), and should be listed on the Specialist Register at the time of taking up the post.&lt;/p&gt;\n&lt;p&gt;Please complete the on-line application form ensuring that you upload a copy of your recent CV to support your application, including the names, addresses, telephone numbers and e-mail addresses of three referees (one of whom should be your current or most recent employer/clinical supervisor). If you are not on the specialist register please also ensure you enclose evidence/confirmation that you will be on the specialist register or have a CCT within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Please note the job description is pending approval with the Royal College of Physicians**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To discuss the post or to arrange a visit to the department, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Karnan Satkunam, Clinical Lead for Respiratory Medicine, tel: 0208 836 4093.&lt;/p&gt;\n&lt;p&gt;Dr Lucy Baker, Consultant in Respiratory Medicine, UHL, tel: 0208 333 8283.&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 7th January 2021&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lewisham, London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Consulltant in Respiratory and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225577", "validThrough": "2020-11-15T23:59:59+0000"}