{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum pro rata"}}, "datePosted": "2020-11-06T09:03:38+0000", "description": "&lt;p&gt;&lt;strong&gt;MID CHESHIRE HOSPITALS NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LEIGHTON HOSPITAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant in Emergency Medicine (12 month Fixed Term)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Locum Consultant in Emergency Medicine at Mid Cheshire Hospitals NHS Foundation Trust. The successful candidate will be based at Leighton Hospital, Crewe in the Emergency Department, Division of Medicine and Emergency Care. The department consists of 10.5 whole time equivalent Consultants (including this post) supported, at present, by 3 Specialty Doctors, 6 LED Grade Doctors, 6 Specialist Trainee Doctors all ST3 and above, 6 GPTS, 3 Foundation Year 2 Doctors and Advanced Clinical Practitioners.&lt;/p&gt;\n&lt;p&gt;The Emergency Department (ED) is a busy department and accredited trauma unit providing acute emergency services for Mid Cheshire Hospitals NHS Foundation Trust, with a catchment population of around 300,000. It is a pro-active and progressive department with a young, dynamic Consultant team which has a range of interests including paediatric emergency medicine and education. With the support of our Head of Nursing, Deputy Divisional General Manager and Matron, we are continually developing our emergency service by improving flow initiatives, evidence-based pathways and embracing new skills and clinical expertise, including stroke thrombolysis and paediatric procedural sedation.&lt;/p&gt;\n&lt;p&gt;The post is offered on a full-time basis; however, the Trust would welcome discussion with individuals looking for a more flexible working pattern to support a different work life balance&lt;/p&gt;\n&lt;p&gt;The post-holder (full-time or part-time) will be expected to take part in the full on-call rota (i.e. 1:10) and a weekly late evening session too.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have full registration with the GMC and continue to hold a Licence to Practise. The applicant must also be on the Specialist Register or be within six months of obtaining their Certificate of Completion of Training in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;For an informal discussion and further details please contact:&lt;/p&gt;\n&lt;p&gt;Dr Seif Ahmad&lt;/p&gt;\n&lt;p&gt;Service Lead and Consultant in Emergency Medicine&lt;/p&gt;\n&lt;p&gt;Email seif.ahmad@mcht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mrs Rebecca Viggars&lt;/p&gt;\n&lt;p&gt;Service Manager&lt;/p&gt;\n&lt;p&gt;Tel: 01270 273990&lt;/p&gt;\n&lt;p&gt;Email: Rebecca.Viggars@mcht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mid Cheshire Hospitals NHS Foundation Trust : Medical Resourcing", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258960", "validThrough": "2020-11-20T23:59:59+0000"}