{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75455", "minValue": "65542", "unitText": "YEAR", "value": "£65,542 - £75,455 inc HCA"}}, "datePosted": "2020-10-19T10:16:56+0100", "description": "&lt;p&gt;West Hertfordshire Hospitals NHS Trust are seeking to appoint a Specialist Clinical Scientist at Band 8C in Chemical Pathology and invite applications from suitably qualified and experienced candidates with significant experience of working in a busy Chemical Pathology Department.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, well-organised and highly motivated individual, with exceptional communication skills who shares the values of West Hertfordshire Hospitals NHS Trust. In return, we will provide opportunities for learning and professional development.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to undertake method development, protocol development and clinical liaison including ‘duty’ biochemist work. The post-holder will be required to contribute to medical teaching and training for trainee clinical scientists and biomedical scientists when applicable. A role in data analytics and assistance in managing the departments QMS system is expected&lt;/p&gt;\n&lt;p&gt;The appointee will assist the Head of Department and other members of the team in providing a comprehensive, cost effective and high quality Chemical Pathology service for our users which is ISO15189:2012 accredited. The appointee will represent the Chemical Pathology Department at relevant Trust and Pathology meetings as required and will contribute to service improvement as well as facilitating delivery of current service provision.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to be an experienced HCPC Registered Clinical Scientist in Clinical Biochemistry and have successfully completed the FRCPath examination.&lt;/p&gt;\n&lt;p&gt;There is a full 24/7 hour acute/urgent analytical service at our Watford Laboratory and a Monday to Friday non urgent service provided at the Hemel Hempstead Laboratory site. The successful candidate is expected to work across sites as required. The successful candidate will be expected to participate in the On-Call roster for the provision of clinical advice out of hours after appropriate training.&lt;/p&gt;\n&lt;p&gt;The Laboratory is fully automated in its main analytical platforms with Roche Chemistry and Siemens analysers used for Immunochemistry, Sebia systems for protein electrophoresis, Menarini Boronate Affinity for HbA1C and MAST OC Sensor for FIT. The Trust is committed to the personal development of its staff at all levels.&lt;/p&gt;\n&lt;p&gt;This role requires working closely with Consultants, Team Leaders, Quality Leads, and Chemical Pathology (Blood Science) Managers.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Bharat Patel&lt;/p&gt;\n&lt;p&gt;Head of Department - Consultant Clinical Scientist&lt;/p&gt;\n&lt;p&gt;Telephone number 01923 217573&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 8c - Specialist Clinical Scientist, Chemical Pathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231757", "validThrough": "2020-11-26T23:59:59+0000"}