{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-11-02T10:32:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Chief Paramedic and Quality Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Remuneration: Competitive&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Closing Date: midnight, 10 November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;London Ambulance Service’s (LAS) mission is to be a world-class ambulance service for a world-class city.&lt;/p&gt;\n&lt;p&gt;As the only London-wide NHS Trust covering an area of 620 square miles, LAS is the busiest ambulance service in the UK. It does extraordinary work, both on the frontline of emergency services and at the heart of the NHS across the capital, providing the right urgent care to patients at the right time, and in the most effective way possible. After a challenging period three years ago, the London Ambulance Service is improving rapidly: judged to be a “good” service by the Care Quality Commission, it is working to harness opportunities to continuously improve in order to provide safe, high-quality, patient-centred care for all who need it.&lt;/p&gt;\n&lt;p&gt;A new role on the board, the Chief Paramedic and Quality Officer will play a pivotal role for LAS. As the voice of paramedics, this person will bring together the quality agenda alongside clinical education and training. Working strategically alongside the Chief Operating Officer and Chief Medical Officer, they will form the triumvirate that ensures clinical safety and quality in every aspect of LAS’s operations. As part of the executive group, they will develop LAS’s culture, modernising ways of working and leading a strong and capable team. The postholder will provide best-in-class leadership to LAS’s quality, clinical education and training agendas, while building effective partnerships internally and externally and ensuring that in every respect the Trust remains at the cutting edge of developments in the sector.&lt;/p&gt;\n&lt;p&gt;Candidates will be a senior leader who will be immediately comfortable operating at executive leadership level, with experience working as a paramedic. Able to challenge colleagues in a structured and evidence-based way, they will be capable of building strong partnerships with, and influencing, key internal and external stakeholders. Candidates will be able to drive meaningful clinical and cultural change in a fast-paced, demanding and ambiguous environment, and will have the personal resilience and impact to bring together LAS’s quality and governance, training and clinical education agendas.&lt;/p&gt;\n&lt;p&gt;Saxton Bampfylde Ltd is acting as an employment agency advisor to the London Ambulance Service on this appointment. For further information about the role, including details about how to apply, please use reference using reference &lt;strong&gt;TACARD&lt;/strong&gt;. Alternatively, telephone +44 (0)20 7227 0880 (during office hours). Applications should be received by &lt;strong&gt;midnight &lt;/strong&gt;on&lt;strong&gt; 10 November&lt;/strong&gt; &lt;strong&gt;2020&lt;/strong&gt;.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122295"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 8SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5002", "longitude": "-.109005"}}, "title": "Chief Paramedic and Quality Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251593", "validThrough": "2020-11-10T23:59:59+0000"}