{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-£110,683"}}, "datePosted": "2020-11-05T13:07:26+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Locum Consultant Respiratory and General Medicine&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the Respiratory Medicine department at University Hospitals Birmingham.&lt;/p&gt;\n&lt;p&gt;University Hospitals Birmingham NHS Foundation Trust (UHB) is one of the largest teaching hospital trusts in England, serving a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;Our multiple sites, Birmingham Heartlands Hospital, the Queen Elizabeth Hospital Birmingham, Solihull Hospital and Community Services, Good Hope Hospital in Sutton Coldfield and Birmingham Chest Clinic allow people to be treated as close to home as possible.&lt;/p&gt;\n&lt;p&gt;We see and treat more than 2.2 million people every year across our sites and our hospitals deliver more babies than anywhere else in Europe.&lt;/p&gt;\n&lt;p&gt;We are a regional centre for cancer, bone marrow transplants, trauma, renal dialysis, burns and plastics, HIV and AIDS, as well as respiratory conditions like cystic fibrosis, thoracic surgery and have the largest solid organ transplantation programme in Europe.&lt;/p&gt;\n&lt;p&gt;We provide a series of highly specialised cardiac, liver and neurosurgery services to patients across the UK.&lt;/p&gt;\n&lt;p&gt;We are world-renowned for our trauma care and have developed pioneering surgical techniques in the management of ballistic and blast injuries, including bespoke surgical solutions for unseen injuries. We are a designated Level 1 Trauma centre and host of the UK’s only £20m National Institute for Health Research (NIHR) Surgical Reconstruction and Microbiology Research Centre (SRMRC).&lt;/p&gt;\n&lt;p&gt;Post one is to support the Lung Cancer and Pleural disease services based at Birmingham Heartlands site and Post two is to support the General Respiratory service and sub speciality service; such as ILD or Sleep based at the Queen Elizabeth Hospital Birmingham site. The post holders would be expected to have a substantial clinical interest that could be developed to contribute a further subspecialty. The Trust is strongly supportive of educational development and will ensure sessional time is allocated for education, research and audit activities.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the GMC specialist register for Respiratory Medicine or within 6 months of attaining specialist registration at the time of the interview&lt;/p&gt;\n&lt;p&gt;Applicants are invited to contact to discuss further details of the posts:&lt;/p&gt;\n&lt;p&gt;Dr Adel Mansur, Clinical Service Lead for Respiratory Medicine:&lt;/p&gt;\n&lt;p&gt;Tel. 0121 424 1731&lt;/p&gt;\n&lt;p&gt;Adel.Mansur@heartofengland.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Simon Gompertz, QEHB based Clinical Service Lead for Respiratory Medicine&lt;/p&gt;\n&lt;p&gt;Tel. 0121 371 4826&lt;/p&gt;\n&lt;p&gt;Simon.Gompertz@uhb.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure your CV is attached to your application before the closing date of03 December 2020 or the application will not be considered.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you experience any difficulties with your application or uploading your CV please contact Christine Pickering on 0121 371 8389&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham, University Hospitals Birmingham", "postalCode": "B15 1NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4702", "longitude": "-1.91569"}}, "title": "Locum Consultant in Respiratory Med", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257795", "validThrough": "2020-12-03T23:59:59+0000"}