{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-06T12:03:14+0000", "description": "&lt;p&gt;Would you welcome a new challenge? If you are a positive, enthusiastic and confident clinician who would like the chance to work in a community setting, then please read on.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Kirklees Older People’s Mental Health Services which is a service model based on delivering ‘Care Closer to Home’.&lt;/p&gt;\n&lt;p&gt;The Kirklees Older People’s Services Community Mental Health Team is a multi-disciplinary team working with people who experience a functional and/or organic mental health diagnosis.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to recruit 2 x Band 5 Community Mental Health Practitioners who are Registered Mental Health Nurses to play a key clinical role in delivering the Care Closer to Home model for those who use our services in Kirklees.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These posts are both for 37.5 hours per week. There is an expectation that staff are required to deliver a mental health service Kirklees wide in line with service demand.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are particularly looking for individuals who are enthusiastic about working in an innovative, flexible and creative way. You need to be committed to working collaboratively with other disciplines to develop and support integrated packages of care putting the service users in the center of all we do.&lt;/span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will work within the remit of the Band 5 job description under the Care Programme Approach. Undertaking holistic assessments of service users, delivering both short and long-term interventions for service users who have complex mental health issues which are research based to promote recovery, independence and discharge of service users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Although the successful practitioner’s role will be working with service users with Severe and enduring mental health needs, they will also need to be proficient in undertaking initial assessments of service users, short term intervention work and clinical decision making, working collaboratively with partner organisations and primary care staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is an Equal Opportunities employer and is also committed to a healthy work life balance. All applicants will be assessed fairly and on merit. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal enquiries, or to arrange a visit please contact team manager:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Judith Megson on 01484 343127.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Due to the current Covid-19 situation, it is important for us all to model and encourage others to follow the social distancing guidelines. Therefore, to slow the spread of the virus, interviews may be required to take place via Microsoft teams/skype call. All shortlisted candidates will be advised nearer the time if this is to happen.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD1 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.64", "longitude": "-1.78864"}}, "title": "Community Mental health Practitioner/RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259572", "validThrough": "2020-11-20T23:59:59+0000"}