{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T09:00:43+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 6 Mental Health Practitioner to join the Home Based Treatment Team in Bolton. &lt;br /&gt;&lt;br /&gt;This is a fantastic opportunity to join an enthusiastic and dynamic community team. Home Based Treatment Team provides an ageless service to people who live in the Bolton Area. We provide an alternative to inpatient admission and support people with severe and acute mental health problems in their homes; whilst undergoing intensive treatment for their mental health needs.&lt;br /&gt;&lt;br /&gt;Candidates will be expected to work as a keyworker providing assessments and inform treatment plans for those people under the care of the Home Based Treatment Team. You will also act as a &quot;Gatekeeper&quot; where you will review requests for acute and urgent care, devising appropriate care pathways. You will be a good communicator and self-motivator who delivers high quality care. You will be expected to carry out in depth assessments in the community and at Royal Bolton Hospital and you will be expected to contribute and formulate care plans and risk management plans with a recovery focus.&lt;/p&gt;\n&lt;p&gt;We have been awarded HTAS Accreditation by the Royal Collage of Psychiatrists. We have a culture within the service of staff development and progression. We strive to be a supportive team, that is dynamic, progressive and ever evolving to ensure the care we deliver is to the highest standard.&lt;/p&gt;\n&lt;p&gt;The HBT operates over a 24hr 7 day a week period therefore night working / rota system is in required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJonathan CosgroveJob titleTeam ManagerEmail addressjonathan.cosgrove@gmmh.nhs.ukTelephone number01204 483072&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton Home Based Treatment Team, Bolton", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Home Based Treatment Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253201", "validThrough": "2020-11-17T23:59:59+0000"}