{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 -30,615"}}, "datePosted": "2020-11-03T09:57:23+0000", "description": "&lt;p&gt;&lt;span&gt;We are seeking Band 5 Staff Nurses to join our Haematology and Oncology wards at the Queen Elizabeth Hospital Birmingham. We are committed to delivering high standards of care and as part of our COVID response we are seeking to recruit staff to all our 4 wards in order that we can continue to provide the best, safest and most effective care to all cancer patients at this time of great change.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within our units we provide care and support to patients with a range of malignant and non-malignant conditions, before, during and after chemotherapy, bone marrow transplant and now also CAR-T. We are excited to be at the forefront of the most up to date and advanced treatments available in treating haematological and oncology conditions including CAR-T treatments, treating young people within our Teenage Cancer Trust Young person’s unit, and working closely with our Acute Oncology Service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our team is hard-working, enthusiastic, innovative, well-motivated and dedicated to high standards of care. There will be a wide range of educational and clinical opportunities available including chemotherapy training and competencies, experience with our clinical nurse specialists and within our day units. You will have the full support of the Ward Band 7s, Clinical Education Team, a Professional Development Sister and specialityLead Nursesto achieve your professional goals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to join an excellent nursing team and gain a wide range of experiences please apply for this exciting post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please do contact any of our unit managers for an informal chat:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Haematology/ oncology inpatients:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kiran Ali and Kim Macken: 0121 371 6257 or 0121 371 5678&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Acute Oncology inpatients and YPU:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Jo Round and Tina Dwyer: 0121 371 6295 or 0121 371 6289&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This advert will be reviewed regularly and shorlisted candiates invited to interview.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253342", "validThrough": "2021-03-01T23:59:59+0000"}