{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 £49,036 per annum"}}, "datePosted": "2020-11-03T17:00:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Post of Senior Clinical Fellow in Urology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Senior Clinical Fellow (STR3+ equivalent) in the department of Urology. This is a full time post and is required to cover a gap on the training scheme pending return of academic trainees to the region. This post is offered initially until October 2021.&lt;/p&gt;\n&lt;p&gt;Basic salary £49,036 plus additional elements for additional hours, weekend and evening working.&lt;/p&gt;\n&lt;p&gt;The Norfolk and Norwich University Hospitals NHS Foundation Trust provides a full range of acute clinical services through the Norfolk and Norwich University Hospital (1,000 beds) and Cromer and District Hospital, including more specialist services such as oncology and radiotherapy, neonatology, orthopaedics, plastic surgery, ophthalmology, rheumatology, paediatric medicine and surgery.&lt;/p&gt;\n&lt;p&gt;Our staff of over 7,000 treat more than one million patients; people from Norfolk, neighbouring counties and further afield. Our patients are referred to us by around 100 local GP practices but also from other acute hospitals and primary care trusts around the country.&lt;/p&gt;\n&lt;p&gt;As a university teaching hospital we have developed our research and development strategy in partnership with the University of East Anglia.&lt;/p&gt;\n&lt;p&gt;We also work closely with our partners on the Norwich Research Park and Norwich Radiology Academy to take forward our ambitious targets for research and development.&lt;/p&gt;\n&lt;p&gt;The department provides the full range of emergency and elective urological care with the exception of paediatric urology (undertaken by the paediatric surgeons) and the surgical treatment for advanced testis cancer (Addenbrookes). The department is supported by the full range of acute renal, radiological (including interventional radiology), oncological and pathological services.&lt;/p&gt;\n&lt;p&gt;The post is suitable for a candidate with who holds the MRCS or equivalent qualification and is ready to commence speciality training in Urology. Full GMC Registration with licence to practise is essential. The ability to operate independently and see patients without supervision is desirable&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Mr Mark Rochester, Service Director on 01603 287453.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Colney Lane, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Senior Clinical Fellow in Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254868", "validThrough": "2020-11-17T23:59:59+0000"}