{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Equivalent to AfC Band 8a"}}, "datePosted": "2020-11-05T14:41:20+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n&lt;strong&gt;About The Role&lt;/strong&gt;\n\n\n\n\n\n&lt;p&gt;Kingsway Surgery is looking for a passionate ANP or Nurse Practitioner to work on a part time permanent basis for approximately 20-25 hours per week, on a Monday - Friday basis.  We are looking for cover on a Monday &amp; Tuesday as a must and the other hours can be on any other day.&lt;/p&gt;\n&lt;p&gt;The role will include the following:&lt;/p&gt;\n&lt;p&gt;Assessment, diagnosis and treatment of minor illnesses, either via telephone / &#39;Accrux&#39; video triage consultations in order to assess whether the patient needs to be seen within the clinic face to face&lt;br /&gt;Home visits – if required&lt;br /&gt;Prescribing medication and completing referrals when required&lt;br /&gt;Working within the medicine management prescribing guidelines&lt;br /&gt;Completing QoF alerts as neeeded&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you would like to arrange an informal visit or telephone discussion please contact Janice Nightingale -&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 01245 321391 or &lt;/em&gt;&lt;em&gt;01245 328855&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the job advert earlier than stated should the right candidate be appointed.&lt;/p&gt;\n&lt;p&gt;This role is also being advertised on the Essex Primary Care Careers website – please complete only one application.&lt;/p&gt;\n\n&lt;p&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;/p&gt;\n\nNO AGENCIES PLEASE.\n \n\n\n\n\n\n\n&lt;strong&gt;About The Candidate&lt;/strong&gt;\n \n\n\n\n\n\nAs a key valued member of our nursing team :\n&lt;ul&gt;\n&lt;li&gt;You will be a Registered General Practice Nurse (currently registered with the NMC).&lt;/li&gt;\n&lt;li&gt;You will hold a recognised ANP qualification at Masters level and work as an Independent Nurse Prescriber.&lt;/li&gt;\n&lt;li&gt;You will be able to work with a high degree of autonomy and be confident in leading in a variety of settings.&lt;/li&gt;\n&lt;li&gt;Your leadership of others will also enable you to use and further develop your teaching and mentoring experience/qualifications.&lt;/li&gt;\n&lt;li&gt;You will be forward thinking and strive to develop innovative ideas and new ways of working, that address the health needs of the practice, whilst motivating and encouraging others to do the same.&lt;/li&gt;\n&lt;li&gt;As an excellent communicator and collaborator, you will embrace opportunities to work and liaise across multi-professional and agency boundaries in the interests of improving patient outcomes.&lt;/li&gt;\n&lt;li&gt;In addition to your highly developed clinical skills, your approach in the role will be consistently compassionate and respectful placing a high value on the dignity of patients, relatives, carers and colleagues.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n\n\n\n&lt;strong&gt;About Us:&lt;/strong&gt;\n&lt;strong&gt; &lt;/strong&gt;\n\n\n\n\n\n\nWe are a friendly welcoming practice in South Woodham Ferrers. \n&lt;p&gt;We operate Systmone clinical system and Arden Templates, with a history of High QOF achievement and a CQC rating of &#39;Good&#39; across all domains.&lt;/p&gt;\n\n&lt;p&gt;Supporting your work life balance and professional development is important to us, so we will be happy to discuss any requirements for flexible working and offer the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary based on experience&lt;/li&gt;\n&lt;li&gt;Supportive and friendly environment&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Peer support&lt;/li&gt;\n&lt;li&gt;CPD Support with training and development&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Woodham Ferrers", "postalCode": "CM3 5QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6534", "longitude": ".606063"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258148", "validThrough": "2020-11-30T23:59:59+0000"}