{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "38,890 - £44,503 per annum plus Outer HCAS"}}, "datePosted": "2020-10-20T09:58:08+0100", "description": "&lt;p&gt;NHS South West London Clinical Commissioning Group (CCG) is responsible for planning, commissioning and buying health services for people living and working in South West London. As a CCG, we’re a membership organisation made up of over 180 GP practices within South West London. We serve just under 1.5 million people across our six diverse boroughs: Croydon, Kingston, Merton, Richmond, Sutton and Wandsworth. We manage local healthcare budgets of over £2.3 billion and commission a range of health services on behalf of our residents.  The services that we’re responsible for include primary care (the services you receive at your GP practice), hospital treatment, rehabilitation services, urgent and emergency care, community health services, mental health and learning disability services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This Transformation Project Manager role is based in the Sutton borough which is made up of all 23 GP practices serving a population of 180,000 people across the borough of Sutton, which is responsible for the local NHS budget and making sure it is spent on the right health services for the needs of Sutton residents.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please note: applications from NHS staff in London at risk of redundancy will be given priority. &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen with NHS South West London CCG for a Transformation Project Manager, which is a new and exciting role based in Sutton, we are looking for a motivated, proactive, skilled and experienced project manager with a good eye for detail and excellent analytical skills who will be working in a matrix as part of the wider transformation team and provide support across a broad range of transformation projects/programmes in Sutton&lt;/p&gt;\n&lt;p&gt;You will have experience of ensuring projects are planned, managed and delivered effectively.  Work will be varied and will include being responsible for the quality of project documentation, providing reports to both internal and external audiences and contributing to the training and support of those new to project management.  The job description and person specification provide an outline of the tasks, responsibilities and outcomes required of the role.&lt;/p&gt;\n&lt;p&gt;Working pattern is 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Interviews for this post will be conducted online and therefore access to Microsoft Teams will be required.&lt;/p&gt;\n&lt;p&gt;No agencies or consultancies please.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South West London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128178"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Civic Centre, St Nicholas Way, Sutton, SM1 1EA", "postalCode": "SM1 1EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3616", "longitude": "-.194713"}}, "title": "Transformation Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233681", "validThrough": "2020-11-06T23:59:59+0000"}