{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51828", "minValue": "31997", "unitText": "YEAR", "value": "£31,997 - £51,828"}}, "datePosted": "2020-10-27T16:21:21+0000", "description": "&lt;p&gt;&lt;span&gt;Applications are invited for vacancies in the Psychiatry training programme at CT1/ST1* level across deaneries/HEE Local Offices in England, Northern Ireland, Scotland and Wales starting from August 2021. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that applicants wishing to apply for Core Psychiatry posts in Northern Irelandmust apply via the single National vacancy in Oriel II and that for 2021 there is no separate vacancy in Oriel II for Northern Ireland posts.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;*Health Education England, in conjunction with the Royal College of Psychiatry, are continuing to run a pilot scheme for ST1 run through training in Child and Adolescent Psychiatry for posts commencing from August 2021.The recruitment process for both specialties is integrated into a single application and interview process. Applicants will only be required to submit a single application (Core Psychiatry), which will cover both specialties. Applicants will be able to preference all available posts in both specialties, subject to availability but will attend a single MSRA test (subject to COVID-19 arrangements) with results counting towards both specialties.&lt;/p&gt;\n&lt;p&gt;NB. Due to COVID-19 restrictions there will be no face to face or other form of interviews for this recruitment round, with applicant ranking based on MSRA test results only.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The number and location of available posts will be published on the Health Education England (North West) web site and will be updated throughout the recruitment round, should changes occur. Please keep up to date with these during the recruitment round. NB. There may be a possibility that certain regions have no vacancies to declare by the end of the recruitment process.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note the following NHS Employers pay scales will apply (&lt;em&gt;subject to change&lt;/em&gt;):&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Posts in England - £38,694 - 49,036&lt;/li&gt;\n&lt;li&gt;Posts in Northern Ireland - £31,997 - £50,312&lt;/li&gt;\n&lt;li&gt;Posts in Scotland - £32,961 - £51,828&lt;/li&gt;\n&lt;li&gt;Posts in Wales - £32,000 - £50,315&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Multi Specialty Recruitment Assessment will take place between Thursday 28th Januaryand Friday 12th February 2021. &lt;strong&gt;ALL&lt;/strong&gt; eligible applicants will be required to sit the &lt;/span&gt;&lt;span&gt;Multi Specialty Recruitment Assessment. Eligible applicants will be invited to book their MSRA test slot during the recruitment pocess, following the timetabled completion of longlisting (by 8th December 2020).&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The application window opens on Monday 5th November&lt;/span&gt;&lt;span&gt; 2020 at 10:00 UK time and closes on Tuesday 1st December&lt;/span&gt;&lt;span&gt; 2020 at 16:00 UK time. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must apply via our online recruitment system, Oriel II. Oriel II can be accessed from the link provided. Registration is available to applicants prior to the application window opening. Please note that Oriel I is still active at present during the tranisition period to Oriel II but this vacancy and respective application process may only be found in Oriel II.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Specialty Training website which can be accessed from Oriel II. Please visit the Health Education England North West Local Office website (contact details can be accessed from Oriel) to find out the following information:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Indicative number of vacancies&lt;/li&gt;\n&lt;li&gt;Likely locations of posts within the training programme&lt;/li&gt;\n&lt;li&gt;Expected rotation details&lt;/li&gt;\n&lt;li&gt;Anticipated outcome of the training programme, subject to satisfactory progression&lt;/li&gt;\n&lt;li&gt;Travel and relocation expenses policy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Eligibility Criteria for recruitment to Specialty Training 2021 – Immigration Requirements &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Before you can take up a CT1/ST1* Psychiatry training post, you will need to demonstrate that you are eligible to legally work in the UK.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Core Psychiatry and ST1 Child &amp; Adolescent Psychiatry training are both on the Home Office list of Shortage Occupations meaning that for applicants requiring a Tier 2 visa the Resident Labour Market does not need to be met for these specialties.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Evidence of immigration status should normally consist of a biometric residence card and date stamped passport. For further details on eligibility to work in the UK, please visit the UK Visas and Immigration website (formerly UK Border Agency) website or see the 2021 guidance for Overseas Applicants on the Specialty Training website.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Western Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Northern Ireland, Scotland, Wales", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Core Trainee in Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245395", "validThrough": "2020-12-01T23:59:59+0000"}