{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-27T13:40:52+0000", "description": "&lt;p&gt;Have you always wanted to join a focussed team – one that is professional, caring and shares a collective sense of purpose? Then look no further, come and join us. We are currently seeking enthusiastic and caring Registered Nurses, either experienced or newly qualified, or those currently working outside the NHS, to come and work for the Trust.&lt;/p&gt;\n&lt;p&gt;The Mid Yorkshire Hospitals NHS Trust is a fantastic place to work, Adele is a nurse who returned to the NHS and says “My manager is fantastic and I have made some life-long friends in my new job.” Our focus on quality care and patient experience is our top priority, based on our Trust values of high standards, caring, respect and improving. If you have excellent communication skills, plenty of enthusiasm and are able to undertake flexible working, you will be a welcome addition to our friendly and experienced nursing team.&lt;/p&gt;\n&lt;p&gt;If you make the right decision and come to join us we will support you with a 5 day nurse induction programme and Senior Nurse buddy to support you in ensuring you get off to a flying start in your career at Mid Yorkshire Hospitals. We will also support your development by releasing you to attend our new Skills in Professional Practice Programme, which is supported by a band 5 fundamental patient care competency framework to ensure your skills and knowledge are recognised.&lt;/p&gt;\n&lt;p&gt;Additionally, if you are looking to join us from outside the NHS, we will provide you with all the training and personal development you require to work in an NHS setting, including enrolment to our tailor made Induction Programme, specifically aimed at up-skilling Registered Nurses with an NMC PIN currently working outside of the NHS.&lt;/p&gt;\n&lt;p&gt;Vacancies are available across the Divisions of Medicine and Surgery; if you would like to discuss these further, please contact Charlene Pressley, Matron for Staffing, on 07795496072.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield/Dewsbury/Pontefract", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244764", "validThrough": "2020-11-15T23:59:59+0000"}