{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33660", "minValue": "33660", "unitText": "YEAR", "value": "Up to £33,660 FTE - dependent on experience"}}, "datePosted": "2020-11-01T03:50:08+0000", "description": "&lt;h2&gt;&lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified Nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skill, we want to meet you!&lt;br /&gt;&lt;br /&gt;HMP Oakwood is the largest prison in Europe, holding 2106 Category C male offenders. HMP Oakwood’s large modern healthcare facilities enable us to deliver “Exceptional Care” to our patient group. We provide a range of both physical and psychosocial health care service, including long term conditions, primary care, wound care, sexual health, mental health services, substance misuse, social care and pharmacy.&lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;Then a role in this progressive prison healthcare environment may well be for you.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Interested in development?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;We offer opportunities to develop in to a specialist role of your interest which in turn benefits the service. Examples include ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;br /&gt;&lt;br /&gt;Previous experience in district or practice nursing, surgical/medical and/or A&amp;E would be highly desirable.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;As a Registered Adult Nurse you will be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. You could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency calls and potentially being the first person to attend an emergency.&lt;br /&gt;&lt;br /&gt;You’ll receive an annual salary of up to £33,660 FTE, depending on experience; free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;The role will involve shift work over a 7-day period to include weekends and Bank holidays.&lt;br /&gt;&lt;br /&gt;We offer 25-days annual leave plus 8 public holidays (pro-rata for part time) and contributory pension scheme.&lt;br /&gt;&lt;br /&gt;We also offer CPD, revalidation support, free online and face to face training, regional/national opportunities, cycle to work scheme and online discounts.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Oakwood include access to an onsite gym, free parking and subsidised café/restaurant.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;How will we support you in your employment?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;• Bespoke induction&lt;br /&gt;• Competency framework&lt;br /&gt;• Preceptorship (newly qualified practitioners)&lt;br /&gt;• Regular clinical supervision&lt;br /&gt;• Supported development into specialities such as diabetes or asthma&lt;br /&gt;• Regional and national career development opportunities&lt;br /&gt;• Our bespoke Learning Management System to address your learning needs&lt;br /&gt;• Support from the wider team&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by our Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Oakwood if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Please note that this role is subject to Practice Plus Group UK Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities. Full time and part time opportunities will be considered for all of the above posts.&lt;br /&gt;&lt;br /&gt;Note that shifts patterns for all of the posts, will involve shift work, working over- 7-day rota which will include weekends and Bank holidays.&lt;br /&gt;&lt;br /&gt;We also offer the opportunity for informal visits and shadow shifts on site to experience the environment prior to any offers of employment post interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV10 7QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6429", "longitude": "-2.08824"}}, "title": "Primary Care Nurse  - HMP Oakwood", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251158", "validThrough": "2020-11-17T23:59:59+0000"}