{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-29T10:46:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) invites applications for the post of Highly Specialised Clinical Psychologist (band 8a) for the ADHD Service for Adults– 15 hours per week (0.4 wte)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust, a designated Cambridge University Teaching Trust, provides comprehensive mental health and community services to the people of Cambridgeshire and Peterborough. CPFT is aligned with the University of Cambridge Department of Psychiatry which is internationally recognised as a 5* leading centre for research. The trust also hosts the trainees for the UEA Doctoral Programme in Clinical Psychology and is active in teaching, examination and supervision of trainees.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Highly Specialised Clinical Psychologist to join our well established ADHD service for adults. The post is for 2 days per week and it is anticipated that the post holder may have other funded commitments within the trust or University Department but applicants without such commitments are also welcome.&lt;/p&gt;\n&lt;p&gt;Depending on the interests of the post-holder there are excellent opportunities to be involved in clinical diagnostic assessments, report writing, service evaluation, clinical audit and developing post diagnostic interventions. Whilst the post is part-time, there are opportunities for professional development within a highly specialist service in an exciting developing field.&lt;/p&gt;\n&lt;p&gt;Applicants must have a doctoral level training in clinical psychology from a UK university or equivalence if studies were outside the UK and experience of working as a clinical psychologist with service users presenting with highly complex difficulties.&lt;/p&gt;\n&lt;p&gt;As part of the selection process you will be required to undergo a Criminal Records Bureau check.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Michael Kasese, ADHD Team Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Michael.Kasese@cpft.nhs.uk / 01223 219674&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;or &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Deborah Hunt, Directorate Lead psychologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Deborah.Hunt@cpft.nhs.uk / 07538 449514&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adult ADHD Assessment Clinic, Chitra Sethia Autism Centre, Cambridge", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "Highly Specialised Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247960", "validThrough": "2020-11-11T23:59:59+0000"}