{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17222", "minValue": "16195", "unitText": "YEAR", "value": "£16,195/ £17,222 (over 25) pro rata fixed point"}}, "datePosted": "2020-10-29T13:25:21+0000", "description": "&lt;p&gt;CARE PLUS GROUP&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Cambridge Park&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy based at Cambridge Park, Peterhouse Road, Grimsby, DN34 5UX&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reference Number: 814-20-204&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Recovery Worker (Support Worker)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Various posts available working 37.5, 30 or 22.5 hours per week to meet rota requirements &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be required to work a rota pattern which includes weekends and Bank Holidays&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range 2 £16,195 (under 25)/ £17,222 (over 25) pro rata per annum&lt;/strong&gt; &lt;strong&gt;fixed salary point&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Care Plus Group is a Social Enterprise established since 2011 to deliver community healthcare services following the national separation of provider services from the commissioning arm of the local NHS. One of our core values is that staff and patients are integral to everything we do. As part of this all staff employed by Care Plus Group automatically become members of the Group which means you will be able to give your views and vote on important issues for the organisation. We welcome your application to join us.&lt;/p&gt;\n&lt;p&gt;Would you like the opportunity to truly use your skills and make a real difference to people’s lives? Cambridge Park is our Enhanced Recovery service which provides Rehabilitation and Re-ablement opportunities for adults in North East Lincolnshire. The service will promote faster recovery from illness, prevent unnecessary acute hospital admissions and premature admissions to long-term care, support timely discharge from hospital and maximise independent living wherever possible.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to work within Cambridge Park and across the Intermediate Tier. We deliver short term interventions to support individuals to remain in a community or home setting, concentrating on crisis intervention, hospital and long term care avoidance and timely discharge from hospital. The focus of the Intermediate Tier is on the promotion of independence, re enablement and health well-being.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, motivated and committed individuals to join a multi professional team. You need to enjoy working with people to support them to regain or maintain their previous levels of independence. You must have an appropriate qualification, eg NVQ/QCF 2 in health or social care or any equivalent qualifications, Level 2 Literacy, numeracy and IT or equivalent level or competence along with at least one year’s experience working in a health and or social care setting providing personal care support to individuals.&lt;/p&gt;\n&lt;p&gt;The requirements for this post include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An understanding of the principles of Intermediate Care.&lt;/li&gt;\n&lt;li&gt;An understanding of the focus of rehabilitation and re-ablement.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills.&lt;/li&gt;\n&lt;li&gt;An understanding of the needs of adults over the age of 18.&lt;/li&gt;\n&lt;li&gt;An understanding of promoting independence.&lt;/li&gt;\n&lt;li&gt;The ability to work effectively as part of a team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you possess strong core values and a commitment to the work we do at Cambridge Park we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further information and an informal discussion please contact &lt;strong&gt;Jay Sadler &lt;/strong&gt;on telephone number&lt;strong&gt; 01472 256767&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interviews will take place on 16th &amp; 17th November 2020.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for more information, and the criteria required to fulfil the role.&lt;/p&gt;\n&lt;p&gt;Please note that any offer of a post is subject to pre-employment screening. The offer will also be provisional upon receipt of a satisfactory &lt;strong&gt;Enhanced &lt;/strong&gt;DBS check, of which the successful candidate will be responsible for payment.&lt;/p&gt;\n&lt;p&gt;We offer favourable terms and conditions including optional membership to a contributory pension scheme, lease cars, a full induction programme and CPD opportunities. We have Independent Provider closed access to the NHS pension scheme, for further details about eligibility please contact us.&lt;/p&gt;\n&lt;p&gt;Care Plus Group will interview all disabled candidates who meet the minimum criteria for any job vacancy.&lt;/p&gt;\n&lt;p&gt;Please note that if you have not heard from us within 6 weeks of the closing date we regret that you have not been short listed on this occasion.&lt;/p&gt;\n&lt;p&gt;Care Plus Group is an equal opportunities employer. It is our Policy to provide and ensure equal opportunities in the fields of recruitment, employment, training, promotion and job security irrespective of any characteristics which may place an applicant in any minority or disadvantaged group or groups.&lt;/p&gt;\n&lt;p&gt;We are committed to safeguarding the welfare of vulnerable adults and expect the same commitment from all staff and volunteers.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 7DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5743", "longitude": "-.071666"}}, "title": "Recovery Worker (Support Worker)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248498", "validThrough": "2020-11-12T23:59:59+0000"}