{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20172", "minValue": "20172", "unitText": "YEAR", "value": "£12 per hour plus unsocial hours benefits"}}, "datePosted": "2020-10-05T11:02:45+0100", "description": "&lt;p&gt;Are you an outgoing, friendly and empathetic Healthcare Assistant with the confidence and experience to work independently with children with complex medical needs? Do you enjoy helping multiple families – building rapport and trusted relationships with each? Are you reliable, punctual and adaptable? If so, this could be the role for you.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for our bank and are looking for Healthcare Assistants to work across both our growing Hospice at Home (outreach) service and our established Residential care service. As a Healthcare Assistant, you will provide a high level of respite care to children and young people in the hospice and in their own home. Working in partnership with the multi-disciplinary team and parents/carers you will initiate and organise play/art activities for the children on your caseload. You will also support the children with daily living activities in accordance with their care plan. Working with a variety of different families, you will need to engage and communicate in ways that are sensitive to differing cultural needs&lt;/p&gt;\n&lt;p&gt;We’re looking for people who have experience of working with children with complex medical needs, including children who are tracheostomy ventilated, and have previous experience of medicine administration. Being trained in basic life support is an advantage and we are looking for people who are confident in risk assessing. The ability to communicate and interact with children in a variety of ways, including through play, is vital, as well as fluent spoken and written English. If using your own car to travel to our families’ homes you must have your own business insurance for your car – business mileage will be reimbursed.&lt;/p&gt;\n&lt;p&gt;Please click apply to complete your application and supporting statement outlining why you would suit the role and would love to work with us.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130176.png", "name": "Richard House Children's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130176"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East London", "postalCode": "E16 3RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.51", "longitude": ".042405"}}, "title": "Bank Healthcare Assistants", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212328", "validThrough": "2020-11-30T23:59:59+0000"}