{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T09:00:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Fixed term post: 15 months term – up to 37.5 hours per week (job share/part-time applications also welcome)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: AFC Band 6 (or 5 to 6 progression, depending on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to a maternity leave in the service, we have a fixed term post available within the South Tees Nutrition and Dietetic Service Oncology Team. This is an ideal opportunity for a proficient Band 5 / Band 6 wishing to gain further experience, before deciding which career pathway they wish to pursue. You must have HCPC registration and have clinical experience as a Dietitian working in the NHS.&lt;/p&gt;\n&lt;p&gt;The postholder, working with the wider team, will have the opportunity to gain experience across the Oncology and Haematology wards, assisting with outpatient caseload management within Oncology, Radiotherapy and Chemotherapy and also within the specialities of Head and Neck and Upper GI Cancer. Depending on previous experience you will also have the opportunity to develop skills further within enteral and parenteral nutrition. You will be given supervision and support from experienced Dietitians in your clinical area. You will work actively with the team to continue to explore innovative ways of delivering our service to our patient group, within the continuing challenges of COVID-19.&lt;br /&gt;&lt;br /&gt;The post holder will be based at the James Cook University Hospital in Middlesbrough. The Dietetic service covers the James Cook University Hospital, Middlesbrough, the Middlesbrough, Redcar and Cleveland community locality, Friarage Hospital, Northallerton and Hambleton &amp; Richmond community locality.&lt;/p&gt;\n&lt;p&gt;The post will also involve education of dietetic students and other health care professional and support workers. We have been Base Trainers for student dietitians for a number of years, currently taking A, B and C placement students. Continual Professional Development is actively encouraged, as is participation in audit and evidence based practice.&lt;/p&gt;\n&lt;p&gt;Our office bases have an ideal location within easy reach of the picturesque East Coast, North Yorkshire Moors and mainline train route to Scotland, and popular cities of Newcastle, Durham, York and Leeds.&lt;/p&gt;\n&lt;p&gt;Accommodation is available on site.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Interview date: Interviews will be held by video-call during week of 16th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Georgia Payne (Head of Dietetics and Adult Speech Therapy)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: georgia.payne@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 01642 854777&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Senior Specialist Dietitian (Oncology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245775", "validThrough": "2020-11-08T23:59:59+0000"}