{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-29T13:13:15+0000", "description": "&lt;p&gt;Do you want to be part of a team where your voice really matters and everyone is equal?&lt;/p&gt;\n&lt;p&gt;Whether you are seeking a 1st post after completing training or you are an established consultant seeking a new challenge, we have your perfect role. We are a diverse group of Consultants with many special interests and new colleagues are actively supported to develop or expand their area of specialist interest through personalised, flexible job plans.&lt;/p&gt;\n&lt;p&gt;Successful applicants will work as part of a group of 24 ED Consultants on a 21 whole time equivalent rota to provide senior medical staff on site presence 08:00-23:00 with weekend working one in seven weekends.&lt;/p&gt;\n&lt;p&gt;The team works equally across 2 sites, with Pinderfields being our Major ED and designated Major Trauma Unit. Both Dewsbury and Pinderfields have 24/7 separate dedicated children’s EDs.&lt;/p&gt;\n&lt;p&gt;Every one of our 8000 staff at the Mid Yorkshire Hospitals NHS Trust plays a vital role in providing quality care to thousands of people living across Wakefield and North Kirklees each year.&lt;/p&gt;\n&lt;p&gt;We’re proud that our workforce - our greatest asset - strives for excellence every day in providing care and support to those who use our services. Mid-Yorkshire celebrates excellence and innovation. We have modern, state-of-the-art facilities and provide first class learning and development opportunities. Mid-Yorks is transforming, grounded in our values to care and improve, respecting our patients, our community and our staff, to deliver the highest standards of care.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic, innovative and forward-thinking clinician with a passion for your profession and an enthusiasm to be part of a Trust striving to be the best, get in touch to see what a career at Mid-Yorkshire could be like for you.&lt;/p&gt;\n&lt;p&gt;Applicants should possess, or be within 6 months of receiving a CCT at the time of the advisory appointments committee.&lt;/p&gt;\n&lt;p&gt;The appointment will be on the basis of the new consultant contract laid down by the Hospital Medical and Dental Staff Terms and Conditions of Service and will be remunerated as appropriate on the salary scale £79,860 - £107,668 per annum.&lt;/p&gt;\n&lt;p&gt;Should applicants be currently or recently employed in a medical capacity the Mid Yorkshire Hospitals NHS Trust reserves the right to request a reference from the Medical Director and/or Responsible Officer of any previous or current employing organisations.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "CONSULTANT IN EMERGENCY MEDICINE (POST 1)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248460", "validThrough": "2020-11-27T23:59:59+0000"}