{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-11-06T12:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Research Nurse - Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; St Mary’s Hospital Newborn Intensive Care Unit Managed Clinical Service&lt;/strong&gt;&lt;strong&gt; Research Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in an exciting career in clinical research?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is one of the largest acute Trusts in the UK, employing over 20,000 staff.&lt;/p&gt;\n&lt;p&gt;We are responsible for running a family of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;We are the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;Our vision is to improve the health and quality of life of our diverse population by building an organisation that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excels in quality, safety, patient experience, research, innovation and teaching&lt;/li&gt;\n&lt;li&gt;Attracts, develops and retains great people&lt;/li&gt;\n&lt;li&gt;Is recognised internationally as a leading healthcare provider&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Clinical research at MFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our MFT Research and Innovation strives to be at the forefront of R&amp;I in UK healthcare. We are dedicated to driving continuous improvement in the care our patients receive through clinical research. We support over 300 principal investigators undertake research across a diverse range of clinical areas, with more than 800 active studies, involving 15,000 patients, deliver improved diagnostics, treatments and devices for patients in Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a part time (22.5 hours/3 days per week) Band 6 Senior Clinical Research Nurse to coordinate and deliver clinical research studies at St Mary’s Hospital Newborn Intensive Care Unit Managed Clinical Service (MCS) at Manchester University Hospitals NHS Foundation Trust (MFT).&lt;/p&gt;\n&lt;p&gt;If you are committed to providing high quality care to patients and help parents to make the right decisions about their treatment options, with the skills to guide and advise them throughout their research journey, this role could be for you.&lt;/p&gt;\n&lt;p&gt;You’ll be joining an award-winning and diverse team of experts at MFT who are making a difference to the future of care in the NHS by asking questions and finding out the answers.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic individual who is capable of contributing to the development of research within our collaborative research team. The Team facilitates and supports the delivery of research within newborn intensive care delivering a wide variety of studies, some in collaboration with other specialities such as genetics, paediatrics and maternity services and as our portfolio grows will include cross site working.&lt;/p&gt;\n&lt;p&gt;You will take a proactive approach in managing clinical research studies including developing study procedures and practice, gaining consent and approvals and recruiting patients, alongside clinical duties including providing the highest quality patient care and collecting and processing samples.&lt;/p&gt;\n&lt;p&gt;You will be instrumental in implementing study objectives and will provide dedicated support to ensure that studies are delivered to time and target. You will be the main point of contact for study principal investigators, sponsors and patients and so effective communication and team working skills are essential. You will be involved in ensuring that research undertaken at MFT safeguards the well-being of patients and is undertaken within ICH Good Clinical Practice Guidelines. You will also have opportunities to showcase your work and will at all times be an ambassador of research at MFT, at internal and external events.&lt;/p&gt;\n&lt;p&gt;Prior clinical research nursing experience is not essential, but advantageous. You will be educated to a degree level or equivalent experience; you will have First Level registration RN, experience of neonatal intensive care nursing, be qualified in speciality and possess people management skills.&lt;/p&gt;\n&lt;p&gt;Comprehensive training and an induction programme will be provided for successful candidates. We will also ensure that you have tailored, individual personal development plans with support for further training. Opportunities for developing new research and clinical skills are available and actively encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola BoothJob titleClinical Research Nurse Manager/Newborn ServicesEmail addressnicola.booth@mft.nhs.ukTelephone number01617010083Additional contact information&lt;/p&gt;\n&lt;p&gt;Interested candidates are invited to contact Nicola Booth to discuss the role and hours in further detail.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary’s Hospital Newborn Intensive Care Unit Managed Clinical Service, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Senior Clinical Research Nurse, Newborn Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259619", "validThrough": "2020-11-19T23:59:59+0000"}