{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-03T18:00:27+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, you’re eager to learn more about Registered Nurse opportunities within our Respiratory team at North Bristol NHS Trust. Here are some of the reasons we’re unique… &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our trust is a Regional Severe Asthma Centre; the rapidly expanding biologics service offers innovative biologic treatment which in many cases is life changing for our patients.&lt;/li&gt;\n&lt;li&gt;We are passionate about staff development; we can support those new to the speciality with a structured program, providing teaching in (but not limited to) Non-invasive ventilation, AIRVO, Chest drains (standard and digital) &amp; pleurodesis, Tracheostomy management, ILS, ABG sampling and interpretation and Infectious disease management (including Viral Haemorrhagic Fever, malaria and tuberculosis).&lt;/li&gt;\n&lt;li&gt;We care for patients with a range of Respiratory conditions, including HDU and palliative care. Of our 32 beds, 4 are specifically high dependency beds and are used for critically unwell patients who need close monitoring. These patients can be transfers from Intensive Care who may need temporary assistance with their breathing or complex intravenous infusions.&lt;/li&gt;\n&lt;li&gt;Our Respiratory Specialist Team were shortlisted for an Exceptional Healthcare Award in 2018 for a ‘Team of the Year’ award. The Respiratory Specialist Team is comprised of nurses, physiotherapists, physiotherapy technicians and administrators.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;But it’s not just our nursing teams which are impressive; our trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and well-being initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our staff don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations.&lt;/li&gt;\n&lt;li&gt;Staff are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Registered Nurse working in Respiratory, ready for the next challenge?&lt;/li&gt;\n&lt;li&gt;An experienced Registered nurse, excited at the prospect of exploring a new specialty?&lt;/li&gt;\n&lt;li&gt;A newly qualified/qualifying nurse ready to take the leap from theory to the clinical setting, supported by a structured preceptorship and inspirational team?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, are we right for each other? Here are your next steps…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into life at North Bristol NHS Trust (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email: Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Phone: 01174 144 550&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse- Respiratory- Band 5 (Experienced and Newly Qualifyi", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254976", "validThrough": "2020-12-13T23:59:59+0000"}