{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inclusive"}}, "datePosted": "2020-10-31T13:45:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Across Site&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an excellent opportunity for an experienced Business Partner to join our People &amp; Organisational Development Directorate.&lt;/p&gt;\n&lt;p&gt;Working closely with the Divisional team and other key individuals the People and OD BP will support all aspects of work associated with the forward planning, modernisation, engagement, motivation and performance of the workforce. In addition the post holder will embed workforce and OD best practice; improving standards and increasing management capability within the division. &quot;&lt;/p&gt;\n&lt;p&gt;Motivated and driven, the postholder will be a leader within the People &amp; OD team and work closely with others across the functions. We are looking for an individual who will be part of taking our team forward, devising improvements and building strong business partner relationships.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to develop within a challenging but supportive environment.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6 months probationary period. This will give new staff members an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Department on 01708 435000 ext. 3861. Further details regarding the post may be obtained by contacting the manager as per the contact details below.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSamantha SmithJob titleHead of People and OD Business PartneringEmail addresssamantha.smith31@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 8a People and OD Business Partner (Pending Banding Approval)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251140", "validThrough": "2020-11-15T23:59:59+0000"}