{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £43,772"}}, "datePosted": "2020-10-26T09:30:45+0000", "description": "&lt;p&gt;Band 7 – Sonographer – Diagnostic Imaging Department&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit enthusiastic, motivated, full time band 7 sonographers to join our busy, friendly Ultrasound team at Kettering General Hospital NHS Foundation Trust. We provide a comprehensive (mainly non-obstetric) ultrasound service to a wide range of specialities within the hospital and local GP’s.&lt;/p&gt;\n&lt;p&gt;Kettering General Hospital provides acute health care services to an ever growing population of around 280,000 in North Northamptonshire, South Leicestershire and Rutland. Our main services are delivered from our main site and satellite outpatient facilities at three neighbouring units.&lt;/p&gt;\n&lt;p&gt;As an employer of over 4000 staff, we are one of the biggest employers in Northamptonshire.&lt;/p&gt;\n&lt;p&gt;We are looking for suitable candidate to support with a range of general abdominal, small parts, musculoskeletal and vascular (preferred not essential) services. You will be expected to work independently, however support from other sonographers is always available and encouraged.&lt;/p&gt;\n&lt;p&gt;You must be highly competent and keen to contribute towards efficient service delivery and excellent patient care.&lt;/p&gt;\n&lt;p&gt;You must hold a UK recognised Pg. Diploma or Pg. Certificate in Medical Ultrasound and be state registered with HCPC.&lt;/p&gt;\n&lt;p&gt;Join us and you will be part of a community that recognises your contribution.&lt;/p&gt;\n&lt;p&gt;For further information please email Dr K Lakhani (PhD) Lead Sonographer on klakhani@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please email Dr K Lakhani (PhD) Lead Sonographer on klakhani@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital NHS Foundation Trust, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241849", "validThrough": "2020-11-09T23:59:59+0000"}