{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 p.a. inc. HCAS"}}, "datePosted": "2020-11-04T12:31:29+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Have you got experience of working in health or social care and looking for the next challenge?&lt;/p&gt;\n&lt;p&gt;If so, we would love to hear from you!&lt;br /&gt;&lt;br /&gt;We have an exciting opportunity for someone with experience of providing rehabilitation and social care in client’s own home, to join the newly commissioned Bridging Care and Rehabilitation Service.&lt;br /&gt;The service is designed to provide short term packages of care and some rehabilitation in order to:&lt;br /&gt;-Facilitate timely safe discharge from acute hospital care&lt;br /&gt;-Help prevent unnecessary admissions to care homes&lt;br /&gt;-Help prevent unnecessary hospital admissions&lt;br /&gt;-Help to regain confidence with living skills or support with long term care needs until such time a Social Services / private package of care can commence.&lt;br /&gt;-Promote a reablement and rehabilitation approach to care to enable patient to regain a level of independence.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will assist clients in a range of daily living tasks, for example with transfers, mobility, washing and dressing, toileting, household tasks, meal preparation.In this role you will always work to a rehabilitation philosophy enabling clients to be as independent as possible.&lt;/p&gt;\n&lt;p&gt;You will need to have an understanding of the needs of the client group and be able to work flexibly between the hours of 07:00 and 21:00 seven days a week (on a rota) in order to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;You will demonstrate a commitment to collaborative working and actively support and liaise with other health and social care professionals and agencies.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff)&lt;br /&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;br /&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;br /&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;br /&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;br /&gt;&lt;strong&gt;High Cost Area Supplement – London&lt;/strong&gt;&lt;br /&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NameEllen CampbellJob titleSenior Occupational TherapistEmail addressellen.campbell@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbury Unit, Leytonstone", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Bridging Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255857", "validThrough": "2020-11-12T23:59:59+0000"}