{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-10-30T15:41:31+0000", "description": "&lt;p&gt;&lt;span&gt;As part of a service wide re-structuring of the Imaging Department at University Hospitals Birmingham NHS Foundation Trust (UHB) we are looking for Imaging Modality Managers to be responsible for the following modalities:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;·&lt;/span&gt;&lt;span&gt;&lt;span&gt; Diagnostic Radiology - DR&lt;br /&gt; &lt;/span&gt;·&lt;/span&gt;&lt;span&gt;&lt;span&gt; Magnetic Resonance Imaging - MRI&lt;br /&gt; &lt;/span&gt;·&lt;/span&gt;&lt;span&gt;&lt;span&gt; Ultrasound - US&lt;br /&gt; &lt;strong&gt;Please clearly indicate on your application the post you are applying for.&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; These posts will support the Heads of Imaging and General Manager in the delivery of services across 5 sites - Birmingham Heartlands Hospital, Queen Elizabeth Hospital Birmingham, Solihull Hospital, Good Hope Hospital and Community Services.&lt;br /&gt; UHB Imaging undertakes in excess of 900,000 examinations per year including all aspects of diagnostic and interventional radiology, with a workforce of more than 800 Radiology staff. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; Successful candidates will provide ‘day to day’ leadership of their designated modality across all sites. You will ensure Imaging is providing consistent, effective and efficient pathways to the service users. You will have oversight of issues relating to workforce, equipment, capacity, activity and Key Performance Indicators. Travelling between sites as appropriate is a requirement of this role, to ensure staff and departments are supported.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; You will be a member of the Senior Management Team and provide representation at departmental and divisional meetings as designated by the Head of Imaging or General Manager. You will be responsible for HR duties within your leadership team including rota’s, sickness management and appraisals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; As an Imaging Modality Manager, you will be responsible for elements of governance within your modality area, including Health &amp; Safety, Risk and Quality. You will provide data and documentation to support audit, accreditation and any requirements for government bodies e.g. NHSi.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; We are looking for an established Imaging Manager with experience of working across a large organisation, providing leadership and management to a number of different staff groups. You will be experienced in HR and associated policies and procedures relating to this. The candidate should possess excellent interpersonal skills that can influence, coach and facilitate challenging situations. Applications from candidates with a proven track record of delivery are encouraged.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Imaging Modality Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250789", "validThrough": "2020-11-27T23:59:59+0000"}