{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum"}}, "datePosted": "2020-10-29T17:01:13+0000", "description": "&lt;p&gt;We currently have an exciting opportunity for the post of Clinical Psychologist within the tertiary Paediatrics Diabetes Service as part of the Paediatric Endocrine Service, based at the Royal London Childrens Hospital, Whitechapel. The post holder will join an 8a psychologist currently working in the diabetes service and work within a wider Paediatric Liaison Team at the Royal London Childrens Hospital.&lt;/p&gt;\n&lt;p&gt;The appointment is at a band 7 and suitable for recently qualified Clinical Psychologists or clinical psychologists currently working at Band 7 and seeking to work in paediatrics.&lt;/p&gt;\n&lt;p&gt;The diabetes service currently cares for around 580 children and young people with diabetes across East London. The diabetes paediatric patients are also cared for within the paediatric medical beds.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide highly specialist psychological intervention to children who have diabetes and their families as well as offering specialist advice and consultation on the children and young peoples psychological care to non-psychologist colleagues and to other, non-professional carers. In addition, there will be opportunity to work with children with other endocrine conditions. The post will offer psychological intervention across all 3 sites including Newham and Whipps Cross Hospitals.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual who has excellent skills in communication, an interest in paediatrics and physical health, an enthusiasm for multidisciplinary work and an interest in developing effective, innovative, efficient services with good quality outcomes for children, young people and families.&lt;/p&gt;\n&lt;p&gt;Please note that the post will require Face to Face working in out-patient and in-patient settings. Given the current COVID-19 Pandemic a balance of working remotely and on hospital sites is needed. If at all possible visiting The Royal London Childrens Hospital is recommended.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kate Blakeley&lt;br /&gt;Email address: k.blakeley@nhs.net&lt;br /&gt;Telephone number: 020 3594 0407&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Romford", "postalCode": "RM6 4PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.572", "longitude": ".115805"}}, "title": "Paediatric Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249179", "validThrough": "2020-11-15T23:59:59+0000"}