{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-05T15:16:14+0000", "description": "&lt;p&gt;NHS England &amp; Improvement in the East of England are committed to addressing health inequalities across our region. Our focus is the identification of unwarranted variation in care and outcomes for our population and supporting commissioners, providers, local authorities and Sustainability and Transformation Partnerships to develop and deliver integrated evidence based improvement programmes to address this.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with a passion for improvement to join our friendly and innovative Outpatient Transformation team. The Outpatients Transformation Programme is a national programme responsible for delivering the NHS Long Term Plan priority on redesigning services and patient pathways to improve patient outcomes, experience and quality of care and reducing face to face outpatient attendances by a third over the next 5 years.&lt;/p&gt;\n&lt;p&gt;As an Outpatient Transformation Delivery Partner, the post holder will work as part of a dynamic team in the East of England region, embedded in local systems to support managers and staff to deliver outpatient transformation.&lt;/p&gt;\n&lt;p&gt;The post holder will be allocated to one of the six STP geographical areas within the East of England: Cambridgeshire &amp; Peterborough; Norfolk &amp; Waveney; Suffolk &amp; North East Essex; Mid &amp; South Essex; Bedfordshire, Luton &amp; Milton Keynes; and Hertfordshire &amp; West Essex&lt;/p&gt;\n&lt;p&gt;You will work in partnership with one system, spending 4 days a week working directly with their teams supporting their outpatient redesign programme, identifying opportunities for transformation and supporting the implementation of best practice to deliver the objectives of the National Outpatient Transformation programme. The remaining day will be spent with your regional colleagues reviewing progress and sharing learning.&lt;/p&gt;\n&lt;p&gt;Given the level of ambition in the NHS Long Term Plan, and that this is a newly established programme, we are looking for a fast-paced, flexible and dynamic team who are passionate about improving the care millions of patients receive every year.&lt;/p&gt;\n&lt;p&gt;If you would like to learn more about this exciting position please contact Chris McNicholas - Assistant Director Of Programmes for NHS England and Improvement, East of England at chris.mcnicholas@nhs.net or Emma Nicol, Associate Programme Director for Hertfordshire and West Essex Integrated Care System emma.nicol@nhs.net.&lt;/p&gt;\n&lt;p&gt;Please note that we have limited the number of applications, therefore we recommend interested candidates submit their application as soon as possible.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Chris McNicholas&lt;/p&gt;\n&lt;p&gt;Job title: Assistant Director of Programmes&lt;/p&gt;\n&lt;p&gt;Email address: chris.mcnicholas@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fulbourn", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Outpatient Transformation Delivery Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258293", "validThrough": "2020-11-19T23:59:59+0000"}