{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-28T13:01:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Musculoskeletal Band 6 Physiotherapist Vacancies in Kent Community NHS Foundation Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust is rated Outstanding and aims to empower people to live well. We also aim to be the best employer and are looking for people to join our physiotherapy team. Due to the success of our ground-breaking Developmental Advance Physiotherapy Practitioner programme we have vacancies for band 6 clinicians&lt;/p&gt;\n&lt;p&gt;Kent is the Garden of England with a wealth of cultural and heritage attractions as well as enviable coastal and countryside locations, it&#39;s a lovely place to live. We have 15 Physiotherapy Departments across the county so we can be flexible about your base; please contact us for more information.&lt;/p&gt;\n&lt;p&gt;Our Physiotherapists offer outpatient assessment and treatment for a variety of musculoskeletal conditions within a diverse population. Our innovative clinical model includes the promotion of self-management, a variety of exercise groups and early intervention/minor injury clinics alongside the established 1 to 1 model of physiotherapy care.&lt;/p&gt;\n&lt;p&gt;The Integrated MSK Services include our Physiotherapy Service as well as advanced practice within Community Orthopaedics and First Contact Practitioner roles and our unique Community Pain Service.&lt;/p&gt;\n&lt;p&gt;We have a fantastic career structure that supports our staff to develop. We can help you to achieve your goals whether that is becoming a Clinical Specialist Physiotherapist, First Contact Practitioner, Clinical Manager or simply becoming the best Physiotherapist you can be. We were one of the first Trusts in the Country to launch our own Developmental Advanced Physiotherapy Practitioner programme; the majority of successful applicants for this exciting and ground-breaking scheme were internal candidates.&lt;/p&gt;\n&lt;p&gt;Along with the majority of NHS MSK physiotherapy services we moved swiftly to virtual consultations as a response to Coronavirus. Our clinicians developed a programme of care that enabled us to maintain our high quality and the patient feedback has been excellent. As part of KCHFT’s &#39;Reset and Reimagine’ process we are opening increasing numbers of face to face clinics and our team are currently providing a mixture of virtual and face to face appointments.&lt;/p&gt;\n&lt;p&gt;We are looking for B6 physiotherapists with aspirations to provide the best care, who are looking to develop their own career with a passion for developing and motivating others. There will be some travel involved to cover the sites within your team’s locality and we endeavour to make your working week varied and interesting; the hours you work should suit you as well as our service.&lt;/p&gt;\n&lt;p&gt;Full time hours are preferred but part time hours will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be held on the &lt;strong&gt;25th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dawn Thundow - Physiotherapy Manager (East)&lt;/p&gt;\n&lt;p&gt;Email: dawn.thundow@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Veronique Hadonou - Physiotherapy Manager (North and West)&lt;/p&gt;\n&lt;p&gt;Email: veronique.hadnou@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Kent, Various", "postalCode": "TN25 4AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1718", "longitude": ".870966"}}, "title": "Senior Musculoskeletal Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246690", "validThrough": "2020-11-10T23:59:59+0000"}