{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-05T09:31:13+0000", "description": "&lt;p&gt;&lt;span&gt; The Hot Floor Discharge Team is an integrated team of therapists, discharge managers, nurses, KCC and voluntary agencies and we work with acute and community services to ensure that patients attending our emergency department are picked up by the team and discharge plans are facilitated early on in their journey.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; We are looking for a senior occupational therapist to lead by example, give challenge where appropriate and drive the team forward to achieve health and social care delivery targets. The role will be fast paced and require quick thinking, complex problem solving and dynamic team leadership to drive the vision of our service on a daily basis. We take ownership of patient problems and work to provide creative, responsible, robust solutions to complex scenarios.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our service covers 8am-8pm daily shifts spread over seven day working pattern and we are happy to facilitate fulltime hours into a 4 day week. The post holder will need to be able to work on either the Queen Elizabeth the Queen Mother hospital in Margate or at the William Harvey Hospital in Ashford so the ability to travel between the EKHUFT sites is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Hot Floor Team includes the Emergency department, Observation ward and the Medical assessment unit which is a short stay ward. You will supervise and appraise EKHUFT therapy staff within the team and we would expect you to promote the team vision by taking students and collaborative working with all partner agencies. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic proactive leader...is this you?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jen Walton, Clinical Lead Hot Floor Discharge Team&lt;/p&gt;\n&lt;p&gt;Email address:jenwalton@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number:07811809878&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Alison Berti,&lt;/p&gt;\n&lt;p&gt;Email Address: alison.berti@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hosptial, Margate", "postalCode": "CT9 4BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257067", "validThrough": "2020-11-18T23:59:59+0000"}