{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-03T10:31:51+0000", "description": "&lt;p&gt;The community development team is a new team established within the direct commissioning directorate responsible for delivery of the national programme of community provider development. The team will support the 7 systems in the SW in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Local framework for workforce capacity, corporate workforce modelling, utilise additional workforce capacity&lt;/li&gt;\n&lt;li&gt;Community digitalisation&lt;/li&gt;\n&lt;li&gt;Community services SOP&lt;/li&gt;\n&lt;li&gt;Critical services continuation plan&lt;/li&gt;\n&lt;li&gt;Community services PPE issues&lt;/li&gt;\n&lt;li&gt;Out of hospital model for COVID+ patients&lt;/li&gt;\n&lt;li&gt;Engagement with Community Service local teams&lt;/li&gt;\n&lt;li&gt;Community estate and capital/tech&lt;/li&gt;\n&lt;li&gt;Cohorting/segmentation&lt;/li&gt;\n&lt;li&gt;Preventing re-admissions through anticipatory care&lt;/li&gt;\n&lt;li&gt;Urgent Community response – (accelerator sites)&lt;/li&gt;\n&lt;li&gt;Community Treatment Centres (UEC work programme – developing the community response to UTC requirements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As the community service development lead, the post holder will work as part of a dynamic team in delivering an effective service supporting managers and staff across directorate and with the 7 systems in the SW region.&lt;/p&gt;\n&lt;p&gt;The post is responsible for providing professional expertise and support to the development programme for the Directorate ensuring that the key deliverables are implemented in each of the 7 systems.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with other development staff across the directorate in primary and social care to adopt an integrated approach to the improvement of community services.&lt;/p&gt;\n&lt;p&gt;The post holder will define current processes, facilitate discussions and advise colleagues as to how best practice might be adopted in the definition of future processes, document those processes as they are agreed and oversee their delivery.&lt;/p&gt;\n&lt;p&gt;As a subject matter expert with skills and experience in service improvement and transformation, you will looking for the opportunity to work on a regional basis alongside STPs and ICSs to improve community services and support the delivery of the exciting national agenda for transformation. You will have proven experience of working collaboratively with service leads and clinicians to drive change. You will use evidence and analytics to support your agenda and improvement techniques to underpin transformation.&lt;/p&gt;\n&lt;p&gt;Working closely with the primary care and social care transformation teams you will progress the integration of services out of hospital in line with the ambitions of the Long Term Plan.&lt;/p&gt;\n&lt;p&gt;This is a new and exciting opportunity for someone who has a passion for improving out of hospital care and who seeks a regional portfolio that links to the national development team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Proposed interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Karen Burton&lt;/p&gt;\n&lt;p&gt;Job title - Head of Community Development&lt;/p&gt;\n&lt;p&gt;Email address - Karen.burton5@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number - 07702 406563&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South West - TA1 2PX", "postalCode": "TA1 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0141", "longitude": "-3.0681"}}, "title": "Community Development Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253479", "validThrough": "2020-11-17T23:59:59+0000"}