{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-16T08:16:15+0100", "description": "&lt;p&gt;We are seeking to recruit an enthusiastic, motivated Sonographer to join our busy, friendly Ultrasound team.&lt;/p&gt;\n&lt;p&gt;Candidates will be expected to have excellent communication skills and have experience in obstetric, gynaecological and general medical ultrasound. Applications will also be welcomed from Sonographers who are experienced in specialist areas of ultrasound practice.&lt;/p&gt;\n&lt;p&gt;All applicants must have HCPC registration or equivalent and have a PG Diploma in Medical Ultrasound or relevant PG certificates.&lt;/p&gt;\n&lt;p&gt;The obstetrics and gynaecology ultrasound service encompasses early pregnancy assessment, first, second and third trimester scans, fetal medicine and gynaecology. This is based in the Women’s Health Department making this a very dynamic cohesive unit with good support from Sonographer and multidisciplinary team colleagues. The general medical service comprises of general, small parts, vascular, MSK, CEUS and Elastography ultrasound examinations, performed by Sonographers and Consultant Radiologists.&lt;/p&gt;\n&lt;p&gt;The post is based at Dorset County Hospital in Dorchester but you will also be expected to participate in the provision of a community wide ultrasound service. Participation in weekend ultrasound cover will also be required.&lt;/p&gt;\n&lt;p&gt;We are committed to the continuous improvement of our services and to the training and development of our staff and you will also be expected to proactively participate in the development of trainee sonographers and other staff training in ultrasound.&lt;/p&gt;\n&lt;p&gt;Dorset County Hospital is situated in the heart of the Dorset countryside and only 7 miles from the Jurassic coast. The Trust is the main provider of acute hospital services to a population of around 250,000 people, living within Weymouth, Portland, West Dorset, North Dorset and Purbeck.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison BromleyJob titleUltrasound SuperintendentEmail addressalison.bromley@dchft.nhs.ukTelephone number01305 254530Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal discussions would be positively welcomed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alison Bromley, Superintendent Sonographer 01305 254530 or alison.bromley@dchft.nhs.uk &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121023.jpg", "name": "Dorset County Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121023"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset County Hospital, Dorchester", "postalCode": "DT1 2JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7135", "longitude": "-2.44712"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229306", "validThrough": "2020-11-08T23:59:59+0000"}