{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 Pa inc. HCAS"}}, "datePosted": "2020-10-30T14:46:47+0000", "description": "&lt;p&gt;* Staff Nurse 12 Month Rotation – Emergency Department, Acute Medicine and Acute Surgery.*&lt;/p&gt;\n&lt;p&gt;An exciting new opportunity has arisen at St George’s Hospital where we are proud to be able to offer a band 5 rotational programme through The Emergency Department, Acute Medical Unit and the Emergency Surgical Assessment Unit also known as the Nye Beven Unit. We are seeking enthusiastic band 5 nurses with 6 months post registration experience to join our rotational programme.&lt;/p&gt;\n&lt;p&gt;The rotation will last 12 months with each successful candidate speeding 4 months on each unit. During this time you will gain insight and experience into ED, acute medicine and surgery with the support of your team leaders and Practise Educators. This is an excellent opportunity to expand your skills and be part of an evolving and developing service.&lt;/p&gt;\n&lt;p&gt;Our Emergency Department is one of the largest in the country, seeing approximately 160,000 patients a year. The department sees a wide variety of patients from minor injuries to major traumas. The Trust is one of the four designated Major Trauma centres for London, with a helipad providing direct access to ED for the most seriously injured patients. The department also boosts a leading research team for England, led by Professor Heather Jarman to find better care and treatments for patients and families in the Emergency Department.&lt;/p&gt;\n&lt;p&gt;Nye Beven is a fast paced environment consisting of 8 short stay beds, 8 assessment trollies, assessment chairs, 2 HOT clinics and a minor procedures room. The unit provides a service for the rapid assessment and treatment of a variety of surgical complications and specialities- these include upper gastro-intestinal, colorectal, plastics, ear nose &amp; throat, head &amp; neck, maxillofacial, plastics, urology, trauma &amp; orthopaedics. These patients are normally admitted via the Emergency Department, specialist nurses and GP referrals.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit – AMU is a 58 bedded Acute Medical unit incorporating an 8 bedded Acute Dependency Unit and a Consultant led Ambulatory Assessment Unit with Nurse Practitioner clinics. They care for level one and two patients with a variety of medical conditions in a fast turnover environment. Here you will have chance to develop your skills as part of a highly capable team where you are guaranteed opportunities to learn how to care for patients requiring a variety of medical nursing interventions.&lt;/p&gt;\n&lt;p&gt;All units are friendly, flexible and committed to supporting the on-going professional development of our staff. This position is full-time only and there is an expectation that you complete 12 month rotation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmily JonesJob titleTeam Leader for Emergency Department and Lead for RecruitmentEmail addressemily.jones@stgeorges.nhs.ukTelephone number020 8725 0410&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George’s University Hospitals NHS Foundation Trust, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Staff Nurse Rotation – Emergency, Acute Medicine &amp; Acute Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250646", "validThrough": "2020-11-13T23:59:59+0000"}