{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T09:00:34+0000", "description": "&lt;p&gt;The Specialist Treatment and Recovery Service (StaRS - Formerly Hawthorne Court Rehabilitation Service) are looking to recruit two Band 5 registered Mental Health Nurses to join an existing and established Multi-Disciplinary Team. An exciting major review of the service is currently underway and is moving towards a ground-breaking hybrid inpatient facility for out of area-placed and repatriated service users with a sizeable intensive Community-delivered provision. This service will be delivered alongside third sector providers and aims to enable service users to have intensive, high quality person-centred interventions provided in their own environment in addition to the existing community services. This pioneering new service will be based in Hull and will serve the whole of Humber Teaching NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be highly motivated, with interests and skills in complex recovery with both an inpatient and community focus. STaRS in-patients unit houses a mixed (male/female) patient group with other service users already living in the community. They can present as times as challenging or difficult to engage, you will be required to have excellent engagement skills, in order to work both with our service users and their families/carers along with working collaboratively with a range of colleagues as well as partner agencies including local authorities and other external agencies involved to support the service users through their ongoing recovery journey from their mental health difficulties.&lt;/p&gt;\n&lt;p&gt;The Psychologically Informed Environments (PIE) model underpins the service ethos. PIE has at its core, safe and secure relationships and environments for staff and service users, delivered through training, supervision, and regular evaluation using the ReQol and Recovery Star tools. Compassion Focused Therapy is the psychological framework adopted by STaRS which is cited as being “the sensitivity to suffering in self and others, combined with the commitment to try and alleviate and prevent it”.&lt;/p&gt;\n&lt;p&gt;The STaRS work to their team values identified below:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;O&lt;/strong&gt;pen&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;T&lt;/strong&gt;rustworthy&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;H&lt;/strong&gt;onest&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;E&lt;/strong&gt;mpathic&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;R&lt;/strong&gt;espectful&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a band 5 you will be registered and may already have undertaken the Assessed and Supported Year in Employment programme to meet the requirements of a newly qualified as set out in the professional capabilities framework (PCF). Supervision, training will be provided to support your personal and professional development to support you in your role and career.&lt;/p&gt;\n&lt;p&gt;The successful applicant needs to have the ability to commute within the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;It is expected that the successful applicant will have previous experience and training for this post or be willing to work towards obtaining appropriate qualification/experience. The successful candidate will be put on the appropriate salary pay point based on their previous experience in the role or similar role. If you do not have appropriate training we are open to the development of staff. You will be encouraged to engage in your professional development needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,500 staff across more than 70 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver mental Health Services, specialist services for children, Forensic Services, Community and Learning Disability Services, as well as having eight GP practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider is committed to Caring, Learning and Growing. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;As a teaching Trust, we work closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has transport connections with a direct train service to London that takes less than three hours, as well as an hour commute to York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Eu&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "STaRS unit Townend Court, Hull", "postalCode": "HU6 8QR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7708", "longitude": "-.386534"}}, "title": "STaRS Staff nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258954", "validThrough": "2020-12-04T23:59:59+0000"}