{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "tbc"}}, "datePosted": "2020-10-27T15:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;DEVELOP YOUR CAREER WITHIN OXFORD UNIVERSITY HOSPITAL AS A BUSINESS ADMINISTRATOR LEVEL 3 APPRENTICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like a career in Business Administration and be part of our valued NHS?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals Foundation Trust has fantastic opportunities for you to learn whilst you earn and develop your professional skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Business Administrator Apprentice you will have exciting opportunities to join various teams based throughout our hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are on the search for committed and enthusiastic individuals who are able to demonstrate compassion, respect and commitment to learning, show pride in their quality of work they produce and ready to take on the challenge of working with us as an apprentice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an apprentice you will be an integral part of the teams and you will need to have excellent communication skills, show initiative and be able to problem solve and be keen to develop professionally and personally.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer the chance to undertake projects for service improvements and take on real responsibility. You will learn from experienced staff and make most of every opportunity to fulfil your ambition.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This level 3 apprenticeship will last 18 months and on completion of training leads to a full level 3 qualification,&lt;/p&gt;\n&lt;p&gt;For some apprentices this can lead to higher level qualifications and to have the opportunity to progress right through to degree level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Joining our apprenticeship programme will help you network with other young apprentices and lay the foundations for professional links to develop your career.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our commitment to you includes a structured training plan, fully paid study time; job rotation, professional support and an opportunity to kick start your career within the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The training programme involves exciting opportunities and you will:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· To learn how to plan business communications and manage business process and resources including service improvement projects&lt;/p&gt;\n&lt;p&gt;· To provide an efficient and effective high quality administrative support to a designated team in accordance to Trust policies and procedures&lt;/p&gt;\n&lt;p&gt;· Develop a variety of IT skills including data analysis&lt;/p&gt;\n&lt;p&gt;· Learn how to deal with sensitive and confidential information&lt;/p&gt;\n&lt;p&gt;· Learn to deal with patients in a face to face environment and deliver a compassionate service&lt;/p&gt;\n&lt;p&gt;· Work with a range of other managers and administrative staff across the organisation&lt;/p&gt;\n&lt;p&gt;· Complete a Business Administrator Level 3 standard apprenticeship&lt;/p&gt;\n&lt;p&gt;· Complete Functional Skills if required&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note to access apprenticeship funding you must have been living in the UK or the EU for the last 3 years. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please click on the below link to apply:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact: apprenticeships@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or call 01865 225652&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment Centre Date: 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Potential start date: January 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apprenticeships@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01865 225652&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX4 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7315", "longitude": "-1.18245"}}, "title": "Business Administrator Level 3 Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245111", "validThrough": "2020-11-15T23:59:59+0000"}