{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum"}}, "datePosted": "2020-10-28T11:47:16+0000", "description": "&lt;p&gt;This is an exciting opportunity for a 3 qualified Children&#39;s Psychological Wellbeing Practitioner to work in the Durham and Darlington CAMHS teams. We have 2 permanent posts and a 12 month temporary contract to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;We are keen to hear from suitably experienced, enthusiastic, qualified, and motivated individuals, who are focused on delivering high quality evidence based interventions with children and young people.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work alongside a multi disciplinary team of healthcare professionals to deliver a range of evidenced based psychological therapies via video, telephone, and in person, both individually and in groups. Working with the support and guidance of the Leadership Team, the successful applicant will be expected to assess, plan, and implement appropriate care for children with mental health needs, and provide support for their families.&lt;/p&gt;\n&lt;p&gt;All applicants must be a qualified Children&#39;s Psychological Wellbeing Practitioners. Please note that the qualification requirements of this role are specific, and those applications not meeting the specific qualification or training requirements will not be considered. The advertised positions are full time, and the successful applicants will be required to work full time hours across the opening hours of the service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for the fixed term post the successful applicant will be confirmed in post on a permanent basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mandy Corcoran. Team Manager&lt;/p&gt;\n&lt;p&gt;01740 626300&lt;/p&gt;\n&lt;p&gt;07584602122&lt;/p&gt;\n&lt;p&gt;Mandy.corcoran@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sdegefield Community Hospital, Sedgefield", "postalCode": "TS21 3EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6619", "longitude": "-1.4485"}}, "title": "Childrens Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246429", "validThrough": "2020-11-11T23:59:59+0000"}