{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T16:00:22+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Pharmacy Assistant – Aseptic Production – band 3 – 37.5 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the West Suffolk NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at the West Suffolk NHS Foundation Trust (WSFT), we’re all about quality. Our vision is simply to deliver the best quality and safest care to our community.&lt;/p&gt;\n&lt;p&gt;Serving a rural population of around 280,000, we aim to provide the right care, in the right place, at the right time – whether in the hospital or community setting across west Suffolk. We deliver high-quality services in a variety of settings including people’s own homes, care homes, day centres, schools, GP surgeries and health centres, as well as the Newmarket Community Hospital inpatient unit and clinics, and our main site, the West Suffolk Hospital in Bury St Edmunds.&lt;/p&gt;\n&lt;p&gt;And we do everything we can to make our Trust a great place to work – we truly care about you and your wellbeing.&lt;/p&gt;\n&lt;p&gt;Feedback from our colleagues that already work here tells us we’re generally getting it right; using our results from the latest NHS Staff Survey (2018), the prestigious Health Service Journal scored us as having the best staff engagement score in the East of England, and the fourth best in the country. They’ve also branded us as “the best small hospital in the country” – and we get consistently good feedback from our patients too, who recommend us as a place to receive care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us – what will you #Beknown for &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2 Pharmacy ad copy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;#BeKnown &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;By us. By our patients. By our community. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Pharmacy Assistant – Aseptic Production band 3 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our patients are at the heart of everything we do. We’re dedicated to delivering the best quality and safest care to our local communities and need dedicated and skilled people to help us achieve this.&lt;/p&gt;\n&lt;p&gt;The Trust has invested significantly to increase the capacity of our aseptic production unit.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to develop your pharmacy career and make a real difference to the lives of those who use our services.&lt;/p&gt;\n&lt;p&gt;This post will support your career and skills development; you’ll work in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Aseptic chemotherapy services&lt;/li&gt;\n&lt;li&gt;Dispensary&lt;/li&gt;\n&lt;li&gt;Medicines Distribution&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What will you #BeKnown for?&lt;/p&gt;\n&lt;p&gt;We want to tell your story. We want to help develop your career. The opportunities are endless.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Senior Pharmacy Assistant - Band 3 - Aseptic Production", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254691", "validThrough": "2020-11-17T23:59:59+0000"}