{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17208", "minValue": "17208", "unitText": "YEAR", "value": "£17,208 per annum"}}, "datePosted": "2020-11-02T17:38:16+0000", "description": "&lt;p&gt;Nursing Assistant – In-patient Unit - 37.5 hours per week&lt;br /&gt;Leckhampton Court Hospice, Church Road, Leckhampton, Cheltenham, Gloucestershire, GL53 0QJ&lt;br /&gt;£17,208 per annum&lt;br /&gt;&lt;br /&gt;We are looking for a full time Nursing Assistant for our In-patient Unit.&lt;br /&gt;&lt;br /&gt;The service operates 7 days a week with varying shift patterns. Applicants should be enthusiastic, highly motivated and display excellent communication skills along with a passion to deliver first class palliative care to our patients.&lt;br /&gt;&lt;br /&gt;You will need:&lt;br /&gt;• NVQ/QCF Level 2 or equivalent&lt;br /&gt;• Previous experience within an oncology or palliative care setting preferred but not essential&lt;br /&gt;• Competent use of IT systems&lt;br /&gt;&lt;br /&gt;Leckhampton Court is a Sue Ryder hospice, based in Gloucestershire. We’re here for people aged 18 and over living with conditions like cancer, heart failure and lung disease. It provides the only specialist hospice care inpatient unit in the county of Gloucestershire.&lt;br /&gt;&lt;br /&gt;We offer a range of support, from inpatient care in our 16-bed hospice, set in the foot of the Cotswold Hills and surrounded by beautiful countryside, to day services and Hospice at Home which helps people stay at home longer and offers respite to carers.&lt;br /&gt;&lt;br /&gt;Benefits include:&lt;br /&gt;&lt;br /&gt;• Competitive enhancements: weekends 45%, nights 30% and public holidays 60%&lt;br /&gt;• Company pension scheme&lt;br /&gt;• 25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;• Option to buy and sell up to five days holiday&lt;br /&gt;• Enhanced maternity and paternity pay&lt;br /&gt;• Enhanced sick pay&lt;br /&gt;• Paid qualifications&lt;br /&gt;• Corporate discount with hundreds of retailers and services&lt;br /&gt;• Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;• Cash referral bonus scheme&lt;br /&gt;• Salary sacrifice car scheme&lt;br /&gt;• Online Wellbeing Centre&lt;br /&gt;• Free Will writing service&lt;br /&gt;• Staff finance loans&lt;br /&gt;• Free uniform&lt;br /&gt;• Carers leave policy&lt;br /&gt;• Subsidised onsite meals and drinks&lt;br /&gt;• Structured induction programme and learning and development opportunities&lt;br /&gt;&lt;br /&gt;To organise an informal discussion regarding this post, please contact Sue Phillips, Ward Manager, via e-mail sue.phillips@suerydercare.org&lt;br /&gt;&lt;br /&gt;Job offers dependent upon satisfactory DBS clearance.&lt;br /&gt;&lt;br /&gt;Other organisations may call this role Care Assistant, Healthcare Assistant, Trainee Care Worker, Health &amp; Social Care Worker, Social Care Worker, or Carer.&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leckhampton/Cheltenham", "postalCode": "GL53 0QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8727", "longitude": "-2.0873"}}, "title": "Nursing Assistant - IPU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253029", "validThrough": "2020-11-16T23:59:59+0000"}