{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Internal Locum Rates"}}, "datePosted": "2020-11-06T12:31:57+0000", "description": "&lt;p&gt;&lt;strong&gt;This post is for Medicine Only.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Calderdale &amp; Huddersfield Foundation Trust are looking to recruit suitably qualified doctors to provide additional shift cover on an ad hoc basis across all grades to support all directorates.&lt;/p&gt;\n&lt;p&gt;This includes our Emergency, Acute, Integrated and General Medical Specialties, Family and Specialist Services Division and both Surgery and Anesthetics Teams.&lt;/p&gt;\n&lt;p&gt;Calderdale and Huddersfield NHS Foundation Trust is an exceptional place to work with many amazing teams of hard working and dedicated staff, delivering high standards of patient care.&lt;/p&gt;\n&lt;p&gt;We value our staff and recognise that they are our greatest asset. With a fantastic leadership team, headed by Owen Williams, our CEO who has just made it to the top 100 BAME Leaders list CHFT is at the forefront of Digital Health utilising a number of electronic solutions to improve patient care. The CQC rated us as Good in June 2018. In their report they confirmed that; “Staff were caring and provided compassionate care. Patients were treated with dignity and respect and their privacy was respected. Patients spoke positively about the care they received”.&lt;/p&gt;\n&lt;p&gt;If you want to join a supportive and friendly team providing compassionate care then come and join us to help us achieve ‘outstanding’ in the next CQC inspection.&lt;/p&gt;\n&lt;p&gt;We have recently made significant changes in the way we work to meet the current challenges of working in the NHS and are now looking to increase our capacity of Flexible Workforce (Bank) Doctors to provide additional shift cover. Please note that the employment status being offered is &#39;Worker&#39;. Hours are not guaranteed and work may cease if there is a fall in demand.&lt;/p&gt;\n&lt;p&gt;The Trust is based in two large district hospitals, Huddersfield Royal Infirmary and Calderdale Royal Hospital. The post will require flexible working across both hospital sites.&lt;/p&gt;\n&lt;p&gt;Applicants must continue to hold a Full Licence to Practice and those successful will be paid Trust agreed rates against the qualified/experienced grade appointed to.&lt;/p&gt;\n&lt;p&gt;For direct divisional information you can email contacts provided in each of the Job descriptions as attached.&lt;/p&gt;\n&lt;p&gt;If you are from overseas and require a Certificate of Sponsorship, we will not be able to provide this for this post.&lt;/p&gt;\n&lt;p&gt;All applicants must have GMC Registration with a Licence to Practice.&lt;/p&gt;\n&lt;p&gt;Post is for immediate start.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rhianedd Hurley - General Manager - 01422 222994&lt;/p&gt;\n&lt;p&gt;Purav Desai - Clinical Director - 01484 342026&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale and Huddersfield NHS Foundation Trust", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Flexible Workforce (Bank) Doctor (Medicine)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259690", "validThrough": "2020-11-08T23:59:59+0000"}