{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T10:16:29+0000", "description": "&lt;p&gt;Are you a dynamic person looking to further develop your Paediatric career and join our Shrewsbury and Telford Hospitals as our Paediatric Matron? We are looking for a Paediatric Matron to lead and develop our Paediatric Services at both hospitals, particularly as we embark on our transformation programme and transfer acute Paediatric services to the Royal Shrewsbury Hospital.&lt;/p&gt;\n&lt;p&gt;The Children’s Unit at The Princess Royal Hospital, Telford consists of 36 beds (including a 3 bed oncology unit), and is an acute general paediatric ward caring for babies, children and young people aged 0-16 years with medical, surgical, orthopaedic and oncology conditions. There are a variety of areas within the unit, general inpatients, day surgery, a children’s assessment unit, higher dependency beds and a level 3 oncology unit. The paediatric services at Shrewsbury consist of an outpatients department and a Children’s Medical Day Unit.&lt;/p&gt;\n&lt;p&gt;This is a challenging but rewarding position for an individual who can demonstrate excellent leadership skills and who enjoys leading both service improvement and staff development. We need you to lead our Paediatric team through positive change as we continue on our journey following our recent CQC assessment and our relocation to Shrewsbury.&lt;/p&gt;\n&lt;p&gt;The perfect candidate for this position will possess and demonstrate a high standard of leadership and a passion and desire in providing a high standard of care to create the best patient experience.&lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate clinical credibility, excellent communication and organisational skills, a positive approach to change and positively good leadership skills. You must live our trust values and drive our Paediatric Services forward through improvement and innovation.&lt;/p&gt;\n&lt;p&gt;If you feel that this post is the one for you then we would love to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Royal Hospital, Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Paediatric Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241974", "validThrough": "2020-11-09T23:59:59+0000"}