{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-19T10:01:49+0100", "description": "&lt;h1&gt;DONCASTER AND BASSETLAW HOSPITALS NHS FOUNDATION TRUST&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT HAEMATOLOGIST x 2.00wte&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doncaster &amp; Bassetlaw Hospitals (DBH) is a medium sized Foundation Trust with big ambitions. We’re aiming to be in the top 10% for everything we do. To get there we are improving our organisation to be more suited to how patients use our services.&lt;/p&gt;\n&lt;p&gt;We serve a population of over 420,000 people across South Yorkshire and North Nottinghamshire. We are also an Associate Teaching Hospital of the University of Sheffield and an Associate College of Sheffield Hallam University&lt;/p&gt;\n&lt;p&gt;The Trust welcomes applications for 2 full time Consultant Haematologist posts. This is a replacement post and will bring the Haematology team up to its establishment of 5 consultants, 3 Staff Grades, and 1 CT1, supported by a team of Specialist Nurses providing a comprehensive service to patients across the Doncaster and Bassetlaw regions. &lt;br /&gt;&lt;br /&gt;The Trust is committed to achieve excellence in clinical medicine and we can offer the right candidate:-&lt;br /&gt;Enthusiastic, friendly and supportive staff and environment&lt;br /&gt;Designated beds for inpatient care&lt;br /&gt;Full range of Haematology services and allied professionals to lead and develop&lt;br /&gt;An active and supportive research opportunity&lt;br /&gt;&lt;br /&gt;We offer an excellent pension scheme and are perfectly positioned, with the major regional centers of Nottingham, Leeds and Sheffield on our doorstep.&lt;/p&gt;\n&lt;p&gt;The Robin Hood International Airport is also in close proximity to the Trust, flying to destinations in Europe and the USA. There is access to delightful countryside in North Nottinghamshire, Derbyshire and Yorkshire, excellent leisure facilities and low cost housing&lt;/p&gt;\n&lt;p&gt;If you are interested in this post and preferably have FRCPath or within 6 months CCT, we would be delighted to hear from you. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Stuti KaulJob titleConsultant HaematologistAdditional contact information&lt;/p&gt;\n&lt;p&gt;Interested candidates are strongly encouraged to visit Doncaster and are invited to speak to Dr Stuti Kaul, Consultant Haematologist &amp; Clinical Lead, 01302 644024, Dr Ruth Medlock, 01302 644022 or Dr Ian Stott, Divisional Clinical Director on 01302 642614.&lt;/p&gt;\n&lt;p&gt;Alternatively, contact the Recruitment Team at Doncaster Royal Infirmary on 01302 642584 or email dbth.medicalhr@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster Royal Infirmary, Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231712", "validThrough": "2020-11-24T23:59:59+0000"}