{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-06T12:46:04+0000", "description": "&lt;p&gt;We are looking for a supervisors to join our John Radcliffe Sterile Services team. We are a service providing clean and sterilised surgical instruments to operating theatres and clinical departments at the John Radcliffe Hospital. This busy unit is open 24/7, 365 days a year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work within Good Manufacturing Practice guidelines within the production unit, ensuring that all resources including equipment and staff are effectively organised. You will work closely with the supervisor and management team, to ensure that productivity targets and quality standards are achieved, whilst conforming to the requirements of HTMs, quality systems (as stated in ISO13485:2016), MDR and other relevant guidelines.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be directly involved in a variety of tasks including decontaminating, packing, labelling and tracking, and sterilising of surgical equipment using specialised decontamination equipment and machinery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At all times and throughout all production areas, ensuring safe systems are in place for patient safety.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide effective communication with customers in order to address and resolve any problems.&lt;/li&gt;\n&lt;li&gt;Assist with the implementation of ISO13485:2016 &amp; MDR policies and procedures.&lt;/li&gt;\n&lt;li&gt;Motivate staff, to maintain equipment reprocessing targets, whilst maintaining standards.&lt;/li&gt;\n&lt;li&gt;Explain technical issues relating to decontamination processes and Health &amp; Safety issues.&lt;/li&gt;\n&lt;li&gt;Provide staff training as and when necessary, to assist SSD Technicians to complete In-house training programme.&lt;/li&gt;\n&lt;li&gt;Be aware of standards of set out in the Quality Procedure Manual and help the department to meet its department objectives set out for the year.&lt;/li&gt;\n&lt;li&gt;Accurately exchange information with workforce to enable prioritisation of work to maintain service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a motivated individual ideally with experience within Sterile Services or a related field to join our team of 5 supervisors providing supervision and support to 30 Sterile Services Technicians across various shifts. Ideally you will possess experience of working and supervising a team within Sterile Services. Ideally you should hold a recognised Team Leader Qualification and formal decontamination qualifications or be willing to work towards achieving them.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be expected to work flexibly to ensure we can provide a 7 day service which includes working Bank Holidays including Christmas and New Year on a rota basis. All applicants applying for this post will be expected to work one of the bank holidays, including Christmas and New Year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hours as follows;&lt;/p&gt;\n&lt;p&gt;Night Shift Team Leader&lt;/p&gt;\n&lt;p&gt;Thursday to Sunday 20:30 until 06:45&lt;/p&gt;\n&lt;p&gt;Bank Holiday, Christmas and New Year working is covered on a Rota Basis&lt;/p&gt;\n&lt;p&gt;Department: Sterile Services – John Radcliffe Hospital&lt;/p&gt;\n&lt;p&gt;Post Title: Sterile Services Team Leaders&lt;/p&gt;\n&lt;p&gt;Grade: Band 3&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 27th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLinda Kinane, Sterile Service Manager, Linda.kinane@ouh.nhs.uk, 01865 226820&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Sterile Services Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259745", "validThrough": "2020-11-27T23:59:59+0000"}