{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T08:30:45+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen to recruit a passionate, dedicated and highly motivated Deputy Ward Manager who is excited to be part of the Female Acute Ward based at Lavender Suite Zinnia Centre.&lt;/p&gt;\n&lt;p&gt;Lavender Suite is an exciting service to be part of. We work within a specialist multi-disciplinary team delivering high quality care to patients experiencing acute mental illness. Successful applicants must be able to work in a challenging and dynamic environment. You will need to demonstrate a range of skills including effective communication, strong leadership skills, empathy, self-awareness, resilience and critical self-reflection skills.&lt;/p&gt;\n&lt;p&gt;You will need to be passionate about mental health and supporting patients. It is important for you to be committed to working within a multi professional team as well as possessing excellent communication, risk assessment and care planning skills. As an excellent communicator you’ll be able to build good relationships with patients and their families as well as other stakeholders.&lt;/p&gt;\n&lt;p&gt;We are looking for ambitious staff with the desire for self-development. We offer regular management supervision and close working with the Ward Manager and other Deputy Ward Managers as well as promoting continuous professional development to provide you with opportunities to progress and ensure that best practice is embedded in clinical provision.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJennifer JohnsonJob titleWard ManagerTelephone number0121 301 5348Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lavender Suite, Birmingham", "postalCode": "B11 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4489", "longitude": "-1.86751"}}, "title": "Band 6 Deputy Ward Manager - Zinnia Centre, Lavender Suite", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243714", "validThrough": "2020-11-16T23:59:59+0000"}