{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 (MN35 scale plus 1A Banding)"}}, "datePosted": "2020-10-28T13:46:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Frimley Health NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Grade Doctor in Anaesthesia&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Frimley Park Hospital&lt;/p&gt;\n&lt;p&gt;Frimley Park Hospital is a friendly and innovative 700 bed Acute Trust based on the Surrey/Hants border. The hospital along with Wexham Park and Heatherwood Hospitals is part of Frimley Health NHS Foundation Trust. The Trust is rated as “outstanding” by the Care Quality Commission and staff scored the Trust in the top 20% of hospitals in England for training, development and job satisfaction.&lt;/p&gt;\n&lt;p&gt;A wide range of surgical specialties are offered at Frimley Park, with over 80% of operations performed as day cases. Frimley is a regional vascular centre undertaking emergency and elective vascular surgery including endovascular techniques. There is a large orthopaedic workload which is supported by a highly developed regional anaesthesia service. There will be ample opportunity for the successful candidate to gain considerable experience in regional anaesthesia techniques. The Obstetric Unit has 5500 deliveries per year for which the Anaesthetic Department provides 24h cover. The Intensive Care Unit comprises 12 critical care beds admitting both surgical and medical patients. It has been rated Outstanding by the CQC. There are also Medical and Surgical Acute Dependency Units managed by medical and surgical teams.&lt;/p&gt;\n&lt;p&gt;The Anaesthetic Department seeks a motivated anaesthetist to join the team. The successful candidate should have at least one year’s experience in anaesthesia and be competent in anaesthetising ASA I &amp; II patients independently. They should also have the necessary skills to manage analgesia and anaesthesia for the Obstetric Unit.&lt;/p&gt;\n&lt;p&gt;The post is for 6-12 months, in the first instance, commencing in February 2021 with a view to a further extended contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Primary non Covid goals of the post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is attempting to reintroduce normal surgical pathways, accepting that Covid related activity will also continue. Attempts will be made to try and achieve as many aspects of these goals as is possible however the candidate is advised that this may change dependant on the degree of Covid work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1) Clinical Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Consolidation of clinical skills and experience in general anaesthetic practice. The post-holder can expect to gain considerable exposure to anaesthesia for orthopaedic and general surgery, as well as other speciality areas. There will be an opportunity to develop skills in regional anaesthesia as well as some exposure to anaesthesia for vascular surgery. The post holder will also gain experience in obstetric anaesthesia and in Intensive Care Medicine.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;2) Teaching&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Weekly consultant-led teaching for anaesthetic and ICM juniors in topics relevant to anaesthesia and ICM is provided with a particular focus on the FRCA exam&lt;/li&gt;\n&lt;li&gt;The department has a strong emphasis on safety and quality with a monthly M&amp;M meeting which is attended by all staff. The post holder will be encouraged to present and take part in the discussion of cases at this meeting.&lt;/li&gt;\n&lt;li&gt;The post-holder would be encouraged and strongly supported in taking any appropriate examinations, including Primary or Final FRCA in which the department has a strong history of successful candidates.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;3) Clinical Audit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder is expected to take part in clinical audit of topics pertinent to anaesthetic care. It is hoped that the quality of such audit will result in a poster presentation at national or international meetings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;4) Timetable&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will take part in the trainee on call rota on a 1:8 full shift pattern, being on call for the Intensive Care Unit, Obstetrics or Theatres depending on their competencies. On call trainees are expected to work cooperatively and offer support to other members of the on call team. The trainees are supported by an anaesthetic consultant and an intensive care consultant on call from home.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Covid facing work:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Covid pandemic has resulted in the need for adapted working patterns to accommodate critical care needs. During the most recent surge phase, trainee grade doctors have worked in teams of five to fulfil sufficient work force requirement and also rest periods in between. This is supported extensively with resident consultant presence. It is envisaged that in the first instance, the 1; 8 shift pattern will be applied with a view of moving to a different Covid rota if activity in ICU dictates the need. In view of this, prior experience in ICU will be favourable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please contact the Anaesthetic Department to speak to Dr Tote, Deputy Chief of Service Anaesthesia/ICU via the anaesthetic administration office 01276 604161&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Subodh Tote&lt;br /&gt;Job title: Deputy Chief of Service Anaesthesia/ICU&lt;br /&gt;Telephone number: 01276 604161&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park Hospital, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Trust doctor in Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246808", "validThrough": "2020-11-18T23:59:59+0000"}