{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780"}}, "datePosted": "2020-11-03T12:46:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours – 37.5 hours per week (full time)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: St John’s Therapy Centre, Battersea, Wandsworth (SW London)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty: Wandsworth Community Neuro Team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to maternity leave we are seeking to appoint a skilled and experienced Speech and Language Therapist (Band 6) to work within a well established and respected, adult multi-disciplinary &lt;strong&gt;community neuro team, &lt;/strong&gt;for up to one year.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for the assessment and treatment of adults and older people with a variety of acquired neurological conditions living in the community, including Early Supported Discharge for stroke patients. There are opportunities to see clients at St John’s Therapy Centre and in other community settings. There is a strong emphasis on multi-disciplinary working including service development and team learning. The MD team includes occupational therapists, physiotherapists, speech and language therapists, dietician, clinical neuropsychologist, clinical nurse specialist, complex case manager, administrative, psychology and rehabilitation assistants.&lt;/p&gt;\n&lt;p&gt;As an experienced therapist, the post holder will have skills in managing a caseload of clients with complex neurological needs, including dysphasia and dysphagia management. Training and experience in LSVT and VF would be an advantage, but is not essential.&lt;/p&gt;\n&lt;p&gt;The post holder will have a key role in the development of the Speech and Language service and other projects within the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;As this is a community post, it would be advantageous that you are a car owner/driver or a cyclist.&lt;/p&gt;\n&lt;p&gt;Continuing professional development is actively supported via clinical supervision, annual Personal Development Plans, post-graduate and in-service training from a uni-professional and multi-disciplinary point of view. Supervision of students is actively encouraged. All our staff are fully supported by the Clinical Team Leader.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel SibsonJob titleClincial Team LeadEmail addressrachel.sibson@stgeorges.nhs.ukTelephone number020 8812 4060Additional contact information&lt;/p&gt;\n&lt;p&gt;For more information regarding this post please contact&lt;/p&gt;\n&lt;p&gt;Rachel Sibson Clinical Team Leader 020 8812 4063/4060 rachel.sibson@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt;Abigail Watson (SLT) Abigail.watson@stgeorges.nhs.uk or Roisin Bates (SLT) roisin.bates@stgeorges.nhs.uk .&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St John&#39;s Therapy Centre, Wandsworth", "postalCode": "SW11 1SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4603", "longitude": "-.179609"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254016", "validThrough": "2020-11-15T23:59:59+0000"}