{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 p.a pro rata"}}, "datePosted": "2020-10-30T08:30:16+0000", "description": "&lt;p&gt;We currently have opportunities to join the Nursing Bank within Hertfordshire Partnership University NHS Foundation Trust (HPFT). In particular we are looking for temporary staff to work as and when required often at short notice at Band 5 level, within NORFOLK&lt;br /&gt;&lt;br /&gt;If you are interested in working within our learning disability &amp; forensic services in a temporary capacity we would like to hear from you. &lt;br /&gt;&lt;br /&gt;All roles on the bank are for as and when workers and therefore in particular may suit those already working part-time, with other commitments, or who want to work on a short-term basis.&lt;br /&gt;&lt;br /&gt;Requirements for various hours can be considered. If you are available in school holidays or term time only then we would also like to hear from you.&lt;br /&gt;&lt;br /&gt;HPFT provides services for service users with mental health, learning disability and children’s and adolescent mental health problems. Applicants should have some experience of working in a healthcare setting particularly within mental health or learning disability services. &lt;br /&gt;&lt;br /&gt;HPFT has a range of healthcare settings across the County and therefore access to a car would be beneficial unless you have a disability as defined by the Equality Act 2010 which prevents you from driving &lt;br /&gt;&lt;br /&gt;PLEASE REFER TO THE JOB DESCRIPTION AND PERSONAL SPECIFICTION FOR DETAILS OF THE SKILLS REQUIRED BEFORE APPLYING.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;hpft.bank.bureau@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Little Plumstead Hospital, Little Plumstead, Norwich, Norfolk, Norfolk", "postalCode": "AL3 5TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7621", "longitude": "-.345255"}}, "title": "BANK Mental Health Nurse/Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249365", "validThrough": "2020-11-13T23:59:59+0000"}