{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "6724", "unitText": "YEAR", "value": "Equivalent of A4C Band 7 - 8A"}}, "datePosted": "2020-11-06T07:46:10+0000", "description": "&lt;p&gt;West Wakefield Health and Wellbeing is a Primary Care Network of 5 practices. This is an exciting opportunity to join our team as a Clinical Pharmacist for the Primary Care Network.&lt;/p&gt;\n&lt;p&gt;The team at West Wakefield Primary Care Network are a network of forward-thinking General Practices covering circa 68,000 patients in the West Wakefield area. Our aim is to create a pharmacy team, comprising pharmacists and pharmacy technicians, that support one another, have opportunities to share learning and engage in professional development, while being integrated into the practices. The successful applicant will work closely with the existing clinical teams to deliver excellent patient care working innovatively and collaboratively with colleagues.This role provides fantastic opportunity for career progression and development alongside a competitive salary package. Ideally we are looking for someone who has the independent prescribing qualification, experience in primary care and / or has completed the CPPE course.&lt;/p&gt;\n&lt;p&gt;The role has the potential to help manage general practice workload and significantly improve quality of care and safety for patients.&lt;/p&gt;\n&lt;p&gt;This post is offered as a fixed-term contract matching the current Primary Care Network funding guarantee but is anticipated to continue when this is renewed.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the position once suitable applications have been received.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary will be dependent on experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No agencies please.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note you will only be contacted if you have been selected to attend an interview after the shortlisting process has taken place.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Wakefield", "postalCode": "WF4 4PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6505", "longitude": "-1.60084"}}, "title": "Primary Care Network Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258855", "validThrough": "2020-11-30T23:59:59+0000"}