{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a."}}, "datePosted": "2020-11-05T10:31:20+0000", "description": "&lt;p&gt;Are you looking for a leadership post?&lt;/p&gt;\n&lt;p&gt;Dorset Healthcare are recruiting a Dietetic Lead for the Community Intermediate Diabetes Dietetic service which includes a newly diagnosed type 2 diabetes education programme for East Dorset and Purbeck. Working with partners to provide education for around 1000 people newly diagnosed with type 2 diabetes per year. This small team has a big impact on diabetes care within Dorset. Providing holistic, innovative, collaborative working, with close links to other services in Dorset. We are looking for a leader who inspires, enables and supports staff to explore and develop new ways of working and collaboration with others. A person who works well with other services, building good working relationships and has breadth and depth to their diabetes knowledge and experience. Half the time will be clinical, community clinics and facilitating group education. The service delivers care in East Dorset and Purbeck with the team based in Poole. As this is a community service you will be required to drive. Experience of group facilitation and using online platforms for education would be useful.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires a Standard Disclosure and Barring Service (DBS) check. The DBS levies a charge of £23 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Susan Sherlock, Service Manager-Diabetes and Podiatry, Email address: susan.sherlock@nhs.net Telephone number: 07766 725887&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Team Leader Intermediate Dietitian Diabetes Service, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257232", "validThrough": "2020-12-06T23:59:59+0000"}