{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31000", "minValue": "31000", "unitText": "YEAR", "value": "up to £31,000 per annum DOE"}}, "datePosted": "2020-10-15T14:58:46+0100", "description": "&lt;h1&gt;&lt;strong&gt;Are you ready for a change in direction and new challenge?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you transfer your clinical skills and knowledge into the prison setting?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want support and development opportunities in an innovative environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about providing safe and effective care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP YOI Hollesley Bay, is a Category D open prison holding males from 18 years on. It is built on a strong reputation in successfully preparing prisoners for final release. Spaced across 85 acres, it is situated in Woodbridge, Suffolk.&lt;/p&gt;\n&lt;p&gt;Working within a prison primary care environment will develop your clinical, professional and personal strengths. We deliver a variety of healthcare interventions to the healthcare users in the establishments including triage, management of minor illness and injury, long term conditions management, acute and chronic wound management, health promotion activity, sexual health clinics and vaccinations and screening programmes. If you are interested in every day being different, working in prison with a complex population will provide a stimulating work environment.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We offer opportunities to develop in to a specialist role of your interest which in turn benefits the service. Examples include ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;What can you expect in the role?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Registered Nurse (Adult) you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. You could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You’ll receive an annual salary of up to £31,000 FTE - depending on experience; free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;How will we support you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;• Bespoke induction&lt;br /&gt; • Competency framework&lt;br /&gt; • Preceptorship (newly qualified practitioners)&lt;br /&gt; • Regular clinical supervision&lt;br /&gt; • Supported development into specialties such as diabetes or asthma&lt;br /&gt; • Regional and national career development opportunities&lt;br /&gt; • Our bespoke Learning Management System to address your learning needs&lt;br /&gt; • Support from the wider team&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Hollesley Bay if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The healthcare service is open Monday to Friday from 08:00-19:30 and weekends and public holidays from 08:30-18:00. We provide a GP surgery provision alongside access to mental health and substance misuse services.&lt;/p&gt;\n&lt;p&gt;This is a full time role, working 37.5 hours per week on a rota basis, part-time applications are also welcome. We provide healthcare seven days a week.&lt;br /&gt; &lt;br /&gt; The salary for this role is up to £31,000 FTE per annum - dependent on experience.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;Please note that that role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/strong&gt;&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;&lt;/strong&gt;&lt;br /&gt; At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbridge", "postalCode": "IP12 3JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0511", "longitude": "1.45136"}}, "title": "Registered General Nurse - HMP Hollesley Bay", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228697", "validThrough": "2020-11-16T23:59:59+0000"}