{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Hourly paid"}}, "datePosted": "2020-11-05T15:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;***Previous applicants need not apply***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced Nursing Assistant seeking a flexible work pattern? Or are you a student nurse, therapist or medical student, having completed your first placement, and seeking further experience?&lt;br /&gt;&lt;br /&gt;If so, please read on…&lt;br /&gt;We are currently looking for flexible, adaptable, motivated and reliable nursing assistants who have some experience working within acute settings, to work as part of a growing team. &lt;br /&gt;&lt;br /&gt;As one of the leading trusts in clinical excellence, we provide you with excellent opportunities and offer you a competitive rate for your services. &lt;br /&gt;&lt;br /&gt;In return, successful candidates will be expected to work across the trust, deliver direct patient care in line with our ‘world class care’ philosophy, perform independent patient and family centered care as well as assist the multidisciplinary team in keeping up to date and accurate nursing documentation. &lt;br /&gt;&lt;br /&gt;The trust operates its own extremely active staff bank and provides excellent clinical and educational opportunities for health care assistants to gain a wide range of experience throughout all departments. &lt;br /&gt;&lt;br /&gt;If you have good communication skills, work well in a fast paced environment, the Royal Free welcomes your application.&lt;br /&gt;&lt;br /&gt;Please read the person specification carefully, before submitting your application. If you do not fit the essential criteria, you will not be shortlisted for this post.&lt;br /&gt;&lt;br /&gt;Successful candidates will be required to undertake a written numeracy, literacy and clinical awareness test prior to interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Royal Free Temporary Staffing Team&lt;/p&gt;\n&lt;p&gt;Email address: rf.tsrecruitment@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet and Chase Farm and Hampstead, London", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Bank Nursing Assistant Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258414", "validThrough": "2020-11-09T23:59:59+0000"}