{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-04T13:30:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Trust Advert Standard&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Details&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Breast Unit Clerical Officer/Secretarial Assistant&lt;/li&gt;\n&lt;li&gt;Breast Unit, Clinical Support Services&lt;/li&gt;\n&lt;li&gt;Pan Trust (primarily based at County Hospital, Lincoln but Trustwide working is required)&lt;/li&gt;\n&lt;li&gt;Band 2&lt;/li&gt;\n&lt;li&gt;37.50hrs&lt;/li&gt;\n&lt;li&gt;Permanent Contract&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust – Branding Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The United Lincolnshire Hospitals NHS Trust is one of the largest hospital trusts in the country. We provide a comprehensive range of hospital based medical, surgical, paediatric, obstetric and gynaecological services to over 800,000 people across the county of Lincolnshire. We operate 4 hospital sites and deliver services in a range of other settings; we employ around 7,800 staff, and have a turnover in excess of £400m per annum.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast Screening - &lt;/strong&gt;The Lincolnshire Breast Screening Service serves a population of approximately 130,000 women aged between 50 and 70 years. The service has 3 static units (Boston, Lincoln and Grantham) plus 2 mobile units.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Symptomatic Service&lt;/strong&gt; - The Diagnostic Breast Imaging Service is provided from Lincoln County Hospital, Pilgrim Hospital Boston and Grantham District General Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; About the Role….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a clerical officer/secretarial assistant within the Breast Service who can undertake general clerical and reception duties on a daily basis, primarily, in the breast unit at the County Hospital, Lincoln. Secretarial related typing will be required to support the breast screening imaging secretary therefore typing experience would be essential. Good organisational skills will be necessary to work as part of an existing team and there will be daily liaison with colleagues (Trustwide), patients, general public and other NHS and public organisations. The main administration office is based at the County Hospital, Lincoln but there may be occasions where administration cover will be required at the breast unit at Pilgrim Hospital, Boston or Grantham Hospital. Trustwide working is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Basic general secondary education level, to include GCSE English, or equivalent, is the minimum academic requirement. Experience of working in a busy office environment is essential and experience of a healthcare setting is desirable. You should be computer literate and have good communication skills. Ideally you will have a basic knowledge of CRIS &amp; MEDWAY, but this is not essential and training will be provided as necessary. Typing skill necessary and report typing an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return, we will support your personal development and continued professional development, and offer you to be part of our team. The NHS also offers one of the most competitive benefits package with regards to Annual Leave, Pensions and a comprehensive range of NHS Discounts.&lt;/p&gt;\n&lt;p&gt;To submit an application, please click on the apply button below and submit your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;United Lincolnshire Hospitals NHS Trust recognises that everyone is different, and values the unique contribution that individual experiences, knowledge and skills make in delivering quality healthcare and becoming a model employer.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to Equal Opportunities and improving working lives. We welcome applications from members of the minority ethnic groups and people with disabilities who are currently underrepresented in our workforce. All applications will be treated on merit. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Safeguarding Children and Vulnerable Adults&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;United Lincolnshire Hospitals Trust is committed to safeguarding and promoting the welfare of children, young people and adults, both as service users and visitors to Trust premises. All staff have a responsibility to safeguard and promote the welfare of children and adults.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlysa PageJob titleProgramme ManagerEmail addressalysa.page@ulh.nhs.ukTelephone number01522 597626&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "United Lincolnshire Hospitals NHST Trust, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Breast Services Clerical Officer/Secretarial Assistant - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256022", "validThrough": "2020-11-12T23:59:59+0000"}