{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-11-05T14:16:14+0000", "description": "&lt;p&gt;We are looking to recruit an enthusiastic and self-motivated individual who would like to join our stores team in the Pharmacy Department at Scarborough Hospital.&lt;/p&gt;\n&lt;p&gt;Stock management is crucial within pharmacy; this involves checking, receiving and storing medicines. Ensuring that medicines are stored appropriately and securely both in pharmacy and on a ward level, participating in stock-taking and the checking of medicines is an important part of this role, so attention to detail is vital.&lt;/p&gt;\n&lt;p&gt;The post holder will also undertake various housekeeping duties including checking and filing documents, processing waste and excess medicines and other duties supporting the efficient and safe operation of the pharmacy department. This post involves delivering medicines and IV fluids to wards so previous experience of manual handling would be beneficial.&lt;/p&gt;\n&lt;p&gt;Previous pharmacy experience would be an advantage, but full training will be provided. You will also be required to undertake a NVQ level 2 in Pharmacy Services.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katie Allen&lt;/p&gt;\n&lt;p&gt;Principal Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Katie.allen@york.nhs.uk &lt;/p&gt;\n&lt;p&gt;01904 726218&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw.  In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough Hospital", "postalCode": "YO12 6QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2817", "longitude": "-.434723"}}, "title": "Pharmacy Assistant (Stores)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258070", "validThrough": "2020-11-18T23:59:59+0000"}