{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum"}}, "datePosted": "2020-11-06T09:16:11+0000", "description": "&lt;p&gt;NHS England &amp; Improvement in the East of England are committed to addressing health inequalities across our region. Our focus is the identification of unwarranted variation in care and outcomes for our population and supporting commissioners, providers, local authorities and sustainability and transformation partnerships to develop and deliver integrated evidence based improvement programmes to address this.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with a passion for improvement to join our friendly and innovative improvement team. Experience of working in a healthcare environment is an advantage and we are particularly interested in individuals with a background in transformation, elective care or urgent and emergency care. Knowledge of improvement methodology, and experience in developing and delivering improvement programmes is essential&lt;/p&gt;\n&lt;p&gt;We aim to make improvement integral to every role across the organisation to enable us to co design and support improvement programmes with our systems across our region. This role will therefore involve working with internal staff to support their learning and development in improvement as well as with stakeholders across our systems on specific priority areas that address the needs of their populations.&lt;/p&gt;\n&lt;p&gt;If you would like to learn more about this exciting position please contact either Jenny Mooney - Head of Improvement for NHS England and Improvement, Sheena Nixon - Assistant Director of Programmes at jenny.mooney@nhs.uk and sheena.nixon@nhs.net&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sheena Nixon&lt;/p&gt;\n&lt;p&gt;Job title: Assistant Director of Programmes&lt;/p&gt;\n&lt;p&gt;Email address: sheena.nixon@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Victoria House, Fulbourn", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Head of Outpatient Transformation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258994", "validThrough": "2020-11-22T23:59:59+0000"}