{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19020", "minValue": "17652", "unitText": "YEAR", "value": "£17,652 - £19.020"}}, "datePosted": "2020-11-06T08:33:08+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;North Hampshire Urgent Care (NHUC) provides Out of Hours services to a population of half a million across North Hampshire and North West Surrey, on behalf of the local Clinical Commissioning Groups (CCGs). &lt;/p&gt;\n&lt;p&gt;We are a forward thinking not-for-profit Community Benefit Society, led by a Management Council with a majority of GP members. We pride ourselves on being clinically led and patient focused. We are rated “Good” by the CQC and have excellent relationships with our commissioners and local GP practices. We work in partnership with South Central Ambulance NHS Foundation trust (SCAS) who are the 111 provider across the patch. &lt;/p&gt;\n&lt;p&gt;We are pleased to be able to confirm that we have a vacancy for a bank shift co-ordinator / receptionist for Hantsdoc, currently located at Hook Surgery during the Coronavirus pandemic.  &lt;/p&gt;\n&lt;p&gt;This key role will provide a focal point and first point of contact for many patients, relatives, carers and other external professionals accessing the Out of Hours Service.&lt;br /&gt; &lt;br /&gt; We would specifically be looking for the applicant to be willing to cover evenings, including weekends and bank holidays (including Christmas Day and Boxing Day)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; To apply, please submit your expression of interest to Sophie Avoth (sophie.avoth@nhs.net).&lt;/p&gt;\n&lt;p&gt;If you have not heard from us within 2 weeks after the closing date, please assume you have not been successful in your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "External Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hook Surgery, Reading Road, Hook", "postalCode": "RG27 9ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2866", "longitude": "-.962932"}}, "title": "Bank Shift Co-ordinator / Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258916", "validThrough": "2020-11-16T23:59:59+0000"}