{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc HCAS"}}, "datePosted": "2020-11-04T12:01:55+0000", "description": "&lt;p&gt;Westminster CAMHS Neurodevelopmental Team are seeking an enthusiastic and skilled ADHD nurse.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in an inner London CAMHS team, providing specialist assessments and treatment for a diverse population. As part of an established and highly respected team that includes psychologists, psychiatrists, nurses and a Behaviour Analyst, the ADHD nurse will be leading in the organisation and delivery of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ADHD assessment&lt;/li&gt;\n&lt;li&gt;psychoeducation for parents and children&lt;/li&gt;\n&lt;li&gt;medication initiation and trial of medication reviews&lt;/li&gt;\n&lt;li&gt;ADHD review clinics to monitor medication&lt;/li&gt;\n&lt;li&gt;Advice to parents on behavioural management and parenting strategies&lt;/li&gt;\n&lt;li&gt;Support to parents and young people seeking help between clinic appointments or when in crisis&lt;/li&gt;\n&lt;li&gt;Close liaison with schools in relation to progress at school and response to medication.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have an interest in applying a range of therapeutic nursing models in a flexible way, working directly with children and their families and also indirectly through liaison and consultation with the multidisciplinary teams, social care and schools. You will be supervised and supported by a Lead Nurse &amp; ADHD Nurse Specialist.&lt;/p&gt;\n&lt;p&gt;Special interests within the department include cognitive &amp; learning assessments, systemic approaches, ADOS and high-functioning autism.&lt;/p&gt;\n&lt;p&gt;We work closely with our other CAMHS community teams and there is access to CPD and peer support. Potential training opportunities include: ADOS, 3Di, Non-Medical Prescribing, Parent training, Systemic Thinking &amp; Practice.&lt;/p&gt;\n&lt;p&gt;Clinical work is based in Westminster CAMHS, Woodfield Road.&lt;/p&gt;\n&lt;p&gt;CNWL (Central and North West London NHS Foundation Trust) has almost 7,000 staff providing integrated healthcare to a third of London&#39;s population, Milton Keynes and areas beyond. We involve service users, carers, the public, staff and partner organisations in the way that we are run. You can become a member by visiting our website.&lt;/p&gt;\n&lt;p&gt;Our catchment area spans diverse communities, with over 100 first languages spoken. It contains areas of great affluence as well as areas of much deprivation. We are committed to providing services that meet the needs of the people who use them, and we actively encourage involvement from local people who can help make a difference. We’re proud of our diversity and we continue to undertake new initiatives to advance equality for LGBT+, BME and people with disabilities to promote good relations and understanding between our staff.&lt;br /&gt;&lt;br /&gt;CNWL is recognised locally, nationally and internationally for providing high quality, innovative healthcare. We aim to employ only the best people, and our experts are frequently called upon to contribute to national health strategy and policy, and many models of our care have been adapted for use in other countries.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CNWL NHS Foundation Trust offers a generous relocation package to successful candidates - subject to eligibility assessment. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank assignments are available for most roles.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CNWL NHS Foundation Trust are committed to safeguarding all children and vulnerable adults and expect all staff and volunteers to share this commitment. We follow safe recruitment practices to protect children and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Due to the high response levels we receive for some vacancies, we may expire any of them prior to the advertised closing date and advise you to submit your application as soon as possible.&lt;/p&gt;\n&lt;p&gt;Interview date: 8th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSamantha ReynoldsJob titleLead NurseEmail addresssamantha.reynolds1@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please call Samantha Reynolds, Lead Nurse on 020 33175999.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Westminster CAMHS, London", "postalCode": "W9 2NW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5221", "longitude": "-.198448"}}, "title": "ADHD Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255737", "validThrough": "2020-11-29T23:59:59+0000"}