{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-27T10:15:49+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialist Occupational Therapist –Bramhall Manor Discharge to Assess – Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(37.5 hours –part time hours may be negotiable)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The service operates on a 7 days per week basis.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for Occupational Therapists to join our multi-professional team at Bramhall Manor (Discharge to Assess Unit) based in Bramhall.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and highly motivated Occupational Therapists to be part of our therapy and multi-professional team. The post holder with be responsible for assessing patients discharged from the acute setting to determine the most appropriate discharge destination and provide brief therapy input. Work will involve assessments and follow up intervention, environmental and home assessments plus assessment and provision of equipment as appropriate. The ability to effectively communicate with patients, family/carers, other members of the team and other agencies is essential. The successful applicant needs to be able to demonstrate they can work both autonomously and also as part of a multi professional team, with consideration of time constraints. Regular supervision and support will be provided and there will be opportunities for further development and training as appropriate. Previous experience in this area is desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen RileyJob titleTherapist Team LeadTelephone number0161 549 9651 X 171/172Additional contact information&lt;/p&gt;\n&lt;p&gt;Helen Riley&lt;/p&gt;\n&lt;p&gt;0161 549 9651 X 171/172&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bramhall Manor, Stockport", "postalCode": "SK2 7BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3849", "longitude": "-2.14767"}}, "title": "Occupational Therapist Band 5/6 dependant on experience", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243957", "validThrough": "2020-11-10T23:59:59+0000"}