{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "44994", "unitText": "YEAR", "value": "£44,994 - £51,069 pro rata, per annum"}}, "datePosted": "2020-10-26T20:00:22+0000", "description": "&lt;p&gt;&lt;strong&gt;GREAT ORMOND STREET HOSPITAL FOR CHILDREN NHS FOUNDATION TRUST AND UNIVERSITY COLLEGE LONDON NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TRUST FELLOW IN PAEDIATRIC UROLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Equivalent of Specialist Trainee 7+)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To commence 7th April 2021 to 2nd April 2024, dependent on satisfactory progress (2 posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for two Paediatric Urology Fellowships in Paediatric Urology based at Great Ormond Street Hospital and University College London Hospitals for 12 to up to 36 months, dependant on satisfactory progress.&lt;/p&gt;\n&lt;p&gt;The Departments of Paediatric Urology at Great Ormond Street Hospital and University College London Hospitals function as a virtual single unit across the two sites and this post offers an opportunity to experience the full breadth of Paediatric Urology. There is an active academic programme.&lt;/p&gt;\n&lt;p&gt;The post is at middle grade level and training will be offered alongside two London Deanery Trainees and six Paediatric Urology Fellows. The post holders are expected to contribute to the Paediatric Urology Specialist Trainee on call rota which operates across both sites.&lt;/p&gt;\n&lt;p&gt;The Fellowship post is most suitable for candidates who wish to build on previous experience in paediatric urology or adult urology by spending this time in a busy clinical and academic department certified by the JCPU towards a FEAPU.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the GMC and fulfil the entry criteria for higher surgical training, which includes the satisfactory completion of basic surgical training (or equivalent). You must have passed the International English Language Testing System (IELTS) examination to apply for this post.&lt;/p&gt;\n&lt;p&gt;Based in central London, GOSH offers flexible working, help with childcare and travel, excellent training and development opportunities and assistance with finding somewhere to live.&lt;/p&gt;\n&lt;p&gt;All applicants should return their application forms electronically. To apply online, please go to NHSjobs, you must register first before you can apply for the post.&lt;/p&gt;\n&lt;p&gt;We conduct full criminal record checks on all successful candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMiss Naima SmeuldersJob titleConsultant in UrologyTelephone number020 7405 9200 extension 5918 (secretary).Additional contact information&lt;/p&gt;\n&lt;p&gt;You must register first before you can apply for the post. If you have any queries then to contact us via email at vacancy@gosh.nhs.uk. Please quote the appropriate reference number.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Trust Fellow in Paediatric Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243635", "validThrough": "2020-11-22T23:59:59+0000"}