{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24214", "minValue": "24214", "unitText": "YEAR", "value": "From £24,214 per annum"}}, "datePosted": "2020-11-02T17:01:20+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;This is a Fixed Term/Secondment Until May 2021&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Assessment and Recovery Service – for North Bristol, Bristol Locality, Ageless Service&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and dynamic registered Mental Health Nurse to join our friendly team which provides a service to people from the centre to the north of Bristol.&lt;/p&gt;\n&lt;p&gt;You would be working in one of three friendly and supportive multidisciplinary clusters which are clinically led by a Consultant Psychiatrist. Experience of community mental health or similar would be an advantage in this role. However, training is available for suitable candidates.&lt;/p&gt;\n&lt;p&gt;You would be planning and delivering clinical interventions to service users living in the community alongside our highly skilled multi-disciplinary team to make meaningful recovery a reality.&lt;/p&gt;\n&lt;p&gt;You will need to be organised and be mobile as you would be working from a number of locations across North Bristol.&lt;/p&gt;\n&lt;p&gt;Experience of working with individuals who are recovering from mental health challenges would be very helpful. However, we have found that applicants often have transferrable experience which can also be helpful to this role.&lt;/p&gt;\n&lt;p&gt;Please feel free to call for a chat to discuss the role.&lt;/p&gt;\n&lt;p&gt;Our team is located in a vibrant base with a gym and a café in the heart of Southmead.&lt;/p&gt;\n&lt;p&gt;Plenty of support and supervision is available and there are opportunities to develop professional skills.&lt;/p&gt;\n&lt;p&gt;You will have the security of working for the NHS and will receive a competitive benefits package which includes excellent annual leave and staff discounts.&lt;/p&gt;\n&lt;p&gt;This is an excellent team which really cares about quality and which is dedicated to helping people to recover whilst supporting each other.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kim Cooper, Team Manager or Steve Bray/ Ben Thomas/ Nikki Solman, Senior Practitioners&lt;/p&gt;\n&lt;p&gt;Tel: 0117 3547300&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenway Centre, Doncaster Road, BS10 5PY, Bristol", "postalCode": "BS10 5PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5001", "longitude": "-2.60803"}}, "title": "Band 5 Recovery Practitioner (Nurse) - The Greenway Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252977", "validThrough": "2020-11-16T23:59:59+0000"}