{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 gross per annum"}}, "datePosted": "2020-11-05T16:16:45+0000", "description": "&lt;p&gt;Mental Health Nurses Band 5 to Band 6 development rotation with £3,000 welcome bonus.&lt;/p&gt;\n&lt;p&gt;“To provide the absolute best care, you need to be supported in your career, you need to be given the opportunity to be listened to and have your opinion valued.” Ches Hankins - Lead Nurse&lt;/p&gt;\n&lt;p&gt;We are pleased to offer Band 5 to Band 6 developmental opportunities in our acute adult mental health services based in King’s Lynn based from our purpose built, award winning facility and within our sister facility 10 minutes away. For external applicants these posts come with &lt;em&gt;a £3000 incentive and relocation package of up to £5000&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We want to recruit Band 5 Registered Mental Health or Learning Disability Nurses, including newly qualified or soon to qualify student nurses.&lt;/p&gt;\n&lt;p&gt;Our primary focus is on collaborative working; placing great emphasis on the assessment/recovery model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So, what are we offering?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering enviable developmental exposure across a spectrum of acute services via these newly created rotational posts. You will build your skills and experience within our Mental Health Liaison, Crisis and Home Treatment and our Adult Inpatient Service We expect each rotation to be 4 months and will offer you the chance to develop and imbed your skills. Whilst these roles will be fast paced and challenging, we will also offer the security and stability of one mentor and supervisor during this rotational period, who themselves is an expert in all fields of acute services.&lt;/p&gt;\n&lt;p&gt;We understand that in order to attract the best people, we need to develop career pathways and support staff to reach their full potential&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How we will support your development:&lt;/strong&gt; &lt;br /&gt;We offer an excellent bespoke training programme including (but not limited to):&lt;/p&gt;\n&lt;p&gt;Suicide and self injurious behavior training&lt;br /&gt;Personality Disorder awareness training&lt;br /&gt;Physical health care training&lt;br /&gt;PIT (Physical Intervention Training)&lt;br /&gt;Access to L6 and L7 academic modules at local and regional universities (subject to university criteria and availability)&lt;br /&gt;Access to NHS funded CPD programmes&lt;br /&gt;Access to NHS England Learning Hub &lt;br /&gt;Personal development and leadership programmes to support progression in your future career&lt;/p&gt;\n&lt;p&gt;Corporate induction and a comprehensive 2 week local induction programme&lt;br /&gt;Regular statutory and mandatory training&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where could this take you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The expectation would be that you will achieve a Band 6 Senior Nurse position at the end of the first year of the role and continue as a substantively employed Band 6 in one of the teams where you have completed a 4 month rotation.&lt;/p&gt;\n&lt;p&gt;The next steps from this point are varied and interesting. In our team, we have already successfully developed exciting and specialist nursing career pathways including a Clinical Director role, Nurse Consultants, Advanced Nurse Practitioners and Non Medical Prescribers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you who we are looking for? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust vales of Positively, Respectfully and Together sum up perfectly what this role encompasses.&lt;/p&gt;\n&lt;p&gt;You will need to be enthusiastic and conscientious and do everything you can to provide the best care to our service users. We are looking for someone who displays compassion, empathy and sensitivity in your approach to people who may be distressed or have a challenging manner.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We want……&lt;/strong&gt;&lt;br /&gt;• Ambitious Registered Mental Health /Learning Disability Nurses looking to progress your career&lt;br /&gt;• Passion about delivering high quality patient care to patients and developing your skills in adult acute mental health services &lt;br /&gt;• Compassion&lt;br /&gt;• Skilled at communicating and providing information to patients, carers and health colleagues&lt;br /&gt;• The enthusiasm and ability to work effectively and flexibly with patients, carers, colleagues and other internal and external stakeholders&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why West Norfolk?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;West Norfolk, a truly special place of unspoilt charm and natural beauty. Set against a backdrop of stunning coastline and beautiful countryside, this wonderful side of&lt;/p&gt;\n&lt;p&gt;Norfolk is a sheer pleasure to explore. West Norfolk’s not just about beaches, but what a great place it is to enjoy the sand and sea! Room to breathe and enjoy life.&lt;/p&gt;\n&lt;p&gt;Norwich and Cambridge are both within easy access for shopping and with London less than 2 hours by train you can have the best of all worlds.&lt;/p&gt;\n&lt;p&gt;For people having to relocate we can offer temporary accommodation to help with the transition as well as financial support&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other and are looking forward to welcoming you!&lt;/p&gt;\n&lt;p&gt;If you would like to learn more about these exciting new developmental opportunities or visit our acute services please contact Ches Hankins, Lead Nurse, on 01553 609933 or email francesca.hankins@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via MS Teams rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatterton House, King&#39;s Lynn", "postalCode": "PE30 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7481", "longitude": ".408741"}}, "title": "Mental Health Nurse - Developmental role with welcome bonus of £3000", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258537", "validThrough": "2020-11-22T23:59:59+0000"}