{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 pa inc"}}, "datePosted": "2020-11-02T09:31:14+0000", "description": "&lt;p&gt;An opportunity has arisen for a Band 5 Staff Nurse to join the Critical Care team based at Ealing Hospital London North West University Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit consists of a nine bedded Intensive Care Unit and combined High Dependency Unit . The Critical Care Unit also operate a 24/7 Critical Outreach service, supporting patients throughout the hospital as well as supporting teaching and training.&lt;/p&gt;\n&lt;p&gt;As a Critical Care Unit, we are specialising in providing a high standard of care for patients undergoing a variety of procedures. The majority of the admissions are medically based, covering level 2 and level 3 patients requiring organ support such as Respiratory, Cardiovascular and Renal. We also work closely with other Specialist Units around the UK such as Respiratory and Renal support Units.&lt;/p&gt;\n&lt;p&gt;The Unit is a longstanding member of ICNARC, submitting data to the largest health data base in the world. We are also an active member of the North West London Critical care Network. Ealing ITU is part of a bigger Critical Care Unit at LNWUH NHS Trust , and as a B5 Staff Nurse, you will be expected to work cross site when required . This will help to assist with developing your skills and experience, with Ealing as your base unit.&lt;/p&gt;\n&lt;p&gt;As a band 5 you will receive in-house training and development as well as rotating study days and a competency programme. You will be supported by our PDN and the team leaders, as well as a Mentor. You must be able to care for patients requiring Aerosol Generated Procedures and COVID-positive patients to work in this position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMartina EliasovaJob titleSenior SisterEmail addressMartina.eliasova@nhs.netTelephone number0208 967 5593 / 5751&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Hospital Site, Southall", "postalCode": "UB1 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.507", "longitude": "-.346317"}}, "title": "Staff Nurse - Intensive Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251416", "validThrough": "2020-11-16T23:59:59+0000"}