{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive + Salary"}}, "datePosted": "2020-09-26T15:41:57+0100", "description": "&lt;p&gt;If you are an experienced Psychologist looking for a rewarding job, where you can make a difference and change lives for the better, then join the team in the Lake District and enjoy support from a regional network of psychologists.&lt;/p&gt;\n&lt;p&gt;You will be working at Gregory House (Workington) and Ann House (Kendal), a specialist service for people with learning disability/autism, mental health needs and/or challenging behaviours. You will provide care and support to allow people to be as independent as possible with the long-term aim of people moving onto a more independent living setting.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Regional Service Lead, you will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working and risk assessments. You will also facilitate staff reflective practice sessions and be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;As a Psychologist, you will have experience and knowledge in carrying a service user’s caseload, including assessing complex needs and designing and delivering specialist psychological treatments to support their care plans.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be accountable for the formulation, delivery and evaluation of the psychological assessment and treatment pathway of these service users. To provide this service within specified timescales depending on the service user’s presentation.&lt;/li&gt;\n&lt;li&gt;Assist the nursing team with FACE risk assessments as required and ensure these are updated within required time scales.&lt;/li&gt;\n&lt;li&gt;Contribute to the Positive Behavioural Support approach used, contributing to functional behaviour analysis, data analysis, formulations and implementing interventions in conjunction with the Positive Behaviour Support lead.&lt;/li&gt;\n&lt;li&gt;Contribute to the development of group work programmes with the North region psychology services and LD and ASD psychology services. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BPS recognised psychology degrees.&lt;/li&gt;\n&lt;li&gt;HCPC Registration.&lt;/li&gt;\n&lt;li&gt;Knowledge and experience of working within a Positive Behaviour Support Approach model &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:  &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive annual salary&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lake District", "postalCode": "LA6"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1954", "longitude": "-2.54878"}}, "title": "Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201566", "validThrough": "2020-11-26T23:59:59+0000"}