{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-28T16:16:09+0000", "description": "&lt;p&gt;&lt;strong&gt;The Somerset Neonatal Unit have some great opportunities for Registered Nurses to join our friendly team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are based at Musgrove Park Hospital in Taunton and have 18 cots, 8 Intensive Care/High Dependency and 10 Special Care. We run a Transitional Care Service in partnership with the Post Natal Ward.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you ambitious and keen to access further qualifications? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;After a period of time working in the Unit, there is the opportunity to complete a Qualification in Speciality at Plymouth University or UWE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working in Somerset, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you already have some experience in Neonatal or Maternity Care? Great, we would love to give you the opportunity to utilise that valuable experience within our team!&lt;/p&gt;\n&lt;p&gt;Or, is this a new area for you? Then we would be a great team to join as you embark on this new area of your career as we are able to provide you with full training!&lt;/p&gt;\n&lt;p&gt;If you fall into either of the above category then we would love to hear from you. We welcome informal conversations if you would like to know more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Susan Fulker&lt;/p&gt;\n&lt;p&gt;Job title Neonatal Unit Manager&lt;/p&gt;\n&lt;p&gt;Email address susan.fulker@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01823 342517&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove park Hospitaal, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Staff Nurse - Neonatal Unit (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247348", "validThrough": "2020-11-09T23:59:59+0000"}