{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pro rata for part-time"}}, "datePosted": "2020-10-29T11:18:12+0000", "description": "&lt;p&gt;We have a fantastic opportunity to join our friendly department in the heart of beautiful Cornwall. Applications are invited for a substantive post as a Specialty Doctor in Oncology, working two clinical sessions on Tuesdays.&lt;/p&gt;\n&lt;p&gt;This popular role focuses on the ongoing care in outpatients of cancer patients and works alongside a large existing team of General Practitioners working in Oncology. There is a specific gap in support on Tuesdays which would involve mainly working with the Breast cancer teams. You will be working closely with the Oncology Consultants and wider team, and will be trained to assess and support cancer patients, including the safe prescription of Systemic Anti-Cancer Therapy. We want you to develop in this role, becoming an important part of our team.&lt;/p&gt;\n&lt;p&gt;As the only Cancer Centre for the Duchy, the Sunrise Centre at RCHT provides a full range of cancer treatments for our patients as close to home as possible. We are early adopters of new treatments and have a large and active clinical trial portfolio, being second highest recruiters in the Peninsula. Alongside this quality of care, we also deliver in quantity, regularly being in the top five departments in the country for radiotherapy treatments per machine and treatment complexity. We continue to be the highest scoring Trust in the South-West in the National Cancer Patient Experience Survey with our highly trained specialist nurses notably praised. With £135 million in new investments, the Trust is currently&lt;br /&gt;building a brand new Haematology - Oncology Inpatient Unit, due to open in 2022. We will also be launching our radiotherapy SABR service later in 2020.&lt;/p&gt;\n&lt;p&gt;The pandemic has shown how important quality of life and work-life balance are. Cornwall is a beautiful county, offering outstanding quality of life with many opportunities for outdoor activities. Sailing waters, surfing beaches, rugged coastal pathways and a thriving arts and theatre scene all make weekends long and sunsets memorable. We have risen to the challenges posed by altering our clinical pathways to provide care and oversight closer to patients and virtually when we can.&lt;/p&gt;\n&lt;p&gt;For further information on our service, please download our MySunrise app for smartphones and tablets or watch us on youtube.com/watch?v=z3OjrWoU8Yg&lt;/p&gt;\n&lt;p&gt;Please contact Dr Grant Stewart, Clinical Lead for Oncology on grantstewart1@nhs.net to discuss this great opportunity.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "GP Specialty Doctor in Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248098", "validThrough": "2020-11-08T23:59:59+0000"}