{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-10-20T13:31:01+0100", "description": "&lt;p&gt;Veterans’ mental health complex treatment service (VMH CTS) – North West and North East Border (including Newcastle)&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and highly motivated mental health practitioner (RMN/occupational therapist/social worker) to join LYPFT’s Clinical Team of the Year covering the North West and across into the North East. This exciting opportunity, within an innovative and experienced MDT and with our partner provider Combat Stress, is keen to recruit forward thinking clinicians. You will have post registration experience and be able to demonstrate an understanding of the needs of military veterans’ suffering combat related mental health problems within this community service to stabilise, treat and integrate veterans who have complex health needs.&lt;/p&gt;\n&lt;p&gt;You will be required to provide care coordination, utilising the CPA framework, for the delivery of care; maintaining a focus on recovery and adopting a person-centred approach. You will have excellent communication, organisational and clinical reasoning skills, as well as the ability to travel across the geographical region of the service.&lt;/p&gt;\n&lt;p&gt;You will deliver stabilisation interventions to veterans on your caseload in addition to on-going assessment of mental state and risk management, promoting the active involvement of veterans and carers in all aspects of their care delivery.&lt;/p&gt;\n&lt;p&gt;The successful candidate will receive training, support and supervision from a senior practitioner, with a strong emphasis on personal and professional development. This role is community based and it is essential that you have a full UK driving license and use of a car. We strongly recommend contacting the service prior to making an application.&lt;/p&gt;\n&lt;p&gt;For further details or an informal conversation, please contact Vicki Ray, Clinical Team Manager on 07980 966788/0113 8557777&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Veterans Mental Health Complex Treatment Service, Carlisle", "postalCode": "NE2 1QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9812", "longitude": "-1.60117"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234580", "validThrough": "2020-11-10T23:59:59+0000"}