{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "31997", "unitText": "YEAR", "value": "£31,997 - £49,036"}}, "datePosted": "2020-10-29T09:20:48+0000", "description": "&lt;p&gt;Applications are invited for vacancies in the Core Anaesthetics and ACCS Anaesthetics training programmes at CT1 level across Health Education England (HEE) Local Offices, NHS Education for Scotland (NES), Northern Ireland Medical &amp; Dental Training Agency (NIMDTA) and Health Education and Improvement Wales (HEIW) starting on Wednesday 04th August 2021&lt;/p&gt;\n&lt;p&gt;Interested applicants should submit one application which will be considered for both Core Anaesthetics and ACCS Anaesthetics posts.&lt;/p&gt;\n&lt;p&gt;The application window opens on Thursday 5th November 2020 10:00 UK time and closes on Tuesday 1st December 2020 16:00 UK time. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, &#39;New Oriel&#39;. the &#39;New Oriel&#39; can be accessed from the link provided. Registration is available to applicants from Monday 2nd November 2020.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the Person Specification. The Person Specification for this speciality is available from the Specialty Training website which can be accessed from Oriel.&lt;/p&gt;\n&lt;p&gt;Please visit the Anaesthetics National Recruitment Office (ANRO) website (contact details can be accessed from Oriel) to find out the following information:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Indicative number of posts available&lt;/li&gt;\n&lt;li&gt;Interview dates&lt;/li&gt;\n&lt;li&gt;Applicant guidance (when published)&lt;/li&gt;\n&lt;li&gt;Recruitment documents&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;All medical practitioners have been added to the Shortage Occupation List in the UK. This means that all medical practitioners are exempt from the Resident Labour Market Test (RLMT) and can apply for any speciality in any recruitment round, subject to eligibility.&lt;/p&gt;\n&lt;p&gt;It is strongly suggested that you read the 2021 Medical Specialty Recruitment Applicant Handbook to familiarise yourself with the immigration information contained within.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "West Midlands Workforce Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Northern Ireland, Scotland and Wales", "postalCode": "B16 9RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4723", "longitude": "-1.93413"}}, "title": "Core Training (CT1) in Anaesthetics and ACCS (Anaesthetics)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247721", "validThrough": "2020-12-01T23:59:59+0000"}