{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-27T10:30:27+0000", "description": "&lt;p&gt;Rydon Ward in Taunton is an excellent place to start or continue your inpatient nursing career. Whether you&#39;re a newly qualified nurse, experienced or a General or Learning Disability Nurse looking for a change, we are excited to hear from you.&lt;/p&gt;\n&lt;p&gt;Rydon Ward in Taunton consists of two fifteen bedded wards which provide an environment that is modern, bright, clean and safe for individuals admitted to our service.&lt;/p&gt;\n&lt;p&gt;We are based alongside a Psychiatric Intensive Care Unit and an ECT Suite so opportunities to access experience in these areas can be easily accommodated. We also feel privileged to hold a contract for serving members of the Military, enabling the ward to work closely with the medical bases within the UK and further afield.&lt;/p&gt;\n&lt;p&gt;We are able to offer you a supportive and welcoming environment with access to supervision, appraisals, psychology services such as weekly reflective practice groups, and regular opportunities for both formal and informal training. There is a strong focus on staff wellbeing on the ward so you can be confident that you will have the support you need to continue to provide good clinical care.&lt;/p&gt;\n&lt;p&gt;There is clear clinical leadership within the wards with access to Band 6 Clinical Leads offering a supportive working environment, as well as a structure that provides future opportunities for career development.&lt;/p&gt;\n&lt;p&gt;This is a really good opportunity to work in an environment that is challenging but rewarding within a friendly and supportive team. We’re always happy to hear from potential staff so if you’d like to visit us informally to meet the team before applying please feel free to get in touch.&lt;/p&gt;\n&lt;p&gt;For those looking to escape busy city life and move to an area that is less populated with more access to open spaces, Somerset has a lot to offer you. We are able to offer a relocation package.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For an informal discussion please contact Jez Eagle or Paula Potts on 01823 333438.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "TA2 7AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0326", "longitude": "-3.10216"}}, "title": "Staff Nurse RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243997", "validThrough": "2020-11-09T23:59:59+0000"}