{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 plus HCA pa (pro rata)"}}, "datePosted": "2020-10-22T09:31:21+0100", "description": "&lt;p&gt;&lt;strong&gt;This role is eligible to receive a Golden Hello Incentive – please contact the recruitment team on 01375 364652 to find out more. &lt;/strong&gt;&lt;strong&gt;&lt;span&gt;This applies to candidates who are not currently employed by EPUT.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;New band 5 and 6 community nurses are offered the opportunity to apply for fast track programmes to support rapid progression to the next band. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Mental Health Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CALLING ALL NURSING, OCCUPATIONAL THERAPY AND SOCIAL WORK PROFESSIONALS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is also open to band 5’s on a developmental basis. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;EPUT is currently undertaking a substantial transformation project within our community mental health services, something of which supports the NHS 5 Year forward plan and the increase in mental health funding announced by the Government.&lt;/p&gt;\n&lt;p&gt;Due to these exciting changes we are looking for a senior mental health practitioner to join the EPUT team in our crisis and urgent care service. This post is open to individuals with a RMN or HCPC registration in Nursing, Occupational Therapy or Social Work with a passion for mental health.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a member of the Multidisciplinary Team, working in a fast pace community urgent care pathway offering a community response to those experiencing a mental health crisis.&lt;/p&gt;\n&lt;p&gt;You will conduct initial assessments, agree formulation of need and develop collaborative care plans underpinned by NICE guidance delivering a range of interventions based upon individual needs. You will be working within the &lt;strong&gt;Mid and South Essex&lt;/strong&gt; area over a 24 hour period and the assessments and interventions will take place in patients’ homes, team bases, hospital and other community settings or via tele-coaching.&lt;/p&gt;\n&lt;p&gt;As required by your line manager, you will have responsibility for the day to day supervision and management of your junior staff members as required.&lt;/p&gt;\n&lt;p&gt;You will be expected to work collaboratively with key partner organisations, patients, carers, clinicians and other practitioners within the multi-disciplinary team in delivering services; providing a 7- day a week service over a twenty four hour period.&lt;/p&gt;\n&lt;p&gt;This role will be working on a 12 hour shift pattern and is eligible for unsocial hour payments of time plus 30% &lt;strong&gt;on Saturday (midnight to midnight) and any week day after 8 pm and before 6 am&lt;/strong&gt; and time plus 60%&lt;strong&gt; on Sundays and Public Holidays (midnight to midnight) &lt;/strong&gt;enhancement on Sundays and bank holidays as well as your normal rate.&lt;/p&gt;\n&lt;p&gt;This post also attracts a 5% fringe supplement of the basic salary and receives a generous pension and holiday package.&lt;/p&gt;\n&lt;p&gt;EPUT has in place excelling training and development opportunities allowing our staff access to strong career pathways, including a Trust bank that all new staff can automatically join to earn additional income or expand on their experience and knowledge in different patient areas.&lt;/p&gt;\n&lt;p&gt;This post is also eligible for the Trusts relocation package of up to £6,000 to support moving costs, for more information on this please contact Paige Bradford Brown, Recruitment and Retention Manager on 01375 364513.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lynn McGhee, &lt;strong&gt;Associate Director of Adult Inpatient &amp; Emergency Care on 07773 043049&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS13 3BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5652", "longitude": ".507397"}}, "title": "Senior Mental Health Practitioner - Eligible for Golden Hello", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237712", "validThrough": "2020-11-08T23:59:59+0000"}