{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-11-03T14:01:12+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Project Manager to join the Trust on a fixed term basis to support with the delivery of Strategic Capital projects, specifically development of the new Make Ready Centres. The Project Manager will report to the Senior Project Manager to provide effective management of core project activities, helping to ensure delivery on time, budget and scope.&lt;/p&gt;\n&lt;p&gt;As the Project Manager you will play an essential role in shaping a range of projects across the Strategic Estates Portfolio from conception through to delivery. You will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading multiple projects which includes creating and maintaining project plans, facilitating project meetings, and ensuring milestone dates are achieved&lt;/li&gt;\n&lt;li&gt;Create and maintain comprehensive project documentation&lt;/li&gt;\n&lt;li&gt;Analysing and documenting project risks and issues, tracking them to project closure&lt;/li&gt;\n&lt;li&gt;Develop status/highlight reports to various Project and Programme Boards&lt;/li&gt;\n&lt;li&gt;Monitoring of the project budget(s)&lt;/li&gt;\n&lt;li&gt;Manage changes to the project scope, project schedule and project costs using PMO project framework&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The ideal candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Project Management Qualification&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and confidence to build effective relationships at all levels&lt;/li&gt;\n&lt;li&gt;Strong attention to detail&lt;/li&gt;\n&lt;li&gt;A highly logical, analytical and forward thinking approach&lt;/li&gt;\n&lt;li&gt;Ability to work quickly and efficiently under pressure and respond well to changing priorities&lt;/li&gt;\n&lt;li&gt;Excellent organizational skills with the ability to prioritize multiple tasks at one time&lt;/li&gt;\n&lt;li&gt;Experience with working in a project environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a current SECAmb employee, by applying for this position, if successful you will move to the terms and conditions associated with the post. Any unsocial hours payments will be paid under the Section 2 agreement of agenda for change. Section 2 unsocial hours will need to be claimed via your monthly timesheet. More information regarding section 2 can be found in the Agenda for Change handbook and on the our dedicated Section 2 page on The Zone .&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please don&#39;t apply for this position if you have applied previously either directly or via an agency. CVs will not be accepted. Please apply via the application form on NHS Jobs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;eileen.sanderson@secamb.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121186.jpg", "name": "South East Coast Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121186"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nexus House, Crawley HQ, Crawley", "postalCode": "RH10 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1327", "longitude": "-.168947"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254234", "validThrough": "2020-11-10T23:59:59+0000"}