{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75914", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 per annum"}}, "datePosted": "2020-10-30T16:16:56+0000", "description": "&lt;p&gt;&lt;strong&gt;All staff are eligible to apply however staff must ensure they have the permission for a secondment application from their substantive line manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for the exciting opportunity to become Head of Portfolio for a HEE business programme. The DEQ National Team has three Head of Portfolio posts available on a secondment basis for up to 12 months. The three portfolios are&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Primary &amp; Community Integration&lt;/li&gt;\n&lt;li&gt;Long term conditions, Cancer &amp; Diagnostics and Maternity&lt;/li&gt;\n&lt;li&gt;Quality &amp; Patient Safety&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;The roles will be fundamental in the leadership, planning and effective implementation of education and training delivery plans for HEE.&lt;/p&gt;\n&lt;p&gt;Each Head of Portfolio will need to be able to lead and oversee a number of programmes within the Portfolio and coordinate their scope, design and planning from proof of concept work through to planning, implementation and evaluation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Head of Primary Care Portfolio&lt;/strong&gt; – You will work in collaboration with system leaders at national, regional and local level, to deliver the key Government priorities to expand the primary care workforce. Leading this complex education and training programme for Primary and Integrated Care you will need to influence and deliver key developments across England, for workforce transformation within Primary Care Networks, through HEE’s Training Hubs&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Head of Cancer &amp; Diagnostics, Maternity &amp; CYP Portfolio&lt;/strong&gt; – You will be required to collaborate and influence national stakeholders to develop and deliver aligned workforce plans across a number of healthcare service pathways, and in line with the NHS Long Term Plan and NHS People Plan. Leading a number of education and training programmes simultaneously for national whole system benefit, you will ensure programme and workforce planning and delivery aligned to the ambitions to system wide service plans.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Head of Quality and Patient Safety Portfolio&lt;/strong&gt; – You will implement HEE’s Quality &amp; Patient Safety Strategy, including applying Quality Management methodologies and systems to deliver tangible and measurable quality improvement in healthcare education and training, reforming how we use data, information and insight to have clear oversight of quality at all levels of the organisation. You will work with system partners, including CQC, NHS England &amp; Improvement and Professional Regulators across a multi professional clinical agenda, driving our strategy to improve supervision, trainee and learner experience and ultimately patient care. Working, with system partners at national and local level, you will lead the development and implementation of NHS Patient Safety training, aligned to the NHS Patient Safety Strategy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will commence at the bottom of Band 8d with a full-time starting salary of £75,914 with a pay step increase after 5 years’ service. These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An Inner London High Cost Area Supplement of 20% of basic salary, subject to a minimum payment of £4,400 per annum and a maximum payment of £6,777 per annum. This is offered in accordance with NHS Terms and Conditions and is based on current office location&lt;/p&gt;\n&lt;p&gt;Please note there will be an assessment immediately prior to the interview for these posts. Interviews will be conducted online via MS Teams or an alternative.&lt;/p&gt;\n&lt;p&gt;The posts are offered at any HEE office, however remote working will be the default position during the current COVID 19 Pandemic. This will be continually reviewed in line with HEE policy.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the advert early once a sufficient number of applications has been received&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRia CoreyJob titleHead of GLP DeliveryEmail addressRia.corey@hee.nhs.ukTelephone number07920 834876&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "LS1 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7988", "longitude": "-1.55967"}}, "title": "Head of Portfolio", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250915", "validThrough": "2020-11-15T23:59:59+0000"}