{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T11:46:57+0000", "description": "&lt;p&gt;&lt;strong&gt;The Position:&lt;/strong&gt; Consultant in Medical Oncology covering Urology (testicular/prostate/renal) and lung .&lt;/p&gt;\n&lt;p&gt;This post has been assessed as attracting 10 basic PA’s per week plus additional programmed activities by separate negotiation, as well as a 1:12on call. This is a Trustwide appointment based at Lincoln County Hospital with one day a week at Pilgrim Hospital, Boston.&lt;/p&gt;\n&lt;p&gt;You will be joining a team of 13 Consultants providing comprehensive Oncology services to the 750,000 strong population of Lincolnshire. ULHT has a comprehensive range of radiotherapy and chemotherapy treatments at Lincoln County Hospital, with chemotherapy also provided at Pilgrim Hospital (Boston) and Grantham and District Hospital. In addition we have a Mobile chemotherapy unit (MCU) that delivers chemotherapy to eligible patients in Louth, Grantham and Skegness. Out-Patient clinics are provided at Lincoln County Hospital and Pilgrim Hospital Boston.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Outpatient clinics are undertaken via virtual clinics using Attend Anywhere Software where possible and we are currently piloting virtual wards rounds, so there are opportunities to be able to work from home at certain times/days&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;You will be supported by 4 Specialty Doctors, 2 trainee Doctors along with, 2 Acute Care Practitioners and 3 Clinical Nurse Specialists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Payscale: &lt;/strong&gt;Consultant Pay Scale £77,913-£105,042 dependent upon experience&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base:&lt;/strong&gt; Lincoln with one date for week at Pilgrim Hospital Boston&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Unique Selling Points to working in Lincolnshire for United Lincolnshire Hospitals NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We offer the following unique only to Lincolnshire &lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Direct links to the new £21 million Lincoln Medical School via Lincoln University&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;The new facility is due to come on line soon and is scheduled for completion in Spring 2021&lt;/li&gt;\n&lt;li&gt;The facility will include:-\n&lt;ul&gt;\n&lt;li&gt;Clinical skills suite with mock consultation rooms (including hospital wards or a GP surgery) with the latest technologies to provide high quality teaching&lt;/li&gt;\n&lt;li&gt;2 x 120 capacity lecture theatres&lt;/li&gt;\n&lt;li&gt;Seminar space&lt;/li&gt;\n&lt;li&gt;Café and social learning space&lt;/li&gt;\n&lt;li&gt;Library, Science Library and Project Library&lt;/li&gt;\n&lt;li&gt;Anatomy Suite and Clinical Skills Suite&lt;/li&gt;\n&lt;li&gt;The entire building is designed to meet BREEAM (Building Research Establishment Environmental Assessment Method)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This new facility will enable medical students to explore the latest technology developments in healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Research:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Trust’s Oncology Department is heavily involved in Phase 3 and 4 clinical trials.&lt;/li&gt;\n&lt;li&gt;You will have the opportunity to develop your own research interest with opportunity to also join a well-established translational molecular laboratory at University of Lincoln, to be able to enrich your professional journey with lab base research together with clinical research.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Department:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Oncology Department at Lincoln houses the Oncology Assessment Unit (OAU), radiotherapy, oncology outpatients clinics as well as the Ingham Suite for chemotherapy.&lt;/li&gt;\n&lt;li&gt;There are 4 Consulting Rooms and 4 examination rooms.&lt;/li&gt;\n&lt;li&gt;There are Specialist Nurse and radiographer led Clinics&lt;/li&gt;\n&lt;li&gt;All Day Case patients are cared for on Ingham Suite, Lincoln and the Chemotherapy Suite, Pilgrim Hospital, Boston&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Staff Benefits:&lt;/strong&gt; We offer various staff benefits to all employees as follows:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Family and Childcare&lt;/li&gt;\n&lt;li&gt;Benefits at work&lt;/li&gt;\n&lt;li&gt;Discounts and Salary Sacrifice&lt;/li&gt;\n&lt;li&gt;Rewards and Recognition&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;‘Providing the excellent care that we would expect for our own families’&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;People move to Lincolnshire, primarily, for the quality of life on offer: a real mix of bustling historic market towns, idyllic villages, miles of un-spoilt coastline, areas of outstanding natural beauty and one of the greatest cathedral cities in Britain.&lt;/p&gt;\n&lt;p&gt;Property prices are typically 60% of the average of those in the south east – first time buyers can take their first step on the property ladder for as little as £60,000.&lt;/p&gt;\n&lt;p&gt;The average price for property in Lincolnshire stood at £210,546 in April 2019. This is a rise of 0.15% in the last three months (since January 2019) and rise of 1.82% since 12 months ago. In terms of property types, flats in Lincolnshire sold for an average of £125,761 and terraced houses for £147,278.&lt;/p&gt;\n&lt;p&gt;If you require a larger family home or just like lots of space, then £250,000 will buy you something very special indeed.&lt;/p&gt;\n&lt;p&gt;Lincolnshire also has a diverse and fast growing economy, low unemployment, a healthy environment, low crime rates, health and education facilities well above the national average and affordable housing.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a county with plenty on offer to enhance any type of lifestyle by day or by night, in towns, villages and in Lincoln itself. That’s why there’s something for everyone in Lincolnshire.&lt;/p&gt;\n&lt;p&gt;Famed for its cathedral, castle and history, Lincoln has transformed itself in the past 20 years and is now a lively university city with 12,000-plus students and major industries supporting the city and county’s thriving retail, entertainment and nightlife scenes&lt;/p&gt;\n&lt;p&gt;Towns and villages sit in stunning countryside, including Boston under expansive skies in the heart of the fens, Grantham in the rolling countryside of South Lincolnshire and Louth, on the edge of the Lincolnshire Wolds – officially recognised as an area of outstanding natural beauty&lt;/p&gt;\n&lt;p&gt;Opportunity for both water and land based outdoor activities is exceptional, and offers an excellent work life balance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Greetwell Road, Lincoln, LN2 5QY, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Consultant Medical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253818", "validThrough": "2020-12-01T23:59:59+0000"}