{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T10:31:27+0000", "description": "&lt;p&gt;Are you an experienced registered nurse with acute surgical experience or would like experience on a surgical ward?&lt;br /&gt;Do you have a passion for teaching and inspiring others? Are you a role model who wants to demonstrate evidence-based practice? Would you like to share your knowledge and assist others in developing their professional career in caring for surgical patients? Are you keen to assist with the management and improvement of clinical nursing staff?&lt;br /&gt;In this role you will have the opportunity to educate staff and students in the clinical setting, whilst also working clinically within the nursing team across the Surgical Emergency Unit.&lt;br /&gt;Working in collaboration with the Ward Manager to enhance the improvement of nursing staff, your educational skills and knowledge will be supported and developed by the Surgical Directorate Education Team, who will coach you within this specialised area of professional education.&lt;br /&gt;We are looking for an enthusiastic individual who has a creative outlook and can patiently teach topics in a variety of different ways to ensure the listener shows interest and understanding. You must be able to research and critically analyse topics to find the best answer along with demonstrating consideration and patience when listening to other people’s points of view. It is essential that you enjoy working within a team where you can contribute and discuss a range of ideas and desired outcomes, while being able to deliver these independently.&lt;br /&gt;In return, the outstanding candidate can look forward to working in a professional environment with a team that is passionate about delivering exceptional care to patients and their families.&lt;br /&gt;It is highly recommended that you meet with Sarah Sundberg (Surgical Directorate Practice Development Nurse) and Jane Bolley (Sister) to discuss these roles prior to being interviewed.&lt;/p&gt;\n&lt;p&gt;Closing Date: 10-Nov-2020&lt;/p&gt;\n&lt;p&gt;Planned Interview Date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane BolleyJob titleWard SisterEmail addressjane.bolley@ouh.nhs.ukTelephone number01865 857952Additional contact information&lt;/p&gt;\n&lt;p&gt;Sarah Sundberg&lt;br /&gt;Surgical Directorate Practice Development Nurse&lt;br /&gt;sarah.sundberg@ouh.nhs.uk &lt;br /&gt;07525052637&lt;/p&gt;\n&lt;p&gt;Jane Bolley&lt;br /&gt;SEU F Ward Sister&lt;br /&gt;jane.bolley@ouh.nhs.uk&lt;br /&gt;&lt;br /&gt;01865 221834&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Deputy Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244016", "validThrough": "2020-11-10T23:59:59+0000"}