{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-20T10:17:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Various Wards and Departments, Full-time and Part-time hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work for an organisation rated &quot;good&quot; by the CQC?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We appreciate the remarkable jobs all of our staff do. Thanks to their care, compassion and commitment, we have a reputation as a high performing Trust where patients are first and foremost at the centre of all our care delivery. To join our remarkable team we are looking for enthusiastic and motivated Staff Nurses who want to participate and contribute to achieving excellent standards of quality care for our patients. In return for this commitment we will support and develop your potential and skills in this busy and fulfilling role within our friendly Trust. Interviews are held by a panel of experienced nurses and you will be advised of current vacancies and offered a post based on your current suitability, experience and preferences.&lt;/p&gt;\n&lt;p&gt;Please include in your application your preferred specialty i.e, Medical, Surgical or more specific specialties, and we will ensure we do our utmost to match your requirements.&lt;/p&gt;\n&lt;p&gt;We have a range of opportunities available across the Trust and for some posts you will be required to be flexible and available for unsocial hours and night shifts. As a flexible employer we can offer part time and full time hours. We expect all applicants to be committed to providing a high standard of patient care which embraces the vision of Compassion in Practice and the 6C&#39;s. If you&#39;re looking for the opportunity to join a Trust committed to excellence we would love to hear from you.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;Staff nurse vacancies within the Trust are centralised through this advert. Your preferential working areas are discussed at interview and we allocate you to a department if you are successful. We welcome applications from those awaiting to qualify as well as applicants who may be seeking to transfer their skills into an acute environment as training can be offered.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Ward Practice Development Nurse on 01493 453669 or Lorna Chittock, Nursing Recruitment Advisor on 01493 452246 lorna.chittock@jpaget.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233788", "validThrough": "2020-11-17T23:59:59+0000"}