{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49734", "minValue": "41445", "unitText": "YEAR", "value": "£41,445 - £49,734 per annum pro rata"}}, "datePosted": "2020-10-27T17:07:19+0000", "description": "&lt;h1&gt;Director of Services&lt;/h1&gt;\n&lt;h2&gt;St Teresa’s Hospice, Darlington is seeking a Director of Services to provide strategic leadership to our Hospice Care Services.&lt;/h2&gt;\n&lt;h2&gt;20-30 hours per week considered, to be negotiated with the successful candidate.&lt;/h2&gt;\n&lt;h2&gt;St Teresa’s Hospice Band 8a, £41,445.28 - £49,734.13 per annum pro rata.&lt;/h2&gt;\n&lt;h2&gt;NHS pension available for existing members; other pension schemes available for non-NHS scheme members.&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Employer: St Teresa’s Hospice (independent registered charity)&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a forward thinking, inclusive registered Charity with inpatient, outpatient, community and family support services, providing care and support to palliative patients and their families in their own homes and at St Teresa’s Hospice.&lt;/p&gt;\n&lt;p&gt;The Director of Services will be responsible for all Hospice Care services, ensuring the provision of skilled and compassionate services to support people at all times and within all contact areas. The successful candidate will horizon-scan and seek opportunities with providers, including the NHS and other potential partnerships, and will be a member of the Strategic Management Team,  contributing to the general management, policy and planning within the Hospice and providing advice, expertise and guidance to Hospice Trustees in all palliative care matters.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree level education in a relevant subject (e.g. nursing; social care; medicine; allied health professions), together with a management qualification or equivalent experience.&lt;/li&gt;\n&lt;li&gt;Knowledge of relevant statutory regulations including working knowledge of national &amp; local palliative care policy.&lt;/li&gt;\n&lt;li&gt;Experience of working at a management level in a health or social care setting, working in multi-disciplinary teams, partnership working and public engagement.&lt;/li&gt;\n&lt;li&gt;Advanced leadership and communication skills, and skills in project management, report writing, change management, budget-holding/management, and clinical audit&lt;/li&gt;\n&lt;li&gt;Ability to work across organisational boundaries&lt;/li&gt;\n&lt;li&gt;Ability to travel for work on a regular basis using own transport (business use insurance to be arranged by employee at their expense)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see the job description and person specification for further details.&lt;/p&gt;\n&lt;p&gt;Successful applicants are required to provide an enhanced disclosure. Disclosure expense will be met by St Teresa’s Hospice. All posts are subject to a six month probationary period.&lt;/p&gt;\n&lt;p&gt;To apply:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;From the NHS Jobs page for this vacancy you can download the job description and person specification, and apply online using the Apply for this job button.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for completed applications&lt;/strong&gt;: This job advert will remain open until at least 13 November 2020, and will then close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisted candidates will be contacted within a month of receipt of their completed application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(We aim to respond to all applications, however if you apply and are not contacted within a month of submitting your completed application then please assume that you have not been shortlisted)&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the role, please contact Jane Bradshaw, Hospice CEO, on 01325 254321.&lt;/p&gt;\n&lt;p&gt;St Teresa’s Hospice complies with GDPR during the recruitment and selection process. For information on how we process your data, please see the NHS Jobs Privacy Notice and St Teresa’s Hospice Privacy Notice – recruitment, which are available from the NHS Jobs page for this vacancy in the Additional Documentation and Further Links sections.&lt;/p&gt;\n&lt;p&gt;St Teresa’s Hospice is a Disability Confident Employer. We are committed to employing and retaining disabled people, and we encourage applications from all sectors of the community.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130814.jpg", "name": "St Teresa's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 7UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5291", "longitude": "-1.56706"}}, "title": "Director of Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245537", "validThrough": "2020-12-31T23:59:59+0000"}