{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-11-03T13:31:00+0000", "description": "&lt;p&gt;We are seeking an enthusiastic and well organised individual to work as part of the People Operations Team based at Salisbury District Hospital. The People Operations team consists of Business Partners &amp; Advisors who support the employees and managers across the Trust with all matters relating to employment. You will support requirements across the team, to include the Deputy Director of OD &amp; People, People Advisors and the Medical Workforce Officer to provide a comprehensive, high quality human resources service to all staff within the Trust. You will report to a People Advisor and will provide cross-cover for fellow colleagues as needed.&lt;/p&gt;\n&lt;p&gt;Duties will include processing medical and HR related correspondence and documentation ensuring efficient and accurate completion. Such as reference letters for Trust employees, confirming employment details for references etc. Producing certificate of sponsorship (COS) for use with visa renewal applications. Preparing employment files for junior doctor rotations. Dealing with ad hoc queries for the team and filing.&lt;/p&gt;\n&lt;p&gt;You will be confident working with people at all levels and have good organisation and communication skills. You will need the ability to work and be flexible within a small team.&lt;/p&gt;\n&lt;p&gt;You will need the ability and experience of using IT systems including Microsoft Office and Outlook and have accurate and competent keyboard skills. Experience of using electronic record systems would also be an advantage.&lt;/p&gt;\n&lt;p&gt;Previous experience of working within an HR or Recruitment environment would be preferable.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Essa Badji&lt;/p&gt;\n&lt;p&gt;People Advisor&lt;/p&gt;\n&lt;p&gt;essa.badjie@nhs.net&lt;/p&gt;\n&lt;p&gt;01722 336262 extension 5584&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury NHS Foundation Trust, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "People Operations Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254149", "validThrough": "2020-11-17T23:59:59+0000"}