{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum + HCAS £3,784-£4,592 per"}}, "datePosted": "2020-10-30T10:17:13+0000", "description": "&lt;p&gt;&lt;span&gt;Band 5 Community Nurse - Weekends Only&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£24,907-£30,615 per annum + HCAS £3,784-£4,592 per annum + weekend enhancements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this role is for weekends only. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be able to work a minimum of 8 hours over Saturday and Sunday. The shift patterns will predominantly be 8:00am - 12:00pm but this can vary. You will also have the opportunity to join our staff bank if you wish to pick up any extra shifts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested but can only work on the bank then please still apply but make this clear in your supporting statement&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work for an organisation that is progressive, innovative and provides quality care for families in Bromley? To find out what its like to work for Bromley Healthcare please view our videos on YouTube, search for Bromley healthcare and you will get a flavour of Bromley healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently looking for Community Staff Nurses to join our dynamic, friendly team who are patient focused and thrive on providing quality care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bromley Healthcare are currently recruiting for Band 5 Community Nurses. The teams consist of District Nurses, Community Nurses, and Healthcare Assistants &amp; Therapists. They are a busy &amp; dynamic team who have patient care at the heart of all they do. Our work is crucial to the community as we aim to prevent hospital care for our patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Community Nurse role is a highly skilled role such as Picc lines/IV’s as these are skills that are very much key to being an excellent Community Nurse.&lt;/p&gt;\n&lt;p&gt;As a Community Nurse you will deal with a variety of patients in their own homes, the role will involve but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsibility for contributing to the holistic assessment, planning, delivery and evaluation of patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Implementing, monitoring and maintaining our high standards of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Re-assessing and re-evaluating programmes of care when needed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Being an active member of the team sharing best practice whenever possible.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a challenging but ultimately rewarding position where you will be supported both within your teams and by regular reflection &amp; professional training.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that &lt;span&gt;Community&lt;/span&gt; Nursing roles are designated essential car users therefore applicants should have a current driving licence and access to a vehicle to be considered for this position. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bromley Healthcare are always looking for experienced nursing &amp; therapy professionals to join our bank of casual staff. We offer services in the following specialist areas: Community nursing, rehab services and paediatrics throughout the borough of Bromley and beyond. Please see the jobs page on our website for further details.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;As this is a weekend only role, there will be weekend enhancements:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Saturdays =agenda for change rate of pay + 30%&lt;/p&gt;\n&lt;p&gt;Sundays =agenda for change rate of pay +60%&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Adeline Moss - adeline.moss@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125834.jpg", "name": "Bromley Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromley Borough", "postalCode": "BR6 0JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3748", "longitude": ".097333"}}, "title": "Community Staff Nurse - Weekends Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249696", "validThrough": "2020-11-12T23:59:59+0000"}