{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "As per the national pay scale"}}, "datePosted": "2020-10-30T18:35:08+0000", "description": "&lt;p&gt;Applications are invited for an acute common care stem acute medicine &lt;strong&gt;(&lt;/strong&gt;&lt;strong&gt;ACCS AM) CT1 &lt;/strong&gt;training programme across England, Scotland and Wales starting from&lt;strong&gt; 4th August 2021&lt;/strong&gt; (Subject to change).&lt;/p&gt;\n&lt;p&gt;The recruitment process for ACCS-AM is combined with that for internal medicine training (IMT) and guidance about the process can be found on the IMT Recruitment website. Candidates wishing to apply to both programmes need only complete and submit one application form, and attend one interview, in total. Please note, not all regions will have ACCS-AM posts.&lt;/p&gt;\n&lt;p&gt;Successful completion of this programme will lead to meeting the competence requirements for higher training in the majority of medical specialties.&lt;/p&gt;\n&lt;p&gt;The application window opens on &lt;strong&gt;Thursday 5 November 2020 at 10.00am&lt;/strong&gt; (UK time) and closes on &lt;strong&gt;Tuesday 1 December 2020 at 4.00pm&lt;/strong&gt; (UK time). You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via the online Oriel recruitment system; this can be accessed from the link provided. Registration is available to applicants now.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Medical and Dental Recruitment Selection website; accessed from the link provided.&lt;/p&gt;\n&lt;p&gt;It is stipulated in the person specification that certain criteria must be completed by the ‘intended start date’. In this round this date is 4 August 2021. If you are not able to complete the outstanding area by this date your application will not be able to progress.&lt;/p&gt;\n&lt;p&gt;Post number information will be published to the IMT Recruitment website as confirmed by each region and provisional information will be available by the opening date for applications, although please note that numbers can change during the round.&lt;/p&gt;\n&lt;p&gt;Recruitment in this round will be managed by the Physician Specialty Recruitment Office (PSRO), who will coordinate all long/shortlisting of applications and make offers on behalf of all regions. Due to COVID-19 all interviews will be conducted via an online format.&lt;/p&gt;\n&lt;p&gt;Candidates will not need to give preferences of particular regions or posts at the time of application. Those candidates who subsequently progress to interview will be invited to give preferences approximately 18 February – 3 March 2021.&lt;/p&gt;\n&lt;p&gt;An applicants’ guide will be available for download from the IMT Recruitment website by applications opening date. This guide, alongside the website content which will be updated by applications opening date, should address most queries.&lt;/p&gt;\n&lt;p&gt;For further queries please see the link provided for the most relevant contact details.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England London and the South East", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123901"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Scotland, Wales", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Acute Care Common Stem (acute medicine) CT1", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251098", "validThrough": "2020-12-01T23:59:59+0000"}