{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 pa"}}, "datePosted": "2020-10-05T13:31:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Strategic Lead – Leadership and Lifelong Learning (8d)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: This post is based in Manchester City Centre, not within Blackpool Teaching Hospitals NHS Foundation Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This unique post will directly support the Managing Director of the NHS North West Leadership Academy (NHS NWLA) providing professional leadership both nationally and locally within a member-led organisation working across a range of teams, stakeholder groups and funding bodies and with direct responsibility for the strategic leadership and management of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The NHS NWLA’s Executive and Senior Management Teams&lt;/li&gt;\n&lt;li&gt;Strategy development and strategic operations across all NHS NWLA portfolios, business and communications functions&lt;/li&gt;\n&lt;li&gt;The NHS NWLA membership model and Board support&lt;/li&gt;\n&lt;li&gt;Liaison, joint working and collaboration with NHS England and Improvement at national and regional level&lt;/li&gt;\n&lt;li&gt;Stakeholder engagement, strategic and collaborative partnerships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The NHS NWLA is a mature, creative, and agile leadership development organisation, committed to the co-creation and commissioning of high quality, impactful leadership development. A member-led organisation, with governance and oversight provided by a board of representatives from across the system, the NHS NWLA is hosted by Blackpool Teaching Hospitals NHS FT and has a long-standing reputation for meeting the needs of member organisations whilst delivering on national priorities. Incorporating the North West Leadership and Lifelong Learning team part of the NHS England and Improvement (NHSE/I) People Directorate, the NHS NWLA also works closely and is represented on the North West People Team leading across the spectrum on Leadership, Talent and Organisational Development and collaboratively with a diverse range of partners.&lt;/p&gt;\n&lt;p&gt;This role will be ideally suited to an accomplished strategic leader seeking to gain further experience and with the potential to progress to the next level in the near future. The successful applicant will be somebody who enjoys leading strategically in a complex environment, is inclusive, understands leadership and development, is able to demonstrate business acumen and embodies the values of the organisation.&lt;/p&gt;\n&lt;p&gt;Advert closes on: 6th November 2020.&lt;/p&gt;\n&lt;p&gt;Assessment centre date: Fixed as 23rd November 2020.&lt;/p&gt;\n&lt;p&gt;Interview Dates: Fixed as 1st and 2nd December 2020.&lt;/p&gt;\n&lt;p&gt;If shortlisted, candidates will need to complete online Psychometrics between 11th and the 15th November 2020.&lt;/p&gt;\n&lt;p&gt;If shortlisted, candidates’ contacts will be shared with our external Provider who is delivering the assessment centre and administering the Psychometric tests.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Caroline Wilson&lt;/p&gt;\n&lt;p&gt;Job titleExecutive PA&lt;/p&gt;\n&lt;p&gt;Email address Caroline.Wilson38@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07552 521 255&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Piccadilly Place, Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Strategic Lead – Leadership and Lifelong Learning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212922", "validThrough": "2020-11-06T23:59:59+0000"}