{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum (pro rata)"}}, "datePosted": "2020-11-05T10:46:09+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff have been deployed to us from April 2018 and are now starting to work in new ways across the city. Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;Do you want to have the time to provide excellent nursing care in a rewarding and friendly environment, then we are looking to meet with you here at the Dermot Murphy Unit!!&lt;/p&gt;\n&lt;p&gt;The Dermot Murphy Continuing Healthcare Unit is a purpose built 22 bedded facility based in the M20 locality of South Manchester, close to tram and bus links to surrounding areas. The building is set in its own grounds and provides on site parking for staff.&lt;/p&gt;\n&lt;p&gt;The unit cares for adults with life limiting and complex physical healthcare needs, in a &quot;home from home&quot; environment which promotes a high standard of nursing care a quality of life.&lt;/p&gt;\n&lt;p&gt;We are looking to interview candidates who possess:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Level 2 NVQ or Apprenticeship in Health or equivalent&lt;/li&gt;\n&lt;li&gt;Excellent communication skills – in particular listening skills&lt;/li&gt;\n&lt;li&gt;A friendly, open, empathetic and compassionate communication style&lt;/li&gt;\n&lt;li&gt;A strong ability to engage with patients, visitors and colleagues&lt;/li&gt;\n&lt;li&gt;The ability to work well in a team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that this role involves working weekends and bank holidays. Internal rotation onto nights will also be required&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStacey ScudderAdditional contact information&lt;/p&gt;\n&lt;p&gt;Stacey Scudder&lt;/p&gt;\n&lt;p&gt;0161 445 3811&lt;/p&gt;\n&lt;p&gt;Stacey.scudder@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dermot Murphy Unit, Manchester", "postalCode": "M20 1FQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4325", "longitude": "-2.24385"}}, "title": "Nursing Assistant - Dermot Murphy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257308", "validThrough": "2020-11-15T23:59:59+0000"}