{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:01:53+0000", "description": "&lt;p&gt;An opportunity has arisen for a Band 5 staff nurse to join our Tertiary level 3 Neonatal Unit at Hull University Teaching Hospitals NHS Trust Women’s &amp; Children’s Hospital.&lt;/p&gt;\n&lt;p&gt;Hull University Teaching Hospitals NHS Trust NICU is a well-established level 3 tertiary unit within the Yorkshire Neonatal Network. Comprising of 30 cots; 5 of which are Intensive Care; 7 High Dependency, 14 Special Care and 4 Transitional Care providing a high quality service to the network and beyond.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, highly motivated registered nurses/ midwives who wish to further develop their knowledge and skills in the speciality of neonatal care. The successful applicant will play a vital role in delivering high quality safe and efficient care to sick and preterm newborn babies.&lt;/p&gt;\n&lt;p&gt;Good communication and teamwork are essential skills for the role with the ability to be flexible within different working environments.&lt;/p&gt;\n&lt;p&gt;We have an extensive induction package for new staff tailored to support your development to become a confident, competent and fully trained neonatal nurse. We have a dedicated Clinical Nurse Educator who is able to offer commitment to support your personal and professional development.&lt;/p&gt;\n&lt;p&gt;Applicants will be a Registered Nurse or Midwife. Experience of neonatal care would prove beneficial but is not essential.&lt;/p&gt;\n&lt;p&gt;** Salary relates to yer 2 of 3 year NHS pay deal&lt;/p&gt;\n&lt;p&gt;All job offers are subject to Agenda for Change terms and conditions.&lt;/p&gt;\n&lt;p&gt;This post will require a Criminal Records Disclosure Check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or an informal visit please contact Kate Lamming, Unit Manager, on (01482) 604443.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HEYWACH, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242133", "validThrough": "2020-11-09T23:59:59+0000"}