{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "117800", "minValue": "71000", "unitText": "YEAR", "value": "£71,000 - £117,800 Per annum (pro rata)"}}, "datePosted": "2020-10-30T14:46:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Number: &lt;/strong&gt; 919-FJ-19072741-EXT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Deputy Director Health Protection&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Midlands (East) Health Protection Team&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Seaton House, City Link, NOTTINGHAM, NG2 4LA&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;SCS1 or Medical Consultant or NHS Agenda for Change Band 9&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 10 PAs/37.5 per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: &lt;/strong&gt; 19-Nov-2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;TBA&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) in the Midlands (East) is seeking to appoint a Deputy Director Health Protection who will provide local leadership to the PHE health protection service for the Midlands (East).&lt;/p&gt;\n&lt;p&gt;This is an interesting opportunity to gain experience working at a very busy and important time. While we are working hard to control and prevent the spread of Covid-19, we also need to continue to prevent and control the spread of other communicable diseases in our local areas.&lt;/p&gt;\n&lt;p&gt;The postholder will lead the day-to-day operational provision of a safe and effective health protection service which delivers to high quality standards and is responsive to the needs of the local community and PHE’s partners in the local public health systems. They will be responsible for managing the health protection team to deliver the statutory functions devolved to PHE from the Secretary of State and the non-statutory functions that PHE undertakes through national guidance and in agreement with local partners.&lt;/p&gt;\n&lt;p&gt;The Midlands (East) Health Protection Team delivers as 24/7 response to communicable disease incidents and environmental threats across the region. The team works on a “County locality” basis with Consultants in Health Protection having responsibility for a defined geographical area. Out of hours support is provided across the Region and there is an opportunity to contribute to this, if desired.&lt;/p&gt;\n&lt;p&gt;The Deputy Director Health Protection role works on a regional basis, contributing to the delivery and providing oversight of the local health protection function and liaising with Regional and national PHE colleagues as well as local external stakeholders. The role is currently directly involved in leading and delivering the Covid-19 response.&lt;/p&gt;\n&lt;p&gt;The job plan will comprise 10 Programmed Activities (PAs) or 37.5 hours per week under AfC Terms and Conditions. The post will be based at City Link, Nottingham, although in current circumstances remote working is in place. Applicants will be expected to travel as necessary.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria.&lt;/p&gt;\n&lt;p&gt;Interviews will take place via Microsoft Teams video call.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information about the post or an informal discussion please contact one of the Deputy Directors, David Spence David.Spence@phe.gov.uk or Ben Anderson Ben.Anderson@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Seaton House, City Link, Nottingham, Nottingham", "postalCode": "NG2 4LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9493", "longitude": "-1.13867"}}, "title": "Deputy Director of Health Protection", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250637", "validThrough": "2020-11-20T23:59:59+0000"}