{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-20T09:15:17+0100", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for an experienced, dynamic, compassionate and dedicated Band 4 senior rehabilitation instructor to join our inpatient rehabilitation team at Fordingbridge Hospital. The inpatient team aspires to provide a responsive, safe effective caring service that is well led.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role of the senior rehabilitation instructor is to work within the in-patients setting to provide physical rehabilitation to patients in order to optimise their function and aid safe discharge by supporting the Physiotherapist and Occupational Therapist in the delivery of treatments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;They will be involved in undertaking individual and group treatment sessions as well as working as part of the wider multidisciplinary team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To support you within your role, Southern Health NHS Trust have an excellent development and learning programme to help further develop your clinical and leadership skills. The Trust knows that supporting, developing and nurturing their staff leads to outstanding patient care. We are committed to support the development of your career and have a competency based approach to clinical training and development which will ensure you are able to apply your newly developed skills in a safe and effective way.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will have experience working with the patients/ clients, and an ability to understand their rehabilitation needs. You will need to be flexible; innovative; possess excellent communication skills and be keen to work collaboratively with both the integrated team and also wider community care providers. You will work as part of an inpatient therapy team involved in Patient’s rehabilitation. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates will be able to work independently and have effective time management skills. They will also have experience of managing patients with complex needs and will need to work well as part of the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Fordingbridge Hospital is a community hospital based in the town of Fordingbridge, and is part of the Avon Valley locality in the New Forest, which is part of the Southampton and West Hampshire Integrated Service Division within Southern Health Foundation Trust. Alongside our community hospital is the community care team who provide care to patients in their own homes in the locality. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you have a strong focus on patient care, and are able to work as part of the integrated team keen to progress patient’s rehabilitation alongside our local community teams then we are keen for you to join us. You will need to have excellent nursing skills and be a positive change agent. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will be proficient, knowledgeable and competent. They will be willing to undertake further training within this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; Informal visits are welcome.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in joining us or would like more information please contact Stephanie White or Sue Findlay on 01425 651414 &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fordingbridge", "postalCode": "SP6 1JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9281", "longitude": "-1.7932"}}, "title": "Senior Rehabilitation Instructor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233533", "validThrough": "2020-11-10T23:59:59+0000"}