{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 £21,829 - £24,157 per annum (pro"}}, "datePosted": "2020-11-03T20:00:23+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Birmingham Community Healthcare NHS Foundation Trust is delighted to offer NMC Registered Nurse Associate vacancies within our Inpatients wards and units.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Only apply if you are a Registered Nurse Associate and are on the NMC register.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are recruiting registered Nursing Associates who are on the NMC register to join our inpatient nursing teams. You will be working as part of a multi-disciplinary team and taking direction from our Registered Nurses who will support you in delivering planned care to patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer several Specialities within the division some of these include sub-acute medicine, intermediate care, end of life care, stroke and neurological rehabilitation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This will be a great opportunity to develop your decision making skills and care delivery and you will be able to make a difference to patient care and quality. The service is delivered across 24hrs a day, 7 days, and 365 days a year.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer preceptorship, mentorship, clinical training and many development opportunities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda KitsonJob titleMatronEmail addressAmanda.Kitson@bhamcommunity.nhs.ukTelephone number0121 466 6415Additional contact information&lt;/p&gt;\n&lt;p&gt;We are happy to consider part time or full time positions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact please contact our Lead Matron:&lt;/p&gt;\n&lt;p&gt;Amanda Kitson on 0121 466 6415 or via email Amanda.Kitson@bhamcommunity.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 4 Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255006", "validThrough": "2020-11-17T23:59:59+0000"}