{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on Qualification and Experience"}}, "datePosted": "2020-11-06T15:51:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Contract&lt;/strong&gt;: Full Time, Fixed Term (24 months)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours and Shifts&lt;/strong&gt;: 37.5 hours per week, between 8.00am and 6.30pm, Mon-Fri&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Dependent on qualifications and experience&lt;/p&gt;\n&lt;p&gt;This is an exciting time for the Walsall West 1 Primary Care Network. As a result of several practices working collaboratively to provide improved healthcare interventions to our local patient population we are recruiting for exciting opportunities across our network. You will be an integral part of the team helping to provide an effective service to our patients as well as developing a forward thinking primary care network in a stimulating environment ……Does this sound like the opportunity for you? Are you up for the challenge? If so read on………?&lt;/p&gt;\n&lt;p&gt;We are excited to be recruiting a Nurse Associate to work as part of a multi-disciplinary team within general practice, across Walsall West One Primary Care Network (PCN).&lt;/p&gt;\n&lt;p&gt;The role of the Nursing Associate is to work with the multi professional team and the Registered Nurse to assess, plan, organise and deliver clinical care in line with service and patient needs, as agreed with supervising clinicians.&lt;/p&gt;\n&lt;p&gt;Duties and Responsibilities include&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing appropriate nursing evidence based care&lt;/li&gt;\n&lt;li&gt;Competently performing and recording clinical observations such as blood pressure, temperature, respirations andpulse&lt;/li&gt;\n&lt;li&gt;Sharing informationwith registered nurseson apatients’ condition, behaviour, activity and responses&lt;/li&gt;\n&lt;li&gt;recognisingissues relating to safeguarding and escalating as appropriate&lt;/li&gt;\n&lt;li&gt;Providing excellent care and service in the most professional manner and in line with the NMC standards and policies and procedures&lt;/li&gt;\n&lt;li&gt;Establishing and maintaining effective communication and work as part of a multidisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is desirable for the post holder to be competent in performing venepuncture / ECG’s and delivering smoking cessation advice.&lt;/p&gt;\n&lt;p&gt;Relevant Qualifications, Registration, Enhanced DBS and own vehicle with insurance for business use along with a driving license are among the requirements of the role.&lt;/p&gt;\n&lt;p&gt;This is a new and developing role. You will work in partnership with your clinical and non-clinical colleagues, management support and the wider PCN to ensure the role delivers the best possible outcomes for our patients.&lt;/p&gt;\n&lt;p&gt;Candidates will be contacted only if the application is taken forward.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Modality Partnership Walsall", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136214"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall", "postalCode": "WS2 0BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5888", "longitude": "-2.02422"}}, "title": "PCN Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260465", "validThrough": "2020-11-20T23:59:59+0000"}