{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-26T11:46:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a forward thinking Staff Nurse looking to move into the exciting area of specialist neuro-rehabilitation? If so, an opportunity has arisen within the Specialist Rehabilitation Team based at the Colman Centre for Specialist Rehabilitation in Norwich. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our team provides specialist neuro-rehabilitation for patients who are referred to us from across the East of England. We are looking to appoint an enthusiastic, well motivated staff nurse, into this full time post. You will cover a combination of earlies, lates and nights. You will work as an integral part of the ward team and be responsible for providing high standards of rehabilitation care to a group of patients with specialist needs. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be required to deliver evidence based care to a high standard. Excellent communication skills and a supportive approach to team working within a rehabilitation setting are key to the success of this service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a key role working within a well-established team, working with all disciplines to deliver and achieve the best outcome for the patients who access this service. It is also a real opportunity for someone who is keen to explore their role within rehabilitation and learn and develop some new skills in this area of nursing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An ability to structure your own learning supported by the team gaining new knowledge and skills to benefit yourself and the service will be vital. Some of the skills you can develop may include enteral feeding, tracheostomy management and weaning, and posture and position management. In addition you will be working with families and colleagues in complex discharge planning and best interest discussions. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Excellent organisational and interpersonal skills are essential as is the need to be cheerful and courteous. Good computer skills or the ability to learn will be required for this role as we are using SystmOne to record our patient interventions. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There is a real opportunity for staff who are keen to move into this specialist area of work, and join our friendly and forward thinking team. Please note that whilst experience is desirable, we do welcome newly-qualified staff nurses too.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note for this role you will need to be currently registered with the NMC, or about to receive your pin.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note unfortunately we cannot offer informal visits to the ward at present. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Donnelly on 01603 255795&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colman Hospital, Norwich", "postalCode": "NR2 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6206", "longitude": "1.26822"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242280", "validThrough": "2020-11-09T23:59:59+0000"}