{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc pro rata"}}, "datePosted": "2020-11-05T16:46:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Ealing Community Partners: NHS, Ealing Council, voluntary and specialist providers working together to deliver health and social care for the people of Ealing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Community-based health care in Ealing is about to undergo a transformation. West London NHS Trust, in partnership with Central and North West London NHS Trust, (CNWL) the Hillingdon Hospitals NHS Trust and some other smaller providers, including third sector, have formed a partnership to provide integrated community health services in Ealing. The total value of the new 10 year contract is about £50m per year.&lt;/p&gt;\n&lt;p&gt;We have also committed to invest in improved links with local voluntary sector organisations (for example ECIL, Ealing Dementia Concern, Ealing Mind) and other community assets for innovation and flexibility.&lt;/p&gt;\n&lt;p&gt;Are you looking to be part of a dynamic and innovative Occupational Therapy team? Do you feel passionate about working with children, young people and their families? If so, we could just be the team for you!&lt;/p&gt;\n&lt;p&gt;The Ealing Paediatric Occupational Therapy Service is an integral part of the Ealing Service for Children with Additional Needs (ESCAN) which provides health, education and social services for children with additional and / or complex needs. There is a high level of integration and collaboration between different health, education and social care services. Our service is based at Carmelita House in Ealing Broadway.&lt;/p&gt;\n&lt;p&gt;We are highly valued by our local health colleagues, as well as education and social care partners, and we enjoy good national reputation for innovative practices / services. We are also one of the few larger paediatric OT teams across the country – the service has been highly successful in getting funding from different agencies, with an establishment of more than 23 staff. We have a strong professional structure with Clinical Lead Therapists (Band 8a) and Advanced Therapists (Band 7), who lead on different aspects of service delivery. The team includes Band 5 &amp; 6 Therapists and a Band 3 Therapy Technician. Regular CPD programmes and supervision structures are in place. We are a team with career progression opportunities!&lt;/p&gt;\n&lt;p&gt;Our service is actively re-designing the model of service delivery in order to meet the changing needs of the local population. Different clinical pathways and packages of care are developed for different care groups of children. All staff members are encouraged to be involved in or lead different service development and clinical governance activities. The team is very keen to deliver a service based on family-centered care principles, outcome measures, research evidence and best practice guidelines. We are open to new ideas and constantly reviewing and modifying the way we work.&lt;/p&gt;\n&lt;p&gt;We are looking for up to 2 team players with excellent communication skills and a good range of clinical experience especially in the management of children with specific developmental delays (e.g. DCD), social communication disorders (e.g. Autism) and other Special Educational Needs. Regular supervision and support will be provided by a Band 8a. Are you the people we are looking for?&lt;/p&gt;\n&lt;p&gt;This is an Ealing Community Partners role through CNWL. However, please note that this post does not meet the funding criteria for the application of “Golden Hello” and/or “Relocation Allowance” benefits mentioned as part of the CNWL central advertising.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Service Tel: 020-88258768&lt;/p&gt;\n&lt;p&gt;Ying Herng Heng, Clinical Lead for Paediatric Occupational Therapy Service&lt;/p&gt;\n&lt;p&gt;Email: yingherng.heng@nhs.net&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Anette Steenkamp, Clinical Lead for Paediatric Occupational Therapy Service&lt;/p&gt;\n&lt;p&gt;Email: anette.steenkamp@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carmelita House, 21-22 The Mall, Ealing, London W5 2PJ, Ealing", "postalCode": "W5 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5143", "longitude": "-.300322"}}, "title": "Advanced Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258631", "validThrough": "2020-11-19T23:59:59+0000"}