{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc. HCAS"}}, "datePosted": "2020-10-16T11:46:54+0100", "description": "&lt;p&gt;Learning Disabilities Physiotherapist&lt;/p&gt;\n&lt;p&gt;Do you want to be part of a team truly dedicated to improving the lives of people with a learning disability? Barnet Integrated LD team has a opportunity for a physiotherapist to join their evolving team. As an integrated service you will have access to a supportive multidisciplinary health and socail care team, helping you achieve your development objectives whilst delivering excellent clinical care.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly and dynamic team and can expect to utilise your knowledge, skills and experience by promoting quality care through evidence based practice and values based approaches. You will not only carry a varied caseload, support and work with our experienced physiotherapy team but also be the lead for falls prevention in the LD team. While we are looking for someone with LD expereince we are also willing to develop someone with transferable skills and an interest in learning disability. We welcome applications for part time working as well as full time. Barnet Learning Disability Service prides ourselves in driving change and improving lives.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Learning Disabilities Service, London Borough of Barnet, 2 Bristol Avenue, Colindale, London", "postalCode": "NW9 4EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5975", "longitude": "-.245036"}}, "title": "Senior Learning Disabilities Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229975", "validThrough": "2020-11-08T23:59:59+0000"}