{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-30T10:16:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist – Band 6 – 30 hours per week – Occupational Therapy – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a permanent part time (0.8WTE – 30hours) band 6 community occupational therapy position with the Bury Town team. This team is based at West Suffolk House in Bury St Edmunds. Please note that this position is likely to involve 7 day working.&lt;/p&gt;\n&lt;p&gt;The role includes&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The roles include assessing and providing specialist therapy for people in their own homes, with a commitment to care and quality at all times.&lt;/li&gt;\n&lt;li&gt;To work with people with long term conditions, palliative conditions and rehabilitation needs, to achieve quality of life and independence where possible.&lt;/li&gt;\n&lt;li&gt;To work with all health care professionals and our wider multidisciplinary neighbourhood team to provide an integrated service to our people who use our services.&lt;/li&gt;\n&lt;li&gt;Supervision of Junior OT, students and support staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will need to have good communication skills, good at problem solving, and be an experienced OT.&lt;/p&gt;\n&lt;p&gt;In return the role can give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A sense of pride and achievement&lt;/li&gt;\n&lt;li&gt;The opportunity to get to know the people on your caseload&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Induction &amp; mandatory training&lt;/li&gt;\n&lt;li&gt;Development opportunities&lt;/li&gt;\n&lt;li&gt;Possible lease car&lt;/li&gt;\n&lt;li&gt;NHS terms and conditions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Any questions or to arrange an informal visit call Julie Harper, team lead on 07940444110.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Occupational Therapist - Band 6 - Occupational Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249661", "validThrough": "2020-11-13T23:59:59+0000"}