{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615 per annum"}}, "datePosted": "2020-11-03T10:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist Band 5 Inpatient service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge this could be the opportunity you are looking for. A vacancy has arisen for a Band 5 Occupational Therapist working within the inpatient team, based in Basildon.&lt;/p&gt;\n&lt;p&gt;This post will particularly suit a motivated, treatment focussed and skilled occupational therapist, who is competent in the management of clients with a focus on utilising Occupational Therapy approaches and interventions that support recovery. We are seeking a resilient enthusiastic individual who is committed to the provision of therapy within the inpatient service. You’ll be working as part of a multi-disciplinary team, including nurses, support workers, psychiatrists and psychology. It is important that you are able to work autonomously whilst adopting a flexible and positive approach. There will also be some opportunity for developing group work to address specific mental health conditions.&lt;/p&gt;\n&lt;p&gt;As an individual you will have commitment to continue your own development and actively participate in providing a variety of learning opportunities for the team and service. In return we offer excellent training and development through our Workforce Development Department and within the service. Support is maintained through regular supervision and appraisal to assist you the successful candidate in setting realistic objectives enabling you in maintaining a positive attitude towards delivering quality customer care.&lt;/p&gt;\n&lt;p&gt;In return of your commitment, the Trust offers a wide range of training opportunities and career development.&lt;/p&gt;\n&lt;p&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Informal queries and visits are welcome&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Diana Luckie&lt;/p&gt;\n&lt;p&gt;Job title Head OT Adult Inpatient Services&lt;/p&gt;\n&lt;p&gt;Email address diana.luckie@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07799 347090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon Hospital, Mental Health Unit, Basildon, Essex", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Occupational Therapist - Inpatient Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253459", "validThrough": "2020-11-17T23:59:59+0000"}