{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 Pro Rata"}}, "datePosted": "2020-11-03T10:01:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Bank Band 3 Hairdresser &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Broadmoor Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;West London NHS Trust is one of the largest and most diverse mental health services in the UK. Full training and support will be given to the successful candidates.&lt;/p&gt;\n&lt;p&gt;We positively welcome applications from people with a lived experience of either mental health conditions or learning disabilities and people who represent diverse communities.&lt;/p&gt;\n&lt;p&gt;The position is based at Broadmoor Hospital, Crowthorne, Berkshire RG45 7EG. Which is located in a beautiful part of Berkshire, easily accessed via both the M3 and M4 motorways.&lt;/p&gt;\n&lt;p&gt;Broadmoor Hospital is a specialist service that provides assessment, treatment and care in conditions of high security for men from London and the south of England. It is one of three high-security psychiatric hospitals in England, and is internationally recognised, both for work with patients and for our extensive research activities. We treat men with mental illness and personality disorders who represent a high degree of risk to themselves or to others.&lt;/p&gt;\n&lt;p&gt;We currently have exciting Bank Hairdresser Opportunities Band 3 within our service. Working pattern and hours are Flexible subject to service needs and availability.&lt;/p&gt;\n&lt;p&gt;The Bank band 3 hairdresser requires a self-motivated compassionate individual who will provide a hairdressing service for the patients and working with staff across the hospital. The role entails the individual to work independently, use their own initiatives and to liaise with relevant staff members with the support and supervision from senior staff. Experience of and the ability to perform all levels of afro hair styling such as braiding, weaves, cornrows, and chemical treatments are essential. Knowledge product and care practices are also of benefit.&lt;/p&gt;\n&lt;p&gt;Experience of working in a (forensic) mental health environment is desirable but not essential. The post holder will need to be flexible in adapting sessions to meet the constantly changing patient needs, and will be required to demonstrate good communication skills in the provision of the service.&lt;/p&gt;\n&lt;p&gt;The post holder will take part in a comprehensive induction with opportunities to work across the service. As a Trust we will provide you with Supervision, on-going personal development identified through performance development reviews, a stimulating and challenging working environment with opportunities for career development within West London Trust.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close adverts prior to the closing date stated should we receive a high volume of applications. Please ensure you submit your application as soon as possible to ensure it is considered in the selection process.&lt;/p&gt;\n&lt;p&gt;If you decide to apply for this post but do not hear back from us within two weeks of the closing date, please assume that you not have been short-listed on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like any further information, please contact Venus Kan, Clinical Lead Occupational Therapy &amp; Vocational Services on: 01344 754046 or via email: venus.kan@westlondon.nhs.uk or Simon Matthews, Rehabilitation Therapy Service Team Leader on: 01344 754123 or via email:&lt;/strong&gt; simon.matthews@westlondon.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Head of OT &amp; RTS, Crowthorne", "postalCode": "RG45 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3691", "longitude": "-.781257"}}, "title": "Bank Hairdresser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253356", "validThrough": "2020-11-17T23:59:59+0000"}