{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-28T17:00:51+0000", "description": "&lt;p&gt;&lt;span&gt;Trainee Emergency Practitioner – Hampshire Hospitals NHS Foundation Trust&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Location: All HHFT sites- Andover (AWMH), Basingstoke (BNHH) and Winchester (RHCH)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Role Description:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be employed on current banding whilst undertaking the Wessex Emergency Care Collaborative (WECC) Emergency Practitioner program. The training includes compulsory classroom sessions around the Wessex region and will be assessed via OSCEs, written pharmacology and X-ray interpretation exams at the end of the course. A portfolio of case studies and competencies will also be required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working patterns will be considered for all applicants!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;What we look for:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•HCPC/NMC registered professionals&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Post registration Emergency/Urgent Care/Paramedic experience &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Passion and commitment to Continued Professional Development&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•A desire to provide high quality care, assessment and appropriate treatments for all patients&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Minimum of 25 contracted hours a week&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;What we Offer:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Supernumerary status throughout the course&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Rotation through all 3 sites to gain a deeper understanding of variety of patient presentations and of HHFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Mentorship and ongoing support from Senior Emergency Practitioners&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•True collaborative working with the Emergency Medical Team and affiliated colleagues&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Substantive employment as an Emergency Practitioner upon successful completion of the course&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Your life outside HHFT is important and the Trust is happy to consider applications with flexible working patterns that cater to individual requirements; this can be discussed at interview&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Who we are:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;HHFT has two busy Emergency Departments, one based in Basingstoke and one in Winchester. We also have a Minor Injury Unit within the Andover War Memorial Hospital. Each site has a team of Emergency Practitioners who work autonomously to provide high quality care for patients presenting with Minor Injuries. The teams have a designated Emergency Consultant who oversees the delivery of the Practitioner service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are also taking applications for those looking to gain experience working within the emergency setting as a band 5, whilst building their Emergency care experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;About the trust:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The vision at Hampshire Hospitals NHS Foundation Trust is to provide outstanding care for every patient. We serve a population of nearly 600,000 people across Hampshire and West Berkshire as well as some people who access our specialist services from across the country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Created in January 2012 the Foundation Trust prioritises the provision of exceptional, compassionate, care delivered by the valued staff working in a culture of collaboration and mutual respect. HHFT employs circa 6,000 people and had a turnover of £390m in 17/18&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Four core values (CARE) Compassion, Accountability, Respect and Encourage. These are in place to support of four clear objectives, provide outstanding care of patients, empowering all members of staff, sustainable growth and innovating for the future.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RHCH, Winchester", "postalCode": "SO225DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Trainee Emergency Practitioner - RHCH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247444", "validThrough": "2020-11-11T23:59:59+0000"}