{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27988", "minValue": "27988", "unitText": "YEAR", "value": "£16.65 per hour"}}, "datePosted": "2020-11-03T12:27:36+0000", "description": "&lt;p&gt;We are looking for a &lt;strong&gt;Registered Mental Health Nurse (RMN)/Learning Disability Nurse (RNLD)&lt;/strong&gt; with a passion for delivering outstanding care.&lt;/p&gt;\n&lt;p&gt;You’ll be working 42 hours per week (12 hour day shift and 13 hour night shift based on a rolling rota of 2 weeks of day shifts and 2 weeks of night shifts) at Cygnet Gledholt Mews &amp; Coach House.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gledholt Mews and Coach House &lt;/strong&gt;is our new service, opening in October 2020, for adults with mental health needs or a personality disorder who have been able to progress through the hospital pathway and are looking for the next stage in their rehabilitation journey. This service has been designed around individuals from Kirklees in partnership with Kirklees CCG with the aim is to help these individuals along their path towards independent living.&lt;/p&gt;\n&lt;p&gt;Apply now to enjoy excellent career prospects whilereaping the rewards of making a difference to others – every day.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nurse in Charge Managing daily shift requirements and staff team&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines&lt;/li&gt;\n&lt;li&gt;Work closely with the management team to develop the service, including clinical direction meetings, training , case study reviews audit, and improve quality&lt;/li&gt;\n&lt;li&gt;Produce outstanding written reports based on your nursing assessments and observations and deliver them at CTRM meetings&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge and promote nursing&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit- Providing you with Fitness Programmes, Nutrition consultation and Health checks&lt;/li&gt;\n&lt;li&gt;Plus many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An experienced &lt;strong&gt;RMN/RNLD&lt;/strong&gt; with a current Pin Number, you’ll have…&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;A good understanding of the Mental Health Act 1983 and latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;li&gt;The ability to deputise in a clinical lead role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;li&gt;Knowledge on behavioural interventions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt;has been providing a national network of high quality specialist mental health services for more than 30 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gledholt Mews &amp; Coach house&lt;/strong&gt; is committed to continuously improving the quality of care for the people we support. It is our aspiration to strive to maintain the highest of standards through clinical leadership and a positive organisational culture that puts the service users at the very centre of care.&lt;/p&gt;\n&lt;p&gt;We place great emphasis and value in the consultation process with the families, friends and Kirklees referring authority, we regard this as a critical component in ensuring that the highest care standards that are inclusive. Our fundamentals are to provide an excellent quality of care through a safe and aesthetically pleasant homely environment with respect and dignity providing not only the clinical support but also spiritual and emotional support in pursuit of happiness.&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Cygnet core values&lt;/strong&gt;, care respect empower trust and integrity are our drivers at Gledholt Mews &amp; Coach house we endeavour to create the best environment for our residents and staff teams, Quality service delivery depends on a philosophy that supports, a well-trained, valued, and motivated team.&lt;/p&gt;\n&lt;p&gt;Staff development, skills and expertise are continuously supported through supervision, appraisal and training which is part of their development processes.&lt;/p&gt;\n&lt;p&gt;We are dedicated to supporting our team’s day-to-day interventions, working together creating an empowering environment, of choice, inclusiveness, leadership and guidance. Each component of our team is intrinsic to achieving the drive for quality, together; we help each other to deliver the best person-centred care to for the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gledholt Mews &amp; Coach house&lt;/strong&gt; believes that the people we support are not only entitled to the best service but equally to the best life they can live. Simply based on promoting choice, Discharge and understanding that we are all individual.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If interested, please &lt;/strong&gt;&lt;strong&gt;click apply!&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "32 Greenhead Road, Gledholt, Huddersfield, West Yorkshire", "postalCode": "HD1 4EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6463", "longitude": "-1.7973"}}, "title": "Registered Mental Health Nurse (RMN)/Learning Disability Nurse (RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253968", "validThrough": "2020-12-07T23:59:59+0000"}