{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55000", "minValue": "50000", "unitText": "YEAR", "value": "£50-£55,000"}}, "datePosted": "2020-10-29T11:08:34+0000", "description": "&lt;p&gt;&lt;span&gt;As a growing healthcare provider in the Bristol region, we are looking to reorganise the management of our Severnside Integrated Urgent Care nursing &amp; AHP team with the appointment of ateam manager.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are seeking an experienced and forward-thinking Senior Nurse Practitioner to support the Head of Nursing and other Nursing and AHP Team Managers with the professional leadership and line management of the expanded Nurse Practitioner / APP / Telephone Nurse Adviser Team within the Integrated Urgent Care Service. As part of this role you will also undertake clinical work within the Integrated Urgent Care service, including the Clinical Navigator role at least once a month and, will be part of the Clinical Governance team, auditing cases using the Clinical Guardian software and provide feedback and support to SevernSide’s IUC clinicians.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a wide range of clinical experience in a number of sectors including current experience within an urgent care setting, successful candidates will be committed to developing and supporting the highest standards of clinical practice, excellent team-work and innovative service delivery. You will have a key interest in clinical leadership and an interest in developing your management and leadership skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;BrisDoc provides a number of healthcare services for the NHS including Severnside Integrated Urgent Care, Daytime GP Practices in Broadmead Medical Centre, Charlotte Keel Medical Practice and the Homeless Health Service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At BrisDoc, we pride oursleves on being a fantastic plact to work, somewhere that you will feel valued, supported, developed and part of the family. We strive to make sure every member of the team feels proud of the work they do and the service we offer to over 1million patients across Bristol, North Somerset and South Gloucestershire.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Hours: Negotiable- this will inlude 11.5 hours managerial work (during daytime and &#39;out of hours&#39; periods, this includes 4 hourws clinically supervising staff) and a minimum of two shifts per week clinical work (within the out of hours setting). You will be expected to participate in working weekends and/or bank holidays on a rotational basis.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Salary / Rates of pay&lt;/strong&gt;:£50 to 55k pa (pro rata)dependant on clinical shifts worked. &lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Other benefits:&lt;/strong&gt; NHS Pension (offering 14.38% employers contribution), professional indemnity, paid overtime and training and eligibility for “Sharing Success” bonus.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Locations: &lt;/strong&gt;Primarily based in Osprey Court Whitchurch, Bristol for managerial work, the successful applicant will be expected to attend various bases within Bristol, North Somerset and South Gloucestershire &lt;em&gt;(&lt;/em&gt;&lt;em&gt;including&lt;/em&gt; but not limited to &lt;em&gt;Knowle West Health Park, Greenway Practice Southmead, Cossham Hospital, New Court Surgery in Weston-super-Mare and Clevedon Hospital)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;em&gt;&lt;strong&gt;Terms &amp; Conditions: &lt;/strong&gt;Brisdoc Terms and Conditions will apply&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing Date&lt;/span&gt;&lt;/strong&gt;&lt;span&gt;: Monday 9&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November 2020.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Interview Date&lt;/strong&gt;: TBC&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Frank Burge, Head of Nursing and Allied Healthcare Professionals, Integrated Urgent Care: &lt;/span&gt;&lt;span&gt;frank.burge@nhs.net&lt;/span&gt;&lt;span&gt; or 07921 218504.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BrisDoc Healthcare Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130535"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS14 0BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4116", "longitude": "-2.59293"}}, "title": "Nursing &amp; AHP Team Manager Integrated Urgent Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248029", "validThrough": "2020-11-12T23:59:59+0000"}