{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa pro rata"}}, "datePosted": "2020-11-06T12:30:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Can you bring your dedication and positivity to Cheshire? We are an enthusiastic and experienced team, continually striving to improve patients’ experience with dignity and respect for all.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to expansion of the MRI department, we are seeking highly motivated, qualified and experienced radiographers to join our friendly, dedicated team. The ideal candidate will require a minimum of six months full time MRI experience. A requirement to work independently, with initiative is essential. The successful candidate must also be able to work fluidly as part of the MRI team to optimise workflow. You must have a degree or equivalent qualification in Diagnostic Radiography and be registered with the HCPC.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The MRI department at Leighton Hospital offers a comprehensive range of examinations including cardiac, small bowel, neurology, musculoskeletal, oncology, abdominal and breast imaging. The department currently has two Siemens Aera, 1.5T scanners  and a third, state of the art Siemens Sola, 1.5T MRI scanner.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The hours for this post are 21.5 hours per week, this will include evening, weekends and bank holidays on a rotational basis. There is also a possibility of an additional 15 hours maternity leave cover, commencing on 1st March 2021. If you would like an informal visit to view the department or have any questions please contact Mrs Nicola Collings MRI Lead Radiographer.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leighton Hospital, Crewe Middlewich Road Crewe Cheshire CW1 4QJ", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259656", "validThrough": "2020-11-13T23:59:59+0000"}