{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 to £73,664 pa"}}, "datePosted": "2020-10-27T12:00:40+0000", "description": "&lt;p&gt;The South Yorkshire and Bassetlaw Integrated Care System are seeking an experienced, politically astute Hosted Network Manager for our Maternity work stream. Strong operational, strategic and political skills are required for a role engaged in large scale transformation work:&lt;/p&gt;\n&lt;p&gt;NHS organisations in South Yorkshire and Bassetlaw have come together as an Integrated Care System. A key aim of this is to ensure sustainability of services right across our geography, and a number of services have agreed to work as ‘Hosted Networks’ to facilitate this. Hosted Networks (HNs) will develop shared, system-wide approaches to service transformation and sustainability, concentrating on areas such as our workforce, developing shared clinical approaches and making the best use of innovative practice.&lt;/p&gt;\n&lt;p&gt;In Maternity, the Hosted Network works closely with our Local Maternity System, which is mandated to deliver the national Maternity Transformation Programme (and the recommendations of the Better Births report). We are reviewing the way in which the two work together, and expect this to become closer still.&lt;/p&gt;\n&lt;p&gt;The Hosted Network Manager will support the delivery of transformational change through developing shared working across the acute providers in South Yorkshire and Bassetlaw. The post holder will work closely with Clinical Leads to develop, and facilitate the delivery of, the maternity work programme.&lt;/p&gt;\n&lt;p&gt;The post holder will take responsibility for building collaboration between t core stakeholders, in order to make services in SYB more resilient and sustainable. The core elements of the role will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing relationships with staff, operational leads, and senior managers and executives in provider and commissioning organisations across the Integrated Care System.&lt;/li&gt;\n&lt;li&gt;Supporting the development of the work programme for the Hosted Network, with a focus on making the workforce more sustainable and providing greater consistency of clinical approach for patients, through shared working.&lt;/li&gt;\n&lt;li&gt;Providing operational, strategic and programme management input to support development and implementation of the work programme, to deliver service transformation for patients.&lt;/li&gt;\n&lt;li&gt;The post-holder will have extensive experience of working at a senior level in large organisation, and in a political environment, engaging stakeholders effectively. This is likely to have been in a complex health or social care environment. Experience of successfully facilitating large scale change is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Because of the nature of the post, you will be required to travel across South Yorkshire and Bassetlaw and the Yorkshire &amp; Humber area.&lt;/p&gt;\n&lt;p&gt;To discuss this post, please contact:&lt;/p&gt;\n&lt;p&gt;James Scott, Associate Programme Director, SYB ICS, james.scott11@nhs.net&lt;/p&gt;\n&lt;p&gt;Jade Rose, Director – Hospital Services, SYB ICS, jade.rose2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Sheffield Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128238"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S9 4EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3834", "longitude": "-1.41113"}}, "title": "Maternity Hosted Network Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244365", "validThrough": "2020-11-10T23:59:59+0000"}