{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14658", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 per hour"}}, "datePosted": "2020-10-28T11:25:35+0000", "description": "&lt;p&gt;Are you a proactive maintenance person with a wide range of practical skills who could help maintain a Grade II Listed building? Not only will you carry out a variety of maintenance tasks, you’ll oversee volunteers and contractors ensuring work is carried out with minimal disruption.&lt;br /&gt;&lt;br /&gt;Stagenhoe is a Sue Ryder specialist neurological care centre based in Hertfordshire, caring for people aged 18 and over who have life-changing conditions affecting the brain and nervous system. We are here for people with degenerative conditions which get worse over time - such as Huntington&#39;s disease, motor neurone disease, multiple sclerosis and Parkinson&#39;s disease - as well as those with acquired conditions resulting from a brain or spinal injury or stroke.&lt;br /&gt;&lt;br /&gt;Responsibilities will include:&lt;br /&gt;&lt;br /&gt;•Carry out maintenance duties including basic electrical, painting, plumbing and carpentry&lt;br /&gt;•To ensure work spaces are kept clean, clear and free of obstruction&lt;br /&gt;•Carry out periodic inspections and checks and update the maintenance schedule&lt;br /&gt;•Assist in the supervision and management of external contractors&lt;br /&gt;•Carry out removal of waste and maintain the refuse area&lt;br /&gt;•Ensure all work complies with Sue Ryder policies, Care Standards and other regulations and requirements&lt;br /&gt;•Ensure due attention to health and safety matters whilst carrying out any works&lt;br /&gt;&lt;br /&gt;It&#39;s an exciting time to join Sue Ryder and to hit the ground running ideally you will have knowledge of Health and Safety, COSSH and other relevant legislation&lt;br /&gt;&lt;br /&gt;Skills required:&lt;br /&gt;&lt;br /&gt;•Skilled in a range of minor maintenance procedures&lt;br /&gt;•Able to work within policies and procedures&lt;br /&gt;•Be able to communicate effectively verbally and in writing&lt;br /&gt;•Demonstrable skills in supervising others&lt;br /&gt;•Hold a PAT certificate or be prepared to undertake training&lt;br /&gt;•Ability to work closely with service users and communicate effectively with them&lt;br /&gt;•Hold a valid driving license&lt;br /&gt;&lt;br /&gt;*Competitive Benefits Package* – enhanced payments for unsocial hours, generous holiday entitlement, private pension, staff discount with thousands of retailers, 15% off New Goods and lots more. For a full list of employee benefits please visit our main careers webpage.&lt;br /&gt;&lt;br /&gt;Due to the remote location of Stagenhoe your own transport is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hitchin", "postalCode": "SG4 8BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8904", "longitude": "-.27928"}}, "title": "Maintenance Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246319", "validThrough": "2020-11-20T23:59:59+0000"}