{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T09:15:56+0000", "description": "&lt;p&gt;A unique and exciting opportunity has arisen to come and join our Start Well team in Stockport Family. We have an ambition to ensure all our children are ready to attend school with a good level of development, and have a focus on those pre school years to support families and children particularly in terms of reducing health and social inequalities.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated individual looking for a challenge in a new role, a great communicator and someone who is enthused by working in an integrated partnership.&lt;/p&gt;\n&lt;p&gt;You will be working as part of a locality multi-disciplinary team, including health visitors and early years workers to deliver the Stockport Start Well offer . This will involve working with young children and families in their own homes and in community venues, with nurseries and other settings to ensure timely early assessment of need and provision of evidence based interventions with the aim of ensuring the best possible outcome for children.&lt;/p&gt;\n&lt;p&gt;You will have experience of evidence based parenting and working with families on maximising the benefits of the home learning environment. You will have a good understanding of child development from 0-5 and be able to assess risk and resilience in families. You will have safeguarding experience and the ability to work with settings in a Team Around approach.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful, this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma McDonoughJob titleLocality LeadEmail addressemcdonough@nhs.netTelephone number07738 977220Additional contact information&lt;/p&gt;\n&lt;p&gt;Or contact LJ Woodward Locality Lead on 07800618154&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Stockport", "postalCode": "SK1 3XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.406", "longitude": "-2.15849"}}, "title": "Start Well Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249443", "validThrough": "2020-11-15T23:59:59+0000"}