{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-06T10:00:52+0000", "description": "&lt;p&gt;Are you passionate about helping young people and their families with mental health problems? Do you have experience of working with Children, Young People and Families and are committed to getting the best outcomes for them? Are you looking for an opportunity to develop and share your skills and knowledge in mental health? Would you like to be part of a forward thinking, supportive and developing service? If you answer yes to these questions, then Wakefield Child and Adolescent Mental Health Service (CAMHS) is the place for you!&lt;/p&gt;\n&lt;p&gt;We are looking for a qualified and experienced Play Therapist who is able to work within a busy multidisciplinary team CAMHS service.&lt;/p&gt;\n&lt;p&gt;As a Play Therapist you will have undertaken specialist play therapy training. You will be able to work autonomously within the context of a multi-disciplinary team approach and undertake specific clinical work with patients and their families who can often present with a range of complex mental health needs.&lt;/p&gt;\n&lt;p&gt;You will manage your own caseload, providing a range of high quality care appropriate to the young person’s needs which will include risk assessment and management, consultation and evidence based interventions. You will maintain clinical records in accordance with Trust policy.&lt;/p&gt;\n&lt;p&gt;You will need to develop good working relationships with key professionals across the district; therefore excellent communication and engagement skills are essential. A commitment to improving service delivery and developing new ways of supporting the wider team is essential.&lt;/p&gt;\n&lt;p&gt;In return we will offer you a motivating team environment and regular clinical and managerial supervision. You will have an annual appraisal with a view to developing clinical knowledge and skills.&lt;/p&gt;\n&lt;p&gt;This post will work across the Wakefield District and you may see young people in different community settings as well as the CAMHS bases in the area.&lt;/p&gt;\n&lt;p&gt;You must be a registered Play Therapist and hold a current UKPC registration.&lt;/p&gt;\n&lt;p&gt;You will be required to demonstrate a flexible approach to travel as you may see young people in different community settings as well as the CAMHS bases in the area.&lt;/p&gt;\n&lt;p&gt;Informal visits and enquires are strongly encouraged. Please contact Claire Sidebottom, Team Manager or Anita Sabey, Specialist Child and Adolescent Therapist on 01977 735900&lt;/p&gt;\n&lt;p&gt;Please note the working pattern for this position is 37.5 hours per week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "WAKEFIELD", "postalCode": "WF1 2TE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6823", "longitude": "-1.50335"}}, "title": "Senior Mental Health Practitioner - Play Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259139", "validThrough": "2020-11-07T23:59:59+0000"}