{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-27T17:00:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department at the Bury and Rochdale Care organisations (Fairfield General Hospital and Rochdale Infirmary) are progressive, forward thinking and focused on the provision of high quality clinical services. We are committed to continually developing our team of Clinical Pharmacists and you will work within a supportive and friendly environment to facilitate this growth and career enhancement.&lt;br /&gt;&lt;br /&gt;Our Pharmacy Departments are modern, well staffed. As one of our Trust wide rotational band 6 Pharmacists you will undertake a rotational, competency based, clinical training programme. This programme will enable you to rotate around the Trust to allow you to experience the vast number of specialities the Trust has to offer including medicine, surgery, paediatrics, medicines information, aseptic services and clinical trials to mention but a few.&lt;/p&gt;\n&lt;p&gt;You will work under the direct supervision of experienced Clinical Pharmacists to gain expertise in all specialities taking a pro-active approach to patient care. &lt;br /&gt;&lt;br /&gt;So, if you are a hospital Pharmacist who wants to experience new challenges, a newly qualified Pharmacist looking for that all important first post,a pre-registration Pharmacist or a community Pharmacist who would like to experience hospital pharmacy in a supportive and structured environment, then this is the post and Trust for you.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Diane Elford&lt;br /&gt;Lead Clinical Pharmacist&lt;br /&gt;diane.elford@pat.nhs.uk&lt;br /&gt;0161 778 3562&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Rotational Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245508", "validThrough": "2020-11-10T23:59:59+0000"}