{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-26T08:15:01+0000", "description": "&lt;p&gt;Following significant new funding for our Liaison Psychiatry Services across Somerset, we are offering new and exciting opportunities to join our expanding service within the Yeovil Liaison Psychiatry Service.&lt;/p&gt;\n&lt;p&gt;If you are a highly motivated Mental Health Nurse (RMN), Social Worker or Occupational Therapist (OT) with a &#39;can do&#39; attitude and an interest in being part of a growing specialist service then this is the job for you!&lt;/p&gt;\n&lt;p&gt;You&#39;ll undertake high quality assessments for individuals within the Acute General Hospital experiencing mental health issues, physical illness and distress.&lt;/p&gt;\n&lt;p&gt;The role includes working flexibly across a 24-hour shift rota, 7 days a week and will include 12 hour shifts, allowing you to work your hours in less days and therefore improve your work life balance, giving you more time off to enjoy the dynamic lifestyle Somerset has to offer.&lt;/p&gt;\n&lt;p&gt;You should have experience of working with and willingness to teach and educate others within the team and the General Hospital as well as a commitment to service development and the best possible outcomes for people within the acute hospital setting.&lt;/p&gt;\n&lt;p&gt;In return, we can offer you the opportunity to be part of a dynamic expanding service, bespoke Liaison Psychiatry Training and a high level of Clinical Supervision and support, all within the framework of the Psychiatric Liaison Accreditation Network.&lt;/p&gt;\n&lt;p&gt;You&#39;ll be joining us at a very exciting time as we are currently going through the PLAN accreditation process, which opens up additional opportunities for training and networking with other like-minded liaison clinicians.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Sonia Sansom, Liaison Psychiatry Service Manager on 07920822509 or Kate Bowyer, Clinical lead on 01935 384730&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil", "postalCode": "BA21 4AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9453", "longitude": "-2.63391"}}, "title": "Psychiatric Liaison Practitioner, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241693", "validThrough": "2020-11-09T23:59:59+0000"}