{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T11:46:23+0000", "description": "&lt;p&gt;Band 5 Registered Nurse Vacancies Acute Surgical Adult wards&lt;/p&gt;\n&lt;p&gt;Apply now on line and you could walk away with the job of your dreams! Applications are now being accepted for registered Nurses for our Wrexham Maelor Hospital within the Betsi Cadwaladr University Health Board (BCUHB) which delivers high quality, integrated care to a wide diverse population of patient / clients across North Wales.&lt;/p&gt;\n&lt;p&gt;If you have the drive and determination to succeed in a progressive, successful organisation in North Wales, whilst ensuring that high quality, safe care, underpinned by best practice, is delivered consistently we would like you to apply.&lt;/p&gt;\n&lt;p&gt;We have great education and development opportunities, thanks to our close links with our local Universities, along with induction, orientation and preceptorship, we will make sure you are looked after and supported in enhancing your skills through continuing professional development.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunity to work in a number Surgical wards &amp; Critical Care Units within the Hospital.&lt;/li&gt;\n&lt;li&gt;A chance to work with joint Medical, Nursing and Operational teams to drive forward our ambitious plans to reconfigure and redesign our patient services and pathways across our hospital and within the Community.&lt;/li&gt;\n&lt;li&gt;Support to advance your nursing career in a place that allows you to reach your goals inside work and out.&lt;/li&gt;\n&lt;li&gt;Opportunities for rotations across community hospitals and acute hospitals to develop and enhance your clinical experience and skills.&lt;/li&gt;\n&lt;li&gt;Continued professional development opportunities through our in house practice development programme and external academic courses within universities.&lt;/li&gt;\n&lt;li&gt;Excellent opportunities for career progression to Ward Sister, Charge Nurse, Advanced Nurse Practitioner, Clinical Nurse.&lt;/li&gt;\n&lt;li&gt;Specialist and Consultant Nurse roles.&lt;/li&gt;\n&lt;li&gt;Leadership programme for our future clinical leaders.&lt;/li&gt;\n&lt;li&gt;If you wish to continue to live in England and travel to North Wales, then many of our hospitals are within commutable distance and parking is free within our hospital sites.&lt;/li&gt;\n&lt;li&gt;Financial support to help you relocate to North Wales (if appropriate).&lt;/li&gt;\n&lt;li&gt;Flexible working options to enable you to achieve a great work-life balance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have the passion, vision and ability to make a difference and help move services forward, while getting the best out of your colleagues and team we want to hear from you today!&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;MATRON KELLY JONES: 01978 727226&lt;/p&gt;\n&lt;p&gt;FOR FURTHER DISCUSSION WITH SENIOR SISTER CONTACT BELOW:&lt;/p&gt;\n&lt;p&gt;SAU / Glyndwr Senior Sister Jackie Evans 01978 725016&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham Maelor Hospital, Wrexham", "postalCode": "LL13 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0462", "longitude": "-3.01018"}}, "title": "Staff Nurse Surgery - SAU Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257508", "validThrough": "2020-11-19T23:59:59+0000"}