{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40890", "minValue": "36479", "unitText": "YEAR", "value": "£36,479 - £40,890"}}, "datePosted": "2020-11-05T09:56:56+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Scrub Practitioner to join our Operating Theatres team based at The London Clinic’s main hospital in Central London, W1G 6BW, with a salary range on offer of £36,479 - £40,890. The London Clinic has a supportive and warm working culture where your contribution is valued, and you can help us provide the best, personalised healthcare, and deliver our three core values of; Caring, Inspiring and Pioneering.&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest private hospitals, with state-of-the-art facilities located around Harley Street. We have approx. 1300 employees across 8 sites, where we cover a broad range of specialisms, including complex medical and surgical procedures and a comprehensive range of cancer and outpatient services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Profile&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Scrub Practitioner you will support in the management and organisation of care provision within the operating department, responsible for the delivery of the highest standards of care and services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type:&lt;/strong&gt;  This is a full-time, permanent position working 37.5 hours per week.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Shifts:&lt;/strong&gt; We operate a mixed shift pattern - Earlies / Lates (typically 5 x 7.5 hour shifts between the hours of 07:30am – 9:30pm), with participation in the weekends &amp; on-call rota.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package: &lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;            - Contributory pension scheme (total annual contribution up to 20%).&lt;/p&gt;\n&lt;p&gt;            - Private Medical Healthcare.&lt;/p&gt;\n&lt;p&gt;            - 33 day’s annual leave (Inclusive of bank holidays).&lt;/p&gt;\n&lt;p&gt;            - Season ticket travel loan, family friendly benefits, and a wide range of                              discounts with a variety of retailers/services, plus much more.&lt;/p&gt;\n&lt;p&gt;            - We also offer excellent career development; with clear career pathways and                     access to further education.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Duties&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake all activities in a professional and proficient manner, including mandatory surgical checks prior to the start of the procedure, as well as during and pre wound closure.&lt;/li&gt;\n&lt;li&gt;Carry out scrub duties according to policies and procedures, contributing to quality improvement, and promoting best evidence based practice.&lt;/li&gt;\n&lt;li&gt;Assemble, check, prepare, and coordinate the use of surgical equipment, drugs and consumables for a wide range of operative procedures.&lt;/li&gt;\n&lt;li&gt;Act in the circulating role, and promote a patient focused approach to care in collaboration with all relevant healthcare professionals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse or Practitioner with NMC or HCPC registration.&lt;/li&gt;\n&lt;li&gt;Proven experience in an operating theatre environment with relevant experience in scrub procedures.&lt;/li&gt;\n&lt;li&gt;General scrub &amp; circulating skills, with experience of applying clinical reasoning skills across a varied patient case mix.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills with the ability to work as part of a multi-disciplinary team, and in sensitive and challenging situations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt;The London Clinic’s main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. Speciality areas include, General surgery; ENT; Gynae; Hepatobiliary; Neuro; Ophthalmic; Orthopaedic; Plastics; Robotic; Urology; Vascular &amp; Bariatric surgery.&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257126", "validThrough": "2020-11-30T23:59:59+0000"}