{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa pro rata"}}, "datePosted": "2020-11-05T10:16:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced and qualified Nursing Assistant or Healthcare Assistant?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in an outstanding acute NHS trust that truly values their staff? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work at an NHS trust that is committed to ensuring your ongoing development and training of a wide range of clinical skills and knowledge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the role of a Nursing Assistant at UHBW?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order to undertake this role you should have at least six months experience in similar healthcare role and have a minimum of an NVQ level 2 qualification in Health and Social Care. You must be able to work a minimum of 3 long shifts per week, on a 24/7 rota (no fixed shifts)&lt;/p&gt;\n&lt;p&gt;You will play an essential role in supporting the delivery of the highest standard of quality care to our patients, working alongside registered nurses and other healthcare professionals. Your role will include a wide range of tasks, from providing personal and intimate care to undertaking clinical observations. You will be required to follow stringent policies such as infection control and manual handling policies. In addition you will be providing emotional and practical support to patient &amp; their families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join us at UHBW?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we are passionate about supporting our staff and clinical teams, so that we can achieve our common goal of delivering outstanding patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we can offer job security in these uncertain times within an organisation that is dedicated to the well being of its staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we are one of a handful of health trusts to have achieved a CQC rating of “Outstanding” for a second time second time in succession.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we are located in the heart of the vibrant City of Bristol, and the gateway to the glorious South West.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we can offer a post in a variety of areas including T&amp;O and Theatres,\n&lt;p&gt;Medicine wards and Emergency Department at the Bristol Royal Infirmary (BRI), and South Bristol Community Hospital.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we are a digital exemplar NHS trust, using the latest technology such as e-obs to ensure we deliver the best possible care to our patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Assessment &amp; Selection &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to Covid-19 we have changed our assessment &amp; selection process to keep candidates, staff and patients safe and ensure social distancing. The initial shortlisting will be based on your application form, so please make sure you include specific details of relevant qualifications, to ensure that you are shortlisted.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be invited to a virtual interview which will be held every Wednesday morning by Webex/skype or similar. Available vacancies will be discussed with successful candiates.&lt;/p&gt;\n&lt;p&gt;If you have applied within the last 6 months, please do not re apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ann Sherwood, Talent Acquisition Manager, Ann.sherwood@uhbristol.nhs.uk or tel: 0117 342 9235&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Experienced Nurse Assistant - Adults Services only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257205", "validThrough": "2020-11-09T23:59:59+0000"}