{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-28T11:17:10+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within First Step, North Cumbria’s IAPT service to appoint a Psychological Wellbeing Practitioner (PWP).&lt;/p&gt;\n&lt;p&gt;We are a dedicated team offering a range of psychological therapies and services to treat people and support recovery within a stepped care model. The team is made up of approximately 80 clinicians including Psychological Wellbeing Practitioners, High Intensity Therapists, Counsellors and Employment Advisors.&lt;/p&gt;\n&lt;p&gt;The PWP role within the service is extremely varied and will allow you to gain a range of experience. PWP’s in the service provide low intensity CBT interventions, including guided self-help treatment (Face to face and over the phone), Psycho-educational workshops and computerised CBT (cCBT) to patients experiencing common mental health problems. PWPs also complete Triage assessments and have involvement with service development and promotion. PWP’s receive regular case management supervision, line management supervision, clinical skills supervision and further training opportunities, to ensure development of core skills and practice.&lt;/p&gt;\n&lt;p&gt;This service is an 8am – 8pm service weekdays with some Saturday shifts required. The post holder will be based in Carlisle in the East of the county and will be required to work into a number of venues across the locality.&lt;/p&gt;\n&lt;p&gt;As a service we are currently offering a combination of face-to-face and remote working (telephone consultation and video consultation delivered either from one of our office bases or via home working), which offers an opportunity for improved work / life balance. We anticipate that this will also be the case in the future.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be employed by Cumbria, Northumbria Tyne and Wear NHS Trust.&lt;/p&gt;\n&lt;p&gt;Applications are invited from clinicians who are able to meet the requirements of the person specification. It is essential that you have completed the PG Cert in Low intensity Psychological Therapies.&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate excellent interpersonal and communication skills and be committed to developing your clinical practice and knowledge within this role. You will work with people with different cultural backgrounds and ages, using interpreters when necessary and should be committed to equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Victoria Rooney&lt;/p&gt;\n&lt;p&gt;Job title: First Step Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: victoria.rooney@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07795343627&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Janine Carr - First step Team Leader&lt;/p&gt;\n&lt;p&gt;Phone: 07827355929&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "13/14 Portland Square, Carlisle", "postalCode": "CA1 1PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8925", "longitude": "-2.92727"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246259", "validThrough": "2020-11-11T23:59:59+0000"}