{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T11:39:27+0000", "description": "&lt;p&gt;Birmingham Women’s and Children’s NHS Foundation Trust are committed to creating the best place to work, where all staff can reach their full potential. We believe in promoting and enhancing inclusion, diversity and equality and welcome and encourage applications from all areas of the community, who meet the criteria for the role, regardless of age, gender, disability, race, religion or sexual orientation. We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For most roles flexible working may be considered, we would encourage you to speak to the recruiting manager about this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’d like from you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN/RNLD Qualified&lt;/li&gt;\n&lt;li&gt;NMC (Nursing &amp; Midwifery Council Registered)&lt;/li&gt;\n&lt;li&gt;Knowledge of the Mental Health Act&lt;/li&gt;\n&lt;li&gt;Patient centric &amp; commitment to delivering high quality care&lt;/li&gt;\n&lt;li&gt;Assessing and managing risk effectively&lt;/li&gt;\n&lt;li&gt;Positive risk taking safely&lt;/li&gt;\n&lt;li&gt;Clinically sound decision making skills&lt;/li&gt;\n&lt;li&gt;Excellent organisational capability&lt;/li&gt;\n&lt;li&gt;Effective communication skills&lt;/li&gt;\n&lt;li&gt;Self-awareness&lt;/li&gt;\n&lt;li&gt;Flexibility and a strong “can do” attitude&lt;/li&gt;\n&lt;li&gt;Wants to make a difference&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we’d like to give you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive induction and commitment to on-going training&lt;/li&gt;\n&lt;li&gt;Excellent leadership experience&lt;/li&gt;\n&lt;li&gt;27 days annual leave plus bank holidays – increasing to 33 days plus bank holidays after 10 years’ service&lt;/li&gt;\n&lt;li&gt;Staff wellbeing events&lt;/li&gt;\n&lt;li&gt;Free flu jabs&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Just drive scheme&lt;/li&gt;\n&lt;li&gt;SMART Childcare Vouchers&lt;/li&gt;\n&lt;li&gt;SMART Pension option&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Be part of a unique and exciting development in mental health services for 0-25s in Birmingham. Forward Thinking Birmingham launched in April 2016 bringing an innovative model of care to children, young people and young adults’ mental health care across the city.&lt;/p&gt;\n&lt;p&gt;This role presents an exciting opportunity for an experienced nurse to join our unique service as it develops. The post holder will undertake a wide range of duties to develop, support and enhance the case management within our community mental health team for our patients and their families. We are particularly looking for highly motivated nurse with a strong background in Children Psychiatry and emotional well-being with CAMHS experienced.&lt;/p&gt;\n&lt;p&gt;Applicants will need to demonstrate experience and knowledge in the areas of the delivery of mental health care in the community, with particular reference to the needs of children and young adults, together with an understanding of both the Care Programme Approach (CPA) and care management processes.&lt;/p&gt;\n&lt;p&gt;The post will involve holistic mental health assessments, signposting and liaison, specialist clinical input to children and young people with physical health and co morbid mental health issues (e.g. eating disorders), working with parents schools and educating colleagues. You would need to be confident and competent in positive risk assessment and management with robust care plans, and be able to provide brief solution-focused interventions to support children, young people and their families.&lt;/p&gt;\n&lt;p&gt;This will include key tasks of undertaking high quality assessments, developing care plans, delivering and reviewing therapeutic interventions. You will act as a supervisor and role model to others. The post will involve working with young people with a wide range of severe and challenging needs. Involving a holistic person centred approach to assess individual needs including social, leisure, education and employment.&lt;/p&gt;\n&lt;p&gt;The post includes coordinating patients that are brought to the 136 in need of a place of safety and the psychiatry decisions unit.&lt;/p&gt;\n&lt;p&gt;The post holder will manage referrals and care pathways, delivering a high quality innovative service for our 0-18 age range using research evidence and good practice guidelines. The post holder will take a lead role in developing a seamless service across the Forward Thinking Birmingham partnership and external stakeholders.&lt;/p&gt;\n&lt;p&gt;Applicants will be expected to demonstrate a high level of decision making skills and to work independently. You will also need to be proficient with the use of IT systems for both data and documentation purposes.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding this post please contact Louise Lorne on louise.lorne@nhs.net or Paul Allen on 07880051417 paul.allen2@nhs.net&lt;/p&gt;\n&lt;p&gt;We are flexible in our approach to supporting applicants to develop their clinical expertise within the age range of our service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Forward Thinking Birmingham is a ground-breaking mental health partnership established to revolutionise mental health care and give children, young people and young adults up to the age of 25 the modern service that they need and deserve.&lt;/p&gt;\n&lt;p&gt;Our vision is to be the first city where mental health problems are not a barrier to children, young people or young adults achieving their dreams.&lt;/p&gt;\n&lt;p&gt;Bringing together the expertise of Birmingham Women’s and Children’s NHS Foundation Trust, the Priory Group, and The Children’s Society, Forward Thinking Birmingham provides a single point of access for children, young people, young adults and families, GPs, schools and local authorities, to get the right support at the right time.&lt;/p&gt;\n&lt;p&gt;From flexible community and home-based care, to inpatient and crisis service, we offer children, young people and young adults mental health support, care and treatment that is truly fit for purpose and tailored to their requirements, no matter where they live in the city, or how complex their needs are.&lt;/p&gt;\n&lt;p&gt;Our ambitious mission is to exceed all expectations of what mental health services can achieve for children, young people and young adults in Birmingham, resetting the bar for generations to come.&lt;/p&gt;\n&lt;p&gt;Could you be part of this? Young people have told us that the right people are key to their experience of services and are just as important as the actual care they receive.&lt;/p&gt;\n&lt;p&gt;We’ve redefined the way we deliver support and have a range of positions available. We’re looking for staff who are committed to delivering safe, caring and innovative solutions to mental health services for 0-25s.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B13 8QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.44", "longitude": "-1.89852"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253778", "validThrough": "2020-11-17T23:59:59+0000"}