{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-29T13:01:04+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Kent and Medway NHS &amp; Social Care Partnership Trust to join the Finance department as a Finance Business Partner. Reporting to the Associate Director of Finance (Financial Management), this is a key post working with the Care Group to provide expert financial advice.&lt;/p&gt;\n&lt;p&gt;Your role will be essential in ensuring that the Trust receives value adding financial expertise, information and support in relation to monthly expenditure and income. You will be the lead for the Care Group, working closely with managers and the Head of Service to ensure robust budget management is in place. You will support on business cases and costing as required, as well as focus on efficiency opportunities and delivery of CIPs. You will provide financial leadership to one Associate Finance Business Partner to ensure accurate information is used and deadlines are met.&lt;/p&gt;\n&lt;p&gt;In order to succeed in this role you will be highly motivated, CCAB qualified, possess excellent communication skills, have a strong understanding of finance within the NHS and the ability to engage with a range of stakeholders including clinical and non clinical staff to drive the financial agenda within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If we receive high level of applications, the vacancy may close early. So, we encourage you to submit your application as soon as possible.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;NO AGENCIES PLEASE&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola GeorgeJob titleAssociate Director of FinanceEmail addressnicola.george@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Magnitude House, Aylesford, Aylesford", "postalCode": "ME20 6WT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3162", "longitude": ".456462"}}, "title": "Finance Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248426", "validThrough": "2020-11-12T23:59:59+0000"}