{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T08:30:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, you’re eager to learn more about Complex Care nursing at North Bristol NHS Trust. Here are some of the reasons we’re unique… &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are a forward-thinking innovative, multidisciplinary team caring for patients with complex acute medical and social needs at North Bristol NHS Trust&lt;/li&gt;\n&lt;li&gt;Caring for patients with complex needs, our team have experience in a wide variety of specialties, including learning difficulties and mental health conditions, providing a holistic approach to patient experience&lt;/li&gt;\n&lt;li&gt;Our nurses work within our multidisciplinary team to provide complex discharge planning and we’re proud of developing management experience within the team for those looking to progress to senior positions&lt;/li&gt;\n&lt;li&gt;We’re home to the ‘Purple Butterfly’ project, a palliative care initiative that has gained us national recognition and awards, including Palliative and Hospice Care Team of the Year award at the British Medical Journal&lt;/li&gt;\n&lt;li&gt;We give our nurses the opportunity to learn about complex and acute medical conditions in a supporting caring environment; our dedicated Practice Development Nurses support bespoke professional development opportunities across our complex care wards (9b,28a,28b) and Complex Assessment Unit (32a)&lt;/li&gt;\n&lt;li&gt;We are striving to achieve the Quality Mark for Elder Friendly Hospital Wards, in partnership with the Royal College of Psychiatrists&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;But it’s not just our complex care units which are impressive; our trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and well-being initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills&lt;/li&gt;\n&lt;li&gt;Staffs are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Registered Nurse working within an acute setting, looking to further develop your skills within complex care&lt;/li&gt;\n&lt;li&gt;A newly qualified/qualifying nurse looking to develop fundamental skills that will be invaluable for your future career aspirations&lt;/li&gt;\n&lt;li&gt;An experienced Registered Nurse working in a non-acute setting (i.e. nursing home) looking for a supportive environment to make the move into the acute setting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, are we right for each other? Here are your next steps…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;nursing@nbt.nhs.uk or call us on 0117 41 44550&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse - Complex Medicine-Band 5 (Experienced and Newly Qua", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251339", "validThrough": "2020-12-14T23:59:59+0000"}