{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T09:16:05+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a challenging but rewarding role in our Health &amp; Justice Health Care Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for qualified CBT Therapist to develop their clinical practice within our continuously evolving Healthcare Department at HMP Garth. The service provides a stepped-care model for the treatment of people with a range of common mental health problems.&lt;/p&gt;\n&lt;p&gt;The prison is based in Leyland, Lancashire and is easily accessible by public transport, Garth prison is a Male Category B prison within the long term high secure estate.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health are the lead provider of Health care services into HMP Garth.&lt;/p&gt;\n&lt;p&gt;This is an exciting and dynamic role for the post holders who will be looking to expand their knowledge in health and justice services.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit warm, compassionate, caring, hard working individuals to join our friendly, vibrant and passionate team at HMP Garth.&lt;/p&gt;\n&lt;p&gt;The post provides an opportunity to work as part of a large team of highly experienced and skilled healthcare professionals.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have completed the appropriate training and must be well experienced in working with common mental health problems, using a Cognitive Behavioural Therapy (CBT) based approach. They must be able to provide comprehensive assessments and formulations, including risk assessment and management, and be able to demonstrate their ability to deliver a range of evidence-based, psychological interventions, which will include both individual and group work both face to face and using&lt;/p&gt;\n&lt;p&gt;Applicants must possess good communication skills, have a pleasant personality and be committed to patient care.&lt;/p&gt;\n&lt;p&gt;The post holder will enjoy working within a busy, friendly and professional team, and Greater Manchester Mental Health is keen to support and develop all new members of staff with their training and development needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Allen Head of Healthcare&lt;/p&gt;\n&lt;p&gt;Email address: emma.allen@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01772 443421&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Garth, Leyland", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Cognitive Behavioural Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239791", "validThrough": "2020-11-08T23:59:59+0000"}