{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "To be discussed"}}, "datePosted": "2020-10-20T08:57:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you want the best of both worlds?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Working in an individual practice but with the knowledge, support, drive and expertise of a large partnership?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Wyre Forest Health Partnership (WFHP) is looking for a &lt;strong&gt;GP partner to join our small, friendly and dynamic Hagley Surgery site, working 6 – 8 sessions per week to support 8600 patients &lt;/strong&gt;who shares our passion for quality healthcare and can assist us to become the best we can be in a modern NHS.&lt;/p&gt;\n&lt;p&gt;WFHP was formed three years ago and now consists of six surgeries based in the beautiful Wyre Forest area. We have 44 GPs and over 200 staff looking after over 73,000 patients. As a large partnership we offer excellent working environment with the opportunity to pursue your clinical interests and further professional development with exceptional support and a good work/life balance.&lt;/p&gt;\n&lt;p&gt;We are looking for a keen and enthusiastic team player who can demonstrate commitment and flexibility with the drive to deliver a high standard of patient centric medicine whilst maximising primary care business opportunities. We are seeking Doctors who share our passion and who can assist the partnership to become the best it can be in a modern NHS.&lt;/p&gt;\n&lt;p&gt;See attached information for further details on what Hagley has to offer.&lt;/p&gt;\n&lt;p&gt;For an informal chat, please contact Amelia Lawrence, Site Manager - amelia.lawrence@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wyre Forest Health Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133675"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hagley nr. Stourbridge", "postalCode": "DY90NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4208", "longitude": "-2.14407"}}, "title": "GP Partner - Hagley Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233505", "validThrough": "2020-11-14T23:59:59+0000"}