{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum pro rata for Part time"}}, "datePosted": "2020-10-23T15:16:07+0100", "description": "&lt;p&gt;If you&#39;re looking for a new challenge and to work with a great team then this is the role for you.&lt;/p&gt;\n&lt;p&gt;Excellent patient care is our main focus with a structured education, training and development programme to help you develop your skills and your knowledge.&lt;/p&gt;\n&lt;p&gt;We offer a structured orientation programme which includes a bespoke cardiothoracic course delivered by our in house education team. We also run a Band 5 management programme which enables development of management and leadership skills whilst taking charge of the ward under the supervision of Senior nurses on the ward.&lt;/p&gt;\n&lt;p&gt;The Essex Cardiothoracic Centre is based on the site of Basildon Hospital and opened to patients on 1st July 2007. The impressive £60 million Centre is among the most modern of its kind in the country, with the latest equipment and technology throughout, including state-of-the-art operating theatres and cardiac catheter laboratories.&lt;br /&gt;&lt;br /&gt;Offering specialist diagnosis and treatment for people with cardiovascular and respiratory diseases, patients benefit from the highest quality treatment and care delivered by a team of experienced staff. Working as an integral member of the ward team, the post holder will expand, develop and utilise clinical skills to enhance and optimise clinical practice within this 32 bedded Cardiothoracic Ward.&lt;br /&gt;&lt;br /&gt;There is also an eight bedded area within the ward, which acts as an immediate post-operative area. All major thoracic surgical patients will be nursed here, along with patients following cardiac surgery on return from Critical Care.&lt;br /&gt;&lt;br /&gt;You will be primarily required to work as a skilled member of the surgical nursing team to assist in the high provision of care to patients and families, this includes assessment and evaluation for patients and following agreed care pathways.&lt;br /&gt;&lt;br /&gt;You will develop and maintain good unit management and organisational skills and assist with the provision of an environment conductive to the education of staff. Duties also to include the cleaning, maintenance and safe handling of equipment&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEugenie BenedictoJob titleWard ManagerEmail addresseugenie.benedicto@btuh.nhs.ukTelephone number01268394370Additional contact information&lt;/p&gt;\n&lt;p&gt;Eugenie Benedicto&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;eugenie.benedicto@btuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Essex Cardiothoracic Centre, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Staff Nurse - Chelmer Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241066", "validThrough": "2020-11-06T23:59:59+0000"}