{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-26T13:00:59+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and committed Clinical Psychologist to join the Children’s Diabetes Team at Calderdale and Huddersfield NHS Trust. The post will sit within a growing Clinical Health Psychology Department. This position is for a Band 7 or 8a depending on experience. Hours: part time, 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;If a band 7 candidate is recruited, relevant training, support and experience will be provided to ensure the successful applicant is eligible to develop into the 8a clinical psychology role over the course of 24 months and subject to meeting the agreed criteria.&lt;/p&gt;\n&lt;p&gt;The post is specifically working into the Children&#39;s Diabetes team to deliver exceptional psychological care to children and their families. This post forms part of the ongoing development of our growing Clinical Health Psychology Service in conjunction with the well-established Clinical Health Psychology Service at Mid Yorkshire NHS Hospital Trust. The successful candidate will be an integral part of the Children’s Diabetes multidisciplinary team, who greatly value the input of Clinical Psychology for their patients and staff.&lt;/p&gt;\n&lt;p&gt;The role will involve providing psychological services and clinical expertise to the Children’s Diabetes caseload including working with children and their families and carers. The successful candidate will work closely with specialist nurses and medical staff and a key aspect of the role is the provision of supervision, teaching, training, and consultation to the team. Service-evaluation and audit will also be an important and valued element of the role.&lt;/p&gt;\n&lt;p&gt;Clinical and professional supervision will be provided by a Principal Clinical Psychologist who specialises in paediatric diabetes and the successful applicant will be a member of the Clinical Health Psychology Department, which is a small but growing service, offering good opportunities for professional support and development.&lt;/p&gt;\n&lt;p&gt;This opportunity is suited to someone who is creative and innovative and can demonstrate excellent clinical, communication and leadership skills whilst demonstrating compassion and flexibility within this busy service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah SchorahJob titleClinical Nurse Manager, Paediatric Diabetes TeamEmail addresssarah.schorah@cht.nhs.ukTelephone number01484 342796Additional contact information&lt;/p&gt;\n&lt;p&gt;Gill Harries General Manager Children&#39;s and Women&#39;s 01422 224338&lt;/p&gt;\n&lt;p&gt;Stephanie How Yaw Lead Consultant for Diabetes Via switch board 01422 357171&lt;/p&gt;\n&lt;p&gt;Dr Hannah Gormley Principal Clinical Psychologist hannah.gormley@cht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale Royal Hospital/Huddersfield Royal Infirmary, Halifax", "postalCode": "HX3 0PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7053", "longitude": "-1.85728"}}, "title": "Psychologist Paediatric Diabetes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242548", "validThrough": "2020-11-15T23:59:59+0000"}