{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T09:16:08+0100", "description": "&lt;p&gt;The Occupational Therapy service for Blackpool Teaching Hospitals NHS Foundation Trust has a vacancy for a rotational Band 5 Occupational Therapist. The Trust offers rotations in acute medicine, emergency department, surgery, orthopaedics, cardiac, care of the elderly, rehabilitation, stroke &amp; community.&lt;br /&gt;&lt;br /&gt;As a Band 5 Clinician you will be required to take part in delivering a quality Occupational Therapy Service in balance with working clinically alongside Consultants and other members of the Multidisciplinary Team. You will need to have an enthusiastic approach, be forward thinking and have a problem solving approach to patient management. We are looking for individuals with excellent communication and interpersonal skills, who demonstrate the ability to support other team members.&lt;br /&gt;&lt;br /&gt;The successful candidates will be responsible for the provision of Occupational Therapy assessment, intervention and discharge planning of patients with multiple and sometimes complex diagnoses. &lt;br /&gt;&lt;br /&gt;Successful candidates will have access to clinical supervision, CPD time and be supported in their role with an individualized job plan. Some rotations will involve weekend working and bank holiday cover on a rota basis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne WildJob titleClinical Lead Occupational TherapistEmail addressjoanne.wild1@nhs.netTelephone number01253 955172&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239793", "validThrough": "2020-11-06T23:59:59+0000"}