{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T15:46:07+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a well motivated and enthusiastic person to join our dynamic Infection Prevention and Control Team as a Band 7 Infection Prevention and Control Nurse.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are seeking to recruit a nurse with experience in Infection Prevention and Control in order to provide a quality Infection Prevention to the Trust. The post holder will work under the guidance of the Head of Infection Prevention and Control as a specialist practitioner, facilitating the prevention, surveillance, investigation and control of infection within South Warwickshire NHS Foundation Trust. The focus on infection prevention has never been greater and the successful candidates will be expected to provide specialist infection prevention advice and education across the organisation, both in the acute and community settings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;He/She will be required to operate flexibly within the Infection Prevention Team structure to ensure that a comprehensive service is provided to the Trust, and where necessary act up and deputise for the members of the team.&lt;/p&gt;\n&lt;p&gt;The post holder is required to be a Registered General Nurse with at least 5 years post-registration experience and be able to demonstrate evidence of management skills. You must have at least 3 years previous experience working in Infection Prevention as a specialty, have undertaken a degree or diploma level Infection Prevention course and be familiar with current Infection Prevention &amp; Control regulations and guidelines. A recognized teaching qualification is also required in order to undertake the educational aspects of this role.&lt;/p&gt;\n&lt;p&gt;Although the post holder will be based at Warwick Hospital, the Infection Prevention Team provides a service to Stratford Hospital, Leamington Spa Hospital, Ellen Badger Hospital and Community Services for Warwickshire. The post holder will be required to provide on-call cover at weekends as part of an on-call rota.&lt;/p&gt;\n&lt;p&gt;For this interesting and varied post you will need to enjoy working as part of a team in a busy and pressured environment, with the ability to be well organised and to communicate effectively with the confidence to work on your own initiative. You will inspire and motivate staff, empowering them to ensure that all Trust Infection Prevention policies and procedures are implemented and embedded in practice.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristine GeorgeuJob titleHead of Infection Prevention and ControlEmail addressChristine.Georgeu@swft.nhs.ukTelephone number01926 482667&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Infection Control C23930, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Infection Prevention and Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256484", "validThrough": "2020-11-11T23:59:59+0000"}