{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-22T14:31:35+0100", "description": "&lt;p&gt;An exciting opportunity has arisen to work in The Oxfordshire adult community eating disorder service based at the Warneford Hospital, in Cotswold House, Oxford. It covers the Oxford City and the county of Oxfordshire. The team currently receives an average of 450-500 referrals per year and offers a range of interventions in line with NICE guidelines.&lt;/p&gt;\n&lt;p&gt;The specialist adult eating disorder service in Oxfordshire provides a stepped care, integrated multidisciplinary evidence-based treatment approach. The Oxford model has a strong Cognitive behavioural therapy (CBT-E) tradition, which was developed by Professor Christopher Fairburn. The team receives ongoing support by the senior researcher in the area. There is also an Inpatient consultant for Oxfordshire and is a strong advocate for eating disorders services nationally.&lt;/p&gt;\n&lt;p&gt;Patients are managed in secondary services alongside our partnership agencies in primary care.&lt;/p&gt;\n&lt;p&gt;The Oxfordshire Mental Health Partnership is an exciting partnership that formally brings together six local mental health organizations from the NHS and the charity sector: Connection Floating Support, Elmore Community Services, Oxford Health NHS Foundation Trust, Oxfordshire Mind, Response and Restore. The aim is to work much more closely with each other and with people who have mental health problems to make it easier for people to get the best possible support when they need it.&lt;/p&gt;\n&lt;p&gt;Oxford Health is an ambitious Trust dedicated to innovating, evaluating and implementing new treatments, procedures and services. As such we particularly welcome applications from clinicians who would like to negotiate dedicated PAs for clinical leadership, research, training or other areas of special interest. The trust offers a generous relocation package and works hard to accommodate flexible working patterns for staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will offer a £15,000 recruitment bonus and a relocation allowance of up to £8,000 to eligible candidates for this job. Also available is a cash alternative payment, equivalent to the employer contributions, in circumstances where staff opt out of NHS Pension Scheme membership due to the Lifetime/Annual limits on pension value.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Arabella Norman-Nott, Associate Medical Director,&lt;/p&gt;\n&lt;p&gt;Arabella.Norman-Nott@oxfordhealth.nhs.uk , 01865902907&lt;/p&gt;\n&lt;p&gt;Dr Rob Bale, Clinical Director : 01865 902759, Rob.bale@oxfordhealth.nhs.uk .&lt;/p&gt;\n&lt;p&gt;Dr Agnes Ayton, Consultant Psychiatrist : 07585402210, Agnes.Ayton@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cotswold House, The Warneford Hospital, Headington, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Adult Eating Disorders Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238918", "validThrough": "2020-11-12T23:59:59+0000"}