{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-03T15:31:28+0000", "description": "&lt;p&gt;&lt;strong&gt; Therapy Support Worker, Band 3.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Physiotherapy Outpatients, Kent and Canterbury Hospital, Canterbury.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt; 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to become part of the Physiotherapy Outpatient Team at East Kent Hospitals University Foundation Trust. The vacancy will be based at the Kent and Canterbury Hospital, Canterbury.&lt;/p&gt;\n&lt;p&gt;The Physiotherapy Outpatient team comprises of Band 5 physiotherapists through to Band 8a Extended Scope Practitioners, with various specialities. Physiotherapists assess and treat a wide variety of patients including trauma, orthopaedics, pre and post-surgery, acute and chronic injuries. Physiotherapy consultations are a mixture of face to face, video, telephone and class based and we receive referrals from GP’s, hospitals and staff self-referrals. As a Therapy Support Worker your role will be to support Physiotherapists by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;assisting with running patient classes, such as total knee replacement classes. We also offer hydrotherapy pool classes on site. Duties will include preparation of clinical areas and equipment, gathering and filing patient notes, meeting and directing patients on arrival, guiding patients through the class and their exercise plans, completing documentation and outcome forms, wiping down communal areas pre and post classes;&lt;/li&gt;\n&lt;li&gt;seeing patients who have been assessed and treated by physiotherapists to support them with their rehabilitation plans. This could be face to face, via video or phone;&lt;/li&gt;\n&lt;li&gt;providing administrative and clinical based support to colleagues such as printing off forms, managing the provision of laundry to the area, ensuring there is adequate PPE available&lt;/li&gt;\n&lt;li&gt;supporting colleagues on the wards as a therapy support worker in times of business continuity&lt;/li&gt;\n&lt;li&gt;completing any other ad hoc items as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;have excellent English language skills both written and verbal;&lt;/li&gt;\n&lt;li&gt;demonstrate an interest in physical activity, fitness and promoting good general health;&lt;/li&gt;\n&lt;li&gt;be able to demonstrate the ability to build and maintain a good rapport, as well as motivate patients during their rehabilitation. Previous patient or client facing skills are desirable;&lt;/li&gt;\n&lt;li&gt;be organised and able to manage own workload;&lt;/li&gt;\n&lt;li&gt;have a proactive approach, previous experience of identifying and implementing areas for improvement;&lt;/li&gt;\n&lt;li&gt;comfortable working with a variety of technology systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Regular supervision, competency training, performance reviews and Continued Personal Development are actively encouraged. You will have access to continuous support by senior staff and will receive appropriate training where needed. There is the opportunity to join the Trust’s QCF programme to work towards the Level 3 Diploma in Allied Health Profession Support.&lt;/p&gt;\n&lt;p&gt;For further information and/or to make an informal visit please email fared.alkordi@nhs.net , devon.amos1@nhs.net and dbase@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Therapy Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254578", "validThrough": "2020-11-17T23:59:59+0000"}