{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T11:15:57+0000", "description": "&lt;h1&gt;&lt;strong&gt;Senior Clinical Psychologist&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Black Country Health Care NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Intensive Support team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8a 0.8 wte&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to work with an innovative, forward thinking, and newly formed organisation?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to promotion of the current post holder, an exciting opportunity has arisen for an 8a Senior Clinical Psychologist to join the Intensive Support Team; A multi-disciplinary, community based Learning Disability Service located in West Bromwich, serving the Wolverhampton, Sandwell, Walsall and Dudley areas of the Black Country Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The team provides services to people with a learning disability experiencing significant mental health needs and/or display significant behavioural distress which may challenge community based services, to the extent that they are (or may be at high risk of) placement breakdown and/or admission to an Assessment and Treatment Service. The team is a key link in our stepped care whole pathway model, continues to innovate and develop and is now working towards 7 day working.&lt;/p&gt;\n&lt;p&gt;The team provides a full range of assessments, interventions, support, training and advice to individuals themselves, their families and paid carers and the network of multi-agency stakeholders who are involved in the care and support of people experiencing highly complex behavioural and/or emotional distress.&lt;/p&gt;\n&lt;p&gt;Guided by recovery principles, the team maintains close liaison and pathways with a range of existing and specialist mental health community teams, social support accommodation services and social care agencies across the Black Country in order to ensure that people with a learning disability and mental health and/or behavioural distress needs are also well supported by the full range of services and opportunities that meet their whole life person centred needs and aspirations.&lt;/p&gt;\n&lt;p&gt;The post-holder will be a valued colleague in a team committed to multi-disciplinary working with people with a learning disability who manifest highly complex clinical needs. They will bring to the team an experienced approach, which is highly attentive to recovery approaches, which combines the best of evidence based clinical assessment and formulation with integrative, client centred, therapeutic interventions. They will be skilled in both individual and group work which is carefully adapted to match the different intellectual as well as emotional abilities within the client group. They will have the necessary experience and skills to oversee the performance and development of psychological pathways, practitioners and trainees working within the team at different times.&lt;/p&gt;\n&lt;p&gt;Psychological professionals throughout all our services across the BCHFT have good links with the full range of Doctoral Psychology courses at the Universities of Birmingham, Coventry and Warwick and Wolverhampton. We have key staff closely involved with Research and Innovation. CPD and supervision for all grades of staff is highly valued. Psychological professionals are thoroughly integrated at all levels in the quality, governance and service development infrastructure of the Trust.&lt;/p&gt;\n&lt;p&gt;We look forward to receiving applications from HCPC registered Clinical Psychologists who can demonstrate the breadth and depth of experience and professional development which will underpin this challenging and exciting role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion about this post or to arrange a visit please contact: Dr David Rose, Consultant Lead Clinical Psychologist on 07817563211 or email davidrose4@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDavid RoseJob titleConsultant Lead Clinical PsychologistEmail addressdavidrose4@nhs.netTelephone number07817563211&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Cabin, West Bromwich", "postalCode": "B71 2BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.538", "longitude": "-1.99211"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242160", "validThrough": "2020-11-09T23:59:59+0000"}