{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-02T12:45:52+0000", "description": "&lt;p&gt;We have a rare opportunity for you to join our well established Breast Care Specialist Nursing Team for a period of 9 months to provide maternity leave cover. Bolton has a comprehensive Breast MDT offering a range of surgical and oncological treatments for patients diagnosed with breast cancer and a screening service at the Trust.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a dynamic, enthusiastic and reliable individual with experience and knowledge in Breast Cancer Care to join our team. The post holder will ensure that the patient has a supported journey by acting as their key worker and undertaking holistic needs assessments, at key points.&lt;/p&gt;\n&lt;p&gt;The post holder will hold well-developed interpersonal and communication skills, and should also possess good facilitation and IT skills. You must be able to demonstrate the ability to work as an effective member of a multidisciplinary team, having excellent clinical skills to deliver exceptional standards of care for all patients and their families.&lt;/p&gt;\n&lt;p&gt;The post holder will be keen to face challenges, be well organised and enthusiastic in participating with service development through audit and peer review. Helping to drive and sustain new initiatives to meet local and national standards, as well as ensuring care meets our own Trust values.&lt;/p&gt;\n&lt;p&gt;In return for your commitment the successful candidate will be offered professional support. You will develop skills enabling you to practice at an advanced clinical level, both in your own clinical practice and as a role model to others. Experience of working in nurse led clinics would also be advantageous.&lt;/p&gt;\n&lt;p&gt;You need to be a registered first level nurse with current NMC registration and have relevant further education/training in Breast cancer care/oncology. As this is to cover maternity leave this may be an opportunity for secondment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vicki O&#39;Donohue- Breast Care Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Email address: victoriaodonohue@boltonft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01204 390494&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Sarah Taylor sarah.taylor@boltonft.nhs.uk or Emma Ainscow emma.ainscow@boltonft.nhs.uk Breast Care Clinical Nurse Specialist&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bolton Hospital, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Breast Care Associate Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252105", "validThrough": "2020-11-16T23:59:59+0000"}