{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,146 p.a. inc. HCAS"}}, "datePosted": "2020-11-02T03:45:54+0000", "description": "&lt;h1&gt;&lt;span&gt;Maintenance Technician (Mechanical/Electrical), Band 5&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to a vacancy within the team, an opportunity has arisen to join the Estates Team as a Maintenance Technician (Electrical). This is an exciting time in terms of the development of the Trust’s estate and this role plays a significant part in supporting our clinical services, making a real difference to our patients and the department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You would ideally need to have an apprenticeship, C&amp;G, B-TEC ONC or recognised equivalent training in Electrical Engineering so that you are able to work on your own initiative, make safe and prioritize requests. Training may be available in site specific roles and you will be able to broaden and develop your skills with the support of the Works Officers. You will be working on the repair and maintenance of Trust Estates assets such as electrical power and lighting circuits, DB boards, plant controls, generators, mechanical and fire alarm control panels. You will also work on CSSD plant, steam boilers, heating systems, medical gas systems, AHU’s and refrigeration systems. There will be programmed planned preventative and statutory maintenance on selected equipment that you will be involved in managing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be based at St Peters Hospital but would be expected to work cross site at Ashford Hospital as required by the Works Officers and a free inter-site bus is available. We operate an Estates on-call rota which is usually one week in four, for which payment is made and you will be required to be apart of. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Maintenance Technician (Mechanical/Electrical)  -  Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251217", "validThrough": "2020-11-16T23:59:59+0000"}