{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-02T16:01:15+0000", "description": "&lt;p&gt;** This is a Fixed Term contract / Secondment opportunity until 31st March 2023 **&lt;/p&gt;\n&lt;p&gt;The National Institute for Health Research (NIHR) is funded through the Department of Health and Social Care. It is the nation’s largest funder of health and care research and is the research partner of the NHS and social care. The NIHR Clinical Research Network (CRN) Eastern is one of 15 local CRNs (LCRN), which fund and support this national research delivery at a local level. CRN Eastern covers research delivery at all NHS Trusts and research-active GP surgeries across East Anglia, serving a population of around 4 million people.&lt;/p&gt;\n&lt;p&gt;CRN Eastern helps to increase the opportunities for patients and the public to take part in clinical research and ensures that studies are carried out efficiently, improving the environment for clinical research in the NHS and social care in the Eastern region. The network is hosted by the Norfolk and Norwich University Hospital NHS Foundation Trust, which ensures that clinical research is embedded into the working practices of the NHS and within social care.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a dynamic individual wishing to take the next step in their communications and PR career. The role provides a fantastic opportunity to play an active part in helping the Eastern region and beyond to develop treatments and care for a wide range of conditions, including COVID-19.&lt;/p&gt;\n&lt;p&gt;The role of Communications Assistant for CRN Eastern will provide the successful candidate with the chance to gain significant experience of working in health research communications, covering public relations, digital media, marketing, events and stakeholder engagement.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide support to the CRN Eastern Communications work stream, led by the Senior Communications Manager. This will include undertaking administrative duties including filing, media monitoring, coordination of enquiries, and supporting the organisation of interviews, meetings and events.&lt;/p&gt;\n&lt;p&gt;They will also be required to support the Senior Communications Manager in the production and management of CRN Eastern publications and press releases, management of digital and social media platforms, along with production, stock control and distribution of NIHR and CRN Eastern engagement materials, and other related assets.&lt;/p&gt;\n&lt;p&gt;There may be occasional evening or weekend work required.&lt;/p&gt;\n&lt;p&gt;** If you are considering applying for this post on a secondment basis, please discuss with your Line Manager prior to applying to ascertain whether this could be supported **&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time: &lt;/strong&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 2nd November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEsther ReeveAdditional contact information&lt;/p&gt;\n&lt;p&gt;Esther Reeve - Senior Communications Manager&lt;/p&gt;\n&lt;p&gt;Tel: 07889 846513&lt;/p&gt;\n&lt;p&gt;Email: Esther.reeve@nihr.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Communications Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252748", "validThrough": "2020-11-16T23:59:59+0000"}