{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-09-30T12:15:17+0100", "description": "&lt;p&gt;Consultant Urological Surgeon&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a consultant in urological surgeon. The appointee will be expected to actively participate in the development and all other activities of the department. This post will take the number of consultants to six providing comprehensive core urology plus specialist stone work, female urology, andrology, nephrectomy and green light laser prostatectomy&lt;/p&gt;\n&lt;p&gt;Candidates should be on or eligible for inclusion onto the GMC Specialist Register for urology or be within 6 months of their expected date of obtaining a CCT (or equivalent) at the time of the interview.&lt;/p&gt;\n&lt;p&gt;A quarter of a million people are served by the West Suffolk NHS Foundation Trust. With over 3,000 staff and a vision to deliver the best quality and safest care for our community, the trust offers a full range of district hospital services together with specialist cancer and surgical services in conjunction with the neighbouring teaching hospitals.&lt;/p&gt;\n&lt;p&gt;Our vision is to deliver the best quality and safest care for our community – which we benchmark against the best. Our values, developed with staff and patients, have been clear since 2008 - &lt;strong&gt;FIRST&lt;/strong&gt; - &lt;strong&gt;F&lt;/strong&gt;ocused on patients; &lt;strong&gt;I&lt;/strong&gt;ntegrated team working; &lt;strong&gt;R&lt;/strong&gt;espectful and courteous; &lt;strong&gt;S&lt;/strong&gt;taff focused and supportive; &lt;strong&gt;T&lt;/strong&gt;wo-way open communication. We live these values and it shows in our key achievements below.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key achievements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In the NHS staff survey results for 2019, we emerged as an acute trust with one of the best performance engagement scores throughout the whole of England. 87% of staff would recommend the Trust for the treatment of a friend or relative and 77% would recommend the Trust as a place to work.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;As a global digital exemplar, we are investing in an e-Care system that will make us one of the first paperless hospitals and health systems in the NHS.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We are one of the top 10 sites in the country for hip, knee and joint replacement outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Our trust has scored top in the East of England for doctors’ overall training and satisfaction in acute trusts in the GMC national training surveys in 2018 and 2019&lt;/li&gt;\n&lt;li&gt;We have had the best early detection of cancer in the country for three years running&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Our trust was recently awarded a contract to develop an alliance to run local community services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We have had the best early detection of cancer in the country for three years running&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Bury St Edmunds is a beautiful market town that is regarded as ‘the jewel in the crown’ of East Anglia. It has excellent schools, independent shops and outstanding restaurants. Housing is plentiful and indeed affordable and the surrounding countryside beautiful.&lt;/p&gt;\n&lt;p&gt;West Suffolk Hospital is a University of Cambridge Teaching hospital foundation Trust and is a busy and popular hospital.&lt;/p&gt;\n&lt;p&gt;The Trust has close links with AddenbrookesHospital, Cambridge and CambridgeUniversityMedicalSchool. Situated in the heart of East Anglia, the cathedral town of Bury St Edmunds provides sophisticated facilities in a traditional and unspoilt rural town setting. There is also easy access to the Midlands, London and the East Coast and the holiday destination of North Norfolk.&lt;/p&gt;\n&lt;p&gt;We would welcome any applicants wishing to visit the department and this can be arranged via Miss Georgina Wilson (Urology consultant Georgina.Wilson@wsh.nhs.uk)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERVIEW DATE: 18th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome. However, Non-EEA candidates who require Tier 2 sponsorship may not be shortlisted or appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post, as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Border Agency requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill this post. For further information please visit the UK Border should be on or eligible for inclusion onto the GMC Specialist Register for General Surgery or be within 6 months of their expected date of obtaining a CCT at the time of the interview.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Consultant Urological Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206372", "validThrough": "2020-11-11T23:59:59+0000"}