{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive"}}, "datePosted": "2020-11-03T16:16:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Effectiveness Facilitator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Clinical Audit &amp; Effectiveness Department at North Mid has a unique opportunity for an individual to join a team aiming to improve quality and safety in patient care and be able to support and demonstrate good practice and quality improvements that take place across our services to enable the Trust to deliver excellent healthcare to the public within the area.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a self-motivated, skilled and committed Clinical Effectiveness Facilitator to provide support to the Head of Clinical Audit and Improvement in order to improve the outcomes for patients, the experience for patients and staff and have excellent value for money of trust services.&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of our Clinical Audit &amp; Effectiveness Department, providing support to help maintain and deliver a range of clinical audit &amp; effectiveness activities across the Trust, including coordination and oversight of the Trust mortality review process .&lt;/p&gt;\n&lt;p&gt;Our Quality Governance teams work together to promote and support a culture of learning and quality improvement across all aspects of patient care and experience within the Trust, so that the services we provide excellent outcomes for patients, an excellent experience for patients and staff and have excellent value for money of trust services.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have extensive knowledge of administrative systems and experience of working with IT systems and databases, together with knowledge, understanding and experience of Clinical Audit and Effectiveness.&lt;/p&gt;\n&lt;p&gt;If you believe that you have the skills and attributes we are looking for, we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note: This vacancy may close early once a sufficient amount of applications are received therefore early submission is advisory.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ifeoma Scott-Emuakpor Job title Head of Clinical Audit and Improvemen&lt;/p&gt;\n&lt;p&gt;tEmail address IfeomaScott-Emuakpor@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0208 887 2455&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120622.jpg", "name": "North Middlesex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120622"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Risk &amp; Governance, London", "postalCode": "N18 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6135", "longitude": "-.07424"}}, "title": "Clinical Effectiveness Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254759", "validThrough": "2020-11-17T23:59:59+0000"}