{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-28T15:46:22+0000", "description": "&lt;p&gt;We are excited to offer a Band 6 Charge Nurse, on Robin Ward. Robin Ward is an 18 bedded female in-patient unit caring for service users of adult working age who are experiencing an acute episode of mental illness, and need to be nursed in a 24/7 staffed care environment. Robin Ward admits and cares for service users who are informally admitted and also those detained under the Mental Health Act (1983) – amended 2007.&lt;/p&gt;\n&lt;p&gt;We are passionate about delivering innovative and compassionate care to our service users. There will be opportunities to develop and enhance your clinical skills through supervision, training and access to engage with the wider acute network.&lt;/p&gt;\n&lt;p&gt;The post holder will be working closely with people who use our services, their families, friends, Carers and will make an important contribution to how people experience their care.&lt;/p&gt;\n&lt;p&gt;This is the perfect opportunity for those who are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference to our patients’ health care. The practice is committed to safeguarding and promoting the welfare of vulnerable adults, children, young people and expects all staff to share this commitment.&lt;/p&gt;\n&lt;p&gt;As part of the selection process you will be required to undergo a Disclosure and Barring check. The practice believes in treating everyone with dignity and respect and encourages applications from all sectors of the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Team Manager Racheedah Kurrimbaccus (01923633823)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Robin ward Kingfisher Court, Radlett", "postalCode": "WD7 9HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7047", "longitude": "-.305165"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247247", "validThrough": "2020-11-11T23:59:59+0000"}