{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31500", "minValue": "31500", "unitText": "YEAR", "value": "Starting from £31,500pa DoE"}}, "datePosted": "2020-11-02T16:32:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a confident Band 5 or already a Band 6 who would like to explore a more rewarding clinical challenge in a Child and Adolescent  Mental Health Service?  Are you ready to further develop your clinical skills? We want to recruit an exceptional OT our current Band 6 vacancy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt; (Band 6) Occupational Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for: &lt;/strong&gt;The post holder will be responsible for line managing an Activity Co-ordinator.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt; Highly Specialist OT (Band 7) at Coventry&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 40 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Coventry, CV2 4FN&lt;/p&gt;\n&lt;p&gt;Join our supportive friendly team near the historic city of Coventry and  make an application today by clicking apply.&lt;/p&gt;\n&lt;p&gt;With over 150 OTs in the company, we also work together as a large team providing support to each other across the group, with the opportunity to be part of specialist interest groups &amp; become involved in service development.&lt;/p&gt;\n&lt;p&gt;Cygnet Joyce Parker Hospital is a newly opened CAMHS service.  The service will support young people aged between 12 and 18 with mental health needs in psychiatric intensive care and low secure environments. The aim of the service is to help young people stabilise and return home as soon as possible.  The young people who access our service often have complex mental health needs and may exhibit risk to themselves/and or to others.   We are looking for a therapist who is able to deliver confident occupational therapy input to help these young people to thrive and build a positive future beyond inpatient services.&lt;/p&gt;\n&lt;p&gt;In this role you will assess, implement and develop an OT treatment programme according to service user’s diagnosis and identified needs. This will be based upon findings from assessments including associated risks, in order to develop OT treatment plans accordingly.&lt;br /&gt; Prioritisation skills are key to manage the caseload of clients effectively and you will work closely with the Occupational Therapy and multidisciplinary team onsite.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about people in our services&lt;/li&gt;\n&lt;li&gt;Career pathway progression within the company to support your development and skills&lt;/li&gt;\n&lt;li&gt;National networks of over 150 OTs in the Cygnet Group within different specialisms including Forensic Practice, LD and ASD, Acute mental health, PICU, and inpatient CAMHS&lt;/li&gt;\n&lt;li&gt;Low caseload number to support intensive OT focused interventions&lt;/li&gt;\n&lt;li&gt;You will be part of an exciting brand new service with opportunities to participate in developing this&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Successful Candidate should be/have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered Occupational Therapist with the HCPC (Health Care Professions Council)&lt;/li&gt;\n&lt;li&gt;Experienced in the field of mental health,  or CAMHS environments&lt;/li&gt;\n&lt;li&gt;Currently working as a Band 5 or Band 6 OT  with an ability to manage highly demanding clinical presentations&lt;/li&gt;\n&lt;li&gt;An understanding of Occupational Therapy process/interventions and can take a “hands on” approach&lt;/li&gt;\n&lt;li&gt;Excellent communication and time management skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary starting from £31500&lt;/li&gt;\n&lt;li&gt;Opportunities for CPD and to undertake further learning and development, for example: Leadership and Management, Sensory Integration.&lt;/li&gt;\n&lt;li&gt;Training days provided by highly experienced and renowned OT specialists&lt;/li&gt;\n&lt;li&gt;Expert on site clinical supervision and peer support from a wider group of OTs&lt;/li&gt;\n&lt;li&gt;Bi-monthly OT CPD meetings focused on skill and strategic service development.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS ID Discount Cards &amp; Blue Light Card&lt;/li&gt;\n&lt;li&gt;Free parking &amp; meals on duty&lt;/li&gt;\n&lt;li&gt;Relocation packages offered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt;*Please note - speculative recruitment emails are not to be sent directly to our clinical staff, these need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own*&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry", "postalCode": "CV2 4FN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4096", "longitude": "-1.49177"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252884", "validThrough": "2020-11-27T23:59:59+0000"}