{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28526", "minValue": "28526", "unitText": "YEAR", "value": "£16.97 per hour"}}, "datePosted": "2020-10-30T13:18:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Flow Manager at Salford Royal Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The General Surgery Directorate at Salford Royal are looking for a Band 6 Registered Nurse to work as a Flow Manager within the service. Band 5 Nurses with 3 years’ experience in an acute setting can also apply.&lt;/p&gt;\n&lt;p&gt;Working Monday-Friday, the successful candidate will be supporting the flow of patients in and out of the hospital and there will be no requirementto work weekends or out of hours.&lt;/p&gt;\n&lt;p&gt;Day Rate -&lt;strong&gt;£16.97 per hour &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Purpose of the job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work alongside the clinical and managerial teams within general surgery at the Salford care organisation, managing the flow of elective general surgery, Upper GI, Colorectal, Urology andGynaecology patients though the hospital.&lt;/li&gt;\n&lt;li&gt;Track and facilitate the admission and provision of appropriate post-operative beds for these patients, providing specialist advice to support patient flow across the general surgical wards.&lt;/li&gt;\n&lt;li&gt;Accountable for own professional actions, not directly supervised.&lt;/li&gt;\n&lt;li&gt;Coordinate and manage the delivery of elective patient care and bed flow within the division on a daily basis. With the overall responsibility for the day to day coordination of the elective patients pathways, facilitating flow to support Trust objectives, to improve safety, reduce the length of stay, minimise cancelled operations and delayed discharges.&lt;/li&gt;\n&lt;li&gt;Act as a key communicator in the care of elective general surgery, Upper GI, Colorectal, Urology and Gynaecology patients. This will involve liaising and influencing Consultant colleagues regarding post-operative bed requirements, and the movement of patients between wards where this is absolutely necessary. It will also involve liaising with clinical teams to ensure that delays to discharge are minimised within the General surgical bed stock. To ensure that these patients are followed through their journey and appropriate ongoing discharge planning is promptly commenced to maintain flow&lt;/li&gt;\n&lt;li&gt;The post-holder should be aware of the typical pathways for elective patients in General surgery, Upper GI, Colorectal, Urology and Gynaecology, including their post-operative nursing needs.&lt;/li&gt;\n&lt;li&gt;Work closely with the Consultant and registrar team, Theatres, Emergency Department, Critical Care, and general surgical wards ensuring that the patient is receiving the right treatment at the right time, in the appropriate place, improving patient experience and resulting in timely discharge planning.&lt;/li&gt;\n&lt;li&gt;The post holder will be able to use their own initiative and must have a confident and approachable style.&lt;/li&gt;\n&lt;li&gt;The coordinator will be strongly supported by the senior clinical staff within general surgery and will have a mentor for the first 6 months of the role as a minimum. However the role will work autonomously on a day to day basis, with escalation to Senior Management within the Division where necessary.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SALFORD", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "FLOW MANAGER", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250339", "validThrough": "2020-11-15T23:59:59+0000"}