{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-04T15:01:09+0000", "description": "&lt;p&gt;We are looking to recruit an enthusiastic and motivated clinical psychologist to join our therapies team, providing a psychology service across our adult acute inpatient pathway within the Cavell Centre. The pathway consists of three acute mental health wards (assessment, treatment and recovery wards) and a specialist psychiatric intensive care unit (PICU). Our assessment unit also has a contract with the Ministry of Defence (MOD) to deliver an inpatient service to members of the armed forces.&lt;/p&gt;\n&lt;p&gt;The role will entail providing assessments, formulations, brief psychological interventions and group work to individuals admitted to the wards, as well as offering consultation and training to the multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;The therapeutic work is diverse, providing an excellent opportunity to develop clinical skills working with a range of mental health needs. There are also opportunities to develop your practice in supporting multidisciplinary teams to think psychologically through the delivery of reflective practice and team formulation sessions.&lt;/p&gt;\n&lt;p&gt;Service development and evaluation initiatives are welcomed. Psychological input is valued by the multidisciplinary teams as part of holistic care and you will need to demonstrate creativity and flexibility in delivering a psychology service across four inpatient wards. It will also be essential to build relationships with psychology and other colleagues within the secondary care mental health services to facilitate transition of care from inpatient services to the community.&lt;/p&gt;\n&lt;p&gt;The ideal candidate would have experience of working within secondary care adult mental health services and be adept at building relationships to embed psychological knowledge within the teams. Experience of inpatient services is desirable, but not essential.&lt;/p&gt;\n&lt;p&gt;The post-holder will be supported to deliver the service by a Higher Clinical Assistant Psychologist and will form part of a supportive therapies team, composed of occupational therapists, occupational therapy assistants, a peer support worker and housing officer. They will have access to supervision from a senior psychologist within the trust and be supported by the Directorate Lead for Psychology.&lt;/p&gt;\n&lt;p&gt;In addition, there are opportunities to connect with adult community psychology colleagues through the monthly North Cambridgeshire Psychology Meetings. There are also strong links and regular meetings with the acute adult inpatient psychologists based in Fulbourn Hospital, Cambridge, to share ideas and service development initiatives. Career and continuing professional development will be supported through the identification of learning / training needs via the appraisal process.&lt;/p&gt;\n&lt;p&gt;Here at Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) we are dedicated to providing high quality care with compassion. We deliver many of the NHS services that are provided outside of hospital and in the community such as physical, mental health and specialist services.&lt;/p&gt;\n&lt;p&gt;We are a health and social care organisation, offering a wide range of services, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Integrated physical and mental health services for adults and older people;&lt;/li&gt;\n&lt;li&gt;Specialist mental health and learning disability services;&lt;/li&gt;\n&lt;li&gt;Children and young people’s mental health services;&lt;/li&gt;\n&lt;li&gt;Children’s community services in Peterborough;&lt;/li&gt;\n&lt;li&gt;Social care;&lt;/li&gt;\n&lt;li&gt;Ground-breaking research&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We strongly encourage applications from all sections of the community, particularly from under-represented groups including disabled people and members of our BAME and LGBTQ+ communities. For further information about our positive equality, diversity and Inclusion work, please email edi@cpft.nhs.uk&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;CPFT is looking to build upon its pool of temporary workers with Temporary Staffing Services (TSS). You will be asked at interview if you would be willing to register with TSS. This is an excellent opportunity for those looking to take on additional hours that are flexible around their personal circumstances.&lt;/p&gt;\n&lt;p&gt;If you are successful at interview you will be subject to pre-employment checks, including a DBS (if appropriate) and references to cover 3 years of continuous employment. To ensure a smooth process please bring all identity documents to your interview. A list of required identity documents will be attached to your interview invitation.&lt;/p&gt;\n&lt;p&gt;All communications will be sent to you via TRAC Systems. By applying for this post you are agreeing to CPFT transferring the information contained in this application to TRAC. If you are made an offer, information will also be transferred into the national NHS Electronic Staff Records system.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Charmaine Langton - Modern Matron Treatment, Recovery &amp; Acute Assessment Unit&lt;/p&gt;\n&lt;p&gt;Charmaine.Langton@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or:&lt;/p&gt;\n&lt;p&gt;Deborah Hunt - deborah.hunt@cpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edith Cavell, Peterborough, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256339", "validThrough": "2020-11-18T23:59:59+0000"}