{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-30T07:57:32+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Research and Innovation Marketing and Communications Manager&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Band 6 (£28,050 - £36,644)&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Leeds Teaching Hospitals NHS Trust is one of the leading NHS Trusts in the country for research performance, recruiting over 19,000 patients into studies in 2017/18, hosts multiple NIHR-funded programmes and manages major national research programmes. The Research and Innovation function at Leeds Teaching Hospitals NHS Trust is currently undergoing a period of major transformation to enable us to grow our research portfolio further for the benefit of patients and enable more streamlined management and working practices.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To support our growing internal and external marketing and communications requirements, we are looking to appoint a Marketing and Communications Manager into the Research and Innovation team. The post holder will be responsible for all marketing and communications activity for Research and Innovation. This will include managing websites, social media and other channels for the Research and Innovation department as well as hosted programmes including the NIHR Leeds In Vitro Diagnostic Co-operative, the NIHR Leeds Clinical Research Facility, the NIHR Leeds Biomedical Research Centre and the Northern Pathology Imaging Co-operative.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will need to work closely with other members of the Business Development team on targeted marketing messages as well as with other members of the Research and Innovation team to source high impact news stories and ensure specialist skills and expertise available in the organisation are appropriately communicated to external stakeholders. The post holder will also work closely with the Trust’s Communications team to ensure that Research and Innovation news stories tie into wider communications plans, and to utilise their media contacts to achieve maximum impact.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will need to have a customer-focused approach, a high standard of interpersonal skills, be a self-starter and have an entrepreneurial mindset. They will need to be able to work in a matrix management environment across multiple teams to help deliver the Trust’s ambitious strategic targets for Research and Innovation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is initially for a 3 year fixed term, but with an option to extend further based on successful performance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr. Christopher Herbert, Director of Operations: Research and Innovation&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;christopher.herbert@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;0113 206 0455&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122055.jpg", "name": "Medical Directorate", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Research and Innovation Marketing and Comms Officer (XN06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249325", "validThrough": "2020-11-13T23:59:59+0000"}