{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-21T15:52:59+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Band 8a – &lt;/strong&gt;&lt;strong&gt;Intermediate Care Clinical Lead (Advanced Nurse Practitioner)&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week with some weekends&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a key member of our Intermediate Care Beds service, you’ll provide Clinical Leadership within the Multi-disciplinary Team principally for the nurses within the team and act as a link with those providing the medical cover and pharmacy. Furthermore clinically support and drive the governance of all members of the MDT including the therapists, pharmacists and assistants across both bed bases. Providing the patients occupying one of the 80 flexible beds within the bed bases with medication, supporting the writing of personalized advance care plans and ensuring that DNAR’s are in place which accurately reflect the patient’s wishes.&lt;/p&gt;\n&lt;p&gt;We are looking to expand our Team with an experienced Advanced Nurse Practitioner, with prescribing and advanced clinical skills to enhance our team further. For the right candidate, a development opportunity will be considered.&lt;/p&gt;\n&lt;p&gt;This role provides Clinical Leadership within the Intermediate Care Beds, and provide direct delivery of total episodes of clinical care. To work as an autonomous advanced practitioner within an interdependent, interrelated multi-disciplinary healthcare team.The post holder must be an experienced Advanced Nurse Practitioner who, acting within their professional boundaries, will provide care for the presenting patient, from initial history taking, clinical assessment, diagnosis, treatment and evaluation of care. Leading weekly MDT’s with associated GP’s.&lt;/p&gt;\n&lt;p&gt;They will demonstrate safe, clinical decision-making and expert care, including assessment and diagnostic skills, for those resident in Intermediate Care Beds. The post holder will also be expected to support in an acute environment when required to facilitate discharge and or emergency admissions.&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate critical thinking in the clinical decision – making process. They will work within the Intermediate Care Beds to meet the needs of patients, supporting delivery of policy and procedures, assuring the governance is in line with Locala’ values.&lt;/p&gt;\n&lt;p&gt;In order to work at this level, NMC and Health and Care Professions Council (HCPC) requirements for advanced practice must be met.&lt;/p&gt;\n&lt;p&gt;The Intermediate Beds run a service across &lt;em&gt;seven days a week, from 8am until 7pm&lt;/em&gt; working alongside other &lt;span style=&quot;text-decoration: underline;&quot;&gt;services, including&lt;/span&gt; the third sector, and social care colleagues delivering the care in the bed bases and social workers who support the discharges and ongoing care provision.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting CPD through our robust appraisal system. This is supported and delivered by in-service training, access to external courses and clinical supervision.&lt;/p&gt;\n&lt;p&gt;Locala supports employees to achieve a positive work- life balance and promotes mobile working with colleagues provided with the technology to make it happen.&lt;/p&gt;\n&lt;p&gt;We are situated in the heart of West Yorkshire with easy access to the Pennines, Dales and Peak District, as well as the major cities of Leeds and Manchester.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For more information please contact Kim Varley / Kathryn Ewart Team Leaders or Helen Chauhan Operational Manager&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "WF14 8DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6761", "longitude": "-1.69668"}}, "title": "Intermediate Care Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237169", "validThrough": "2020-11-08T23:59:59+0000"}