{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T13:16:41+0000", "description": "&lt;p&gt;&lt;strong&gt;SENIOR CLINICAL/COUNSELLING PSYCHOLOGIST 8a or Band 7/8a Preceptorship&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Location:&lt;/p&gt;\n&lt;p&gt;1x post based in Knowsley, with travel across the Knowsley and St Helens area&lt;/p&gt;\n&lt;p&gt;1x post based in Warrington, with travel across the Warrington and Halton area&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit two experienced Clinical or Counselling Psychologists, or newly qualified candidates with the commitment and competencies for preceptorship, to join our newly developed community Mental Health Crisis service. This is an exciting opportunity to develop your skills in clinical interventions, multidisciplinary team working and clinical leadership, to support the implementation of psychologically informed practice across our Crisis Resolution and Home Treatment teams.&lt;/p&gt;\n&lt;p&gt;Our new crisis service comprises of three elements; Crisis Response, Crisis Resolution and Home Treatment. The roles are to input clinically to our two Crisis Response and Home Treatment teams, delivering assessments, formulation and direct interventions to service users and families and contributing to care plans, furthermore to support the development of a psychologically informed approach to care via indirect interventions including reflective practice, training, audit and evaluation. Additionally, these roles will provide support and clinical supervision to our Assistant Psychologists, who are an integral part of the Mental Health Crisis pathway.&lt;/p&gt;\n&lt;p&gt;The posts will be a varied, interesting and an exciting opportunity to work within a newly developed service and to support the shape and culture of pathways within. Drive, enthusiasm and commitment to the role will be key, in addition to commitment to work with service users and families in crisis. Competencies in assessment, formulation and intervention, evaluation, supervision and training will also be vital to this role.&lt;/p&gt;\n&lt;p&gt;The successful candidates will work as key members of a strong multidisciplinary team, working closely with other senior professionals including Clinical Leads, Nursing, Psychiatry, Pharmacy and Occupational Therapy. We can offer a strong network of qualified psychologists across the organisation. The successful candidates will make significant links with their peers across inpatient services, liaison mental health and their counterpart in Crisis Resolution and Home Treatment. They will receive clinical supervision from the Principle Clinical Psychologist for Mental Health Crisis, in addition to management supervision within their respective team.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with adults Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure, the cost of which will be deducted from salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Bullen-Foster&lt;/p&gt;\n&lt;p&gt;Claire.Bullen-Foster@nwbh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington &amp; Halton or St Helens &amp; Knowsley, Warrington &amp; Halton or St Helens &amp; Knowsley", "postalCode": "WA2 8WA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4284", "longitude": "-2.60844"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259861", "validThrough": "2020-11-23T23:59:59+0000"}