{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T10:46:23+0000", "description": "&lt;p&gt;We are looking to recruit a Band 6 Radiographer to join our department at the Princess Royal Hospital, in Haywards Heath. This is an exciting opportunity to develop experience of working in a busy CT department.&lt;/p&gt;\n&lt;p&gt;The department prides itself on it&#39;s friendly, close-knit, supportive team and is currently undergoing a significant redevelopment project.&lt;/p&gt;\n&lt;p&gt;Imaging at Princess Royal Hospital consists of 3 DR x-ray rooms, with separate fluoroscopy services. We have recently updated one of our two CT scanners, to a 512 slice, on which we obtain 1-beat cardiac scans. The second 64-slice CT scanner is also being replaced this year. The successful candidate will receive training in CT cardiac and colon procedures, as well as a range of specialist Imaging examinations.&lt;/p&gt;\n&lt;p&gt;As a Band 6 Radiographer you will rotate through CT, plain film, fluoroscopy, mobile and theatre imaging. There is an out of hours/extended working day commitment to provide a 24 hour emergency imaging service.&lt;/p&gt;\n&lt;p&gt;Suitable applicants should be HCPC registered, have post-qualification experience in a similar setting and have a flexible approach to work. As a Band 6 Radiographer, you will be expected to actively partake in the role development of others, working closely with other Radiographers, students and assistant practitioners.&lt;/p&gt;\n&lt;p&gt;The Department is supported by a team of Lead Superintendent Radiographers and Superintendent Radiographers. In return for your commitment to us we will provide ongoing support for your professional development, as well as a friendly, challenging and stimulating work environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jemma Deane&lt;/p&gt;\n&lt;p&gt;Job title Lead Superintendent Radiographer, PRH Imaging&lt;/p&gt;\n&lt;p&gt;Email address jemma.deane@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01444 441881 ext 8326&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal Hospital, Haywards Heath", "postalCode": "RH16 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9912", "longitude": "-.09105"}}, "title": "Senior Rotational Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249779", "validThrough": "2020-11-11T23:59:59+0000"}