{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc"}}, "datePosted": "2020-11-02T16:31:11+0000", "description": "&lt;p&gt;&lt;em&gt;The Royal Marsden Hospital is Europe&#39;s largest Oncology centre with sites in Chelsea and Sutton. The Department of Nuclear Medicine, PET/CT and Radioisotope Therapy is looking for an enthusiastic and well-motivated individual to join their team on a 2 year fixed contract position of Research Technologist. This post will support the Bayer TTC and Xofigo trials running at The Royal Marsden Nuclear Medicine Department but not exclusively. This role will be fundamental to the success of the trials and is required to work collaboratively with the Clinical Trials team. This is a supporting role which will be central to the success of departmental research. The post-holder will support the Nuclear Medicine research team with data management of trials in the Nuclear Medicine research service by providing support with administrative activities required to ensure the smooth running of clinical trials across the Trust. The post-holder will gain experience in all aspects of clinical research but with the main focus on the Bayer Trials. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAna Margarida RuasJob titleRadioisotope Service ManagerTelephone number020 8661 3296&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Nuclear Medicine Research Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252869", "validThrough": "2020-11-16T23:59:59+0000"}