{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-11-05T10:31:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Lung Function Unit at Addenbrooke’s Hospital is situated within a state of the art unit on two separate sites and provides a diagnostic service to most specialities within the hospital. As a Clinical Respiratory Physiologist you will be responsible for undertaking simple and specialist tests of lung function to national and international standards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Appropriate qualifications include the clinical physiology degree or a practitioner/scientist training programme qualification. However, a science-related undergraduate degree will be considered. It would be an advantage to have successfully completed ARTP Parts I&amp;II or the ARTP Practitioner Qualification. Previous experience within a lung function/respiratory physiology laboratory is desirable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These are exciting times for the lung function unit due to ever expanding services and plans for innovative service delivery. Co-location of Royal Papworth Hospital onto the Cambridge Biomedical Campus will undoubtedly bring future benefits with service integration planned. In addition there will be the opportunity for you to be involved in respiratory research which is continually undertaken within the department. We are currently a clinical excellence site for a number of commercial research trials and we are collaborators in a number of academic studies supported by Medical Research Council, Technology Strategies Board and National Institute for Health Research.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy will close on 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held on 27th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Karl SylvesterJob titleHead of Joint Respiratory Physiology ServicesEmail addresskarl.sylvester@nhs.netTelephone number01223 217065&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division C, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Respiratory Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257254", "validThrough": "2020-11-12T23:59:59+0000"}