{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "25000", "unitText": "YEAR", "value": "Circa £25,000 per annum"}}, "datePosted": "2020-10-23T17:31:22+0100", "description": "&lt;p&gt;&lt;strong&gt;Role: Resource Rostering Team Leader, Full –Time 37.5 hours &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Circa £25,000 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Banbury Cross Health Centre, North Oxfordshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in our Rota team at Banbury Cross Health Centre. We are looking for a dynamic, innovative and enthusiastic Resource Rostering Team Leader who is self-motivated, to oversee the rota team.&lt;/p&gt;\n&lt;p&gt;You will manage the team in the co-ordination and scheduling of all BCHC staff rotas for both clinical and non-clinical staff via the Rota Master system, to ensure the smooth and efficient running of the Practice.&lt;/p&gt;\n&lt;p&gt;You will also ensure that available clinics and patient appointments are managed and matched appropriately with the staffing resources available.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be highly organised, assertive, have a great attention to detail, proactive in planning, with strong communication and time management skills.&lt;/p&gt;\n&lt;p&gt;Previous experience of roster planning and working with computerised rota management systems is essential, and experience of working in a healthcare setting is desirable.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Elaine Shurrock atelaine.shurrock@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview :Week Commencing 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Banbury is a historic and expanding market town on the River Cherwell in Oxfordshire and is on the edge of the Cotswolds. Oxford, Stratford upon Avon and Leamington Spa are close by and there are excellent public and private schools in the surrounding area.&lt;/p&gt;\n&lt;p&gt;Banbury Cross Health Centre provides an exciting development in general practice in the north of Oxfordshire. Following the merger of 3 practices in the town, we are continuing the integration of primary care services to ensure the future sustainability of general practice and the delivery of excellent patient services. We are actively involved with our PCN and fully engaged with developing patient-centred services in the community with our local community providers and other stakeholders.&lt;/p&gt;\n&lt;p&gt;With a list size of approximately 40,000 patients and growing, we are a forward thinking and aspirational practice.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130414.JPG", "name": "Principal Medical Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Banbury", "postalCode": "OX16 9PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0578", "longitude": "-1.349"}}, "title": "Resource Rostering Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241450", "validThrough": "2020-11-15T23:59:59+0000"}