{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum (pro rata)"}}, "datePosted": "2020-11-03T10:01:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Medical Workforce Administrator &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Medical Workforce Administrator within our Medical Workforce Department. We are looking for a motivated individual to join our team in providing a comprehensive and high quality Medical HR service to managers and medical staff within the Trust. This is a new post, based at our Trust Headquarters.&lt;/p&gt;\n&lt;p&gt;We have a varied and demanding agenda and are looking for an enthusiastic individual who wants to develop their career within the NHS. This is a challenging and hands-on operational role, which will see you being one of the first points of contact for Medical Staff.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join our team to support the delivery of safe and effective care to our patients by supporting in the administration of Junior Doctor Rotations across a variety of different Hospital sites and specialties. The individual will also provide administrative support on other Medical Workforce projects and initiatives as required.&lt;/p&gt;\n&lt;p&gt;You will possess excellent interpersonal skills and have the proven organisational skills required to work in a fast paced and challenging environment. The individual will need to be comfortable in their ability to communicate with all levels of staff, both verbally in and writing and be resilient, customer focused and flexible.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with strong IT skills who has experience of using a range of IT applications including Microsoft Office products, ESR, TRAC and Allocate systems.&lt;/p&gt;\n&lt;p&gt;It is essential that you are educated to GCSE level or equivalent qualification and / or equivalent previous experience.&lt;/p&gt;\n&lt;p&gt;Some understanding of Medical Workforce issues will be advantageous, however training will be provided to the right candidate who has a willingness to learn and demonstrate an understanding for the role.&lt;/p&gt;\n&lt;p&gt;Please note, only applicants who clearly demonstrate that they meet the essential criteria of the person specification will be considered for interview.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;br /&gt;&lt;br /&gt;Carmel Stevenson, Medical Workforce Advisor &lt;br /&gt;carmel.stevenson@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarmel StevensonJob titleMedical Workforce AdvisorEmail addresscarmel.stevenson@mft.nhs.ukTelephone number0161 291 2626&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust Headquarters, Cobbett House, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Medical Workforce Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253358", "validThrough": "2020-11-10T23:59:59+0000"}