{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T10:32:39+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the recently formed Black Country Pathology Service which began on 1&lt;span&gt;st&lt;/span&gt; October 2018 by the joining together of four Trusts: Sandwell and West Birmingham NHS Trust, The Royal Wolverhampton NHS Trust, Dudley Group NHS Foundation Trust and Walsall NHS Healthcare Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and motivated individuals to participate in the delivery of a single integrated, high quality pathology service to the Trusts and GPs in the area as a hub and spoke model. The BCPS provides comprehensive pathology service to an approximate population of 1.8 million, due for full implementation in 2020.&lt;/p&gt;\n&lt;p&gt;Applications are invited for a suitably qualified, HCPC registered Biomedical Scientist to work in our busy,UKAS accredited, Biochemistry Department. Our forward looking and dynamic department employs modern equipment and automated processes, in a fully integrated blood sciences laboratory, to deliver a quality routine service to the Trust and surrounding GPs. We are a modern laboratory, and our routine biochemistry is performed on Roche Cobas analysers.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an HCPC registered Biomedical Scientist. Experience of working out of hours will be an advantage.&lt;/p&gt;\n&lt;p&gt;If successful you will work in our routine automated sections at the Walsall Manor Hospital site. There will be a requirement to take part in the 24 hour shift working rota over 7 days. This includes evening, weekend, bank holiday and overnight work.&lt;/p&gt;\n&lt;p&gt;The post will be for a basic 37.5 hour week and paid at AfC band 5 (if essential requirements are fulfilled&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Nazir AhmedJob titleHead Biomedical ScientistEmail addressnazir.ahmed1@nhs.netTelephone number01922 656782Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Helen Ashby&lt;/p&gt;\n&lt;p&gt;Clinical Lead for Biochemistry&lt;/p&gt;\n&lt;p&gt;01384 244078&lt;/p&gt;\n&lt;p&gt;helen.ashby@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall Manor Hospital, Walsall", "postalCode": "WS2 9PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5822", "longitude": "-1.99918"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251617", "validThrough": "2020-11-16T23:59:59+0000"}