{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26520", "minValue": "26520", "unitText": "YEAR", "value": "Up to £26,520 per annum - DOE"}}, "datePosted": "2020-10-23T03:21:53+0100", "description": "&lt;h2&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the healthcare team&#39;s pharmacy service e.g. ACT course.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h1&gt;Want to know more about HMP Dovegate?&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP Dovegate is a Category B male resettlement prison in Staffordshire. It currently houses approximately 1150 prisoners both sentenced and remand. The prison also includes a separate 200-bed Therapeutic Community for repeat serious offenders. The unit, the only privately-run one in the UK and the only purpose-built therapeutic facility, offers its residents daily group therapy, which lasts between 18 months and 24 months. There is an 11 bed inpatient unit. The prison is privately operated by Serco.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;About the role...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;As our Pharmacy Technician, you&#39;ll support the delivery of Pharmacy Services which will be part be of a comprehensive healthcare package, based on the prison service’s needs. Working on the prison wings, you can expect to be involved in everything from medicine management, dispense medications, screening drug charts, patient counselling etc.&lt;br /&gt;&lt;br /&gt;You may be required to accept certain activities in relation to the day to day operational management of their unit and as such must ensure that they are trained and competent to take on these additional responsibilities. As a Pharmacy Technician you may also be required to take on a role of working across multiple Pharmacy Services if and when required.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and have current registration with the General Pharmaceutical Council (GPhC) to be considered for this role. You will also have relevant post-qualification experience working within a pharmacy environment and multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;You’ll be able to demonstrate assessment skills, including undertaking of risk assessments and have sound patient counselling skills, treating patients with respect and dignity at all times, adopting a culturally sensitive approach.&lt;br /&gt;&lt;br /&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Receive an annual salary of up to £26,520 FTE - dependent on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;Other benefits include cycle to work scheme, childcare vouchers plus training and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Dovegate include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;Amelia will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;For further information please contact us on the details provided.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;This is a full-time role working 37.5 hours per week across Monday to Friday and our Pharmacy is open between 08:00 – 18:00. If you have any specific requirements please let us know and we can review if there is any flexibility possible. The salary for this role is up to £26,520, dependent on experience.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Uttoxeter", "postalCode": "ST14 8XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8708", "longitude": "-1.78227"}}, "title": "Pharmacy Technician - HMP Dovegate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239618", "validThrough": "2020-11-10T23:59:59+0000"}