{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-26T16:16:04+0000", "description": "&lt;p&gt;If you relish a challenge, have a passion to help others or simply fancy a fresh start, St Mary&#39;s Pharmaceutical Unit (SMPU) has all the right ingredients. We are looking for an enthusiastic pharmacy technician to join our team. Are you working towards your ACPT or recently qualified, you may not have started your career in a technical services role but we will offer full training to the right candidate and welcome interest for all backgrounds.&lt;/p&gt;\n&lt;p&gt;We are an aseptic production unit offering a wide and varied service to both internal and external customers including TPN, cytotoxic and clinical trial products.&lt;/p&gt;\n&lt;p&gt;The post will rotate with the other technicians to support the day to day coordination of production activities ensuring appropriate technical and support staff mix. We will help develop you to gain experience in the scheduling of chemotherapy, working within a quality system, investigating errors, supporting audits, self inspections and risk assessments.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic, self motivated, organised with good communication skills and an eye for detail and would like to join a friendly forward thinking team then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;If you think this could be the role for you, please contact Caroline Davies (029 2048123) for further information and to arrange a visit to the department to meet the team.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caroline Davies - Senior Technician Aseptic Services&lt;/p&gt;\n&lt;p&gt;caroline.davies7@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;029 2048123&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SMPU, Cardiff", "postalCode": "CF14 4HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-3.19469"}}, "title": "Pharmacy Technician Aseptic Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243342", "validThrough": "2020-11-09T23:59:59+0000"}