{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-27T10:30:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title - Clinical Systems Lead Trainer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base - Edward Jenner Court, Brockworth&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £31,365 to £37,890 per annum (Band 6)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week - 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for an exciting, varied and challenging job? Do you have experience of Clinical Systems training with management skills &amp; a keen knowledge or interest in clinical processes?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an enthusiastic, confident and highly motivated individual to lead our team of Clinical Systems trainers. The key responsibilities of this role are to develop training packages to a high standard and coordinate the delivery of effective training to promote consistent and robust system use by all staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Systems trainers deliver training to an excellent standard and are responsible for developing and maintaining effective training materials. Training is usually delivered in classroom, small group, and 1-1 settings, however in current times we have adapted to use technologies such as Microsoft Teams video recordings &amp; e-learning packages to provide training safely.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical System trainers are part of the friendly dynamic Clinical Systems Team which is responsible for the overall delivery, management and development of the Trusts main Clinical Systems RiO, SystmOne, IAPTus, Lilie and SoelHealth There is ample opportunity to work with different people in the team across a variety of projects. We continually striving to improve our service to the users of our clinical systems in both Physical and Mental Health services and aim to support staff to perform their roles more effectively and ultimately improve patient care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have leadership, training experience, excellent IT, communication and organisational skills, immaculate attention to detail, you are a quick learner, enjoy working independently and as part of a team, we would welcome your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will be required to work flexibly between the hours of 8am and 5.30pm.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Sue Jefferson, Clinical Systems Training, Deployment and Support Lead, at sue.jefferson@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL3 4AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8471", "longitude": "-2.17646"}}, "title": "Clinical Systems Lead Trainer - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243999", "validThrough": "2020-11-16T23:59:59+0000"}