{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum, inc HCA"}}, "datePosted": "2020-11-03T17:30:32+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust is one of the UK’s largest and busiest teaching hospitals with over 1.5 million patient contacts a year and more than 13,000 staff based across five main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DETAILS / SUMMARY OF JOB&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a qualified and experienced ACCP to join our service. This advanced role will provide expert clinical care to patients requiring level 1-3 care both inside and outside our critical care units. King’s has an existing ACCP cadre of 11 practitioners drawn from nursing, paramedicine and physiotherapy who provide 24/7 support across the full range of critical care activity on the Denmark Hill site. Our services include critical care for neurosciences, cardiac, liver, haematology and major trauma as well as a wide range of medical and surgical specialties.&lt;/p&gt;\n&lt;p&gt;Advanced Critical Care Practitioners will work as part of a consultant lead multi-professional critical care service at King’s. They will be responsible on a day-to-day basis to the on call consultant intensivist responsible for the patient.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years), therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975, and as such, it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Dr Tom Hurst&lt;/p&gt;\n&lt;p&gt;Job title ICU Consultant&lt;/p&gt;\n&lt;p&gt;Email address tom.hurst@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Advanced Critical Care Practitioner (ACCP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254927", "validThrough": "2020-11-29T23:59:59+0000"}