{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T11:27:19+0000", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Are you someone looking to start a nursing career in one of the UK’s most respected mental health trusts?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Would you like to be part of a dedicated team committed to those with mental health problems enjoy a better future?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Would you like to do a job that makes a difference every day?&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Relocation package up to £8,000&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We think our Preceptorship Programme is unique, from the way we recruit, the&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;benefits we offer, the comprehensive induction in to our organisation, to the support and financial benefits you will receive, plus you will be living in one of the most unique areas in the country. Our wide range of mental health and learning disability services cover the whole of Devon, with opportunities in our community and inpatient settings.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fantastic opportunities have arisen for enthusiastic and dedicated, newly qualified Registered Mental Health Nurses (RMN) or Registered Learning Disability Nurses (RLDN) to undertake a 12 month preceptorship programme at one of the UK’s most respected providers of mental health &amp; learning disability services.&lt;/p&gt;\n&lt;p&gt;The Trust is looking to recruit in the Secure Directorate at Langdon Hospital which is located in Dawlish and provides forensic mental health services for the South West region.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;£24,907 - £30,615 per annum pro rata (Band 5)&lt;/p&gt;\n&lt;p&gt;This is your opportunity to be part of something exciting!&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The successful candidates will have excellent communication skills, commitment to working flexibly, be patient centric and demonstrate a commitment to further development with the support of the team and Trust.&lt;/p&gt;\n&lt;p&gt;The preceptorship programme is designed for new graduates supporting them through the transition from student to qualified practitioner. It is also suitable for returning to work nursing professionals. During this time, the staff member will be supported by an experienced practitioner (a preceptor), to develop their confidence as an independent professional, and to refine their skills, values and behaviours. The programme includes six study days covering a range of topics and a comprehensive preceptorship handbook to support development in practice.&lt;/p&gt;\n&lt;p&gt;In addition to this, the programme encompasses portfolio building, networking with your peers and aims to educate and stimulate discussion. It provides a foundation for lifelong learning and allows nurses to provide effective patient-centred care confidently.&lt;/p&gt;\n&lt;p&gt;At the end of the 12 month programme, the preceptee (you) will become a full time, substantive RMN or RLDN staff nurse and will increase an increment within the Band 5 pay grade.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;The location&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Langdon Hospital is home to Devon Partnership NHS Trust&#39;s forensic mental health service and is set in 111 acres of Devon Countryside with spectacular views of the sea. Our campus-style hospital site includes the recently opened&lt;/p&gt;\n&lt;p&gt;Dewnans Centre, a £27 million state-of-the-art ‘medium&lt;/p&gt;\n&lt;p&gt;secure’ unit, as well as a number of ‘low secure’ and open wards. We are proud to be rated as an &quot;Outstanding&quot; service by The CQC.&lt;/p&gt;\n&lt;p&gt;Our site offers free parking, a patient-led café and on-site gym and spectacular views across the Dawlish coast and countryside.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;h1&gt;Our offer to you&lt;/h1&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive.If you are looking to relocate to the fabulous county of Devon we have a relocation package that may be suitable for you.&lt;/p&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly facilitated Continuing Professional Development (CPD) workshops for the first seven months&lt;/li&gt;\n&lt;li&gt;Weekly group supervision&lt;/li&gt;\n&lt;li&gt;A dedicated Preceptorship Lead&lt;/li&gt;\n&lt;li&gt;£1,000 CPD voucher on completion of the Preceptorship Programme&lt;/li&gt;\n&lt;li&gt;A relocation package of up to £8,000.&lt;/li&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Free onsite car parking, gym and café&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;li&gt;Access and attendance to the Nursing Forum&lt;/li&gt;\n&lt;li&gt;Refer a friend scheme applies – both earn up to £500 See attached t&amp;cs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Preceptee Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251774", "validThrough": "2020-11-30T23:59:59+0000"}