{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-26T15:47:12+0000", "description": "&lt;p&gt;Would you like the opportunity to support the Physiotherapy Team and develop you skills in a supportive environment? Are you able to work well within a team as well as independently? We are looking for enthusiastic and flexible team players with a calm, professional manner.&lt;/p&gt;\n&lt;p&gt;These posts will be mainly based at Warwick Hospital, although you may be required to cover our service at other SWFT sites. We are looking for caring, well-motivated and flexible individuals with excellent communication skills to join our team. The service covers 7 days a week.&lt;/p&gt;\n&lt;p&gt;The post incorporates a wide range of support duties; housekeeping; maintaining a clean and tidy environment, maintenance of equipment, basic administration, data inputting, as well as direct patient care; assisting the Physiotherapists and other team members with the treatment of patients, assisting patients with their mobility and exercises.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible and adaptable as you will work mainly in the ward environment and will gain experience within and support each of our teams (Medical, Surgical and Orthopaedics)&lt;/p&gt;\n&lt;p&gt;Continued Professional Development needs are supported through individual learning plans and you will work towards gaining the Care Certificate within the first few months within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel HickmanJob titleLead Advanced Orthopaedic PhysiotherapistEmail addressRachel.hickman@swft.nhs.ukTelephone number01926 495321 ext 8317&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bank Physiotherapy G23910, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Physiotherapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243235", "validThrough": "2020-11-09T23:59:59+0000"}