{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T13:46:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a fresh challenge that will really put your statistical skills to the test?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHSBSA creates a wealth of valuable data from the £36 billion of NHS activity that it administers. Publishing effectively is a crucial part of our vision of being a Catalyst for Better Health. By utilising our expertise we can better tell the story of our data and inform debate.&lt;/p&gt;\n&lt;p&gt;The post holder will be a member of our Data and Insight directorate and will be responsible for multiple aspects of our statistical publication production process, including developing several Official and National Statistical publications for the organisation. They will utilise their expertise to extract and transform data, apply statistical analysis, producing insightful statistical publications in a layered dissemination approach. Creating products to inform the public and further help citizens to compare, contrast and challenge to benefit the wider Health Service and increase efficiency.&lt;/p&gt;\n&lt;p&gt;The role will be based in Newcastle, and we support home working. Currently we are working from home.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Selection process &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please ensure you reflect on the requirements in the job description and personal specification, including essential and desirable skills.&lt;/p&gt;\n&lt;p&gt;On the advert closing an initial sift will take place against the job description and personal specification. Candidates who pass this initial sift will invited to complete the Government Statistical Service (GSS) online multiple choice test. To facilitate this part of the application process candidates&#39; name and email address will be shared securely with the Office for National Statistics to administer the test.&lt;/p&gt;\n&lt;p&gt;Please note: If you are already a member of the Government Statistical Group (GSG), you are exempt from sitting the GSS online test. We will advise candidates who pass the initial sift and who proceed to the online test how they can advise us on this specifically.&lt;/p&gt;\n&lt;p&gt;Should you be invited to interview, you will be assessed against the job description and personal specification, including essential and desirable skills. In addition, we will also assess you against Level 2 of the following Government Statistician Group (GSG) technical competency framework, specially you will be assessed on the following GSG Technical Competencies:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Presenting and Disseminating Data Effectively.&lt;/li&gt;\n&lt;li&gt;Acquiring Data/Understanding Customer Needs.&lt;/li&gt;\n&lt;li&gt;Data Analysis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This framework is used to assess the technical skills of government statisticians and data scientists who belong to the Government Statistician Group (GSG).&lt;/p&gt;\n&lt;p&gt;All GSG statisticians and data scientists are assessed against this when they enter the profession.&lt;/p&gt;\n&lt;p&gt;You can download the full framework (pdf, 0.29MB) or the specific section relevant for this grade, framework for Higher and Senior Statistical Officers and Data Scientists (pdf, 0.13MB)&lt;/p&gt;\n&lt;p&gt;You can also download the following document that outlines the statistical tools and techniques (pdf, 0.39MB) mentioned in the framework.&lt;br /&gt;&lt;br /&gt;A presentation test may be required as part of the interview process. Further information will be provided to successful candidates prior to interview if necessary.&lt;br /&gt;&lt;br /&gt;Currently all interviews are being conducted by Video Conference.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Michael Cole&lt;/p&gt;\n&lt;p&gt;michael.cole5@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle Upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Senior Statistical Officer (SStO)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248533", "validThrough": "2020-11-19T23:59:59+0000"}