{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "3685600", "minValue": "3685600", "unitText": "YEAR", "value": "up to £36,856,00 per annum DOE"}}, "datePosted": "2020-10-23T14:46:54+0100", "description": "&lt;h1&gt;&lt;strong&gt;I treat more than just symptoms&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;br /&gt;&lt;br /&gt;HMP Brixton is a Local prison holding male adults ages 21 and over located in Lambeth&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Interested in clinical/clerical development?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS/ALS (intermediate life support and advanced life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Receive an annual salary of up to £36,856.00 depending on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;Other benefits include cycle to work scheme, plus training and clinical development opportunities.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Staff Nurse (RGN/ RMN) you will be an integral part of the healthcare team and will be involved in everything from clinical triage to the evaluation of patient care and standards. You’ll carry out – and potentially develop – nurse led clinics, reviewing patient’s histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;br /&gt;&lt;br /&gt;You will also be working as part of a larger multi-disciplinary team, alongside the substance misuse and mental health teams. You will have an interest in Substance Misuse and have had some exposure to this environment.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Brixton if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. Part-time applications are also welcome.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/em&gt;&lt;br /&gt;&lt;br /&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW2 5XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.452", "longitude": "-.124685"}}, "title": "Staff Nurse (Primary Care) - HMP Brixton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241002", "validThrough": "2020-11-06T23:59:59+0000"}