{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "11767", "minValue": "11767", "unitText": "YEAR", "value": "Band 6/7 dependent on experience"}}, "datePosted": "2020-11-06T12:58:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Infection Prevention &amp; Control Lead Nurse| Ward | Band 6/7 dependent on experience | Wirral | Full Time, No Nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Wirral Hospital has an opportunity for an Infection Prevention Control Nurse to join our experienced and dynamic team. This is an exciting role supporting all infection prevention and control processes within the Hospital.&lt;/p&gt;\n&lt;p&gt;Spire Murrayfield Hospital is a state-of-the-art private hospital. We offer fast access to consultations with specialists in a wide range of treatments, supported by advanced imaging and diagnostic technology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to the Director of Clinical Services, you will be responsible for the co-ordination and development of a quality infection prevention and control service at Murrayfield Wirral Hospital providing leadership, support and guidance to all staff and ensuring a patient focussed service.&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate a high level of autonomy to challenge inappropriate practice and must demonstrate clinical decision-making to assist in containing and reducing the incidence of infection through risk assessment, surveillance, audit, intervention and education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Knowledge, training and experience required&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First level registered nurse with degree level or equivalent experience&lt;/li&gt;\n&lt;li&gt;Post Graduate Certificate in Infection Control Nursing or equivalent or have achieved IPS infection control competencies.&lt;/li&gt;\n&lt;li&gt;Skills and expertise to communicate this knowledge to support delivery of the Infection Control Work Plan&lt;/li&gt;\n&lt;li&gt;Interpersonal skills including negotiation, influencing and persuading, facilitating, conflict resolution and the ability to form positive working relations&lt;/li&gt;\n&lt;li&gt;Confidence to deliver training and instruction to staff through forums and individual training&lt;/li&gt;\n&lt;li&gt;Strong presentation skills and ability to express a view convincingly and coherently, verbally and in writing&lt;/li&gt;\n&lt;li&gt;Self-motivation&lt;/li&gt;\n&lt;li&gt;High degree of accuracy, with a methodical approach to work-load&lt;/li&gt;\n&lt;li&gt;Ability to work autonomously and as a part of a team&lt;/li&gt;\n&lt;li&gt;Ability to manage and meet deadlines&lt;/li&gt;\n&lt;li&gt;Experience with a range of computer software packages including: Word processing, spreadsheets, presentation software, databases, e-mail systems internet and intranet&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/li&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Usman Masood on Usman.Masood@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral", "postalCode": "CH61 1AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3493", "longitude": "-3.08008"}}, "title": "Infection Prevention &amp; Control Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259770", "validThrough": "2020-12-06T23:59:59+0000"}