{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T15:32:33+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;General Medicine&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At UHNM (University Hospital of North Midlands) our success starts with you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want you to come to UHNM, and stay at UHNM; all of our staff have been involved in developing our values.&lt;/p&gt;\n&lt;p&gt;We believe that UHNM is a better place for patients and staff alike. This is an exciting opportunity to join one of the largest Trusts in the UK with an international reputation and a tradition of innovation.&lt;/p&gt;\n&lt;p&gt;Based in the busy North of Staffordshire, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites. Our size and resources enable us to offer a range of attractive benefits as well as unparalleled education and development opportunities for staff at all levels. This includes an extensive portfolio of academic and clinical courses and programmes ranging from on-going personal development through to clinical excellence and leadership skills. UHNM prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We are currently looking for Band 5 staff nurses to join our team in General medicine on ward 126 . Ward 126 is a 32 bedded ward. We provide care for patients with a range of medical conditions specialising in Diabetes &amp; Endocrinology. On both wards our aim is to deliver high quality nursing care based on current evidence in a fast paced, dynamic environment. We work closely with our medical colleagues and MDT in order to meet the increasing demands of the service while retaining our commitment to patient centred, compassionate care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt; We are looking for highly motivated, energetic individuals to join our friendly nursing team. You will have an interest in General medicine and a commitment to providing safe, effective care to a diverse patient population. You will be a confident time manager with the ability to prioritise the clinical needs of unwell patients. We are committed to staff development and will support you in developing your care skills. The post involves a rotational shift pattern of long days, nights, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt; The UHNM trust is made up of two sites: Royal Stoke and County Hospital – and we’ve got exciting expansion plans. Offering cutting-edge healthcare, our exceptional team of medical professionals have educated and stimulated their colleagues to go even further in their careers. That’s why we’re so inspiring to work for – because every day offers the chance to become the very best you can be. We are able to offer a range of attractive benefits and unparalleled education and development opportunities for staff at all levels. This includes an extensive portfolio of courses and programmes ranging from personal development through to clinical excellence and leadership skills.&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff free independent and confidential support for all staff, large retail discounts and cycle to work schemes to name a few.&lt;/p&gt;\n&lt;p&gt;This vacancy may close before the current listed closing date. You are advised not to delay submitting your completed application.&lt;/p&gt;\n&lt;p&gt;Please note that all correspondence regarding your application will be via email. The emails will be sent to you via TRAC.jobs and not via NHS Jobs, we encourage you to check your inbox regularly.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmily JohnsonJob titleSenior SisterTelephone number01782 671449&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke, Stoke  on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Staff Nurse - Medicine Division", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252648", "validThrough": "2020-11-16T23:59:59+0000"}