{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T15:15:49+0000", "description": "&lt;p&gt;There is an exciting opportunity for a Band 5 Respiratory Physiotherapist with a special interest in Respiratory, to join the current Mid Nottinghamshire Respiratory Service to plan, prepare and support the delivery of Pulmonary Rehabilitation programmes. This role will be based in the Newark and Sherwood area of Mid Notts and will be able to gain experience working closely with specialised colleagues from the Home Oxygen Service and Specialist Community Respiratory Nurses.&lt;/p&gt;\n&lt;p&gt;The Mid Notts Respiratory Service is a community based team, which provides holistic and multidisciplinary evidence based support for respiratory patients within the Mid Notts area. This service includes Specialist Community Respiratory Nurses, the Home Oxygen Service and Pulmonary Rehabilitation. Working in partnership with other community teams, primary care and close support from Respiratory Consultants in secondary care. We aim to improve quality of life and promote self-management for respiratory patients through comprehensive holistic interventions.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Ian Griffiths - Team Leader, Mid Notts Respiratory Service on 07971107421&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alternative Contact - Christopher Sawford - Specialist Respiratory Physiotherapist - 07811737824.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newark Health Centre, Newark", "postalCode": "NG24 4XG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0738", "longitude": "-.811953"}}, "title": "Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247152", "validThrough": "2020-11-08T23:59:59+0000"}