{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-10-22T20:30:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Barts Health NHS Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Royal London Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children Services / Women’s Health Clinical Academic Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow (ST 6-8) in Paediatric Cystic Fibrosis&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for a 12 month post to start in November 2020 as Senior Clinical Fellow or SpR to join the tertiary Paediatric Respiratory Team at the Royal London Children’s Hospital. The hospital is based in Whitechapel, East London – an area with a rich history and a culturally diverse community. The hospital recently celebrated its 280th birthday – and Barts Hospital (also part of Barts Health Trust), founded in 1123, is the oldest working hospital in the UK.&lt;/p&gt;\n&lt;p&gt;The post will be based at The Royal London Hospital which provides one of the largest acute paediatric and paediatric trauma services in London, with over 110 paediatric, neonatal, surgical and medical beds. The hospital is tertiary referral centre for paediatric medical specialities (allergy, endocrinology, gastroenterology, haematology, neurology, oncology and respiratory medicine), surgical specialities and provides the Regional Neonatal Unit with neonatal surgery and the regional Neonatal Transport Service (NTS).&lt;/p&gt;\n&lt;p&gt;This vibrant, driven and cohesive paediatric respiratory team comprises 4 NHS consultants and 1 academic professor, 1 Senior Fellow for sleep and ventilation, 1 CF Fellow (this post), 1-2 respiratory research fellows, 2 respiratory SpRs (1 grid and one with a respiratory interest) and 2 SHOs. There are also a number of specialist nurses: 3 CF, 3 respiratory, 3 sleep/NIV, and 1 immunology clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt;In addition, there is a specialist paediatric CF multidisciplinary team comprising 2 respiratory Physiotherapists, 2 Dietitians, 2 Psychologists, a CF Pharmacist and CF database administrator. There is a Children’s Respiratory Physiology team offering full lung function including LCI and sleep studies (cardiorespiratory and polysomnography). We have a dedicated CF Clinical Trials Nurse and MCRN Clinical trials Unit facilitating access to studies including novel CFTR modulator therapies and the post holder will be expected to be involved in these.&lt;/p&gt;\n&lt;p&gt;The paediatric respiratory laboratory comprises 5 physiologists providing support for an expanding sleep and non-invasive ventilation service with full polysomnography as well as providing lung function and allergy testing for inpatients and outpatients. The team is supported by a respiratory ward complete with negative pressure rooms and en-suite facilities which accepts HDU and tracheostomy patients, parapneumonic effusions and acute severe asthma – as well as admissions for CF and bronchiectasis. There is also a level 2 critical care unit and a day care unit which performs sweat tests, supports the newborn screening diagnostic pathway and facilitates a dedicated monthly bronchoscopy list.&lt;/p&gt;\n&lt;p&gt;The Children’s CF service is the hub for a shared care network serving 120-140 patients, providing outreach clinics at Colchester and Romford. The service maintains excellent outcomes as evidenced by the national CF Registry patient care metrics.&lt;/p&gt;\n&lt;p&gt;Individuals will require full GMC Registration and will hold MRCPCH or equivalent. Previous subspecialty experience in respiratory paediatrics and the care of children with CF / bronchiectasis would be desirable. These posts are aimed at senior trainee paediatricians at ST5+ and would suit someone with an existing respiratory interest looking to gain a grounding in paediatric cystic fibrosis or respiratory medicine, or to consolidate their existing knowledge. Overseas candidates are particularly welcome and less experienced candidates will be considered.&lt;/p&gt;\n&lt;p&gt;The successful applicant would support the CF service during working hours and does not have any out of hours on call commitment. They would be responsible for inpatient and outpatient CF management and coordinate admissions, annual reviews, national database data collection, and would also be expected to lead on departmental audit and quality improvement projects. Part of the role would also ensure that protocols are up to date, and the successful candidate would work to develop the service through the use of information technology to streamline processes where possible.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The trainee will be encouraged to participate in teaching (informally or as part of the MRCPCH training program, general paediatric teaching programme and respiratory teaching programme / journal club). The department is actively engaged in internal and external CF and non-CF research, and team members are regularly invited to speak at local and international conferences. Previous trainees have presented abstracts at international conferences and had papers published in peer reviewed journals. Trainees will be expected to attend the Lung in Childhood seminar series at the Institute of Child Health. Other appropriate study leave will be supported. In line with our commitment to improving the working lives of our junior doctors, the duties and hours are fully compliant with the New Deal initiative.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact:&lt;/p&gt;\n&lt;p&gt;Dr Caroline Pao, Consultant Respiratory Paediatrician and Children’s CF Centre Director. carolinepao@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Chinedu Nwokoro, Consultant Respiratory Paediatrician and Honorary Clinical Senior Lecturer, Clinical Lead for Asthma and Chronic Lung Disease. cnwokoro@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Sarah Brown, Consultant Respiratory Paediatrician and Honorary Clinical Senior Lecturer, Clinical Lead for bronchiectasis / PCD and complex needs. sarah.brown130@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Surendran Thavagnanam, Consultant Respiratory Paediatrician and Clinical Lead for Sleep and Non-Invasive Ventilati&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Senior Clinical Fellow (ST 6-8) in Paediatric Cystic Fibrosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239594", "validThrough": "2020-11-22T23:59:59+0000"}