{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T11:31:28+0000", "description": "&lt;p&gt;We are currently looking to recruit a Band 6 Specialist Speech and Language Therapist to join our dynamic and enthusiastic Paediatric team as part of our service with A Better Start Southend.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit the correct candidate for a part time (22.5 hours per week) post within our well established team providing universal and preventative services to the six A Better Start Southend target wards.&lt;/p&gt;\n&lt;p&gt;You will be based at Thamesgate House in Southend three days per week.&lt;/p&gt;\n&lt;p&gt;This post has been created to provide expereince of a universal health promotion and prevention service delivery model across the six most disadvantaged wards in Southend.&lt;/p&gt;\n&lt;p&gt;You will be working alongside other qualified and unqualified staff to deliver and support the universal provision of services available through a suite of programmes provided in partnership with the Early Years Alliance in Southend. We have excellent links with other professionals within the health service and education and robust clinical supervision and support networks in place.&lt;/p&gt;\n&lt;p&gt;This post is ideal for an established community SLT or a therapist looking for their first Band 6 post after at least 18 months experience and transition from the RCSLT graduate register.&lt;/p&gt;\n&lt;p&gt;Please contact the service if you would like to ask any questions or visit prior to considering an application.&lt;/p&gt;\n&lt;p&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Benefits:&lt;br /&gt;• Season Ticket Loans&lt;br /&gt;• NHS discounts for staff&lt;br /&gt;• Excellent Training facilities and opportunities&lt;br /&gt;• The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;br /&gt;• Salary Sacrifice schemes including lease cars and Cycle to Work&lt;br /&gt;• Buying and Selling annual leave scheme&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne PageJob titlePrincipal Speech and Language TherapistEmail addressjoannepage@nhs.netTelephone number07814377561Additional contact information&lt;/p&gt;\n&lt;p&gt;Joanne Page 07814377561&lt;/p&gt;\n&lt;p&gt;joannepage@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thamesgate House, Southend", "postalCode": "SS2 6BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5435", "longitude": ".70868"}}, "title": "Specialist Speech and Language Therapist (A Better Start)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253735", "validThrough": "2020-11-17T23:59:59+0000"}