{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T12:46:04+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced paediatric Dietitian to join our team based at the Children&#39;s Hospital for Wales at Cardiff and the Vale UHB.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide tertiary level care for children and young people with Cystic Fibrosis. Although based in Cardiff you will be expected to work along with the specialist MDT and the CF Network clinics across South Wales.&lt;/p&gt;\n&lt;p&gt;We are looking for self motivated, confident individual to lead the Cystic Fibrosis dietetic service and a strong team player to work alongside the specialist MDT as well as the wider Nutrition and Dietetic Team.&lt;/p&gt;\n&lt;p&gt;This post will also manage an inpatient caseload on the medical and surgical wards in the Children’s Hospital for Wales. The successful candidate will be expected to participate in the on call rota to support continuity of services over weekends and Public Holidays.&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to demonstrate leadership, advanced clinical decision making, problem solving and communication skills. Excellent organisational skills will be required to succeed in this dynamic role. Experience of quality improvement methodology will be valuable to help drive service development and improvement.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale UHB is unique in being both a teaching Health Board and providing Adult and Paediatric Tertiary, Specialist, General, Acute, Mental health and Community services. The department has an excellent clerical support team and robust IT hardware and software, actively supporting professional development and clinical supervision for all staff.&lt;/p&gt;\n&lt;p&gt;The department is committed to the training of pre-registration Student Dietitians and the post holder will also be required to take part in student training.&lt;br /&gt;&lt;br /&gt;The successful candidate will be able to demonstrate that they share our organisational values:&lt;/p&gt;\n&lt;p&gt;- We care about the people we serve and the people we work with&lt;br /&gt;- We trust one another&lt;br /&gt;- We respect each other&lt;/p&gt;\n&lt;p&gt;- We take personal responsibility&lt;br /&gt;- We treat people with kindness&lt;br /&gt;- We act with integrity&lt;/p&gt;\n&lt;p&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed for both full-time and part-time hours.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Mott - Paediatric Dietitian&lt;/p&gt;\n&lt;p&gt;claire.mott@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;029 2184 4294&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Childrens Hospital for Wales, Cardiff", "postalCode": "CF14 3UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.499", "longitude": "-3.19007"}}, "title": "Paediatric Cystic Fibrosis Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248365", "validThrough": "2020-11-12T23:59:59+0000"}