{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-04T09:15:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Speech &amp; Language Therapist (Paediatric) – Band 5 – Community – 37.5 hours per week – Fixed term positions available &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Foundation Trust to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to maternity leave, our community team has vacancies for full or part time sessions across Suffolk.&lt;/p&gt;\n&lt;p&gt;The post holder will provide assessment and therapy to children attending mainstream schools and clinics across Suffolk.&lt;/p&gt;\n&lt;p&gt;Do you want tocarry out therapy with children?&lt;/p&gt;\n&lt;p&gt;Do you want to work in an innovative team?&lt;/p&gt;\n&lt;p&gt;Do you want to work for a service that has been successful with additional funds?&lt;/p&gt;\n&lt;p&gt;Do you like cake?!&lt;/p&gt;\n&lt;p&gt;If the answer to all of the above is yes (we do have biscuits if you don’t like cake!)- Then come and join us in Suffolk.&lt;/p&gt;\n&lt;p&gt;These posts would be suitable for new graduates as we offer extensive support to enable you to develop your skills towards an autonomous clinician and achieve your RCSLT competencies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Here is what 3 of our current NQP B5 therapists working with us say:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“You feel part of a team immediately, even when you are communicating with members of the team mainly through video/mobile due to COVID-19.&lt;/p&gt;\n&lt;p&gt;Great support from all members of the team. Everyone has offered their help and advice- even across different areas.&lt;/p&gt;\n&lt;p&gt;Lots of shadowing opportunities for new methods of working e.g. Video therapy&lt;/p&gt;\n&lt;p&gt;I really appreciate the support of my mentor and supervisor, all my concerns and questions have been answered promptly and have been extremely encouraging&lt;/p&gt;\n&lt;p&gt;I really appreciate that I am in control of deciding whether to see children face to face or virtually depending on how comfortable I feel due to COVID-19&lt;/p&gt;\n&lt;p&gt;I feel that I am encouraged to explore new learning opportunities&lt;/p&gt;\n&lt;p&gt;I feel that you are part of a team that genuinely cares for their colleagues and enjoys celebrating individual and group achievements, which is really appreciated especially during COVID-19.&lt;/p&gt;\n&lt;p&gt;I am grateful for the amount of newly qualified supervision opportunities where you can share experiences with other newly qualified members of staff&lt;/p&gt;\n&lt;p&gt;Feedback is regularly given to newly qualified therapists which makes you feel valued and appreciated&lt;/p&gt;\n&lt;p&gt;I enjoy each day of working because there are always new and exciting learning opportunities”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;“Everyone has been so welcoming and friendly since I started with the trust, and more than happy to offer advice and explanations wherever needed. I couldn’t have wished for a more supportive team to start out my journey as an NQP with and have been really impressed with the way the team has adapted so well to working a bit differently this term. There has been a wealth of resources and guidance available to me throughout which have helped to make my transition from student to NQP that bit easier.”&lt;/p&gt;\n&lt;p&gt;“I started working for this trust in September, from the first day the whole team have been friendly, welcoming and supportive, particularly through the changes due to COVID-19. The communication within the trust is fantastic. So far, the mentor programme has been great and I’ve had lots of shadowing experience. I would highly recommend working for this trust.”&lt;/p&gt;\n&lt;p&gt;Our team is friendly and kind; we meet regularly and encourage innovation and service improvement.&lt;/p&gt;\n&lt;p&gt;Suffolk is a lovely place to live with beaches and a variety of sporting and cultural activities to be enjoyed! If you’d like to be part of our team then look no further!&lt;/p&gt;\n&lt;p&gt;If you have the necessary skills, experience and qualities to help us to put patients first, and want to know more, then please contact:  Peta Cook, Paediatric speech and language therapy lead on 01284 741732.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "IPSWICH", "postalCode": "IP3 8LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0521", "longitude": "1.19698"}}, "title": "Speech &amp; Language Therapist (Paediatric) - Band 5 - Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255167", "validThrough": "2020-11-18T23:59:59+0000"}