{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29989", "minValue": "29989", "unitText": "YEAR", "value": "£17.84 per hour"}}, "datePosted": "2020-10-30T09:52:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your unfaltering dedication to quality is something you are very proud of; like us, you constantly strive to do things better for your patients. As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;/p&gt;\n&lt;p&gt;Our team members are adaptable, friendly, polite and caring. They enjoy working as a team with people from different cultures and backgrounds. And, they consider it a privilege to be trusted to look after others. Do you share these values? We are looking for an experienced Registered Nurse to join our outpatient team.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group Hospital, Shepton Mallet has been rated Outstanding by the CQC and our focus is on ensuring that patients received high quality treatment quickly, in clean and comfortable surroundings&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Supported by our experienced Outpatient Manager, Ewa you will work as a member of our multi-disciplinary team, assisting in the efficient running of the outpatient and pre-assessment service and coordinating the patient’s journey from pre-admission to discharge.&lt;/p&gt;\n&lt;p&gt;You will be an NMC Registered General Nurse with recent pre-assessment or surgical experience in an acute setting and up to date hands on clinical skills including phlebotomy and ECG’s.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a bank team member you have flexibility to choose the shifts that work for you around your other commitments. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to join our permanent team, we’ll support you. If you just want to stay as a bank practitioner, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded so we offer a competitive rates.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghviin our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Bank Outpatient Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249553", "validThrough": "2020-11-27T23:59:59+0000"}