{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393  pa Inc. HCAS"}}, "datePosted": "2020-10-21T10:32:52+0100", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Research and Development Team at Royal Brompton and Harefield NHS Foundation Trust. We are seeking an innovative and enthusiastic Senior Research Nurse or Senior Research Coordinator, to work within our Clinical Research Facility. The post-holder will be expected to manage a portfolio of respiratory research studies coordinating, assisting and leading project activity through set-up, delivery and closedown.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience in planning and delivering clinical research collaboratively within an NHS environment, working as part of a flexible research team. They will have experience of motivating colleagues to ensure research remains a top priority whilst promoting and delivering the highest quality of care to our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are committed to offering opportunities for our patients to participate in research wherever possible and are looking to appoint a highly motivated experience individual to join this team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is initially offered on a 1-year fixed term contract on a full-time basis however part-time applicants will be considered&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Should you require any further information regarding this post please contact Selvy Raju (CRF Manager) via email S.Raju@rbht.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Brompton Hospital  London  SW3 6NP", "postalCode": "SW3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4897", "longitude": "-.170831"}}, "title": "Band 7 Senior Research Nurse/Senior Research Coordinator - CRF", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235913", "validThrough": "2020-11-28T23:59:59+0000"}