{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-27T13:16:32+0000", "description": "&lt;p&gt;Buckinghamshire Hospitals NHS Trust is recruiting to the Thame Adult Community Healthcare Team (ACHT)and would like to invite all Band 6 District nurses / Nurse Case Managers to apply. We are also in a position to consider band 5 staff nurses who would like to undertake training and development to reach band 6 level. &lt;br /&gt;&lt;br /&gt;The service promotes an integrated approach working with GPs, therapy, intermediate care and social care colleagues to provide proactive care for patients in the community setting including caseload management, end of life care and prevention of admission. In addition you will be working with colleagues in the acute to facilitate timely discharges from hospital. &lt;br /&gt;&lt;br /&gt;As an expert clinical resource for the team you will be expected to support staff in identifying and developing their knowledge and skills. You must be innovative in your approach and willing to work with other members of the community team to ensure high quality service delivery. &lt;br /&gt;&lt;br /&gt;In order to respond to the healthcare needs of the local population the teams operate 7 days a week ensuring the delivery of a service which can react to the patients’ needs as and when required. The successful candidates will be expected to work within shift patterns. &lt;br /&gt;&lt;br /&gt;You will need to have a full driving license and access to a car for work purposes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Woods or Craig Larkin on 01844 210868&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thame Adult Community Health Team, Thame - Expected to work cross sites", "postalCode": "OX9 3JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7453", "longitude": "-.969986"}}, "title": "Community Case Manager Nurse - ACHT Thame", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244702", "validThrough": "2020-11-10T23:59:59+0000"}