{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum / pro rata"}}, "datePosted": "2020-10-30T10:46:59+0000", "description": "&lt;p&gt;The Urgent Care Night Response Team is an exciting, newly expanding, service for Oxford Health NHS Foundation Trust in Buckinghamshire. The service is designed as part of a wider work stream to support service users who present with a mental health crisis, and to support the inpatient teams when changes to workload or acuity require. This is a rare opportunity to join a close small team of clinicians who provide high quality crisis intervention and support overnight.&lt;/p&gt;\n&lt;p&gt;As an Out of Hours Clinician, you will be responsible for conducting assessments, maintaining the telephone crisis line, and supporting our inpatient wards. In this role we want you to provide the highest standard of clinical care. You should be able to conduct psychosocial assessments for those in crisis, possess excellent risk assessment skills and have experience in supporting others to achieve a high standard in the clinical workplace.&lt;/p&gt;\n&lt;p&gt;To be successful in meeting the challenges involved with the role you must be a skilled Mental Health Clinician who is enthusiastic, has strong clinical and risk management skills and must be able to work autonomously. The successful applicant will be responsible for the delivery of effective Crisis assessments within hospital settings and will provide expert mental health advice, support and training to staff where it’s needed. You will work collaboratively with a multidisciplinary team to ensure the care provided is safe, effective and of a high quality.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and interpersonal skills, clear decision making capabilities, be a vocal advocate for the patient and have current knowledge and expertise in the care of patients with severe and enduring mental health issues.&lt;/p&gt;\n&lt;p&gt;The expectation is that the role will largely involve working as part of a team at night but there will be occasional times (for training or meetings) that you will be requested to attend during daytime.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTheresa MclartyJob titleTeam ManagerEmail addresstheresa.mclarty@oxfordhealth.nhsTelephone number01865902000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiteleaf Centre, Aylesbury", "postalCode": "HP20 1EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8208", "longitude": "-.802517"}}, "title": "Night Response Team Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249804", "validThrough": "2020-11-15T23:59:59+0000"}