{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T08:45:28+0000", "description": "&lt;p&gt;An opportunity has arisen for two Surgical Nurse Practitioner&#39;s to join our dynamic friendly team on the Surgical Emergency Unit at the Royal Wolverhampton Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated, enthusiastic individuals with excellent communication and interpersonal skills to join our well established team with a commitment to delivering and continuously improving high quality individualized patient centered care.&lt;/p&gt;\n&lt;p&gt;The role will develop and allow the successful applicant to independently receive patients referred with undifferentiated and undiagnosed problems, make an assessment of their health, utilize and develop highly expert knowledge, diagnostic and clinical skills prioritizing patient care.&lt;/p&gt;\n&lt;p&gt;Previous nurse practitioner experience would be advantageous although full support to achieve competencies will be provided by the surgical team. Evidence of post registration experience within an acute surgical environment is essential. Physical examination and assessment skills and the completion of the Non –Medical prescribing qualification will be an advantage.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the ability to lead, manage and supervise staff, delegate work appropriately and will be committed to quality improvement. In return we offer inclusion into an enthusiastic team, a period of induction and a strong commitment to training and personal development&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Surgical Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255109", "validThrough": "2020-11-18T23:59:59+0000"}