{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37511", "minValue": "31051", "unitText": "YEAR", "value": "31,051 - £37,511"}}, "datePosted": "2020-10-20T13:58:46+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Please apply only if you have the right to live and work in the UK.  &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post of Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 6 £31,051 - £37,511&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Woking and Sam Beare Hospice for a Physiotherapist to join our Therapy Team.&lt;/p&gt;\n&lt;p&gt;Based predominantly in the Community, you will provide a specialist physiotherapy service for our patients who have life limiting conditions.&lt;/p&gt;\n&lt;p&gt;We are seeking a physiotherapist who is looking to develop their knowledge and skills within a palliative care setting. Whilst experience of palliative care is desirable, it is not essential as we can offer support through our training and development programme. Excellent communication skills and the ability to liaise with patients and staff at all levels are, however, essential.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this role further or arrange an informal visit , please contact Julie Alderman (Therapy Team Lead) or Lyn Hine (Senior Physiotherapist) on 01483 881750.&lt;/p&gt;\n&lt;p&gt;Woking and Sam Beare Hospiceis a regional charity organisation working closely with itsNHS partners to provide excellent care to patients and their families. Operating from a bespoke building in Goldsworth Park in Woking, the Charity provides inpatient and community services across North West Surrey. Goldsworth Park is close to all major road networks and the Hospice offers ample free car parking.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Woking and Sam Beare Hospices", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133734"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woking", "postalCode": "GU21 3LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3188", "longitude": "-.590696"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234645", "validThrough": "2020-11-30T23:59:59+0000"}