{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "Band 6 - £30,401 - £37,267"}}, "datePosted": "2020-11-03T10:16:26+0000", "description": "&lt;p&gt;We are a passionate and innovative team working at the admission medium&lt;br /&gt;secure unit. Oak Ward is a 15 bed male acute High dependency ward which&lt;br /&gt;specialise in the assessment and treatment of people with complex and&lt;br /&gt;enduring mental health needs, who have had contact with the criminal justice&lt;br /&gt;system.&lt;/p&gt;\n&lt;p&gt;Hellingly Centre is a member of Quality Network for Forensic Mental Health&lt;br /&gt;Services. Guided by QNFMHS, Oak Ward recognises the importance of the&lt;br /&gt;therapeutic use of relational security whilst also promoting important&lt;br /&gt;principles around evidence-based care, patient and carer involvement, parity&lt;br /&gt;of physical healthcare, public health priorities, and good governance. QNFMHS&lt;br /&gt;benchmarks via peer reviews, creating opportunities for qualified staff to&lt;br /&gt;become certified peer reviewer for nationwide forensic services.&lt;/p&gt;\n&lt;p&gt;As a part of a Sussex Partnership Foundation Trust Forensic Clinical Academic&lt;br /&gt;Group, Hellingly Centre takes part in ongoing research, currently Oak ward has&lt;br /&gt;developed a service wide evaluation for the CDS. We are looking into&lt;br /&gt;implementation of Safewards model on Oak Ward, which creates many&lt;br /&gt;exciting opportunities, such as being a part of a pioneering Safewards&lt;br /&gt;intervention in secure environment.&lt;/p&gt;\n&lt;p&gt;Oak Ward has a very strong Multidisciplinary Team, which consists of Nursing&lt;br /&gt;Team, Psychiatrists, Social Workers, Psychologists, Occupational Therapist,&lt;br /&gt;Family Liaison Assistant, Physical Health Team, and GP. Patient care is always&lt;br /&gt;based on multi-dimensional approach and gives learning opportunity for&lt;br /&gt;qualified nurse to be involved in clinical assessments including specialized&lt;br /&gt;forensic risk clinics, formulation of HCR-20, DUNDRUM-1, BVC scoring and&lt;br /&gt;many more.&lt;/p&gt;\n&lt;p&gt;As a part of patients&#39; care, Clinical Team runs Therapy Sessions and Groups&lt;br /&gt;tailored to patient&#39;s specific needs. Currently we facilitate Hearing Voices&lt;br /&gt;Group, Impatient Violence and Aggression Programme (IVAMP), Healthy Sexual&lt;br /&gt;Behaviour Group and more. Nurses are always welcomed to co-facilitate&lt;br /&gt;groups.&lt;/p&gt;\n&lt;p&gt;If you are a qualified nurse, you are ambitious and passionate, with a desire for&lt;br /&gt;self-development, then you are a perfect person to join our team. We&lt;br /&gt;encourage applications from both newly qualified staff and those who have&lt;br /&gt;had experience in other areas of mental health.&lt;/p&gt;\n&lt;p&gt;We work across a 24 hour period with a working pattern of 11.5 hour shifts. Please see attached Job description and Job specification&lt;/p&gt;\n&lt;p&gt;The Hellingly centre is also very active on Twitter so feel free to follow us and&lt;br /&gt;get connected!&lt;/p&gt;\n&lt;p&gt;If you would like to come for an informal visit of have any questions regarding&lt;br /&gt;the role of a band 6 nurse on Oak ward, forensic nursing or any question’s&lt;br /&gt;regarding working patterns please do not hesitate to contact Marta Bardecka&lt;br /&gt;Ward manager.&lt;br /&gt;Marta.Bardecka@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Oak Ward Manager Marta Bardecka or Matron Loraine Hamilton&lt;/p&gt;\n&lt;p&gt;Loraine.hamilton@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;marta.bardecka@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;We are also very active on Twitter @&lt;span&gt;HellinglyCentre&lt;/span&gt; so please follow us and get connected!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellingly Centre, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Charge Nurse/Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253391", "validThrough": "2020-11-17T23:59:59+0000"}