{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-26T10:16:21+0000", "description": "&lt;p&gt;We are looking to recruit a Senior Speech and Language Therapist to work in our dynamic In-Patient Speech and Language Therapy Team based at the Royal Albert Edward Infirmary in Wigan.&lt;/p&gt;\n&lt;p&gt;This is an exciting split post offering the opportunity to work on the Acute Stroke Unit. Working alongside the Team Lead and Band 5 Speech and Language Therapist you will work closely with the MDT, nursing and medical staff on the unit. The Speech and Language therapy service operates on the acute stroke unit across 6 days and the working pattern is on a rota basis (Monday - Saturday).&lt;/p&gt;\n&lt;p&gt;The other aspect of this post is to lead the Voice Service alongside the Band 5 Speech and Language therapist and supported by the Stroke Team Lead. Voice referrals are via our ENT Consultants. We have close links with Voice SLT Services in neighbouring trusts who can provide Peer support.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to be involved with student training, service developments and in service training programmes delivering teaching on stroke management / acute SLT to the MDT, nursing and medical staff within the organisation.&lt;br /&gt;&lt;br /&gt;Previous experience within the field of Stroke, dysphagia management and Voice is required.&lt;br /&gt;&lt;br /&gt;We can offer you an excellent support system, regular team and staff meetings and good training opportunities.&lt;/p&gt;\n&lt;p&gt;This is a permanent position for 25 hours per week (service operates from Monday to Saturday).&lt;/p&gt;\n&lt;p&gt;The role will require you to work across all areas in the trust which includes those that are designated as positive, asymptomatic and negative COVID wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this vacancy may close before the advertised closing date if a sufficient number of suitable applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All candidates are required to show evidence of their certificates to the interview panel.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For overseas candidates wishing to apply for the job role and require immigration sponsorship, you can self-assess the likelihood of obtaining a CoS for the post on the &lt;/em&gt;&lt;em&gt;GOV.UK website.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Faye Parsons (Team Lead)&lt;/p&gt;\n&lt;p&gt;faye.parsons@wwl.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01942 822182&lt;/p&gt;\n&lt;p&gt;or&lt;br /&gt;&lt;br /&gt;Rachel Huyton (Clinical Services Manger Therapy)&lt;/p&gt;\n&lt;p&gt;Tel: 01942 773354&lt;/p&gt;\n&lt;p&gt;Email: rachel.huyton@wwl.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Albert Edward Infirmary, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Senior Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241968", "validThrough": "2020-11-16T23:59:59+0000"}