{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-11-02T09:00:41+0000", "description": "&lt;p&gt;An exciting opportunity has arisen with the Adult Community Learning Disability Service. The Learning Disability Service strives to provide forward thinking high quality services, working in partnership with other agencies. In addition to working with people with learning disabilities and their families we have a strong commitment to health promotion through service development and training initiatives. We are committed to helping our staff-develop and you will be part of an enthusiastic and experienced team.&lt;/p&gt;\n&lt;p&gt;The Assistant Speech Therapy Practitioner role is critical to supporting the implementation of therapeutic interventions as delegated by the qualified speech therapists. They will work as part of a Multi-disciplinary team working with adults who have a learning disability in the community. The post holder will hold a caseload and direct clinical programs of nursing care, and they are expected to develop relationships with carers and families of people with a learning disability, as well as key partners and stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will be an experienced assistant therapist, with knowledge and skills in supporting people with a learning disability with complex health needs, as well as experience with supporting challenging behaviour.&lt;/p&gt;\n&lt;p&gt;Adaptability, good communication skills and self-motivation are essential to the role. You will also be able to demonstrate that your practice is evidence based and innovative.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquires contact: Rosie Werner or Chris Upton on 01524 550330&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LD Community Team Fylde &amp; Wyre, Lytham", "postalCode": "FY8 5EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7384", "longitude": "-2.94732"}}, "title": "Assistant Speech Therapy Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251369", "validThrough": "2020-11-16T23:59:59+0000"}