{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28324", "minValue": "15179", "unitText": "YEAR", "value": "£9.03- £16.85"}}, "datePosted": "2020-11-05T12:54:16+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Title: Domestic&lt;/p&gt;\n&lt;p&gt;Location/Trust: Deep Cleaning team GMMH&lt;/p&gt;\n&lt;p&gt;Department: Domestics - Prestwich&lt;/p&gt;\n&lt;p&gt;Band/Pay rate: £9.21 (Enhancement for weekends)&lt;/p&gt;\n&lt;p&gt;Hours:37.5 Rotaed 6am-2pm and 12pm-22.00pm 10-6 at weekends&lt;/p&gt;\n&lt;p&gt;Placement Ref: 35648&lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;Can you bring your excellent domestic skills and knowledge to our in patient unit?&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that works well together, always there to help each other? Would you like to work in a Trust that recently had good in their CQC report? This location is easily accessible by public transport and has onsite parking.&lt;/p&gt;\n&lt;p&gt;If you answered yes, Greater Manchester Mental Health NHS Foundation Trust would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We have a temporary placement opportunity available for a Domestic Based at Prestwich Hospital coveringall GMMH Properties across Manchster youwill be providing the following support to the Domestic team team.&lt;/p&gt;\n&lt;p&gt;assist colleagues within theDeep cleaning/ Heavy Fogging Department to providing a clean and safe environment for patients buy undertaking sheduled deep cleans and emergency deep cleans.&lt;/p&gt;\n&lt;p&gt;Travel across manchster area to GMMH properties to carry out sheduled cleans and emergency requests.&lt;/p&gt;\n&lt;p&gt;To ensure infection control policies are adhered to which ensures we maintain the highest standards of cleanliness.&lt;/p&gt;\n&lt;p&gt;Responsible for the safe use of cleaning equipment&lt;/p&gt;\n&lt;p&gt;This role can involve a lot of heavy lifting and is a very physical role&lt;/p&gt;\n&lt;p&gt;The skills required are:&lt;/p&gt;\n&lt;p&gt;Full Clean Driving Licence&lt;/p&gt;\n&lt;p&gt;Cleaning experience&lt;/p&gt;\n&lt;p&gt;Knowledge of COSHH&lt;/p&gt;\n&lt;p&gt;Knowledge of H &amp; S&lt;/p&gt;\n&lt;p&gt;Working in a hospital environment or equivalent Deep Cleaning or Heavy Fogging expereince desirable but not essintial.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health NHS Foundation Trust provides community-based and inpatient mental health care and treatment to a population of 1.2 million people living in Bolton, Salford, Trafford and Manchester.&lt;/p&gt;\n&lt;p&gt;The Trust provides a wide range of more specialised mental health and &#39;outstanding&#39; substance misuse services across Greater Manchester, the North West of England and beyond. We provide in-reach services to prisons across the north of England and secure mental health services for the North West of England.&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;br /&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prestwich", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Domestic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257736", "validThrough": "2020-11-19T23:59:59+0000"}