{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-11-03T08:15:56+0000", "description": "&lt;p&gt;The busy Research and Development Department at Maidstone and Tunbridge Wells NHS Trust is looking to recruit a Clinical Trial Co-ordinator - Oncology Haematology and Lymphoma to support the co-ordination of an ever-growing number of research studies within the oncology service.&lt;/p&gt;\n&lt;p&gt;You will provide full administration support to a team of research professionals, including doctors and research nurses, to support the recruitment and reporting of patients on a wide variety of studies.&lt;/p&gt;\n&lt;p&gt;You will be supported by the Research Governance Officer for all governance issues and by the Oncology Lead Research Nurse on a day to day basis.&lt;/p&gt;\n&lt;p&gt;You will have excellent administration skills and good attention to detail. You do not need to have a background in research administration, although this would be an advantage. On the job support is provided. You will work with staff at all levels and be willing to take on new challenges. You must have previous experience of working in a busy office environment.&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Thursday 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: To be confirmed &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie KnowlesJob titleResearch Governance OfficerEmail addressJulie.Knowles@nhs.netTelephone number01622 225340&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Clinical Trial Co-ordinator - Oncology Haematology and Lymphoma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253120", "validThrough": "2020-11-12T23:59:59+0000"}