{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "44503", "unitText": "YEAR", "value": "upto £44,503.00 per annum AfC Band 7"}}, "datePosted": "2020-11-04T16:19:15+0000", "description": "&lt;h1&gt;&lt;strong&gt;Clinical Psychologist&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;37.5 hours per week to be worked in accordance with the needs of the service&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Salary up to £44,503.00 per annum eqivalent to&lt;/strong&gt;&lt;strong&gt;Agenda for Change Band 7&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join our Psychology and Bereavement team based at Mountbatten Hampshire, as we further develop our services to continue to meet the changing needs of our patients and their families. As our new Clinical Psychologist, you will have the opportunity to help develop and establish our growing services across Hampshire.&lt;/p&gt;\n&lt;p&gt;Mountbatten is an organisation that cares passionately about its patients, their families/carers and our employees, so why not join us to help us all make a difference to someone’s life every single day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working alongside our other professionals such as counsellors, creative therapists, administrative staff and volunteer bereavement support teams you will provide support to individuals and their families living with palliative or life limiting conditions across Hampshire. You will provide a much need support service to bereaved families and carers of our patients. Acting as a specialist resource you will work collaboratively within the multidisciplinary team, helping to develop and grow our services. You will draw upon a range of psychological models and techniques to provide the highest quality of service to your clients. This role offers the opportunity for continuing professional development and the ability to grow and develop a brand new service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a qualified clinical psychologist who holds a recognised academic qualification (clinical/counselling doctorate). You will have previous experience of providing support to patients, their families, working within either a Hospice/Hospital or Charity environment.&lt;/p&gt;\n&lt;p&gt;You will have the ability work as part of a multi-disciplinary team and be able to encourage them to challenge their ways of working to improve patient care across our services. You will have strong communication skills which can be used at all levels both internally and externally to the Hospice. You will be an organised individual who is able to prioritise and manage your own caseload.&lt;/p&gt;\n&lt;p&gt;You will be able to work flexibility in accordance with the needs of the services. Being a self-motivated, self-starter who has awareness of current end of life care, you will be able to take and make decisions to benefit your patients and our services. Awareness of safeguarding regulations and responsibilities is imperative for this role. You will be able to provide evidence of your CPD and must be a registered member of HCPC or equivalent professional organisation.&lt;/p&gt;\n&lt;p&gt;You will have a full clean driving licence and have the use of a vehicle for business purposes associated with this role, as you may be required to travel to various locations within Hampshire and the Isle of Wight to provide your services.&lt;/p&gt;\n&lt;p&gt;Excellent career development await you, with clinical supervision and professional development opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135075.png", "name": "Countess Mountbatten Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256622", "validThrough": "2020-11-18T23:59:59+0000"}