{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T14:31:08+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, dynamic and highly motivated individual to join our forward thinking ophthalmology team at the East Lancashire Health Care trust on the Royal Blackburn &amp; Burnley general teaching hospital sites. You will be expected to promote innovative thinking and provide inspirational leadership and managerial support to all members of the multidisciplinary team. We have a new opportunity for a Ward Sister/Charge Nurse on our day case surgery unit.&lt;/p&gt;\n&lt;p&gt;You must have excellent communication skills and be able to work effectively in a multi-disciplinary team, whilst being able to lead and maintain outstanding standards of care. The Ward Sister/Charge Nurse is someone whom is equally accountable for the day to day running of the ward and staff, acting as a positive role model at all times.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a structured orientation programme with the support of the department Ward Manager. You will be supported to develop yourself with regular one to one meetings and appraisals to enable you to gain the skills and competencies required. Dependant on your ophthalmology experience you will support and develop your skills in the specialist services within the area when required, pre-operative assessment, emergency triaging and urgent eye clinic.&lt;/p&gt;\n&lt;p&gt;Post are offered on a full time basis. The post requires flexible working patterns to meet the needs of the service to include bank holidays and weekends as required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £48.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJackie ReillyJob titleDay unit managerEmail addressjacqueline.reilly@elht.nhs.ukTelephone number13122 (01282 803122)Additional contact information&lt;/p&gt;\n&lt;p&gt;Jackie Reilly:&lt;/p&gt;\n&lt;p&gt;01282 803122&lt;/p&gt;\n&lt;p&gt;Jacqueline.reilly@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lancashire Teaching Hospitals, East Lancashire", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Ophthalmology Junior Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246987", "validThrough": "2020-11-11T23:59:59+0000"}