{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-11-05T14:46:40+0000", "description": "&lt;p&gt;Tower Hamlets Talking Therapies are looking to recruit two remote working Psychological Wellbeing Practitioners to join our dynamic and innovative service on a fixed term 1-year basis. &lt;br /&gt;Based in East London we have provided psychological therapy services to general practice and the local community for over 30 years. We are a stepped care service offering evidence based interventions at steps 2 and 3. Our team consists of Psychological Wellbeing Practitioners, Cognitive Behaviour Therapists and Clinical &amp; Counselling Psychologists. As a service, we actively encourage different theoretical interests and offer specialist areas of development such as LTC/Eating Disorders/Perinatal.&lt;br /&gt;This post involves:&lt;br /&gt;Providing Low Intensity interventions from a range of CBT based self-management interventions for clients with mild to moderate anxiety and depression using remote options &lt;br /&gt;Working with people from different cultural backgrounds and ages, using interpreters when necessary using remote options &lt;br /&gt;We have a firm commitment to CPD and offer high quality supervision as well as the opportunity to participate in team initiatives. The team works closely with a variety of trained professionals across a range of therapeutic orientations including, DIT, Systemic, IPT, CBT and Psychodynamic. &lt;br /&gt;We have always been a proactive and forward looking service, with a strong commitment to meeting the needs of the diverse community in which we are located and we particularly welcome applicants with fluency in Sylheti. &lt;br /&gt;For more information, please contact: &lt;br /&gt;Jenisha Maisuria &lt;br /&gt;Step 2 and Community Lead/Senior High Intensity Therapist &lt;br /&gt;Jenisha.maisuria@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing Date: 22nd November 2020 &lt;br /&gt;Interview Date: Friday 4th December 2020 &lt;br /&gt;How to apply: Please complete the NHS Jobs application form. If you are shortlisted for an interview you will be notified via email. &lt;br /&gt;Interviews will take place remotely via Microsoft Teams. &lt;br /&gt;Important Information:&lt;br /&gt;Please ensure you check your emails regularly as this is how we will communicate with you throughout the recruitment process. If you are shortlisted you will be notified by email within 2 weeks of the advert closing.&lt;/p&gt;\n&lt;p&gt;Due to the high volumes of applications we receive for certain posts, we reserve the right to close any adverts before the published closing date once we have received a sufficient number of applications.&lt;/p&gt;\n&lt;p&gt;These vacancies are offered as fixed term contracts for 1 year, with the expectation that all clinical staff work one late evening per week (11am until 7pm).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJenisha MaisuriaEmail addressjenisha.maisuria@nhs.netTelephone number0207 702 7641Additional contact information&lt;/p&gt;\n&lt;p&gt;Jenisha Maisuria, telephone 0207 702 7641, email jenisha.maisuria@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS TH Adults IAPT, LONDON", "postalCode": "E1 0AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5116", "longitude": "-.050843"}}, "title": "Remote Psychological Wellbeing Practioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258177", "validThrough": "2020-11-22T23:59:59+0000"}