{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T12:46:20+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced, motivated, and enthusiastic Midwife, with a passion for service improvement, to lead on the development and implementation of the Continuity of Carer work-stream within the Maternity Services at the Newcastle upon Tyne Hospitals. This post is offered on a fixed term or as a secondment opportunity for a period of 12 months.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the Associate Director of Midwifery, the Directorate Senior Leadership Team and members of the wider mutli-professional workforce. Positive engagement with service users and the Maternity Voices Partnership will be a pivotal element to the role.&lt;/p&gt;\n&lt;p&gt;Networking and close working relationships will be established with regional and national Teams, particularly the NTWD Local Maternity System (LMS), in supporting and leading transformational change aligned to Better Births, and specifically the key deliverables relating to Continuity of Care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate the following attributes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competence in all aspects of clinical midwifery;&lt;/li&gt;\n&lt;li&gt;A comprehensive working knowledge of the The Maternity Transformation Programme; Better Births and the principles of Continuity of Care;&lt;/li&gt;\n&lt;li&gt;The ability to work flexibly, independently and complete schedules of work to deadline;&lt;/li&gt;\n&lt;li&gt;Demonstrate excellent interpersonal, communication and team working skills;&lt;/li&gt;\n&lt;li&gt;Evidence of involvement in service improvement and transformational change;&lt;/li&gt;\n&lt;li&gt;Knowledge of quality initiatives and involvement in the implementation of such initiatives;&lt;/li&gt;\n&lt;li&gt;A baseline working knowledge in the use of a variety of IT applications;&lt;/li&gt;\n&lt;li&gt;Evidence of continuing professional development to degree level and above;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you feel that you have the key qualities for this important role, and the passion and drive to support better outcomes for mothers and babies, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Full Time 37 Hours 30 Minutes/Week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jane Anderson, Associate Director of Midwifery&lt;/p&gt;\n&lt;p&gt;Contact through Secretary Amy Smith 0191 2825711 amy.smith27@nhs.net&lt;/p&gt;\n&lt;p&gt;Michelle Watson, Matron for Postnatal and Community Services&lt;/p&gt;\n&lt;p&gt;Michelle.watson12@nhs.net Tel 0191 28 25768&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 02 Royal Victoria Infirmary", "postalCode": "NE1 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9786", "longitude": "-1.61846"}}, "title": "Senior Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246647", "validThrough": "2020-11-10T23:59:59+0000"}