{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-06T13:31:13+0000", "description": "&lt;p&gt;We are recruiting a Locum Consultant Clinical Oncologist to provide and develop oncology services for our patients across East and West Berkshire. The post would cover two main tumour sites to include breast and one other from: lung, gastrointestinal, skin and gynaecological cancers. There is flexibility in tumour site combinations according to the interests of the candidate and the needs of the department.&lt;/p&gt;\n&lt;p&gt;Our values inspire us to be: Compassionate – Aspirational – Resourceful - Excellent. This reflects the type of Trust we want to be, and you can join our dedicated and talented staff to make it happen. New colleagues can look forward to a friendly environment and a future full of opportunities at the Royal Berkshire NHS Foundation Trust (RBFT). You will be working alongside high calibre staff, focusing on providing the best services to our patients. The CQC recently rated the care we provide as outstanding.&lt;/p&gt;\n&lt;p&gt;If successful, you will be working with a cohesive, friendly and committed team including ten clinical oncologists and two medical oncologists. You will also contribute to our excellent 7-day Acute Oncology Service which is managed by our Clinical Nurse Specialist team.&lt;/p&gt;\n&lt;p&gt;The Cancer Centre provides comprehensive in and outpatient specialist services for all common cancers with links to the Oxford Oncology Centre for the treatment of rare cancers. There is strong engagement with research within our clinical trials unit.&lt;/p&gt;\n&lt;p&gt;We are a large centre for Prostate Brachytherapy (Low Dose Rate/Real Time) and provide gynaecological brachytherapy (High Dose Rate/Image Guided). External beam radiotherapy is delivered by 4 Elekta linear accelerators between our Reading and Bracknell sites, offering high definition MLCs, high dose-rate (FFF) modes and 4D-CBCT capability. Surface Guided Radiotherapy (SGRT) systems are installed on two accelerators. Provision of a SABR service is a high priority for 2019/2020, providing opportunities for developments in this, and other, areas of interest. Research and Development is strongly encouraged and supported through collaborative links with the University of Reading.&lt;/p&gt;\n&lt;p&gt;The Trust provides acute treatment and specialist care for a catchment population of around 750,000 people in Reading, and the surrounding towns and villages of Berkshire, South Oxfordshire and Buckinghamshire. We provide specialist Oncology services at RBFT (Royal Berkshire Hospital, Bracknell Health Space, Townlands Hospital in Henley, and Newbury Hospital) and to Frimley Health NHS Foundation Trust (Wexham Park, Heatherwood and King Edward VII Hospitals).&lt;/p&gt;\n&lt;p&gt;We are proud of our innovative approach to improving patient care and experience and we regularly receive national recognition for the quality of the care we provide.&lt;/p&gt;\n&lt;p&gt;The City of Reading sits on the river Thames and is served by great road and rail links to London, Oxford and Southampton. With excellent leisure and shopping facilities, and a thriving cultural scene, Reading is a wonderful place to live, work and play. Reading provides excellent facilities for families, including some of the best state and private schools in the UK.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be required to attend an assessment on the 8th October 2019 followed by a formal interview on the 16th October 2019.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Helen O&#39;Donnell Trust Cancer Lead&lt;/p&gt;\n&lt;p&gt;Email address helen.o&#39;donnell@royalberkshire.nhs.uk &lt;/p&gt;\n&lt;p&gt;Telephone number 0118 322 6911&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Berkshire Hospital, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Locum Consultant in Clinical Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259926", "validThrough": "2020-12-04T23:59:59+0000"}