{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-26T17:48:22+0000", "description": "&lt;p&gt;At Mid Yorks we take pride in our cutting edge acute and elective surgery, delivering Urological and General surgical procedures in our robotic theatre at Pinderfields, where we provide 24-hour acute and trauma care.&lt;/p&gt;\n&lt;p&gt;Our team focus is very much in keeping with our Trust values of high standards and continuous improvement. We work together to deliver exceptional care to our patients and we work very hard to create an environment which is challenging but enjoyable and supportive.&lt;/p&gt;\n&lt;p&gt;As a Team Leader, you will maintain our focus on innovation and excellence. You will lead your team in a manner that enables each individual to continue to thrive and contribute to continuously improving our patient experience. It is essential that your leadership style embodies our core values and enables effective team working within your own team and in partnership with other teams across our services. You will need to hold a mentorship qualification and be able to demonstrate your own continuous professional development in respect of your leadership style.&lt;/p&gt;\n&lt;p&gt;Working with the clinical lead, you will also be the technical expert for your team and so will need to have significant post registration theatre experience. Our team leaders also form part of the clinical on-call team and are required to undertake clinical, out of hours shifts.&lt;/p&gt;\n&lt;p&gt;We strive to support every member of our team, recognising individual needs and circumstance. We have an extensive range of initiatives and benefits to support you in work and in your personal life including local and national discounts and offers and our discounted, on-site childcare provision for 0-14 years, which has been rated as excellent by Ofsted. Your wellbeing is important to us and our dedicated health and wellbeing team provide a comprehensive range of pastoral and recreational activities to enhance your mental and physical health and wellbeing.&lt;/p&gt;\n&lt;p&gt;To enable you to settle successfully into our team at Mid Yorks, we offer a robust induction and a bespoke preceptorship programme during your first 6 months.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this post and would like to have an informal discussion to address any questions you have before submitting your application, we would love to hear from you. You can contact Sister Hifza Hussain on 01924 541874 or ext 51874 or our Practice Educator Jackie Elder on 01924 542291 ext 52291&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 25.11.2020 so please save this date in your diary. The Interviews may be conducted via Microsoft teams or in person. Please ensure that you are familiar with and have access to this software before you are shortlisted. If you need any support to do this, our Recruitment Team will be more than happy to help you. The recruitment team details are included in the NHS jobs information.&lt;/p&gt;\n&lt;p&gt;Thank you for your interest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Theatre Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243587", "validThrough": "2020-11-23T23:59:59+0000"}