{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T11:46:17+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 Staff Nurse to join the Southampton Respiratory Centre. Our specialised multi-professional team offers high standards of care to patients with different respiratory conditions and is a leading provider of ambulatory/day case respiratory care in the south central area, We are based in University Hospital Southampton and supported by a large team of Clinical Nurse Specialists and Respiratory Consultants.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a highly motivated, dynamic and enthusiastic Nurse who is seeking to develop new nursing skills within a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are a dedicated team proud of the service we offer to our patients. Our vision is to deliver current and evidence-based care in order to meet patient’s expectations by ensuring they have the best clinical outcome. We provide the following services:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nurse-led COPD reviews&lt;/li&gt;\n&lt;li&gt;Home oxygen assessments and reviews&lt;/li&gt;\n&lt;li&gt;ILD clinics&lt;/li&gt;\n&lt;li&gt;CPAP assessments and reviews within the nurse-led sleep clinic&lt;/li&gt;\n&lt;li&gt;Nebulised medication trials&lt;/li&gt;\n&lt;li&gt;Asthma, allergy and immunology assessments&lt;/li&gt;\n&lt;li&gt;Pulmonary vascular service&lt;/li&gt;\n&lt;li&gt;Non-invasive ventilation assessments and reviews&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Respiratory Centre is currently staffed from 08:00-18:00 Monday to Friday. In Pre Covid times we extended our hours until 20:00 Monday and Thursday which may recommence as able.&lt;/p&gt;\n&lt;p&gt;Our service has had to change during the pandemic and we are now working across sites within and outside UHS. We are still running all of our services but as a mixture of virtual, domiciliary and face to face clinics. As restrictions change then the Respiratory centre will adapt to meet the needs of our secondary and tertiary care patients.&lt;/p&gt;\n&lt;p&gt;This role offers the opportunity to develop a range of nursing and assessment skills for a defined patient group practicing within and with the support of the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Once established in post with training and certified competencies, the successful applicant will have the opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Independently run nurse-led clinics: CPAP reviews, COPD reviews, nebuliser trials, skin prick testing clinic&lt;/li&gt;\n&lt;li&gt;Support Consultant-led respiratory clinics&lt;/li&gt;\n&lt;li&gt;Support the Home Oxygen Service in home oxygen assessments&lt;/li&gt;\n&lt;li&gt;Develop skills to effectively manage patient’s respiratory health&lt;/li&gt;\n&lt;li&gt;Assist in data collection and service development&lt;/li&gt;\n&lt;li&gt;Provide advice in respiratory health to patients and other health care professionals&lt;/li&gt;\n&lt;li&gt;Promote patient’s health and safety and ensure high quality of care is provided at all times&lt;/li&gt;\n&lt;li&gt;Help cover sleep studies in sleep laboratories, once restarted (only in the evenings)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will benefit from excellent learning opportunities to progress both professionally and clinically in their nursing career within a supportive environment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to have a positive, patient-centred approach and be able to work autonomously.&lt;/p&gt;\n&lt;p&gt;They should have excellent organisational and communication skills and be willing to learn a variety of new&lt;/p&gt;\n&lt;p&gt;Practical skills.&lt;/p&gt;\n&lt;p&gt;The candidate will need to be adaptable to change.&lt;/p&gt;\n&lt;p&gt;Previous respiratory experience is an advantage but not essential.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Monday, 16 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jose Horno&lt;/p&gt;\n&lt;p&gt;Respiratory Centre Deputy Manager&lt;/p&gt;\n&lt;p&gt;Jose.Horno@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 8082&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff Nurse - Respiratory Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240378", "validThrough": "2020-11-06T23:59:59+0000"}