{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-12T10:17:36+0100", "description": "&lt;h1&gt;The role&lt;/h1&gt;\n&lt;p&gt;This is a new, part time Single Point of Access and First Response Service post, created to support a newly commissioned 24/7 crisis pathway; meeting the needs of those who are age appropriate and require an accessible and responsive urgent intervention.&lt;/p&gt;\n&lt;p&gt;Devon Partnership Trust is working towards a 24/4 crisis model, as laid out by the NHS England Long-term Plan (2019); promoting the ‘right care right time right place principle’&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone to relocate to Devon or to supplement another part time role. We would also consider applications from people who would be interested in carrying out the role remotely.&lt;/p&gt;\n&lt;h1&gt;About us&lt;/h1&gt;\n&lt;p&gt;The service is an exciting newly commissioned 24/7 provision based in Exeter, promoting a dynamic and innovative way of working; responding to crisis referrals/calls. The role encompasses the NHS principle; right care, right time and right place. The service triages mental health crisis calls and referrals, providing psychologically informed tele-coaching interventions, support, guidance and signposting. The service further delivers timely and responsive face to face assessments where indicated.&lt;/p&gt;\n&lt;p&gt;We are seeking a visionary, motivated and inspirational medical lead to work alongside the Service Manager to provide outstanding 24/7 crisis care in accordance with national NHS drivers.&lt;/p&gt;\n&lt;h1&gt;Our offer to you&lt;/h1&gt;\n&lt;p&gt;Devon Partnership Trust supports and encourages consultants in their career development with good opportunity for CPD.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to career development&lt;/li&gt;\n&lt;li&gt;Wide range of leadership development opportunities&lt;/li&gt;\n&lt;li&gt;Up to &lt;strong&gt;41 days of paid leave &lt;/strong&gt;per year, depending on length of NHS service, includes bank holidays&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;NHS pension scheme &lt;/strong&gt;with employer contributions of up to 14.5% of pensionable pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Incremental pay &lt;/strong&gt;progression&lt;/li&gt;\n&lt;li&gt;Good &lt;strong&gt;maternity, paternity and adoption leave &lt;/strong&gt;over and above the statutory minimum requirements&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sick pay &lt;/strong&gt;up to a maximum of six months full pay and six months half pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Childcare vouchers &lt;/strong&gt;– annual savings of up to £1,19&lt;/li&gt;\n&lt;li&gt;Commitment to &lt;strong&gt;flexible working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;24/7 free &lt;strong&gt;confidential advice &lt;/strong&gt;and &lt;strong&gt;support service&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend and both earn £500 &lt;/strong&gt;- available for selected posts. &lt;em&gt;Terms and conditions apply.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;Freedom to speak up &lt;strong&gt;‘Guardian Service’&lt;/strong&gt;, enabling you to safely discuss any concerns impacting on patient care&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship schemes&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exclusive &lt;strong&gt;health service discounts &lt;/strong&gt;for NHS staff&lt;/li&gt;\n&lt;li&gt;Stagecoach – &lt;strong&gt;bus transport discounts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice &lt;strong&gt;cycle scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Access to free &lt;strong&gt;recovery and wellbeing courses&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;Living here&lt;/h1&gt;\n&lt;p&gt;Exeter is a thriving city with fine dining restaurants, excellent schools and flourishing art scene. Alongside a dynamic city lifestyle, as the third largest county in England, it’s no wonder Devon can also offer people the space to contemplate, to relax and reinvigorate yourself. The beauty and quality of our landscapes are unsurpassed with over 1/3 of the county designated as Areas of Outstanding Natural Beauty. There are over 450 miles of coastline along 2 stunning and distinctive coasts, the rugged wildernesses of 2 National Parks, a UNESCO Biosphere Reserve, England’s first natural World Heritage Site – the Jurassic Coast, 5,000km of public rights of way and over 250km of off-road cycle paths. Our natural outdoor playground offers you the chance for a fantastic work-life balance.&lt;/p&gt;\n&lt;h1&gt;The hours&lt;/h1&gt;\n&lt;p&gt;This post is for 0.5 WTE and duties are outlined in the Job Description Job Plan. The Job Plan can be discussed with the successful applicant and remote working will be considered.&lt;/p&gt;\n&lt;p&gt;The Job Description for this post is pending Royal College Approval.&lt;/p&gt;\n&lt;h1&gt;&lt;em&gt;Great place to work. Great place to live&lt;/em&gt;&lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Consultant Psychiatrist in First Response Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221854", "validThrough": "2020-11-29T23:59:59+0000"}