{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-26T14:01:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an enthusiastic and flexible dietitian looking for a great opportunity to join a progressive Community Team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have just the role you’re after here within Somerset NHS Foundation Trust!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like a diverse caseload that allows you to work in a variety of different settings? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset dietitians provide a wide range of specialist dietetic services in both the Acute and Community setting. So, you will be responsible for organising and managing a diverse caseload.&lt;/p&gt;\n&lt;p&gt;In the community setting, you will provide dietetic care to patients who have been referred by GPs and other HCPs for a range of long term conditions. You will get to do so in a variety of settings (community hospital, clinic and home setting).&lt;/p&gt;\n&lt;p&gt;As this post will require a significant amount of travel you will need to be able to travel efficiently to different places. The successful applicant will be entitled to a lease car through the Lease car Scheme. There will also be an element of home working, especially during the Covid period.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to have genuine opportunities to broaden your skill set and develop your career? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exceptional opportunity to gain broad clinical experience which will provide the post holder with an excellent base from which to develop your future professional career. You will have an opportunity to spend time with the specialist teams as part of your CPD. This post will also provide an excellent opportunity to gain experience of working in a Community/Mental Health setting.&lt;/p&gt;\n&lt;p&gt;We also actively encourage CPD so you will have the opportunity to study dietetics at Msc level!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the benefits of working in Somerset you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ideally, you will have proven experience within a nutrition and dietetics healthcare setting from your work or clinical placements, underpinned by a relevant degree/diploma and HPC registration.&lt;/li&gt;\n&lt;li&gt;You will have the ability to work independently as well as part of a supportive team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Whether you are a Band 5 looking to progress your professional career or a newly qualified dietitian ready to step up, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Hours of work: Full time - 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Alison Booth&lt;/p&gt;\n&lt;p&gt;Job title Deputy for Dietetics&lt;/p&gt;\n&lt;p&gt;Email address alison.booth@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07881845985&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mallard Court, Bridgwater, Bridgwater", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Community Dietitian (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242804", "validThrough": "2020-11-10T23:59:59+0000"}