{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-11-04T12:16:26+0000", "description": "&lt;p&gt;Senior cardiothoracic/pet Imaging Fellowship Programme&lt;/p&gt;\n&lt;p&gt;The Division of Imaging is excited to offer a post CCT fellowship programme in thoracic and PET imaging for a forward thinking and highly motivated individual to join our integrated clinical imaging team. The duration of the post will be for 12 months.&lt;/p&gt;\n&lt;p&gt;MFT is a relatively new Trust forming in 2017 and represents one of the largest Trust in the country. The Imaging Division works across two campuses based at WTWA (Wythenshawe, Trafford, Altrincham &amp; Withington) and Oxford Road Campus (Manchester Royal Infirmary &amp; RMCH). Both parts of the department are cohesive and friendly units which take pride in providing a high standard of care in an excellent major teaching hospital environment. Across the sites there are numerous tertiary referral services and a wide range of subspecialty areas of practice. The Trust is renowned for its tertiary thoracic services including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pioneering lung cancer RAPID diagnostic pathway&lt;/li&gt;\n&lt;li&gt;UK’s first commissioned lung health check programme&lt;/li&gt;\n&lt;li&gt;Regional mesothelioma, severe asthma and interstitial lung disease services and MDTs&lt;/li&gt;\n&lt;li&gt;Regional ‘difficult biopsy’ service provided by thoracic interventional radiologists&lt;/li&gt;\n&lt;li&gt;Acute cardiac services supported by a full complement of imaging services available and the Manchester Heart Centre&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The nuclear medicine directorate in partnership with the Christie NHS Trust provides the regional PET Imaging services and provides a fantastic opportunity for training in PET-CT for the successful applicant. The service is one of the most comprehensive in the country which includes the following: adult and paediatric oncology; cardiac perfusion, viability and cardiovascular infection/inflammation imaging; for dementia and epilepsy.&lt;/p&gt;\n&lt;p&gt;The MFT Imaging Department enjoys close links with the North West School of Radiology and the University of Manchester. There will also be opportunities to get involved in audit, clinical governance, service improvement and teaching activities. There are research opportunities available through the Trust’s close links with Health Innovation Manchester (HInM). For more information please see the job description.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Parthiban ArumugamJob titleConsultant Nuclear Medicine PhysicianEmail addressparthiban.arumugam@mft.nhs.ukTelephone number0161 276 6039&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuclear Medicine Centre, Mamchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Clinical Fellow - Nuclear Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255793", "validThrough": "2020-11-18T23:59:59+0000"}