{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-11-06T13:16:51+0000", "description": "&lt;p&gt;&lt;strong&gt;MANCHESTER ROYAL INFIRMARY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TRANSPLANT SURGERY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Fellow in General &amp; Transplant Surgery – 1 Year Fixed Term (2 posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Senior Clinical Fellow in General and Transplant Surgery. This post is based at the Manchester Royal Infirmary. The Department of Renal and Pancreas Transplantation is the largest unit in the country and is looking to appoint Clinical Fellows to join our great team for a period of a 1 year to aid in career progression and if appropriate build competencies towards an ST3 application. The post will focus on developing General Surgery competencies and portfolio development for this reason.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust is one of the largest NHS teaching trusts in Europe. It provides a wide range of general and specialist clinical services and is a base for excellence in medical education, training and research.&lt;/p&gt;\n&lt;p&gt;Manchester Royal Infirmary provides kidney and pancreas transplantation, encapsulating peritoneal sclerosis (EPS) surgery and islet treatment. In addition, there is a large service of General and endocrine surgery and we are also part of the National Organ Retrieval Service. Our transplant programme cares for both adults and children.&lt;/p&gt;\n&lt;p&gt;This appointment offers an excellent opportunity for candidates to gain experience in both transplant and general surgery with full participation in a rota at registrar level, including scheduled emergency lists and elective opportunities. This post is not recognised for postgraduate training, however there will be excellent exposure to elective and emergency surgery and there will be ample opportunities to develop skills. In addition, there will be opportunities to participate in audit and other activities to develop the successful candidate’s portfolio. This would include undergraduate and postgraduate teaching.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this opportunity further please contact Mr David van Dellen, Clinical Lead &amp; Consultant Transplant Surgeon by emailing David.vandellen@mft.nhs.uk or by telephoning 0161 276 3647.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr David van DellenJob titleClinical LeadEmail addressDavid.vandellen@mft.nhs.ukTelephone number0161 276 3647&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M139WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Senior Clinical Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259868", "validThrough": "2020-11-19T23:59:59+0000"}