{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T12:01:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a committed team player to join our Cancer Centre as a Cancer MDT Co-ordinator based at University Hospital Southampton NHS Foundation Trust (UHS).&lt;br /&gt;&lt;br /&gt;This role involves ensuring a smooth and effective progression through the process for cancer patients, both before and after their diagnosis. This is a pivotal role in giving our patients the service they deserve.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Cancer Centre is open 5 days a week, between 07:00 and 17:30, and currently employs 30 MDT (Multi-Disciplinary Team) Coordinators, covering 27 different cancer tumour sites.&lt;/p&gt;\n&lt;p&gt;Nearly all of our tumour sites are specialist referral sites for complex tumours, and currently receive over 1,700 referral requests a month from all over WESSEX and the Channel Islands.&lt;/p&gt;\n&lt;p&gt;The Management team for the cancer centre is based at the Princess Anne Hospital which sits alongside, and is part of Southampton General Hospital. This team consists of: The Cancer Centre Manager, Operations Manager, Service Support &amp; Admin Manager, Network Coordinator.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have demonstrable experience of working under pressure in an acute clinical environment and be able to meet deadlines and be able to effectively prioritise different tasks. &lt;br /&gt;&lt;br /&gt;Your interpersonal skills will enable you to be able to quickly forge good working relationships within the hospital and make you someone our patients can trust to effectively co-ordinate their care.&lt;br /&gt;&lt;br /&gt;You will also have administrative experience with excellent typing and report writing skills, and be able to demonstrate precise attention to detail.&lt;/p&gt;\n&lt;p&gt;You will be responsible for identifying any blockages or concerns in patient pathways, recommending solutions and changes to current processes to improve service delivery and compliance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Cancer MDT post will start on a Band 3 whilst completing in house training, and is then upgraded to a Band 4 once competencies are reviewed and tested. This is normally achieved within 8 to 12 months dependant on the candidate’s previous skills and ability to learn the in house systems.&lt;/p&gt;\n&lt;p&gt;This role is ideally suited for those candidates who are already working at a Band 3 level or above, and looking to develop themselves within the NHS, whilst actively working in and supporting multiple teams around them.&lt;/p&gt;\n&lt;p&gt;For further information, informal visits and enquiries are both welcomed and encouraged.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Tuesday, 08 December 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Beverley Rocca&lt;/p&gt;\n&lt;p&gt;Service Support &amp; Admin Manager – Cancer Centre&lt;/p&gt;\n&lt;p&gt;Beverley.Rocca@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 8208 / 4170&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Cancer MDT Co-ordinator - Progressive Band 3 - 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257550", "validThrough": "2020-11-19T23:59:59+0000"}