{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 Per annum, Pro rata part time"}}, "datePosted": "2020-10-16T16:01:21+0100", "description": "&lt;p&gt;Community Health Newham – Children and Young People’s Services.&lt;br /&gt;Community Paediatric Dietitian Band 6 (Fixed term til mid Sept 2020,&lt;br /&gt;negotiable hours) - Caring for children with dietetic needs in the community&lt;br /&gt;You need to have experience working with NHS paediatric dietetics,&lt;br /&gt;holding a current HCPC registration to be considered for this post.&lt;br /&gt;Please note this is not a mental health post.&lt;br /&gt;&lt;br /&gt;Are you an experienced paediatric Dietitian looking for a new challenge&lt;br /&gt;in the community setting? If so we have the perfect job for you! Come and&lt;br /&gt;work for us and gain fantastic skills working in our Nutritional Support dietetic&lt;br /&gt;team based within our community children’s nursing service. You will gain&lt;br /&gt;skills assessing and advising children with dietetic requirements within clinic&lt;br /&gt;settings. Your caseload would primarily be children and young people with&lt;br /&gt;Autism and Attention Deficit Hyperactivity Disorder (ADHD) amongst other&lt;br /&gt;clinical conditions. The focus of our service is enabling children (and their&lt;br /&gt;families) to have as much care as possible outside the hospital setting and&lt;br /&gt;you can help us to achieve this by joining our team.&lt;br /&gt;&lt;br /&gt;You are required to have skills in paediatric dietetic assessment and&lt;br /&gt;treatment programmes, managing the dietetic treatment for children with&lt;br /&gt;complex needs requiring dietetic intervention and nutritional support in the&lt;br /&gt;community setting. You need to be confident in making recommendations to&lt;br /&gt;GP’s on appropriate prescribing of oral nutritional supplements and enteral&lt;br /&gt;feeds alongside the ability to work as part of a multidisciplinary, multi agency&lt;br /&gt;team. Good communication skills are a must alongside a flexible and forward&lt;br /&gt;thinking attitude.&lt;br /&gt;&lt;br /&gt;We’re looking for a paediatric dietitian with a genuine commitment to work in&lt;br /&gt;partnership with children, young people and their families in order to provide&lt;br /&gt;evidence based holistic health care and making a positive difference to their&lt;br /&gt;lives. The Nutritional Support dietetic team forms part of the wider community&lt;br /&gt;children’s nursing service that provide technical and skilled care to children up&lt;br /&gt;to 18yrs (19yrs for palliative caseload) including nursing, play and psychology&lt;br /&gt;services.&lt;br /&gt;&lt;br /&gt;There is strong leadership in the service where you will be supported by a&lt;br /&gt;senior paediatric dietitian, clinical psychologist, practice development&lt;br /&gt;facilitator and community children’s matron.&lt;br /&gt;Newham is culturally the most diverse of all London boroughs, with people&lt;br /&gt;from a rich variety of ethnic, religious, and linguistic backgrounds. We have&lt;br /&gt;the third fastest growing population in England with 40% of the community&lt;br /&gt;being 0-24 years old and children and young people’s health services are at&lt;br /&gt;the centre of local developments.&lt;br /&gt;&lt;br /&gt;We believe to provide compassionate care to children and families we need to foster a culture of compassionate working relationships and leadership within the service. We are committed to staff support, supervisions and training and have access to peer support and psychology consultation from the psychology team within the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca DanielsEmail addressrebeccadaniels@nhs.netTelephone number0203 7387063Additional contact information&lt;/p&gt;\n&lt;p&gt;Rebecca Daniels, telephone 0203 7387063, email rebeccadaniels@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Appleby Health Centre  63 Appleby Road  London, E16 1LQ, Newham", "postalCode": "E16 1LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.511", "longitude": ".016262"}}, "title": "Community Paediatric Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230995", "validThrough": "2020-11-18T23:59:59+0000"}