{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096.00 - £110,683.00"}}, "datePosted": "2020-11-06T14:10:11+0000", "description": "&lt;p&gt;We are looking for 2 new colleagues to join our team in Acute Medicine at Royal Devon and Exeter hospital. We are a forward thinking group of doctors in a dynamic trust, able to effect changes in our service.&lt;/p&gt;\n&lt;p&gt;Our Same Day Emergency Care (SDEC) project is our way of innovating care here in East Devon. We wish to expand this service, which is how these new jobs arise. Come and join a team of enthusiastic doctors. We mostly have young families and promote part time working plus diverse portfolios to make our jobs sustainable.&lt;/p&gt;\n&lt;p&gt;South East Devon is a great place to live and bring up a family. We have outdoor appeal with our beautiful national parks and coastline. Exeter polls highlyas one of theUK’s best places to live. We arewell connected by road, rail and air.&lt;/p&gt;\n&lt;p&gt;Exeter has a conventional medium sized AMU (44 beds) and a newly developed SDEC area. Here we offer point of care ultrasound withrapid access to diagnostics and procedures.Suitable patients are processed by experienced middle grade doctors and ACP&#39;s. We are building our percentage of patients though same day care; this is where these new jobs come in.&lt;/p&gt;\n&lt;p&gt;Do have a look at the job description and contact us on 01392 402785 to register your interest.&lt;/p&gt;\n&lt;p&gt;We are committed to offering genuinely workable job plans, recognising that Acute Medicine is a challenging specialty. Exeter offers many non-clinical opportunities to make this a reality.&lt;/p&gt;\n&lt;p&gt;Salary range: £82,096.00 to £110,683.00&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Loucm Consultant in AMU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260058", "validThrough": "2020-11-20T23:59:59+0000"}