{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-22T15:15:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse – Temporary Staffing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Find your happy place working on our nurse bank……&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit qualified Registered Nurses with experience working on acute hospital wards, especially those who are looking for flexible hours to work in our friendly world renowned hospital.&lt;/p&gt;\n&lt;p&gt;We have lines of work available for anyone who would like consistent work, or we have flexible shifts in a range of different wards and departments on both sites. We have full time hours also available too.&lt;/p&gt;\n&lt;p&gt;We offer great rates, access to the NHS pension, full week induction programme, paid mandatory training and the supernumerary shadow shift to help orientate you. We have a nurse bank management team who will be your main link to the clinical areas; you will feel supported and part of the team from the very start.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To join, you must:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;* Currently be registered with the NMC&lt;/p&gt;\n&lt;p&gt;* Be eligible to work in the UK&lt;/p&gt;\n&lt;p&gt;* Pass an enhanced DBS check&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our nurses say…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“We are a dynamic, supportive and friendly team who care for patients undergoing cardiac investigations as well as cardiac and thoracic surgery”&lt;/p&gt;\n&lt;p&gt;“Your career goals are important to us and we believe in supporting our staff to develop their experience, knowledge and skills”&lt;/p&gt;\n&lt;p&gt;“We have a wonderful team of experienced nurses with a good team spirit”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our patients say…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“Excellent caring staff”&lt;/p&gt;\n&lt;p&gt;“Nothing was too much for them. The room was brilliant. Thank you all for giving me my life back”&lt;/p&gt;\n&lt;p&gt;“The staff make you feel at home - nothing is too much trouble for them - very friendly. For care and attention I would give them an A*. Even cleaning staff are friendly, helpful and very thorough. Have been happy with my stay at Papworth - but there is no place like home”&lt;/p&gt;\n&lt;p&gt;“I am very grateful for the care which I have received during my stay at Papworth hospital. Everyone here has been friendly, caring and encouraging to me through quite a traumatic time in my life”&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Regular shortlisting takes place and you will be contacted for a Skype interview if you are shortlisted for interview.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Staff Nurse B5 -Temporary Staffing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239077", "validThrough": "2020-11-29T23:59:59+0000"}