{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inclusive"}}, "datePosted": "2020-10-29T10:01:41+0000", "description": "&lt;p&gt;Endoscopy Sister/Charge Nurse&lt;/p&gt;\n&lt;p&gt;Band 7&lt;/p&gt;\n&lt;p&gt;Barking, Havering and Redbridge University Hospitals NHS Trust (BHRUT) is one of the largest acute trusts in the UK serving a population of 750,000 from a wide range of social and ethnic groups. The trust provides specialist trauma, oncology, neurosciences, hyper acute, stroke and critical care services. The Trust is recognised as a regional London Upper GI Cancer resection Centre by NHS England and has also become a standalone centre for Bowel Cancer screening. The Trust is one of the partners for the Mile End Early Diagnostic Centre.&lt;/p&gt;\n&lt;p&gt;The Digestive Diseases Centre (DDC) at BHRUT operates two Endoscopy units located at two different sites. The Endoscopy units are both JAG accredited and carry out over 18,000 endoscopic procedures annually. They offer a wide range of diagnostic and therapeutic procedures including gastroscopy, colonoscopy, complex polypectomy, ERCP, EUS, bronchoscopy, EBUS, bowel cancer screening, capsule endoscopy, and laser and GI physiology. We are supported by excellent specialist nurses in IBD, nutrition, hepatology, capsule endoscopy and upper and lower GI cancer.&lt;/p&gt;\n&lt;p&gt;The Endoscopy Units are expanding due to an increase in demand for endoscopy services. We are looking for enthusiastic, motivated, innovative individuals with a keen interest in developing their career in Endoscopy. We are investing to grow our team to increase our ability to meet demand. This is an exciting time to be part of an innovative and forward-thinking service. We are working towards 7 day working and extended opening times to accommodate the demand for the service.&lt;/p&gt;\n&lt;p&gt;You will join a highly specialised team of professionals who deliver a high standard of patient centred care. We have a supportive culture for all staff and by joining us now, you can play a role in shaping our organisation that continues to put patient care first. Endoscopy is an ongoing developing speciality and so ongoing training and education is offered to all staff.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who value Passion, Responsibility, Innovation, Drive and Empowerment who will bring a continuous focus to high performance and quality of care, working collaboratively with colleagues and the wider team.&lt;br /&gt;&lt;br /&gt;The successful applicants will have excellent interpersonal and communication skills and ability to use their initiative.&lt;/p&gt;\n&lt;p&gt;We fully support flexible working patterns and can accommodate weekend sessions as well as evenings. Part time requests are also welcome.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Petra Harriott-Edwards, Lead Nurse for Endoscopy on 01708 435000 ext 6742 or Email: on Petronilla.Harriott-Edwards@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made Olubukola Olayiwola, on 01708 435000 ext. 2295&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePetra Harriott-EdwardsJob titleEndoscopy MatronEmail addresspetronilla.harriott-edwards@nhs.netTelephone number6742&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clinical Diagnostic Unit, QH, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 7 Endoscopy Senior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247806", "validThrough": "2020-11-08T23:59:59+0000"}