{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-06T10:46:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Orthopaedic Consultant – Upper limb Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North West Anglia Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Reference &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for a Consultant Orthopaedic Surgeon with a sub-specialty interest in Upper Limb &amp; Hand Surgery. The successful applicant will join a team of 8 substantive Consultants at Hinchingbrooke Hospital and 16 consultants at Peterborough City Hospital who provide a wide range of Musculoskeletal services within the recently formed North West Anglia NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the existing upper limb team, which includes 3 Shoulder surgeons and 3 Orthopaedic Hand surgeons. There are also close ties with the Plastic Surgery team. The position will be based principally at Peterborough City Hospital however cross site working should be anticipated as a part of ongoing service reorganisation. Applicants will be required to demonstrate an enthusiasm for Upper limb and Hand Surgery. Post CCT experience in both Shoulder and Hand Surgery is essential, including Fellowship Experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to take a lead role in Medical Student Education. A track record in delivering high quality Student Education would be an advantage.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will participate in a general on call rota at Peterborough City Hospital, 1 in 14, with future plans to migrate all NWAFT acute services to Peterborough as outlined by Cambridgeshire STP. They should be able to deal with common adult and paediatric orthopaedic emergencies and liaise with specialist centres when appropriate. The post holder will participate in the management of acute hand injuries.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants will be required to demonstrate excellent team working, flexibility, adaptability and be able to integrate into a strong cohesive team to deliver operational performance. The surgeon will be expected to participate in all departmental activities including audit, clinical governance, research, and both undergraduate and post graduate teaching.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;North West Anglia NHS Foundation Trust is responsible for the delivery of a breadth of healthcare services over a wide geographical area. The trust comprises of three principle sites, namely Hinchingbrooke Hospital, Peterborough City Hospital and Stamford Hospital and delivers emergency care, elective inpatient operating and outpatient services. Some orthopaedic outpatient clinics from Hinchingbrooke are currently delivered at Ely &amp; Doddington. It is anticipated that some of the working week will be fixed however some sessions may remain flexible. Job planning will be in accordance with National and Trust policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should be aware that the Trust has recently merged and this has led to a considerable departmental expansion. It should be accepted that location and shape of services may continue to change in the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hospitals of the North West Anglia Trust are friendly and vibrant units with a reputation for excellence in the surrounding areas Geographically they are located at the junctions of south Lincolnshire, Rutland, East Northamptonshire and Cambridgeshire with beautiful surrounding countryside. There are excellent schools in the area. . Peterborough is large and rapidly growing city surrounded by beautiful market towns and villages in nearby countryside. It offers excellent schooling and quality of life and has first-rate transport links.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants need to be on the GMC Specialist Register or within 6 months of CCT at the time of interview. A successful candidate would be expected to be able to start in January 2021.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameOliver JakemanJob titleDivisional Operations ManagerEmail addressOliver.jakeman1@nhs.netTelephone number07715233740Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed by Mr Arpit Patel , Clinical Lead, MSK Division through his PA Ms Janet Sidwell – 01733677097&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Upper Limb Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259300", "validThrough": "2020-11-22T23:59:59+0000"}