{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pro rata"}}, "datePosted": "2020-11-06T10:00:46+0000", "description": "&lt;p&gt;&lt;span&gt;This is an excellent opportunity for a Speciality Doctor in Community Paediatrics with experience in Paediatric Audiology to join an enthusiastic group of AVM Physicians and Audiologists in a challenging but rewarding role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a post working as part of the Barnet and Enfield Audiovestibular Medicine (AVM) Team within the wider Audiology team provided by Whittington Health. Whittington Health is an Integrated Care Organisation working to build care pathways across traditional community and acute divides, so that children get optimal care wherever they are seen. As such it is our vulnerable children who we hope will benefit most from this model of service delivery.&lt;/p&gt;\n&lt;p&gt;The team provides a comprehensive diagnostic assessments of children from the ages of 6 months and 18 years across two north London Boroughs. Our patients are from a culturally diverse population with a multi-ethnic, bilingual and multilingual speaking communities as the case across London. We aim to provide high quality services which improve the health, well-being and independence of the people within our community. We are looking for a passionate Doctor to support the team and help us to provide an excellent paediatric Audiology service.&lt;/p&gt;\n&lt;p&gt;The post holder will join a team consisting of Consultants in AVM, Audiological Scientists, Audiologists, and a Specialist Registrar. They will be expected to participate in the clinical, educational and continuing professional development activities of the department, and the teaching of Specialist Registrars in training, medical students and other clinical staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name radha narayan, Job title Head of service for Audiovestibular Medicine&lt;/p&gt;\n&lt;p&gt;Email addressradha.narayan@nhs.net Telephone number 0203 316 1896 For further details or if you like to discuss the position, please contact Dr Radha Narayan, Head of Audiovestibular Medicine on 0203 316 1896 or via e-mail on radha.narayan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgware Community Hospital, edgware", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Specialty Doctor Audiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259134", "validThrough": "2020-11-08T23:59:59+0000"}