{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-04T13:01:31+0000", "description": "&lt;p&gt;An opportunity has arisen to appoint a Consultant in GI and HPB radiology with non-vascular intervention to the Radiology Department of Nottingham University Hospitals NHS Trust. The appointment would be to join a team of six full time equivalent GI / HPB radiologists at a Tertiary GI/HPB referral centre and University hospital as part of a wider 15 member body radiology group within a dynamic team of 60 consultant radiologists.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post would be a mixed role of diagnostic and interventional across both NUH campuses with close working relations with many clinical medical and surgical disciplines.&lt;/p&gt;\n&lt;p&gt;We are a Major Trauma Centre, the first Radiology centre in the East Midlands Radiology Consortium and a Tertiary referral centre for HPB, GI and Oncology.The post will have a commitment to support a range of services, including non-vascular interventional procedures, CT, MRI, plain radiograph reporting, ultrasound, multi-disciplinary team meetings and clinico-radiological meetings. There will be an on-call commitment to be discussed depending on the skill set of the successful candidate.&lt;/p&gt;\n&lt;p&gt;As part of our response to the COVID pandemic, all consultant radiologists will have the option of having a home reporting workstation facilitating remote working days, insourcing and on-call reporting.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to participate in under-graduate and post-graduate teaching and training and there will be opportunities for research working with the Biomedical Research Centre and Sir Peter Mansfield Imaging Centre at the University of Nottingham.&lt;br /&gt;&lt;br /&gt;Candidates must hold the Fellowship of the Royal College of Radiologists or an equivalent qualification, and must either be on the GMC Specialist Register, or within 6 months of anticipated receipt of a CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;Financial and practical support will be available for applicants who wish to complete a post CCT fellowship, either in the UK or abroad – up to a value of £5000 towards a fellowship or as part of the study budget following appointment. NUH would encourage this within the first 2 years of appointment. &lt;br /&gt;&lt;br /&gt;An appropriate period of experience with specialist diagnostic techniques and interventional training is desirable, as is a track record in research.&lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to visit the department and in the first instance contact the Clinical Lead for Body Intervention: &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameYutaro HigashiJob titleConsultant Body Radiologist LeadEmail addressyutaro.higashi2@nuh.nhs.ukTelephone number0115 9249924 X67122Additional contact information&lt;/p&gt;\n&lt;p&gt;Secretary Emma Bucknell 0115 9249924 X80490&lt;/p&gt;\n&lt;p&gt;Emma.Bucknell@nuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Town post, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Consultant Body Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255966", "validThrough": "2020-11-25T23:59:59+0000"}