{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 - £20,795 per annum pro rata"}}, "datePosted": "2020-11-04T14:00:55+0000", "description": "&lt;p&gt;The St Helens and Whiston Outpatients Department is looking for enthusiastic and self-motivated member of staff to ensure the smooth running of the Outpatients Receptions based at St Helens Hospital by providing comprehensive, efficient and high quality administrative and leadership services to the Reception Team.&lt;/p&gt;\n&lt;p&gt;This will involve prioritising and organising the day-to-day OPD clinic activities and deploying staff resources to appropriate OPD Clinic zones. Monitoring of Outpatient PTL reports and providing report feedback to OPD Reception Manager. Supervise daily time sheets, ensure cross cover working where appropriate, input pay roll, Reception training, support and mentoring.&lt;/p&gt;\n&lt;p&gt;This demanding role will require excellent time management and interpersonal skills. The successful candidate must be able to prioritise their own workload and that of others and will require a flexible approach to their duties. They must be able to communicate effectively with staff at all levels within the organisation. The successful candidate must have excellent IT knowledge and skills. Flexible working covering 3 session days and weekend work when required. Team Leader Qualification would be desirable.&lt;/p&gt;\n&lt;p&gt;A full job description and person specification listing duties and responsibilities for this role is attached.&lt;/p&gt;\n&lt;p&gt;This post will be subject to a Standard DBS disclosure.&lt;/p&gt;\n&lt;p&gt;Interview date to be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please be aware, that we may close a vacancy earlier than stated, should a sufficient number of applications be received, you are therefore advised to apply at your earliest convenience.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie FeatherstoneJob titleOPD Reception ManagerEmail addressjulie.featherstone@sthk.nhs.ukTelephone number01744 646733/0151 430 1919&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helens and Whiston Hospitals, St Helens", "postalCode": "WA9 3DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4405", "longitude": "-2.71946"}}, "title": "Outpatient Receptionist Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256120", "validThrough": "2020-11-11T23:59:59+0000"}