{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum Inc HCAS"}}, "datePosted": "2020-11-06T13:31:23+0000", "description": "&lt;p&gt;Band 7 Midwife with special interest in SAFEGUARDING case loading team .&lt;/p&gt;\n&lt;p&gt;Exciting opportunity for experienced Band 6 Midwife who is looking into progressing to Band 7 Midwife have risen in our Safeguarding Case loading team. We are looking for a midwife who has special interest in Safeguarding and is at least 2 years post qualified or more, motivated and dynamic midwife who has ability to influence others, manage change and who wishes to support teams implement the recommendations from Better births across our maternity unit. You must have experience of working across all clinical areas in maternity and should have experience of coordinating shifts in a clinical area.&lt;/p&gt;\n&lt;p&gt;We are looking for experience midwife with excellent interpersonal and clinical skills willing to embrace a new challenge. You will be a registered midwife with a degree or relevant experience, plus evidence of continuous professional development.&lt;/p&gt;\n&lt;p&gt;We have successfully implemented a number of continuity of carer and progressively increasing our continuity of care model, which have started to show positive outcomes for the mothers and babies, as well as great satisfaction from service users and midwives working under these teams.&lt;/p&gt;\n&lt;p&gt;If you have a strong desire to provide the best birth experience possible here’s the perfect opportunity to rise to that challenge. We are a Baby friendly Unit and we have great education team to support you during your transition into your new role.&lt;/p&gt;\n&lt;p&gt;As a Band 7 midwife that will be joining the safeguarding case loading team you will be working alongside multi professional teams providing clinical expertise, leadership, nurturing and supporting midwives and other team members to care for women whilst breaking down barriers that can inhibit women with socially complex lives accessing high quality maternity care.&lt;/p&gt;\n&lt;p&gt;We will be shaking up our maternity services to provide &lt;strong&gt;woman-centred, holistic&lt;/strong&gt; and autonomous models of care in which midwives and obstetricians are supported to provide continuity whilst developing relationships with the women under their care. We would like you to be a part of that journey with us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAbi JinaduAdditional contact information&lt;/p&gt;\n&lt;p&gt;Abiola Jinadu-07825011021&lt;/p&gt;\n&lt;p&gt;abiola.Jinadu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259933", "validThrough": "2020-11-20T23:59:59+0000"}