{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-29T08:16:00+0000", "description": "&lt;p&gt;Band 6 OT post with the development option for Band 5 progression into the post.&lt;/p&gt;\n&lt;p&gt;Are you an experienced Occupational Therapist with a clear understanding of how occupation can contribute to an individual’s recovery?&lt;/p&gt;\n&lt;p&gt;Does the idea of being part of a recovery college excite you?&lt;/p&gt;\n&lt;p&gt;The Assessment and Treatment Service provides community based mental health treatment for adults with complex mental health needs in Hastings and Rother.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Band 6 Occupational Therapist with a passion for working with this client group, to join our service. You will be working in a busy multidisciplinary team, managing your own caseload providing Occupational Therapy assessment and treatment.&lt;/p&gt;\n&lt;p&gt;The team works with a Recovery Approach and has an active Recovery College where our staff work with Peer Trainers to deliver a varied programme of courses.&lt;/p&gt;\n&lt;p&gt;We will provide you with a modern and friendly working environment, with regular Occupational Therapy clinical supervision and peer support. We will encourage you to complete regular training and help you to gain both generic and Occupational Therapy professional skills.&lt;/p&gt;\n&lt;p&gt;We are committed to taking Occupational Therapy students on placements and you will also be involved in the support and supervision of our Support Time&lt;/p&gt;\n&lt;p&gt;Recovery workers and Peer support workers.&lt;/p&gt;\n&lt;p&gt;You will bring us commitment, enthusiasm and the ability to work as part of an innovative team.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this opportunity, please contact Mair Reardon 01424 726553&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cavendish House, Hastings", "postalCode": "TN34 3AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8553", "longitude": ".583789"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247630", "validThrough": "2020-11-12T23:59:59+0000"}