{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-05T09:46:07+0000", "description": "&lt;p&gt;15 hours&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic, motivated, team player with excellent communication skills interested in pursuing a career in resuscitation training and have experience in paediatrics? We are seeking to appoint a suitably qualified and experienced person to join the present Resuscitation Department within the Corporate Centre.&lt;/p&gt;\n&lt;p&gt;In conjunction with the Resuscitation Department Manager the Resuscitation Officer (Paediatrics) will have responsibility to plan, organise and deliver training in basic, intermediate and advanced techniques of resuscitation in paediatrics (and adults) to all levels of staff throughout the Trust. The service also provides advice and support not only in education and training but acts as a professional resource and offers clinical advice on all aspects of resuscitation within the Trust.&lt;/p&gt;\n&lt;p&gt;The successful applicant must be qualified as a Registered Nurse (RN), Registered Sick Children’s Nurse (RSCN) or Registered Nurse (Child). He/she must have significant post registration experience including experience of caring for children in an acute care setting.&lt;/p&gt;\n&lt;p&gt;A current APLS/EPALS provider certificate is essential. An instructor qualification for Advanced Paediatric Life Support (APLS) is desirable. A current Advanced Life Support (ALS) instructor/provider certificate would be an advantage. The successful applicant will work across all hospital sites, but will be based in the Academic Centre at James Cook University Hospital.&lt;/p&gt;\n&lt;p&gt;A teaching certificate and teaching experience is advantageous.&lt;/p&gt;\n&lt;p&gt;If you are looking for a challenge and can demonstrate an innovative and pro-active approach to the job we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;The appointed candidate must successfully undertake pre-employment checks.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDonna CampbellJob titleResusciation Department ManagerEmail addressdonna.campbell4@nhs.netTelephone number01642 282864&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Paediatric Resuscitation Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257112", "validThrough": "2020-12-03T23:59:59+0000"}