{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-29T17:01:15+0000", "description": "&lt;p&gt;Community Nursing Teams&lt;/p&gt;\n&lt;p&gt;The Retford and Villages Integrated Care team provides long-term conditions management and Community Nursing services in Retford and Villages&lt;/p&gt;\n&lt;p&gt;We are looking for a Community Nurse to join our dedicated team who are committed and passionate about promoting health, well-being and independence. We are a values-based Trust and are looking for dedicated and enthusiastic clinicians who believe in the provision of patient-centered care.&lt;/p&gt;\n&lt;p&gt;A key aim of our service is to reduce unplanned admissions and facilitate discharges from the acute care environment. The team members include Physiotherapists, Occupational Therapists, Community Nurses and Support Workers, also working closely with GPs, social care and the voluntary sector.&lt;/p&gt;\n&lt;p&gt;The role requires a clinician with skills to assess patient’s needs, analyse and develop treatment plans within a multidisciplinary framework.&lt;/p&gt;\n&lt;p&gt;You will have a degree/diploma in Nursing and be NMC registered. You should possess excellent interpersonal and time management skills, be a good communicator and able to prioritise and work well as a member of a team. An induction period and supernumerary support will be given. The service currently runs from 8am – 6pm, 7 days a week, therefore some weekend and bank holiday working will be required.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Michael Harrison, Team Leader on michael.harrison@nottshc.nhs.uk or 01159691300 ext 11671&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information: Zoe Read on 07785398909&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Retford and Worksop, Retford and villages, Larwood and Bawtry", "postalCode": "DN22 7XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3255", "longitude": "-.950902"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249180", "validThrough": "2020-11-08T23:59:59+0000"}