{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-02T10:46:06+0000", "description": "&lt;p&gt;We are looking for Registered Operating Department Practitioners / Nurses to join the Anaesthetic Care Unit based in Chorley; we welcome experienced qualified individuals and offer a supportive and nurturing environment where individual contribution is recognised. Critical care or Anaesthetic experience working has a band 6 would be beneficial, you must be able to demonstrate clinical knowledge, skills and have leadership and management experience.&lt;/p&gt;\n&lt;p&gt;Within this role you will work closely with dedicated clinical team who strive to continuously improve and welcome original and creative ways of working and are always open to new and improved ways or working.&lt;/p&gt;\n&lt;p&gt;Here at Lancashire teaching hospitals NHS trust we are fully dedicated in providing, truly holistic care and team working, as captured within our Trust Values – being caring and compassionate, recognising individuality, seeking to involve, building team spirit and taking personal responsibility.&lt;/p&gt;\n&lt;p&gt;We aim to combine this proactive caring approach with creativity, innovation and research based intervention. Due to expansion, there are a number of fantastic opportunities within the Surgical Division including, the development of a Post Anaesthetic care unit.&lt;/p&gt;\n&lt;p&gt;We are the Regional Major Trauma centre and also boast robotic theatres, interventional radiology, specialist neurosurgical theatres and a vast array of specialty theatres and services.&lt;/p&gt;\n&lt;p&gt;Are you motivated, enthusiastic and dynamic? If so your next position may be waiting for you at Lancashire Teachings Hospitals Trust.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Interview Date: To be confirmed &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Michele McLoughlin : Lead Matron - 07590460304 / michele.mcloughlin@lthtr.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chorley and Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Senior Operating Department Practitioner or Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251649", "validThrough": "2020-11-16T23:59:59+0000"}