{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-27T10:02:28+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The band at which the pharmacy technician will commence in post is dependent upon initial qualifications on appointment. If the pharmacy technician has both accuracy checking and a medicines optimisation qualification at/or equivalent to the Pharmacy Workforce Development South medicines optimisation qualification, they will commence as a band five.&lt;/p&gt;\n&lt;p&gt;If the pharmacy technician has one or none of these qualifications, then they will commence as band four.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder must by willing to work towards the qualifications of accuracy checking and medicines optimisation if they do not hold them&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To contribute actively and constructively towards a working environment that encourages teamwork, mutual support and excellence in service delivery&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To participate in the late rota within the dispensary&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To work across multiple sites within Berkshire Healthcare NHS Foundation Trust, this includes all in-patient settings and clozapine clinics&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Jennifer Nunn on 07770 334937 or email: Jennie.Nunn@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pharmacy Dept - Prospect Park Hospital, Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243941", "validThrough": "2020-11-08T23:59:59+0000"}