{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa. Incl of HCAS (15%)"}}, "datePosted": "2020-11-03T15:01:07+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Acute Stroke Unit &lt;/strong&gt;&lt;/span&gt;&lt;span&gt;&lt;strong&gt;Advanced Occupational Therapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting post has arisen for an enthusiastic and highly motivated Band 6 Occupational Therapist to join the dynamic multidisciplinary team on the Acute Stroke Unit (ASU) in providing holistic, patient-centred Occupational Therapy that empowers patients to achieve their goals. The post offers the opportunity to further extend your knowledge and skills in stroke care and to actively contribute to developing the Occupational Therapy service in this specialist area.&lt;/p&gt;\n&lt;p&gt;You will be part of the wider Occupational Therapy team which embraces change to ensure practice is in line with current evidence-base, national and local polices, and within the scope of professional standards. The team prides itself in its positive working culture, where effort is acknowledged, differences are respected and opportunities for progress are facilitated. Lifelong learning and career mapping is supported by regular supervision, annual appraisals, a new senior CPD teaching programme, and access to some funding for external training courses.&lt;/p&gt;\n&lt;p&gt;You will also be expected to contribute to the weekend and bank holiday rota via our Bank Partners.&lt;/p&gt;\n&lt;p&gt;Just like anywhere in the UK health economy, we are aiming towards seven day working so this is likely to become part of your job description in the future.&lt;/p&gt;\n&lt;p&gt;For further information or informal visits, please contact ASU OT Team Lead Christine Mithen on 020 8934 3634 or cmithen@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristine MithenJob titleASU OT Team LeadEmail addresscmithen@nhs.netTelephone number020 8934 3634&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital, Kingston-upon-Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Advanced Occupational Therapist – Acute Stroke Unit (ASU)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254466", "validThrough": "2020-11-17T23:59:59+0000"}