{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-11-05T14:46:43+0000", "description": "&lt;p&gt;We are looking for keen enthusiastic registered nurses, experienced or newly qualified to join our team. &lt;br /&gt;&lt;br /&gt;Pasteur Ward is a 28 bed hyper-acute stroke unit which provides specialist treatment and care for patients immediately following a stroke; the pathway starts in A&amp;E where patients are seen by our stroke specialist nurses and stroke doctors who provide thrombolysis assessment, initial rapid brain imaging and high standard stroke care. &lt;br /&gt;&lt;br /&gt;The focus of their role is to facilitate a prompt triage to Pasteur ward for immediate hyper acute care for the first 72 hours post stroke. We have 8 cardiac monitored beds on Pasteur ward delivering level 2 care for the first 72 hrs of the patient’s stroke. &lt;br /&gt;&lt;br /&gt;Basildon and Thurrock university hospital are one of the 19% of stroke units within the United Kingdom that are achieving an overall ‘A’ score in the Sentinel Stroke National Audit Programme (SSNAP), which indicates a world class stroke service. We work closely with the stroke thrombolysis team and you will receive training and guidance in many areas such as tracheostomy care, cardiac monitoring, nasogastric insertion and feeding, central venous catheter care and undertake the immediate life support course. &lt;br /&gt;&lt;br /&gt;If you are interested in developing your career and specialise in stroke or would like a new challenge in your career, please apply now or arrange an informal visit to see how we work in the stroke unit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePam MagtibayJob titleSenior Sister / Unit ManagerTelephone numberTel: 01268 524900 Ext 4616&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon &amp; Thurrock, Basildon", "postalCode": "SS15 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5689", "longitude": ".423672"}}, "title": "Staff Nurse - Pasteur Ward (Hyper Acute Stroke Unit)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258179", "validThrough": "2020-11-19T23:59:59+0000"}