{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T14:30:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Outstanding – Our journey continues&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In North Staffordshire CAMHS we are looking to expand our non-medical provision, and are seeking to appoint an Independent Nurse Prescriber to work in our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;The North Staffs CAMHS team is a well-established multi-disciplinary team that works with children and young people aged 0 – 18 years. There are professionals from a range of backgrounds in the team, including psychiatry, nursing, psychology, social work and CBT therapists. The team is one of three community CAMHS teams in the region.&lt;/p&gt;\n&lt;p&gt;We are looking for an Independent Nurse Prescriber who has a Post registration training/qualification in Independent and Supplementary Non-Medical Prescribing, enjoys being a part of a multi-disciplinary team, has experience of working in a CAMHS setting and is committed to delivering high quality services for children, young people and their families. North Staffordshire Combined Healthcare Trust operates flexible working for staff which includes working from home, as well as from a base, to deliver CAMHS services. We are keen to explore new and innovative ways of meeting the needs of the children, young people and families who access our services.&lt;/p&gt;\n&lt;p&gt;Stoke-on-Trent is a unique city in England. It is made up of six distinct towns – affectionately known as &quot;THE POTTERIES&quot;. It has excellent commuter links but benefits from being within easy reach of beautiful countryside.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal chat please contact Carol Hinds, Team Leader at CarolA.Hinds@combined.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarol HindsJob titleTeam LeaderEmail addresscarolA.hinds@combined.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dragon Square, Chesterton, Stoke-on-Trent", "postalCode": "ST5 7HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0439", "longitude": "-2.2517"}}, "title": "Independent Nurse Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244961", "validThrough": "2020-11-10T23:59:59+0000"}