{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-29T16:16:11+0000", "description": "&lt;p&gt;Applications are invited for enthusiastic, motivated and committed individuals to join our friendly and dynamic team within the Respiratory department at Ipswich Hospital part of East Suffolk and North Essex NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We’re an ambitious NHS trust committed to removing unnecessary stress and frustration for you and your patients, providing you with more time to care and make the most of your skills. If your ambition matches ours, we’d love to hear from you - come and join us!&lt;/p&gt;\n&lt;p&gt;We have two posts available for the role of Consultant Physician in Respiratory Medicine. This post is for 10 PAs, plus on call supplement. Flexible / part time applications will be considered.&lt;/p&gt;\n&lt;p&gt;Ware looking for individuals able to run subspecialty respiratory medicine for a population of over 800,000. We wish to develop existing specialist sleep and NIV services and create specialty services in lung cancer and intervention, Bronchiectasis, lung infection, and asthma. Individuals with an interest in any of these sub-speciality areas would be considered. Our department has 2PA of time for teaching of medical students and so an application from a candidate with a particular interest in medical education would be welcomed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jonathan Douse - Clinical Lead for Respiratory Medicine and Clinical Sub-Dean for University of Cambridge and Norwich Medical School&lt;/p&gt;\n&lt;p&gt;Email address: Jonathan.Douse@esneft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01473 703779 / 703508&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich Hospital, Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Consultant in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249052", "validThrough": "2020-11-29T23:59:59+0000"}