{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-15T09:46:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Doncaster &amp; Bassetlaw Teaching Hospitals NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Children and Families Division&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Community Paediatrician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Come and play your part in delivering a modernised and expanded Community Paediatrics service for Doncaster and Bassetlaw&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBTHFT works closely with the local CCGs to ensure an integrated approach to children’s services, and they have made a significant investment (over £1m of additional funding) in the Community Paediatrics service. The service has been redesigned with full clinical input and we have implemented new patient pathways.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are offering a full time substantive Consultant Community Paediatrician post to join our committed Community team. This new post will help us to provide a comprehensive community child health and neurodevelopment service. The post holder will be involved in providing neurodevelopment clinics, and duties in relation to Looked After Children, adoption and fostering. Successful candidates will have CCT in Community Paediatrics and a minimum of one year’s experience in Neurodisability and Community Child Health, including management of children with ASD and ADHD, EHCP, Looked After Children and Community Child Health. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join an established team of Consultant Community Paediatricians, sharing responsibility for the delivery of an integrated paediatric service for the population of the Doncaster Metropolitan Borough in South Yorkshire and the Bassetlaw District in North Nottinghamshire. You will be involved in providing comprehensive services from Doncaster Royal Infirmary and Bassetlaw Hospital in Worksop, Nottinghamshire, making a real contribution at a time of significant service development.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the General Medical Council Specialist Register or within six months of being admitted to the Register for trainees if in a training programme within the UK. In accordance with the regulations all other categories of doctors must be on the GMC Specialist Register to be considered for a consultant appointment by the Advisory Appointments Committee. Applicants must continue to hold a License to Practise&lt;/p&gt;\n&lt;p&gt;For an informal discussion, contact Dr Bushra Ismaiel, Lead for Community Paediatrics, email bushra.ismaiel1@nhs.net or by telephone on 01302 642303 or Mrs Helen Burroughs, General Manager, email helen.burroughs3@nhs.net or by telephone on 01302 642203.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Bushra Ismaiel Job title: Community Paediatrics Clinical Lead Email address: bushra.ismaiel1@nhs.net Telephone number: 01302 642303&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Helen Burroughs 01302 642203&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BDGH, Worksop", "postalCode": "S81 0BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Consultant Community Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227567", "validThrough": "2020-11-06T23:59:59+0000"}