{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30661", "minValue": "30661", "unitText": "YEAR", "value": "Up to £30,661.20 Depending on Experience"}}, "datePosted": "2020-09-25T12:44:23+0100", "description": "&lt;h2&gt;Join us today at Priory Hospital Barnt Green and receive our £5000 welcome to Priory bonus&lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;Are you?&lt;/h2&gt;\n&lt;p&gt;A driven and dynamic Nurse?&lt;br /&gt;An experienced RMN or wanting to return to the profession after a career break?&lt;br /&gt;Wanting to make a difference to someone’s life?&lt;br /&gt;Ready for a new challenge?&lt;br /&gt;Wanting to work with the best nurses in the UK?&lt;/p&gt;\n&lt;p&gt;If you’ve answered yes to the above then get in touch with our Nurse Recruiter Adam O&#39;Shea today on 07834514945. &lt;strong&gt;About Lickey Hills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Priory Healthcare will be opening a new hospital set in the beautiful surroundings of Lickey Hills, to the south of Birmingham, in late October 2020. The hospital will provide services for both NHS and private patients, with a range of mental health conditions.&lt;/p&gt;\n&lt;p&gt;The service will comprise of 3 wards: a 10-bed adult Psychiatric Intensive Care Unit (for adult men), a 12 bed adult Acute ward and a 12 bed Private Acute ward. The service will take a multi-disciplinary approach to delivering personalised treatment programmes to our in-patients as well as offering a Private Outpatient service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the opportunity to play a leading role in starting up this new service, leading a new staff team and extending Priory’s established reputation for delivering the highest standards of care to a new site and broadening Priory’s provision of services in the Birmingham area, alongside it’s well established services at Woodbourne Priory Hospital and the Birmingham Wellbeing Centre.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Roles :&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have Staff Nurse and Senior Staff Nurse opportunites as well as flexible working options including Full Time, Part Time and Bank.&lt;/p&gt;\n&lt;p&gt;If you are looking for an employer that’s passionate about supporting your career progression, where you can shape and lead a committed, diverse and values-driven site team, and you share our passion for delivering outstanding care to make a real and lasting difference to patients’ lives, then this role presents an excellent opportunity for you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lickey, Birmingham", "postalCode": "B45 8ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3769", "longitude": "-2.00628"}}, "title": "Registered Nurse - RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916200578", "validThrough": "2020-11-30T23:59:59+0000"}