{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-06T12:46:05+0000", "description": "&lt;p&gt;Are you looking for an opportunity to work within Occupational Therapy in the acute setting?&lt;/p&gt;\n&lt;p&gt;Are you a dynamic and enthusiastic individual who likes to work within a team and help care for our patients? If so, this is the post for you.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join a dynamic and forward thinking Occupational Therapy Team who are passionate about the evolving role of the Occupational Therapist in the acute hospital setting.&lt;/p&gt;\n&lt;p&gt;This post will predominantly work across our hospital sites in Burton, Lichfield and Tamworth and will offer exciting rotational opportunities to support with development of core Occupational Therapy skills and career progression. These rotations will include: Acute Medicine, Surgery, Orthopaedics, Emergency Pathway (ED, Acute Assessment and Short Stay), Stroke, Acute Inpatient Rehab within the Community Hospitals and Outpatient Hands and Rheumatology.&lt;/p&gt;\n&lt;p&gt;We ask that you have excellent communication and interpersonal skills and a commitment to providing high quality care.&lt;/p&gt;\n&lt;p&gt;You will be required to contribute to a 7 day extended hour service.&lt;/p&gt;\n&lt;p&gt;You need to hold a full clean driving licence to be able to move between sites if required.&lt;/p&gt;\n&lt;p&gt;This is a full time, 37.5 hours per week role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Opportunities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development of basic assessment and treatment skills to work within the acute site, to include patients with a wide variety of conditions.&lt;/li&gt;\n&lt;li&gt;Development of skills to enable close MDT working and discharge planning in a high pressured environment.&lt;/li&gt;\n&lt;li&gt;Contribute to support student Therapists.&lt;/li&gt;\n&lt;li&gt;Support service improvement projects.&lt;/li&gt;\n&lt;li&gt;Support clinical and team audit, including notes audits, stats audits and compliance with team clinical standards audits.&lt;/li&gt;\n&lt;li&gt;Experience working within established Multi-disciplinary Teams&lt;/li&gt;\n&lt;li&gt;Experience and support with discharge planning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are a friendly and supportive team who can offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support from Therapy Inpatient Lead, Band 7 Team Leaders and Senior Rotational Therapists within the team, including regular clinical supervision.&lt;/li&gt;\n&lt;li&gt;Supported to provide high quality patient care including basic assessment and treatment to a caseload of patients.&lt;/li&gt;\n&lt;li&gt;PT/OT joint working.&lt;/li&gt;\n&lt;li&gt;Support to attend appropriate in service training opportunities and courses to maintain competencies and to achieve personal development plans.&lt;/li&gt;\n&lt;li&gt;Trust commitment to CPD, demonstrated by yearly appraisal.&lt;/li&gt;\n&lt;li&gt;Preceptorship&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHP&#39;s&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date of applications- 18 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date - 2 December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises; this includes Covid-19 secure areas. If you have Covid-19 related symptoms or you have been instructed to self-isolate by track and trace and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Letitia Butler - Therapy Inpatient Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01283 511511 ext 3037&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital Burton, Burton-on-Trent", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259746", "validThrough": "2020-11-18T23:59:59+0000"}