{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa pro rata"}}, "datePosted": "2020-11-04T15:16:17+0000", "description": "&lt;p&gt;LOCUM CONSULTANT GERIATRICIAN TO JOIN FRONT DOOR FRAILTY TEAM&lt;/p&gt;\n&lt;p&gt;Hours: 8 PAs&lt;br /&gt;&lt;br /&gt;Job Type: Fixed Term until September 2021&lt;/p&gt;\n&lt;p&gt;Location: Bristol Royal Infirmary and South Bristol Community Hospital&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;University Hospitals Bristol &amp; Weston Foundation Trust wishes to appoint a Locum Consultant Physician/Geriatrician at the Bristol Royal Infirmary (BRI). Applicants wishing to work less than full time or to job share are also encouraged to apply.&lt;/p&gt;\n&lt;p&gt;The “Front Door” Frailty team at the BRI comprises consultants, an associate specialist, a pharmacist, ACP and ANPs. The team works in ED, the Acute Medical Unit and the Older Person’s Assessment Unit (OPAU) providing initial assessment of frail, older adults. Working with community services they aim to reduce admissions and expedite early discharges.&lt;/p&gt;\n&lt;p&gt;It is an exciting time for this new team which was only set up in February 2020. This post will join the team of 8 whole time equivalent consultants in the Department of Medicine for Older People and Stroke Medicine. The post holder will be expected to do some ward rounds on OPAU and occasional cross cover for annual leave on the Care of the Elderly core wards. The post includes a commitment to the general medical take (currently 1:20).&lt;/p&gt;\n&lt;p&gt;The Bristol Royal Infirmary (BRI) is a major University Hospital and the new consultants will be committed to delivering excellent teaching and training. The BRI is situated in the city centre, adjacent to the regional centres for Paediatrics, Ophthalmology, Oncology and Cardiac Surgery and within 5 minutes walk of the maternity hospital and medical school.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the GMC Specialist Register or within 6 months of their CCT&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date for Interview: TBC &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates should note that if successful in being shortlisted, an invitation to attend interview will be sent. Candidates not shortlisted will be notified by letter.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda CooperAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Clare Holmes, Clinical Lead for Medicine for Older people, Tel: 0117 342 1313&lt;/p&gt;\n&lt;p&gt;Dr Emma Kate Reed Clinical Director Division of Medicine Tel: 0117 342 1313&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Locum Consultant In Care Of The Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256384", "validThrough": "2020-11-18T23:59:59+0000"}