{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa pro rata"}}, "datePosted": "2020-10-30T15:45:57+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is an exciting opportunity to join the CATCH team as team lead. The successful candidate will be joining an established team providing a valued community service.&lt;/p&gt;\n&lt;p&gt;The Care, Assessment and Treatment of Children at Home (CATCH) team works with GPs, EMAS (East Midlands’ ambulance service) acute services and other healthcare practitioners to manage acutely unwell children in their own home. CATCH work in partnership with Children&#39;s community nurses and other members of Specialist Children&#39;s services. The team operates from 8am to 9pm, 7 days a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Team Lead will work in partnership with the service manager and clinical lead to ensure that the highest possible standards of practice and service delivery are maintained. As part of this, the post-holder will have a key role of managing clinical and non-clinical operational systems and processes within the team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They will use their management experience to lead on service changes and developments and contribute at a local level to the development and implementation of policies and procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They will lead a team, with involvement in service coordination, staff wellbeing, supervision, complaints, governance and service performance and improvement.&lt;/p&gt;\n&lt;p&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working as part of the team to provide leadership and promote a culture that is reflective of the trusts values.&lt;/li&gt;\n&lt;li&gt;Working as part of the team and in partnership with children and families/carers to implement individualised care&lt;/li&gt;\n&lt;li&gt;Will carry a caseload and act as lead professional as appropriate.&lt;/li&gt;\n&lt;li&gt;Supports other grades of staff in gaining knowledge and skills to enable high quality care for children is maintained.&lt;/li&gt;\n&lt;li&gt;Undertakes management duties to enable the performance and quality goals of the team to be achieved.&lt;/li&gt;\n&lt;li&gt;Provides clear leadership and acts as a role model&lt;/li&gt;\n&lt;li&gt;Adhere to protocols/policies at all times and support staff members with Safeguarding issues&lt;/li&gt;\n&lt;li&gt;The post-holder will be required to deputise from time to time for the Service Manager&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Richard Lindsley&lt;/p&gt;\n&lt;p&gt;Job title Service Manager&lt;/p&gt;\n&lt;p&gt;Email address richard.lindsley@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07917788310&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Nikki Rickard&lt;/p&gt;\n&lt;p&gt;nickola.rickard@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;07716 959202&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sudborough House, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Team Lead - Care Assessment and Treatment of Children at Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250810", "validThrough": "2020-11-15T23:59:59+0000"}