{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T13:16:01+0000", "description": "&lt;p&gt;The Criminal Justice Liaison &amp; Diversion Service (CJLDS) is a countywide service to Kent and Medway’s Police custody suites, Crown and Magistrates Courts and the wider community.&lt;/p&gt;\n&lt;p&gt;CJLDS is an all age service, providing liaison and diversion both within and out of the Criminal Justice System. We assess individuals over the age of 10, suspected of committing a crime, with identified health and social care vulnerabilities. The aim of the service is to reduce rates of re-offending and assist in the efficient and effective movement through the Criminal Justice System, by improving access and engagement with health and social care services.&lt;/p&gt;\n&lt;p&gt;We are a multidisciplinary team consisting of Mental Health Nurses, Social Workers and Liaison and Diversion Workers. We work closely with the Police, Courts, Youth Offending Teams, CYPMHS, Drugs and Alcohol Services, Probation, Housing and many more health and social care services.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a forward thinking and enthusiastic person to a new, exciting and diverse Specialist Speech and Language Therapist position within the Criminal Justice Liaison &amp; Diversion Service (CJLDS). You will have specialist knowledge of Speech, Language and Communication Needs (SLCN) for adults and children. You will provided face to face assessment of individuals with SLCNs, going through the criminal justice system, in order to share recommendations with the courts and the wider team.&lt;/p&gt;\n&lt;p&gt;CJLDS operates across custody suites, courts and community sites covering the whole of Kent and Medway, some of which are located in remote areas. Therefore, ability to travel across a wide geographical area in a timely and flexible manner in accordance with the needs of the job is essential.&lt;/p&gt;\n&lt;p&gt;In return you will be provided with a comprehensive induction program within all the areas of practice. We will offer full support in the form of supervision, appraisal and personal development plans as well as a real investment in your training and development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHolly BrownAdditional contact information&lt;/p&gt;\n&lt;p&gt;Peter Griffin on 07737 994 662 or 01622 722374&lt;/p&gt;\n&lt;p&gt;Holly Brown on 07880 130 293 or 01622 722374&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Custody / Court, Countywide service", "postalCode": "ME16 9NW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2709", "longitude": ".481375"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250321", "validThrough": "2020-11-15T23:59:59+0000"}