{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42500", "minValue": "39390", "unitText": "YEAR", "value": "£39,390 - £42,500"}}, "datePosted": "2020-11-05T11:04:04+0000", "description": "&lt;p&gt;Everyone’s Turning Point is unique. It’s the moment when they realise they’ve made a small, but important, step forward. Very often, that small step is the start of something bigger. But only when the right support, advice and services are in place. That’s where you come in, working as part of Turning Point to deliver our highly successful and innovative ‘Improving Access to Psychological Therapies’ (IAPT) delivery model.&lt;/p&gt;\n&lt;p&gt;Turning Point has exciting new opportunities in our new service in Luton for experienced CBT’s. This is a growing service, and as such we will be recruiting for all roles over the next 12 months.&lt;/p&gt;\n&lt;p&gt;In return, you’ll enjoy the scope and support to enhance your own life and career too, as you gain the experience and training you need to progress in your career with us. You will also be able to make use of our digital platform to work remotely where available.&lt;/p&gt;\n&lt;p&gt;We support people who are having difficulty in coping and who may be suffering from a common mental illness such as depression, anxiety or phobias. Our approach embeds the notion of well–being and recovery and promotes personal responsibility for lifestyle choices and self–management of mental well–being. For our clients, this has resulted in a highly accessible and user–friendly service available across a wide geographical area.&lt;/p&gt;\n&lt;p&gt;The Service in Luton will provide person-centred, holistic, and accessible wellbeing services which are flexible and creative, easy to access and navigate and responsive to the needs of local people. It will enhance and protect the health and wellbeing of the population of Luton and improve the health of the poorest fastest.&lt;/p&gt;\n&lt;p&gt;The service will contribute to tackling inequalities in health through promoting and supporting people to develop healthier behaviours and lifestyles in the context of their own local communities. It focuses on engaging with individuals in communities and offering them practical support to change their behaviour to achieve their own choices and goals and achieve greater personal resilience stability.&lt;/p&gt;\n&lt;p&gt;We are now looking to recruit High Intensity CBT Therapists, with a qualification in Cognitive Behavioural Therapy and BABCP accreditation, or HCPC registered Clinical or Counselling Psychologists with strong CBT training and experience who are BABCP accredited or eligible for accreditation. Alongside extensive experience of working within Mental Health, you’ll have a proven ability to develop good therapeutic relationships with clients and working relationships with your colleagues. You’ll manage your own caseload working towards both service and individual targets, having an IAPT Supervision Course under your belt would be helpful too– but not essential. Excellent opportunities for both CPD and clinical innovation are available within the service.&lt;/p&gt;\n&lt;p&gt;If you’re inspired by the social model of mental health that works holistically according to need rather than diagnosis and would like to help us achieve our vision, we can offer a competitive remuneration package and excellent training and development opportunities. Our benefits package also includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;‘My Turning Point’ bespoke Reward Discount Scheme sharing a range of online range of offers and discounts including shopping vouchers, discounts on gas and electric bills, gym scheme discounts, up to 55% off the cost of cinema tickets and much more!!&lt;/li&gt;\n&lt;li&gt;You may also benefit from our Childcare Voucher scheme, our bike to work scheme, season ticket loans and much more!&lt;/li&gt;\n&lt;li&gt;Receive a £200 bonus for recommending a friend to work for us if they’re employed&lt;/li&gt;\n&lt;li&gt;Inspired by Possibility Employee of the Year scheme – in recognition of your excellence&lt;/li&gt;\n&lt;li&gt;Life assurance scheme for all team members and enhanced contributory Pension scheme&lt;/li&gt;\n&lt;li&gt;Free access to the Employee Assistance Programme (EAP) with a 24/7 helpline for advice – also available to family members.&lt;/li&gt;\n&lt;li&gt;Online Right Steps Health &amp; Wellbeing Support package to all our team members. Information and evidence based support you can trust about low mood and anxiety, drugs and alcohol, healthy eating, stress at work and physical activity&lt;/li&gt;\n&lt;li&gt;Competitive rates of pay with annual Pay Reviews&lt;/li&gt;\n&lt;li&gt;Annual Holiday allowance – Buy and sell annual leave options to suit your lifestyle&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/home life balance&lt;/li&gt;\n&lt;li&gt;Excellent training opportunities leading to career development – ongoing access to a huge range of training and support to help you develop. We provide a thorough induction and training program when you join us. In addition to regular 1-2-1’s and annual appraisals, we’ll help you develop and progress your career.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are an experienced High Intensity Cognitive Behavioural Therapist and are looking for an exciting career opportunity we would love to hear from you!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton", "postalCode": "LU2 0JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8856", "longitude": "-.408859"}}, "title": "High Intensity CBT Therapist - Total Wellbeing Luton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257363", "validThrough": "2020-12-03T23:59:59+0000"}