{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T11:17:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Early Intervention in Psychosis Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time 37.5 hours.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to recruit a community care coordinator (at Band 6 or equivalent) to join our multi-disciplinary Early Intervention in Psychosis team. The position is available to Nurse, AHP or Social Work disciplines.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have significant post qualification experience working in a mental health setting.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a well-established and supportive multidisciplinary team in care coordinating patients who have been assessed as having First Episode Psychosis or an At Risk Mental State.&lt;/p&gt;\n&lt;p&gt;Early Intervention in Psychosis teams are based upon recovery-focused principles and underpinned by positive risk-taking, aiming to create the conditions where better outcomes and improved safety can be achieved for patients and their families. The service aims to reduce the number of patient safety incidents, serious incidents, avoidable hospital admission and the need for Intensive Home Based Treatment.&lt;/p&gt;\n&lt;p&gt;Interventions will be provided in collaboration with patients, carers and partner organisations. The model will provide holistic care to enable people to reach their potential and live well in their community. The service will work with a variety of statutory and third sector services, promoting choice and options for patients to develop their strengths through the pursuit of educational and creative opportunities, helping them to understand their own challenges and how they can best manage these in order to pursue their aspirations and recovery.&lt;/p&gt;\n&lt;p&gt;NICE define Early Intervention in Psychosis services as multidisciplinary community mental health teams that assess and treat young people and adults with a first episode of psychosis without delay). Given the evidence for the effectiveness of EIP services and the need to improve access to these services, NHS England have introduced a specification for Early Intervention including a national Access and Waiting Time Standard. This standard required that from the 1st April 2016, more than 50% of people experiencing first episode psychosis (FEP) will commence care within two weeks of referral and that this care will be consistent with the national quality standard for EIP services, including the provision of NICE recommended interventions.&lt;/p&gt;\n&lt;p&gt;You will be expected to contribute to the development and promotion of the Early Intervention Team and support the delivery of NICE interventions and the NHS England access and waiting time standard. There will be an expectation that you will provide psycho-therapeutic interventions such as CBA, BFT, psycho-social education, carers groups, working with families and early warning signs in order to assist the client group, families and carers in the management of their illness and its symptoms. There is an expectation that you will undertake training that will support the above psycho-social therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;Personal qualities will need to include; an enthusiasm for EIT and the EIT ethos, an interest in promoting holistic health and well being, be positive and enthusiastic in what can be a very demanding role, ability to work independently and as part of the team and the ability to structure your own work load and diary utilising a range of interventions tailored to the clients’ needs. You will need an understanding of CPA and maintain this to a good standard and have strong IT skills. A significant element of the role will be the identification and management of risk, utilising the Steve Morgan tools, including positive risk taking and Storm assessments. You will also be expected to carry out duties as per the job description.&lt;/p&gt;\n&lt;p&gt;The ability to travel during the working day over a large geographical area is essential as is the ability to work flexibly with the needs of the client group. . You will need to have excellent interpersonal and problem-solving skills and will be expected to demonstrate your ability to work within a team. You will be expected to supervise support staff and students. The post is subject to DBS clearance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Georgia Wedgbury - Team Manager, Tel: 07785459459 or email georgia.wedgbury@covwarkpt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanswell Point, Coventry", "postalCode": "CV14FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.414", "longitude": "-1.50785"}}, "title": "Care Coordinator - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248058", "validThrough": "2020-11-12T23:59:59+0000"}