{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "MC46 - £41,158 -£76,751"}}, "datePosted": "2020-11-06T08:16:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Training you to be the &#39;best you can be&#39; is our Emergency Department&#39;s aim. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Awarded ‘Learning environment of the year 2019’ importance is placed on individual needs, development and career progression as well as a good work/life balance.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Share our vision? Value continued learning, responsibility and autonomy? Then read on ............&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clinical working in the Emergency Department under Consultant supervision, with a programme dedicated to your career progression in Emergency Medicine.&lt;/li&gt;\n&lt;li&gt;Responsibility for providing supervision and advice to junior medical staff and Emergency Nurse Practitioners.&lt;/li&gt;\n&lt;li&gt;Clinical to non-clinical time at a ratio of 8.5/1.5 PAs respectively, allowing time for attendance at teaching, governance &amp; departmental meetings as well as non-clinical senior roles such as Educational Supervision and Specialty Liaison.&lt;/li&gt;\n&lt;li&gt;Excellent training and supervision&lt;/li&gt;\n&lt;li&gt;A friendly and cohesive team&lt;/li&gt;\n&lt;li&gt;A dedicated support programme committed to your career progression including support with examinations, mentorship in quality improvement and the tools to complete CESR if desired.&lt;/li&gt;\n&lt;li&gt;A fully annualized rota with electronic self-rostering, allowing maximum flexibility for you to plan work around the rest of your life.&lt;/li&gt;\n&lt;li&gt;A newly expanded and refurbished department&lt;/li&gt;\n&lt;li&gt;Training and teaching package and the opportunity to develop specific skills or areas of interest such as ultrasound, simulation, paediatrics and quality improvement amongst many others&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we ask that you:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have experience working in Emergency Medicine at a senior level and wish to pursue this specialty as a career&lt;/li&gt;\n&lt;li&gt;Can demonstrate enthusiasm, team working and leadership skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We run two 24 hour Emergency Departments, both renowned for being friendly, supportive environments and home to a rapidly expanding consultant body with a wide range of specialist interests. Basingstoke is a Trauma Unit and training department for Higher Specialist EM trainees within the Wessex deanery. Both Departments have had significant investment and undergone major renovations over the last 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The vision at Hampshire Hospitals NHS Foundation Trust is to provide outstanding care for every patient. We serve a population of nearly 600,000 people across Hampshire and West Berkshire as well as some people who access our specialist services from across the country.&lt;/p&gt;\n&lt;p&gt;Created in January 2012 the Foundation Trust prioritises the provision of exceptional, compassionate, care delivered by the valued staff working in a culture of collaboration and mutual respect. HHFT employs circa 6,000 people and had a turnover of £382m in 17/18&lt;/p&gt;\n&lt;p&gt;Four core values (CARE) Compassion, Accountability, Respect and Encourage. These are in place to support of four clear objectives, provide outstanding care of patients, empowering all members of staff, sustainable growth and innovating for the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma ChristmasJob titleConsultantEmail addressemma.christmas@hhft.nhs.ukTelephone numberVia Helen Roach 01256 319825&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Speciality Doctor in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258871", "validThrough": "2020-11-23T23:59:59+0000"}