{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-28T14:15:30+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you an enthusiastic Mental Health or Learning Disability Nurse looking for a new challenge in your career? Do you recognise the importance of trauma-informed care for children within a Secure setting? Are you interested in being part of an exciting programme of change within the secure estate? Then this is the job for you!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity for you to develop within a service that is embracing positive change and developing pathways of care to meet the diverse needs of children within the secure estate. As a Nurse you will be able to embrace the fast pace of a Secure setting and the value of working within a truly multi-disciplinary team, that promotes an holistic approach to caring for children within a complex environment. You will be able to have the experience of utilising your core skill set in the management of complex and diverse presentations, which require a high level of crisis and risk management. This will include medication management and the implementation of the Mental Health transfer process. You will have the opportunity to manage a caseload and be required to maintain high standards of Nursing practice, directing clinical care and providing guidance and support to other professionals around individual needs. This will be formulation driven and promote a whole system approach to managing the care of the children in our service.&lt;/p&gt;\n&lt;p&gt;As part of the Children and Young People’s transformation agenda, we are in the process of implementing the Framework for Integrated Care (SECURE STAIRS) at Wetherby YOI, alongside our partner agencies. This service development introduces a psychologically-informed, multi-disciplinary approach to care which is formulation-driven and underpinned by an understanding of developmental trauma. We aim to embed supervision and reflective practice at the center of everything we do, to provide the best care possible for the children.&lt;/p&gt;\n&lt;p&gt;HMYOI Wetherby is the largest secure provision in the country for young males aged between 15 and19. As part of the service there are two units that provide enhanced provisions for children identified with more complex and challenging needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for experienced, motivated and enthusiastic Mental Health Practitioners to join our multidisciplinary and multi-agency team. You will be required to work alongside our partner agencies in an integrated approach to the delivery of care. The CAMHS team provides initial screening for all children entering the secure estate, in order to identify individual needs/risk and refer appropriately within the service. We provide an MDT approach to the assessment, formulation and intervention planning for children, tailoring individual’s care pathway to best meet their identified need and achieve the best possible outcome for them. We work to ensure that the team around the child is working together, with the child at the center. As a service we are involved in all transition and discharge planning, promoting continuity of care and sharing of information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The service will meet your development needs through a comprehensive induction, bespoke training development package and quality supervision plan. Progression of development posts will be dependent on meeting required competencies. The posts will initially be based at either Wetherby YOI, but the expectation would be that you could work across the service at Adel Beck Secure Children’s Home as the Service requires.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience of working within a CAMH’s, Forensic or LAC service would be advantageous. The role will involve working closely with the custodial staff within the YOI and other agencies. The post involves long days, weekend and Bank Holiday working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are shortlisted you will be invited to attend an interview by Microsoft Teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will be subject to a DBS check and prison verification.&lt;/p&gt;\n&lt;p&gt;For further information, or to discuss the post please contact Stacey Hayton, Service Manager, shayton1@nhs.net, 01937 544216, 07585101999 or Rebecca Miller Hodges, Clinical Nurse Lead, rebecca.halder@nhs.net; 01937 544216&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS22 5ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9353", "longitude": "-1.36783"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246925", "validThrough": "2020-11-18T23:59:59+0000"}