{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-10-22T13:16:16+0100", "description": "&lt;p&gt;As a result of the expansion of our team of pharmacists and the reconfiguration of the service, an opportunity exists to join a pro-active, well respected and forward thinking Pharmacy Team delivering high quality patient care and service to our patients across the two sites.&lt;/p&gt;\n&lt;p&gt;The re-design has enabled us to maximize our capacity to deliver optimal care to all patients. This is an exciting opportunity to gain experience working both independently and as part of a team to develop services. The position is currently based at the Oncology Pharmacy, Maidstone but it is anticipated that from January 2021 this post will be across both sites.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated pharmacist who is interested in enhancing their clinical and managerial expertise in the areas of haematology, oncology and neonatal parental nutrition (PN) by joining our progressive pharmacy team.&lt;/p&gt;\n&lt;p&gt;You will have experience in oncology &amp;/or haemato-oncology and preferably will have some previous management experience, including service improvement/ development. You will be able to work independently, manage your own workload and have experience in managing / supporting staff.&lt;/p&gt;\n&lt;p&gt;As a conscientious, forward thinking individual with attention to detail, you will have input into the development and maintenance of chemotherapy services and pharmacy processes and become closely involved with all aspects of delivering a high quality responsive service.&lt;/p&gt;\n&lt;p&gt;You will be able to work using their own initiative and will quickly become a key team player and bring new ideas to the department.&lt;/p&gt;\n&lt;p&gt;Key activities of the post holder include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing the Operational service at both sites&lt;/li&gt;\n&lt;li&gt;Lead on the Education and Training needs for all staff in the department&lt;/li&gt;\n&lt;li&gt;Liaise across sites with pharmacist and nursing teams&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will work in collaboration with other highly specialist oncology / haematology pharmacists and the Aseptic Services Technical Manager to lead cancer pharmacy services at Maidstone &amp; Tunbridge Wells Trust.&lt;/p&gt;\n&lt;p&gt;A postgraduate training in clinical pharmacy and suitable experience in hospital, in the field of Oncology, Haematology and /or TPN is essential.&lt;/p&gt;\n&lt;p&gt;We will provide appropriate training to aid your personal and professional development, helping you to effectively act as role model and mentor for junior staff.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Friday 6th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: week commencing the 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameConchi BlancoJob titleDeputy Chief PharmacistEmail addressmblanco-criado@nhs.netTelephone number01622 227104Additional contact information&lt;/p&gt;\n&lt;p&gt;Dhalvir Midda – Lead Cancer Pharmacist on 01622 228799 ( e-mail : Dhalvir.midda@nhs.net )&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across - site, Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Principal Oncology Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238638", "validThrough": "2020-11-06T23:59:59+0000"}