{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-23T14:30:20+0100", "description": "&lt;p&gt;Band 4 Medical Secretary Plastic Surgery Department&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an efficient and well-organised Medical Secretary to join our team within the Plastic Surgery Department at Birmingham Children’s Hospital NHS Foundation Trust.&lt;br /&gt; &lt;br /&gt; This resilience post will expose you to a breadth of experience as you provide comprehensive medical secretarial support across this specialty.&lt;/p&gt;\n&lt;p&gt;You will be an enthusiastic, self-motivated individual who is well organised and has excellent communication skills. You will be flexible and used to working under pressure and to tight deadlines. The successful applicant will be proficient in Microsoft Word, audio typing and diary management. Medical secretarial experience is essential although training will be given to support you in your new role. You will be an effective team player with a flexible approach who can plan and organise their workload, prioritising as required. &lt;br /&gt; &lt;br /&gt; You will need a good standard of general education – educated to GCSE level or above with relevant secretarial qualifications such AMSPAR Diploma or equivalent and at least RSA II or equivalent. Previous experience in the NHS would be an asset.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; If you would like to be part of this team with the best staff working together to provide excellent patient care, and wish to discuss the vacancy informally please call Katharine Creamer 0121 333 9999 ext 6763.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Children&#39;s Hospital", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240922", "validThrough": "2020-11-18T23:59:59+0000"}