{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881 pro rata per annum"}}, "datePosted": "2020-11-02T12:31:39+0000", "description": "&lt;p&gt;Where we receive a high volume of applications for a post, we may bring the closing date forward. You are therefore advised to submit your complete application as early as possible to avoid disappointment. &lt;br /&gt;&lt;br /&gt;All correspondence regarding short-listing, invite to interview and references will be done via e-mail. Please ensure that you regularly check your e-mails and that you provide an e-mail address. &lt;br /&gt;&lt;br /&gt;A Locum Consultant post in Gastroenterology is offered for 6 months.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;From 1st of April 2019, Princess of Wales Hospital, Bridgend which was previously a part of neighbouring ABM UHB (Abertawe Bro Morgannwg University Health Board) merged into Cwm Taf UHB. The Health Board following these changes to the boundaries is now known as Cwm Taf Morgannwg University Health Board (CTM UHB).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Equality remains at the centre of the UHB&#39;s policy-making, service delivery and employment practices. To ensure that our workforce reflects the local population, we welcome applications from anyone, irrespective of age, sex, race or disability. If you are unable to submit your application in the requested format because of a disability please contact the Recruitment Team, who will agree a more suitable way for you to apply. &lt;br /&gt;&lt;br /&gt;Applications are encouraged and welcomed from Welsh speakers and learners. Whilst the ability to speak Welsh is not essential to this post, it is desirable and the successful applicant may be supported through the personal development plan process if they wish to develop an understanding of the language. &lt;br /&gt;&lt;br /&gt;If you have any problems submitting your application then please use the &#39;Contact us&#39; link at the bottom of the page and complete the support form - you will receive a response back from NHS Jobs direct. &lt;br /&gt;&lt;br /&gt;For some fixed term posts, permanent appointments can be made from within NHS Wales, if the appointment is at the same substantive grade. Appointments can only be made on a temporary basis if it will result in promotion. &lt;br /&gt;&lt;br /&gt;The Health Board operates a smoke free policy in all doorways, buildings, grounds and car parks for the protection, benefit and health of our patients, staff and visitors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Peter Neville, Consultant Gastroenterologist, 01685 721 721&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Charles Hospital, Merthyr Tydfil", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Locum Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252069", "validThrough": "2020-11-16T23:59:59+0000"}