{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-02T10:31:50+0000", "description": "&lt;p&gt;Due to internal promotion, we have an exciting, rare opportunity for an experienced Children’s Nurse to join our busy, dynamic and friendly Children’s Community Complex Care Team. You will be part of an integrated service which also covers palliative care and special needs school nursing.&lt;/p&gt;\n&lt;p&gt;As the team leader you will be responsible for managing a team of nurses and support workers. You will also be responsible for overseeing the completion of the continuing care assessments and the provision of care packages.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated individual with excellent communication skills.&lt;/p&gt;\n&lt;p&gt;You will act as a role model, demonstrating high standards of care and provide clinical leadership. You should have experience of caring for children with complex medical conditions and have the knowledge and teaching skills to ensure staff are clinically competent. You will be responsible for assessing, planning, implementing and evaluating children’s nursing care in the community setting. Knowledge of the children’s continuing care framework and partnership working with the commissioners and the multi disciplinary teams are vital to this role.&lt;/p&gt;\n&lt;p&gt;You will need to be able to work flexibly. Although the role is predominantly office hours, Monday to Friday, the service is 24 hours and you will on occasions be required to work nights and weekends to cover shifts and supervise Band 3 support workers.&lt;/p&gt;\n&lt;p&gt;As a team leader and shift coordinator you need to be able to work under pressure and have good time management and organisational skills. You will also be required to deputise for the Head of Service / Matron in their absence.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a supportive working environment and professional development opportunities.&lt;/p&gt;\n&lt;p&gt;Applicants must have a valid driving license and access to a vehicle.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire JacksonJob titleHead of ServiceEmail addressclaire.jackson@mft.nhs.ukTelephone number0161 248 1239&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Longsight health Centre, Longsight", "postalCode": "M13 0RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4576", "longitude": "-2.20187"}}, "title": "Complex Care Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251582", "validThrough": "2020-11-16T23:59:59+0000"}