{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T15:46:08+0000", "description": "&lt;p&gt;The Institute of Transplantation is a modern, purpose built facility where the unique philosophy is to integrate, consolidate and develop all aspects of care for patients requiring solid organ transplantation. Ward 38, based within the IoT, is a 22 inpatient bed unit specialising in the provision of multi-disciplinary care for patients post solid organ transplantation. This includes patients requiring cardiac, pulmonary, renal, liver or pancreas transplants.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced registered nurse to join this established team and contribute to the effective management and leadership in this area of care. Delivery of care in this area is of an extremely specialised nature and the post holder will be required to deliver care and treatment to a consistently high standard. This post will also be responsible for supporting the senior sister in the monitoring of and the maintenance of required standards in practice.&lt;/p&gt;\n&lt;p&gt;You will need to be enthusiastic and innovative, being able to help support the senior nursing team and more junior members of staff in helping to achieve the vision for this area.&lt;/p&gt;\n&lt;p&gt;Full Time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250819", "validThrough": "2020-11-11T23:59:59+0000"}