{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-11-02T09:30:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Geriatric Medicine with an interest in surgical liaison&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a substantive consultant in Geriatric Medicine with an interest in surgical liaison. As well as working within our integrated geriatric service, you will lead the ongoing development of our surgical liaison service. This is a great opportunity to be involved in innovative service development and quality improvement within an integrated care organisation. Now in its second year you will build on existing ward based in-reach work and strong links between the care of older people and surgical teams to continue to improve the management of frailty on the surgical wards. Within your timetable you will help deliver care for older people in a variety of settings. These will include the acute medical pathway, the care of older people wards and surgical wards and in community settings including care homes.&lt;/p&gt;\n&lt;p&gt;You will join a fantastic Care of Older People (COOP) multidisciplinary team, led by Dr Ruth Law and colleagues. Geriatric Medicine at Whittington Health has expanded steadily over the last number of years and has become extremely effective in providing acute and rehabilitative care to nearly all frail older medical admissions, as well as working in other settings, including community settings, to ensure that frail older people get the right care in the right place. We have an inpatient bed base of three wards, plus a front door frailty service and are well supported by trainees. We are passionate about patient centred care and interdisciplinary working and have a strong commitment to high quality education. We would encourage an applicant with a keen interest in undergraduate and postgraduate teaching.&lt;/p&gt;\n&lt;p&gt;The appointee will also be expected to participate in the emergency out of hours General Internal Medicine on call rota.&lt;/p&gt;\n&lt;p&gt;Full registration with the GMC and acceptance on the GMC Specialist Register are required and you should hold a CCST, or be within six months of obtaining it by the time of interview.&lt;/p&gt;\n&lt;p&gt;Interview date: to be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rosaire Gray COOP, COOP Consultant and lead for Orthogeriatrics&lt;/p&gt;\n&lt;p&gt;Email: rosaire.gray@nhs.net&lt;/p&gt;\n&lt;p&gt;Or Dr Ruth Law, Clinical lead COOP, Email: ruth.law2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Care Of The Elderly Level 5, London", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Consultant in Geriatric Medicine with an interest in Surgical Liaison", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251405", "validThrough": "2020-11-22T23:59:59+0000"}