{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-20T13:16:23+0100", "description": "&lt;p&gt;&lt;span&gt;Salford Royal Hospital is part of the Greater Manchester Kidney Care Network, providing Renal Services to patients living in the North &amp; West Sector of Greater Manchester. &lt;br /&gt;&lt;br /&gt;An exciting and unique opportunity has arisen for a 6 month secondment within Renal Services for a highly motivated specialist nurse with relevant clinical &amp; managerial experience to be the Renal Assessment Service (RAS) within Renal Services at Salford Royal NHS Foundation Trust. It is hoped that if this approach is successful the post may be able to become substantial.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will provide nurse led clinics within RAS with the ability to develop and participate in specialist areas of interest, support the service wide EPO programme. The successful candidate will have an extensive renal background, be a non-medical prescriber with a clinical skills course at level 7. Clinical support is provided by the Consultant Body with a dedicated mentor &amp; opportunities for personal and clinical development.&lt;br /&gt;&lt;br /&gt;You will work closely with the Renal Consultants, Renal Matron, Lead Nurse for Renal Services and the Assistant Director of Nursing for Renal and Tertiary Medicine.&lt;br /&gt;&lt;br /&gt;The role involves collaborative working with colleagues throughout renal services and opportunities to network with colleagues within the wider division of critical care and tertiary medicine. &lt;br /&gt;&lt;br /&gt;You must possess excellent communication skills, strong leadership and have the ability to influence change, together with the skills necessary to deliver against the Trusts key performance targets. The ability to thrive in a fast paced environment and willing to go the extra mile to enhance the patient experience are essential for the post.&lt;br /&gt;&lt;br /&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Highly Specialist Nurse - Renal Assessment Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234548", "validThrough": "2020-11-17T23:59:59+0000"}