{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-09T11:55:13+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Locum Consultant in Geriatric Medicine (pending substantive appointments)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;6-12 months in the first instance&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Great Western Hospital is looking for enthusiastic and forward thinking Locum Consultants in Geriatric Medicine to join and help develop the successful service that the Trust provides. This is an exciting opportunity for the new team members to join our well located DGH at a time when the department is changing practice throughout the hospital. We are looking to develop new areas of working so candidates with special interests will be accommodated and supported as much as possible. We are looking for candidates who will work closely with the existing team of 9 Consultants to design pathways to improve care within our acute setting. We believe that this is essential for us to provide a first class service where the patient and their relatives come first.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team manage Acute and Orthogeriatric inpatients on Jupiter, Teal,Woodpecker and Trauma wards at the Great Western Hospital. There is also a rehabilitation service for Orthogeriatric and Stroke provided on SWICC in a separate building, located on site at GWH. The Betjemen centre, well located on the ground floor of GWH close to the visitor car park, is home to the department’s outpatient clinic rooms, day hospital, therapy areas and office space for the Consultant body and their Secretary team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department of Medicine for the Elderly (DOME) currently provides specialist elderly care services for Stroke, Falls, Syncope, Orthogeriatrics and Movement disorders at the Great Western Hospital site. The Trust runs an integrated all-age admissions policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are currently 19 consultants participating in the 1 in 7 General Medical on call rota. We believe that a good work/life balance is important for all our employees so we would like the appointed candidates to participate in this rota to enable us to reduce the frequency.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder should be trained in all aspects of General Medicine, special interests are encouraged and will be supported as much as possible.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Swindon, Wiltshire and the Cotswolds&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Swindon is a thriving town set between the Cotswolds to the North and West, the Upper Thames valley to the East and the Marlborough Downs to the South. London, Bristol and Oxford are all within easy reach, approximately one hour by car with good links by public transport. The rail journey to London Paddington from Swindon is approximately 55 minutes and Heathrow Airport is only an hour away from Swindon by car&lt;strong&gt;.&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are beautiful villages with excellent housing in the surrounding rural areas of Wiltshire, the Cotswolds and Marlborough. Marlborough is a bustling market town located in Savernake Forest only 10 miles away from the Great Western and offers a variety of housing and renowned educational institutions. Cirencester, capital of the Cotswolds, is only twenty miles away with great amenities and picturesque surroundings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Closing date for applications: 6th November 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Locum Consultant Geriatric Medicine (Fixed Term Contact 6-12 months)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220080", "validThrough": "2020-11-06T23:59:59+0000"}