{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-27T12:15:09+0000", "description": "&lt;p&gt;This is an exciting opportunity for an ambitious individual to join our Clinical Team at HMP/YOI Deerbolt as a Senior Nurse. Ideally you will have at least 2 years experience in a staff nurse role or already be a senior nurse looking for a new challenge with evidence of ongoing, recent professional development. A qualification in Clinical Skills or Non-Medical Prescribing is desirable.&lt;/p&gt;\n&lt;p&gt;Spectrum Community Health CIC is a community owned, award winning health provider. Our recent success at achieving four new contracts demonstrates our policy of innovation and continuous improvement and is testimony to our committed and talented teams. As a Social Enterprise our profits are reinvested into our staff and services, and we benefit from being independent, large enough to provide a level of security, yet small enough to be able to make things happen.&lt;/p&gt;\n&lt;p&gt;Our multi-disciplinary teams provide healthcare services to some of the most vulnerable people in our society, from diverse backgrounds, who present a full range of general, mental health and recovery concerns.&lt;/p&gt;\n&lt;p&gt;The post holder will be supporting and working with clinical staff in a senior position providing supervision, mentorship and clinical guidance. There will also be line management responsibilities to staff and responsibility to ensure patient safety and quality is maintained at all times.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnard Castle", "postalCode": "DL12 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.544", "longitude": "-1.93669"}}, "title": "Senior Nurse - HMP YOI Deerbolt", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244420", "validThrough": "2020-11-10T23:59:59+0000"}