{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "92576", "minValue": "80736", "unitText": "YEAR", "value": "£80,736 - £92,576 per annum inclusive"}}, "datePosted": "2020-10-26T17:45:27+0000", "description": "&lt;p&gt;An enticing fixed term opportunity has arisen to lead the Radiotherapy Physics department at Barking, Havering &amp; Redbridge University Hospitals NHS Trust. The last four years have seen a substantial, significant, and positive whole-scale change to radiotherapy services, which has encompassed machine upgrades, staffing structures, governance, room refreshes and a patient-focused approach that manages staff in an inclusive, supportive and robust manner. We are committed to innovation and continual improvements with the patient at the heart of everything we do. We are therefore looking for an experienced, proactive and dynamic individual who is able to meet complex and competing demands, deadlines and targets whilst continuing to lead the department on our journey towards outstanding. This is a brilliant opportunity to gain NHS leadership &amp; managerial experience of high quality in a fast-paced Trust&lt;/p&gt;\n&lt;p&gt;The Head of Radiotherapy Physics holds a critical position with regard to multidisciplinary relationship building, being a role model for staff, leading and promoting a positive culture, staff development, recruitment and retention as well as being a Trust-wide representative for Clinical Scientists and an advocate for our patients. They will work closely with the Head of Radiotherapy and Lead Clinical Oncologist in maintaining the service and taking it forward. Support will be provided by the Specialty Manager for Haematology &amp; Oncology (who is the former Head of Radiotherapy at the Trust) as well as a great Divisional team who are very familiar with the department.&lt;/p&gt;\n&lt;p&gt;The department is equipped with cutting-edge radiotherapy technology and we treat patients from across East London and Essex. In August 2020 we also became the first Trust in the UK to go live with Varian’s ETHOS (Varian’s online adaptive solution powered by artificial intelligence) unit which enables us to provide adaptive radiotherapy as routine. Our Trust was also the first in the UK to install a Varian Halcyon 1.0 unit in September 2017 and in June 2018 became the first centre in the world to upgrade to Halcyon 2.0. This was followed in October 2018 by the installation of a second Halcyon 2.0 (this is now our ETHOS unit). In June of 2018 we also went live with a Varian Edge + unit that has SRS and SABR capabilities, 4D CBCT and a 6DOF couch.&lt;/p&gt;\n&lt;p&gt;We are a paperless service underpinned by a Quality Management System (Q-Pulse) and are accredited.&lt;/p&gt;\n&lt;p&gt;Our equipment also includes a wide-bore Siemens CT Scanner with iMAR capability, a Varian 2100iX Linear Accelerator (we are in the planning stages of replacing this), and the latest versions of Eclipse Treatment Planning System &amp; Aria, and an Xstrahl Orthovoltage unit.&lt;/p&gt;\n&lt;p&gt;RapidArc, IMRT, IGRT, DIBH and 4DCT are in routine use for a wide range of clinical sites and we are one of the highest providers of IMRT &amp; VMAT in England. The centre participates in a number of clinical trials.&lt;/p&gt;\n&lt;p&gt;We are also a Varian Reference Site for Halcyon and are in the planning stages to be a Varian Reference site for ETHOS.&lt;br /&gt;&lt;br /&gt;We are looking for an HCPC Registered Clinical Scientist with extensive postgraduate experience and a proven track record in a leadership role. The successful candidate will be expected to undertake, and graduate from, The PRIDE Way for Leaders course as part of the Trust’s commitment to continual improvements through a lean management methodology.&lt;/p&gt;\n&lt;p&gt;The radiotherapy department is located on the Queen’s Hospital site. Romford is a historic market town with excellent road links as well as an easy rail commute into London. There are frequent trains from London Liverpool Street to Romford and the fastest train only takes 15 minutes. Trains also stop at Stratford where the upcoming cross-rail service will make commuting to Romford even easier. The hospital is a 15-minute walk from the train station but there are frequent bus services that drop right outside the main entrance. Romford is an ideal location as there is equal access to central London as well as the nearby countryside. There are quality schools in the area and the Trust offers on-site car parking.&lt;/p&gt;\n&lt;p&gt;You must be HCPC registered as a Clinical Scientist, have extensive radiotherapy physics experience and act as a Medical Physics Expert within the area of Radiotherapy.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6-month probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with the completion of the form (for applicants with a disability) can be made to Ashlyn Mathews, Recruitment Department on 01708 435000 extn 2826. Further details regarding the post may be obtained by contacting the manager as per the contact details above.&lt;/p&gt;\nFor further details / informal visits contact:\n&lt;p&gt;Stuart McCaighy, Specialty Manager for Haematology &amp; Oncology&lt;/p&gt;\n&lt;p&gt;T: 01708 435070 &lt;/p&gt;\n&lt;p&gt;E: &lt;span style=&quot;text-decoration: underline;&quot;&gt;stuart.mccaighy@nhs.net&lt;/span&gt;&lt;/p&gt;\n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 8d Interim Head of Radiotherapy Physics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243580", "validThrough": "2020-11-10T23:59:59+0000"}