{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T12:17:02+0000", "description": "&lt;p&gt;An exciting opportunity has arisen a talented individual to join University Hospital Southampton NHS Foundation Trust (UHS) as risk and governance facilitator. To be successful you will be both knowledgeable and highly experienced in delivering excellence in healthcare, and passionate about driving the governance agenda forward to promote safe care, positive patient experiences, and effective risk management. Applications are welcomed from both clinical and non-clinical professionals although experience in a healthcare environment or a governance role is highly advantageous.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time post based at Southampton General Hospital (SGH) and working across the whole of Division B. This dynamic role provides exposure to a diverse range of directorates; Emergency Medicine, HEMS, Medicine, Ophthalmology, Pathology, and Specialist Medicine. Working within a small team of 5 you will act as a governance expert for these areas providing advice and support, and coordinating divisional work streams. You will be required to work Monday to Friday within core working hours but with flexibility to work evenings or weekends on rare occasions. This is a fantastic opportunity to work within a large division whilst also interlinking with the wider organisation and corporate functions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the governance team you will be integral to shaping the care our patients receive and ensuring that it is safe and effective. The roles are fast paced and tasks can vary day to day. These may include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Investigating incidents and complaints to identify what happened and what we can learn, and developing recommendations and action plans to address any issues identified.&lt;/li&gt;\n&lt;li&gt;Undertaking risk assessments to identify what mitigations we can put into place to minimise and prevent risks from materialising.&lt;/li&gt;\n&lt;li&gt;Ensuring that we are compliant with trust and national policies, guidance and alerts, as well as regulatory requirements such as those set out by the Care Quality Commission (CQC).&lt;/li&gt;\n&lt;li&gt;Supporting the division and directorates to undertake and learn from audits and outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be successful in these posts you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a strong understanding of clinical governance and risk management&lt;/li&gt;\n&lt;li&gt;Have experience of implementing change in a clinical environment&lt;/li&gt;\n&lt;li&gt;Be self-motivated and able to work both independently and as part of a team&lt;/li&gt;\n&lt;li&gt;Be able to think independently and critically with excellent analytical skills&lt;/li&gt;\n&lt;li&gt;Be passionate about delivering first class care to our patients&lt;/li&gt;\n&lt;li&gt;Have solid interpersonal skills and be able to develop and maintain strong relationships with a range of individuals of varying professions and grades&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Friday, 20 November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lauren Anderson&lt;/p&gt;\n&lt;p&gt;Division B Governance Manager&lt;/p&gt;\n&lt;p&gt;Lauren.Anderson@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381 208 501&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Divisional Risk &amp; Governance Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246541", "validThrough": "2020-11-11T23:59:59+0000"}