{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-10-23T16:45:50+0100", "description": "&lt;p&gt;CHILDREN’S SERVICES&lt;br /&gt;&lt;br /&gt;CLINICAL FELLOW IN PAEDIATRIC INFECTIOUS DISEASES&lt;br /&gt;(ST4+ EQUIVALENT)&lt;br /&gt;&lt;br /&gt;6 MONTHS&lt;br /&gt;&lt;br /&gt;A post is available within the Department of Paediatric Infectious Diseases Unit at St George’s Hospital, London. The post is available from March 2021 for 6-12 months in the first instance. The post-holder will be included in the compliant on-call rota.&lt;br /&gt;&lt;br /&gt;St. George’s Hospital is a large multi-speciality facility based in South West London, offering a wide range of adult, paediatric and neonatal services. It is co-located with a medical school - St. George’s, University of London. &lt;br /&gt;&lt;br /&gt;The Paediatric department has its own outpatient’s area, Paediatric Intensive Care, child development centre and occupies 5 wards comprising 54 inpatient beds. There are 26 consultants and a fully staffed EWTD compliant middle grade and ST rota, composed of grid trainees, regional trainees, fellows and F1 doctors. &lt;br /&gt;&lt;br /&gt;Pinckney is a 15 bedded PID ward, with 11 cubicles including HEPA laminar flow cubicles. The unit provides a specialist inpatient and outpatient service for children with complex infections and immunodeficiency across South London and the old South Thames region. This includes children with HIV, primary immune deficiency, TB, hepatitis, congenital infections and other complex infections. The PID service is also leading an antimicrobial stewardship program as well as a paediatric Outpatient Parenteral Antimicrobial Therapy (p-OPAT) service.&lt;br /&gt;&lt;br /&gt;The post-holder will be part of a rota covered by paediatric trainees. The post-holder will be responsible for all aspects of patient care under appropriate supervision. &lt;br /&gt;&lt;br /&gt;The post would suit an experienced paediatric trainee with interest in infectious diseases.&lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;NameDr Katja DoerholtJob titleConsultant in Paediatric Infectious DiseasesEmail addressKatja.Doerholt@stgeorges.nhs.ukTelephone number020 8725 1683Additional contact information&lt;p&gt;Dr Katja Doerholt, Consultant in Paediatric Infectious Diseases (020 8725 1683)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s Hospital, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Clinical Fellow in Paediatric Infectious Diseases (ST4+)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241347", "validThrough": "2020-11-08T23:59:59+0000"}