{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-02T15:01:17+0000", "description": "&lt;p&gt;This is an exciting time for intensive care as the service continues to develop. We are currently seeking energetic, enthusiastic and passionate staff nurses who are keen, to develop to join our Intensive care unit at Wycombe Hospital.&lt;br /&gt;&lt;br /&gt;Our Intensive Care Unit’s have 8 beds at Wycombe Hospital which cares for medicine/ cardiology/ stroke and surgical patients and 12 beds at Stoke Mandeville Hospital, which admits medicine/ surgical/ burns/ spinal/ trauma patients and has a dedicated critical care outreach team. There would be an expectation that you would rotate to Stoke Mandeville for short periods.&lt;br /&gt;&lt;br /&gt;Both critical care units are supported by established practice development teams and you will be encouraged to develop your competency in critical care practice in a structured way with a combination of bedside practical supervision and theory sessions off the unit. With the long term opportunity to study for the critical care masters.&lt;br /&gt;&lt;br /&gt;It is a friendly caring unit providing excellent nursing care to the most critically ill patients in the hospitals. &lt;br /&gt;&lt;br /&gt;You should have a minimum of 6 months experience as a staff nurse in an acute setting/ward and be willing to rotate between the two units.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lovely Francis Management Sister on 01494 425558 or 01494 425580&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wycombe Hospital - Intensive Care Unit, High Wycombe-expected to work cross sites", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Staff Nurse - ICU Wycombe Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252525", "validThrough": "2020-11-16T23:59:59+0000"}