{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22750", "minValue": "22750", "unitText": "YEAR", "value": "£22,750 per annum FTE"}}, "datePosted": "2020-11-03T16:31:14+0000", "description": "&lt;p&gt;We are looking to recruit several Care Coordinators who will work as part of a multi-disciplinary team in the Barnsley Primary Care Network, building on our successful and existing model of neighbourhood working this enables us to maintain and focus on the specific needs of each local area whilst allowing integration at a borough wide level.&lt;/p&gt;\n&lt;p&gt;The aim of the Care Coordinator role is to work closely with General Practices in the area and the multidisciplinary team in coordinating all key activities including access to services, advice, and information, and ensuring heath and care planning is timely, efficient, and patient-centred. The post holder will help patients interact and engage with everyday life through activities designed to develop, maintain, or retrain skills for people with a cognitive, physical, or mental disorder, condition, or illness. You will support the provision of continuity of care and act as a point of contact for families, residents, and professionals for identified patients in your caseload.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have experience working in Primary Care and possess excellent communication and organisation skills, with a demonstrable passion for enhancing patient experience and outcomes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are several roles available, please state on your application if you are interested in full time or part time and how many hours.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5281", "longitude": "-1.46969"}}, "title": "Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254804", "validThrough": "2020-11-30T23:59:59+0000"}