{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T10:40:23+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will help patients to get the best from their medicines by switching medications to agreed and approved protocols, improving repeat prescribing processes in General Practice, including promotion of repeat dispensing and online ordering, minimising clinical risk and aiming to reduce wasted medicines.&lt;/p&gt;\n&lt;p&gt;In addition, the post holder will be responsible for encouraging better understanding of the principles of medicines optimisation throughout the practice teams and promoting good practice in line with therapeutic developments. This will involve assisting the PCN in achieving national requirements, NICE implementation and utilisation of medicines optimisation initiatives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The post holders core role and responsibilities will include clinical, technical and administrative activities, including;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Repeat prescriptions management&lt;/li&gt;\n&lt;li&gt;Patient safety audit&lt;/li&gt;\n&lt;li&gt;Medicines Reconciliation&lt;/li&gt;\n&lt;li&gt;Complete a concordance / compliance review&lt;/li&gt;\n&lt;li&gt;Counselling patients to support them in using their medicines effectively.&lt;/li&gt;\n&lt;li&gt;Counsel patients on new or high-risk medication&lt;/li&gt;\n&lt;li&gt;Medication switching – high cost drugs&lt;/li&gt;\n&lt;li&gt;Health promotion campaigns&lt;/li&gt;\n&lt;li&gt;Respond to the MHRA recalls&lt;/li&gt;\n&lt;li&gt;Assist with medication queries&lt;/li&gt;\n&lt;li&gt;Clinical Prioritisation of patients and tasks&lt;/li&gt;\n&lt;li&gt;Support initiatives for antimicrobial stewardship&lt;/li&gt;\n&lt;li&gt;Support delivery of QoF (Quality &amp; Outcomes Framework)&lt;/li&gt;\n&lt;li&gt;Support delivery of Investment &amp; Impact Fund&lt;/li&gt;\n&lt;li&gt;Develop Prescribing Co-ordinators to contribute to the review and development of repeat prescribing protocols / Standard Operating Procedures&lt;/li&gt;\n&lt;li&gt;Support quality and safety improvement in repeat prescribing systems&lt;/li&gt;\n&lt;li&gt;Identify areas of good practice and share learning across the PCN.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates must be a qualified and registered pharmacy technician with GhPC and hold a Diploma Level 3 or equivalent in Pharmacy Services.&lt;/p&gt;\n&lt;p&gt;You will have strong experience in either a community pharmacy or primary care setting and be confident inanalysing and presenting information to health professionals. You will also have experience of implementing and promoting cost effective strategies.&lt;/p&gt;\n&lt;p&gt;You will have the ability to interpret complex clinical information and present in suitable formats to a variety of people from professional and non-professional backgrounds.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join an innovative and forward thinking&lt;strong&gt;Primary Care Network in Grays&lt;/strong&gt;with a strong reputation for Quality Improvement and investing in people. Our PCN spans 10 member Practices embracing a patient list of almost 73,000 patients and is widening our scope of Practice and skill mix to enable improved access to high quality healthcare.&lt;/p&gt;\n&lt;p&gt;We are committed to improving the care provided to patients, reducing health inequalities and raising the quality and standards of GP practice. We are looking for a dedicated Clinical Care Coordinator to work with the Network Member Practices in order to deliver integrated care based around the needs of our local population.&lt;/p&gt;\n&lt;p&gt;As PCN Care Coordinator you will work as a key part of the primary care network (PCN) multi-disciplinary team. You will ensure care is seamless and that everyone involved is working together. You will provide the capacity and expertise to support patients in preparing for or in following-up clinical conversations they have with PCN primary care professionals.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Clinical Directors, local GPs and other primary care professionals within the PCN to identify and manage a caseload of identified patients, making sure that appropriate support is made available to them and their carers, and ensuring that their changing needs are addressed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OTHER KEY BENEFITS &amp; REMUNERATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;6.5 Weeks Leave Inc. Bank Holidays (Pro Rata)&lt;/li&gt;\n&lt;li&gt;Study Leave and Protected Learning Time&lt;/li&gt;\n&lt;li&gt;Educational Sessions&lt;/li&gt;\n&lt;li&gt;Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Peer Support and Mentorship&lt;/li&gt;\n&lt;li&gt;Regular Clinical and PCN Meetings&lt;/li&gt;\n&lt;li&gt;Ongoing Training and Development&lt;/li&gt;\n&lt;li&gt;PCN Opportunities and Progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is also being advertised on the Essex Primary Care Careers website – please complete only one application.&lt;/p&gt;\n&lt;p&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;/p&gt;\n&lt;p&gt;NO AGENCIES PLEASE&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grays", "postalCode": "RM17 5JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4807", "longitude": ".327949"}}, "title": "PCN Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257273", "validThrough": "2020-11-20T23:59:59+0000"}