{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-28T11:47:10+0000", "description": "&lt;p&gt;Applications are invited for a Consultant Surgeon (Head and Neck, Thyroid) to work at The Royal Marsden NHS Foundation.&lt;/p&gt;\n&lt;p&gt;The Royal Marsden is recognised world-wide for the quality of its cancer services. The Trust’s strategic aim is to achieve excellence in cancer treatment and diagnosis, through partnership and collaboration. The Royal Marsden with its associated Institute of Cancer Research constitutes a centre of excellence for research and development, education, treatment and care in cancer. It is acknowledged to be one of the largest comprehensive Cancer Centres in the world.&lt;/p&gt;\n&lt;p&gt;This is a full time, 10 PA role consisting of outpatient clinics, MDT meetings and operating lists. The Head and Neck and Thyroid Units provide a high quality and accessible cancer service predominantly for the people of South London although referrals are also received from across England and abroad - for these particular tumour sites. The Units have a long and distinguished history, particularly in the multidisciplinary approach to cancer care. In providing this service we have forged excellent links with the St George’s Hospital who partner us in this.&lt;/p&gt;\n&lt;p&gt;The population we serve at The Royal Marsden exceeds 2 million and draws from a number of peripheral hospitals, some which hold joint consultant contracts with The Royal Marsden, all of which are members of The Royal Marsden multidisciplinary team (MDT). This helps to facilitate efficient patient pathways from diagnosis to treatment across the network. The spoke institutions comprise Croydon NHS Trust; Epsom and St. Helier NHS Trust; Kingston NHS Trust; St George’s Hospital, Chelsea and Westminster Hospital, Charing Cross Hospital and Ashford and St. Peter’s NHS Trust.&lt;/p&gt;\n&lt;p&gt;Whilst the bulk of the head and neck workload is represented by mucosal squamous cell carcinoma of the upper aerodigestive tract, the MDT also manages patients with malignant salivary gland disease, head and neck non-melanoma skin malignancy, paranasal sinus malignancy and thyroid malignancy. The unit offers the full range of head and neck respective and reconstructive surgery, including a full-fledged robotic surgical programme.&lt;/p&gt;\n&lt;p&gt;The UAT and Thyroid surgical team also have a large caseload of patients seen within the department who are referred form other ENT/Head and Neck Surgeons either in the UK or Abroad. There are existing and established referral pathways from a number of overseas units. There are also many intra-hospital referrals from the lymphoma and sarcoma teams.&lt;/p&gt;\n&lt;p&gt;In order to fulfil the responsibilities of this post you must be eligible for full GMC registration. Applicants will have their CCT or be within 6 months of obtaining it.&lt;/p&gt;\n&lt;p&gt;Applicants are requested to upload a copy of their CV with application form.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mr Cyrus Kerawala, Head of Unit and Consultant Maxillofacial Surgeon, Cyrus.Kerawala@rmh.nhs.ukT, 020 7808 2731&lt;/p&gt;\n&lt;p&gt;Professor Vinidh Paleri, Consultant ENT Surgeon via Email: Vinidh.Paleri@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, London", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Consultant Head and Neck Surgeon with specialist interest in Thyroid", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246425", "validThrough": "2020-11-27T23:59:59+0000"}