{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90000", "minValue": "90000", "unitText": "YEAR", "value": "90,000.00"}}, "datePosted": "2020-11-04T13:54:22+0000", "description": "&lt;p&gt;Evenings and Weekends.&lt;/p&gt;\n&lt;p&gt;In this role the General Practitioner (GP) will be responsible for the provision of safe and effective primary care appointments in line with GP Improved Access hub criteria, with full access to patient medical records. Our team of clinicians will provide appointments of an evening and weekend to local patients referred by their own GP surgery and 111. The post holder will take a pro-active approach to their own CPD, contribute to continually improving the clinical effectiveness of the clinics and work collaboratively and supportively with all colleagues. You ideally will know how to use EMIS clinical IT system but training will be provided.&lt;/p&gt;\n&lt;p&gt;This role could also be an ideal opportunity as part of a portfolio role working with PHL in the Primary Care Planned Care Appointments of extended access, Urgent Care work in the Lymington Urgent Treatment Centre, Integrated Urgent Care Telephone Triage Service in Whiteley and our Custody Healthcare Service. There are multiple clinical services to ensure variety and flexibility.&lt;/p&gt;\n&lt;p&gt;We provide an attractive rate of pay dependent upon service and also offer enhanced rates for unsocial hours. A portfolio full time salary could range from £90K to 120K&lt;/p&gt;\n&lt;p&gt;Example hours :&lt;/p&gt;\n&lt;p&gt;Extended Primary Care Access Service – Weekday evenings 6.30pm to 11pm Weekends 8am to Midnight available at varying sites, Lymington, Ringwood, Winchester&lt;/p&gt;\n&lt;p&gt;Urgent Treatment Centre at Lymington – 7 days a week 8am to 11pm&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Accountabilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The GP will work with a multi-disciplinary team to ensure appropriate care is delivered in the right place, at the right time. The post holder will be expected to&lt;/p&gt;\n&lt;p&gt;· Maintain the highest clinical standards for all patients accessing the service.&lt;/p&gt;\n&lt;p&gt;· Assess, investigate, diagnose and treat patients presenting with clinical needs which can be met by primary care ensure appropriate coding planned and opportunistically to support the delivery of QOF, LCS, DES and CQUINs.&lt;/p&gt;\n&lt;p&gt;· Refer to secondary care where appropriate using the appropriate referral forms and mechanisms.&lt;/p&gt;\n&lt;p&gt;· Ensure requesting of appropriate investigations and reporting on these when required.&lt;/p&gt;\n&lt;p&gt;· Provide emergency care while waiting for emergency transfer of patient when appropriate&lt;/p&gt;\n&lt;p&gt;· Provide advice and support to colleagues and the multi disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Communication and Working Relationships&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;· GP Team including Clinical Team of Nurses and Paramedics, Operational Manager and non clinical team&lt;/p&gt;\n&lt;p&gt;· GPs within Primary Care&lt;/p&gt;\n&lt;p&gt;· Secondary Care e.g. radiology and pathology&lt;/p&gt;\n&lt;p&gt;· Wider healthcare services&lt;/p&gt;\n&lt;p&gt;· Patient Participation Groups&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to contribute to the development of the service. It is expected that the post holder will:&lt;/p&gt;\n&lt;p&gt;· Support to improve non-elective care pathways within the healthcare community.&lt;/p&gt;\n&lt;p&gt;· Communicate with the Governance Lead and support the delivery of a high quality service and raise any governance issues that may arise.&lt;/p&gt;\n&lt;p&gt;· Support the teaching and development of doctors, nurses and professionals from other disciplines such as Emergency Care Practitioners, GP registrars in Primary Care Skills. This may involve practitioners sitting in and seeing patients where appropriate.&lt;/p&gt;\n&lt;p&gt;· Work with the Service Manager to ensure training, significant events, complaints, audits, surveys and other professional service development activities are achieved to ensure the smooth running of the service.&lt;/p&gt;\n&lt;p&gt;· Maintain continued education through attendance at courses and/or study days as necessary to ensure professional development requirements for on-going professional registration and licensing are met.&lt;/p&gt;\n&lt;p&gt;· Participate in, encourage and support professional development within the service.&lt;/p&gt;\n&lt;p&gt;· Ensure that high clinical standards are maintained throughout the service.&lt;/p&gt;\n&lt;p&gt;· Participate in annual appraisal and complete an annual personal development plan.&lt;/p&gt;\n&lt;p&gt;· Comply with standard operational procedures and departmental and organisational policy.&lt;/p&gt;\n&lt;p&gt;· Undertake necessary mandatory training.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Strategic Development, Planning and Organising&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;· Actively participate in both departmental and organisational matters concerning clinical governance, care pathways, team meetings and audit when required&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· An experienced doctor with GP accreditation&lt;/p&gt;\n&lt;p&gt;· Current registration with GMC and NHS performers list (with no conditions preventing working or restrictions on practice)&lt;/p&gt;\n&lt;p&gt;· Experience of working in primary care and urgent care environment&lt;/p&gt;\n&lt;p&gt;· Record of on-going CPD and learning&lt;/p&gt;\n&lt;p&gt;· MRCGP examination or equivalent experience&lt;/p&gt;\n&lt;p&gt;· Sound knowledge of QOF, LCS, DES, CQUINs and use of appropriate coding&lt;/p&gt;\n&lt;p&gt;· Will have an understanding of the political agenda and drivers influencing primary care provision.&lt;/p&gt;\n&lt;p&gt;· Good leadership skills with the ability to influence and negotiate.&lt;/p&gt;\n&lt;p&gt;· Good organisational and IT skills desirable&lt;/p&gt;\n&lt;p&gt;· Excellent communication and interpersonal skills – written, verbal (Particularly listening skills)&lt;/p&gt;\n&lt;p&gt;· Clear understanding of professional responsibility and accountability.&lt;/p&gt;\n&lt;p&gt;· Good organisational skills and ability to manage and prioritise own workload&lt;/p&gt;\n&lt;p&gt;· Good clinical skills in assessment, diagnosis and management of acute Primary care presentations&lt;/p&gt;\n&lt;p&gt;· Be able to clear an enhanced DBS check&lt;/p&gt;\n&lt;p&gt;· Must be authorised to work in the EEC&lt;/p&gt;\n&lt;p&gt;· Excellent communication and interpersonal skills – written, verbal (Particularly listening skills)&lt;/p&gt;\n&lt;p&gt;· Clear understanding of professional responsibility and accountability.&lt;/p&gt;\n&lt;p&gt;· Good organisational skills and ability to manage and prioritise own workload&lt;/p&gt;\n&lt;p&gt;· Good clinical skills in assessment, diagnosis and management of acute Primary care presentations&lt;/p&gt;\n&lt;p&gt;· Be able to clear an enhanced DBS check&lt;/p&gt;\n&lt;p&gt;· Must be authorised to work in the EEC&lt;/p&gt;\n&lt;p&gt;· Ideally have knowledge of EMIS Clinical IT system&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lymington", "postalCode": "SO22 4QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0464", "longitude": "-1.33921"}}, "title": "General Practitioner – Primary Care Extended Access, Lymington", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256083", "validThrough": "2020-11-18T23:59:59+0000"}