{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 to £43,772 per annum"}}, "datePosted": "2020-11-04T16:45:50+0000", "description": "&lt;ul&gt;\n&lt;li&gt;Are you a experienced Health Visitor, with passion for Peri-natal Mental Health, do you have excellent communication and inter-personal skills?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you have the confidence to work alone, putting the patient at the heart of what you do; and to get involved within a multi-disciplinary team?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you passionate about supporting patients with long term conditions to manage their conditions and enjoy life to their fullest?&lt;/li&gt;\n&lt;li&gt;This is a lead post in-depth knowledge of issues with perinatal mental Health required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If you answered yes, we’ve got the perfect role for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will need you to work within the Health Visiting Service as a co-ordinator for Perinatal and Infant Mental Health (PIMH); responsible for assessment of and planning and implementing care with a specialist group of client&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So what else?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This is your chance to join a progressive and innovative service in a social enterprise that is patient and staff focused - you’ll even have the opportunity to become an MCH shareholder.&lt;/li&gt;\n&lt;li&gt;We encourage staff to get involved in exploring new ways of working and service development.&lt;/li&gt;\n&lt;li&gt;We’ll provide well established, in-service training, one to one supervision, and appraisals with regular support.&lt;/li&gt;\n&lt;li&gt;You’ll be able to develop your skills in a friendly and supportive team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;So what are you waiting for? We can’t wait to hear from you, and look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The small print&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Informal visits can be arranged on request.&lt;/li&gt;\n&lt;li&gt;We will always appoint the best person for the job, but applications are particularly welcome from candidates from BAME groups which are underrepresented in our service.&lt;/li&gt;\n&lt;li&gt;We will offer you the choice of two pension schemes; the NHS Pension scheme and our Scottish Widows group personal pension&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSheena BollandJob titleHead of Public Health NursingEmail addresssheenabolland@nhs.netTelephone number07817166527&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125974.png", "name": "Medway Community Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Snapdragons Centre, , Rochester", "postalCode": "ME2 3DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4052", "longitude": ".492954"}}, "title": "Clinical lead for peri-natal mental health and vulnerable parents", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256698", "validThrough": "2020-11-11T23:59:59+0000"}