{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35301", "minValue": "35301", "unitText": "YEAR", "value": "24,629 as per annex 21 NHS terms and conditions"}}, "datePosted": "2020-10-23T10:23:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Graduate/Trainee Internal Auditor&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting Salary £24,629 with a supported 3 year training programme for study and work experience with linked annual increases &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working – with a base in our Nottingham or Rotherham office&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like the opportunity to learn about how the NHS is structured and operates, to work with people from a variety of backgrounds and to work with many different types of healthcare organisation?&lt;/p&gt;\n&lt;p&gt;Do you have an interest in topics that are crucial to how well an organisation is run and performs, including governance, risk management, financial management, data and information management and IT?&lt;/p&gt;\n&lt;p&gt;Would you like to develop the skills that allow you to support senior client managers to meet their objectives?&lt;/p&gt;\n&lt;p&gt;If so, a career in internal audit with 360 Assurance could be the right fit for you. We have an exciting opportunity for an ambitious individual to join our Internal Audit team.&lt;/p&gt;\n&lt;p&gt;We are an NHS service, hosted by Leicestershire Partnership NHS Trust, providing audit services to NHS clients in South Yorkshire and the East Midlands. As a Trainee Internal Auditor, you will work within a team that provides internal audit services to a wide spectrum of NHS organisations, gaining experience across a wide range of topics including financial management, IT and human resources.&lt;/p&gt;\n&lt;p&gt;The role will see you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Undertake a professional qualification&lt;/em&gt;&lt;/strong&gt;: studying whilst developing in the role of Internal Auditor.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Add value to the NHS:&lt;/em&gt;&lt;/strong&gt; researching and assessing clients, providing evidence-based feedback through audit reports and face to face presentations. Proposing practical solutions to support busy organisations as they seek to perform to the highest standards possible.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Work as part of a team&lt;/em&gt;&lt;/strong&gt;: working together with a multi-disciplinary team to deliver audits for NHS clients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You can find out more about a career in internal audit on the website of the Chartered Institute of Internal Auditors (IIA)&lt;/p&gt;\n&lt;p&gt;Good verbal and written communication skills are essential, as are confidence and self-discipline. Candidates will be required to build strong relationships with colleagues and clients and be able to work on their own or as part of a team. The candidate will be able to adapt and prioritise as workload requires, and will ensure timely delivery of quality audits.&lt;/p&gt;\n&lt;p&gt;We offer a competitive starting salary plus a three year training programme, including a fully supported study package for the Institute of Internal Audit or a CCAB accountancy qualification. The cost of your professional training package is paid for by 360 Assurance (subject to terms and conditions) and you will be provided with time to study. Upon qualification you will have opportunities to develop further within our organisation and continue to progress your career. Upon successful completion of the trainee programme, you will be appointed as an Audit Principal.&lt;/p&gt;\n&lt;p&gt;As you pass exams and meet work based competencies, you will be rewarded with salary increases. You will benefit from being an NHS employee with the option to join the NHS pension scheme, flexible working and the opportunity to access NHS staff benefits.&lt;/p&gt;\n&lt;p&gt;360 Assurance operates within the East Midlands and South Yorkshire with offices across these areas. Although based at one location, travel across the client base will be expected. Currently, due to the COVID-19 pandemic, our whole team is working from home. We anticipate in the future a mix of working from 360 offices, from client sites and from home.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Robert Storr, Assistant Client Manager and our trainee liaison lead on 07342 072 892.&lt;/p&gt;\n&lt;p&gt;Candidates will be required to go through a two part recruitment process that will include as a minimum an interview, academic assessment and communication test.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be a car driver to enable travel between NHS and other locations across the East Midlands and South Yorkshire (use of public transport is unlikely to be practical for this post).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG9 8DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9308", "longitude": "-1.27321"}}, "title": "Band 6 Graduate/Trainee Internal Auditor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240026", "validThrough": "2020-11-13T23:59:59+0000"}