{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 - £49,036 pa"}}, "datePosted": "2020-11-03T09:46:32+0000", "description": "&lt;p&gt;Job Title: Clinical Fellow Dermatology&lt;br /&gt;&lt;br /&gt;Hours: 2.0 wte&lt;/p&gt;\n&lt;p&gt;Job Type: Initial Fixed term contract period 6 months with possibility to extend to 12 months&lt;/p&gt;\n&lt;p&gt;Work Location: Bristol Royal Infirmary&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol NHS Foundation Trust wishes to appoint a Clinical Fellow in Dermatology based at the Bristol Royal Infirmary (BRI). The post will involve working alongside the existing dermatology trainees to deliver dermatological care to the population of Bristol and the surrounding area. Applicants wishing to work less than full time are encouraged to apply.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at the Bristol Dermatology Centre in the BRI and may deliver some sessions to participate in the dermatology service at Weston General Hospital (WGH) or South Bristol Community Hospital (SBCH), with continuing professional development sessions at the BRI. This post is designed to meet the need for flexibility and teamwork in the department and to enable the appointee to acquire skills in general dermatology. This post is ideally suited to those wishing to pursue a career in, or progress to higher specialist training in Dermatology. The post may be extended by mutual agreement to allow further training and progression for candidates to be eligible for application of dermatology CCT via the Certificate of Eligibility for Specialist Registration (CESR), depending on requirements of the post holder&lt;/p&gt;\n&lt;p&gt;Applicants must have an MRCP and should be able to demonstrate some experience or enthusiasm for Dermatology as a career choice.&lt;/p&gt;\n&lt;p&gt;The Bristol Dermatology Department is a large teaching hospital department providing a full range of dermatological services for our local population as well as a regional service in paediatric dermatology, phototherapy, contact dermatitis, skin lymphoma and nail disease. This is an undergraduate and postgraduate teaching Trust and is the main regional training centre for dermatology trainees, supported by our team of dermatologists Consultants and Associate Specialist.&lt;/p&gt;\n&lt;p&gt;The Bristol Dermatology Centre is a self-contained facility with purpose-built consulting rooms, phototherapy suite, contact dermatitis suite, day treatment area, skin surgery theatres, secretarial and consultant offices. In-patients are usually located in a nearby ward within the Bristol Heart Institute. The BRI Dermatology Department provides a full range of dermatology services to the population of Bristol and adjacent areas (core catchment population approximately 400,000).&lt;/p&gt;\n&lt;p&gt;Candidates should note that an acknowledgement of application will be sent and, if successful in being shortlisted, an invitation to attend interview will be sent.&lt;/p&gt;\n&lt;p&gt;Candidates wishing to visit the hospitals may do so and should make their arrangements with:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameShalini NarayanAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Shalini Narayan, Consultant Dermatologist Bristol Royal Infirmary Tel: 0117 3422770&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Clinical Fellow In Dermatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253323", "validThrough": "2020-11-22T23:59:59+0000"}