{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069"}}, "datePosted": "2020-11-06T16:01:04+0000", "description": "&lt;p&gt;Nottingham University Hospital NHS Trust seeks applications for CESR Fellows &amp; Registrar level (ST4/ST5) doctors in Emergency Medicine, based at the Queens Medical Centre Campus.&lt;br /&gt;&lt;br /&gt;The Certificate of Eligibility of Specialist Registration (CESR) is a means by which doctors who have not completed an approved deanery training programme can be entered on the Specialist Register. It is a competency-based process where the trainee provides a portfolio of evidence that demonstrates that their training, qualifications and experience meet the requirements of the Emergency Medicine CCT curriculum. Successful completion of the CESR process result in entry onto the Specialist Register and you will then be able to apply for Emergency Medicine Consultant posts in the traditional way. The process itself involves collation of a range of evidence covering the four domains as set out by the General Medical Council (GMC).&lt;br /&gt;&lt;br /&gt;For those wishing to apply to the CESR Fellow posts, the department will support the post holders for application for eligibility for Certification of Specialist Registration (CESR) including secondment to Acute Medicine, Intensive Care Medicine, Anaesthesia and Paediatric Emergency Medicine. Experience in Emergency Medicine would run in sequence with the allied specialties secondments. The teaching programme will provide opportunity to have focused teaching on specific areas including SAQs, OSCE practice, and Critical Appraisal teaching and mock viva on CTR / QUIP and management section of the FRCEM examination. Education and training support will be provided to those wishing to take MRCEM or FRCEM examination. &lt;br /&gt;&lt;br /&gt;The post holders will work under the clinical direction of the consultants in the Emergency Department. &lt;br /&gt;&lt;br /&gt;The post would be ideal for those wishing to pursue a non-consultant career grade post in Emergency Medicine. The post would also be suitable for an experienced SHO equivalent / Clinical Fellow / Registrar who wishes to pursue a career in Emergency Medicine and would like to consolidate their experience and confidence or would like to work in a Major Trauma Centre.&lt;/p&gt;\n&lt;p&gt;Please note salary is (MN37 pay scale) dependent on experience, your experience will be calculated (in years) and you will be offered the point of scale equivalent. The MN37 pay scale runs from £32,478 to £51,069&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Abdul Jabbar on abdul.jabbar@nuh.nhs.uk or telephone 0115 924 9924 ext 61153&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "CESR Fellow/ Registrar in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260509", "validThrough": "2020-11-13T23:59:59+0000"}