{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata per annum"}}, "datePosted": "2020-11-02T13:16:41+0000", "description": "&lt;p&gt;We are seeking a skilled and experienced Applied/Clinical Psychologist to work with older people who have complex and severe mental health problems within our in-patient mental health services for older people in York. This fixed-term post (12 months) is to cover maternity leave for the current post-holder.&lt;/p&gt;\n&lt;p&gt;We welcome applications from highly-motivated and resourceful individuals who have a commitment to working with older people in an inpatient setting. The successful post-holder will provide highly specialist psychological assessments and therapies to older people with a broad range of needs and will provide clinical leadership as an integrated member of a multidisciplinary in-patient team. Clinical leadership, supervision / consultation and Specialist knowledge and skills relating to complex and enduring psychological problems, cognitive impairment in ageing, behaviour that challenges and psychological therapies for psychoses, depression and personality disorder will all be required. As such, candidates should have experience of working in in-patient settings and with people who are living with mental health problems in the context of cognitive impairment and concurrent physical health needs (this includes their families and care-givers). Experience of service development and research / audit would also be desirable.&lt;/p&gt;\n&lt;p&gt;You will be required to be registered with the Health and Care Professions Council as a Practitioner Psychologist. The Trust is committed to providing support and supervision for continuing professional development. It is expected that you will provide clinical supervision of trainee psychologists and other disciplines as required and to provide staff training as required.&lt;/p&gt;\n&lt;p&gt;Clinical supervision and professional leadership will be provided by a senior Clinical Psychologist. The post-holder will be professionally accountable to the Locality Lead for Psychology in Older People’s Mental Health (MHSOP) in York and will be connected to a network of applied psychologists working with older people across the Trust. We actively encourage CPD and service-related research. We will support individuals to further develop specialist psychological therapy skills and leadership skills in particular.&lt;/p&gt;\n&lt;p&gt;Psychology has a strong and rapidly developing reputation within Tees, Esk and Wear Valleys NHS Foundation Trust for supporting organisational change, developing psychologically minded staff groups, and embedding research and outcome measures, within recovery and person centred care philosophies. The post holder will be expected to play a role in supporting the continued development of these factors within CMHTs and the wider directorate.&lt;/p&gt;\n&lt;p&gt;Psychologists and Psychological Therapists provide key leadership roles within the Trust. To support this we have developed leadership profiles for each psychology band and the profile card associated with this post is attached on NHS Jobs. You can find more information about the NHS Leadership Academy’s Healthcare Leadership Model and the profiles at their website. We encourage you to look at these resources as they will play a part in the interview process.&lt;/p&gt;\n&lt;p&gt;We provide excellent opportunities for peer support/supervision, CPD, teaching/training, and research and audit in line with strategic developments. There are also strong links to the local Hull/York and Teesside D Clin Psy Programmes, as we are key providers of academic and clinical experience components both in terms of teaching and supervision.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for this post the successful applicant will be confirmed in post on a permanent basis.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris Clarke, Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;christopher.clarke@nhs.net&lt;/p&gt;\n&lt;p&gt;01904 461131 or 07852538165&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Foss Park Hospital, York", "postalCode": "YO31 8TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9746", "longitude": "-1.07582"}}, "title": "Highly Specialist Applied Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252209", "validThrough": "2020-11-16T23:59:59+0000"}