{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa (+ Out of Hours Enhancements)"}}, "datePosted": "2020-11-04T16:15:20+0000", "description": "&lt;p&gt;Leeds Teaching Hospital Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Microsurgical Fellow (Trust Doctor)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for one post as a Microsurgical Fellow, which is available for a period of 6 month &lt;em&gt;initially with a possible extension to 12 months&lt;/em&gt;&lt;em&gt;&lt;span&gt;, &lt;/span&gt;&lt;/em&gt;based on the training requirements of the individual. The post is available from July 2021.&lt;/p&gt;\n&lt;p&gt;This senior microsurgical fellow position within the Department of Plastic, Reconstructive and Hand Surgery will be tailored to an individual’s training requirement.&lt;/p&gt;\n&lt;p&gt;The routine work includes care of patients in the Leeds General Infirmary, attendance at theatre lists and out-patient clinics where areas of need for particular sub specialisation will be addressed with his supervising consultant.&lt;/p&gt;\n&lt;p&gt;These will need to be clearly defined from the outset by the successful candidate.&lt;/p&gt;\n&lt;p&gt;The post is fulltime and the appointee will be expected to take part in the Specialist Registrar out of hours rota, currently 1:9. The majority of the out of hours involves general plastic surgery, hand surgery and acute microsurgery. The candidate will therefore be expected to have background training in Plastic Surgery to a high level and have completed the FRCS (Plast) or equivalent.&lt;/p&gt;\n&lt;p&gt;The department provides a wide range of specialist plastic and reconstructive surgery. The unit sub-specialises in comprehensive hand and upper limb surgery, including congenital hand, adult hand and brachial plexus surgery, hand transplant, head and neck malignancy, craniofacial surgery, sarcoma, breast reconstruction, skin cancer and lower limb reconstruction - Leeds is a Major Trauma Centre. The unit has a busy microvascular workload which the trainees/fellows participate in.&lt;br /&gt; &lt;br /&gt; These posts would benefit applicants with experience at higher StR grade or those who have completed their training and desire further specialist training in reconstructive surgery. The successful candidate would be encouraged to pursue their sub-specialist areas of interest within the department.&lt;br /&gt; For further please contact Mr Christopher West (&lt;span&gt;christopherwest@nhs.net&lt;/span&gt;) or Mr Waseem Bhat (w.bhat@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122914.jpg", "name": "Trauma and Related Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Leeds General Infirmary", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Microsurgical Fellow (Trust Doctor) in Plastic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256573", "validThrough": "2020-11-19T23:59:59+0000"}