{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa, based on full time hours"}}, "datePosted": "2020-10-19T14:15:30+0100", "description": "&lt;p&gt;Trinity ward is a 16 bedded female acute inpatient ward. We prides ourselves on being a vibrant, diverse and resilient team, passionate about providing the highest standard of care for all patients.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a dynamic and enthusiastic individual who is ready for a new challenge and progression in their career. If you are an experienced and motivated nurse, committed to working in partnership with patients/careers, within a multidisciplinary team to provide care that is truly person centered and recovery focused, this is the opportunity for you. We are seeking to employ nurses who are friendly, approachable and compassionate, with excellent communication and interpersonal skills, as well as commitment to working flexibly to meet patient’s needs.&lt;/p&gt;\n&lt;p&gt;As a Ward we recognize the need to ensure we employ nurses with a keen interest in managing acutely unwell patients and embedding innovative changes and excellent patient care. Successful candidates will demonstrate a sound knowledge of clinical practice, good leadership skills, resourceful, and good time management skills in order to adapt to a fast pace working environment.&lt;/p&gt;\n&lt;p&gt;Here on Trinity Ward you will enjoy working in an environment that is friendly, welcoming, and supportive. Where your skills, interests and professional aspirations will be nurtured and encouraged to aid you in achieving your fullest potential as a psychiatric nurse. Opportunities to deputize for the manager and take on managerial responsibilities are available. Alternatively, Supplementary training such as Dialectical behavior therapy (DBT), motivational interviewing skills training and more can be accessed. Or for those keen to develop their physical health skills, ECG training, advance wound care, phlebotomy training are offered.&lt;/p&gt;\n&lt;p&gt;Trinity ward is on an exciting journey of change and development and we look forward to you joining us on this journey.&lt;/p&gt;\n&lt;p&gt;Happy to Talk Flexible Working - all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;For external candidates coming to us as Band 5 and 6 RMN’s (subject to meeting eligibility criteria), we can also offer a Golden Hello of £2,500 and assistance with relocation as well, so don’t wait any longer – APPLY TODAY! Does not apply to current SHFT NHS Staff.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 0YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9124", "longitude": "-1.39707"}}, "title": "Senior Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232634", "validThrough": "2020-11-16T23:59:59+0000"}