{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-06T11:30:21+0000", "description": "&lt;h1&gt;&lt;span&gt;WORCESTERSHIRE EARLY INTERVENTION SERVICE&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CASE MANAGER- CLINICAL CARE CO-ORDINATOR (RMN/OT/SOCIAL WORKER)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 HOURS PER WEEK   1.4 wte hours available (0.8 wte North and 0.6 wte South) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Early Intervention in Psychosis team is seeking an OT, Social Worker or a CPN to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service addresses the needs of young people (aged 14-35) who have recently experienced a first episode of psychosis or who are presenting with an at risk mental state.  We are expanding the service to take referrals for people up to the age of 64 and this has created an exciting opportunity for additional staffing across the service. With bases in Worcester and Bromsgrove, we are a countywide service helping individuals and their families to cope with psychosis, promoting recovery, reducing trauma and tackling stigma.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service is an award-winning service with an international reputation. This post represents a fantastic opportunity to gain experience working in a multi-disciplinary team of highly-skilled and knowledgeable clinicians. In your role you will provide a range of skilled mental health interventions to service users and families and manage a defined caseload; assessing, planning, delivering and evaluating care and actively contributing to groups and family work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The positions to offer are - 0.8 wte in the North - New Brook  and 0.6 wte in the South- Studdert Kennedy base. As a countywide service there may be a requirement for you to work across both sites. However, due to current COVID-19 guidelines there is considerable ability to work from home&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post involves a significant amount of travel, therefore it is essential applicants can meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, or an informal discussion, please contact any of the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Julia Wittering (Clinical Lead, Early Intervention Service) - 01905 734536&lt;/p&gt;\n&lt;p&gt;Sian Westaway (Service Lead -  AMH Specialist teams ) – 07867780522&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Herefordshire and Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR1 3DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1978", "longitude": "-2.22629"}}, "title": "Case Manager/Clinical Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259419", "validThrough": "2020-11-23T23:59:59+0000"}