{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-11-02T16:45:49+0000", "description": "&lt;p&gt;The Clatterbridge Cancer Centre NHS Foundation Trust is one of the UK’s leading providers of non-surgical cancer treatment, caring for a population of 2.4 million people across Cheshire &amp; Merseyside, North Wales, the Isle of Man and parts of Lancashire.&lt;/p&gt;\n&lt;p&gt;Our flagship specialist cancer hospital in Liverpool opened in June 2020, supported by our hospital on the Clatterbridge Health Park in Wirral providing outpatient cancer treatment and supportive care, and our radiotherapy treatment centre on the Aintree Hospital site.&lt;br /&gt;&lt;br /&gt;Together, working across three sites and operating specialist chemotherapy clinics in four of Merseyside’s district hospitals, we are able to deliver a comprehensive range of inpatient care, advanced radiotherapy, chemotherapy and other systemic anti-cancer therapies including gene therapies and immunotherapies. We also deliver a pioneering Treatment at Home and Work service; are the only facility in the UK providing low-energy proton beam therapy to treat rare eye cancers and host the region’s Teenage and Young Adult Unit, (supported by the Teenage Cancer Trust).&lt;/p&gt;\n&lt;p&gt;Working with leading experts from The University of Liverpool and the Cancer Research UK Liverpool Cancer Trials Unit we strive to stay at the forefront of novel treatments and techniques to deliver more effective and personalised treatments than ever before.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our Trust, as we go through a period of development to support delivery of our vision to deliver cancer care services across the Cheshire and Mersey area.&lt;/p&gt;\n&lt;p&gt;We have a 14 month fixed term or secondment opportunity to cover a maternity leave absence to support the delivery of our objectives. We are looking for a highly motivated and enthusiastic, qualified financial accountant to lead the financial services team. You will take responsibility for the management of the performance of the financial services team ensuring the delivery of a professional, dynamic, efficient and proactive service to meet the needs of the organisation. This post will report to the Deputy Director of Finance and provide support to the Director of Finance and other members of the senior management team. Key responsibilities include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead the production of the Trust’s annual accounts and their audit, and support the production of the annual report&lt;/li&gt;\n&lt;li&gt;Manage the delivery of statutory financial returns for the Trust and its subsidiaries&lt;/li&gt;\n&lt;li&gt;Ensure the Trust’s cash and working capital positions are managed effectively&lt;/li&gt;\n&lt;li&gt;Support capital reporting and asset management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a high profile role and is a key member of the finance senior management team. You will take responsibility for the management of the performance of the financial services team ensuring the delivery of a professional, dynamic, efficient and proactive service to meet the needs of the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Clatterbridge Cancer Centre NHS Foundation Trust &lt;/em&gt;&lt;em&gt;is committed to safeguarding and promoting the welfare of children, young people and adults and expects all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We take an active responsibility for &lt;/em&gt;&lt;em&gt;ensuring systems, policies and processes are in place to safeguard children, young people and adults. We support the national and local safeguarding agenda, including local arrangements for the protection of children young person and adults at risk.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This job is unlikely to attract a Tier 2 Certificate of Sponsorship (formerly a work permit). Applications from candidates who require Tier 2 immigration status to work in the UK may not be considered if there are a sufficient number of other suitable candidates. To apply for a Tier 2 Certificate of Sponsorship, employers need to demonstrate that they are unable to recruit a resident worker before recruiting an individual overseas. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo BowdenJob titleDeputy Director of FinanceEmail addressjoanne.bowden1@nhs.netTelephone number07387546143Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, please contact Joanne Bowden (Deputy Director of Finance) on 07387546143.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121459.png", "name": "The Clatterbridge Cancer Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121459"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Clatterbridge Cancer Centre - Wirral, Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Head of Financial Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252912", "validThrough": "2020-11-15T23:59:59+0000"}