{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T13:45:58+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within North Bristol NHS Trust’s Temporary staffing department; NBT extra.&lt;/p&gt;\n&lt;p&gt;Placement officers are required to work within a dynamic team within North Bristol NHS Trust’s temporary staffing bureau. You will play a critical role in keeping the hospital running by coordinating the timely flow of temporary staffing, providing temporary staffing for all staffing groups.&lt;/p&gt;\n&lt;p&gt;Paying up to £21k, with excellent pension and benefits - including up to 20% NHS discount from a huge range of retailers for meals, clothes, phone, travel etc. AND, in the NHS you start on 27 days of annual leave (PLUS bank holidays) which increases up to a maximum of 33 with continuing service!!&lt;/p&gt;\n&lt;p&gt;Why apply for a Placement Officer vacancy?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working pattern covering 37.5 hour per week, including 1 weekend per month&lt;/li&gt;\n&lt;li&gt;Shifts vary to cover opening hours 6.30 – 22.00 Monday to Friday, 06.30 – 20.00 Weekends and Bank Holidays&lt;/li&gt;\n&lt;li&gt;Variety in your day to work day workload&lt;/li&gt;\n&lt;li&gt;An opportunity to support one of the largest NHS Trust in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are looking for a role where you can make a difference then look no further! You will play a critical role in enabling the Trust to improve patients’ lives and make the world a better place!&lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;As a Placement Officer within NBT eXtra – the Trust’s temporary supply of temporary staff from our database to fill vacant shifts called in by hospital managers. Key duties will therefore include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Taking requirements from managers and logging them on the system&lt;/li&gt;\n&lt;li&gt;Identifying, contacting and booking staff from our database to fill empty shifts&lt;/li&gt;\n&lt;li&gt;Providing a high standard of customer service to both managers and temporary staff, predominantly by telephone, but also using email and SMS&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;As the successful Placement Officer you will need :&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent customer service skills with an excellent telephone manner&lt;/li&gt;\n&lt;li&gt;Good admin (including PC) skills and experience&lt;/li&gt;\n&lt;li&gt;Good Communication skills both written and verbal&lt;/li&gt;\n&lt;li&gt;The ability to work within a team and under own initiative&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An understanding of the different types of staff group within a hospital setting would also be an advantage&lt;/p&gt;\n&lt;p&gt;This unique opportunity offers an exceptional service driven individual the next step in their career, the role is varied and at times challenging but plays an integral role in the smooth running of a successful Temporary Staffing service which provides high calibre staff to the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join our forward thinking Trust and be a part of our success. If this sounds like you and you are interested in applying, you should highlight how you meet the criteria through your employment history, qualifications and within your supporting information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Vicky Packer&lt;/p&gt;\n&lt;p&gt;Job title: Head of Temporary Staffing&lt;/p&gt;\n&lt;p&gt;Email address: vicky.packer@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0117 414 6000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Placement Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250394", "validThrough": "2020-11-15T23:59:59+0000"}