{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21000", "minValue": "21000", "unitText": "YEAR", "value": "£21k per year"}}, "datePosted": "2020-10-14T11:28:11+0100", "description": "&lt;p&gt;&lt;strong&gt;HCA | Outpatients | Flexible rota | Slough | Full Time | £21k per year &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Thames Valley Hospital are looking to recruit an experienced Healthcare Assistant to join our fantastic Outpatients team. You will be assisting with minor procedures and ophthalmology so experience in a clinical environment is a must.&lt;/p&gt;\n&lt;p&gt;Spire Thames Valley located in Slough provides the highest standard of private healthcare to patients from Berkshire and the surrounding areas. The hospital has a 45 bedded ward with 2 theatres, Endoscopy suite and 10 outpatient consultation rooms. Our modern hospital has a full multi-disciplinary medical team onsite.&lt;/p&gt;\n&lt;p&gt;We practice some of the most advanced treatments on the latest generation imaging and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading edge surgical procedures and excellence in specialist fields. The Hospital is linked to the Spire Windsor Clinic, an outpatient facility in Windsor. Although we can’t provide onsite parking during the day we do have free offsite availability located a 5 minute walk away.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working as a HCA in Outpatients your tasks will include observations, ECG’s and assisting with basic ophthalmology such as scans. You will be expected to assist with phlebotomy through to minor procedures in our Outpatient department. Our rota covers Monday to Friday and typical shift patterns will be 8am – 4pm and 1pm – 9pm.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to have experience working as a HCA within a hospital environment&lt;/li&gt;\n&lt;li&gt;NVQ level three in Health and Social care would be a benefit&lt;/li&gt;\n&lt;li&gt;Flexibility to work a mix of shifts on a varying rota&lt;/li&gt;\n&lt;li&gt;Experience with ophthalmology would be a benefit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Richard Marsom on richard.marsom@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham", "postalCode": "SL3 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5428", "longitude": "-.572397"}}, "title": "Healthcare Assistant – Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225964", "validThrough": "2020-11-14T23:59:59+0000"}