{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "39681", "unitText": "YEAR", "value": "Up to £39,681 FTE DoE"}}, "datePosted": "2020-10-27T14:45:01+0000", "description": "&lt;p&gt;&lt;strong&gt;What: Highly Specialist Dietitian&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Up to £39681 FTE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Negotiable&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Cygnet Hospital Ealing, 22 Corfton Road, Ealing, W5 2HT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in a career in the field of Eating Disorders?&lt;/strong&gt; We are currently looking for an enthusiastic Registered Dietitian to join our team of dietitians working within our specialist mental health and eating disorder services for women.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sunrise Ward&lt;/strong&gt; at Cygnet Hospital Ealing provides a highly specialised eating disorder service for 14 women, including those with extremely low BMIs. Sunrise focuses on supporting service users to attain a healthy BMI and prepare for a return home. Sunrise has two distinct areas to support people at varying points on their recovery journey, taking a person from admission through to rehabilitation and preparation for a return home. Sunrise is able to admit individuals with extremely low BMIs. The unit is highly experienced in providing nasogastric feeding, where this is deemed the most appropriate intervention.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In order to fully address the complexity of the problems experienced by the service users on Sunrise Ward, treatment focuses on the following three elements:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Weight restoration and physical harm reduction through the institution of an appropriate meal plan.&lt;/li&gt;\n&lt;li&gt;Cognitive reconstruction via individual and/or group therapy to improve ego strength, conflict resolution, personal identity, and self-acceptance at normal body weight.&lt;/li&gt;\n&lt;li&gt;Psychosocial functional enablement via individual and/or group psychoeducative, creative, and experiential activities.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we want from you? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want you to work closely with the MDT in assessing, implementing, monitoring and evaluating a dietetic programme of care for service users with an Eating Disorder.&lt;/p&gt;\n&lt;p&gt;You will manage dietetic assessment and carry out specialist interventions at an individual and group level. You will manage a range of complex presentations including nutrition support, weight management and individuals requiring refeeding plans.&lt;/p&gt;\n&lt;p&gt;You will be skilled in dietetic assessment of a clients’ needs, resulting in an individualised dietetic plan for that client and work in close collaboration with the catering team and wider multi-disciplinary team to provide specialist advice on oral and non-oral feeding regimes including calculation of nutritional requirements based on the interpretation of biochemistry, anthropometry, clinical condition and other physical parameters. You will attend weekly MDT meetings to provide expert advice to clinicians regarding the progression of nutrition support which is evidence based and ensure all care documentation is complete.&lt;/p&gt;\n&lt;p&gt;Candidates should be a Registered Dietitian, with experience of working in a mental health setting, with excellent communication and IT skills. We have a robust clinical supervision structure and you will receive regular peer supervision, with a strong emphasis placed on Continued Professional Development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a  Highly Specialist Dietitian with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A degree / postgraduate diploma (or equivalent) in Dietetics, registration with HCPC (Health Care Professions Council) and membership of the BDA (British Dietetic Association) and Mental Health Group.&lt;/li&gt;\n&lt;li&gt;Experience in the field of mental health and eating disorders evidenced by sound clinical knowledge. Experience of working in inpatient/acute settings would also be beneficial.&lt;/li&gt;\n&lt;li&gt;Evidence of being a strong team player with a genuine desire to help others&lt;/li&gt;\n&lt;li&gt;Excellent communication / time management skills.&lt;/li&gt;\n&lt;li&gt;Enthusiasm, motivation and passion.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is exciting about this post? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will also have the opportunity to participate in policy development, audit, research activities, pathway development, staff and student training at both a local and national level.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Will there be other dietitians? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is part of a wider national dietetics team at Cygnet. Members of the team provide services to children and young people, eating disorders, learning disabilities, brain injury and mental health inpatient services. Everyone has a dedicated onsite line manager for day to day support and then an additional tier of professional and clinical support from our Director of Speech and Language Therapy and Dietetics. We also have a team of 50 Speech and Language Therapists who work closely with our Dietitians for dysphagia management. You will work daily alongside psychiatry, nursing and care, occupational therapy and psychology colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;What else is on offer? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your commitment and dedication we offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent Clinical Supervision, CPD and developmental opportunities for clinical and non-clinical duties&lt;/li&gt;\n&lt;li&gt;Full support from an onsite multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Appraisal and peer supervision with other Dietitians&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Employee rewards and discount benefits scheme including NHS discounts and cycle to work scheme.&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit, providing fitness programmes, nutrition consultation and health checks.&lt;/li&gt;\n&lt;li&gt;Full induction training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note vacancy may close prior to this date if a large number of applications are received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "22 Corfton Rd, Hanger Hill, London", "postalCode": "W5 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5212", "longitude": "-.297112"}}, "title": "Highly Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245007", "validThrough": "2020-11-27T23:59:59+0000"}