{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc."}}, "datePosted": "2020-10-15T11:02:09+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the Service and Role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a number of high energy and dedicated nurses to join the staffing team in HMP Wandsworth. &lt;br /&gt;&lt;br /&gt;Currently there are vacancies Band 5 nurses in the Addison Unit. The Addison Unit is a 12 bedded mental health unit ran by the prison service in which SLaM deliver Mental Health provision. The unit consists of a Multi-Professional Team of medical, nursing and OT staff. The unit operates a 24/7 nursing shift pattern in addition to support from prison officers who manage the operational environment, including the opening of cell doors. The Mental Health Team working within Addison Unit provides assessment and treatment to those prisoners with a range of acute mental health needs in order to support them to recover and move back to the mainstream prison environment or be transferred out to hospital to receive further treatment under the Mental Health Act. The joint working with the prison officer is imperative ad you will work closely with them, as well as interacting with a number of other internal and external stakeholders. &lt;br /&gt;&lt;br /&gt;In May 2016 Wandsworth was named as one of the UK’s six new reform prisons, at the forefront of the Ministry of Justice’s strategy for the biggest shake-up of prisons since the Victorian era. This is an exciting opportunity for the right candidate as HMP Wandsworth has been chosen in light of the changes made in the Prisons Reform Bill. The bill provides a new legal status for prisons whereby the prison management would have more control and direction over how the prison would be run. Prisoners will be given training and opportunities to ensure that they acquire meaningful qualifications.&lt;br /&gt;&lt;br /&gt;Working in HMP Wandsworth is a fast-paced and diverse role which differs from working on mental health wards due to the prison setting. Candidates interesting in working in forensics will find it highly stimulating and will be given opportunities to develop within the forensic specialism. &lt;br /&gt;&lt;br /&gt;You will be a mental health nurse with a real interest in forensic mental health. Past experience in a forensic setting is desirable but it is not essential. Our focus is to identify staff with a strong belief in recovery and who are comfortable working closely with forensic prisoners. This type of setting will provide challenges and it is important that you have good understanding of caring for patients with acute mental health backgrounds. You will be approachable, energetic and resilient.&lt;br /&gt;&lt;br /&gt;We are looking for ambitious staff with the desire for self-development. We offer you a comprehensive induction, regular clinical and managerial supervision as well as promoting continuous professional development to provide you with opportunities to progress and ensure that best practice is delivered in the prison. &lt;br /&gt;&lt;br /&gt;Please note that prison vetting will need to be undertaken for this role. While we await prison clearance we will look to start staff within our main stream forensic services as part of their induction. These posts receive inner London weighting.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;If successful at shortlisting stage you will be contacted regarding the next stage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South London Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London Mental Health and Community Partnership (SLP) is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracey Lewis on 020 8588 4000 Ext 4576 or 0796&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wandsworth Prison, Heathfield Rd, London SW18 3HS, Wandsworth, London", "postalCode": "SW18 3HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4482", "longitude": "-.191501"}}, "title": "Registered Mental Health Nurse (NHS), HMP Wandsworth", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227861", "validThrough": "2020-11-07T23:59:59+0000"}