{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "Starting salary from £24,907 per annum"}}, "datePosted": "2020-10-28T08:16:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Following an internal promotion we are looking to recruit a Band 5 Roster Co-ordinator to join our friendly HealthRoster team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition to acting as a system administrator for the HealthRoster system and associated modules, the current focus of the team is the wider deployment of Allocate Optima products. We are searching for an enthusiastic, proactive and resourceful individual to support the full implementation of SafeCare across all appropriate nursing &amp; midwifery areas, HealthRoster and Allocate ‘Me’ across the entire ESNEFT organisation and the full suite of Medics Optima modules to Clinicians.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that applicants have experience and knowledge in the use of Microsoft Office Products, particularly Excel, and in eRostering systems, ideally Allocate HealthRoster. The successful applicant will be supported to undertake the Allocate Academy Accreditations to achieve Certified Administrator and Certified Professional status for the range of Allocate products.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The team support staff at all levels within ESNEFT therefore applicants must be able to communicate verbally in a clear and concise manner, and have experience of preparing and presenting subjects to large and small audiences in person and via on-line platforms.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;The post is currently a combination of working from home and at either the Colchester or Ipswich Hospital sites. The preferred Hospital base will be discussed at interview. There will also be a requirement to travel to Community based sites across East Suffolk and North Essex on occasions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The current plan is that interviews will take place on-line via TEAMS. Interview date 19th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSue BlunstenJob titleHead of ESR, Rostering and PayrollEmail addressSue.Blunsten@esneft.nhs.ukTelephone number07788360457Additional contact information&lt;/p&gt;\n&lt;p&gt;Sara Hyde – Roster &amp; Systems Project Manager - 07784 030845&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich/Colchester", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Roster Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245719", "validThrough": "2020-11-06T23:59:59+0000"}