{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T12:16:13+0000", "description": "&lt;p&gt;Have you recently qualified as a Health Visitor and are looking for an opportunity to consolidate your practice with help and support from dedicated colleagues? Or are you an experienced, innovative Health Visitor looking for a fresh challenge with a well- established community provider?&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen for committed, inspirational and innovative Health Visitors to join our experienced skill mix 0-19 team in St Helens. We welcome both full time and part time applicants for the posts available.&lt;/p&gt;\n&lt;p&gt;You will work as a key member of one of our integrated 0-19 Teams in the delivery of the National Healthy Child Programme, with individual responsibility for managing a caseload of children within universal, universal plus, and universal partnership plus levels of need.&lt;/p&gt;\n&lt;p&gt;You will also be involved in a range of public health activities within a geographical area, to include individuals, groups and communities. As a key stakeholder in the protection of children, you will be required to work collaboratively with other agencies to meet their needs.&lt;/p&gt;\n&lt;p&gt;Successful applicants will benefit from a full induction and preceptorship programme where appropriate.&lt;/p&gt;\n&lt;p&gt;Regular clinical and safeguarding supervision will also be provided as will access to relevant internal and external training/development opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT: &lt;/strong&gt;The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;This post is subject to&lt;strong&gt; an enhanced with adults and children’s barred list &lt;/strong&gt;Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure and, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caiti O&#39;Callaghan - Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;Caiti.OCallaghan@nwbh.nhs.uk / 01744 624321 or 07831118657&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, St Helens", "postalCode": "WA11 0NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4682", "longitude": "-2.65705"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255783", "validThrough": "2020-11-22T23:59:59+0000"}