{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T11:00:55+0000", "description": "&lt;p&gt;An opportunity has arisen for an 8 a Lead CNS position in UHCW Upper GI clinical nurse team. The post holder specifically would provide leadership and have managerial responsibility for Upper GI specialist nursing team but also would be accountable for, and provide leadership to, our small team of Hepatic, Pancreatic and Biliary clinical nurse specialists, providing senior support to ensure that both nursing services are sufficiently empowered to deliver high quality care for patients with Upper GI and HPB conditions&lt;/p&gt;\n&lt;p&gt;The successful applicant must be a driven individual focused on delivering patient centred care with a commitment to providing a quality service that is responsive to the changing needs of patients accessing the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work as a skilled practitioner within the Upper Gastro Intestinal speciality, providing expert clinical knowledge and support as part of the clinical pathways for Upper GI. They will support HPB specialist nurses and clinicians to develop clinical pathways for HPB services. They will provide highly specialised technical skills in Upper GI and coordinate the provision of nurse led clinics for both Upper GI and HPB services which may be for benign conditions or cancer patients, as and when required.&lt;/p&gt;\n&lt;p&gt;The post holder is required to ensure that patients and families are central to the delivery of care, implementing new innovations and practices facilitating and leading the team in the provision of education and support to other professionals and patients&lt;/p&gt;\n&lt;p&gt;Understanding the need for change you must be a flexible leader, open and be able to support and motivate your team. This is an excellent opportunity to demonstrate your passion and drive for quality improvement. You will be able to promote your skills and experience in supporting and nurturing staff to deliver the highest quality of care and shape the strategy for Upper GI and HPB services at UHCW moving forward.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated nurse with a passion for both patient care and the continual improvement of nursing standards. Evidence of leading change and care improvement is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo KeechJob titleGroup Director Nursing &amp; Allied Health ProfessionalsEmail addressjo.Keech@uhcw.nhs.ukTelephone number024 76 96 6124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW NHS TRUST, COVENTRY", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Lead Clinical Nurse Specialist - Upper Gastrointestinal/HPB Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246210", "validThrough": "2020-11-11T23:59:59+0000"}