{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T12:16:24+0100", "description": "&lt;p&gt;Full Time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a motivated, Registered Nurse or Registered Operating Department Practitioner to join our busy team within Theatre Services in Neath Port Talbot Hospital. We welcome applicants who share The Values and Behaviours of Swansea Bay UHB.&lt;br /&gt;&lt;br /&gt;A Full Time vacancy is available for a scrub practitioner. The successful candidate may also be required to work in the Theatre Departments across all three hospital sites within the Health Board when service demands require.&lt;br /&gt;&lt;br /&gt;Theatre documentation is recorded electronically, so IT skills are essential.&lt;br /&gt;&lt;br /&gt;This post will involve caring for patients within the Theatres Department and specialising in scrub. The patients you will care for will undergo surgery of various specialities and you will be expected to manage a patients care throughout the perioperative stage, to their discharge. You will be part of a motivated Team engaged in the challenges of an ever changing environment and be expected to become an efficient and effective Team member. Other duties include moving different types of equipment, and patients on trolleys to ensure an effective and efficient flow of patients through the Theatre setting. &lt;br /&gt;&lt;br /&gt;This is a physically and mentally demanding job and the successful candidate will have to prove they can be adaptable to keep up with this ever changing environment.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;SisterJade RouseTheatre Speciality Manager&lt;/p&gt;\n&lt;p&gt;jade.rouse@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01639 862183&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Neath Port Talbot Hospital", "postalCode": "SA12 7BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5992", "longitude": "-3.80037"}}, "title": "Qualified Theatre Practitioner Nurse/ODP (Scrub)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240485", "validThrough": "2020-11-08T23:59:59+0000"}