{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "35000", "unitText": "YEAR", "value": "Up to £35,000pa DoE FTE"}}, "datePosted": "2020-10-06T11:15:07+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a confident Band 6 Occupational Therapist who would like to explore a more rewarding clinical challenge working as part of a new initiative as a Bank Occupational Therapist working across a variety of settings? Are you ready to develop your clinical skills further in a supportive regional occupational therapy team? We want to recruit an exceptional OT to our Occupational Therapy Band 6 post. We may consider an experienced Band 5. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to further your career with us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to work as a Specialist Band 6 Occupational Therapist within our community based step down service at Cygnet Gledholt. The role would provide the opportunity to work within a rehabilitation setting in one of our Step Down facilities. The post will also be working alongside Band 7 Occupational Therapist at brand new service Cygnet Gledholt Mews.&lt;/p&gt;\n&lt;p&gt;The role will have the opportunity to working alongside some of our extremely talented occupational therapists and wider therapy teams across the West Yorkshire region. The successful candidate will be supported by a number of experienced OT’s and given regular clinical supervision and access to our Practice Development Group (PDG) meetings and regional meetings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt;(Band 6) Specialist Occupational Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base:&lt;/strong&gt;Cygnet Gledholt&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for:&lt;/strong&gt;The post holder will line manage Activity Coordinators&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt;Service Manager for Line management supervision &amp; Occupational Therapist (Band 7 or above) for professional supervision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;dependent upon service need&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Cygnet Gledholt&lt;/p&gt;\n&lt;p&gt;Join our supportive friendly team and make an application today.&lt;/p&gt;\n&lt;p&gt;With over 150 OTs in the company, we also work together as a large team providing support to each other across the group, with various specialist interest groups to tap into, including Mental Health, Neuropsychiatry, Autism, Learning Disabilities and Sensory Integration, to name a few.&lt;/p&gt;\n&lt;p&gt;As an Occupational Therapist, you will provide direct clinical care which will encompass OT assessments, treatment and management of residents within the service.&lt;br /&gt; &lt;br /&gt; In this role you will assess, implement and develop an OT treatment programme according to our service user’s diagnosis and identified needs. This will be based upon findings from assessments including associated risks, in order to develop treatment plans accordingly.&lt;br /&gt; &lt;br /&gt; Prioritisation skills are key to manage the caseload of clients effectively and you will work closely with the Occupational Therapy and multidisciplinary team onsite.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We care about people in our services&lt;/li&gt;\n&lt;li&gt;Career pathway progression within the company to support your development and skills&lt;/li&gt;\n&lt;li&gt;You will be part of a team providing excellent care to our residents.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;4. &lt;/strong&gt;National networks of over 150 OTs in the Cygnet Group within different specialisms including Forensic Practice, LD and ASD, Acute mental health, PICU, and inpatient CAMHS&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;The Successful Candidate should be/have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered Occupational Therapist with the HCPC (Health Care Professions Council)&lt;/li&gt;\n&lt;li&gt;Experience in the field of adult Mental Health&lt;/li&gt;\n&lt;li&gt;Working as a Band 5 or Band 6 OT&lt;/li&gt;\n&lt;li&gt;An understanding of Occupational Therapy process/interventions and can take a “hands on” approach&lt;/li&gt;\n&lt;li&gt;Excellent communication and time management skills&lt;/li&gt;\n&lt;li&gt;Ability to manage highly demanding clinical presentation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary of up to £35,000pa FTE DoE&lt;/li&gt;\n&lt;li&gt;Opportunities for CPD and to undertake further learning and development. For example: Leadership and Management, Sensory Integration.&lt;br /&gt; Training days provided by highly experienced and renowned OT specialists&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision and peer support&lt;/li&gt;\n&lt;li&gt;Bi-monthly OT CPD meetings focused on skill and strategic service development.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS Discount Cards &amp; Blue Light Card&lt;/li&gt;\n&lt;li&gt;Free parking &amp; meals on duty&lt;/li&gt;\n&lt;li&gt;Relocation packages offered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt;*Please note - speculative recruitment emails are not to be sent directly to our clinical staff, these need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own*&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please our dedicated Occupational Therapy in-house recruiter Hayleyvalentine@cygnethealth.co.uk&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD1 4EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6463", "longitude": "-1.7973"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214389", "validThrough": "2020-11-27T23:59:59+0000"}