{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-09T08:16:09+0100", "description": "&lt;p&gt;School Health Nursing in Oxfordshire is a dynamic service offering a high quality of care to children, young people and their families. We deliver the healthy child programme in school providing face to face support, contributing and delivering sessions as part of the Personal, Social and Health Education curriculum and coordinating immunisations sessions. We also have a significant role to play in child protection. This role is within our small but excellent primary school team&lt;/p&gt;\n&lt;p&gt;We recognise the importance of the Specialist Community Public Health Nurse qualification and so all of our school nurses have this qualification (or equivalent) . &lt;strong&gt;For this post we require someone who holds the SCPHN qualification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you choose to come and join us, you would be supporting children and young people in school, ensuring that the relevant public health messages are shared in creative ways. You will also be offering support to vulnerable children and young people who may be looked after or have a child protection plan in place and ensuring children with specific medical conditions are able to access learning opportunities. This makes the school health nurse role varied and stimulating, as no two days are ever the same.&lt;/p&gt;\n&lt;p&gt;We recognise that this work can be a challenge for staff so we have a robust support system in place - a comprehensive induction plan, weekly clinical meetings with other practitioners in the team, as well as a preceptorship programme. Oxford Health also offer regular opportunities for personal development.&lt;/p&gt;\n&lt;p&gt;Due to the geographical locations of the schools, own car or access to alternative travel for business use is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Janette Dixon&lt;/p&gt;\n&lt;p&gt;Job title: Area Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: janette.dixon@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07789 270930&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX4 1XD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7473", "longitude": "-1.23249"}}, "title": "School Health Nurse (term-time only)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219429", "validThrough": "2020-11-08T23:59:59+0000"}