{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-10-26T11:16:29+0000", "description": "&lt;p&gt;UNIVERSITY HOSPITAL OF NORTH MIDLANDS NHS TRUST&lt;/p&gt;\n&lt;p&gt;Directorate of Trauma&lt;/p&gt;\n&lt;p&gt;Senior Training Fellow in Trauma and Orthopaedics&lt;/p&gt;\n&lt;p&gt;The Trust is one of the largest and busiest acute hospitals in the country, each year we care for over 900,000 people who come to us for emergency treatment, planned operations and medical care. We are a teaching hospital in partnership with Keele University and we have a patient-centered clinical research facility providing state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;University Hospital has two sites - the Royal Stoke University Hospital, located in Stoke-on-Trent, and the County Hospital, located in Stafford.&lt;/p&gt;\n&lt;p&gt;From these hospitals we provide a full range of general acute hospital services for approximately 700,000 people living in and around Staffordshire and beyond. The Trust also provides specialised services, such as Trauma, for three million people in a wider area, including neighbouring counties and North Wales.&lt;/p&gt;\n&lt;p&gt;As one of the most challenging and exciting Directorates in the Trust we provide a range of general and specialist orthopaedic services to the local and extended population. We are committed to clinical and academic excellence and can provide you with a wealth of experience, research and audit opportunities.&lt;/p&gt;\n&lt;p&gt;As one of the most challenging and exciting Directorates in the Trust we provide a range of general and specialist orthopaedic services to the local and extended population. We are committed to clinical and academic excellence and can provide you with a wealth of experience, research and audit opportunities.&lt;/p&gt;\n&lt;p&gt;Whilst this post is not recognised for training you will be joining our current team of 24 SpR’s and 12 ST/CT lower level posts and have equal access to teaching.&lt;/p&gt;\n&lt;p&gt;You will participate fully in the Directorate’s education programme and have the opportunity to build on your skills in the full range of trauma and orthopaedic services - including, trauma and elective theatres, fracture clinics, ward work. The post is for a fixed term contract from January 2021 until 3rd August 2021&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Ashique Ali, Consultant Orthopaedic Surgeon - Via Switch&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RSUH and County, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Senior Training Fellow in Trauma &amp; Orthopaedics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242180", "validThrough": "2020-11-09T23:59:59+0000"}