{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-06T12:31:23+0000", "description": "&lt;p&gt;Frontier Pathology is a joint venture between Surrey and Sussex Healthcare NHS Trust and Brighton and Sussex University Hospitals NHS Trust. We are an innovative partnership of NHS pathology services, established to secure and develop pathology services for clinicians and their patients in Brighton, Surrey and Sussex. We provide pathology services in a wide variety of settings, serving our founding Trusts, other NHS and private hospitals and primary care organisations.&lt;br /&gt;&lt;br /&gt;We are looking for a self-motivated individual who is both flexible and versatile in their approach to work to join our excellent and friendly admin team. You must be able to work well under pressure and in challenging conditions. You will be a strong team player with good interpersonal skills and will possess a positive attitude and be constructive toward change.&lt;/p&gt;\n&lt;p&gt;We have a vacancy for a full-time (Monday-Friday) employee. We also provide a weekend service in which successful applicants will be invited to participate in after full training.&lt;br /&gt;&lt;br /&gt;You must have excellent keyboard skills, adaptability and a capacity for processing information quickly and accurately. You must also be willing to show a commitment to the ever changing demands of the NHS.&lt;br /&gt;&lt;br /&gt;Skills required:&lt;br /&gt;Clear speaking voice&lt;br /&gt;Provide a high quality, responsive and efficient reception service&lt;br /&gt;Excellent telephone manner with sound communication skills&lt;br /&gt;Methodical and organised with the ability to prioritise workload&lt;br /&gt;Demonstrate accuracy and attention to detail&lt;br /&gt;Team Player&lt;br /&gt;&lt;br /&gt;The Trust asks all staff to attend an induction programme.&lt;br /&gt;Training will be undertaken locally.&lt;br /&gt;&lt;br /&gt;Travel to other Frontier Pathology sites may be required on occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ian Evans&lt;/p&gt;\n&lt;p&gt;Job title Pathology Support Services Manager&lt;/p&gt;\n&lt;p&gt;Email address ian.evans2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07789266330&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Catharine Perryment 01273 696955 ext. 7699 - email Catharine.Perryment@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Pathology Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259667", "validThrough": "2020-11-15T23:59:59+0000"}