{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-05T13:15:12+0000", "description": "&lt;h1&gt;&lt;strong&gt;Senior Clinical Research Nurse / Senior Clinical Trial Co-ordinator&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Thoracic Oncology Research Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5/6 (DOE)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Thoracic Oncology service at Royal Papworth Hospital NHS Foundation Trust provides specialist care for patients with lung cancer and mesothelioma. We see around 1,000 new patients a year with an emphasis on investigation, diagnosis, surgery and management of pulmonary complications of thoracic cancer. The service has an established reputation in the design and delivery of a wide portfolio of clinical research studies including randomised controlled trials, CTIMPs, imaging and translational research.&lt;/p&gt;\n&lt;p&gt;We currently have an exciting opportunity for a Senior Clinical Research Nurse / Senior Clinical Trial Co-ordinator to join our dynamic, friendly and supportive multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for a resourceful, organised and flexible team player with an eye for detail who takes pride in their excellent communication skills. You will have experience of working in a patient-facing role or demonstrate the skills and empathy needed to thrive in this environment. Ideally you will have a good understanding of ICH-GCP, clinical oncology and experience of caring for patients undergoing investigation or treatment for cancer. However, applications from candidates with relevant knowledge and experience who demonstrate enthusiasm, commitment and aptitude to develop personally and professionally in this specialist area will be considered. The successful candidate will benefit from an individualised orientation programme and access to relevant training, education and mentorship to support their development.&lt;/p&gt;\n&lt;p&gt;Royal Papworth Hospital NHS Foundation Trust has recently been rated as ‘outstanding’ across all five of the CQC domains; the first NHS Trust ever to achieve this. We recognise the fundamental importance of research in the delivery of high-quality patient care and are delighted that the CQC report praised the Trust’s commitment to research and innovation. With the move to our state of the art hospital on the Biomedical Campus and the Heart and Lung Research and Education Institute under way, there’s never been a more exciting time to join us!&lt;/p&gt;\n&lt;p&gt;This is a permanent, full-time Band 6 position. However, applications from candidates who have a preference for part-time hours (minimum 0.6 WTE) will be considered. Appointment at B5 may be discussed with candidates who demonstrate the potential to practice at a more senior level in time.&lt;/p&gt;\n&lt;p&gt;Please refer to the attached role profile and clearly demonstrate your suitability for this post when completing your application.&lt;/p&gt;\n&lt;p&gt;If you would like any further information, please do not hesitate to get in touch.&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact:&lt;/p&gt;\n&lt;p&gt;Amanda Stone - Team Leader, Oncology Research – amanda.stone5@nhs.net tel: 01223 639721 or&lt;/p&gt;\n&lt;p&gt;Amy Gladwell – Senior Research Administrator – amy.gladwell@nhs.net tel: 01223 638000 ext 86040&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Senior Research Nurse / Senior Trials Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257811", "validThrough": "2020-11-22T23:59:59+0000"}