{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-02T08:16:26+0000", "description": "&lt;p&gt;Are you looking for a new and exciting challenge? Are you passionate about improving services for the benefit of patients? And do you have the skills and energy to work in a team which is supporting change at a large acute hospital? If so then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and keen individual to join the Quality Improvement (QI) hub as a QI Administrator. This is an excellent role for someone who is organised and driven with an attention to detail and ability to work under pressure, along with a passion for delivering high quality work for the benefits of our patients. You will provide administrative support to our busy QI Team as well as working closely with the Deputy Director of Strategy &amp; Performance and Head of Quality Improvement &amp; PMO in supporting the delivery of a challenging QI agenda across the Trust. This is a key role working with colleagues across all areas to ensure that the Trust is in a strong position to meet the quality and financial challenges ahead. Day to day responsibilities will include administration support in the planning and facilitation of improvement projects, managing diaries for a busy QI team, organising meetings, minute taking, upkeep of action logs and preparing various documentation including reports and presentations. Support will also be required with the planning and preparation of a wide range of QI communication and engagement events.&lt;/p&gt;\n&lt;p&gt;To find out more, please contact Tamsyn Brown, QI Manager, on 07585 103171&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Quality Improvement Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251299", "validThrough": "2020-11-09T23:59:59+0000"}