{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 per annum inc"}}, "datePosted": "2020-11-02T11:31:56+0000", "description": "&lt;p&gt;Emergency Department Staff Nurse - Band 5&lt;br /&gt;&lt;br /&gt;Whipps Cross University Hospital&lt;br /&gt;&lt;br /&gt;We are currently looking to recruit enthusiastic and motivated band 5 nurses to join our Emergency Department at Whipps Cross University Hospital, Leytonstone which is currently being rejuvenated to meet the demands of our local community. If you&#39;re looking for your next role and an opportunity to work within a fast paced, dynamic environment as part of an experienced, committed team then we&#39;d be pleased to hear from you.&lt;br /&gt;&lt;br /&gt;The Adult Emergency Department at Whipps Cross Hospital is currently undergoing an exciting period of change which is reflected in the management of patients and the opportunities available to staff for personal and professional growth and development.&lt;br /&gt;&lt;br /&gt;This process of change requires new and exciting perspectives in relation to Emergency Care, and would provide an excellent challenge for those looking to develop further and be part of process change on a large scale, where your experience and input are valued and encouraged. We offer a structured orientation program and on-going supportive mentorship to ensure you quickly progress and develop the skills required to work in an acute setting whilst gaining experience in the management of patients with a diverse range of presenting complex medical / surgical pathologies.&lt;br /&gt;&lt;br /&gt;Those with an interest in care provision for the older person are also encouraged to apply, as we develop our service further to meet the needs and expectations of this particular aspect of care delivery. Candidates will have post registration experience. You will need to have the skills and abilities to deliver high standards of care and have the resilience to meet the challenges of our busy and stimulating work setting.&lt;br /&gt;&lt;br /&gt;You should be motivated, an excellent communicator and have proven organisational / clinical skills, and training will be given to develop these skills further.&lt;br /&gt;&lt;br /&gt;If family or other commitments inhibit your ability to take a substantive post then consider working for our bank, competitive rates of pay reflecting experience and qualification are offered with access to consistent and stable lines of work within our department. This could be the perfect opportunity for those looking to branch out into Emergency Care provision, but are not quite ready to leave their current position.&lt;/p&gt;\n&lt;p&gt;The Care Quality Commission has recognised the significant improvements made at Whipps Cross in their latest visit and the 2018 Staff Survey results showed staff have seen many improvements in their working lives. With our passionate staff and commitment to safe and compassionate care, we know Whipps Cross will keep getting better and better. We’d love you to join us on our journey to good and outstanding. Come and be part of the Whipps Cross family where you can make a difference.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Fiona McCreesh, Fiona.McCreesh@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross Hospital, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "A&amp;E Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251801", "validThrough": "2020-11-16T23:59:59+0000"}