{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 £37,638 to £44,780 PA inc HCAS"}}, "datePosted": "2020-11-03T15:01:04+0000", "description": "&lt;p&gt;&lt;span&gt;Every day our professionals provide high quality healthcare in people’s homes or at convenient local clinics and children centres, helping children and families to stay well, manage their own health with the right support and avoid unnecessary visits or long stays in hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Central London Community Health Trust (CLCH) has exciting opportunities available for passionate and committed Health Visitors across our boroughs Westminster and Kensington &amp; Chelsea &amp; Hammersmith and Fulham. We are looking for candidates with excellent clinical and communication skills to join our 0-19 skill mix teams contributing to delivery of ‘The Healthy Child programme’. You will help make a tangible difference to peoples’ lives and enjoy the very best of London life on your doorstep.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In our latest CQC inspection CLCH was awarded a &quot;good&quot; rating. UNICEF awarded us the prestigious Baby Friendly Award in recognition of our &quot;truly inspiring&quot; support for breastfeeding mothers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;CLCH welcome applications from newly qualified and experienced Health Visitors. Some of the benefits of working with CLCH include: a robust preceptorship programme for the first 12 months, outstanding safeguarding support from our safeguarding team, and comprehensive suite of training for health visiting, to support re-validation, professional development opportunities and clinical supervision, staff awards and annual educators/mentors conference to celebrate the outstanding contributions made by our staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer help with transport and annual season tickets, cycle scheme as well as the inner and outer high cost area supplements for working in London with additional benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to join our team and make a tangible difference to children, young people and families lives we would like to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Westminster, Kensington and Chelsea, Hammersmith and Fulham, London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254463", "validThrough": "2020-11-24T23:59:59+0000"}