{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-30T12:00:34+0000", "description": "&lt;p&gt;Looking for a fresh career within Psychiatric Intensive Care (PICU)?&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust is recruiting for our brand new PICU Service which opened July 2017 – we are seeking an exceptional Band 5 Staff Nurse now!&lt;/p&gt;\n&lt;p&gt;This is an exciting time for LPFT, as we continue on our journey of service improvement, undergoing a range of service transformations and delivering high standards of care for our patients.&lt;/p&gt;\n&lt;p&gt;The Hartsholme Centre PICU is a new 10 bed, male only unit based on one of our sites in central Lincoln , with state of the art design and technology being incorporated into the new facility– it’s a– all this with easy access via the A1 and A46 to Newark, Nottingham, Sheffield, Grantham, Grimsby &amp; Hull – all within an 1 hour.&lt;/p&gt;\n&lt;p&gt;We are seeking only the best Staff Nurse, those who really wants to ‘make a difference’, with the Trust values at the core of patient care.&lt;/p&gt;\n&lt;p&gt;To be successful in this role, you will need to be self–motivated, enthusiastic and empathetic to the needs of patients&#39; during the acute stage of a mental health episode. You will be required to have excellent communication skills, be resourceful, and keen to demonstrate the distinctive contribution and added value the Staff Nurse can offer the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;You will be joining a forward thinking Trust, where, within the last 12 months our CAMHS team was rated as ‘outstanding’ in a recent CQC Comprehensive Inspection, whilst the Trust was recognised, as ‘good’ for being caring and responsive.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a large county which can offer you whatever you are looking for, in both your personal or your professional life. The county has vibrant towns and the City of Lincoln at its core, as well as idyllic rural villages, offering a high quality of life with affordable living, excellent education and social life facilities – sound interesting?&lt;br /&gt;LPFT offers an excellent benefits package, including up to £8k relocation, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;\n&lt;p&gt;**This post attracts an additional £3000 Environment Allowance per annum**&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartsholme Centre, Long Leys Road, Lincoln", "postalCode": "LN1 1FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2443", "longitude": "-.558276"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250056", "validThrough": "2020-11-20T23:59:59+0000"}