{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per Annum Pro rata"}}, "datePosted": "2020-10-27T13:01:10+0000", "description": "&lt;p&gt;We are seeking to appoint a Pathway Administrator to join our friendly and busy team in Trauma and Orthopaedics at the John Radcliffe Hospital in Oxford. The post will involve audio/digital transcription of all clinical correspondence which will need to be typed accurately within specified timescales. Due to the large volume of audio transcription, confident typing/keyboard skills are essential with a strong attention to detail. Previous audio transcription experience desirable. An understanding of medical terminology would be preferable but not essential along with good IT and administrative skills. The post involves dealing with telephone queries, ensuring the smooth running of the department, monitoring the patient pathways and providing full administrative support to Consultants and their teams. The post will also require the maintenance of RTT patient pathway validation and assisting with the Registrar’s Rota dealing with annual leave requests and timesheets, full training will be given once in post. Occasional cross department working may be required with our other services at the Nuffield Orthopaedic centre. If you are self-motivated and keen to join our small team then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Job Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Accurately transcribe from specified digital software, outpatient clinical correspondence to be of a high standard within specified timescales as well as general office duties including picking up emails and photocopying.&lt;/li&gt;\n&lt;li&gt;Be able to use your judgement and initiative to prioritise requests within defined guidelines.&lt;/li&gt;\n&lt;li&gt;Ability to deal with sensitive information with respect and in a confidential manner.&lt;/li&gt;\n&lt;li&gt;To comply with the requirements of Data Protection Act, Access to Health Records and legislation issued in relation to confidential data.&lt;/li&gt;\n&lt;li&gt;Confidently liaise with other departments, GP’s, external Trusts and patients to ensure smoothness and timely transition for the patient on their journey through the hospital.&lt;/li&gt;\n&lt;li&gt;Ensure that medical records and any other required documentation is available for clinical staff and filing is up to date and in the correct section of the patient notes.&lt;/li&gt;\n&lt;li&gt;Deal with complex enquires from staff/patients/relatives and visitors providing information/guidance and advice to ensure queries are dealt with.&lt;/li&gt;\n&lt;li&gt;Undertake specific duties in accordance with Trust policies and procedures to facilitate the patient pathway.&lt;/li&gt;\n&lt;li&gt;Ensure that the patient RTT data is accurate at all times.&lt;/li&gt;\n&lt;li&gt;Adapt a flexible attitude to meet the needs of the service, taking into consideration each department’s unique requirements such as specialist services.&lt;/li&gt;\n&lt;li&gt;Provide cover and work with colleagues as a Team during times of annual leave and sickness.&lt;/li&gt;\n&lt;li&gt;Promote an open and friendly working environment.&lt;/li&gt;\n&lt;li&gt;Adhere to the Trust Values, Policies and Procedures relevant to your post.&lt;/li&gt;\n&lt;li&gt;Be responsible for Registrar’s Rota helping coordinate cover when needed along with processing leave requests and timesheets.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGina Prickett-WestJob titleService ManagerEmail addressgina.prickett-west@ouh.nhs.ukTelephone number01865 572789&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TRauma Building - John Radcliffe Hospital, Oxford", "postalCode": "OX9 3DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.748", "longitude": "-.978645"}}, "title": "Pathway Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244643", "validThrough": "2020-11-10T23:59:59+0000"}