{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-06T11:45:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse - Critical Care (Adult)&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Permanent (Full time/Part Time) Vacancies&lt;br /&gt;&lt;br /&gt;In recent years the Trust has achieved high standards which have put it among the cleanest and safest hospitals in the country. The latest national inpatient survey puts us in the top 20% of hospitals with high standards for safety and privacy and dignity. &lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for Registered Nurses to join our friendly nursing team within Intensive Care.&lt;br /&gt;&lt;br /&gt;We have spacious, well equipped units with dedicated teams of Intensivists, experienced critical care nurses and proactive AHP&#39;s. The unit is dynamic and forward thinking; embracing new initiatives, change and the development of services.&lt;br /&gt;&lt;br /&gt;You would be caring for critically ill patients requiring multi organ support; responsible for assessing, planning and delivering a high standard of individualised nursing care.&lt;br /&gt;&lt;br /&gt;You will receive orientation to the unit and will be comprehensively supported with a full induction programme and ongoing development in the care of the critically ill patient.&lt;br /&gt;&lt;br /&gt;You must have a minimum of 12 months demonstrable post registration experience; and current acute setting experience is essential. Previous critical care experience is desirable but not essential. &lt;br /&gt;&lt;br /&gt;Ability to work internal rotation to night duty is essential.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Johanna Whieldon&lt;br /&gt;Lead Nurse &lt;br /&gt;johanna.whieldon1@nhs.net &lt;br /&gt;07585 966139 / 01332 786286&lt;br /&gt;&lt;br /&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional contact information&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Caroline Swan - Senior Sister &lt;br /&gt;Tel: 01332 340131 ext 89560&lt;br /&gt;Email: caroline.swan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Registered Nurse (Adult - Critical Care)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214510", "validThrough": "2021-04-06T23:59:59+0100"}