{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa based on full time hours"}}, "datePosted": "2020-10-27T08:30:18+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within Southern Health Foundation Trust (SHFT) to appoint an efficient and motivated Admin Co-ordinator to work within our 0-19 Children and Family Services team based at Eastleigh Health Centre. You will be joining a leading organisation that is both forward thinking and innovative. SHFT is committed to improving the quality of child health services across Hampshire and takes pride in rewarding the success of its staff.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As the Admin Co-ordinator you will assist the 0-19 clinical teams in the development and maintenance of a quality administrative service across a defined area. You will be required to provide high level support to the Admin Area Lead and Clinical Team Leads in all aspects of activity relating to the Business Unit function. Developing and maintaining close working relationships with key personnel, ensuring effective communication and workflow in all aspects of the business.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will also be required to use initiative, working autonomously in referring issues to other relevant parties as appropriate, ensuring confidentiality and security of information is maintained at all times, whilst providing good customer service experience for all staff and patients/customers. The role will include managing, supervising and allocating work to the admin team and responsibility for the team key performance indicators. Applicants must have excellent IT skills and be prepared to provide cross-cover support to other team’s and sites across the Area as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Admin Co-ordinator is integral to providing comprehensive administrative support to the clinicians who support the delivery of the Healthy Child Programme (HCP) to children, young people and families living within Hampshire.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This position is 20 hours per week all year round.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the post it is expected that you will have access to a car, a full driving licence and insurance for business use.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to Talk Flexible Working&lt;/strong&gt; - all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh", "postalCode": "SO31 4NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.876", "longitude": "-1.32727"}}, "title": "Administration Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243711", "validThrough": "2020-11-10T23:59:59+0000"}