{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "As per T&#39;s &amp; C&#39;s"}}, "datePosted": "2020-10-30T16:30:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in Palliative Medicine &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Applications are invited for a Specialty Doctor in Palliative Medicine post, based at Mount Vernon Cancer Centre in Northwood, London. This is a new substantive post for the department. The post comprises 10 programmed activities (PAs) and an on-call commitment.&lt;br /&gt;&lt;br /&gt;This is an excellent opportunity within the Palliative Medicine department at Mount Vernon. The appointed Specialty Doctor will take an active part in the provision of an integrated service working jointly with the Consultants in Palliative Medicine and Clinical Oncology to provide palliative care support within the hospital in-patient unit and in the out-patient departments. The Specialty Doctor will be encouraged to participate in an active audit programme as well as contribute to various training activities on site. Applications from those wishing to work part-time or job share are welcomed.&lt;/p&gt;\n&lt;p&gt;Mount Vernon Cancer Centre is the largest single site cancer centre in the south of England, with 22 clinical oncologists, 6 medical oncologists, 2 haematologists, 4 cancer radiologists and 3 palliative care physicians, serving 15 surrounding hospitals.&lt;br /&gt;&lt;br /&gt;Mount Vernon Cancer Centre is a stand-alone centre. There are 33 in-patient beds which included specialist palliative in-patient beds. We have a supportive care unit open 8 to 8 which provides support for emergency oncology patients and supportive treatment. Specialist medical and surgical care is provided by SLAs with Hillingdon, Watford and Harefield Hospitals.&lt;br /&gt;&lt;br /&gt;The Cancer Centre currently has 8 Linear accelerators (including 2 TrueBEAM machines capable of delivering rapid arc therapy) and two CT simulators. Development plans include the commissioning of MRI planning. The first Cyberknife facility in the NHS in the UK was established at Mount Vernon which has been clinical since 2010. . Research opportunities are excellent within the cancer centre and at all peripheral sites. &lt;br /&gt;&lt;br /&gt;It is imperative that you also attach your CV to your application as this is an integral part of the application process. Dependent on the number of applications, we may not contact you if you fail to do so. Please ensure to supply the names and addresses of referees. This must cover a period of 3 years with no gaps, one of whom must be your current employer.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To arrange an informal visit, please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mrs Jagdeep Kudhail, &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Divisional Chair&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;0203 826 2655&lt;/p&gt;\n&lt;p&gt;j.kudhail@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Marie Joseph, Palliative Care Consultant &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;07504211803&lt;/p&gt;\n&lt;p&gt;marie.joseph1@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Suzy Mawdsley, Clinical Director &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;0203 826 2437&lt;/p&gt;\n&lt;p&gt;suzannah.mawdsley@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date 15th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mount Vernon, Northwood", "postalCode": "HA6 2RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6149", "longitude": "-.445801"}}, "title": "Specialty Doctor in Palliative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250942", "validThrough": "2020-11-15T23:59:59+0000"}