{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-29T10:01:52+0000", "description": "&lt;p&gt;&lt;strong&gt; BAND 6 COMMUNITY NURSE – INTENSIVE SUPPORT TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Learning Disabilities Division&lt;/p&gt;\n&lt;p&gt;Our Team has grown to match the increasing demands of and complexity of referrals through TCP hence, an exciting opportunity has arisen for a dynamic and innovative individual.&lt;/p&gt;\n&lt;p&gt;The Intensive Support Team works with individuals who have a learning disability, with additional complex and high risk needs, who may require a crisis intervention and intensive support to prevent placement breakdown, an admission to hospital or following discharge from an inpatient setting where required. The Intensive Support Team works with people within Birmingham and also people who are out of area to support the transforming care agenda.&lt;/p&gt;\n&lt;p&gt;You will be an experienced Nurse, flexible with excellent communication skills and a passion for integrated team working. With a registration in RNMH/RNLD you will work within the framework of a multi-disciplinary team to provide support and guidance to adults with learning disabilities and their carers within the Birmingham area.&lt;/p&gt;\n&lt;p&gt;Applicants should have experience of working with individuals who have a learning disability and the appropriate skills, knowledge and experience in relation to autism, challenging behaviour and mental health within an integrated model of service delivery.&lt;/p&gt;\n&lt;p&gt;You will have a extensive experience within Learning Disabilities. Car Driver and access to a car for work purposes essential.&lt;/p&gt;\n&lt;p&gt;In return for your dedication and commitment we offer opportunities to develop your career potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRory MacphersonJob titleTeam LeaderAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information, please contact:&lt;/p&gt;\n&lt;p&gt;Rory MacPherson on 0121 466 3990&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Greenfields, Birmingham", "postalCode": "B30 3QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4124", "longitude": "-1.90439"}}, "title": "Band 6 Community Nurse IST", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247815", "validThrough": "2020-11-12T23:59:59+0000"}