{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-23T18:17:24+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 5 OCCUPATIONAL THERAPY POST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 HOURS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FIXED TERM CONTRACT POST, 9 MONTHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Come and join the innovative teams at Midlands Partnership Foundation Trust&lt;/p&gt;\n&lt;p&gt;( MPFT), a Trust that values people, empowerment and partnerships.&lt;/p&gt;\n&lt;p&gt;As Allied Health Professionals (AHP’s), we focus on maintaining people’s essential life skills, making life better for our communities, using a recovery focused approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently recruiting a band 5 Occupational Therapist to work on Chebsey House, a female in-patient unit, based at St Georges Hospital in Stafford. This is a fixed term contract for 9 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Occupational Therapy students, who are about to qualify, are very welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Benefits package such as 35-41annual leave pro rota for part time (including bank holidays), NHS pension scheme – one of the most comprehensive and generous schemes in the UK, contractual entitlements such as generous maternity, paternity, adoption, sickness, working for the NHS can entitle you to many other discounts, A general internet search for NHS discounts will give this information.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Strong commitment to Supervision and preceptorship with robust process and documentation to support HCPC competencies.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Annual appraisal with genuine opportunities to identify and be supported to undertake further training related to professional development. For example recently training opportunities across OT have included LACLS – large Allens cognitive level screening, VdTMoCA – Vona du Toit Model of Creative Ability, quality improvement training.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Clear and robust AHP governance structures&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Regular specialist meetings&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Promote innovations locally and nationally.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to work with clear evidence base, utilising outcome measures, and audit.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt; Successful applicants will be able to function autonomously in multidisciplinary teams, with supervision from an experienced practitioner. There will be an expectation that the post holder will work flexibly, possess excellent communication and interpersonal skills and effective clinical reasoning. The post will involve taking responsibility for your own caseload of service users that you may care coordinate. There will be balance between generic and profession specific work. The environment could be fast pace and challenging, however, highly rewarding. Your role will involve working with other agencies, families, carers and local communities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact Stephanie Platt, OT Inpatient Lead on stephanie.platt@mpft.nhs.uk or 07870363557or Julie Barnhouse, Community Older Adult lead on julie.barnhouse@mpft.nhs.uk or 07811827793.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Band 5 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241489", "validThrough": "2020-11-16T23:59:59+0000"}