{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pa"}}, "datePosted": "2020-10-22T17:16:03+0100", "description": "&lt;p&gt;&lt;strong&gt;SPECIALTY DOCTOR - &lt;/strong&gt;&lt;strong&gt;Full Time - Permanent (10PAs)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty Doctor in Child and Adolescent Mental Health / Paediatric Neurodisability / General Practice with experience in mental health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Centre for Interventional Paediatric Psychopharmacology and Rare Diseases (CIPPRD) – National &amp; Specialist CAMHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Winner of 2015 RCPsych Award for Psychiatric Team of the Year: Children &amp; Adolescents&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to invite applications for a full time permanent Specialty Doctor post in Child &amp; Adolescent Psychiatry in Child and Adolescent Mental Health / Paediatric Neurodisability / General Practice with experience in mental health (10PA) to join the established Centre for Interventional Paediatric Psychopharmacology and Rare Diseases (CIPPRD), a national and specialist outpatient Tier 4 Child and Adolescent Mental Health Service. Part time applications will be considered.&lt;/p&gt;\n&lt;p&gt;The post is based within the CAMHS Clinical Academic Group of South London and Maudsley NHS Foundation Trust, the most comprehensive mental health service for children and young people in the country.&lt;/p&gt;\n&lt;p&gt;The Trust is a leading mental health service provider working in partnership with the Institute of Psychiatry, Psychology and Neuroscience as part of the King’s Health Partners Academic Health Sciences Centre.&lt;/p&gt;\n&lt;p&gt;There are excellent opportunities for professional development including management, training, research, and audit experience. There is also opportunity for teaching locally within the service to multi-disciplinary and medical colleagues, to post-graduates at King’s College London, and to psychiatry trainees on the Maudsley/SLaM training scheme.&lt;/p&gt;\n&lt;p&gt;The CIPPRD is headed by Professor Santosh and attends to children and young people up to the age of 18 years who present with a range of significant mental health difficulties with complex neurodevelopmental problems, acquired brain injury, childhood dementias and physical problems and provide extended care to those with rare diseases up to the age of 24 years. Translational research including innovative clinical trials on Rett Syndrome is currently underway in CIPPRD. Opportunities to participate in research are available and encouraged. CIPPRD was the winner of 2015 Royal College of Psychiatrists Award for the Psychiatric Team of the Year: Children &amp; Adolescents.&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside Professor Santosh, another Consultant Psychiatrist, and two Consultant Clinical Psychologists and Specialty Doctors in the service. The team includes a range of experienced staff, and supported by two full time administrators.&lt;/p&gt;\n&lt;p&gt;The Trust will be willing to obtain working visas for GMC registered overseas appointees if required.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interviews: will be scheduled two weeks after closing&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professor Paramala Santosh - Consultant Child &amp; Adolescent Psychiatrist and Head of CIPPRD&lt;/p&gt;\n&lt;p&gt;Email address - cipp@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Michael Rutter Centre, Denmark Hill", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Speciality Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239504", "validThrough": "2020-11-15T23:59:59+0000"}