{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62000", "minValue": "51668", "unitText": "YEAR", "value": "£51,668 – 62,000 Per Annum pro rata DOE"}}, "datePosted": "2020-11-02T11:54:39+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About our service&lt;/span&gt;&lt;/strong&gt; Mountain Healthcare is a leading provider of clinical based services who have a genuine concern for our clients, a sincere appreciation for our employees, and we want to do good things for other people. Mountain is built on core principals and commitments including quality, integrity, respect, kindness, courage, innovation and enjoyment. These values drive the understanding we care for our customers with and have helped us grow into the passionate company we are today. We are currently seeking a Clinical Psychologist for a Secure Children’s Centre. This modern, safe and secure bedded unit caters for boys and girls aged between 10 and 17. It is inspected by Ofsted and approved and licensed by the Department for Children, Schools and Families. The centre comes under Sheffield City Council Children and Young People’s Directorate and has been rated Outstanding / Good in Ofsted inspections with the Youth Justice Board consistently rating as performing at the highest level. The purpose of the centre is to serve both local and national communities by looking after those children and young people who need a safe and controlled yet child centred secure residential environment in order to prevent harm to themselves or to others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Position Summary&lt;/span&gt;&lt;/strong&gt; This post provides you with the opportunity to be part of an evolving team working alongside the care and education staff within a Secure Children’s Home to maximise and tailor the support to both staff and young people.&lt;/p&gt;\n&lt;p&gt;The Secure Children’s home is a dynamic environment and you will be involved in continuing the delivery of a developmentally and trauma informed mental-health service model. This is based on the Secure Stairs framework across Young Peoples Secure Services and will include contact with the Secure Stairs National Clinical Implementation Team and NHS England Commissioners of services, to help ensure service delivery and fidelity to the model of care.&lt;/p&gt;\n&lt;p&gt;The role will include leading on the development of a more trauma informed culture across the Secure Children’s home and providing supervision for the wider team.&lt;/p&gt;\n&lt;p&gt;The clinical psychology service works with a Healthcare Manager, Mental Health Practitioners, an advanced nurse practitioner with Psychiatry input and administration support. You would be expected to work as part of the MDT, and to work across staff teams, to meet the needs of the young people; this includes taking a lead role on consultation around young people and supporting more junior colleagues to engage in direct clinical work.&lt;/p&gt;\n&lt;p&gt;Key responsibilities include providing highly specialist psychological assessments and treatment for CYP experiencing moderate, severe and complex mental health/psychological problems based upon the appropriate use, interpretation and integration of complex data from a variety of sources including psychological and neuropsychological tests, self-report measures, rating scales, direct and indirect observation and semi-structured interviews with CYP, their family and/or carers.&lt;/p&gt;\n&lt;p&gt;Formulate and implement plans for the formal psychological intervention and/or management of mental health/psychological and/or behavioural difficulties based upon an appropriate conceptual framework and exercising expert clinical judgement based on the highest standards of evidence-based practice.&lt;/p&gt;\n&lt;p&gt;Establish rapport and build effective working relationships with CYP and all those involved in their psychological, emotional, behavioural &amp; mental health and well-being.&lt;/p&gt;\n&lt;p&gt;See attached for the full job description.&lt;/p&gt;\n&lt;p&gt;Working Pattern: WTE 0.4, Flexible 16 hours per week, applicant must be able to work all day every Wednesday.&lt;/p&gt;\n&lt;p&gt;Candidates must be available to start the position on 1st February 2021.&lt;/p&gt;\n&lt;p&gt;Education: Hons. Degree in Psychology.&lt;/p&gt;\n&lt;p&gt;Experience: Essential; Completion of supervised clinical practice in the NHS, Ability to work within two models of psychological assessment and formulation &amp; intervention.&lt;/p&gt;\n&lt;p&gt;Desirable; Experience in working with CYP in the clinical area of the post.&lt;/p&gt;\n&lt;p&gt;The role will report to the Consultant Psychologist and all appropriate safeguarding training must have been completed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful candidates will be subject to pre-employment checks including; an Enhanced DBS check and 2 satisfactory references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S17 3ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3344", "longitude": "-1.53764"}}, "title": "Clinical Psychologist Band 8", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251909", "validThrough": "2020-11-15T23:59:59+0000"}