{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T14:31:24+0000", "description": "&lt;p&gt;Are you looking for an opportunity to consolidate your clinical skills and knowledge as a Physiotherapist working in the acute setting?&lt;br /&gt;&lt;br /&gt;Are you keen to develop leadership, managerial and service development roles as a Static Band 6 Physiotherapist?&lt;/p&gt;\n&lt;p&gt;If so, this is the post for you.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated, dynamic and enthusiastic Physiotherapist with a passion for acute care. You should have excellent communication and interpersonal skills and a commitment to providing high quality care.&lt;/p&gt;\n&lt;p&gt;The Medical Specialties Team at Queens Hospital Burton is pleased to offer an exciting position for a dynamic and enthusiastic Physiotherapist to work as a Static Band 6 Physiotherapist within the team.&lt;/p&gt;\n&lt;p&gt;You will be responsible for taking a lead role in the day- to- day division and prioritisation of Physiotherapy work load within the team.&lt;/p&gt;\n&lt;p&gt;You will be expected to have varied clinical experience, including working with elderly patients in an acute multidisciplinary setting. You must also be able to demonstrate experience of supervising students and junior members of staff.&lt;/p&gt;\n&lt;p&gt;You will need to have a varied post graduate experience in an acute setting and be keen to develop managerial skills. Experience in supporting students and junior staff is essential.&lt;/p&gt;\n&lt;p&gt;You will be required to provide a 7 day service, work some longer days and contribute towards the respiratory oncall service - therefore a flexible attitude to working hours is essential as well as a full driving licence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Opportunities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Consolidation and development of assessment and treatment skills to work within the acute site, to include patients with falls, parkinsons, diabetes, cardiology and respiratory conditions.&lt;/li&gt;\n&lt;li&gt;Consolidation and development of skills to enable close MDT working and discharge planning in a high pressured environment.&lt;/li&gt;\n&lt;li&gt;Development of managerial skills, deputising for the B7 Team Leader and taking a lead role in the day to day running of the team.&lt;/li&gt;\n&lt;li&gt;Supervise and support the ongoing development of students, assistants and junior members of the team.&lt;/li&gt;\n&lt;li&gt;Initiation of and involvement in service improvement projects.&lt;/li&gt;\n&lt;li&gt;Initiation of and involvement in clinical and team audit, including notes audits, stats audits and compliance with team clinical standards audits.&lt;/li&gt;\n&lt;li&gt;Represent the Team as required at meetings or training.&lt;/li&gt;\n&lt;li&gt;Experience working within established multidisciplinary teams&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience and support with complex discharge planning&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are a friendly and supportive team who can offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support from Therapy Inpatient Lead, B7 Leads and Senior Rotational Therapists within the team, including regular clinical and managerial supervision.&lt;/li&gt;\n&lt;li&gt;Autonomy to provide specialist assessment and treatment to a caseload of patients.&lt;/li&gt;\n&lt;li&gt;PT/OT joint working.&lt;/li&gt;\n&lt;li&gt;Regular team in-service training and weekly learning pit stops.&lt;/li&gt;\n&lt;li&gt;Support to attend appropriate courses to maintain competencies, including those required for on call respiratory physiotherapy provision and to achieve personal development plans.&lt;/li&gt;\n&lt;li&gt;Trust commitment to CPD, demonstrated by yearly appraisal.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date of applications: 16 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 30 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Letitia Butler - Inpatient Therapy Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sharon Wood - Physiotherapy Team Leader &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01283 593007&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital Burton, Burton-on-Trent", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Static Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252440", "validThrough": "2020-11-16T23:59:59+0000"}