{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 Per Annum Inclusive"}}, "datePosted": "2020-11-05T12:16:48+0000", "description": "&lt;p&gt;We are looking for a Workforce Intelligence &amp; RA Manager to join the HR Workforce Intelligence Team at BHRUT. This is great opportunity for someone who may have previous experience in an analyst, workforce planning or similar role, to join the team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of a Workforce Intelligence Team and will assist in the provision, analysis and presentation of accurate, complete, quality-assured and timely workforce information across the organisation. Data will be derived from a number of sources including Electronic Staff Record (ESR) and e-Rostering.&lt;/p&gt;\n&lt;p&gt;The role will include maintaining the ESR and its supporting work structures, Registration Authority user database. The post holder will be required to run regular and ad hoc reports, and providing information to systems which interface with ESR.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Head of the Workforce Intelligence Unit and will assist them in ensuring the workforce planning is robust, fit for purpose and meets high quality standards.&lt;/p&gt;\n&lt;p&gt;The Workforce Intelligence &amp; RA Manager will lead the Workforce Intelligence Team to deliver the following key objectives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide specialist workforce planning data and support to Sites and other customers&lt;/li&gt;\n&lt;li&gt;Deliver regular and ad-hoc workforce information and intelligence&lt;/li&gt;\n&lt;li&gt;Use effective methodologies, processes, tools and techniques to provide required level of output&lt;/li&gt;\n&lt;li&gt;Utilise various data sources to provide reports and intelligence for decision making&lt;/li&gt;\n&lt;li&gt;Lead and manage the team in providing an efficient and effective service to the Trust&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of working with an electronic system which records staff data (e.g. ESR, e-Rostering, payroll or finance system)&lt;/li&gt;\n&lt;li&gt;Able to work under pressure and to tight deadlines&lt;/li&gt;\n&lt;li&gt;Excellent IT Skills (working knowledge of Microsoft Office)&lt;/li&gt;\n&lt;li&gt;Working knowledge of virtual meeting technology (MS Teams, Skype, etc)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is offered at NHS Terms and Conditions (2020) at Band 7. This is a permanent and full-time post (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6 months probationary period. This will give new staff members an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Interview will take place virtually via MS Teams&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Izabela Martin&lt;/p&gt;\n&lt;p&gt;Job title: Head of the Workforce Intelligence&lt;/p&gt;\n&lt;p&gt;Email address: izabelamartin@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the trust will be subject to a 6 month probationary period. This will give the staff member an opportunity to become familiar with the culture and working environment.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Department on 01708 435000 extn 3861.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Izabela Martin, email izabelamartin@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lyon Road, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 7 Workforce Intelligence &amp; RA Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257631", "validThrough": "2020-11-19T23:59:59+0000"}