{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-06T09:15:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Day Surgery Unit&lt;br /&gt;Band 5 Paediatric Staff Nurse--Day Surgery Ward&lt;/strong&gt;&lt;br /&gt;Hours: &lt;strong&gt;Full Time 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for an exciting and challenging career in Day Surgery and pre-assessment? Are you are looking for the opportunity to join a friendly, dynamic team at a leading London teaching hospital to develop your existing nursing skills? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for highly motivated &lt;strong&gt;Paediatric staff nurses&lt;/strong&gt; to join King’s Day Surgery ward and pre-assessment service, to provide the highest standard of pre and post-operative care to patients. We offer a supportive consolidation period for all of our new starters, as well as excellent educational opportunities, from in house study courses to post graduate education through King’s College London, London Southbank University or University of Greenwich. Our Practice Development Team provides structured teaching support to all staff, and our development programs are well established. This post includes Long day and Saturday shifts.&lt;/p&gt;\n&lt;p&gt;King’s College Hospital NHS Foundation Trust (King’s) is situated in South East London and provides comprehensive health care and emergency services for a diverse community. It is also one of London’s four major trauma centres covering South East England. With over 1,400 beds and 11,000 staff across various sites, King’s is one of the largest and busiest hospital trusts in London.&lt;/p&gt;\n&lt;p&gt;King’s (Denmark Hill site) Day Surgery Unit consists of 7 operating theatres which include specialities such as Gynaecology, General Surgery, Laparoscopic Surgery, Dental, Orthopaedic, Ophthalmology, Urology, Paediatric and endoscopy, catering for patients of all ages, from neonates to the elderly. All areas enjoy the reputation of being a world leader in innovative surgical interventions and clinical excellence.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced registered Paediatric Health nurse who shows evidence of caring for patients in a similar clinical setting. The area you will be working in cares for both paediatric and adult patients. You will predominantly be involved in caring for paediatric patients, pre and post operatively however you will be expected to also care for adult patients on non-paediatric days. You will be working alongside adult nurses and will receive supervision and education to do this. You will also gain experience in pre-assessment with opportunities to develop skills on this area and potential further study dependent on performance. Please note we do care for patients undergoing Termination of pregnancy in the department and all staff are expected to care for patients undergoing this procedure.&lt;/p&gt;\n&lt;p&gt;We offer a supportive consolidation period for all of our new starters and have excellent educational opportunities, from in house study courses to post graduate education through King’s College London.&lt;/p&gt;\n&lt;p&gt;To be eligible for the position you must be a NMC Paediatric Registered Nurse. We support flexible working to provide a service to our patients. The post includes Saturday shifts.&lt;/p&gt;\n&lt;p&gt;Our Job Descriptions and Person Specifications outline both the details of the roles we are seeking to fill, together with the knowledge, skills, experience and qualifications required. However, please feel free to make contact for a general discussion about the role. For more information on this post or to arrange an informal visit, please contact Lead Nurse Karen Harries k.harries@nhs.net or 0203299 7431 alternatively, Tracy Weekes, ward sister on tracy.weekes@nhs.net or 0203 299 2188.&lt;/p&gt;\n&lt;p&gt;Please apply on-line. An application form, job description and King’s-specific information can be downloaded from either the King’s website or the NHS Jobs Website&lt;/p&gt;\n&lt;p&gt;Due to the high volumes of applications we receive, we reserve the right to close any adverts before the published closing date once we have received sufficient number of applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren HarriesJob titleMatronEmail addressk.harries@nhs.netTelephone number02032997431&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Band 5 Paediatric Staff Nurse - Day Surgery Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258985", "validThrough": "2020-11-19T23:59:59+0000"}