{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-15T10:01:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Consultant Psychiatrist in Working Age Adults&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £82,096 - £110,683 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in a CQC ‘Outstanding’ rated Mental Health and Learning Disability Trust? &lt;/strong&gt;Do you want to make a difference in changing people’s lives? If you are passionate about delivering excellent patient care, we are looking for you to join our Medical Workforce team. In return you will work with a dynamic multi-disciplinary team, receive superb training and development opportunities and excellent staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an established substantive consultant psychiatrist post with the Northumberland &amp; North Tyneside Universal Crisis Team which is being advertised as the current incumbent is leaving this post. Provision of Universal Crisis Teams (UCT) across the United Kingdom aligns with the NHS Long Term Plan ambitions. Extending access to crisis services across the age spectrum for our populations in Northumberland and North Tyneside also supports the development of suicide prevention initiatives across our region, in keeping with research from the National Confidential Inquiry into Suicide and Patient Safety.&lt;/p&gt;\n&lt;p&gt;The applicant will join an experienced and well-established pre-existing adults’ crisis service which provides crisis assessment and home treatment for patients experiencing acute mental health problems which can be managed in the community with intensive mental health support, without the need for hospital admission. You will join a skilled UCT multi-disciplinary workforce, including non- medical prescribers, a pharmacist, specialist nurses, a nurse consultant and a clinical psychologist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why us? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;A flexible approach to job planning to ensure work-life balance.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated and protected SPA time.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent Continuing Professional Development (CPD) and study leave arrangements. &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation package available &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Focus on staff health and wellbeing &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A Global Digital Exemplar for Mental Health.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Trust is located in the North East of England and Cumbria which is an area of outstanding natural beauty, containing national parks, ancient heritage sites and major cities supported by excellent national and international transport links. The area is one of the best value regions for housing and offers an excellent standard of living with accomplished schools and Universities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges Park, Morpeth", "postalCode": "NE61 2NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1785", "longitude": "-1.68338"}}, "title": "Consultant Psychiatrist in Working Age Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227634", "validThrough": "2020-11-12T23:59:59+0000"}