{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-10-30T18:33:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Chief Finance Officer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hillingdon Hospitals NHS Foundation Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our ambition at Hillingdon Hospitals NHS Foundation Trust is for our organisation to transform, in line with our vision of putting the patient at the centre of everything we do, protecting the wellbeing of our staff and building a new hospital at Hillingdon.&lt;/p&gt;\n&lt;p&gt;You will have experience at board level in complex, dynamic and financially challenging healthcare environments. Highly visible, you will be goal and action orientated, with a talent for inspiring and motivating teams, with a track-record of delivery.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to bring your strong track record of improvement to establish effective financial accountability systems across the Trust. By quickly building credibility, you will share our commitment to improve health and deliver excellent care to our population.&lt;/p&gt;\n&lt;p&gt;You will use this experience to represent us within the North West London (NWL) Integrated Care System and will play an important role in building close links within the system as we move towards formalising our ambitions around the ICS for NW London. Over time, like many ICS’s we will work towards building a group model for which this role will play an important part.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join us as the Chief Finance Officer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Executive Assistant, Sharon Price, by telephone 01895 279878 or email at s.price4@nhs.net &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is Monday, 23rd November with interviews taking place Wednesday 2nd December 2020. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your application should include: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Your current CV. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Supporting statement aligned to the person specification (maximum 4 pages). &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Contact details of at least TWO referees. Referees will not be approached without your prior permission. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please send your application for the position of Chief Finance Officer to Annamaria Hardwick-Sulaiman, Head of Resourcing, at Annamaria.Hardwick-Sulaiman@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Hillingdon Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120945"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Uxbridge, Middlesex", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Chief Finance Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251097", "validThrough": "2020-12-02T23:59:59+0000"}