{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-11-02T09:23:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatres-Scrub | Theatre Nurse | Theatre Practitioner | Operating Department Practitioner | Band 5 | Southampton |Full-time or Part Time | &lt;/strong&gt;&lt;strong&gt;Possible &lt;/strong&gt;&lt;strong&gt;Relocation Support available up to £2000&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Southampton Hospital are looking to recruit experienced and committed Scrub Theatre staff /ODP’s to join our friendly operating theatre team. Consultants come to work with us from all across the UK and you will work closely with them and be exposed to the latest innovative, evidence-based clinical techniques.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Most important is that our Theatre staff /ODPs are experienced in a variety of surgical procedures, or are willing to learn new procedures and techniques under expert supervision. We are keen to promote from within the Spire network, so if you are looking for a long-term career with advancement opportunities you will find them at Spire.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Southampton provides a wide range of services including day care and inpatient and outpatient services. The main activity is elective (planned) surgery, and more complex procedures such as cardiac and spinal surgery are supported by the onsite critical care facilities.&lt;/p&gt;\n&lt;p&gt;The hospital works in partnership with local NHS acute hospital trusts, for example in recent provision of robotic surgery, and there is a large refurbished outpatient department along with extensive diagnostic imaging services.&lt;/p&gt;\n&lt;p&gt;We provide highly specialist services which makes Spire Southampton unique from many other private hospitals offering a range of treatments and surgery not undertaken elsewhere in private practice. We deliver to the highest standard of care to patients with excellent reported patient outcomes in cardiac surgery, putting patients at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide exemplary planned care for patients within the perioperative and assist in the management and organisation of care provision in the operating theatre.&lt;/li&gt;\n&lt;li&gt;Assess patient’s health and well-being across a complex and changing&lt;/li&gt;\n&lt;li&gt;Assist in the delivery of care to meet patient’s health and wellbeing.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ideally you will be a Registered Nurse/Operating Department Practitioner with Scrub experience and be used to working in teams with minimum supervision. Competent across a range of skills, supported by professional and clinical knowledge acquired through a practitioner qualification, additional training is also desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform – discount and cashback for over 100 retailers&lt;/li&gt;\n&lt;li&gt;Free annual Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet under &#39;Additional Information&#39; for more details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please email Penny Lawless at penny.lawless@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it’s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9306", "longitude": "-1.43272"}}, "title": "Theatre Practitioner-Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251394", "validThrough": "2020-12-02T23:59:59+0000"}