{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806"}}, "datePosted": "2020-11-05T09:30:54+0000", "description": "&lt;p&gt;Mae&#39;r Cyd-arweinydd Clinigol ar gyfer gwasanaethau Gofal Llygaid/Offthalmolegydd Ymgynghorol ar gyfer Canolbarth Cymru yn swydd newydd a sefydlwyd i ddarparu arweinyddiaeth glinigol ar gyfer datblygu a darparu gwasanaethau gofal llygaid integredig ledled y rhanbarth, ac, yn rhan o dîm clinigol, i ddarparu gwasanaeth mewn Offthalmoleg ledled Canolbarth Cymru. Mae&#39;r swydd yn rôl draws-sefydliadol rhwng y tri Bwrdd Iechyd sy&#39;n darparu gwasanaethau gofal iechyd sylfaenol, cymunedol ac eilaidd i ranbarth Canolbarth Cymru – sef Bwrdd Iechyd Prifysgol Hywel Dda, Bwrdd Iechyd Prifysgol Betsi Cadwaladr a Bwrdd Iechyd Addysgu Powys – ac mae wedi&#39;i hwyluso gan Gydbwyllgor Canolbarth Cymru. Bydd y swydd yn cael ei chynnal gan Fwrdd Iechyd Prifysgol Hywel Dda, a bydd yna gysylltiadau agos â&#39;r ddau Fwrdd Iechyd partner arall ledled Canolbarth Cymru.&lt;/p&gt;\n&lt;p&gt;Mae Cydbwyllgor Canolbarth Cymru yn cefnogi trefniadau gweithio ar y cyd rhwng y tri Bwrdd Iechyd trwy ei rôl fel un o ardaloedd Cynllunio Rhanbarthol ffurfiol Llywodraeth Cymru. Mae darparu gwasanaeth gofal llygaid ledled Canolbarth Cymru wedi&#39;i nodi&#39;n flaenoriaeth i&#39;r Cyd-bwyllgor, ac mae Cynllun Gofal Llygaid Canolbarth Cymru ar gyfer darparu gwasanaethau gofal llygaid integredig yn cael ei ddatblygu ar hyn o bryd. Mae&#39;r cynllun yn amlinellu&#39;r modd y bydd y Byrddau Iechyd yn cydweithio i fynd i&#39;r afael ag anghenion gofal llygaid poblogaeth Canolbarth Cymru &#39;nawr ac yn y dyfodol, yn ogystal â&#39;r heriau allweddol a wynebir wrth ddarparu gwasanaethau gofal llygaid ledled ardal wledig.&lt;/p&gt;\n&lt;p&gt;Bydd yr Arweinydd Clinigol yn gallu amlygu lefel uchel o wybodaeth ac arbenigedd ym maes gwasanaethau gofal llygaid, ynghyd â lefel uchel o ymrwymiad i ddatblygu&#39;r gwasanaeth. Bydd gwybodaeth am fethodolegau gwella gwasanaethau neu brofiad o ailgynllunio llwybrau yn fanteisiol. Bydd yr Arweinydd Clinigol yn canolbwyntio ar welliannau parhaus o ran ansawdd a chanlyniadau ar gyfer cleifion. Bydd gan yr Arweinydd Clinigol hefyd brofiadol o gyflawni gwaith amlddisgyblaethol.&lt;/p&gt;\n&lt;p&gt;Bydd unrhyw ymgeisydd na all weithio&#39;n llawn amser, am resymau personol, yn cael ei ystyried ar gyfer y swydd. Os penodir unigolyn o&#39;r fath, bydd trefniadau i addasu cynnwys y swydd yn cael eu trafod ar sail bersonol mewn ymgynghoriad â chyd-weithwyr sy&#39;n Ymgynghorwyr.&lt;/p&gt;\n&lt;p&gt;Gweler y swydd-ddisgrifiad am ragor o wybodaeth a chyflwyniad llawn i&#39;r swydd.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Joint Clinical Lead for Eye Care services / Consultant Ophthalmologist for Mid Wales is a new post established to provide clinical leadership for the development and delivery of integrated eye care services across the region and, as part of a clinical team, provide a service in Ophthalmology across Mid Wales. The post is a cross organisational role, between the three Health Boards who provide primary, community and secondary healthcare services to the Mid Wales region - Hywel Dda University Health Board, Betsi Cadwaladr University Health Board and Powys Teaching Health Board - which has been facilitated by the Mid Wales Joint Committee. The post will be hosted by Hywel Dda University Health Board with close links to the two other partner Health Boards across Mid Wales.&lt;/p&gt;\n&lt;p&gt;The Mid Wales Joint Committee supports the joint working arrangements between the three Health Boards through its role as a formal Regional Planning area of the Welsh Government. Eye care service provision across Mid Wales has been identified as a Joint Committee priority area and a Mid Wales Eye Care Plan for the provision of integrated eye care services is currently under development. The plan outlines how the Health Boards will work together to address the current and future eye care needs of the Mid Wales population as well as the key challenges faced in delivering eye care services across a rural area.&lt;/p&gt;\n&lt;p&gt;The clinical lead will be able to evidence a high level of knowledge and expertise in eye care services alongside a high level of commitment to service development. Knowledge of service improvement methodologies or experience of pathway redesign will be advantageous. The Clinical Lead will focus on the continuous improvements in quality and outcomes for patients. The Clinical Lead will also be experienced in multi-disciplinary working.&lt;/p&gt;\n&lt;p&gt;Any applicant who is unable, for personal reasons, to work full-time will be considered for the post. If such a person is appointed, modification of the job content will be discussed on a personal basis in consultation with Consultant colleagues.&lt;/p&gt;\n&lt;p&gt;Please see job description for further information and full introduction to the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarly BuckinghamAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Details for Visiting&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;Those wishing to discuss the post informally in the first instance, or undertake a visit to the area are encouraged to contact:&lt;/p&gt;\n&lt;p&gt;Mrs Carly Buckingham,&lt;br /&gt;Service Delivery Manager Ophthalmology Services&lt;br /&gt;Tel: 01267 229744&lt;/p&gt;\n&lt;p&gt;Mrs Eirini Skiadaresi,&lt;br /&gt;Ophthalmology Consultant / Hywel Dda Clinical Lead for AMD services&lt;br /&gt;Tel: 01267 235151 ext 2560&lt;/p&gt;\n&lt;p&gt;Mr Ken Harries,&lt;br /&gt;Interim Clinical Director,&lt;br /&gt;Scheduled Care&lt;br /&gt;Tel: 01267 235151 ext 2545&lt;/p&gt;\n&lt;p&gt;Mr Said Awad,&lt;br /&gt;Hospital Director ,&lt;br /&gt;Bronglais General Hospital, &lt;br /&gt;Tel: 01970 635636&lt;/p&gt;\n&lt;p&gt;Mr Peter Skitt,&lt;br /&gt;County Director Ceredigion and Programme Director for the Mid Wales Joint Committee&lt;br /&gt;Tel: 01970 635819&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisted candidates will be encouraged to visit and contact the Local Panel Members – details of these will be available to shortlisted candidates when panel is confirmed.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Road Clinic, Aberystwyth with revale requried to sites across Mid Wales located in Ceredigion, South Gwynedd, North &amp; Mid Powys", "postalCode": "SY23 2EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4199", "longitude": "-4.08277"}}, "title": "Joint Clinical Lead For Eye Care Services / Consultant Ophthalmologis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257054", "validThrough": "2020-12-07T23:59:59+0000"}