{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20371", "minValue": "19039", "unitText": "YEAR", "value": "£19,039 - £20,371"}}, "datePosted": "2020-10-28T14:01:08+0000", "description": "&lt;p&gt;The COVID-19 pandemic affects all our communities, now is the time for us to come together to truly make a difference. To increase testing for COVID-19, the Government has significantly expanded its laboratory capacity and staffing. As a result a new COVID-19 Lighthouse Testing Laboratory will be opening in Bracknell. The laboratory will be managed by Berkshire and Surrey Pathology Services, which is the first to be run by the NHS. BSPS is a large and established pathology network operating across Royal Berkshire, Royal Surrey, Frimley Health and Ashford and St Peter’s Hospitals NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Specimen Reception Medical Laboratory Assistants to help us achieve our target of running tens of thousands of tests every day.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Receive COVID-19 testing samples into the department from transport services&lt;/li&gt;\n&lt;li&gt;Unpacks samples and checks that they are intact, suitable for testing and appropriately labelled with tracking barcodes, raising any problems with a senior colleague where necessary&lt;/li&gt;\n&lt;li&gt;Enters the sample details into the laboratory computer systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;No previous experience is required as full training will be provided however there is a need to hold good education including GCSE/O level in Mathematics, ability to communicate clearly and follow instructions.&lt;/p&gt;\n&lt;p&gt;The laboratory will be operating 24 hours a day, seven days a week; therefore successful candidates need to be able to work on a shift pattern. Initially there will be three shift patters of eight hours (6am-2pm; 2pm - 10pm; 10pm to 6am) however in the future the shifts will change to two 12 hour shifts.&lt;/p&gt;\n&lt;p&gt;In return you will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full time employment, 37.5 hours per week to start ASAP(Part time options available, however must be able to work the shift times above)&lt;/li&gt;\n&lt;li&gt;Secure environment of a fixed term contract for 12 months&lt;/li&gt;\n&lt;li&gt;Additional benefit of working with the NHS&lt;/li&gt;\n&lt;li&gt;Be part of something special – this is the first Lighthouse Lab run by the NHS&lt;/li&gt;\n&lt;li&gt;Sense of pride that you are supporting the nation and NHS in the fight against COVID&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The host employing organisation will be Royal Berkshire NHS Foundation Trust. The laboratory will be based at Bracknell Healthspace, Brants Bridge, Bracknell.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please email lighthouse@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bracknell", "postalCode": "RG12 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4131", "longitude": "-.733121"}}, "title": "Bracknell Lighthouse Lab - Specimen Reception Medical Lab Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246874", "validThrough": "2020-11-29T23:59:59+0000"}