{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37878", "minValue": "33835", "unitText": "YEAR", "value": "£33,835 - £37,878 per annum"}}, "datePosted": "2020-10-27T11:49:37+0000", "description": "&lt;p&gt;&lt;span&gt;We’re looking for someone passionate about volunteer and service user involvement to join EDP and lead our approach to volunteer management and service user engagement. You’ll shape future service delivery by harnessing the voice of lived experience, ensuring those who use our services are listened to and have an influence on the way our service develops at every level, and helping to embed a culture of coproduction and participation for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll engage our growing team of volunteers, making sure they are supported from recruitment through to induction and training, and developing volunteer pathways that allow them to contribute to EDP’s work at different levels. You’ll champion those with lived experience and complex lives, helping them to develop and take part in community initiatives, socially enterprising activities, and innovative and creative projects that help offer support to people in recovery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What we’re looking for&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re looking for someone with experience leading volunteer projects and engaging with community partners. You’ll be passionate about ensuring those with lived experience have a voice, and will have experience and knowledge of coproduction and user involvement strategies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll have experience working within substance misuse (or a related field) and will have good knowledge of models of recovery and the role of the community in supporting recovery. You’ll also have some experience of people management, and will be comfortable leading a team and providing line management support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re looking for someone who thinks creatively, developing innovative ways to engage others and working collaboratively with a range of people and organisations. You’ll be committed to helping to develop a culture that is positive, dynamic, creative, flexible, forward-thinking and outcomes-focused.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About EDP&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EDP Drug &amp; Alcohol Services is a thriving charity providing services across Devon and Dorset, in the community and within prisons. We offer a number of dynamic and innovative initiatives which work alongside people to improve their wellbeing, social connections and employability. We’re passionate about supporting individuals who face complex issues, including substance misuse, mental ill health, and other harmful, addictive and offending behaviour, to improve their lives. The fundamental belief underpinning our work is that, given the right support and resources, people can and do make remarkable changes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EDP can offer you a real opportunity for new, challenging and highly rewarding experiences. In return for your commitment and enthusiasm, we offer a comprehensive training &amp; development programme, a generous leave package, pension scheme, and a positive, friendly working environment.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "EDP Drug and Alcohol Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX4 4EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7267", "longitude": "-3.52844"}}, "title": "Coproduction and Volunteer Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244332", "validThrough": "2020-11-15T23:59:59+0000"}