{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 per annum"}}, "datePosted": "2020-10-26T10:47:06+0000", "description": "&lt;p&gt;The NHS Long-Term Plan calls for a step change in &lt;strong&gt;multi-professional advanced practice&lt;/strong&gt; requiring capacity to be built at national, regional and local system level, e.g. in Sustainability and Transformation Partnerships (STPs)/Integrated Care Systems (ICSs) or ‘faculties’ to drive change.&lt;/p&gt;\n&lt;p&gt;Health Education England South West is looking for an experienced Project Support Officer to work with the Faculty of Advancing Practice HEE SW and within the HEE SW Quality Team. This is one of several vacancies across HEE regionally to provide an interface between HEE’s new national &lt;strong&gt;Centre for Advancing Practice and &lt;/strong&gt;the local system.&lt;/p&gt;\n&lt;p&gt;HEE’s National Centre for Advancing Practice (AP) has been established to standardise routes into advanced practice, accredit advanced practice programmes and recognise registered health and care practitioners who demonstrate the capabilities set out in the advancing practice or consultant practitioner framework and in the national education standards for advancing practice. The Centre is supported by Advancing Practice Teams in each of its 7 Regions. The postholder will work in one of the 7 Regional Advancing Practice Teams to deliver of a wide range of functions that ensures the successful implementation of advancing practice at regional and sub-regional level.&lt;/p&gt;\n&lt;p&gt;The Project Support Officer (Quality) is a key member of the Regional Advancing Practice Team responsible for providing high quality administrative support for a range of projects and initiatives primarily linked to Quality Assurance in Advancing Practice Training in the region as directed by the Quality Team Lead including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing administrative support to ensure the smooth running of all systems and processes that support the quality assurance in delivery of Advanced Practice programmes of training.&lt;/li&gt;\n&lt;li&gt;Provision of support for complex trainee/training issues related to Quality&lt;/li&gt;\n&lt;li&gt;Enabling, promoting and supporting the effective use of data, information, knowledge and technology to improve, inform and support a portfolio of projects, services, and initiatives.&lt;/li&gt;\n&lt;li&gt;Management and co-ordination of other activities/ad hoc areas of work as required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder has support from managers, colleagues and other stakeholders but is required to be well-organised, show initiative and able to work with independence in terms of managing and prioritizing their day-to-day activities and the tasks that have been allocated to them. Whilst part of the development of the Regional Advancing Practice Faculty the role will operationally be embedded in the HEE SW Quality Team working under direction of the Quality Leads.&lt;/p&gt;\n&lt;p&gt;The role is largely office-based and administrative in nature but may also require some travel generally within the region. Strong professionalism, interpersonal skills and a customer-orientated approach are essential owing to regular contact with trainees and other stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will also be a team player, supporting colleagues and contributing to the team’s broader running, outputs, and progression and educated to degree level (or equivalent) in a relevant subject or equivalent level of experience/knowledge from working in a similar area/environment. Have a good understanding of a range of work procedures and practices which require a level of expertise or specialism obtained either through formal training or equivalent experience e.g. project management, data analysis, high level administrative procedures.&lt;/p&gt;\n&lt;p&gt;Evidence of continued professional development and have a comprehensive knowledge of project principles, techniques and tools, such as Prince 2 Foundation and Microsoft Project.&lt;/p&gt;\n&lt;p&gt;The postholder will report to the HEE SW Quality Lead &amp; the Project Manager for the Faculty of Advancing Practice.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £24,907, with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;When we are able to return to an office based environment, the primary location for the successful candidate will be Park House, Bristol, or Plumer House, Plymouth.&lt;/p&gt;\n&lt;p&gt;The successful candidate will generally work remotely, using MS Teams, following current NHS guidance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Websdale, Project Support Officer - Workforce Transformation&lt;/p&gt;\n&lt;p&gt;Email: alexander.websdale@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01454 252 748&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park House, Bristol or or Plumer House, Plymouth", "postalCode": "BS34 8YU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5176", "longitude": "-2.53237"}}, "title": "Project Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242064", "validThrough": "2020-11-09T23:59:59+0000"}