{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T09:16:29+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within Mental Health Services for Older People for a Ward Manager at Springwood complex care unit at Malton Hospital.&lt;/p&gt;\n&lt;p&gt;Springwood is a mixed gender ward for older adults providing on-going assessment and specialised treatment for those living with a organic mental health condition who require a specialist hospital bed.&lt;/p&gt;\n&lt;p&gt;This is a key leadership and management role within the older people’s services within North Yorkshire and York locality. Supported by the MDT, your primary focus will be to maintain all aspects of performance management, while building a strong rapport and working relationship with the staff and other professionals linked to the ward. Due to the nature of the ward you will be expected to manage flow and beds within the department and work closely with families, local authority and other partners to address and manage this.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need excellent organisational and planning skills to manage this post as day to day staff management, patient safety and relationship building with families, other teams and professionals will be your focus. You will need to be flexible around working hours as you will work primarily 9-5 Mon-Friday however not exclusively so and will be expected to participate in the senior nurse on call rota for Scarborough Whitby and Ryedale area of the locality.&lt;/p&gt;\n&lt;p&gt;We will also endeavour to support you with you any relevant management and leadership training opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Neil Norris, Interim Locality Manager neil.norris@nhs.net 07786524103&lt;/p&gt;\n&lt;p&gt;Gill Woodrup, Modern Matron gillian.woodrup@nhs.net Tel:- 07785695120&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springwood complex care unit, Malton", "postalCode": "YO17 7NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1372", "longitude": "-.806561"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253249", "validThrough": "2020-11-15T23:59:59+0000"}