{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-23T20:00:20+0100", "description": "&lt;p&gt;&lt;strong&gt;An opportunity has arisen for a Band 3 Administrator to join the Hospital Pharmacy Department &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a highly diverse, demanding but rewarding role, working as part of the friendly, dynamic pharmacy team. It is essential that the successful applicant has administration experience, and the ability to undertake work to a high standard and the desire to develop and learn new skills and competencies.&lt;br /&gt;&lt;br /&gt;The successful candidate will have the confidence and enthusiasm to take on the challenges of this role . Applicants must be organised, have the ability to work under their own initiative and able to prioritise a competing workload.&lt;/p&gt;\n&lt;p&gt;Applicants must have a flexible approach to working practices; excellent verbal and written communication skills, have excellent typing/word processing and IT skills and the ability to work effectively as part of a team. Knowledge of pharmacy terminology is not essential as training can be provided on this.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for supporting the pharmacy management team in provision of KPI data; organising meetings, including drafting minutes and maintaing actions logs; writing reports, including running medicines usage reports from the pharmacy stock system; supporting correct application of HR process and supporting the induction and orientation of staff. The post-holder will also direct the work of, and support, the pharmacy administration apprentice.&lt;/p&gt;\n&lt;p&gt;The post will be on an 37.5 permanent contract. Flexible working may be required in order to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChris StreetJob titleCheif PharmacistEmail addresschris.street@jpaget.nhs.ukTelephone number01493 453980&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital, Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Pharmacy Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241516", "validThrough": "2020-11-06T23:59:59+0000"}