{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rota"}}, "datePosted": "2020-10-28T16:45:50+0000", "description": "&lt;p&gt;This is an exciting opportunity for an experienced Information Analyst to work within our dynamic Information Department at the OUH Trust. This corporate role is crucial to the Trust and the post holder will have knowledge and experience of the way NHS data is used to support operational performance.&lt;/p&gt;\n&lt;p&gt;You should have excellent analytical skills backed up with evidence of an ability to interrogate large databases, and an understanding of the NHS datasets. The ability to work under pressure to achieve deadlines is essential. You will need to work closely with corporate teams within the trust and also develop excellent working relationships with operational services and others external to the Trust.&lt;/p&gt;\n&lt;p&gt;The role will involve taking ownership of large scale projects, delivering, supporting and on-going improvement of routine and ad-hoc reporting on activity, waiting times &amp; performance against operational measures. As well as running routine processes you will be responding to ad-hoc requests for information, developing the reporting functionality from the trust’s local data warehouse.&lt;/p&gt;\n&lt;p&gt;You will be working in one of our two teams of analysts, each consist of six Information Analysts. Each group is led by a Team Lead and an overarching Manager and support from a team of information support officers. This lends itself to a progressive department with many opportunities for career development.&lt;/p&gt;\n&lt;p&gt;A typical week will involve tasks such as improving and producing routine reports from procedure notes, extracting data and information for ad hoc requests both internally and externally to the hospital, extracting information for Freedom of Information requests and helping to maintain and develop ORBIT reports using Tableau. Many of the tasks require writing queries and troubleshooting existing queries using SQL and Access databases with many reports produced in Excel. Therefore you should have good analytical skills backed up with evidence of ability to work with databases. An understanding of the NHS datasets is desirable.&lt;/p&gt;\n&lt;p&gt;The ability to work under pressure to achieve deadlines is essential.&lt;/p&gt;\n&lt;p&gt;The interviews will be held during early December, so please be aware that you may be called for interview then. The interview will be 2 hours in total and involve a 45 minute technical assessment followed by a 1 hour 15 minute interview formal interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will include a technical assessment using Tableau Desktop or Excel and MS SQL&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Please note that automated emails may be diverted to your Junk email box. Please double check this for progress on your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karl Valentin, Informatics Development Manager, karl.valentin@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OUH Cowley, Oxford", "postalCode": "OX4 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7315", "longitude": "-1.18245"}}, "title": "Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247410", "validThrough": "2020-11-26T23:59:59+0000"}