{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata +Outer London"}}, "datePosted": "2020-10-29T10:46:10+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Clinical or Counselling Psychologist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a Senior Clinical or Counselling Psychologist to join Haringey Community Services. This Senior Psychologist post is part of the Psychosis Pathway and is located in the Community Rehabilitation Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Psychosis Pathway:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work as part of a supportive, reflective and creative psychological therapies team. The Psychosis Pathway aims for the timely delivery of innovative and evidence-based psychological interventions by appropriately trained and supervised staff. It is informed by the current evidence base and by best practice guidelines. The pathway determines the psychological interventions that people experiencing psychosis can expect during different phases of their care from assessment, through to treatment delivery, training and provision of clinical supervision, to discharge from secondary care services. While CBT for Psychosis and Family work are core elements of the provision, we are interested in the application of other approaches, such as CAT, CFT, ACT and Mindfulness, where appropriate. We are also in the process of establishing a Group programme, to which you will be expected to contribute. The pathway operates for all people experiencing psychosis in Haringey regardless of the care team providing the service.&lt;/p&gt;\n&lt;p&gt;Within the Psychosis Pathway you will provide psychological assessments, consultations and formulations for other patients. A central part of this role will involve supporting the Clinical Lead with service development and operational tasks, developing treatment protocols, overseeing audits, and liaising with other services. You will have your own delegated areas of responsibility within these areas. The post-holder will be required to supervise both qualified (Band 7) and trainee clinical or counselling psychologists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Rehabilitation Team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Community Rehabilitation team aims to provide excellent quality health and social care needs monitoring, through care co-ordination and care management for individuals who are suitably placed in high support environments. Additionally the service aims to deliver excellence with regards to reviewing residential and high supported placements, and using recovery principles to move on appropriately assessed service users to more choice based and personalised forms of care.&lt;/p&gt;\n&lt;p&gt;The Community Rehabilitation Team has the following remit:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To coordinate the care of adults with mental illness living in 24 hour placements in borough. The definition of what constitutes a 24 hour placement should be schemes where there is cover through-out the day, and at least one staff member sleeping-over on site.&lt;/li&gt;\n&lt;li&gt;To review/care manage those service users placed in commissioned services outside of borough who remain eligible for health and social care provision from the placing health body and or local authority .&lt;/li&gt;\n&lt;li&gt;Delivering effective joint-management of both health and social care resources and accessing associated resources through the relevant local health and social care funding forums.&lt;/li&gt;\n&lt;li&gt;Delivering effective joint management for service users with Drug and Alcohol problems and accessing associated resources through the relevant Dual Diagnosis worker and the Complex Care Panel&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Community Rehabilitation Team is interested in developing a trauma informed care approach and we would particularly welcome applicants with an interest in and experience of this approach.&lt;/p&gt;\n&lt;p&gt;We believe in the importance of supervision, development and providing nurturing and supportive networks to allow Psychologists to grow. There is significant opportunity for learning and development, and the Trust has an excellent Psychology CPD training calendar, involving various trainings on a monthly rota.&lt;/p&gt;\n&lt;p&gt;The post holder must be registered with the Health and Care Professions Council (HCPC).&lt;/p&gt;\n&lt;p&gt;Interested candidates would be very welcome to make contact for an informal discussion.&lt;/p&gt;\n&lt;p&gt;Please contact: Dr Darren Baker (Principal Clinical Psychologist, Psychological Therapies Lead for Psychosis) at darren.baker@nhs.net and / or Kerby Francis (Haringey Community Rehab Team Manager) at kerby.francis@nhs.net .&lt;/p&gt;\n&lt;p&gt;Closing date for applications is 13th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date is 20th November 2020&lt;/p&gt;\n&lt;p&gt;Should you not hear from us within four working weeks of the closing date for this post, then regretfully in this instance, you have not been shortlisted.&lt;/p&gt;\n&lt;p&gt;Should the volume of applications be high we reserve the right to bring forward the closing date for applications&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Dr Darren Baker&lt;/p&gt;\n&lt;p&gt;Job title: Principal Clinical Psychologist, Psychological Therapies Lead for Psychosis&lt;/p&gt;\n&lt;p&gt;Email address:darren.baker@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0208 702 5728&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Kerby Francis (Haringey Community Rehab Team Manager) at kerby.francis@nhs.net .&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halliwick Centre- St Anns Hospital, London", "postalCode": "N22 6BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5917", "longitude": "-.104325"}}, "title": "Senior Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247959", "validThrough": "2020-11-13T23:59:59+0000"}