{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc HCA"}}, "datePosted": "2020-11-03T15:32:35+0000", "description": "&lt;p&gt;Due to expansion and development of the service, an opportunity has arisen for an experienced Paediatric nurse to join our Paediatric Endocrine and Rare Bone Disease Team at Evelina London Children&#39;s Hospital.&lt;/p&gt;\n&lt;p&gt;The Paediatric Clinical Nurse Specialist will be a highly experienced, knowledgeable and educated member of the team who is able to work autonomously, making high level decisions to meet the health needs of the children under our service. Advanced level practice encompasses aspects of education, research and management but is firmly grounded in direct care provision and clinical work with children and families. We are looking for a highly motivated children&#39;s nurse with Endocrine experience, however, relevant clinical experience or management of long term conditions will be considered.&lt;/p&gt;\n&lt;p&gt;You will be working within a large multidisciplinary team providing specialist nursing support, education, healthcare liaison, and high quality care to all children affected by Endocrine and Rare Bone Disease in specialist clinics. Part of your role may take you to other hospitals or into the community. We care and support children and families through childhood to young adults.Transition is of particular interest to us and we work closely with our adult colleagues within and across the Trust.&lt;/p&gt;\n&lt;p&gt;The CNS role will provide both clinical and professional leadership to junior Clinical Nurse Specialists within the service in order to facilitate and improve clinical standards. The post holder will ensure that all children are treated with compassion, dignity and respect, placing value on the diversity of the local community and beyond.&lt;/p&gt;\n&lt;p&gt;The CNS will ensure that the child&#39;s experience is of the highest quality inspiring child, family and public confidence. This will be achieved through high visibility, accessibility and surveillance.&lt;/p&gt;\n&lt;p&gt;In conjunction with their medical and nurse colleagues the role will also involve the development/review of protocols for nurse led clinics and nurse management for children with Endocrine related disorders . The post holder will be a member of the paediatric Endocrine and Rare Bone Disease team and work closely within the team to ensure high quality patient care and safeguarding practice is maintained.&lt;/p&gt;\n&lt;p&gt;This post will form close links with the specialist network in our surrounding Hospitals.&lt;/p&gt;\n&lt;p&gt;The post holder will lead on the development of education for nurses and children and be involved with national policy developments that provide treatment for children and young people with Endocrine disorders.&lt;/p&gt;\n&lt;p&gt;The post is currently partl time - 30 hours per week, 5 days per week&lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: w/c 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRobyn Gilbey-CrossJob titleCNSEmail addressrobyn.gilbeycross@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information and informal visits please contact Ellen Samuel&lt;/p&gt;\n&lt;p&gt;(Matron) Mobile: 07771 390242&lt;/p&gt;\n&lt;p&gt;email: ellen.samuel@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or Robyn Gilbey-Cross (Endocrine CNS)&lt;/p&gt;\n&lt;p&gt;email:robyn.gilbeycross@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Evelina London, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Clinical Nurse Specialist - Paediatric Endocrine &amp; Bone Disease", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254584", "validThrough": "2020-11-17T23:59:59+0000"}