{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc"}}, "datePosted": "2020-10-29T13:16:15+0000", "description": "&lt;p&gt;Do you aspire to join a World Class Centre, leading in Cardiac Research and paving the way for innovative and exciting opportunities within the field of Cardiology?&lt;/p&gt;\n&lt;p&gt;The Cardiac Imaging department is looking for an Operational Lead Radiographer to lead our friendly, dynamic, and highly dedicated Cardiac Specialist Radiographers within the Cardiac Cath labs. The department is made up of 10 Cardiac Catheter labs and a hybrid theatre with the option to expand when required.&lt;/p&gt;\n&lt;p&gt;The department leads the way in world-first procedures. There is a large amount of research taking place at Barts Heart Centre with plenty of opportunities to get involved. We are immensely proud to have many of our Radiographers publishing research and representing us at conferences both in the UK and around the World.&lt;/p&gt;\n&lt;p&gt;The role involves day-to-day running of the Cath labs and staff, including both managerial and clinical duties.The successful candidate would form an integral role within the Cardiology team, working closely with the Matron, Superintendent Physiologists, Cath Lab manager and Consultant Cardiologists.&lt;/p&gt;\n&lt;p&gt;The post holder will provide leadership in driving quality and efficiency service developments, with a particular focus on advanced practice and the professional development of the team in order that we provide a truly world-class patient-centred service.&lt;/p&gt;\n&lt;p&gt;For further information and to arrange an informal visit please contact Carmel McCarthy (BHC Head of Radiography): carmel.mccarthy1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarmel McCarthyJob titleBHC Head of RadiographyEmail addresscarmel.mccarthy1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomew&#39;s Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Operational Lead Radiographer – Cardiac Catheter Lab", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248483", "validThrough": "2020-11-12T23:59:59+0000"}