{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T13:46:11+0000", "description": "&lt;p&gt;Blackpool Teaching Hospitals NHS FT is situated in the busy, vibrant, town of Blackpool where regeneration of the town is actively moving forward. As a busy holiday destination we have plenty to see and do including Blackpool Tower and Ballroom, bars, cafes and restaurants and theatres with major West End productions. &lt;br /&gt;&lt;br /&gt;Close to the Lake District, a walker’s paradise, Manchester and Liverpool, providing airports close at hand, Blackpool is home to both young &amp; senior professionals, families and couples. With plenty to offer both in and out of the workplace, Blackpool Teaching Hospitals can provide the professional standards of quality and commitment to you.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Full Time and Part time posts are available offering exciting opportunities to join us in our busy and transforming Emergency Department.&lt;br /&gt;Our department covers and provides a service to a population of approximately 450,000 residents, increasing during our busy holiday seasons. &lt;br /&gt;The learning and development opportunities are vast with a dedicated training and development nurse in the department. We offer both internal and external courses to help you to develop to your full potential in Emergency nursing.&lt;br /&gt;We consider the Department to be an innovative creative and friendly environment for those nurses who wish to provide high quality patient centred care. &lt;br /&gt;Our team includes Advanced Nurse Practitioners, ENP’s, Mental Health Liaison, Nurse led thrombolysis team, Occupational therapists and physiotherapists.&lt;br /&gt;&lt;br /&gt;You must,&lt;br /&gt;• Be a Registered nurse with 6 months post registration experience &lt;br /&gt;• Previous Emergency Nursing experience preferable.&lt;br /&gt;&lt;br /&gt;We can offer you,&lt;br /&gt;• A modern forward thinking department with dedicated paediatric facilities providing 24 hour service.&lt;br /&gt;• Excellent opportunities for professional development supported by our own programmes tailored to meet your needs.&lt;br /&gt;• Clinical supervision, Preceptorship and Mentorship.&lt;br /&gt;&lt;br /&gt;Internal rotation to night duty is a requirement of the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleUSC Recruitment ManagerAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Department Coordinator Sister Smith/Sister Bowen on 956704&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250402", "validThrough": "2020-11-15T23:59:59+0000"}