{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro-rata"}}, "datePosted": "2020-10-30T12:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. We will provide you with an excellent working environment that has just been recognised with a ‘Good’ rating overall, and as an ‘Outstanding’, well-led, organisation in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Band 6 Community Physiotherapist on a part time basis (15hrs per week). You are an enthusiastic and experienced Physiotherapist, with excellent communication and therapeutic skills, a warm personality and the resilience to help us transform our patients’ lives. Enjoying responsibility, you will be happy to look after the physiotherapy component of the Berkshire West Community Based Pulmonary Rehabilitation Programme.&lt;/p&gt;\n&lt;p&gt;You will hold a BSc (Hons) in Physiotherapy and will have experience in respiratory physiotherapy/pulmonary rehabilitation, experience with old age medical conditions and supervision of junior colleagues and students. We are looking for someone who will lead on raising awareness in chronic obstructive pulmonary disease management.&lt;/p&gt;\n&lt;p&gt;Responsible for the development of the domiciliary physiotherapy respiratory service for Berkshire West patients, you will use clinical reasoning skills, clinical research, audit and data collection to provide support and advice in a community setting.&lt;/p&gt;\n&lt;p&gt;A real people person, you will be working with the Community Based Respiratory Team, other care teams, social services and physiotherapy managers. Your energy and drive will be rewarded with the support of a dedicated team that strives to create a progressive, friendly and considerate environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Cath Darby on 07 584 481 764 or 01 184 672 891 or email: Cath.Darby@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to our salary car scheme, support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCath DarbyEmail addressCath.Darby@berkshire.nhs.ukTelephone number07584 481764&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading, Berkshire", "postalCode": "RG1 6DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4463", "longitude": "-.984454"}}, "title": "Community Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250248", "validThrough": "2020-11-08T23:59:59+0000"}