{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-11-02T16:19:27+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Combs Ford Surgery - READ THIS – it may be the opportunity you’ve been looking for!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic and experienced Lead Advanced Nurse Practitioner?&lt;/p&gt;\n&lt;p&gt;WHAT CAN &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;YOU&lt;/span&gt;&lt;/strong&gt; OFFER TO OUR ESTABLISHED TEAM?&lt;/p&gt;\n&lt;p&gt;Combs Ford is an inclusive, friendly, flexible, forward thinking, multi-disciplinary primary care team.&lt;/p&gt;\n&lt;p&gt;Combs Ford cares for 10,000 patients, working as part of Suffolk Primary Care, based in Stowmarket, Suffolk. We have easy access to the A14, are near the beautiful town of Bury St Edmunds, surrounded by lovely countryside and not far from the Suffolk coast.&lt;/p&gt;\n&lt;p&gt;We have no fixed requirements for hours or working days. If you are right for us, we will make it right for you. We are looking to recruit a Lead ANP to deliver excellent care to our patients and manage our experienced nursing team. You would also be required to lead Infection Control for the practice and manage our QOF performace.&lt;/p&gt;\n&lt;p&gt;* We run a telephone consultation service - allowing us to manage our own workload, with control over face-to-face appointment types, lengths and timings.&lt;/p&gt;\n&lt;p&gt;* Our doctors and ANPs undertake most of our telephone consultations using AskMyGP.&lt;/p&gt;\n&lt;p&gt;* We have efficient care navigation and administration teams, protocols and processes to support all the clinical staff in patient care.&lt;/p&gt;\n&lt;p&gt;* We offer competitive rates of pay with regular reviews.&lt;/p&gt;\n&lt;p&gt;Please get in touch and tell us about yourself and what you could bring to the team…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Combs Ford Surgery is a part of Suffolk Primary Care, an innovative partnership with 12 likeminded Suffolk GP surgeries covering 100,000 patients, where Doctors and practice staff share resources and work together to ensure patients continue to receive high quality care. We also have close links with our GP Federation and CCG.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information contact Debbie Lambe, Practice manager at debbie.lambe@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Suffolk Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135236"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stowmarket", "postalCode": "IP14 2SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1802", "longitude": ".99603"}}, "title": "Lead Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252818", "validThrough": "2020-11-27T23:59:59+0000"}