{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-15T21:00:26+0100", "description": "&lt;p&gt;Applications are invited for this well established post within the Oral and Maxillofacial Surgery department based at Luton and Dunstable University Hospital and working across site at Bedford Hospital. The Luton and Dunstable University Hospital serves as a hub for an OMFS network covering Bedfordshire, Milton Keynes and North and East Hertfordshire. These appointments will be made in accordance with the terms and conditions of service for the 2003 consultant contract (England).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The appointee will become part of a dynamic and enthusiastic team of 8 Consultant Oral and Maxillofacial Surgeons delivering safe and effective care with the support of Associate Specialists, Specialty Doctors, Specialty Trainees and DCTs . All inpatient services and on call duties have been centralised at the Luton and Dunstable University Hospital. Outpatient clinics, day case surgery and local anaesthetic minor oral surgery are undertaken in all of the units. The appointee will be required to participate on the OMFS on-call rota.&lt;/p&gt;\n&lt;p&gt;The appointee will be encouraged and supported in developing their own specialty interests in OMFS within the overall job plan and to improve the pathway for OMFS patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hospital has always been renowned for its friendly atmosphere and good working relationships. The hospital has University status with UCL and the Royal Free, which provides an opportunity to strengthen our teaching and R&amp;D programme and brings a more academic environment to the hospital. This department is fully committed to teaching and training both undergraduate medical students and postgraduate doctors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hospital has easy access to central London and the rural Chilterns. The rural areas include many attractive villages and towns within easy reach of the Hospital including St Albans and Harpenden. Excellent schools are found nearby. There is also very good access to the Midlands and London by road using the M1 or A1, or by rail to one of Luton’s three stations. A direct link using the new ‘Busway’ takes passengers from Luton Train station just 7 minutes to reach a stop within a short walking distance of the hospital. London Luton Airport is within fifteen minutes drive from the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining the newly formed Bedfordshire Hospitals NHS Foundation Trust which has resulted from the merger of the Luton and Dunstable University Hospital and Bedford Hospital NHS Trusts on 1 April 2020. And the Luton site is undergoing a major redevelopment programme to include a new theatre unit comprising integrated theatres and futuristic equipment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered on the UK General Medical Council’s Specialist Register. Specialist Registrars may apply if within 6 months of CCT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An informal visit may be arranged by appointment with Mr Derek Von Arx, Clinical Director for OMFS via his secretary by contacting 01582 718058&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Reference: 418-M-OR-144&lt;/p&gt;\n&lt;p&gt;Closing Date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;Assessment Date: 26th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 18th December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;COMMITTED TO EQUALITY&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDerek Von Arx&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust (formerly known as The Luton and Dunstable NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton &amp; Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Consultant in OMFS ( L&amp;D and Bedford Hospital)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229256", "validThrough": "2020-11-12T23:59:59+0000"}