{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 FTE"}}, "datePosted": "2020-10-23T09:15:14+0100", "description": "&lt;p&gt;Bay Primary Care Network (PCN) continues to grow and we have an opportunity for an experienced Pharmacy Technician to join us in developing this new role in Primary Care.&lt;/p&gt;\n&lt;p&gt;We constantly aspire to be ahead of the curve with innovative solutions and ways of working.&lt;/p&gt;\n&lt;p&gt;Having had a medicines management team for over 15 years, Bay Medical Group recognises the value that pharmacists and technicians can bring to our PCN, practice and our patients and we look forward to growing our PCN pharmacy team. If you join us, you will have a real opportunity to make a difference. The role will see you integrating with our existing team of clinical and primary care pharmacists, pharmacy technician, medicines management team and the wider practice team.&lt;/p&gt;\n&lt;p&gt;We offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to the NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;Comprehensive induction&lt;/li&gt;\n&lt;li&gt;Incremental annual leave scheme starting at 20 days annual leave plus 8 Bank Holidays, and increasing by 1 day each year to 25 days annual leave plus 8 Bank Holidays after 5 years of service (all pro rata)&lt;/li&gt;\n&lt;li&gt;Access to Occupational Sick Pay scheme after one year&lt;/li&gt;\n&lt;li&gt;Access to NHS discount schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from experienced Pharmacy Technicians who share our vision of providing the best possible general practice care to our patient population, of working in a caring team and of seeking innovative solutions to the challenges of the ever-changing NHS.&lt;/p&gt;\n&lt;p&gt;We are happy to consider full or part time hours.&lt;/p&gt;\n&lt;p&gt;Informal enquiries can be made to Dan Holehouse on 01524 511999 or Daniel.Holehouse@gp-y01008.nhs.uk&lt;/p&gt;\n&lt;p&gt;Successful applicants will be required to have sufficient English language fluency as required under the immigration Act 2016.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the advert at any time if sufficient appropriate applications are received and we regret we can only contact applicants who are short-listed for interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135433.jpg", "name": "Bay Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135433"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morecambe", "postalCode": "LA3 1DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0639", "longitude": "-2.88621"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239770", "validThrough": "2020-11-06T23:59:59+0000"}