{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa incl HCAS"}}, "datePosted": "2020-10-26T12:01:01+0000", "description": "&lt;p&gt;Clinical Nurse Specialist Advanced Kidney Care- Band 7&lt;/p&gt;\n&lt;p&gt;Based at South West Thames Renal Unit, St Helier Hospital, Epsom &amp; St Helier NHS University Hospitals Trust&lt;/p&gt;\n&lt;p&gt;The South West Thames Renal Unit has been offering renal care for over 50 years and as a tertiary renal referral centre the unit has become one of the largest in the south of the UK. Currently renal services are provided to the residents of South West London, Surrey and Surrey Borders.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and innovative specialist nurse to work alongside our outstanding advanced kidney care service, working alongside consultant colleagues and specialist nurses.&lt;/p&gt;\n&lt;p&gt;It is essential for the post holder to be educated to degree level, hold a renal care qualification and have clinical experience and knowledge to provide advanced kidney care service autonomously. Desirable to hold a teaching qualification or studying at Master Level.You must also have excellent communication and interpersonal skills, be well organised and be very motivated, you must also be able to work in close partnership with other members of the Renal Multi-Professional Team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Clinical Nurse Specialists in Advanced Kidney Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242317", "validThrough": "2020-11-09T23:59:59+0000"}