{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22112", "minValue": "22112", "unitText": "YEAR", "value": "£22,112 per annum"}}, "datePosted": "2020-10-28T09:41:15+0000", "description": "&lt;ul&gt;\n&lt;li&gt;Are you patient focused with good customer service experience?&lt;/li&gt;\n&lt;li&gt;Could you assist the Clinician in the day to day operation of community outpatient clinics?&lt;/li&gt;\n&lt;li&gt;Would you be happy to assist the clinician with minor surgical procedures?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you feel that this exciting and important opportunity could be the next role for you then please do get in touch.&lt;/p&gt;\n&lt;p&gt;DMC are a successful and trusted provider of NHS services across England and Scotland. We have grown rapidly in the past decade from a single Dulwich practice to a team of over 400 employees dedicated to giving patients the very best in care.&lt;/p&gt;\n&lt;p&gt;DMC Healthcare continue to see steady growth in the services we provide, and we have an opportunity for a Health Care Assistant to join the team across the Hereford &amp; Worcester area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role is 37.5 hours a week 7 days a week, so would include weekend shifts on a rota basis.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The sites you will cover are the following and you will require a car (you may also be asked to travel to alternative sites to meet demand):&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Evesham Community Hospital - Waterside, Evesham, Worcestershire, WR11 1JT&lt;/li&gt;\n&lt;li&gt;Elbury Moor - Fairfield Close, Worcester, WR4 9TX&lt;/li&gt;\n&lt;li&gt;BHI Parkside - Stourbridge Road, Bromsgrove, Worcestershire, B61 0AZ&lt;/li&gt;\n&lt;li&gt;Aylmer Lodge Surgery/ Hume Street - Hume St, Kidderminster, Worcestershire, DY11 6SF&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Health Care Assistant, your role will be to assist the Clinician in the day to day operation of community outpatient clinics. You will organise the setup of each clinic ensuring everything is prepared prior to the clinic date, manage, record and process patient’s personal data.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are several aspects to the role which will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Organisation, Administration &amp; Setting Up of clinics&lt;/li&gt;\n&lt;li&gt;Liaise with Referral Management Centre to ensure the appointments are correctly scheduled for the clinic&lt;/li&gt;\n&lt;li&gt;Ensure the PC/laptop is set up and ready for use including for Clinician&lt;/li&gt;\n&lt;li&gt;Ensure all clinical stock needed is in place prior to the clinic date&lt;/li&gt;\n&lt;li&gt;Manage stock control at each area and escalate any faults and issues&lt;/li&gt;\n&lt;li&gt;Collect patient surveys and consent forms&lt;/li&gt;\n&lt;li&gt;Create and distribute PDF clinic letters to patients and GP practices in line guideline&lt;/li&gt;\n&lt;li&gt;Ensure the room is adequately equipped for each consultation prior to the clinic starting as per DMC standards&lt;/li&gt;\n&lt;li&gt;Ensure equipment is working and ready to be used at the clinic&lt;/li&gt;\n&lt;li&gt;Clean equipment after use as required&lt;/li&gt;\n&lt;li&gt;Adhere to clinical standards at all times&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Assisting in Clinics&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist the Clinician during the clinic with any reasonable request&lt;/li&gt;\n&lt;li&gt;To meet and greet patients in the waiting area and show them through to the consultation room&lt;/li&gt;\n&lt;li&gt;Develop a rapport with the patients and provide a high level of ‘customer’ service&lt;/li&gt;\n&lt;li&gt;Develop a rapport with Clinicians&lt;/li&gt;\n&lt;li&gt;Assist with minor surgical procedures as required&lt;/li&gt;\n&lt;li&gt;Ensure minimal waste of consumables&lt;/li&gt;\n&lt;li&gt;At the end of each clinic ensure all DMC equipment is adequately cleaned and put away in the correct location&lt;/li&gt;\n&lt;li&gt;Ensure the room is left clean and tidy once the clinic has finished&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have previous experience as a HCA&lt;/li&gt;\n&lt;li&gt;You will have good customer service and communication skills&lt;/li&gt;\n&lt;li&gt;You will be empathetic to patients&lt;/li&gt;\n&lt;li&gt;You will be an independent team player passionate about delivering the highest levels of patient care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Organisational Arrangements:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Responsible to: Lead HCA&lt;/p&gt;\n&lt;p&gt;Accountable to: Head of Nursing&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of the benefits package you will be entitled to 20 days annual leave plus Bank Holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A driving license is essential to cover multiple sites.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "B61 0AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3486", "longitude": "-2.06121"}}, "title": "Healthcare Assistant – Hereford &amp; Worcester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245849", "validThrough": "2020-11-11T23:59:59+0000"}