{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-05T14:47:01+0000", "description": "&lt;p&gt;Are you an enthusiastic and dynamic neonatal trained nurse? Do you strive to provide excellent nursing care? Are you looking to progress your career? Then come and work with the North West Anglia Foundation Trust Neonatal Outreach Team.&lt;/p&gt;\n&lt;p&gt;Our Neonatal Outreach service has an opportunity for a highly motivated individual who has a passion for community care of the neonate caring for babies discharged from our neonatal units at Peterborough Hospital and Hinchingbrooke Hospital.&lt;/p&gt;\n&lt;p&gt;The transition from an intensive care setting to home is a process that takes careful planning and preparation , as a Neonatal Outreach Staff Nurse you will guide this process and be required to assess the infant’s and parent/carer’s readiness for discharge, working closely with the family and the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;In this role you will work autonomously and will need to have an extensive clinical knowledge guiding your decision making. You will be responsible for managing your own workload, escalating any concerns and prioritising care needs of infants post discharge. This will involve working effectively and efficiently with the integrated multidisciplinary team and outside agencies to develop, implement and evaluate programmes of care.&lt;/p&gt;\n&lt;p&gt;As a community worker you will need the use of a car and be confident travelling and navigating to the infants home address. The community team is involved in monitoring, data collection and audit of our service and good computer skills are essential.&lt;/p&gt;\n&lt;p&gt;Part time hours will be considered&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracy James: Lead Nurse for Neonatal Services&lt;/p&gt;\n&lt;p&gt;tracy.james@nhs.net&lt;/p&gt;\n&lt;p&gt;01733 677229&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital (expected to work cross site), Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Neonatal Outreach Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258191", "validThrough": "2020-11-19T23:59:59+0000"}