{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 Per Hour"}}, "datePosted": "2020-10-30T16:06:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title:General Clinical Administrator &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt;Nottingham University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Ropewalk House, 113 The Ropewalk, Nottingham NG1 5DU&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift pattern: Up to 37.5 - Monday – Friday 8.30am – 16.30pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration&lt;/strong&gt;: 2/3Months (Subject with review)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rate per hour: £9.21&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Nottingham University Hospitals NHS trust was Rated ‘Outstanding’ in ‘Well Led’ by the CQC and is home to some of the world’s leading clinicians and experts&lt;/p&gt;\n&lt;p&gt;Are you a person passionate about health care and want to make a difference?&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a General Clinical Administrator at Nottingham University NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure all patient notes are prepared in line with Trust Standard guidelines and key performance indicators including current paper records or thin folders that will support DHR requirements&lt;/li&gt;\n&lt;li&gt;Photocopying/scanning letters, reports, and documents – ensuring they are filed and distributed as appropriate.&lt;/li&gt;\n&lt;li&gt;Use relevant systems to book outpatient appointments, as necessary.&lt;/li&gt;\n&lt;li&gt;Deal appropriately with enquiries, by telephone, text message, email, type-talk and in person, from staff and the general public, seeking advice or referring elsewhere if necessary.&lt;/li&gt;\n&lt;li&gt;Ensure all RTT patient data are recorded accurately and timely.&lt;/li&gt;\n&lt;li&gt;Print appointment/procedure confirmation letters as necessary and send to patient with relevant information leaflets promptly.&lt;/li&gt;\n&lt;li&gt;Keep personally updated and be able to advise patients in relation to peripheral services available, i.e. transport, interpreting services etc.&lt;/li&gt;\n&lt;li&gt;Liaise with other medical agencies to obtain patient information required for their treatment.&lt;/li&gt;\n&lt;li&gt;Clinic preparation including ensuring files is ready, up to date, and appropriate paperwork is attached.&lt;/li&gt;\n&lt;li&gt;Create patient files for new patients&lt;/li&gt;\n&lt;li&gt;Diary updates for outreach clinicians&lt;/li&gt;\n&lt;li&gt;Receive and respond to enquiries from relatives/external agencies adhering to Trust confidentiality guidelines at all times&lt;/li&gt;\n&lt;li&gt;Distributing and opening in-coming mail timely and dealing with appropriately.&lt;/li&gt;\n&lt;li&gt;Prepare patient information packs and ensure stocks are replenished.&lt;/li&gt;\n&lt;li&gt;Be able to competently use Hospital IT systems and other information technology systems and participate in training programmes to develop and update personal skills to meet the needs of the department.&lt;/li&gt;\n&lt;li&gt;Maintain tidy, safe working environment, reporting any hazards or faults timely and appropriately.&lt;/li&gt;\n&lt;li&gt;Present a professional, polite and courteous attitude at all times and be appropriately dressed when on duty.&lt;/li&gt;\n&lt;li&gt;Undertake any other duties, which may reasonably be required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG1 5DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9543", "longitude": "-1.15884"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250875", "validThrough": "2020-11-20T23:59:59+0000"}