{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-14T09:51:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Research Quality Assurance Co-ordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a permanent post, 1.0WTE (37.5 hours/week).&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the RD &amp; I department at University Hospitals Birmingham NHS Foundation Trust. We are looking to appoint a highly motivated and hardworking individual with excellent written and oral communication skills to join the busy Quality Assurance (QA) team as a Research Quality Assurance Co-ordinator.&lt;/p&gt;\n&lt;p&gt;The post-holder will be responsible for supporting investigators, senior managers and other staff involved in clinical research activity and will undertake audit and monitoring on both UHB hosted and sponsored trials as per the department audit and monitoring plan. They will be expected to generate reports and interpret findings in accordance in ICH-GCP (International Conference on Harmonisation Good Clinical Practice Guidelines) and all other applicable legislation. They will also contribute to the ongoing maintenance and development of quality assurance systems including the departmental QMS to ensure high standards are maintained.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals with excellent communication, problem solving and organisational skills and the ability to work under minimal supervision. The post-holder will work as part of the QA Team across all sites within UHB as required, but will be based at the Birmingham Heartlands Hospital Site.&lt;/p&gt;\n&lt;p&gt;For further details please contact Dr Sarah Manney: sarah.manney@uhb.nhs.uk, 0121 424 1123 or 07767 618488.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Research Quality Assurance Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225557", "validThrough": "2020-11-08T23:59:59+0000"}