{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37599", "minValue": "28575", "unitText": "YEAR", "value": "£28,575 to £37,599"}}, "datePosted": "2020-10-19T18:13:28+0100", "description": "&lt;h2&gt;HR Manager 37.5hpw&lt;br /&gt;Pay Scale 6 £28,575 (min) to £37,599 (max) &lt;br /&gt;Subject to job evaluation&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;As HR Manager you will lead the HR team and develop our HR services, policies and processes to help assure us we have the right people (staff and volunteers) who share our values and are committed to delivering the mission and vision of the Hospice. &lt;br /&gt;&lt;br /&gt;You will manage the Hospice’s HR function, which includes oversight of HR processes to ensure that the Hospice continues to provide an outstanding service and is an employer of choice. And you will support the continued development of a learning culture which helps us to innovate and increase the impact of everything we do. &lt;br /&gt;&lt;br /&gt;Educated to degree level and with CIPD accreditation, you will have experience of line managing a team as well comprehensive HR generalist experience. We are looking for a strong team leader who is ambitious and solution focussed and has the passion to drive forward our aspirations and operational goals. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;About us:&lt;/strong&gt; St Cuthbert’s Hospice provides holistic care for patients with life limiting illnesses. We are highly regarded for our quality of service and the first Adult Hospice in the country to be graded “outstanding” by the Care Quality Commission. Our 11 bedded palliative care In Patient Unit provides individualised care planned to support the total wellbeing of each person, taking into account their physical, psychological, social and spiritual needs. Our Living Well Centre delivers a 12 week programme offering advice and strategies to enable people with life limiting illnesses cope better with their health and wellbeing and support them to regain control of their life. We value the contribution of all our workforce comprising of over 90 staff and 395 volunteers. We are an equal opportunities employer and believe in treating everyone with dignity and respect, encouraging applications from all sectors of the community. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Our Values:&lt;/strong&gt; Compassionate, Respect, Integrity, Professionalism, Choice, Reputation. These define who we are and guide what we do to ensure the highest quality care for those accessing our services and the highest quality experience for staff working here. We are committed to safeguarding and promoting the welfare of adults at risk and children.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Why work for us:&lt;/strong&gt; We are committed to making St Cuthbert’s Hospice a great place to work supporting the provision of excellent services for the people of Durham. This has been demonstrated through winning a National HR Management Award (Charity Times), the 2016 Improving Impact Category for Governance, a local Employer of the Year award and Better Health at Work Gold standard in 2018.&lt;br /&gt;&lt;br /&gt; 100% of our volunteers who participated in our 2017 survey would recommend the Hospice as a care provider and 99% feel appreciated and valued. In our staff survey of 2018, 100% of respondents would recommend us as a care provider and more staff than ever feel their role makes a difference and are able to deliver the patient care/customer service they aspire to.&lt;br /&gt;&lt;br /&gt; We want you to love coming to work, 92% of respondents told us they do and 98% told us the training, learning and development has helped them deliver a better patient/customer service. If you are ready for an exciting opportunity that will not only impact on patient care but will be motivating and rewarding on a personal level this could be the post for you.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;For an informal discussion about this post please contact:&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Paul Marriott, Chief Executive 0191 374 6160&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;Closing date for applications: Friday 13th November 2020&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt; Interviews: Wednesday 25th November 2020&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;If you have not heard from us by Monday 23rd November please assume you have not been shortlisted. &lt;br /&gt;&lt;br /&gt;Please note: we do not accept CVs&lt;br /&gt;&lt;br /&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to checkfor any previous criminal convictions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St Cuthbert's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham", "postalCode": "DH1 3QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7642", "longitude": "-1.59371"}}, "title": "HR Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233371", "validThrough": "2020-11-13T23:59:59+0000"}