{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "36000", "unitText": "YEAR", "value": "£36,000 - £40,000 pro rata (DOE)"}}, "datePosted": "2020-11-02T14:54:15+0000", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Radiographer in our Wessex Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We all agree on the importance of a good work life balance. If you currently find that long days with few breaks, night shifts, weekend working and ever-changing rotas are making that balance difficult to achieve then this post may be for you.&lt;strong&gt;  &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;This post is available as 30 hours part-time post, but there is flexibility in these hours for the right candidate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health Wessex Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Nuffield Health Wessex Hospital is located in Chandlers Ford, with easy access just off of the M3 at Junction 12.  We know how frustrating parking can be for hospital staff and the Wessex has on-site parking which you will not be charged for nor have to drive around for an hour looking for spaces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has 40 en-suite bedrooms and 4 state of the art operating theatres. The radiology department provides a wide range of imaging including MR, CT, Fluoroscopy, DXA, mammography, ultrasound and general radiography. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is the opportunity to join a friendly radiography department working in a small hospital where you can feel an integral part of a team providing excellent care in a calm environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Senior Radiographer at Nuffield Wessex you will:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Have a BSc degree in diagnostic radiography or equivalent and have current registration with the Health and Care Professions Council (HCPC) .&lt;/p&gt;\n&lt;p&gt;- Have training and experience in either CT and/or MRA.  A postgraduate qualification is desirable, with post-registration experience relevant to the role.&lt;/p&gt;\n&lt;p&gt;- Be able to support the general radiography work of the department when required.&lt;/p&gt;\n&lt;p&gt;- Be a good team player.  We are a small team with a history of stepping up and helping each other out.  The successful candidate will have evidence of this can-do  attitude.&lt;/p&gt;\n&lt;p&gt;- Have experience in some form of departmental administration (Radiation Protection, Infection Prevention, Clinical Governance etc) or be willing to train to take on such a role.&lt;/p&gt;\n&lt;p&gt;- Be able to take part in the on-call rota of the department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £36,000 - £40,000 pro rata (Dependant On Experience)&lt;br /&gt;Closing date - 30/11/2020&lt;br /&gt;Location - Wessex&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;br /&gt;Weekly Hours - 30&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chandlers Ford, Wessex", "postalCode": "SO53 2DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9944", "longitude": "-1.36312"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252501", "validThrough": "2020-11-30T23:59:59+0000"}