{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pro-rata"}}, "datePosted": "2020-11-02T10:32:24+0000", "description": "&lt;p&gt;&lt;strong&gt;‘My district nurse is brilliant, the support she’s given me through my recovery has helped me get back on my feet so much quicker than I thought I would, I can’t say thank you enough!’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Want to be part of a team where feedback like this is an everyday occurrence? Then take a look at our recent opportunities in the Oldham community team.&lt;/p&gt;\n&lt;p&gt;The Oldham community team cover all areas of Oldham visiting people at home and running treatment clinics. We are not just looking for ‘staff’ or someone to fill the numbers; we are looking for a new team member who wants to use both their excellent clinical skills and caring personality to make a BIG difference in this challenging yet rewarding setting.&lt;/p&gt;\n&lt;p&gt;District nursing provides opportunities to have a much more ‘hands on’ role within a patient’s recovery, building a therapeutic relationship with them. Successful candidates will bring their positive, can-do approach to care and we welcome individuals with ideas and a willingness to be involved in the innovation that is the integration of Health and Social care across the region.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive leadership team who will work hard to make sure you have what you need to perform at your best&lt;/li&gt;\n&lt;li&gt;Career development/training options&lt;/li&gt;\n&lt;li&gt;Community specific training support from dedicated practice based educators with specialist training such as end of life care.&lt;/li&gt;\n&lt;li&gt;Support for your health and wellbeing.&lt;/li&gt;\n&lt;li&gt;Newly Qualified nurses will be supported with both a corporate preceptorship and thorough local induction&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Welcoming you into our community&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an autonomous registrant working across the Oldham community you will be a confident nurse professional with the ability to make swift, well considered decisions when needed. We welcome applications from student nurses due to qualify in the next 6 months.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and energetic individuals, who work well under pressure. A sense of ownership for your patients, a ‘can do’ attitude and determination to deliver the best patient care in a variety of home environments is essential in a service that is all about enabling the patient.&lt;/p&gt;\n&lt;p&gt;Our service is provided on a 7 day a week basis with weekends being distributed across the team, therefore weekend working will be a part of the role. You must be the holder of a current, clean UK driving licence and have access to your own vehicle.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Natalie Austin - Senior Practitioner&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;0779 676 7771&lt;/p&gt;\n&lt;p&gt;natalie.Austin@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Community services, Oldham", "postalCode": "OL4 1DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5408", "longitude": "-2.10132"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251607", "validThrough": "2020-11-16T23:59:59+0000"}