{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa Inclusive of HCAS (15%)"}}, "datePosted": "2020-10-28T12:16:38+0000", "description": "&lt;p&gt;&lt;em&gt;“Occupational Therapy at Kingston Hospital is a therapeutic discipline that aims to provide individualised, goal-orientated interventions that promote health and welling-being through participation in chosen occupations”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen within Kingston Hospital Foundation Trust, for an enthusiastic and highly motivated Band 5 Occupational Therapist to join our team. This is a 6 month fixed term opportunity within our care of the elderly acute care team.&lt;/p&gt;\n&lt;p&gt;Within a nurturing learning environment you will receive regular supervision, participate in a weekly teaching program, preceptorship for newly qualified staff and undertake a performance appraisal to support your professional development.&lt;/p&gt;\n&lt;p&gt;You will work collaboratively with other members of the multidisciplinary team, including our community partners, to provide a holistic, patient-centered occupational therapy service that empowers patient’s to achieve their goals.&lt;/p&gt;\n&lt;p&gt;You will provide comprehensive occupational therapy assessment and intervention to a wide variety of patients in line with current evidence-based practice, national and local polices, and within the scope of professional standards of practice.&lt;/p&gt;\n&lt;p&gt;There is also an opportunity to contribute to the development and evaluation of the occupational therapy service which is continually evolving in line with local and national proposals, including government policy on a discharge to assess and the NHS Five Year Forward Plan.&lt;/p&gt;\n&lt;p&gt;You will be joining a team where there is a positive working culture amongst staff, where team effort is acknowledged, differences are respected and opportunities for progress are facilitated.&lt;/p&gt;\n&lt;p&gt;The successful applicant will also be expected to contribute to the weekend and bank holiday rota via our Bank Partners.&lt;/p&gt;\n&lt;p&gt;45 minute interview including a 10 minute presentation. Topic of presentation to be sent at time of shortlisting&lt;/p&gt;\n&lt;p&gt;Due to social distancing MS Teams Interviews will be offered to shortlisted candidates&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePreeya MistryJob titleTeam Lead Occupational Therapist for Care of the ElderlyEmail addresspreeya.mistry@nhs.netTelephone number020 8934 2518Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Preeya Mistry, Senior Specialist Occupational Therapist 020 8934 2518&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital, Kingston", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Occupational Therapist Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246522", "validThrough": "2020-11-11T23:59:59+0000"}