{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-10-26T19:45:19+0000", "description": "&lt;p&gt;Clinical Trials Pharmacy Technician – Band 5&lt;/p&gt;\n&lt;p&gt;Are you seeking a new challenge? Do you want to work for one of the most research active NHS Trusts in the country and play an important role in improving the health and quality of life for patients?&lt;/p&gt;\n&lt;p&gt;The pharmacy clinical trials service at Barts Health has seen significant investment over the last few years and the evolving team of pharmacists, technicians and assistants manage an ever expanding portfolio of clinical trials. We have an exciting opportunity for a qualified pharmacy technician to join the team and develop your skills within clinical research.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated and enthusiastic person who has proven organisational and communication skills and exceptional attention to detail. You will be responsible for the setup and maintenance of trials being run at Barts Health, and ensure they are being managed according to the regulatory requirements for research.&lt;/p&gt;\n&lt;p&gt;The role is full time, Monday-Friday (with additional weekend and bank holiday commitments). The position is based at St. Bartholomew’s hospital but post holders will be expected to work across all Barts Health sites. Full training and development opportunities will be provided.&lt;/p&gt;\n&lt;p&gt;Please note you must be a pharmacy technician registered with the General Pharmaceutical Council in order to apply for this post.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Esther Whanya (Senior Clinical Trials Pharmacy Technician) or Lola Babalola (Senior Clinical Trials Pharmacist) or Kristian Warnes (Clinical Trials Coordinator) on 0203 465 5250 or e-mail esther.whanya@nhs.net / l.babalola@nhs.net / kristian.warnes@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomews Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Clinical Trials Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243633", "validThrough": "2020-11-09T23:59:59+0000"}