{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T15:01:42+0000", "description": "&lt;p&gt;This post is being advertised to address a temporary need for a year however the Trust has made the commitment to offer the successful applicant a permanent contract with the Trust. In the event that the need for this post ends, a suitable alternative post will be offered. Applicants should be aware that alternatives may require some flexibility on role and/or location.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is only open to those candidates who already have their NMC registration in place and have successfully completed the preceptorship programme. Please note: Newly qualified applicants or those due to qualify will be recruited via a separate process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Older People’s Directorate is offering the opportunity for a registered nurse to work within a developing and rapidly changing service. The locality provides services to the Durham and Darlington area.&lt;/p&gt;\n&lt;p&gt;The post offered is to cover maternity leave in an in-patient assessment for older people with a functional mental health illness within the locality.&lt;/p&gt;\n&lt;p&gt;The ideal candidate should be able to demonstrate a high level of nursing knowledge and skills, be well motivated and reliable, they should be able to demonstrate an awareness of assessment techniques and have experience of working within care co-ordination processes in a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Applications are invited from first level nurses with an interest in mental health services for older people.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Curry, Ward Manager helen.curry3@nhs.net 0191 3337733&lt;/p&gt;\n&lt;p&gt;Nichola Young, Clinical Lead on 0191 3337731.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lanchester Road Hospital, Durham", "postalCode": "DH1 5RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8009", "longitude": "-1.61141"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247104", "validThrough": "2020-11-11T23:59:59+0000"}