{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T08:34:34+0100", "description": "&lt;p&gt;We have an exciting permanent job opportunity for an Occupational Therapist who would like to be part of an expanding Older People’s Assessment and Liaison Service (OPAL) based at Queen Elizabeth Hospital Birmingham. OPAL provides timely, multidisciplinary, patient centred comprehensive assessment to those with an acute need. The multi-disciplinary team includes Geriatricians, Nurses, Therapists, Therapy Support team and Social Workers. It provides early access to expert advice, regardless of whether patients are referred by a GP, community services or arrive at the hospital front door. This holistic service means patients receive a highly skilled assessment followed by the support and treatment they need. Ongoing care will take place in the best place for the person, which will often be their own home supported by community teams. There are a number of exciting initiatives about to be trialled in OPAL that you will be at the forefront of including the use of video link between West Midlands Ambulance Service and OPAL to prevent hospital admission.&lt;/p&gt;\n&lt;p&gt;The successful candidates will demonstrate sound clinical knowledge in the speciality of Older People, acute experience, excellent communication, be able to work under pressure, organisational skills, and be IT literate. We welcome candidates who have a proven track record of multi-professional team working, experience of undertaking audits and a passion for building healthier lives for patients. We can offer you internal and external training opportunities, regular supervision, working with senior colleagues on service evaluations, and opportunities to develop your leadership, supervision and specialist clinical skills.&lt;/p&gt;\n&lt;p&gt;Please contact Donna Ward Team Lead for OPAL on 07557759710 or e-mail Donna.Ward@uhb.nhs.uk for further information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239705", "validThrough": "2020-11-20T23:59:59+0000"}