{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-29T14:30:56+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and motivated individual to join our dynamic Transformation team at East and North Hertfordshire Hospitals NHS Trust. If you have expertise in service improvement and project management; are driven to excel and passionate about making a difference to patients within the NHS by driving forward transformation – then this is the role for you.&lt;/p&gt;\n&lt;p&gt;The Transformation team’s portfolio is diverse and aligned to supporting Trust Clinical Strategy working alongside Planned Care and Unplanned Care services within the organisation and system-wide within Hertfordshire and West Essex Integrated Care System (ICS) and East and North Hertfordshire Integrated Care Partnership (ENH ICP). Our team’s vision is to provide collaborative improvement expertise across the health and social care systems enabling patient-centred transformational change. This role will be pivotal to leading on end-to-end pathway review of some high volume specialties, together with key operational and clinical colleagues and regional stakeholders as well as supporting the delivery of some large cross-cutting Trust-wide improvement programmes.&lt;/p&gt;\n&lt;p&gt;Our team philosophy centres around three key strands:&lt;/p&gt;\n&lt;p&gt;Collaborative - build strong relationships with internal and external partners, establishing meaningful relationships with partners in the ICS and beyond and working with other corporate functions towards a shared goal.&lt;/p&gt;\n&lt;p&gt;The Improvement Expertise - develop the skills, competencies and ability of all team members, providing clear portfolio of projects, competencies and services we offer the Trust, offer training to support sustainability of change and develop skill-base and follow ‘ENHT Way’ of improvement.&lt;/p&gt;\n&lt;p&gt;Patient-centred transformational change – we ensure that any change is evidence-based and in line with Population Health Management, we place patient at the centre of any pathway redesign and we bring teams together and support innovation to develop better pathways for our patients.&lt;/p&gt;\n&lt;p&gt;What are we looking for?&lt;/p&gt;\n&lt;p&gt;You will have experience of leading significant change and delivering tangible and sustained improvements. You will possess excellent project management skills and be able to diagnose process and system problems and co-design solutions highlighting opportunities for improvement in outcomes through a reduction in waste and unwarranted variation.&lt;/p&gt;\n&lt;p&gt;You will work with teams using evidence-based tools e.g. Plan-Do-Study-Act, process mapping, Lean Six Sigma and PRINCE2 methodologies.&lt;/p&gt;\n&lt;p&gt;You will be an advocate for innovation and champion the development of new ways of working within the organisation and across the ICS landscape.&lt;/p&gt;\n&lt;p&gt;You will challenge the status quo, inspire ambition and support teams to aspire to new ways of working and models of care.&lt;/p&gt;\n&lt;p&gt;You will be able to engage and build effective and constructive relationships with key stakeholders and patients on every level particularly senior clinical and managerial colleagues across the system&lt;/p&gt;\n&lt;p&gt;You will have outstanding communication skills able to communicate highly complex, sometimes contentious information to groups of leaders, staff and patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are two FTE permanent positions available for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The shortlisted candidates will be asked to give a 10 minute presentation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to have a discussion about this role, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Julia Oliveira – Programme Director for Planned Care &lt;/strong&gt;Julia.oliveira@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Karen Heng – Programme Director for Unplanned Care &lt;/strong&gt;Karen.heng@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Transformation Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248702", "validThrough": "2020-11-12T23:59:59+0000"}