{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34500", "minValue": "5000", "unitText": "YEAR", "value": "£34,500.00 plus £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:19:18+0100", "description": "&lt;p&gt;Mildmay Oaks is a low secure and locked rehabilitation service for men with learning disability and autism spectrum disorder, and for women with learning disability.&lt;/p&gt;\n&lt;p&gt;Duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will monitor staff in direct patient care programmes and activities.&lt;/li&gt;\n&lt;li&gt;The post holder will embrace those managerial duties that require them to respond to night emergency situations, and the deployment of staff. To be the administrator of incidents/accidents that need to be referred to a higher body.&lt;/li&gt;\n&lt;li&gt;The post holder will be either ward based during part of the night, or peripatetic providing input into a group of wards across the region.&lt;/li&gt;\n&lt;li&gt;The post holder will liaise closely with the appropriate Ward Managers responsible for the 24 hour continuing responsibility of a ward.&lt;/li&gt;\n&lt;li&gt;The post holder will, in consultation, develop recognised and acceptable standards of care affecting the night service and will be expected to work an agreed number of day shifts per year to attend appropriate meetings, thus ensuring that policies and philosophies are being developed to reflect the full 24 hour service and to complete their mandatory and statutory training.&lt;/li&gt;\n&lt;li&gt;The post holder will ensure that both themselves and those staff working nights are fully conversant with existing hospital policies and procedures.&lt;/li&gt;\n&lt;li&gt;To develop the clinical role of the night nurse practitioner, using reflective practice skills&lt;/li&gt;\n&lt;li&gt;Ensure that all patients within the ward have their needs assessed, that programmes of care are developed to meet those needs, and are delivered in accordance with agreed policy during their span of duty.&lt;/li&gt;\n&lt;li&gt;The post holder will assist the Ward Managers in the evaluation of care offered by nursing staff on nights.&lt;/li&gt;\n&lt;li&gt;Ensure that staff complete the nursing records for each patient in accordance with agreed policy.&lt;/li&gt;\n&lt;li&gt;Ensure that advice/support and information to patients and their relatives/friends is provided as required.&lt;/li&gt;\n&lt;li&gt;Evaluates the effectiveness of care within the ward and takes appropriate action if required.&lt;/li&gt;\n&lt;li&gt;The post holder will ensure that night nursing staff understand and observe the requirements of the Mental Health Act and other legislation.&lt;/li&gt;\n&lt;li&gt;To facilitate liaison with other disciplines as necessary to meet the needs of patients.&lt;/li&gt;\n&lt;li&gt;Responsible for monitoring the standards of care given.&lt;/li&gt;\n&lt;li&gt;Responsible for monitoring the environmental standards within the wards and maintaining the safety of patients.&lt;/li&gt;\n&lt;li&gt;Ensures that all nursing staff act at all times in accordance with the NMC. Codes.&lt;/li&gt;\n&lt;li&gt;Ensures that theoretical and practical instruction on all aspects of care related to the area is provided.&lt;/li&gt;\n&lt;li&gt;The post holder will assist in the professional guidance and clinical development of all night nursing staff, in consultation with the appropriate Ward Managers for that ward. This will include formal feedback on staff during their time on nights.&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for reporting all untoward incidents to the appropriate manager, and on-call manager, and will assist in the compilation of statements following untoward accidents.&lt;/li&gt;\n&lt;li&gt;The post holder will liaise with on call nurse in order to maintain safe staffing levels throughout the hospital at night. This may include last minute staff deployment.&lt;/li&gt;\n&lt;li&gt;The post holder will complete on a nightly basis all relevant documentation in relation to staff movement / sickness reporting.&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for responding to all clinical emergencies and fire alarm alerts.&lt;/li&gt;\n&lt;li&gt;Maintains efficient and effective communication with Ward Managers and opposite number on issues related to the wards and patient care.&lt;/li&gt;\n&lt;li&gt;Attends and participates in ward and other meetings as required or as directed, and participates in the development of ward and nursing policy.&lt;/li&gt;\n&lt;li&gt;To ensure that Team Briefing is devolved down to the night nursing staff.&lt;/li&gt;\n&lt;li&gt;To co-operate in implementing the requirements of all Health and Safety and Environmental Legislation related to Codes of Practice and Safety Instructions.&lt;/li&gt;\n&lt;li&gt;To take part in statutory and mandatory training as appropriate.&lt;/li&gt;\n&lt;li&gt;Clinical/Managerial supervision is a formal relationship with the specific aim of developing and improving and monitoring care. As an employee of the nursing department you will be expected to receive regular supervision.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be a successful Senior Floating Nurse, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum Qualifications&lt;/li&gt;\n&lt;li&gt;RMN/RNLD&lt;/li&gt;\n&lt;li&gt;At least 3 years post-registration experience&lt;/li&gt;\n&lt;li&gt;Management Training/previous responsibility desirable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits:&lt;/p&gt;\n&lt;p&gt;• Competitive salary&lt;/p&gt;\n&lt;p&gt;• 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/p&gt;\n&lt;p&gt;• Extra Service Annual leave awards&lt;/p&gt;\n&lt;p&gt;• Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/p&gt;\n&lt;p&gt;• A contributory pension scheme&lt;/p&gt;\n&lt;p&gt;• An employee assistance programme&lt;/p&gt;\n&lt;p&gt;• Free meals/refreshments when on duty&lt;/p&gt;\n&lt;p&gt;• Free car parking&lt;/p&gt;\n&lt;p&gt;• Sign on bonus&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;£1000 on joining&lt;/li&gt;\n&lt;li&gt;£1000 after 6m probation&lt;/li&gt;\n&lt;li&gt;£1000 after 1 year service&lt;/li&gt;\n&lt;li&gt;£1000 after 2 years’ service&lt;/li&gt;\n&lt;li&gt;£1000 after 3 years’ service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Total = £5000 over 3 years&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/p&gt;\n&lt;p&gt;• Moving less than 100 miles up to £2,000&lt;/p&gt;\n&lt;p&gt;• If more than 100 miles up to £4,000&lt;/p&gt;\n&lt;p&gt;• To be repaid if individual does not complete probation &amp; leaves&lt;/p&gt;\n&lt;p&gt;• Payment into the pension scheme&lt;/p&gt;\n&lt;p&gt;• CPD top up&lt;/p&gt;\n&lt;p&gt;• Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchfield, Hook, Hampshire", "postalCode": "RG27 8BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2921", "longitude": "-.912542"}}, "title": "Senior Floating Nurse (RMN/RNLD) with £5k Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225690", "validThrough": "2020-11-13T23:59:59+0000"}