{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23121", "minValue": "21789", "unitText": "YEAR", "value": "£21,789 - £23,121 per annum including HCAS"}}, "datePosted": "2020-11-05T14:30:46+0000", "description": "&lt;p&gt;The Department of Medicine for Older People are looking for 2 experienced and hard working HealthCare Assistant&#39;s to join our to join our dynamic Frailty Team.&lt;/p&gt;\n&lt;p&gt;You must be passionate about providing a high standard of care to older adults living with frailty. Have the capacity to remain positive, patient and calm with patients who may be confused and or have known cognitive impairment&lt;/p&gt;\n&lt;p&gt;You must be patient, enthusiastic, motivated with good communication skills, have the ability to work under pressure and most importantly passionate about elderly care.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to assist a team of Frailty Nurses and other healthcare professionals; the care and support that you offer patients during their time in hospital will be invaluable in ensuring that their time here is as comfortable and stress free as possible.&lt;/p&gt;\n&lt;p&gt;Previous experience in an acute environment is desirable&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and adults at risk and expects all staff and volunteers to share this commitment. We promote the wellbeing and safety of all our patients and carers by acting promptly on concerns, communicating effectively and sharing information appropriately, according to the standards determined by our policy and procedures. All posts working with vulnerable groups will be subject to an enhanced criminal records check upon appointment and staff will need to give their consent for the Trust to receive regular updates on their criminal records status throughout their employment.&lt;/p&gt;\n&lt;p&gt;Due to the high volumes of applications we receive for certain posts, we reserve the right to close any adverts before the published closing date once we have received a sufficient number of applications. After the closing date we strongly advise you check the email account which is registered. If you have not heard from us within four weeks of the closing date, please assume that you have not been shortlisted.&lt;/p&gt;\n&lt;p&gt;Our employment checking processes require that all shortlisted applicants provide the contact details of their current HR Department. If shortlisted you will be sent an email reminder to present the contact details of your HR Department at the interview.&lt;/p&gt;\n&lt;p&gt;Please note the Trust uses identity checking software for verifying the authenticity of identity documents provided by candidates.&lt;/p&gt;\n&lt;p&gt;Please note, as per updated UKVI guidelines, from April 2017 candidates appointed to any role that we are able to request sponsorship for a Tier 2 (general) visa will be required to provide an overseas criminal record certificate for themselves and any adult dependents from each country that they have lived in consecutively for 12 months or more in the past 10 years.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to the Equality and Diversity at LNWUH, we are encouraging applications from BAME (Black, Asian and Minority Ethnic) candidates as we seek to ensure our workforce structures are representative of the diversity of the communities we serve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMargaret KingJob titleFrailty NurseEmail addressmargaretking6@nhs.netTelephone number07584 140061Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information or an informal visit to meet the Frailty team please contact or Margaret King.&lt;/p&gt;\n&lt;p&gt;margaretking6@nhs.net&lt;/p&gt;\n&lt;p&gt;or call - 07584 140061&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park, Harrow", "postalCode": "HA13UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258126", "validThrough": "2020-11-18T23:59:59+0000"}