{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "35000", "unitText": "YEAR", "value": "£35,000 -£40,000"}}, "datePosted": "2020-11-02T13:31:27+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Operations Manager – Dorking Medical Practice&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dorking Medical Practice is a well-established innovative Primary Care provider serving a total of 11,250 patients in Dorking, Boxhill and Westcott. The organisation has a mission to provide excellent patient services with a focus on holistic and evidence based medical care in a friendly, safe and family-centred environment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen for the position of a full-time Operations Manager to join our experienced team. We are looking for someone who is motivated, conscientious, flexible and has excellent communication and leadership skills. A competitive salary will be offered to the right candidate. NHS experience is not essential; the candidate, however, must be highly self-motivated, organised and able to manage and motivate the team. Resilient leadership skills, effective communication ability at all levels and competency in IT are essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have aptitude to support practice engagement within the wider health economy to ensure that we are consistently kept aware of best practice and new developments. In order to deliver our vision, you will be supported in your role by an Operations Coordinator and a Practice Coordinator, and work alongside our experienced Finance Manager.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Some of the post holder duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Overseeing the day-to-day operations of the practice, ensuring staff achieve their primary responsibilities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Functional management of all clinical and administrative staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Direct line management of the reception team leader, operations coordinator, practice nursing team and administrative team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Management of services required to meet contractual, quality and safety expectations, including CQC compliance&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Providing solid leadership based on a sound knowledge of Human Resource management&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Handling patient enquiries and suggestions, including oversight of the complaint’s procedure&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Deputise or representation for the partners at internal and external meetings&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Act as the primary point of contact for all key external stakeholders and commissioners&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Oversee responsibility for security, repairs, and maintenance of the premises&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Key attributes of the successful candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You must have a deep understanding of people management, together with a passion for improving healthcare processes and improving lives&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A strategic thinker, IT literate and excellent organisational attributes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;HR and team management skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Accomplished and pro-active leader with strong interpersonal skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Previous management and leadership experience&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ambitious to succeed and drive positive change&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Whilst you will bring your experience to the role, you will also receive significant support from the partners and middle management teams. For further information and a job description. please email &lt;span&gt;vishalsagar@nhs.net&lt;/span&gt; with an expression of interest letter outlining how your experience is relevant to the post and a CV.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking", "postalCode": "RH4 2QR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2285", "longitude": "-.335492"}}, "title": "Operations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252251", "validThrough": "2020-11-30T23:59:59+0000"}