{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T12:16:46+0000", "description": "&lt;p&gt;Thank you for your interest in the role of Consultant in Diabetes and Endocrinology at Yeovil District Hospital NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic and enthusiastic consultant with the passion to develop and deliver high-quality Diabetes and Endocrine services for our Somerset population.&lt;/p&gt;\n&lt;p&gt;There are 33,000 people diagnosed with diabetes in Somerset, increasing by about 1250 per year. The Somerset Diabetes Service is evolving into a fully integrated, county wide service across primary care, community care and hospital based care. The philosophy of the service is to put specialist knowledge closer to the person with diabetes. In view of the increasing patient numbers with diabetes, combined with a longer term rise in endocrine workload, there is a growing demand at YDH to deliver specialist care and a consequent need to increase the consultant establishment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Currently the Diabetes and Endocrine service provides:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Diabetes&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Young adult / transition - an expanding service with close links to the paediatric diabetes team&lt;/li&gt;\n&lt;li&gt;Diabetes in pregnancy – a growing MDT service with high quality outcomes&lt;/li&gt;\n&lt;li&gt;Insulin pumps – an expanding service&lt;/li&gt;\n&lt;li&gt;Diabetic foot – inpatient and outpatient MDT service&lt;/li&gt;\n&lt;li&gt;Diabetic nephropathy with close links to the visiting Nephrologists&lt;/li&gt;\n&lt;li&gt;Type 1 Diabetes and Complex Type 2 Diabetes&lt;/li&gt;\n&lt;li&gt;Inpatient diabetes care – with dedicated Diabetes Inpatient Specialist nurses&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Endocrinology&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;General endocrinology – full range of endocrine conditions seen with facility for rapid access for urgent cases&lt;/li&gt;\n&lt;li&gt;Thyroid - Monthly clinic for thyroid disorders&lt;/li&gt;\n&lt;li&gt;Pituitary - Quarterly MDT clinic with pituitary neurosurgeon&lt;/li&gt;\n&lt;li&gt;Lipids - Patients with lipids disorders seen in the general endocrine clinics&lt;/li&gt;\n&lt;li&gt;Dynamic endocrine testing (just under 200 per year) - full range of dynamic endocrine tests undertaken&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why should you choose this post?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be joining a dynamic, friendly and highly skilled multidisciplinary team (2.0 WTE consultants, 3.0 WTE diabetes specialist nurses, a specialist dietician (0.5 WTE) and 1.0 WTE podiatrist)&lt;/li&gt;\n&lt;li&gt;Excellent relationships with our radiology, vascular, orthopaedic, plaster room, microbiology and chemical pathology colleagues&lt;/li&gt;\n&lt;li&gt;Strong links with our pituitary neurosurgeon (Southmead Hospital, Bristol) with a well-established MDT clinic.&lt;/li&gt;\n&lt;li&gt;Numerous opportunities for research in both diabetes and endocrinology&lt;/li&gt;\n&lt;li&gt;There is an annual training allowance to enable attendance at regional, national and international diabetes and endocrine meetings / conferences to ensure the day-to-day care provided is evidence based and network opportunities are maximised.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why should you choose Somerset?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Somerset is a wonderful place to live.&lt;/strong&gt; Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;From the beaches of North Devon and Dorset, to the cosmopolitan centres of Bristol, Bath, and Exeter, you can enjoy all the perks while still being less than two hours from London. Somerset has a diverse range of shopping and restaurants, and boasting sporting arenas such as the county cricket ground regularly hosting international fixtures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton. Whilst over the border in Dorset (just 6 miles from Yeovil) Sherborne’s prestigious schools have been attended by world famous actors, authors, politicians, athletes and scientists.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;With a great educational offering, and abundance of open countryside, we think there’s nowhere better.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Alex BickertonJob titleConsultant in Diabetes and EndcrinologyEmail addressalex.bickerton@ydh.nhs.ukTelephone number01935 384468Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details, / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Alex Bickerton, Consultant in Diabetes and Endcrinology&lt;/p&gt;\n&lt;p&gt;Email: – alex.bickerton@ydh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01935 384468&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121892.jpg", "name": "Yeovil District Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil District Hospital, Yeovil District Hospital", "postalCode": "BA21 4AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9453", "longitude": "-2.63391"}}, "title": "Consultant in Diabetes and Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242384", "validThrough": "2020-11-09T23:59:59+0000"}