{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T14:30:48+0000", "description": "&lt;p&gt;We are currently seeking highly motivated nurses to join our nurse led unit as Chemotherapy Development Nurses at Kent and Canterbury Hospital.&lt;/p&gt;\n&lt;p&gt;Whilst this is a challenging role and requires someone who is flexible and adaptable to changing environments it is very rewarding and offers great career progression.&lt;/p&gt;\n&lt;p&gt;No one day is the same and draws on and enables the post-holder to use a variety of skills and expertise. You must like working with people and want to make a real difference to our patients and families lives as well as make a positive contribution to the team and our service.&lt;/p&gt;\n&lt;p&gt;If you feel this is you or if you are either a newly qualified or more experienced registered nurse who would like to broaden your nursing career and specialise in this area we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;The posts offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to develop professionally with the aim of becoming a competent, knowledgeable chemotherapy nurse&lt;/li&gt;\n&lt;li&gt;The ability to give holistic care to the patient and their family, throughout their course of treatment&lt;/li&gt;\n&lt;li&gt;The opportunity to work in the very specialised area of cancer services&lt;/li&gt;\n&lt;li&gt;The ability to manage empathetically emotional issues relating to stages in the patient’s journey&lt;/li&gt;\n&lt;li&gt;The opportunity to be part of a team that works collaboratively with all care groups to develop a service for the care and management of patients with cancer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder is expected to carry out all relevant forms of care in which they are competent, without direct supervision, and may be required to supervise and support the training of both qualified and unqualified members of staff.&lt;/p&gt;\n&lt;p&gt;These are just some of the reasons that make this a ‘great place to work’.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For Informal visit please contact Leigh Carvill, Unit Manager on 01227 783096&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Chemotherapy Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242894", "validThrough": "2020-11-09T23:59:59+0000"}