{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32426", "minValue": "32426", "unitText": "YEAR", "value": "19.29"}}, "datePosted": "2020-10-15T12:46:49+0100", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Specialist Dietician -Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: &lt;/strong&gt;The Pennine Acute Hospital Trust, Salford M6 8HD&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Community Paediatric Dietetics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £19.29 Saturdays/Nights: £25.08 Sunday/Bank Hols: £30.87&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35989&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Minds that cure. Hearts that care.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Good’ in a recent CQC report, country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Specialist Dietician available at The Pennine Acute Hospital Trust.&lt;/p&gt;\n&lt;p&gt;The main purpose of the job will be to deliver specialist clinical work as part of the multidisciplinary team providing specialist Dietetic care and contributing to patient outcomes.&lt;/p&gt;\n&lt;p&gt;Working with patients who have a range of complex needs in Paediatric Dietetics including faltering growth, milk allergy, multiple food allergy, coeliac disease, nutritional assessment and advice and enterally fed children.&lt;/p&gt;\n&lt;p&gt;Assess and treat own caseload of patients who have complex presentations and maintain own records as an autonomous practitioner.&lt;/p&gt;\n&lt;p&gt;Contribute to the co-ordination of the relevant clinical services alongside the Highly Specialist Dietitian.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Tasks &amp; Overview of Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To accept clinical responsibility for a designated caseload of patients, and to organise this efficiently and effectively with regard to clinical priorities and use of time.&lt;/li&gt;\n&lt;li&gt;Deputise for the Highly Specialist Dietitian, and assist in the planning, coordination and evaluation of the dietetic service provided to patients in a designated area.&lt;/li&gt;\n&lt;li&gt;To attend multidisciplinary meetings and liaise with MDT members as appropriate to ensure a co-ordinated approach to patient care.&lt;/li&gt;\n&lt;li&gt;Decide priorities for own work area, balancing other patient related and professional demands, and ensure that these remain in accordance with specialty.&lt;/li&gt;\n&lt;li&gt;To support the safe and timely discharge of patients on home enteral tube feeding and liaise with appropriate internal and external agencies.&lt;/li&gt;\n&lt;li&gt;Attend staff meetings and participate in discussions concerning the running of the nutrition and dietetic service.&lt;/li&gt;\n&lt;li&gt;Participate in the planning and achievement of departmental objectives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Pennine Acute Hospital Trust has an enviable reputation, great supportive team with a family feel.  Based in the heart of the Hospitals main site, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patients needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;State Registered Dietitian with the HCPC&lt;/li&gt;\n&lt;li&gt;BSc. or MSc. in Nutrition and Dietetics Or BSc. in relevant science followed by  Post Graduate Diploma or State Registration  in Dietetics&lt;/li&gt;\n&lt;li&gt;· Knowledge and experience of working clinical in the field of dietetics.&lt;/li&gt;\n&lt;li&gt;Knowledge of nutritional needs and nutritional assessment in a range of clinical conditions&lt;/li&gt;\n&lt;li&gt;Working knowledge of a range of clinical conditions and current best practice for dietetic management&lt;/li&gt;\n&lt;li&gt;Up to date knowledge of treatment for simple paediatric conditions eg faltering growth, milk allergy&lt;/li&gt;\n&lt;li&gt;Good communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;Understand of different approach to teaching children/carers&lt;/li&gt;\n&lt;li&gt;Experience of liaising with children&lt;/li&gt;\n&lt;li&gt;Evidence of CPD activities &lt;/li&gt;\n&lt;li&gt;Experience of team working&lt;/li&gt;\n&lt;li&gt;Experience of working with individuals and groups of staff and patients&lt;/li&gt;\n&lt;li&gt;To demonstrate an awareness and understanding of supporting equality and valuing diversity within their role&lt;/li&gt;\n&lt;li&gt;Basic IT skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Katie Phillips, Recruitment Consultant on 0333 014 4370 or Katie.Phillips&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228240", "validThrough": "2021-05-31T23:59:59+0100"}