{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 £19,737 - £21,142 per annum/pro"}}, "datePosted": "2020-10-29T16:00:54+0000", "description": "&lt;p&gt;We are looking for a motivated and caring individual to come and work for us as a Health Care Support Worker in our busy and dynamic acute adolescent service in Marlborough House Inpatient Unit, Swindon. We are a forward thinking multi-disciplinary team who specialise in working with adolescents with acute mental health needs and their families.&lt;/p&gt;\n&lt;p&gt;Your role as a Healthcare Support Worker will be to work as part of the nursing team to deliver day to day care, which can encompass supervising meals and giving support during and following mealtimes to young people and working closely with their families to support and empower them.&lt;/p&gt;\n&lt;p&gt;You will be involved in carrying out individual observations to those patients that may need a higher level of staff input. You will be involved in the case team of a small number of patients as well as having the opportunity to co-facilitate groups on the unit.&lt;/p&gt;\n&lt;p&gt;To be successful in the role you must be of robust character, be able to reflect on your practice, have common sense, warmth and an ability to work well within the team.&lt;/p&gt;\n&lt;p&gt;You will be required to work shifts which will include nights. Our shift patterns are as follows: early shifts 07:00-14:45, late shifts 13:15-21:00 and the night shifts are 20:40-07:20.&lt;/p&gt;\n&lt;p&gt;You must have a willingness and ability to role model healthy eating behaviour with patients and support as trained/required. A level of fitness and ability to competently perform Physical Interventions and/or Breakaway techniques (practical and theory) following training is also essential.&lt;/p&gt;\n&lt;p&gt;You do not need prior experience in the field but some experience of caring for others would be an advantage. The post is suitable both for those that are looking for a career change and those seeking experience in a care field prior to further studies.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tom Waterfield (Acting Modern Matron) on 01865 903480&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marlborough House Inpatient Unit, Okus Rd, Old Town, Swindon, Swindon", "postalCode": "SN1 4JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5501", "longitude": "-1.79727"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248984", "validThrough": "2020-11-12T23:59:59+0000"}