{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-19T11:46:54+0100", "description": "&lt;p&gt;&lt;strong&gt;What we do&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The vision for the Integrated Community Re-enablement and Assessment Service (ICRAS) is that a multidisciplinary team work together to manage the care of people both in the community, requiring support of an urgent nature and who are risk of imminent hospital admission as well as those transitioning from an acute environment who require additional support. The service consists of a multidisciplinary approach including General Medical Practitioners, Advanced Practitioners, Pharmacists, Nursing staff, Occupational Therapists, Physiotherapists, Social Workers, Podiatrist, Dietician, Assistant Practitioners and Health Care Assistants.&lt;/p&gt;\n&lt;p&gt;The ICRAS service operates for 24 hours a day over 7 days, services across Liverpool and South Sefton may vary in operating/shift hours, for example therapists can work core hours/shifts and cover a weekend rota.&lt;/p&gt;\n&lt;p&gt;Within the ICRAS pathway we have inpatient Intermediate Care beds (Ward 35 University Hospital Aintree and Hub Rehabilitation Units across the City of Liverpool), Community services across Liverpool and Sefton with a multidisciplinary team approach to facilitate discharges and prevent hospital admissions.&lt;/p&gt;\n&lt;p&gt;Exciting new initiatives within ICRAS such as HARL(The Hospital Avoidance Response for Liverpool) and ERISS (Electronic Referral Information Sharing system) have been recently launched, a co-ordinated approach with NWAS to assess, support and signpost patients to enable them to remain at home preventing hospital admissions.&lt;/p&gt;\n&lt;p&gt;ICRAS provides high quality, culturally sensitive, nursing and therapy treatment/interventions for people in their permanent or temporary place of residence (Hub rehab units). Promoting a co-ordinated approach to admission avoidance that facilitates a seamless service leading to improved health and social care outcomes.&lt;/p&gt;\n&lt;p&gt;Therefore reducing the incidence of re-admission through education seeking early intervention providing an evidence based approach to clinical practice to improved patient care.&lt;/p&gt;\n&lt;p&gt;ICRAS aims to prevent inappropriate and/or avoidable hospital admissions by providing short term, intensive, multidisciplinary and holistic assessment treatment of care, ensuring collaborative working with existing social care providers and other agencies, NWAS, working with GPs, clinicians and Liverpool City Council via Home First +.&lt;/p&gt;\n&lt;p&gt;ICRAS philosophy reflects the vision and values of Mersey Care NHS Trust.&lt;/p&gt;\n&lt;p&gt;ICRAS promotes a “Just and Learning Culture”, where we put equal emphasis on accountability and learning.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A robust clinical support structure with regular clinical supervision and performance development review.&lt;/li&gt;\n&lt;li&gt;A comprehensive monthly in-service training programme.&lt;/li&gt;\n&lt;li&gt;Multiple external training and development opportunities working with both University of Liverpool and Liverpool John Moores University.&lt;/li&gt;\n&lt;li&gt;A rapidly expanding NHS Trust that is committed to investing in its future and its staff.&lt;/li&gt;\n&lt;li&gt;Opportunities to supervise and develop junior staff, students and therapy assistants.&lt;/li&gt;\n&lt;li&gt;An opportunity to be part of the development of an innovative and growing of health care that is at the centre of the future direction of healthcare.&lt;/li&gt;\n&lt;li&gt;Structured career progression, support and opportunities.&lt;/li&gt;\n&lt;li&gt;Rotational opportunities across Liverpool and South Sefton, community and bed based services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we want&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated band 6 physiotherapists who have a broad range of clinical skills and who are comfortable operating autonomously within a range of different clinical and community settings, flexible and able to travel independently across the Liverpool and South Sefton areas. You will have high standards of patient care and be motivated to contribute to the development of the ICRAS model of community care.&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Mannion ICRAS Operational Manager– 0151 247 6737&lt;/p&gt;\n&lt;p&gt;Martin Schofield ICRAS Therapy Team Lead – 0151 247 6740&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool and South Sefton, Liverpool and South Sefton", "postalCode": "L7 9NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4083", "longitude": "-2.93346"}}, "title": "Physiotherapist (ICRAS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232093", "validThrough": "2020-11-08T23:59:59+0000"}