{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum, pro rata"}}, "datePosted": "2020-11-03T10:46:49+0000", "description": "&lt;p&gt;Are you looking for a new challenge and the opportunity to develop your skills and knowledge? Do you want to work as part of an innovative, friendly team with opportunities to work in specialised areas?&lt;/p&gt;&lt;p&gt;&lt;br /&gt;A new opportunity has arisen for a Medicines Governance Associate. This exciting position will offer the successful candidate an opportunity to carry out and analyse clinical audits working across multi-disciplinary teams to support the Trusts Medicines Safety Agenda.&lt;br /&gt;Working closely with the Medicines Governance and Safety Pharmacists and Specialist Governance Pharmacy Technicians, the Medicines Governance Associate will facilitate a range of medication and patient safety audits. The successful candidate will work with the team to analyse the audit data and provide evidence and assurances to the department and external stakeholders that Lancashire Teaching Hospitals (LTHTR) are providing a high quality, patient focused and safe service.&lt;/p&gt;&lt;p&gt;&lt;br /&gt;The successful candidate will be an effective team player who is able to prioritise their own workload, have effective written and oral communication, interpersonal, IT and time management skills.&lt;/p&gt;&lt;p&gt;&lt;br /&gt;The Pharmacy department at Lancashire Teaching Hospitals (LTHTR) is an innovative and exciting place to work and we are working to further enhance the high quality services provided.&lt;/p&gt;&lt;p&gt;&lt;br /&gt;We are one of the largest trusts in the Country, providing district general hospital services to people in Preston and Chorley and specialist care (Neurology, Neurosurgery, Burns and Plastics, Oncology and Renal Medicine) to 1.5m people across Lancashire and South Cumbria in addition we are proud to be the regional Major Trauma Centre providing life and limb saving treatment for patients throughout Lancashire and South Cumbria.&lt;/p&gt;&lt;p&gt;&lt;br /&gt;At Lancashire Teaching Hospitals NHS Foundation Trust our aim is to always provide excellent care with compassion to deliver the highest quality of care our patients deserve. We value the personal skills, experiences and qualities that individuals bring to the Trust; creating an inclusive working environment to attract talented people who feel motivated, involved and able to influence the future direction of our services. The wellbeing of staff is important to us; we have a dedicated Health and Wellbeing team who provide support on a range of topics, run fitness classes and organise mindfulness sessions. As an employer we have earned a reputation for focusing on the development of our staff and for being an organisation people are proud to work for.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Interview date: Wednesday 18th November 2020&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;&lt;p&gt;David Howarth, Medicines Goverance Pharmacy Technician - david.howarth@lthtr.nhs.uk or 01772 528318&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancashire Teaching Hospital, PRESTON", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Medicines Governance Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253540", "validThrough": "2020-11-16T23:59:59+0000"}