{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 per annum"}}, "datePosted": "2020-11-05T12:16:46+0000", "description": "&lt;p&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England (HEE) exists for one reason only: to support the delivery of excellent healthcare and health improvement to the patients and public of England by ensuring that the workforce of today and tomorrow has the right numbers, skills, values and behaviours, at the right time and in the right place.&lt;/p&gt;\n&lt;p&gt;Training Hubs are integral to Health Education England’s core purpose. Their activities support the delivery of HEE objectives and priorities as described in our Mandate and the HEE workforce plan: “Framework 15”. They are also ideally placed to work within the NHS’s newly emerging system architecture and support the delivery of the NHS’ Long Term Plan.&lt;/p&gt;\n&lt;p&gt;Currently the priorities, activities and maturity of Training Hubs varies which has proven challenging in ensuring the consistency of activities and the roll out of effective/innovative programmes. However, their potential to develop further is considerable as they are ideally positioned to enable “place-based” delivery of education, training and workforce development for the wider NHS primary care workforce at undergraduate and postgraduate levels and at all stages of a NHS professional’s career in primary care. We believe that through a “place-based” approach Training Hubs can positively influence workforce “investment decisions” and the delivery of population healthcare needs to help tackle healthcare inequalities.&lt;/p&gt;\n&lt;p&gt;To assist Training Hubs across the Midlands region develop, reach the required “maturity” and achieve their new remit, we are looking to expand our Primary Care Team. We are therefore looking to recruit to a number of posts which will provide dedicated, bespoke support to our 11 regional place-based footprints/Training Hubs. These posts are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Head Primary Care Workforce Transformation&lt;/li&gt;\n&lt;li&gt;Training Hub and Workforce Development Lead&lt;/li&gt;\n&lt;li&gt;Primary Care Programme Support Manager&lt;/li&gt;\n&lt;li&gt;Primary Care Administrator&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Due to the region’s size we intend to recruit people to support either the East Midlands or West Midlands localities.&lt;/p&gt;\n&lt;p&gt;This is a new team which will work within the Primary Care School enabling it to develop close links with other regional Primary Care colleagues. It will also work closely with the colleagues supporting Primary Care within the region’s Workforce Transformation Hub.&lt;/p&gt;\n&lt;p&gt;The successful postholder will provide a range of flexible administrative support services to ensure the smooth running of the Primary Care School across the region and will be expected to support the team in the effective administration of the Primary Care Long Term Plan, Mandate and People Plan deliverables ensuring deadlines are met and that activities are planned in a timely and effective manner.&lt;/p&gt;\n&lt;p&gt;The postholder will be an experienced Administrator with proven experience of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing secretariat for a range of key meetings associated with the programme&lt;/li&gt;\n&lt;li&gt;Planning and co-ordinating meetings and events&lt;/li&gt;\n&lt;li&gt;Acting as the first point of contact for all diary management and travel arrangements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post can be based in either of HEE’s Midlands regional offices i.e. Birmingham or Leicester. The successful postholder will be required to travel across the Midlands region as required.&lt;/p&gt;\n&lt;p&gt;It is anticipated that Interviews will be undertaken virtually via Microsoft Teams, date to be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 4 with a full-time starting salary of £21,892, with a pay step increase after 3 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Amy Beeton&lt;/p&gt;\n&lt;p&gt;Job title: Portfolio Lead (Primary Care)&lt;/p&gt;\n&lt;p&gt;Email address: amy.beeton@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Gill Beardmore (gillian.beardmore@hee.nhs.uk) and Heidi Davis (heidi.davis@hee.nhs.uk).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Westbridge Place, Leicester or St Chad&#39;s Court, Birmingham", "postalCode": "LE3 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.633", "longitude": "-1.14242"}}, "title": "Primary Care Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257629", "validThrough": "2020-11-19T23:59:59+0000"}