{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-04T13:25:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like to progress your career, begin training in the Nursing Associate role and become part of the changing nursing and care workforce at UHBFT?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nursing Associates are members of the nursing team who have gained a Foundation Degree typically involving a 27 month training programme delivered in partnership between an employer and a university. Nursing Associates are accountable for their own practice and are regulated by the Nursing &amp; Midwifery Council (NMC). Further information about the role of the Nursing Associate can be found on the NMC website.&lt;/p&gt;\n&lt;p&gt;At UHBFT we are looking to recruit talented, passionate and committed individuals as Trainee Nursing Associates, we will provide you with the opportunity to develop your skills and knowledge by being based in a hospital site or service and undertake the Trainee Nursing Associate programme delivered in partnership with Birmingham City University.&lt;/p&gt;\n&lt;p&gt;We would aim for successful candidates to be in post at the Trust by no later than &lt;strong&gt;19th April 2021 &lt;/strong&gt;to be able to commence the University programme in &lt;strong&gt;May 2021&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Previous experience in a care environment is desirable but not essential as we will provide a comprehensive clinical induction.&lt;/p&gt;\n&lt;p&gt;In order to be shortlisted you &lt;strong&gt;MUST&lt;/strong&gt; demonstrate on your application form that you have the essential qualifications in Maths &amp; English ( you must state grade achieved ) as outlined  on the person specification. As part of the recruitment process candidates will be expected to provide all certificates for these essential qualifications. If you do not hold the actual certificates for your qualifications you will need to request them. Failure to produce satisfactory certificates will mean that you will not be able to progress further with the recruitment process.&lt;/p&gt;\n&lt;p&gt;In addition you need to have one of the level 3 or equivalent qualifications as stated on the person specification. If you are due to complete this qualification and will have received your certificate confirming that you have passed by the 30th December 2020 you can still apply.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you have any queries about this exciting opportunity please email   &lt;/span&gt;&lt;span&gt;TraineeNursingAssociateEnquires@heartofengland.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on the 15th and 17th December 2020 and 11th January 2021&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Trainee Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256009", "validThrough": "2020-11-18T23:59:59+0000"}