{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-11-03T16:05:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Admin/Data Clerk Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunnity for 2 experienced administrators to join the clinic teams in Newcastle, Moorlands and Stoke. Post 1 will be based in Stoke and provide day to day admin support to the district nursing clinic teamsacross the Stoke area. Post 2 will provide day to day admin support to the district nursing clinic teams across Newcastle and Moorlands. The successful applicants will be expected to travel to various locations within the specified area and will also provide some administrative support to other nursing teams in the area.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and enthusiastic people to join us to provide comprehensive administrative support to the teams. The successful applicants will be flexible and organised, have excellent telephone manner, speaking to patients directly and ability to maintain composure when dealing with challenging situations. You will be expected to work autonomously and effectively prioritise your own workload.&lt;/p&gt;\n&lt;p&gt;The main responsibilities are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Inputting data and updating demographic records.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Call handling.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Monitoring and ordering stock.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Recording and collating data, including generating reports.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Co-ordinating and updating rota’s with the service lead.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;General office admin duties (filing; photocopying; archiving etc).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Co-ordinating and documenting team meetings.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be working in a dynamic office environment and have the ability to liaise with a variety of people both face to face or on the telephone. The post holders will be competent users of Microsoft Office including Word, Excel and Outlook and Microsoft teams. Experience of entering accurate information onto databases is essential. Previous experience of clinical systems such as RiO, eCommunity, S2S and iPortal is also an advantage, however training will be provided to the successful applicant if required.&lt;/p&gt;\n&lt;p&gt;The ability to travel between local Health venues is also essential for this role.&lt;/p&gt;\n&lt;p&gt;If you enjoy working on your own initiative as well as being part of a growing friendly team this could be the job for you.&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Tina Blackman: Tina.Blackman@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or Mandie Spooner: Amanda.Spooner@mpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle-under-Lyme &amp; Stoke-on-Trent", "postalCode": "ST5 0DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0371", "longitude": "-2.2171"}}, "title": "Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254720", "validThrough": "2020-11-13T23:59:59+0000"}