{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-29T10:56:30+0000", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Job advert for Band 5 Occupational Therapist in the Calderdale Vocational Team – 37.5 hours&lt;/span&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;A rare and exciting opportunity has arisen for a Band 5 Occupational Therapist to work within the specialist Calderdale Vocational Team. This means you will be able to use your occupational therapy skills and contribute to the development of the service as an OT. This integrated health and social care team works with service users who are in secondary mental health services and takes referrals from the Core and Enhanced community teams in Calderdale.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would be responsible for carrying out specific Occupational therapy assessments and vocational interventions around recovery focussed approaches to supporting service users to stay in work, access training, education and volunteering opportunities within the local community. With a designated and varied caseload you would have opportunities to develop skills in this specialist area with the support and supervision of a band 6 Occupational Therapist. The role involves actively promoting the role of occupational therapy in this vocational field but will also involve working with mental health staff from a range of professional backgrounds, local authority staff and community partners to develop innovative and positive practice. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have excellent communication skills plus strong assessment and formulation skills as these are central to this role. The post provides opportunities to liaise with many external providers across a range of settings including working with employers so there is scope to develop independent thinking and creative approaches. The service has recently had to adapt to changed ways of working related to Covid- 19 which means that remote working with service users will continue to be used alongside community and building based work as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A dedicated service for employment and mental health is provided by the Individual Placement and Support (IPS) team and you will have close working links with this team to ensure that Service Users have access to the full range of vocational interventions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this post and want to find out more then please contact Amanda McKenzie. Vocational Team Manager on 07557152291&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HALIFAX", "postalCode": "HX1 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7245", "longitude": "-1.86887"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247996", "validThrough": "2020-11-12T23:59:59+0000"}