{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-28T13:01:19+0000", "description": "&lt;p&gt;In 2016 AuditOne was created, bringing together four NHS internal audit teams under one organisation. Hosted by Northumberland Tyne and Wear NHS Foundation Trust, AuditOne is an NHS consortium based in the North East but now with a national reach. It employs around 80 staff and delivers in excess of 10000 days of internal audit, technology risk assurance and counter fraud services to the public and private sectors.&lt;/p&gt;\n&lt;p&gt;AuditOne continues to develop and expand and this expansion means we need dedicated and enthusiastic people to join and help us achieve our vision of being the acknowledged, national leader in internal audit, technology risk assurance and counter fraud and workforce investigations, delivering an exemplar service, with an unquestionable reputation for excellence, efficiency and client satisfaction.&lt;/p&gt;\n&lt;p&gt;The post holders will fulfil a key role within a team providing internal audit services to a group of clients. The post holder will provide a high level of audit skills and will work unsupervised across a range of clients and complex audits. Taking responsibility for the delivery of assurance audits and advisory reviews in line with time targets and resource allocations, arranging the detailed implementation of individual audits from the planning stage through to report issue.&lt;/p&gt;\n&lt;p&gt;The post holders should also be able to demonstrate relevant professional development through possession of an audit, accountancy or risk management qualification, or be equivalently qualified through experience.&lt;/p&gt;\n&lt;p&gt;Please note this role is a staff bank role.&lt;/p&gt;\n&lt;p&gt;In order for your application to be successfully processed, we will require references from your current and previous employer(s) which must cover a minimum period of three years. Please ensure that the reference section of your application is completed appropriately giving the address, telephone number and work email address of each of your current and previous line manager(s). If this section is not fully completed, your application may not be processed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carl Best - Director of Internal Audit&lt;/p&gt;\n&lt;p&gt;Email: carl.best@audit-one.co.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 07973814600&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lanchester Road Hospital, Durham", "postalCode": "DH1 5RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8009", "longitude": "-1.61141"}}, "title": "Senior Internal Auditor (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246696", "validThrough": "2020-11-11T23:59:59+0000"}