{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T14:46:53+0000", "description": "&lt;p&gt;Are you dynamic, motivated and proactive. Do you want to be part of something new?&lt;/p&gt;\n&lt;p&gt;Then WE WANT YOU!&lt;/p&gt;\n&lt;p&gt;We have two opportunities for a dynamic Physiotherapist or Occupational Therapist to join our Acute Frailty Assessment Units (FAU) as the Therapy Frailty Lead. One post will be based at William Harvey Hospital, Ashford and one will be based at QEQM, Margate. If you have significant clinical experience working within frailty and a track record of delivery, then you are the person for us. We are looking for two individuals who are calm and decisive under pressure and have strong communication and influencing skills. A Strategic understanding of patient flow and political astuteness across the health economy will be incredibly helpful in this role, ensuring patient safety, quality, access and a positive patient and carer experience is upheld at all times.&lt;/p&gt;\n&lt;p&gt;The post focuses on meeting the needs of the Frail population, requiring complex assessment and decision making to provide the right care in the right place with a focused patient centred approach to admission avoidance or short stay (maximum 48hrs). The FAU will operate a direct access principle, enabling frail patients to bypass A&amp;E wherever possible and have immediate access to a dedicated multi-disciplinary frailty team.&lt;/p&gt;\n&lt;p&gt;Key elements of the post are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Perform a comprehensive specialist assessment of an older person in-line with the Comprehensive Geriatric Assessment (CGA), including mood and cognition, gait and capacity assessment in all clinical settings.&lt;/li&gt;\n&lt;li&gt;Act as the Therapy Lead for Frailty to a team of dedicated frailty therapists, supporting the team with complex patients and planning service provision of a 7 day extended hour service 08:00 - 18:00 the service will be extending to 08:00 – 20:00 which will enable flexible working patterns.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Be a part of the Frailty Outreach service, assessing patients within Surgical and orthopaedic wards and providing advice and guidance to other specialist teams.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly, supportive, and professional integrated team comprising of Consultants, Nurses, Advanced Clinical Practitioners, Pharmacists and community colleagues&lt;/p&gt;\n&lt;p&gt;Our ideal candidates will be confident with extensive clinical experience and leadership across Frailty, clearly able to demonstrate a desire to actively participate in all aspects of the role. The successful candidate must be an effective team player with excellent communication and organisational skills. They will be able to demonstrate clear clinical reasoning and have the ability to explain their decisions and actions in a way that all concerned will be able to understand. They must also be able to demonstrate evidence of recent learning and examples of continued professional and clinical development.&lt;/p&gt;\n&lt;p&gt;In return we are very keen to support your future clinical and leadership development. You will be part of a supportive and proactive senior leadership team within Therapies as well as having visibility and influence across the trust.&lt;/p&gt;\n&lt;p&gt;For further information please contact Sally Hall, Clinical Director &amp; Head of Therapies or Clare Hardwick, Head of Inpatient Therapies,&lt;/p&gt;\n&lt;p&gt;sally.hall10@nhs.net&lt;/p&gt;\n&lt;p&gt;clare.hardwick1@nhs.net 07580 630922&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Hardwick, Head of Inpatient Therapy Services&lt;/p&gt;\n&lt;p&gt;Email address:Clare.hardwick1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number:07580630922&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Clinical lead Therapist - Frailty", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245044", "validThrough": "2020-11-10T23:59:59+0000"}