{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £42,712 per annum inc hcas"}}, "datePosted": "2020-11-05T11:15:58+0000", "description": "&lt;p&gt;The Oak Centre for Children and Young People at The Royal Marsden is one of the largest comprehensive centers’ in the UK treating and delivering the highest quality of care for Children, Teenagers and Young People with cancer. Our patients are undergoing investigations and treatments involving chemotherapy and radiotherapy as well as managing patients and families undergoing stem cell transplantation. With our large portfolio of treatment options and advances in cancer therapy and care our reputation and patient outcomes speak for themselves.&lt;/p&gt;\n&lt;p&gt;What makes The Royal Marsden stand out from other children’s centres in Europe is it is a world leader for the number of available “First in Child” clinical trials open to young cancer patients and work very closely with our specialist multi-professional drug development team to ensure patients and families are offered access to the very latest novel agents optimizing outcomes alongside creating unique learning opportunities and exciting career development pathways in specialist cancer practice and care&lt;/p&gt;\n&lt;p&gt;Our nursing opportunities are endless from working in acute and ambulatory settings we have further opportunities to work with our Drug Development and Research teams, Palliative care and symptom management department along with access to expert clinical nurse specialists and cancer trained advanced nurse practitioners. The expert roles available within the oak center are supported by the very generous educational and training policy harnessing the outstanding culture of The Royal Marsden and its core values. Expert cancer nurses of all levels are central to the success of our center. Nurses are highly regarded and encouraged to academically and educationally develop within the organization&lt;/p&gt;\n&lt;p&gt;We know it takes a very special person to care for children with cancer and as a specialist organization we excel in dedicated cancer career pathways from Newley qualified nurses to experienced cancer nurses.&lt;/p&gt;\n&lt;p&gt;We have &lt;strong&gt;new and exciting&lt;/strong&gt; internal rotational programmes available for those who are keen to experience what it is like to work in a world leading Paediatric and teenage, young peoples in-patient areas alongside the ambulatory and outpatient age appropriate facilities. New Staff are given a personalized approach to their learning needs adopting mentors and buddy’s to further advance their cancer training journey&lt;/p&gt;\n&lt;p&gt;The department also has new preceptorship initiatives enabling our new starters to enhance a classroom to bedside learning programme, supporting the very best start to their cancer nursing career within the oak centre&lt;/p&gt;\n&lt;p&gt;We are looking for Adult, Children’s or dual trained nurses who are dedicated, passionate about treating and managing children and young people and their families diagnosed with cancer, showcase compassion, have a sense of humour and real strength character are just some of the qualities that can make such a difference.&lt;/p&gt;\n&lt;p&gt;The unit offers flexible working patterns, crèche facilities and heavily focuses on multi-professional team working&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Eve Allan, Ward Sister, Eve.Allan@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Marsden Sutton Hopsital, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Staff Nurse - Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257398", "validThrough": "2020-11-19T23:59:59+0000"}