{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365.00 - £37,890.00"}}, "datePosted": "2020-11-06T14:30:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Deputy Sister/Charge Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Dorset - Poole Hospital - is the Trauma centre for East Dorset delivering care to adult patients. The vast majority of patients are admitted as emergencies following varying degrees of trauma. As such they require skilled medical and nursing interventions for a wide range of injuries. Trauma is currently undergoing an exciting transformation as we look to better meet the needs of our patients and this is an opportunity for someone to be involved in shaping that change in delivery of our services.&lt;/p&gt;\n&lt;p&gt;We seek to appoint a Deputy Sister/Deputy Charge Nurse to join our proactive and friendly team. You will need to be committed to the provision of quality patient care. Band 6 experience is not essential as this is an opportunity for the right individual, to develop into the role. Evidence of relevant continuing professional development and contribution to quality of care work is essential.&lt;/p&gt;\n&lt;p&gt;University Hospitals Dorset are committed to supporting on going professional development of individuals and teams, to energise a culture of improvement and engagement and we welcome talented and motivated individuals to join our team. Therefore, if you are highly motivated, and feel you can make a real difference to the quality of patient care delivery, we would be keen to hear from you.&lt;/p&gt;\n&lt;p&gt;Additional skills and abilities should include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Co-ordination of a team to ensure the delivery of skilled and effective nursing care to patients and their families reflecting the Trust’s values&lt;/li&gt;\n&lt;li&gt;Understanding of, and commitment to, ways in which quality of care can be improved and monitored&lt;/li&gt;\n&lt;li&gt;Ability to deputise for the Ward Lead as and when required.&lt;/li&gt;\n&lt;li&gt;Assessment of care needs and the development, implementation and evaluation of programmes of care without supervision.&lt;/li&gt;\n&lt;li&gt;Provision of clinical and managerial leadership to nursing and support staff.&lt;/li&gt;\n&lt;li&gt;Ability to support Ward Lead in monitoring and appraising the performance and work of the Nursing Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will need to demonstrate excellent inter-personal and organisational skills, a willingness to be flexible with shift patterns, and a drive to promote a high standard of care for our patients. We would consider a job share.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 20/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: week commencing 30/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Amy Rimmer, Sister Ward E3&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;amy.rimmer@uhd.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;0300 019 8415&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "University Hospitals Dorset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "POOLE, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Trauma Deputy Ward Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260121", "validThrough": "2020-11-20T23:59:59+0000"}