{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32478", "minValue": "32478", "unitText": "YEAR", "value": "£32,478  per annum pro rata"}}, "datePosted": "2020-10-15T20:15:17+0100", "description": "&lt;p&gt;We are looking for a Clinical Fellow (ST3+ Level) to join our Acute Medicine team. &lt;br /&gt;&lt;br /&gt;These are exciting times for Acute Medicine and the post holder will join an established team who are further developing our SDEC, Short Stay and Acute Medical Services.&lt;br /&gt;&lt;br /&gt;The post holder will be supported to develop their medical career and will be expected to provide senior cover, supporting junior colleagues.&lt;br /&gt;&lt;br /&gt;We are investing heavily in our Acute Medical services and as such, the rota will change as we recruit and develop the services.&lt;br /&gt;&lt;br /&gt;This post is not recognised for training however support in developing a Learning Portfolio and regular educational appraisal with a Consultant Educator will be available.&lt;br /&gt;&lt;br /&gt;Southend University Hospital NHS Foundation Trust is a Teaching Hospital, linked to the London University and is also the Cancer Centre for South Essex which is part of the Essex Cancer network. This busy DGH serves a population of 338,800. We currently employ 4,567 wte staff with a total complement of 190 Consultant staff. Situated in the South East of England, with excellent rail links to London. &lt;br /&gt;&lt;br /&gt;The Trust has an excellent Postgraduate Medical Centre which carries a full programme of events and offers access to a Medical Library.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Alfred FawoleJob titleClinical LeadEmail addressalfred.fawole@southend.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend Univeristy Hospital NHS Foundation Trust, Southend on Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Clinical Fellow (ST3+ Level) in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229241", "validThrough": "2020-11-12T23:59:59+0000"}