{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum"}}, "datePosted": "2020-10-15T17:01:00+0100", "description": "&lt;p&gt;Consultant in Community Paediatrics&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join a dynamic group of Community Paediatricians, Nursing and Therapies staff in an interesting area of London. The Specialist Children and Young People&#39;s Services (SCYPS) are part of East London NHS Foundation Trust (ELFT) which is recognised as a centre of excellence for innovation and improvement. Quality improvement is at the heart of our service delivery, ensuring children and their families are able to achieve the best possible outcomes.&lt;/p&gt;\n&lt;p&gt;We are advertising for a substantive post for a Consultant Community Paediatrician. The Post-holder will be expected to provide consultant input into the child development and neurodisability services, with the opportunity to develop a specialist interest (e.g. palliative care, epilepsy, transition) depending on experience and interest.&lt;/p&gt;\n&lt;p&gt;This post would suit a candidate with a strong track record in complex neurodevelopment and neurodisability. Other clinical duties will include triage and supervision for safeguarding, and specialist clinics as determined by the applicant’s experience and interests. The potential post-holder should also have relevant experience in quality improvement and service development, clinical management and leadership skills.&lt;/p&gt;\n&lt;p&gt;The role does not include on-call duties in Acute Paediatrics, although close working with colleagues in Hospital Paediatrics would be encouraged.&lt;/p&gt;\n&lt;p&gt;Applications will be welcomed from candidates included on or eligible for the GMC Specialist Register or within six months of obtaining CCT in Paediatrics. Applicants wishing to work less than full-time are also encouraged to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information, do contact:&lt;br /&gt;Dr Joanne Beckmann, Associate Clinical Director &amp; Consultant Community Paediatrician&lt;br /&gt;Dr Michelle Heys, Associate Clinical Director &amp; Consultant Community Paediatrician&lt;br /&gt;Dr Cathy Lavelle, Clinical Director for Childrens Services&lt;br /&gt;Tel: 0208 586 6250&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CS Child Health Doctors, LONDON", "postalCode": "E1 8DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5135", "longitude": "-.072681"}}, "title": "Consultant Community Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229105", "validThrough": "2020-11-15T23:59:59+0000"}