{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T11:31:28+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 8A Contract Performance &amp; Equipment Manager to support Critical Care, Theatres and Anaesthetics at University Hospital Southampton NHS Foundation Trust (UHS).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be part of the Care Group Management Team, supporting the development of the Care Group’s strategy, cost improvement and activity management programmes, estate challenges, and professionally leading on a number of projects and initiatives within the Care Group. Your key working relationships will be with the Care Group Manager for Critical Care, Theatres and Anaesthetics and Divisional Director of Operations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be responsible for securing value for money against new and existing contracts, consumables and equipment spend across Critical Care, Theatres and Anaesthetics as well as teams within paediatrics.&lt;/li&gt;\n&lt;li&gt;You will support and implement internal service redesign to improve quality and reduce costs whilst supporting clinical services to respond to the ever-changing needs and demands of a healthcare environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have a high degree of autonomy and will be expected to work with minimal direction, managing a demanding workload to support the delivery of sustainable services, ensuring schemes are realised against conflicting priorities.&lt;/li&gt;\n&lt;li&gt;You will need to work closely with colleagues at all levels in the organisation, clinical and non-clinical and outside of UHS.&lt;/li&gt;\n&lt;li&gt;You will need extensive experience of influencing behaviour, in often challenging situations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews to take place on 30/11/20.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracy Richards&lt;/p&gt;\n&lt;p&gt;Care Group Manager&lt;/p&gt;\n&lt;p&gt;Tracy.Richards@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;07766 440477&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Contract Performance &amp; Equipment Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259445", "validThrough": "2020-11-19T23:59:59+0000"}