{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T09:15:41+0000", "description": "&lt;p&gt;Are you a Band 5 Nurse looking for the next step in your career or a current Band 6 looking for a fresh challenge as Mental Health Liasion opportunity in Central Manchester.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for you to be part of fast growing and developing services. In line with the Five Year Forward Plan for Mental Health and an exciting transformation program of services, we are expanding our existing hospital liaison services.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health Service are recruiting Band 6 mental health practitioners at our Trafford and Central Manchester Site&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, ‘can do’, motivated Band 6 Mental Health Practitioners from a range of professional backgrounds including CAMHs to join us.&lt;/p&gt;\n&lt;p&gt;As one of the main mental health providers within Greater Manchester, we recognize the priority to achieve a parity between mental and physical health care and are committed to achieving this, enabled by our CORE 24 Liaison Mental Health services. Our services work at the interface between physical and mental health to bridge this gap. Our teams operate 24/7 to provide responsive mental health care in the acute hospital and A&amp;E settings, delivered by experienced and established multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;As the successful candidate, you will be enthusiastic, flexible and committed to delivering high quality mental health care in the general hospital and A&amp;E settings. You will bring with you a range of experiences and an established knowledgebase that will further enrich our teams and the service we provide. These personal attributes will enable you to provide comprehensive person-centered assessments, advice, direct interventions and onward care planning to people of a range of ages, with different needs.&lt;/p&gt;\n&lt;p&gt;You will be actively supported to develop as a mental health professional, building on your existing experience and knowledge. Due to the diverse nature of the populations we serve, you will have a wide range of exciting learning opportunities available to you. The day-to-day diversity of our services and the support in learning are key reasons why people join us! Your learning will be further supported by the fact that you will be working within an experienced multidisciplinary team among experts in a number of different fields involved in wider research and service development agendas.&lt;/p&gt;\n&lt;p&gt;We recognise the importance of supporting our staff to achieve an effective work-life balance and maintain positive wellbeing. We would therefore consider flexible working including part time and we work with team members to offer flexibility in their roles and working wherever this is possible. Our services describe themselves as mutually supportive and we understand the challenges that can be associated with mental health care delivery.&lt;/p&gt;\n&lt;p&gt;If you live outside of Manchester why should you come to work with us? Greater Manchester is recognised as a rapidly growing city, it is versatile and it offers people the opportunity to experience a wide range of activities, cultures, and excellent educational and academic opportunities, theatrical and culinary experiences. It can adapt to be whatever you would want and has something for people of all ages, 24/7, 365 days a year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Declan Meehan&lt;/p&gt;\n&lt;p&gt;Email address declan.meehan@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rawnsley Building / Moorside Trafford, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Mental Health Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257018", "validThrough": "2020-11-19T23:59:59+0000"}