{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-23T14:21:29+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Senior Administrator within DynamicHealth - the Musculoskeletal Physiotherapy and Specialist Services provider for Cambridgeshire and Peterborough. This is a permanent full-time position of 37.5 hours a week Monday to Friday. The position is based at Brookfields Campus in Cambridge.&lt;/p&gt;\n&lt;p&gt;DynamicHealth forms part of Cambridgeshire Community Services NHS Trust, &lt;em&gt;we are proud to&lt;/em&gt;&lt;em&gt;provide high quality innovative services that enable people to receive care closer to home and live healthier lives.&lt;/em&gt;DynamicHealth provides specialised community service across Cambridgeshire and Peterborough, for people aged 16 years and over living with or experiencing problems from muscles, nerves and joints. The team are passionate about delivering a highly effective, evidence based and sustainable service for our NHS users.&lt;/p&gt;\n&lt;p&gt;DynamicHealth operates across 6 sites with 3 Administrative locality hubs. Giving a flexible, innovative and forward thinking administration cohort that underpins the effective delivery of Musculoskeletal Physiotherapy and Specialist Services provided by Cambridgeshire Community Services NHS Trust.&lt;/p&gt;\n&lt;p&gt;You will need to be able to work effectively, in what can at times be a pressurised environment supporting a team to achieve deadlines. You will have good knowledge of administration and possess strong organisational skills. You will support your team and work collaboratively with other locality cohorts across the unit, reporting to the Admin Lead, to accomplish and delivereffectiveservices for patients throughout Cambridgeshire and Peterborough.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate is someone who is proactive about collaborating with their colleagues across the Trust to problem solve and overcome issues as they arise. They will be able to work using your own initiative and work on active improvement of patient pathways and wait times within the unit. They would have a good working knowledge of Microsoft applications, Word, Excel, databases with desirable knowledge on SystmOne and the Electronic referral System (e-RS)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our employee benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Excellent pension, maternity and sick pay schemes&lt;/p&gt;\n&lt;p&gt;Family friendly working patterns&lt;/p&gt;\n&lt;p&gt;Free parking&lt;/p&gt;\n&lt;p&gt;Retail &amp; leisure discounts&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ellie McNally, Admin Lead, Eleanor.Mcnally@nhs.net&lt;/p&gt;\n&lt;p&gt;Interviews will beRemote (Digital) via Microsoft Teams 24/11 - 25/11 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge, Mill Road", "postalCode": "PE27 4LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3229", "longitude": "-.067126"}}, "title": "Senior Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240906", "validThrough": "2020-11-08T23:59:59+0000"}