{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "35000", "unitText": "YEAR", "value": "up to £35,000 per annum"}}, "datePosted": "2020-10-21T12:28:32+0100", "description": "&lt;p&gt;Our Oncology Day Unit team in our Guildford Hospital currently has an opportunity for a Chemotherapy Staff Nurse. We are looking for a dynamic, individual who is productive, patient-focused and committed to treating our patients with the best possible care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Continue your journey with us whilst we’ll support you to be your best.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Guildford Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Guildford Hospital opened in 1999, our hospital provides high-quality healthcare for the people of Guildford and its surrounding areas. The hospital is easily accessible from the A3 or M25 and we are located about 1.5 miles from Guildford town centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We work with leading Consultants to offer a range of services and treatments for preventing, diagnosing and treating a wide array of medical conditions and offer a wide range of complex surgery and services. Our care is matron led and we are proud to have received a &quot;good&quot; rating from the health care regulator, the Care Quality Commission (CQC).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our facilities include 49 en-suite patient bedrooms, 4 operating theatres, acute dependency and oncology units. We’ve been awarded the Macmillan Quality Environment Mark for cancer care. Our site is shared with an NHS Trust hospital, giving us access to their facilities. The working atmosphere is highly professional and stimulating, yet friendly and collaborative like that of a large family unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About the Role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will support the Oncology patients through their cancer journey. Our Macmillan adopted unit accommodates around 25 patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The unit treats a variety of cancers including Breast, Cervical, Ovarian, Pancreatic, GI cancers and Prostate. You will work within a team of skilled chemotherapy nurses as well as part of a Multi-disciplinary team ensuring that our patients are treated with the best possible care. You will also assist with outpatient clinics, offering you an exciting opportunity to develop your skills and knowledge within Cancer Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You should have proven oncology experience including the administration of Chemotherapy. A Cancer qualification is desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are plenty of opportunities for staff to develop their knowledge and skills and you will be offered support for your on-going professional development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You’ll be part of a close-knit team headed by our matron, who provides the foundation and lead for our patient centred care. And, with our consultant-led service, you’ll be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These are maintained to a high standard – we take great pride in our low infection rates and high CQC scores at Nuffield Health.&lt;br /&gt;&lt;br /&gt;As a nurse registered with the appropriate governing body, you’ll have the qualifications and experience relevant to your registration, including NMC. You’ll also have post-registration experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Like us, you believe in putting people first. So you’ll appreciate having the time to care – to fully understand each patient’s needs and provide individual attention that can mean so much when they’re at their most vulnerable. In short, you’ll be able to deliver the type of care that comes naturally to a talented nurse.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll be an excellent communicator and team worker – flexible and motivated. As part of the hospital team, you’ll interact with practitioners from other departments because you understand the importance of continuity in patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Up to £35,000 per annum (dependent on experience)&lt;br /&gt;Location - Guildford Hospital&lt;/p&gt;\n&lt;p&gt;Full-time, 37.5 hours per week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "GU2 7RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2417", "longitude": "-.612479"}}, "title": "Chemotherapy Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236353", "validThrough": "2020-11-17T23:59:59+0000"}