{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £37,890 per annum"}}, "datePosted": "2020-11-04T14:46:43+0000", "description": "&lt;p&gt;&lt;strong&gt;MENTAL HEALTH SERVICES FOR OLDER PEOPLE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 1: 1wte band 5/6 Tees Community&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 2: 1wte band 5/6 Tees Community&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 3: 1wte band 5/6 Scarborough Community&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 4: 0.5wte band 5/6 Scarborough in patients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to expand our qualified physiotherapy workforce in our older people’s services in both Teesside and North Yorkshire.&lt;/p&gt;\n&lt;p&gt;You will be an autonomous qualified physiotherapist providing assessment, treatment planning and provision for older people who have complex physical and psychological needs in the post of your choosing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;3wte Community Posts&lt;/strong&gt;-. You will be a member of one or two multidisciplinary community teams and will work closely with other professions. You will also work closely with physiotherapy colleagues in our wards in the same locality to provide a seamless transition to or from the wards for the users of our service. You will also provide cover to the wards as the service demands.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0.5wte Inpatient Post &lt;/strong&gt;– this post is to support the wards across Scarborough delegating work to a physiotherapy assistant and working collaboratively with other professions on the wards.&lt;/p&gt;\n&lt;p&gt;For all posts you must have a recognised BSC or MSc in Physiotherapy and be HCPC registered.&lt;/p&gt;\n&lt;p&gt;Grading will be dependent upon experience. Your career development is actively supported through our talent management scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suitable experience for band 5 – &lt;/strong&gt;Not suitable for a new grad, must have some experience working as a physiotherapist post qualification. Ideal for someone who wants to develop their clinical skills in a mental health setting. Experience working with service users with mental health conditions or with older people will be an advantage. On entering a post as a band 5 we can help you develop your skills to band 6 level and once achieved can facilitate a regrade to band 6.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suitable experience for band 6&lt;/strong&gt; - Significant experience working as a physiotherapist post qualification including some experience working with service users with mental health, learning disabilities or complex needs is required. Experience of working with older people would be an advantage.&lt;/p&gt;\n&lt;p&gt;Successful candidates will benefit from being part of a group of 60 Physiotherapy staff working in TEWV, 30 of whom work in mental health services for older people. You will also have the support and guidance from Clinical Leads, Clinical Specialists and the Professional Head of Physiotherapy.&lt;/p&gt;\n&lt;p&gt;Additional attractive features of these posts include flexible working, a robust clinical supervision scheme, an excellent training &amp; development programme, and supportive professional leadership from the Professional Head of Physiotherapy. We are also committed to supporting external training events, CPD, research and audit interests under our appraisal scheme.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christiana Liddle, Professional Head of Physiotherapy&lt;/p&gt;\n&lt;p&gt;christiana.liddle@nhs.net&lt;/p&gt;\n&lt;p&gt;07827936463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Teesside and Scarborough", "postalCode": "TS4 3AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.554", "longitude": "-1.21524"}}, "title": "Specialist Physiotherapist or Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256296", "validThrough": "2020-11-12T23:59:59+0000"}