{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata for part time staff"}}, "datePosted": "2020-11-04T11:31:09+0000", "description": "&lt;p&gt;An opportunity has arisen for an occupational therapist or a physiotherapist with proven specialist clinical skills to work within the Spinal Injuries Centre. The post will be based within the large multi-disciplinary spinal injuries team based at the regional Princess Royal Spinal Injuries Centre at the Northern General Hospital in Sheffield.&lt;/p&gt;\n&lt;p&gt;The Princess Royal Spinal Injuries Centre is a modern 58 bedded, supra regional unit for patients who have sustained spinal cord damage as a result of trauma or pathology. Patients are accepted from a wide catchment area that covers much of the east of England.&lt;/p&gt;\n&lt;p&gt;The Therapy department offers a service to acute, rehabilitation and readmission patients. The Centre has 6 beds dedicated to ventilator dependent patients.&lt;/p&gt;\n&lt;p&gt;There is a well-established multi-disciplinary team where all members work collaboratively in the assessment and management of the patient.&lt;/p&gt;\n&lt;p&gt;The post offers the opportunity to further develop the Integrated Ward project that has already commenced on the Spinal Injuries Centre. The successful candidate will participate in service development under the supervision of the Clinical Specialist Occupational Therapist or Physiotherapist and other members of the multi-disciplinary team. The post holder will work as an integrated ward therapist initially on Osborn 1 with a view to scoping the potential for the project to be expanded on to Osborn 2.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The postholder must be able to demonstrate:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive experience as a qualified therapist.&lt;/li&gt;\n&lt;li&gt;Experience working with spinal cord injury patients&lt;/li&gt;\n&lt;li&gt;The knowledge and skills to manage a complex spinal injury caseload working in a ward environment as well as in department.&lt;/li&gt;\n&lt;li&gt;The ability to work flexibly and adapt to change in demands of service&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal, communication and team working skills with all members of the MDT&lt;/li&gt;\n&lt;li&gt;Application of PROUD values.&lt;/li&gt;\n&lt;li&gt;Experience of emergency on call if a physiotherapist.&lt;/li&gt;\n&lt;li&gt;Evidence of continuous personal &amp; professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Able to act on own initiative, organise and prioritise work and manage multiple tasks&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Therapy Services provides a number of services over 7 days (including bank holidays). The successful candidate will be expected to work shifts on the Spinal Injuries Centre as part of their regular shift pattern.&lt;/p&gt;\n&lt;p&gt;This vacancy is advertised on a fixed term contract basis for a period of 12 month due to the post being recruited with limited term funding. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts taking into consideration the requirement for the post to be maintained as a part of the project’s implementation and the timescales associated with this.&lt;/p&gt;\n&lt;p&gt;For further information please contact Claire Trask , Lead Therapist, Spinal Injuries on 0114 2715674&lt;/p&gt;\n&lt;p&gt;For further details &lt;/p&gt;\n&lt;p&gt;Claire Trask,  Lead Therapist&lt;/p&gt;\n&lt;p&gt;Telephone number 0114 2715674&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Specialist Physiotherapist/ Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255612", "validThrough": "2020-11-18T23:59:59+0000"}