{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-27T11:16:11+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT POST IN RESPIRATORY MEDICINE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the Respiratory department at the Norfolk and Norwich University Hospital with a consultant post available. This position is a replacement post and will complement the existing team of seven full time NHS consultants, six part time NHS consultants and one nurse consultant. Our department provides expertise in Sleep medicine and ventilation, bronchiectasis, cystic fibrosisInterstitial Lung disease, lung cancer/pleural medicine, tuberculosis, emphysema and difficult asthma. There are weekly multi-disciplinary meetings in lung cancer and ILD.&lt;/p&gt;\n&lt;p&gt;The Norfolk and Norwich University Hospitals NHS Foundation Trust provides a full range of acute clinical services through the Norfolk and Norwich University Hospital (1,000 beds) and Cromer and District Hospital, including more specialist services such as on-site oncology (providing chemotherapy, radiotherapy and stereotactic radiotherapy), thoracic surgery (with four full-time thoracic surgeons providing a full range of services including Video Assisted Thoracic Surgery), interventional radiology (including CT guided biopsies and bronchial artery embolisation) and specialist palliative care.&lt;/p&gt;\n&lt;p&gt;We treat more than one million patients; people from Norfolk, neighbouring counties and further afield. Our patients are referred to us by around 100 local GP practices but we are also a tertiary referral centre from other acute hospitals and primary care trusts around the country. Norwich is a beautiful and historic city set within the picturesque Norfolk countryside. It has good links to London and is located close to the stunning North Norfolk coast. Norwich also hosts a year-round calendar of events and festivals.&lt;/p&gt;\n&lt;p&gt;As a University teaching hospital we have established our research and development strategy in partnership with the University of East Anglia. Currently we are conducting three multi-centred NIHR funded studies, in Interstitial Lung Disease, asthma and bronchiectasis. We also work closely with our partners in the Norwich Research Park and Norwich Radiology Academy to take forward our ambitious targets for research and development. The UEA School of Medicine was founded in 2002 and is now consistently ranked in the top 20 medical schools in the UK. Applicants would have the opportunity to contribute to medical student teaching.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Dr Ajay Kamath, Service Director on 01603 289642. To learn more about the Trust, please visit our website. We welcome all applications irrespective of age, disability, gender, sexual orientation, race or religion. Part time or job share applications will also be considered.&lt;/p&gt;\n&lt;p&gt;Please refer to the ‘Job Description’ link to the right of the page for the full specification of responsibilities and requirements for this post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Advisory Appointment Committee will meet on 7th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk &amp; Norwich  University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Consultant in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244180", "validThrough": "2020-11-19T23:59:59+0000"}