{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-04T16:48:13+0000", "description": "&lt;p&gt;This is an exciting opportunity to join and new service set up to support people living with serious mental illness to access physical health checks and be supported to engage with services and support to improve their health and wellbeing.&lt;/p&gt;\n&lt;p&gt;You will work alongside GP Practice teams and Cambridgeshire and Peterborough Foundation Trust (CPFT) and a wider multi-disciplinary team. The team will be part of a wider programme of innovation and investment aimed at ensuring people living in Peterborough have access to the mental health support they need, when they need it.&lt;/p&gt;\n&lt;p&gt;Greater Peterborough Network (GPN) is an NHS organisation owned and run by the 29 GP Surgeries in Peterborough. It is working in partnership with CPFT and other health and care partners to introduce this new and innovative service. Training, development and support is available for successful candidates.&lt;/p&gt;\n&lt;p&gt;If you are a HCA with a passion for supporting people living with mental illness and are ready for the next step in your career please apply to this role.&lt;/p&gt;\n&lt;p&gt;For an informal chat about the role please email a.blease@nhs.net &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PETERBOROUGH", "postalCode": "PE2 8AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5651", "longitude": "-.241865"}}, "title": "Specialist Health Care Assistant (Mental Health)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256727", "validThrough": "2020-11-18T23:59:59+0000"}