{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29585", "minValue": "29585", "unitText": "YEAR", "value": "£17.60 per hour"}}, "datePosted": "2020-10-14T10:08:57+0100", "description": "&lt;h2&gt;Want to make money on the side, on top of your normal job? Want to make your own hours? Want to give the Private sector a go?&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;In 2019, we understand that some people don’t just want 1 job or 1 source of income. We understand that some people want the flexibility to work the hours they want. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Our Bank/Casual roles offer all of this, along with weekly pay and a full induction when you start.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With four locations based on the Norfolk/Suffolk border we offer medium and low secure environments which are linked with community based step-down services including continuing care and rehabilitation.&lt;/p&gt;\n&lt;p&gt;The strength ofPriory Grouplies in the quality of the comprehensive assessment, treatment and care we provide. The emphasis is on a holistic and individualised approach delivered by a multidisciplinary team which includes psychiatry, psychology, nursing (mental health and learning disability), occupational therapy, specialist teaching, speech and language therapy, social work and a practice nurse for physical healthcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Palgrave", "postalCode": "IP22 1BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.357", "longitude": "1.08167"}}, "title": "Bank Registered Nurse/RMN/RNLD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225619", "validThrough": "2020-11-13T23:59:59+0000"}