{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 £45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T10:00:50+0000", "description": "&lt;p&gt;An opportunity has arisen to join Health Innovation Manchester on a 6-month fixed term or secondment basis as a Programme Development Lead- Band 8a.&lt;/p&gt;\n&lt;p&gt;The Programme Development Lead role is responsible for designing and implementing large-scale improvement programmes across Greater Manchester. The post holder will have proven knowledge of quality improvement, innovation and implementation methods, having demonstrated a track record in delivering this.&lt;/p&gt;\n&lt;p&gt;This role would specifically sit within the Develop and Deploy team and offers a great opportunity for someone to gain experience, knowledge and skills of working at a more senior level within HInM. As an organisation we support innovation into healthcare settings from research undertaken in our 4 main universities and GMEC area, and our work is fast paced, innovative and increasingly focused on potential digital solutions for healthcare system needs. This Programme Development Lead role is central to managing and delivering these core programme aims.&lt;/p&gt;\n&lt;p&gt;You will have experience at developing innovative and new ideas, solutions and strategies for improving patient care, safety and clinical outcomes. You will have a track record of engaging with multi-professional teams ideally across organisational boundaries and knowledge of working in both primary, acute care and private sectors.&lt;/p&gt;\n&lt;p&gt;This post would be of interest to either internal candidates and can be offered as a secondment opportunity or external candidates who wish to develop more insight into the work that Health Innovation Manchester (HInM) undertake within the Greater Manchester and Eastern Cheshire (GMEC) area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCara AfzalJob titleSenior Programme Development LeadEmail addresscara.afzal@healthinnovationmanchester.comAdditional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this exciting opportunity further, please contact&lt;/p&gt;\n&lt;p&gt;Cara Afzal&lt;/p&gt;\n&lt;p&gt;cara.afzal@healthinnovationmanchester.com&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Health Innovation Manchester, Manchester", "postalCode": "M13 9NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22935"}}, "title": "Programme Development Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257141", "validThrough": "2020-11-10T23:59:59+0000"}