{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "Band 4 £21,892 to £24,157 per annum, pro rata"}}, "datePosted": "2020-11-02T17:00:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 4 Associate Practitioner &lt;/strong&gt;&lt;strong&gt;– Chronic Pain Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18.75 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting permanent opportunity has arisen to join Central Cheshire Integrated Care Partnership (CCICP) as a Band 4 Associate Practitioner within the Community Pain Management Service. We require an enthusiastic, self-motivated individual with experience of working with patients in the community.&lt;/p&gt;\n&lt;p&gt;The philosophy of the Community Pain Management Service is to provide the best options of care, ensuring patients are seen by the most appropriate healthcare professional, at the appropriate time and in the appropriate place, whilst optimising the best health outcome for the patient. This will be managed through effective collaborative clinical triage and delivery of the management of chronic pain through a comprehensive bio-psychosocial model. The service promotes long-term self-management and less dependency on wider health care services such as A&amp;E, GPs, secondary care, ambulance services and mainstream physiotherapy.&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team is formed of a Clinical Lead, Advanced Practitioners in Chronic Pain, Consultant, Advanced Clinical Specialists, Cognitive Behavioural Therapist and Psychological Wellbeing Practitioners.&lt;/p&gt;\n&lt;p&gt;This post is open to Band 4 Associate Practitioner or a Band 3 OTA&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for managing a caseload of chronic pain patients including co-leading pain management education sessions, leading relaxation classes and attending MDT meetings.&lt;/p&gt;\n&lt;p&gt;CCICP fully supports staff development through internal and external training and supervision to maintain and enhance clinician’s skills within areas of clinical interest.&lt;/p&gt;\n&lt;p&gt;For further information on the role please contact donna.lord@mcht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South &amp; Vale Royal", "postalCode": "CW5 5NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0682", "longitude": "-2.51857"}}, "title": "Band 4 Associate Practitioner, Community Pain Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252953", "validThrough": "2020-11-18T23:59:59+0000"}