{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "See job advert for details"}}, "datePosted": "2020-10-27T11:16:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Screening and Immunisation Co-ordinator&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Public Health England South West Region&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; South West&lt;/p&gt;\n&lt;p&gt;Candidates should indicate their preferred locality in their application.&lt;/p&gt;\n&lt;p&gt;Base to be agreed with the successful candidate - will be at one of the NHS England and Improvement – South West - sites are in Taunton, Saltash, Bristol and Chippenham&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Civil Service SEO £36,329 - £42,481 per annum (pro rata) // NHS AfC Band 7 £38,890 - £44,503 per annum (pro rata)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; Fixed term – 12 months&lt;/p&gt;\n&lt;p&gt;1 x 12 month Fixed Term post at 30 hours per week&lt;/p&gt;\n&lt;p&gt;1 x 12 month Fixed Term post at 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;3 x 12 month Fixed Term posts at 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Candidates should indicate their preferred job type in their application.&lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role of the Screening and Immunisation Co-ordinator is to support the commissioning and public health oversight of consistently resilient, high quality national screening and immunisation programmes within the geography of the South West. You will provide direct support to the Screening and Immunisation Manager across the full range of commissioning activities, as specified in the national Section 7a Agreement for a defined set of screening and immunisation programmes that will be agreed with the successful candidate. The range of activities you will be responsible for include the public health aspects of commissioning that are required to ensure that screening and immunisation programmes are meeting the needs of all eligible people, provide the highest levels of quality, safety and efficiency, and strive for excellence and ensure equity of access and uptake.&lt;/p&gt;\n&lt;p&gt;Individuals in these roles may come from a number of clinical or non-clinical backgrounds such as nursing as demonstrated by NMC registration, or other disciplines related to Public Health.&lt;/p&gt;\n&lt;p&gt;Please note that there are two potential sets of criteria in order to fulfil this role, which are outlined within the attached job descriptions. Should you be successful in applying for this post, you will be offered the terms and conditions that correspond to the person specification and criteria that you meet. Clinical roles are part of the PHE Clinical Ring Fence and as such are offered under NHS Agenda for Change Terms and Conditions. Non-clinical roles are offered under PHE (Civil Service) Terms and Conditions.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic outcome focused person to join us on a fixed term basis (secondment basis would be considered), with an ability to develop and implement programmes of work. Using sound personal communication and public health skills this person will be confident and comfortable working both independently and as part of a team.&lt;/p&gt;\n&lt;p&gt;Interviews will be held via skype or MS teams at the end of November 2020.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Ring fence&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy falls within the clinical ring fence pool of post within Public Health England. Therefore suitable qualified clinical applicants will be employed on NHS terms and conditions and will be able to join the NHS pension.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Elizabeth Luckett on 07825 421093&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton, Saltash, Bristol or Chippenham", "postalCode": "TA1 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0141", "longitude": "-3.0681"}}, "title": "Screening and Immunisation Coordinator (5 posts)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244198", "validThrough": "2020-11-10T23:59:59+0000"}