{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pro rata"}}, "datePosted": "2020-11-06T09:26:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Make positive change for yourself, as well as others. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Take your nursing career in a different direction with NHS Blood and Transplant and enjoy a whole new sense of reward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our work has always been vitally important to the nation’s health. Now, as we play our part in the investigation into how effective convalescent plasma is for treating coronavirus patients, it’s never been more crucial. That’s why we need to grow our teams of caring experts, to help us keep providing our quality service at a time of increased need.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We don’t work in hospitals, but we do save lives. With Donor Centres and Mobile Units across the UK we collect over 7,000 donations every day, to provide vital blood and blood products. Ours is a fast-moving, friendly environment, where our teams come together from different backgrounds and communities to help save and improve the lives of thousands of people every year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As one of our Sister/Charge Nurses, you’ll be caring for people who want to be here – donors doing their bit to help others. Our clinics are nurse-led, so you’ll enjoy plenty of autonomy as you motivate and support a team of Donor Carers in a positive, proactive environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It’s a great opportunity to grow your management career. Whether your skills are currently more clinical or leadership-focused, we’ll support you to grow them both. You’ll use clinical judgement to make decisions about donor suitability and ensure that patients receive safe blood and blood products. And you’ll use your management skills to ensure our donors feel safe and cared for, and want to return time and time again.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The shift pattern for this role is 8 days per fortnight working 75 hours over these days, mainly involves working late shifts and not many early shifts. There are no night shifts, but you will be expected to work some occasional weekends and bank holidays in order to lead at different blood collection sessions across the Kent and East Sussexregion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll bring &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You don’t need specialist knowledge to apply for this Band 6 role. We value what you bring. As long as you’re an experienced NMC Registered Nurse who can work independently, lead with compassion and resilience and enable change in a fast-moving environment, we encourage you to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll also need to hold a valid driving licence, allowing you to drive in the UK, and have access to a car.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’ll give you all the training and support you need, along with continuing professional development and career progression opportunities. You’ll also have access to a great range of benefits, including generous annual leave, an NHS pension scheme, flexible working and childcare vouchers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Talk to us &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To learn more about us, our welcoming team and nurturing environment, we recommend that you have an informal discussion about the role. To arrange this please contact Mark Rowland on Mark.Rowland@nhsbt.nhs.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central and South London area", "postalCode": "W1W 8NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5167", "longitude": "-.14173"}}, "title": "Area Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259006", "validThrough": "2020-11-22T23:59:59+0000"}