{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-26T12:30:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Are You Looking for a New &amp; Exciting Challenge in Hospital Pharmacy?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like a more patient focused role?&lt;/p&gt;\n&lt;p&gt;Would you like to learn new skills and play a central part in an exciting, innovative venture?&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a new, multi-disciplinary, ward based team?&lt;/p&gt;\n&lt;p&gt;If so, this could be the job for you.  We are looking to recruit an enthusiastic and experienced Medicines Management Technician to join our friendly team.  This team includes ten other Medicines Administration Technicians, who are fully established in their roles. You will be a proven team player, enjoy variety, thrive on managing your own workload and be seeking to further develop your career.  This role will provide opportunities to enhance your clinical skills and knowledge.  We are looking for someone with an accredited checking qualification, computer skills, able to drive and with access to a car.&lt;/p&gt;\n&lt;p&gt;The successful candidate’s will be provided with comprehensive training to enable them to succeed in, and to develop, the role, including skills relating to medicines administration and physical health monitoring. You will be supported to maintain your checking technician qualification. &lt;/p&gt;\n&lt;p&gt;You will be an integral part of our service provision, working with the in-patient team to promote the safe and effective use of medicines. The Trust provides a range of inpatient services for adult mental health, forensic services, Child and Adolescent Mental Health (CAMHS), Older Peoples’ Mental Health, Learning Disabilities and community hospitals.&lt;/p&gt;\n&lt;p&gt;There is ONE new post on Kingsley ward based on ONE acute inpatient ward for males and females at Melbury Lodge site in Winchester city.  You will be working as an integral member of the multidisciplinary team, providing pharmaceutical care to patients with a range of mental health conditions.&lt;/p&gt;\n&lt;p&gt;The role will focus on the administration of oral, inhaled and topical medicines following the successful completion of the medicines administration competencies.  The role also includes undertaking medicines reconciliations, patient counselling, physical health monitoring, ordering medicines, teaching and audit work. This role is central to optimising the safe and effective use of medicines. You will be required to understand the patient journey of care from admission to discharge and strategies for optimising patients’ concordance with medicines.  You will need to have excellent communication skills and be confident in interacting with a diverse range of people and staff groups in a variety of settings. &lt;/p&gt;\n&lt;p&gt;We are a friendly, supportive and enthusiastic team of pharmacists and pharmacy technicians who are passionate about our service and dedicated to ensuring medicines safety is at the heart of patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role requires the post holder to work Monday – Friday. Specific start and end times are negotiable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is no expectation for weekend, on-call or extended hours working and there are no dispensary commitments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Induction &amp; Training &amp; Supervision&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All staff have access to regular clinical supervision as well as, regular group reflective practice and a number of training opportunities to ensure continuing professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For successful candidates we offer a number of excellent benefits including:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Annual Leave Entitlement – very generous holiday&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;On appointment = 27 days per year +bank holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;After 5 years’ service = 29 days per year + bank holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;After 10 years’ service = 33 days per year +bank holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Other Benefits Include…&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A contributory pension scheme&lt;/li&gt;\n&lt;li&gt;An Employee Assistance Program provided by Workplace Options offering independent advice on a wide range of issues for both you and your family such as; career development, finances, legal issues, family life, health, grief and loss etc.&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme&lt;/li&gt;\n&lt;li&gt;Big Brand NHS Discounts and Offers – check them out!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information contact:&lt;/p&gt;\n&lt;p&gt;Rajan Sharma&lt;/p&gt;\n&lt;p&gt;Lead Medicines Administration Technician -  &lt;strong&gt;Mob:&lt;/strong&gt; 07747 532 781&lt;/p&gt;\n&lt;p&gt;Email: &lt;span style=&quot;text-decoration: underline;&quot;&gt;Rajan.sharma@southernhealth.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter: facebook.com/SouthernHealthNHS@Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melbury Lodge, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Medicines Administration Pharmacy Teachnician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242431", "validThrough": "2020-11-09T23:59:59+0000"}