{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41000", "minValue": "32000", "unitText": "YEAR", "value": "32000 - 41000"}}, "datePosted": "2020-10-22T10:24:16+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS 111&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Nurse or Paramedic who is passionate about making a difference to patients? Are you looking for a role with less physical demands and flexible hours? Have you ever considered moving into a telephone triage role?&lt;br /&gt; &lt;br /&gt; Practice Plus Group are looking for 111 Clinical Advisors to join our busy 111 Call Centre in Southall on a permanent basis.&lt;br /&gt; &lt;br /&gt; NHS 111 is a 24/7 service, operating 365 days a year so that patients can get help and advice any time of year. It is primarily a non-emergency service and provides advice to the most appropriate urgent care service that patients require.&lt;br /&gt; &lt;br /&gt; Working with NHS 111 is a demanding but highly rewarding career where you’ll realise you’re making a difference to patients who use the service every day. If you’re ambitious by nature then we’ve got ample opportunity for career progression.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a 111 Clinical Advisor, you’ll be seen as an integral member of the team, supporting the Health Advisors within the contact centre.&lt;br /&gt; &lt;br /&gt; Calls will be directed to you when patients require clinical advice. By using a combination of your clinical expertise and our NHS Pathways software, you’ll ensure the patient receives the most suitable treatment tailored to their needs. Treatment can range from self-care and advice to referring patients to other services such as OOH appointments or other members of our multi-disciplinary team.&lt;br /&gt; &lt;br /&gt; Full and paid training will be offered so that you can use the NHS Pathways system.&lt;br /&gt; &lt;br /&gt; While we are a non-urgent service, some calls can be emotional, distressing or life-threatening, and there will be times when 999 services (such as an ambulance) may need to be dispatched.&lt;br /&gt; &lt;br /&gt; As the call centre in Southall is open 24 hours, we have numerous shift patterns available, ranging from 16 – 38.5 hours per week. These patterns are on a 2-8 week rota and include daytime, evenings, nights and weekend working so we should be able to offer you something that fits in with your lifestyle.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates &amp; Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•During training - £17.49 per hour&lt;br /&gt; •After training (circa 12 weeks) - £38,100 - £43,300 per annum (dependent on shifts worked and pro-rata)&lt;br /&gt; &lt;br /&gt; In addition to the above pay rates, we also offer:&lt;br /&gt; •Further pay enhancements for some of our busier shifts *T&amp;Cs apply&lt;br /&gt; •33 days annual leave (pro-rata, including bank holidays)&lt;br /&gt; •Company Pension Scheme&lt;br /&gt; •2x Life Assurance&lt;br /&gt; •Contribution towards Eye test and Glasses&lt;br /&gt; •Cycle to work scheme – offering discounts rates and payment plans of bicycles and equipment&lt;br /&gt; •Practice Plus Group perks –offering you discounts and cash back with large retailers&lt;br /&gt; •Annual employee recognition award ceremony&lt;br /&gt; •Career development opportunities&lt;br /&gt; •Access to our bespoke e-learning system&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Training &amp; Support&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order to use the NHS 111 Pathways system and work as a Clinical Advisor, you’ll need to undertake our extensive training programme which includes completing and passing assessments.&lt;br /&gt; &lt;br /&gt; We have two options for the initial NHS Pathways training, followed by a further 8 weeks of support from our Supervisors and Clinical Advisors prior to being signed-off to work on your own.&lt;/p&gt;\n&lt;p&gt;The options are:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; •Full Time – Monday – Friday, 9am – 5pm (lasting for 5 weeks)&lt;/p&gt;\n&lt;p&gt;•Start Date: 02/11/20&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; •Part Time – Tues – Thurs, 6pm – 9.30pm and Sat &amp; Sun, 9am – 5pm (lasting for 9 weeks)&lt;/p&gt;\n&lt;p&gt;•Start Date: 31/10/20&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; These courses are run on a monthly basis and it’s essential that you can attend every day of the training. If you are unable to join us in July, we will have later training courses to offer.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We provide you with a workbook prior to starting the training which needs to be reviewed and completed. Although this can be a little daunting, it will allow you to get a head start in understanding what you’ll learn in your training.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we&#39;ll need from you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Be a registered RGN or RCN (with NMC registration), Paramedic (with HCPC registration).&lt;br /&gt; •Previous experience working as a clinician post-qualification&lt;br /&gt; •Have excellent communication skills – including listening and telecommunication&lt;br /&gt; •Have good IT and keyboard skills&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to receipt of satisfactory references and a DBS check.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is committed to creating a diverse environment and we are proud to be an equal opportunity employer.&lt;br /&gt; &lt;br /&gt; Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southall", "postalCode": "UB2 5NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.497", "longitude": "-.400271"}}, "title": "111 Clinical Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237897", "validThrough": "2020-11-12T23:59:59+0000"}