{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365- £37,890"}}, "datePosted": "2020-09-30T11:46:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Research Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An exciting opportunity has arisen for an enthusiastic experienced nurse to join Midlands Partnership NHS Foundation Trust. The post holder will support the day to day running of a range of National Institute of Health Research (NIHR) portfolio clinical research studies, principally in COVID-19 clinical research, rheumatology, mental health, dementia and other specialties. We are looking for a nurse with proven experience in any of these clinical areas. They will support the implementation of research protocols and the recruitment of patients into portfolio studies, and any resultant data collection and follow-up requirements.&lt;br /&gt;&lt;br /&gt;The post involves the recruitment, education and monitoring of trial patients and the collection and documentation of accurate data, including collection and management of tissue or samples. It will involve working collaboratively with the clinical trials team and the wider multi-disciplinary team in the management of a caseload of clinical trial patients. The successful candidate will need to meet the challenge of working autonomously and within a team, and be self-motivated. &lt;br /&gt;&lt;br /&gt;The post will be based in Haywood Hospital, Stoke on Trent, but working across the entire Trust site as required. In particular, the COVID-19 research will require regular travel to our research site at Cheadle Hospital, North Staffordshire. As study visits may take place across site and in participants’ homes, the successful candidate will need a full driving license and access to a car.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Haywood Hospital", "postalCode": "ST6 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0571", "longitude": "-2.19003"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206240", "validThrough": "2020-11-13T23:59:59+0000"}