{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "T&amp;Cs"}}, "datePosted": "2020-11-04T15:27:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Bedfordshire Hospitals NHS Foundation TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BEDFORD HOSPITAL &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Physician Gastroenterology with Interest in Hepatology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a Consultant Physician with an interest in Hepatology to join our current team of 6 consultants. We are a friendly, dynamic, innovative and future focussed department. You will join our team at an exciting time at Bedford Hospital within the newly merged Bedfordshire Hospitals NHS Foundation Trust. Innovation in the delivery of high quality medical care is a key requirement of this role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will actively support a new colleague that will complement and enhance our existing team with a particular focus on further development of liver services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a full-time, replacement substantive post. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post holder&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Will lead and develop the Hepatology team at Bedford Hospital&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Will participate in the inpatient Gastroenterologist rota&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Will provide diagnostic and therapeutic endoscopy lists, in particular varices surveillance lists&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participate in the liver MDT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently provide a range of out-patient clinics including Hepatitis C/ Liver Clinics, supported by the Hepatitis Specialist Nurse. There is close working with the community blood borne virus team and a well-established fibroscan service. Dietetic support is available with dedicated gastro dietitians both in OP and in ward areas. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are opportunities to develop new models of working and closer links with Addenbrooke’s hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In-patient provision of gastroenterology and hepatology services occurs predominantly on one ward. Inpatients are triaged via the acute assessment unit to the appropriate speciality and care is needs based rather than age based. There is a commitment to provide specialty advice to AAU and also across the hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Endoscopy at Bedford Hospital provides an excellent, modern, patient centred experience. JAG described the unit as providing an outstanding, outward facing endoscopy service for the community. The endoscopy unit has held JAG accreditation since 2009.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A 24 hour GI bleed service has been in place since 2011. Non-emergency endoscopy is provided 7 days per week. Currently there are 6 endoscopists on the emergency rota and this will become 1 in 7 with this appointment. This post would also support routine weekend endoscopy provision on a 1 in 7 basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are 5 colorectal surgeons and 1 upper GI surgeon at Bedford Hospital who along with other general surgeons cover emergency surgery and routine intra-abdominal surgery. All oesophagogastric and HPB cancer surgery takes place at Addenbrooke’s hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Upper gastrointestinal, hepatobiliary and hepatic cancers are managed through a weekly local MDT and three networked MDTs. Upper GI and HPB MDT are video conferenced weekly. Endoscopic ultrasound and oncology surgical services are provided by Addenbrooke’s Hospital. A Cancer Specialist Nurse supports these MDT’s and an acute oncology nurse the inpatient caseload. The majority of non-surgical palliative cancer treatment is delivered on site. There is a weekly Colorectal MDT. There is a weekly GI X ray meeting for surgical and medical teams.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To arrange a visit please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr J Harvey, Clinical Director for Gastroenterology and Endoscopy BHFT on 01234 355122 ext 2300 or email: &lt;/span&gt;&lt;span&gt;Jacquelyn.Harvey@bedfordhospital.nhs.uk&lt;/span&gt;&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Y Al-Naeeb, Consultant Gastroenterologist on 01234 355122 ext 2873 or email: &lt;/span&gt;&lt;span&gt;Yasseen.Alnaeeb@bedfordhospital.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mr David Cox, General Manager for Gastroenterology and Endoscopy BHFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tel: 01582 491166 Int Ext: 8748 Mob: 07739 230294 or email &lt;/span&gt;&lt;span&gt;David.cox@ldh.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ref Number: 416-CONS039&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date: 22.11.20&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Consultant Physician Gastroenterology with Interest in Hepatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256428", "validThrough": "2020-11-22T23:59:59+0000"}