{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "72840", "minValue": "39060", "unitText": "YEAR", "value": "39,060 - 72,840 Depending on experience"}}, "datePosted": "2020-10-28T13:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;The Hillingdon Hospitals Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty Doctor&lt;/strong&gt; &lt;strong&gt;- Geriatric Medicine&lt;/strong&gt; &lt;strong&gt;West London NHS Trust thriving Intermediate Care and Community Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic Specialty Doctor in Geriatric Medicine to be a part of the West London NHS Trust thriving Intermediate Care and Community Team employed by the Hillingdon Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a multidisciplinary team delivering community and intermediate care service in the Ealing area. The role will include working with a Consultant led multidisciplinary team to provide clinical care in bedded units as well as patients in their own residence. The team consists of consultant geriatricians, advanced nurse practitioners, physiotherapists, occupational therapists and care workers in addition to auxiliary staff. On a rotating basis, the post holder will be expected to participate in the daily virtual ward rounds, home visits, daily ward rounds of bedded wards, liaising with specialist teams, primary care clinicians and other agencies.&lt;/p&gt;\n&lt;p&gt;The Intermediate Care Team sits within the wider partnership of Ealing Community Partners. The local providers for the partnership includes West London NHS Trust as the lead provider together with Central &amp; North West London NHS Foundation Trust and The Hillingdon Hospitals NHS Foundation Trust. The partnership also consists of various other organisations of local interest.&lt;/p&gt;\n&lt;p&gt;Areas of Intermediate Care:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ealing Rapid Response service – a consultant led multidisciplinary team which aims to manage patients in crisis at home and facilitate admission avoidance.&lt;/li&gt;\n&lt;li&gt;Magnolia Ward – a 20 bedded unit at Clayponds Hospital which is primarily for patients requiring step up from the community&lt;/li&gt;\n&lt;li&gt;Jasmine Ward – 25 bedded unit at Clayponds Hospital for general rehabilitation (Level 3)&lt;/li&gt;\n&lt;li&gt;Rosemary Ward – 25 bedded unit at Clayponds Hospital for general and stroke/neuro rehab (Level 3)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There will be an opportunity for the post holder to participate actively in delivering teaching and in audit and service development. &lt;strong&gt;Previous elderly care experience is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information/ discussion, please contact Dr Ruben Dutta in the first instance. Email siddartha.dutta@nhs.net or phone 020 8354 8901.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;T&lt;/em&gt;&lt;em&gt;o ensure that our workforce is representative of the population we serve, we welcome applications from all sections of the community.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Hillingdon Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120945"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Specialty Doctor for Ealing Community Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246730", "validThrough": "2020-11-11T23:59:59+0000"}