{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T09:15:54+0000", "description": "&lt;p&gt;An exciting opportunity have arisen for nurses, social workers or OT’s to work in the All Age Liaison and Diversion team based in North Yorkshire police custody suites. The Service provides assessment and liaison for people who are either currently in the criminal justice system or at risk of entering the criminal justice system in close collaboration with partner agencies. They work people from the age of 10 upwards.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the co-ordination and assessment of both new and existing service users within police custody suits and magistrate’s courts across North Yorkshire. You will be expected to demonstrate high quality assessment, risk assessment and leadership skills.&lt;/p&gt;\n&lt;p&gt;The post holder will offer advice and support to Criminal Justice colleagues, carry out face to face assessments, follow up after release and facilitate access to appropriate local services.&lt;/p&gt;\n&lt;p&gt;The post requires good IT skills, the ability to work flexibly and autonomously as well as contributing to an MDT approach. A strong understanding and commitment to team working is vital. The post involves a significant amount of lone working.&lt;/p&gt;\n&lt;p&gt;You will be expected to work shifts 8am to 8pm and 8am to 4pm over 7 days and working in the courts on a rotational basis.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required be able to travel independently across North Yorkshire&lt;/p&gt;\n&lt;p&gt;The post will be to commence as soon as possible with a period of induction and training.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be subject to police vetting and enhanced DBS.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ian Forsyth, Team Manager on 07342 083184&lt;/p&gt;\n&lt;p&gt;ian.forsyth@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fulford Police Station, York", "postalCode": "YO10 4BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9465", "longitude": "-1.07241"}}, "title": "Liaison and Diversion Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257025", "validThrough": "2020-11-22T23:59:59+0000"}