{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-12T11:31:06+0100", "description": "&lt;p&gt;The Community Mental Health Assessment and Recovery Team (CMHART) are looking to recruit a suitably qualified Senior Community Mental Health Practitioner in Copeland. We are looking to recruit a suitable candidate for a full time (37.5 hours), Maternity cover for 12 months, Band 6 position. The post is suitable for registered Nurses, Social Workers or Occupational Therapists, who must be registered with the NMC or HCPC. The post will sit within the psychosis treatment pathway or the non-psychosis treatment pathway (depending on service delivery need).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to Care Coordinate a caseload of service users with a range of complex mental health needs with associated risk and you need to demonstrate some experience of being able to plan and execute interventions both with individuals and their carer’s.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You may be expected to act as team duty worker. This role involves supporting the team’s Assessment Practitioner with screening duties; managing unplanned/urgent patient work within the team and responding to escalation of risk/crisis situations with unallocated patients or with the patients of team members who are unavailable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are an RMN, you may be expected to contribute to the weekly depot clinic, administering intra-muscular medication to patients who attend the clinic. You may be expected to contribute to the physical health clinic, monitoring the psychical health of patients prescribed anti-psychotic medication.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to be clinically confident, experienced, solution focussed and competent in working with individuals in a community setting and be able to work effectively in a multi professional context. You should have a collaborative and enthusiastic approach as well as passion and commitment in developing and promoting recovery based approaches for adults with mental health related needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post requires that you are a good communicator, and are able to adopt a flexible, adaptable and proactive approach to your work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Main service is based at Valley View, West Cumberland Hospital, Whitehaven and the service is operational between the hours of 9.00am and 5pm however some out of hours working may be necessary to meet service demands.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will be required to work as part of Copeland CMHART; however you will be required to work flexibly throughout the service if needed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return you will benefit from encouragement to continue to develop your own specialist knowledge and competence. Your development will be guided using clinical supervision with the team psychologist or psychotherapist; operational supervision with the Team Leader, team/peer support; training opportunities and using the Trust’s appraisal process.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kirbi Williams Clinical Team Lead kirbi.williams@CNTW.nhs.uk 01946 853350&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitehaven", "postalCode": "CA28 8JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5302", "longitude": "-3.56318"}}, "title": "Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222105", "validThrough": "2020-11-09T23:59:59+0000"}