{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T16:00:49+0000", "description": "&lt;p&gt;Somerset NHS Foundation Trust have an exciting opportunity within our oncology department. We are inviting applications for:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; A Consultant Clinical Oncologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast and Urological Malignancies. Acute Oncology.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post will be based in The Beacon Centre, Musgrove Park Hospital, Taunton.&lt;/p&gt;\n&lt;p&gt;To be eligible for this post you should have your CCT or be within 6 months of obtaining it.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will join our current team of eight Clinical Oncologists, four Medical Oncologists, one Associate Specialist and two Specialty Doctors in Oncology as well as seven Haematologists.&lt;/p&gt;\n&lt;p&gt;We have a diverse work force which includes an Acute Oncology Service, an Immunotherapy service with 2 Immunotherapy CNSs and 3 Chemotherapy CNSs. We currently have 4 Consultant Radiographers in post.&lt;/p&gt;\n&lt;p&gt;Facilities for the treatment of cancer in Taunton have undergone a major expansion, culminating in the opening of the Beacon Centre at Musgrove Park Hospital in May 2009. This brought oncology facilities, including radiotherapy and chemotherapy, to the population of Somerset (c535,000 catchment).&lt;/p&gt;\n&lt;p&gt;We are undergoing exciting developments including a linear accelerator replacement programme which started in March 2019, continuing the provision of cutting-edge service delivery with flattening filter free Elekta Versa HD machines.&lt;/p&gt;\n&lt;p&gt;Steps are in place to increase the Beacon Day Unit capacity and nursing numbers in order to continue to deliver prompt day case treatment. &quot;Bumble&quot;, our mobile chemotherapy unit is operational across the county delivering treatment closer to home for our patients.&lt;/p&gt;\n&lt;p&gt;Trust wide there is a strong Department of Clinical Research employing 50 members of staff, 35 of which are nursing staff. The team based within the Beacon Centre comprises 8 research nurses, 2 admin staff and support from another 2 from the wider team. This team currently has 58 studies currently open or in set up.&lt;/p&gt;\n&lt;p&gt;Plans are in place for the construction of a Maggie&#39;s Centre alongside the Beacon Centre which will provide the highest quality of cancer support for patients in and around Somerset.&lt;/p&gt;\n&lt;p&gt;The Beacon Centre has received a number of accolades since opening in 2009 for the high quality care delivered - CHKS ISO 9001 accreditation, Macmillan Quality Environment Mark (MQEM), Investors in People Gold Award and Customer Service Excellence Award, July 2018. In the 2016/2017 National Cancer Patient Experience Survey, the Beacon Centre was ranked 4th overall nationally, which is an excellent reflection of the patient centred care delivered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust &lt;br /&gt;&lt;/strong&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond. &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to joining a Cancer Centre rated as an area of Outstanding Practice by CQC (2016), as well as the highest GMC scored Trust in the South West for training, you will get to experience life in the West Country. Taunton has easy access to some of the UK’s most desirable locations from the beaches of North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath, and Exeter. Taunton offers you all the perks while still being less than two hours from London. Nestled in the heart of Somerset as the County town, Taunton has a diverse range of shopping and restaurants, and boasts sporting arenas such as the County Cricket Ground, regularly hosting international fixtures, as well as featuring National hotspots for cycling, surfing, and climbing such as Cheddar Gorge. Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, there is plenty to keep you occupied alongside the abundance of music festivals and local traditions.&lt;/p&gt;\n&lt;p&gt;Somerset offers some of the best schools in the country. Ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington and Blundell’s, to award winning state schools such as the Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary schools ranking in the top 5% nationally such as The Castle school.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;FURTHER INFORMATION AND VISITING ARRANGEMENTS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss any of these posts, feel free to contact us and we’ll be happy to answer any questions you may have, or arrange an informal visit to introduce you to your future team and department;&lt;/p&gt;\n&lt;p&gt;Dr Joanne Botten Clinical Service Lead 01823 342417&lt;/p&gt;\n&lt;p&gt;Mr David Miliken Trust Cancer Lead 01823 342562&lt;/p&gt;\n&lt;p&gt;Dr Saiqa Spensley Clinical Director 01823 342418&lt;/p&gt;\n&lt;p&gt;Visits may be arranged through Hermione Roberts, PA to Abbie Furnival (Directorate Manager) 01823 342190.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Consultant Clinical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250854", "validThrough": "2020-11-26T23:59:59+0000"}