{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-05T15:46:19+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;In a world where IT is key, we want you to join us...&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Supporting the I.T. Technical Services teams and wider IM&amp;T and Clinical programme teams you will be responsible for providing support to the Technical staff, Managers and Programme work streams, the main duties will involve supporting the Technical Service managers in managing the Trust reconfiguration moves projects, experience within reconfiguration work would be ideal. To drive the Technical Services Project function, management and development of the team, with particular emphasis on ensuring that all projects are scoped planned and managed to accommodate impacts to data communications network.&lt;/p&gt;\n&lt;p&gt;With a proven track record working in a project management role, or wanting a change from a technical role, you will drive the Technical Services Project function, management and development of the team, with particular emphasis on ensuring that all projects are scoped planned and managed to accommodate impacts to data/telecommunications network (Cisco, Siemens, telephony systems)&lt;/p&gt;\n&lt;p&gt;It is essential that you are flexible and can display high levels of initiative, together with the ability to work under pressure as an individual, or as part of a team, and undertake your duties with minimum supervision. As a good communicator you will be able to deal with suppliers, technical experts and executives across the healthcare environment.&lt;/p&gt;\n&lt;p&gt;If you&#39;re applying on a secondment basis, you will need the approval of your line manager before applying.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDerek JonesJob titleTechnical Services Manager - Service DeliveryEmail addressderek.jones@lthtr.nhs.ukTelephone number01772522456Additional contact information&lt;/p&gt;\n&lt;p&gt;email enquiries to Derek.Jones@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "IT Technical Project Manager - EPMA CDH Network Refresh and Capital S", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258416", "validThrough": "2020-11-11T23:59:59+0000"}