{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-02T16:45:58+0000", "description": "&lt;p&gt;Liverpool Wheelchair Service is looking for enthusiastic and motivated Band 6 therapist to join our growing team. The successful candidate(s) will provide assessment and provision of wheelchairs, postural support and pressure management to clients of all ages with a wide variety of medical conditions across the diverse city of Liverpool.&lt;/p&gt;\n&lt;p&gt;We are an innovative service with a shared goal of providing a high quality service to our patients to achieve their mobility goals and enable their independence. We are looking for forward thinking therapists who will add to the team’s dynamic approach and be committed to continuing professional development of themselves and others.&lt;/p&gt;\n&lt;p&gt;The skills required for this post include practical problem solving skills, with sound clinical reasoning skills. An effective team player with excellent organisational and communication skills required to work in a busy service.&lt;/p&gt;\n&lt;p&gt;You will undertake comprehensive assessments of service users with a variety of physical, cognitive and/or learning disabilities. Many service users present with complex multi-pathologies which require a high level of understanding of the impact of these conditions/disabilities. Identification of social and environmental issues that may impact on the final equipment recommendations is also key to providing a holistic posture/ pressure management solution with a wheelchair.&lt;/p&gt;\n&lt;p&gt;We are predominantly a clinic based service but also see patients in other environments such as schools, hospitals, and their own home. We assess and prescribe manual wheelchairs, active user wheelchairs and electric powered chairs, along with posture/ pressure management and specialist seating systems.&lt;/p&gt;\n&lt;p&gt;Liverpool Wheelchair Service will provide relevant training necessary to enable you to have the skills and knowledge to provide the high quality service we aim for. And there will be plenty of opportunities to gain experience in this specialist area of practice, through shadowing and learning from others.&lt;/p&gt;\n&lt;p&gt;To be considered for this post you must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc degree or equivalent in Occupational Therapy / Physiotherapy and current HCPC registration.&lt;/li&gt;\n&lt;li&gt;Previous experience of working as an Occupational Therapist/ Physiotherapist at AFC Band 6 level.&lt;/li&gt;\n&lt;li&gt;Minimum 18 months experience as a qualified therapist, working with patients with long-term and deteriorating medical conditions, including palliative care, neurology, paediatrics.&lt;/li&gt;\n&lt;li&gt;An understanding of the impact of these conditions on patient’s lives.&lt;/li&gt;\n&lt;li&gt;Experience of undertaking holistic assessments.&lt;/li&gt;\n&lt;li&gt;Previous experience of working in a Wheelchair service is preferred but not essential.&lt;/li&gt;\n&lt;li&gt;Member of a special interest group preferred but not essential.&lt;/li&gt;\n&lt;li&gt;Current UK driving licence is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Shortlisting will take place on: 1st December 2020&lt;/p&gt;\n&lt;p&gt;Interviews will take place on: 10th December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca DensonJob titleClinical Lead Liverpool Wheelchair ServiceEmail addressrebecca.denson@merseycare.nhs.ukTelephone number0151 296 7770Additional contact information&lt;/p&gt;\n&lt;p&gt;Clinical Lead Jennifer Stokes; Jennifer.stokes@merseycare.nhs.uk or 0151 296 7770&lt;/p&gt;\n&lt;p&gt;Clinical Lead Rebecca Denson; Rebecca.denson@merseycare.nhs.uk or 0151 296 7770&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lifehouse, Liverpool", "postalCode": "L3 4BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.385", "longitude": "-2.97971"}}, "title": "Wheelchair Therapist - OT / Physio", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252918", "validThrough": "2020-11-30T23:59:59+0000"}