{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 pa pro rata with allowance"}}, "datePosted": "2020-11-02T15:01:47+0000", "description": "&lt;p&gt;&lt;strong&gt;We are seeking an experienced Registered Children’s Nurse who wants to work part time to compliment the team on our Paediatric Assessment Unit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PAU has recently relocated from our Paediatric ward to our Emergency Department to sit alongside Paediatric ED, and we have exciting plans to refurbish an area next to Paediatric ED so there will be a co-located area housing both PAU and Paediatric ED.&lt;/p&gt;\n&lt;p&gt;PAU is an emergency pathway assessment area for children and young people and is currently open 0800-2200hrs seven days a week. Children requiring admission are transferred to Willow ward which is a 22 bedded general paediatric ward caring for children aged 0-16 years with a variety of medical, surgical and orthopaedic conditions. Willow ward also has two high dependency cubicles&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen for a Band 6 Registered Children’s Nurse to join our team in order to provide senior nursing leadership to PAU. As a member of the Band 6 Nurse Co-ordinator team, you will be in charge of PAU on a shift by shift basis, liaising closely with both Paediatric ED and the co-ordinator on Willow ward. You will be supported in this role by a Senior Sister, Practice Development Nurse and Matron, and work closely with the Consultant of the week, to ensure your nursing leadership provides a high standard of nursing care and patient experience.&lt;/p&gt;\n&lt;p&gt;In order to undertake this role we are looking for substantial post registered experience. The successful applicant will need to have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A commitment to caring for sick children and leading the nursing team in advancing paediatric practice&lt;/li&gt;\n&lt;li&gt;First level registration with the NMC as a Children’s Nurse&lt;/li&gt;\n&lt;li&gt;At least five years post registered experience in an acute paediatric clinical setting&lt;/li&gt;\n&lt;li&gt;A specific area of interest in acute assessment of children in an ambulatory or emergency department setting.&lt;/li&gt;\n&lt;li&gt;A commitment to continuing to develop your own professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to know more about this vacancy, please contact Lynn Brooks (Head of Nursing, Children’s Services) on 01322 428100 bleep 548 or Clare Jones (Senior Sister) via clare.jones26@nhs.net. We would like you to attend for an informal visit if you are interested in this post.&lt;/p&gt;\n&lt;p&gt;The Trust has a strong commitment to equality and diversity. We aim to employ a representative workforce that reflects the communities we serve. &#39;Positive action&#39; initiatives can be used whenever an under-represented group is identified. As our workforce is currently under-represented in bands 6, 7 and 8, we encourage applications from people with black or minority ethnic backgrounds.&lt;/p&gt;\n&lt;p&gt;Working days and or shift patterns will be agreed by the line manager to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;Dartford and Gravesham NHS Trust is a smoke free organisation. To improve public health, smoking is not permitted anywhere on the hospital site. For advice and support on stop smoking please call 0300 123 1220.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLynn BrooksTelephone number01322 428100 bleep 548&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Sister/Charge Nurse Band 6, Willow Ward / PAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252544", "validThrough": "2020-11-16T23:59:59+0000"}