{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26324", "minValue": "26324", "unitText": "YEAR", "value": "£15.66 per hour"}}, "datePosted": "2020-10-20T14:31:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Permanent As and When (Bank) Contracts Available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Covering Anglesey &amp; Gwynedd, Flintshire &amp; Wrexham, Conwy &amp; Denbighshire areas.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: To Be Confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently seeking enthusiastic Registered Nurses who are highly motivated, passionate about the quality of patient care, and committed to high professional standards!&lt;/p&gt;\n&lt;p&gt;The Marie Curie Nursing Service is a community based palliative care service whose aim is to support patients and their carers within the community. This will usually be the patient&#39;s own homes. This role involves linking and collaborating with other health and social care providers in primary, secondary, independent and voluntary care, to promote communication &amp; seamless care and support for patients and their carers.&lt;/p&gt;\n&lt;p&gt;You will work within a multi-disciplinary team to ensure the patient&#39;s preferred place of care is achieved. You will be forward thinking with excellent communication skills and want to positively contribute to the team and hospice. The role is working as part of the hospice nursing team across all settings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;As a Registered Nurse you must have level 1 registration and will be able to demonstrate an understanding of palliative care and the needs of patients with complex symptoms.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Ideally you will have post registration experience. You will be highly motivated and energised, be an excellent communicator and work well both individually and within a team. You will be provided with education and training.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;This role requires flexibility. Due to the nature of the roles access to a car and a willingness to travel are essential.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What&#39;s in it for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued access to NHS Pension Scheme (subject to eligibility)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Marie Curie Group Personal Pension Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Loan schemes for bikes; computers and satellite navigation systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continuous development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Industry leading training programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;Every day of your life matters - from the first to the last. When you work for Marie Curie, you understand that better than ever. We&#39;re a passionate, committed and diverse team of more than 4,400 staff and 12,000 volunteers, here for people living with any terminal illness, and their families.&lt;/p&gt;\n&lt;p&gt;Marie Curie is committed to its values, which underpin our work. We take stringent steps to ensure that the people who join our organisation through employment or volunteering, are suitable for their roles and are committed to safeguarding all our people from harm. This includes our staff, volunteers and all those who use or come into contact with our services. We are dedicated to creating not just a safe place to work but also a supportive and rewarding one.&lt;/p&gt;\n&lt;p&gt;We are committed to a world where everyone can thrive and fulfil their potential. We are devoted to the social justice imperatives and organisational benefits of full diversity, inclusion and equity in the workplace, and are a Stonewall champion. We actively encourage and welcome applications from candidates of diverse cultures, perspectives and lived experiences.&lt;/p&gt;\n&lt;p&gt;This role will be subject to receiving a satisfactory Enhanced criminal record check.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this vacancy early. Agencies need not apply.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Marie Curie", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129502"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flintshire &amp; Wrexham, Conwy &amp; Denbighshire, Anglesey &amp; Gwynedd", "postalCode": "LL65"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3199", "longitude": "-4.53076"}}, "title": "Registered Nurse - Rapid Response - North Wales", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234825", "validThrough": "2020-11-17T23:59:59+0000"}