{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-14T12:57:55+0100", "description": "&lt;p&gt;&lt;strong&gt;Tameside Hospital – Bank Critical Care Registered Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt;Bank Critical Care Registered Nurse – Band 5&lt;br /&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt;Tameside Hospital&lt;br /&gt;&lt;strong&gt;Pay Rates (hourly):&lt;/strong&gt;&lt;br /&gt;Days: £22.76&lt;br /&gt;Saturdays/Nights: £29.59&lt;br /&gt;Sundays/Bank Hols: £36.42&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Critical Care Registered Nurse looking to join a new team?&lt;br /&gt;If you answered yes, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;This exciting opportunity will allow the successful applicant to develop their clinical skills whilst working within critical care.&lt;/p&gt;\n&lt;p&gt;The Critical Care unit at Tameside has recently been re-furbished. Now complete, it is home to a combined unit of both Level 2 and Level 3 patients, having capacity for a total of 9 patients, the beds being flexible, depending on demand.&lt;/p&gt;\n&lt;p&gt;As a Trust we take pride in our patient safety program to deliver safe and effective care. We firmly believe in our Trusts values and behaviours and strive to provide a quality experience for our patients and their families. Therefore we are seeking hardworking, innovative and highly motivated nurses to join our team.&lt;/p&gt;\n&lt;p&gt;In this role you would plan, co-ordinate, deliver and evaluate expert care to critically ill patients within the unit, ensuring that excellent standards of care are maintained at all times.&lt;/p&gt;\n&lt;p&gt;We are looking for staff preferably with experience with Post Registration experience within an acute setting.&lt;/p&gt;\n&lt;p&gt;The post will require rotation onto night duty.&lt;/p&gt;\n&lt;p&gt;Tameside and Glossop Integrated Care NHS Trust (T&amp;G ICFT) has been on a fantastic improvement journey. Within just 3 years, they’ve gone from being rated as ‘Inadequate’ by the CQC to being rated as ‘Good’ (with some services rated as ‘Outstanding’), which is a huge achievement, and are on a continuous mission to be rated as ‘Outstanding’ across all areas. This has been, and will be achieved, through the values where ‘everybody matters’&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;T&amp;G ICFT is a fantastic place to work. A small but friendly and ambitious organisation, living by their values which are demonstrated through their behaviours every day. Passionate about excellent patient care, embracing a culture where staff are listened to and patients come first. Every day these values drive the behaviour and actions for every person in the organisation. Their values and behaviours aren&#39;t just words on a fancy poster; they embody everything they stand for as an NHS organisation.&lt;br /&gt;&lt;br /&gt;We’re looking for Band 5 Critical Care Registered Nurses to join the Staff Bank in order to be part of this continuing mission and ambition to become outstanding - and we’d like you to join them on this journey by becoming part of #TeamTameside.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;br /&gt;To apply for this post, you will:&lt;br /&gt;• Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;br /&gt;• Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;br /&gt;• Be proficient in the delivery of care to patients&lt;br /&gt;• Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;br /&gt;• Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;br /&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within theNHS.&lt;br /&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside Hospital", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Bank Critical Care Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226334", "validThrough": "2020-12-31T23:59:59+0000"}