{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-05T14:57:23+0000", "description": "&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pinehill Hospital is a fantastic place to work; our Imaging team are enthusiastic, experienced and motivated in providing exceptional patient care. We are looking for a highly skilled individual that can contribute exceptional standards of care across a multitude of specialities.&lt;/p&gt;\n&lt;p&gt;The Radiology department at has 1 General X Ray room including fluoroscopy and a digital OPG machine. There is also a mammography room and 2 image intensifiers in Theatres. An Ultrasound service is provided by Consultant Radiologists.&lt;/p&gt;\n&lt;p&gt;The Radiology department supports busy Outpatient and Theatre department; In Theatres there are three operating theatres and an Endoscopy unit. MRI and CT services are currently provided by Ramsay diagnostics and are not part of the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a BSc in Radiography or equivalent. A Mammography qualification and experience is desirable but not essential. They will need a good radiographic background with outstanding communication skills and experience with teamwork.They will be encouraged to share best practice with others and we are continually developing our services and improving patient outcomes. The successful candidate will enjoy the benefit of learning new skills through formal teaching and observation. Ramsay Healthcare is committed to developing staff and an up to date CPD folder is mandatory.&lt;/p&gt;\n&lt;p&gt;The weekly hours will be 37.5 hours, worked flexibly over the week. You will be expected to take part in the on call service from home.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ramsay Way&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care is committed to being a leading provider of health care services by delivering high quality outcomes for patients and ensuring long term profitability.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are caring, progressive, enjoy our work and use a positive spirit to succeed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We take pride in our achievements and actively seek new ways of doing better&lt;/li&gt;\n&lt;li&gt;We value integrity, credibility and respect for the individual&lt;/li&gt;\n&lt;li&gt;We build constructive relationships to achieve positive outcomes for all&lt;/li&gt;\n&lt;li&gt;We believe that success comes through recognising and encouraging the value of people and teams&lt;/li&gt;\n&lt;li&gt;We aim to grow our business whiles maintaining sustainable level of profitability, providing a basis for stakeholder loyalty.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary – depending on skills and experience&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Free onsite parking and a subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;* Salary based on base plus some enhancements for working some weekends or nights&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hitchin", "postalCode": "SG4 9QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9503", "longitude": "-.262976"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258205", "validThrough": "2020-11-29T23:59:59+0000"}