{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa plus HCAS"}}, "datePosted": "2020-10-22T15:00:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Hammersmith and Fulham Mental Health Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Care Facilitator: Askew Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you a looking for a new challenge?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced health care assistant who is enthusiastic and caring to join the team on Askew PICU in Hammersmith and Fulham Mental Health Unit.&lt;/p&gt;\n&lt;p&gt;West London NHS Trust supports 62,500 patients and carers every year, serving 700,000 residents in three of the most diverse boroughs in west London plus Broadmoor in Berkshire. The diversity of the communities we serve is matched by the diversity of our staff, of whom 56% come from BME backgrounds.&lt;/p&gt;\n&lt;p&gt;In return you will get to work with a great team, with superb training and development opportunities, and excellent staff benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Car scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Cycle2Work Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent opportunities to work in the Trust’s internal Bank&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;This post attracts a 20% High Cost Area pay supplement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working with this client group can be challenging and requires a Health care assistant who is able to employ reflection and can frame their understanding using an evidence base to enhance their own and the wider team’s knowledge and skills.&lt;/p&gt;\n&lt;p&gt;You will receive monthly supervision to support your development and practice from the RMN, alongside guidance from the unit’s Matron and Service Manager. This is an opportunity for you to broaden your skills in regards to operational policy and enhancing your professional experience.&lt;/p&gt;\n&lt;p&gt;Askew Ward offers a robust package of support for nursing staff. This includes weekly reflective practice facilitated by a Highly Specialised Psychotherapist, regular opportunities for training, and daily ‘Safety Huddles’ with the Ward Manager and Consultant present. The ward has a dedicated occupational therapist, an activities coordinator, a social worker and a motivated, energetic nursing team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to Disclosure and Barring Service (DBS) checks.&lt;/p&gt;\n&lt;p&gt;The Diversity and Equality policy of West London NHS Trust is designed to promote an environment that is inclusive to all individuals regardless of background and is intolerant of practices which may result in the exclusion of any group.&lt;/p&gt;\n&lt;p&gt;The Trust recognises the importance of valuing individuals; acknowledging that, certain groups in society still experience discrimination and disadvantage on the basis of their age, disability, ethnicity, gender, gender re-assignment, maternity/pregnancy status, married/civil partnership status, religion/spirituality or sexuality and/ or practices that breach the Human Rights Act.&lt;/p&gt;\n&lt;p&gt;This post is subject to rotation within the unit.&lt;/p&gt;\n&lt;p&gt;ABOUT THE AREA:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;Hammersmith is served by a good road, rail, and tube transport network and is located outside the extended congestion zone. There are easy routes that bypass the congestion zone for those travelling from the south and south east of London. These transport links make our team base readily accessible from all over Greater London and neighbouring counties.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact the Ward Manager Selina John for an informal chat about the role on 0207 386 1293.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSelina JohnJob titleWard ManagerTelephone number0207 386 1293.Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flu vaccination – what we expect from our staff &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease. The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Askew Ward (LS PICU), Southall", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Healthcare Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239038", "validThrough": "2020-11-13T23:59:59+0000"}