{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata plus HCAS"}}, "datePosted": "2020-10-28T10:16:45+0000", "description": "&lt;p&gt;A vacancy for has arisen in Redbridge Community Health Services for a Band 3 Health Care Support Worker to join the Leg Ulcer and Tissue Viability Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a Health care support worker with experience in wound care and leg ulcer management but training will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work in the Hainault leg ulcer clinic supporting the leg ulcer nurses and team leader.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate flexibility, excellent communication skills, documentation and clinical skills. The post is part time 25.5 hours.&lt;/p&gt;\n&lt;p&gt;For further discussion about this post, please contact Lynne Smith, Leg ulcer and Tissue Viability team leader on 0300 3001732 or 07718270361.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLynne SmithJob titleLeg Ulcer and Tissue Viability team LeaderEmail addresslynne.smith3@nelft.nhs.ukTelephone number07718270361&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hainault Health Centre, Hainault", "postalCode": "IG7 4DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6078", "longitude": ".104443"}}, "title": "Leg Ulcer Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246025", "validThrough": "2020-11-11T23:59:59+0000"}