{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38124", "minValue": "32591", "unitText": "YEAR", "value": "32,591.94 up to 38,124.15 PLUS £5K Welcome Bonus"}}, "datePosted": "2020-10-14T09:46:09+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;Key duties&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitate the admission processes for new admissions.&lt;/li&gt;\n&lt;li&gt;To undertake initial nursing assessments.&lt;/li&gt;\n&lt;li&gt;Participate in the care planning process.&lt;/li&gt;\n&lt;li&gt;Work in a collaborative manner with the wider MDT.&lt;/li&gt;\n&lt;li&gt;Initiate, develop and maintain therapeutic relationships with the young people.&lt;/li&gt;\n&lt;li&gt;Facilitate a minimum of one dedicated 1:1 session with each named young person allocated and fully document appropriately.&lt;/li&gt;\n&lt;li&gt;Initiate, develop and maintain professional relationships with parents. Families, Carers and External Professionals ensuring appropriate.&lt;/li&gt;\n&lt;li&gt;Support and encourage the young people to attend appropriate meetings and/or represent them accordingly.&lt;/li&gt;\n&lt;li&gt;Appropriate and timely completion of required documentation.&lt;/li&gt;\n&lt;li&gt;Formulation of nursing reports as required.&lt;/li&gt;\n&lt;li&gt;Attendance and participation in meetings such as ward reviews, CPA and MHRT hearings.&lt;/li&gt;\n&lt;li&gt;Preparation for attendance at ward review – monitoring charts to be reviewed and observations presented, summary of the young person’s review period to be formulated and presented.&lt;/li&gt;\n&lt;li&gt;Administration of and monitoring the effects of medication.&lt;/li&gt;\n&lt;li&gt;Ensure, where appropriate and possible the full involvement of the young person in the care process.&lt;/li&gt;\n&lt;li&gt;Support and encourage attendance at education and therapeutic sessions/activities.&lt;/li&gt;\n&lt;li&gt;Ensure access to the advocate is available and support meetings with the advocate if required.&lt;/li&gt;\n&lt;li&gt;Safe management of young people’s monies.&lt;/li&gt;\n&lt;li&gt;Work within the guidance of NMC Code of Conduct at all times and have an awareness of guidance and legislation such as CQC standards, MHA, MCA.&lt;/li&gt;\n&lt;li&gt;Support the Charge nurse in the daily management of the ward. Ensuring that daily tasks are delegated appropriately and completed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Qualifications/Experience&lt;/p&gt;\n&lt;p&gt;To be successful as a Staff Nurse you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An RMN or RNLD qualification.&lt;/li&gt;\n&lt;li&gt;Good communication skills.&lt;/li&gt;\n&lt;li&gt;The drive to learn and develop&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice.&lt;/li&gt;\n&lt;li&gt;A flexible, positive, team-orientated approach.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;A contributory pension scheme&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;£5,000 Welcome Bonus paid over 3 years&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We will also provide temporary accommodation for 3 months for the right candidates.&lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk", "postalCode": "NR17 1AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5264", "longitude": ".991513"}}, "title": "Staff Nurses/RMN/RNLD with £5,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225517", "validThrough": "2020-11-13T23:59:59+0000"}