{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18944", "minValue": "17499", "unitText": "YEAR", "value": "£10.41 to £11.27 per hour (Scale E)"}}, "datePosted": "2020-11-04T16:24:33+0000", "description": "&lt;p&gt;Full or part time hours considered&lt;/p&gt;\n&lt;p&gt;Permanent contracts&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity to be part of the semi-independent provisions in Norfolk. Our homes provide accommodation for Looked After Children, or young people Leaving Care that are between the ages 16-18. We will help them develop their independent living skills and wellbeing, enabling them to be ready to progress fully onto independence post-18.&lt;/p&gt;\n&lt;p&gt;If applying for full time hours, you will be split between two of our homes, based in Thetford and Kings Lynn. Alternatively, the role is available as part time (18.5 hours per week), at either Thetford or Kings Lynn. However, you may occasionally be required to cover another home.&lt;/p&gt;\n&lt;p&gt;You must be able to display a passion for working with young people and support each young person in overcoming challenges to help prepare them for adult life. You will have a background in semi-independent accommodation or be experienced in working with young people. You will need to be committed to making a difference in the lives of young people.&lt;/p&gt;\n&lt;p&gt;You will be reliable, flexible, have good personal relationships and communication skills, as well as high professional standards. You will also need to be able to make sound judgments under pressure and respond effectively in a crisis, as there is an element of lone working with up to 4 young people during evenings and weekends.&lt;/p&gt;\n&lt;p&gt;You will be required to complete the NVQ level 3 in Health Social Care Children and Young People, as well as undertaking Norfolk County Council mandatory training.&lt;/p&gt;\n&lt;p&gt;You will work (lone work) a shift pattern and sleeping in is an essential part of the shift. You will be based in a set location but may be required to cover and to travel to other homes throughout the Norfolk area. You are therefore required to have your own form of transportation. You will be required to work weekends, evenings, nights, and some bank holidays.&lt;/p&gt;\n&lt;p&gt;Previous unsuccessful applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding this vacancy, please contact Maria Gronborg, Team Manager, on 07884 699588 or Curtis Hanlon, Business Support Officer, on 07452 928964.&lt;/p&gt;\n&lt;p&gt;Please state in your application which location you are applying for and whether you prefer full or part time hours.&lt;/p&gt;\n&lt;p&gt;Interviews will take place via video technology, where you will have the opportunity to discuss these working arrangements.&lt;/p&gt;\n&lt;p&gt;Redeployment closing date: 11 November 2020&lt;/p&gt;\n&lt;p&gt;All other applicants closing date: 23 November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Norfolk - Thetford or King’s Lynn", "postalCode": "NR1 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6154", "longitude": "1.30769"}}, "title": "Independent Living Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256639", "validThrough": "2020-11-18T23:59:59+0000"}