{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615"}}, "datePosted": "2020-10-02T15:55:26+0100", "description": "&lt;p&gt;Welcome! Telford and Wrekin IAPT is a dynamic, enthusiastic, and innovative team, consisting of Administration staff, PWPs, CBT Practitioners, and Counsellors. We serve the people of Telford which is an exciting, diverse and growing modern town, surrounded by the stunning Shropshire countryside.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for 2 Qualified Psychological Wellbeing Practitioners (PWPs):&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Band: 5 &lt;br /&gt; Permanent &lt;br /&gt; Hours: 1 full-time (37.5 hours) and 1 part-time (30 hours). Please specify on personal statement which you would prefer.&lt;br /&gt; Base: Fuller House, Telford, currently mainly working from home.&lt;/p&gt;\n&lt;p&gt;As a result of year on year high performance and growth, we are looking for talented and ambitious PWPs to help us achieve our goals by providing gold standard treatment to our service users.&lt;/p&gt;\n&lt;p&gt;As a service we pride ourselves in providing and adhering to a range of NICE approved evidence based treatments including the recommended amount of sessions. We are recognised as a high achieving service which is well known for providing a supportive and enjoyable workplace experience, where our staff are highly valued and recognised as our greatest asset. We provide high quality clinical and management supervision to facilitate this, as well as regular clinical skills training, CPD and personal development opportunities. We are also happy to provide flexible working hours and working from home opportunities, with the expectation that post the COVID 19 situation in office working will be a max of 2 days a week.&lt;/p&gt;\n&lt;p&gt;In return we expect that our team are goal driven, and display the highest levels of knowledge, skills and professional standards. This is what some of our current PWPs say about working here:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Telford are so supportive, positive and there is a real sense of &#39;us&#39; and being a team. Even when working remotely during a pandemic I don&#39;t think I could have felt more part of a team. Staff wellbeing matters at Telford and I always feel supported in terms of training opportunities and my personal progression. Overall, I feel very lucky to work for such a lovely team. ”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“The team is the kindest, most supportive and most responsive team to work for. Staff wellbeing is of the highest importance.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“For me the experience of working for Telford IAPT service has been life changing in a positive sense. The emphasis on practitioner wellbeing and support is a real priority and the ethos and culture of the team is one of support, co-operation and teamwork that I have not experienced in other teams within and outside of IAPT. We are treated with trust and respect and have numerous ways to input our ideas and influence our working practices. I feel valued and really love being part of this team and service.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to know more? Then please call 01952 457415 and ask to speak to Sam Torney or Louise Crook.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Telford", "postalCode": "TF3 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6798", "longitude": "-2.45036"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916211375", "validThrough": "2020-11-20T23:59:59+0000"}