{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 Per Annum"}}, "datePosted": "2020-10-27T13:00:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert for Band 6 – September 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role: Placement Development Team Educator for Trainee Nursing Associates&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Band 6&lt;/p&gt;\n&lt;p&gt;Hours: 37.5 per week (I year secondment or fixed term contract)&lt;/p&gt;\n&lt;p&gt;Location: Department of Professional Healthcare Education, University Hospitals Plymouth NHS Trust&lt;/p&gt;\n&lt;p&gt;Due to the ongoing success of the Trainee Nursing Associate (TNA) at University Hospitals Plymouth the Department for Professional Healthcare Education is looking for an experienced registrant to join the Placement Development Team supporting the Trainee Nursing Associate programme. This is an exciting opportunity for someone passionate about education, who is keen to develop this further.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated individual to join a team of dedicated staff committed to leading the way through innovation to support the delivery of the TNA Foundation Degree Programme across the Acute and Community Organisations.       &lt;/p&gt;\n&lt;p&gt;The ideal candidate will co-ordinate and support the development of placement learning for TNAs across Devon’s integrated care system. They will provide assessment and support for the Trainee Nursing Associates, as well as liaising with Higher Education Institutions (HEI) to ensure the programme is seamless and well-coordinated. The role will need to support, prepare and coordinate work-based supervisors, assessors, and other registered practitioners in the development of the Nursing Associate apprentice role.&lt;/p&gt;\n&lt;p&gt;A primary function of this role will be to coordinate and develop placement activity for the TNAs, both in the acute and community settings, working closely with the TNA project team and the Trust Placement Development Team. This will require excellent communication and negotiation skills with a range of employers and organisations across the primary, secondary and voluntary sector. The role will include assessing the TNAs in practice to ensure they meet their HEI programme learning outcomes including the NMC proficiencies as detailed in their PAD and liaising with HEIs for the Foundation Degree. &lt;/p&gt;\n&lt;p&gt;Applications are invited from Registered Nurses with current clinical experience and a knowledge of the TNA programme and experience of work based assessment in a clinical healthcare setting. &lt;/p&gt;\n&lt;p&gt;Your personal development is also a priority, support will be provided for continuous professional development (CPD) to achieve NMC revalidation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information on this post or an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt;Henrietta Ferguson/ Jackie Williams&lt;/p&gt;\n&lt;p&gt;Henrietta Ferguson                             &lt;/p&gt;\n&lt;p&gt;Placement Development Team Manager                                                                            01752 (4)37131  or internal 81154                                                                         &lt;/p&gt;\n&lt;p&gt;E-mail: &lt;em&gt;hferguson@nhs.net&lt;/em&gt; ,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Jackie Williams&lt;/p&gt;\n&lt;p&gt;Head of Professional Development and Clinical Education&lt;/p&gt;\n&lt;p&gt;Tel: 01752 431759 or internal 31759&lt;/p&gt;\n&lt;p&gt;E-mail: j.williams16@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: Sunday 15th November&lt;/p&gt;\n&lt;p&gt;Interview date: Monday 23rd November&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Placement Development Team Educator for Trainee Nursing Associates", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244624", "validThrough": "2020-11-15T23:59:59+0000"}