{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-06T13:30:57+0100", "description": "&lt;p&gt;We currently have a full time (37.5 hours/week) permanent contract for a Band 5 Staff Nurse on Ward 35. &lt;br /&gt;&lt;br /&gt;Ward 35 is a 27 bedded female trauma ward caring for patients of all ages with fractures and acute orthopaedic conditions. The post would suit a newly qualified Staff Nurse or an experienced Staff Nurse wanting to gain further experience in trauma nursing, rehabilitation and complex discharge planning. A full induction package and, preceptorship programme will be offered to the successful candidate. There will also be the opportunity for further study in the area of Trauma Orthopaedics and associated courses such as Student Nurse Mentorship, Tissue Viability and Dementia and leading on to relevant management courses. &lt;br /&gt;&lt;br /&gt;We are looking for someone with good communication skills, who is enthusiastic and motivated to learn. You will be working in a close knit team within a busy ward and we will you require you to be flexible in your hours of working to ensure that we can deliver a quality service. We will offer a full induction into the ward and have a Practice Development Sister who works with the ward to help address any of your current and future development needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSister Michelle KnightonJob titleWard ManagerTelephone number01253 953308&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Ward 35", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214848", "validThrough": "2020-11-18T23:59:59+0000"}