{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-02T18:00:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This is an exciting 12-month Secondment or Fixed-term opportunity for an experienced specialist nurse to join our well-established Occupational Health service. You will provide clinical, professional and managerial leadership for a team of registered Nurses and technicians.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;Oh Occupational Health and Wellbeing is the Occupational Health department for Cambridge University Hospitals (CUH) and other organisations, including Royal Papworth Hospital (RPH) and West Suffolk Hospital (WSH). Supporting a workforce population of around 20,000, Oh aims to improve the health, safety and general wellbeing of all staff, striving to create a healthier working environment for all.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;We offer a range of high quality services including infection screening and immunisation, infectious outbreak contact tracing, fitness for work assessments, advice on sickness absence management, advice on stress management, assessment for long-term disability benefits or ill-health retirement, health surveillance, health promotion, training and education.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;We are looking for a motivated individual to join our Senior Team to provide leadership and professional development to our nursing team to ensure a professional, safe, responsive and effective service to managers and staff using the Occupational Health service.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;This is a CUH post within the Occupational Health and Wellbeing building on the Cambridge Biomedical Campus. You will be responsible for supporting the Occupational Health contract for Royal Papworth Hospital NHS Foundation Trust.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will have a proven track record of prioritising your workload and successful partnership working within a multi-disciplinary team.&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;This post provides opportunities for flexible working (Mon-Fri with no rostered out-of-hours working and no on call requirement) as well as many opportunities for research and Continuing Professional Development (CPD).&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;/p&gt;\n&lt;p&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;Closing date: 19 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 26 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Toni Hislop&lt;br /&gt;Job title: Lead Specialist Nurse&lt;br /&gt;Email address: antonia.hislop@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 07874 633611&lt;br /&gt;&lt;br /&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Ailsa Bowring, Head of Service ailsa.bowring@addenbrookes.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Corporate Division, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Occupational Health Nurse Manager (RPH)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253045", "validThrough": "2020-11-19T23:59:59+0000"}