{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annuam"}}, "datePosted": "2020-11-03T14:16:22+0000", "description": "&lt;p&gt;Sussex Partnership is about the people. The people we work for, the people we work with and the people we want to become. We want to create the right job for you that not only provide a high quality service for our service users and carers but works with your interests.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Research&lt;/strong&gt; – Are you looking to further or start your research? We have Research Assistants embedded within teams and have access to leading edge technology to support you with this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education&lt;/strong&gt; – Are you interested in taking students on placement or getting involved with teaching? We have strong links with Brighton and Sussex Medical School and encourage our Consultants to become supervisors to Foundation, GP, Core or Higher trainees.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Support &lt;/strong&gt;– Are you looking for opportunities to work flexibly or work in teams that understand and support each other? We appreciate how caring our staff are and recognise the importance of caring about you too.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Trust is seeking a consultant psychiatrist to join the Assessment and Treatment service at the St Marys House, Eastbourne and the surrounding areas to cover maternity leave for a fixed term contract&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This post is being advertised as 1.0 whole time equivalent for 12 months to cover a period of Maternity leave, with a possibility of this extending. However, please get in touch if you are interested in the position but want to work different hours.&lt;/p&gt;\n&lt;p&gt;Please also note that this post attracts a Golden Hello payment of up to £5000 as well as a Relocation Package of up to £8000. Information on these can be obtained from our Medical Staffing Team on 0300 304 0393.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly and supportive multidisciplinary ward team that consists of other Consultants, Nurse’s, Occupational Therapists, Psychologists and more. The Trust strives to maximise clinical time for doctors so you will benefit from an assigned 0.8 WTE of direct admin support, as well as an established administrative support service who work for the whole team.&lt;/p&gt;\n&lt;p&gt;You will also work with other community services in East Sussex including High Weald, Lewes and Havens and Hastings ATS, Early Intervention in Psychosis and East Sussex Rehabilitation services. There are separate community services for patients with a suspected or confirmed diagnosis of dementia (Memory assessment and living well with dementia teams in Eastbourne and Hastings, although HWLH currently provide a MAS service from the ATS)&lt;/p&gt;\n&lt;p&gt;You will be part of a Trust wide consultant network where there are opportunities to liaise with colleagues in other ATS posts throughout the Trust and develop peer networks. You will also see consultant peers weekly at the local academic programme, at regular division meetings in the locality and at clinical governance meetings.&lt;/p&gt;\n&lt;p&gt;The Trust operates a Quality Improvement methodology which is encouraged to be used by all staff. There are exciting opportunities to be trained in QI and undertake QI projects. This post is one example of the commitment of the Trust to develop better provision for the Eastbourne and surrounding areas and the families and carers using the service. There are also opportunities to use SPA time for teaching or clinical and other research through Sussex University and Brighton and Sussex Medical School.&lt;/p&gt;\n&lt;p&gt;Sussex Partnership is committed to people participation, meaning that we involve patients and their carers and supporters, in service decision-making and planning. You will be expected to contribute to this shared value and to support the functioning of this service in the delivery of its participation strategy.&lt;/p&gt;\n&lt;p&gt;There is a Clinical Lead for the Service in post who will be available to support the transition into this role, alongside the Service Manager.&lt;/p&gt;\n&lt;p&gt;Not decided yet or want to discuss your individual interests in working at Sussex Partnership then please pick up the phone and talk to us! We want to hear your thoughts and ideas on how our jobs can work for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Hoskin, Deputy Director on 07500 799718&lt;/p&gt;\n&lt;p&gt;Dr Naliyawala, Clinical Director on 07769710941&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Marys House, Eastbourne", "postalCode": "BN21 3UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7729", "longitude": ".28379"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254289", "validThrough": "2020-11-24T23:59:59+0000"}