{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-05T11:46:17+0000", "description": "&lt;p&gt;Are you an experienced qualified paediatric/children’s nurse or are an adult nurse and currently have experience of working with children in your role? If so come and join our welcoming, friendly, dynamic and supportive team.&lt;/p&gt;\n&lt;p&gt;Do you have experience of nursing children in acute and/or community settings? Have you worked with children with complex medical needs or would like to do so?&lt;/p&gt;\n&lt;p&gt;We offer you the opportunity to join our specialist team, providing care and support to children and young people with complex health care needs, some of whom are technology dependant. You will possess excellent clinical and communication skills, good organisational skills and be able to work independently accessing supervision as required. You will be highly motivated and dedicated to evidenced based practice.&lt;/p&gt;\n&lt;p&gt;The service provides support to families over a 24 hour period, 7 days per week. The shifts could be day/night shifts in the family home/respite facility currently in East Lancashire, West Lancashire, Central Lancashire, Chorley and South Ribble. You need to have a flexible approach and may have to work some unsociable hours/night shifts.&lt;/p&gt;\n&lt;p&gt;You will work with a dedicated team of registered nurses, health care support workers and other professionals to support families in meeting children’s health needs at home and in other community settings. Your role will involve assessments and training. Caseload management and staff supervision/mentoring skills will be developed within the role.&lt;/p&gt;\n&lt;p&gt;You will benefit from excellent management and peer support, opportunities to work alongside specialists, a personal and professional development plan and flexible working arrangements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Burgoyne, Liz Peters or Lisa Joinson Senior Nurses on 01282 628362 for more information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Peter&#39;s Centre, Burnley", "postalCode": "BB11 2DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7914", "longitude": "-2.23893"}}, "title": "Staff Nurse (Complex Needs)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257504", "validThrough": "2020-11-19T23:59:59+0000"}