{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-04T09:46:28+0000", "description": "&lt;p&gt;An opportunity has arisen for two experienced finance professionals to join our senior finance team in the East of England Region.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who can operate in a fast paced and exciting environment and who can bring not only previous experience but diversity in thought and diversity in background to an established team.&lt;/p&gt;\n&lt;p&gt;The key elements of this role are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working directly with systems, providers and commissioners within the region, supporting them to deliver their financial duties and required performance&lt;/li&gt;\n&lt;li&gt;Analysing and advising on system and organisational financial performance&lt;/li&gt;\n&lt;li&gt;Providing financial expertise to the regional assurance of operational and strategic plans&lt;/li&gt;\n&lt;li&gt;Supporting the regional finance team to discharge its financial governance responsibilities including reviewing capital business cases and other financing applications&lt;/li&gt;\n&lt;li&gt;Actively contribute to internal finance team development and promote a positive and inclusive culture, paying attention to equality and diversity in the team and across the directorate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be a CCAB qualified accountant, preferably with NHS commissioning and provider finance experience plus relevant experience at a senior management level. You will have excellent interpersonal, communication, presentation and analytical skills and have experience of dealing with difficult situations and the ability to handle conflict in a positive and professional manner.&lt;/p&gt;\n&lt;p&gt;The East of England Region is an inclusive employer and wants to attract applications from diverse backgrounds and in particular from those with disabilities, people of black or minority ethnicity, and individuals identifying as LGBT+.&lt;/p&gt;\n&lt;p&gt;Candidates are advised to ensure that your application reflects how you meet the person specifications and although you may not meet all the criteria, we would still like to hear from you if you are interested in the role and are considering applying.&lt;/p&gt;\n&lt;p&gt;Longlisting will be completed within one week of the advert closing, with interviews taking place within 3 weeks of the closing date.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lorraine Bromley-Martin&lt;/p&gt;\n&lt;p&gt;Job title: Business Manager&lt;/p&gt;\n&lt;p&gt;Email address: lorraine.bromley-martin@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07770 277316&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge subject to Covid 19 restrictions", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Finance Senior Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255242", "validThrough": "2020-11-18T23:59:59+0000"}