{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-21T10:01:11+0100", "description": "&lt;p&gt;GMTS Communications Manager&lt;/p&gt;\n&lt;p&gt;The NHS Graduate Management Training Scheme is an award-winning talent scheme. We are 4th in the Times Top 100 Graduate Employers and have been in the top 10 every year since 2003. As a highly sought-after scheme we have recently expanded and now appoint 500 new graduate trainees per year.&lt;/p&gt;\n&lt;p&gt;As GMTS Communications Manager you will lead all communications activities to support our attraction campaign that currently attracts over 17k applications per intake. You will also work with the GMTS Education and Experience team to support our ongoing communications with all trainees and host organisations.&lt;/p&gt;\n&lt;p&gt;You will be responsible for devising and implementing communications plans and campaign activity for the expanded programme. This includes direct marketing, PR, digital and social media, advertising and the development of editorial and AV content.&lt;/p&gt;\n&lt;p&gt;You will be expected to manage and strategically develop relationships with internal and external stakeholders to deliver communication activities and solutions.&lt;/p&gt;\n&lt;p&gt;You will be part of the GMTS senior management team and support all strategic and operational activities and ensure that GMTS continues to evolve and maintain its position as one of the UKs top Graduate Employers.&lt;/p&gt;\n&lt;p&gt;You should be an expert in your field with an interest in leadership, talent management and inclusion and have excellent relationship skills as you will be expected to build and maintain partnerships with a range of colleagues and organisations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSally ScalesJob titleHead of NHS GMTSEmail addresssally.scales@leadershipacademy.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds or London", "postalCode": "LS1 4BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7935", "longitude": "-1.54353"}}, "title": "GMTS Communications Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235752", "validThrough": "2020-11-15T23:59:59+0000"}