{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-27T10:36:30+0000", "description": "&lt;p&gt;&lt;span&gt;Are you a Mental Health Nurse RMN looking for a change? OR perhaps you’re a General Nurse RGN or Learning Disabilities Nurse looking to work within mental health services?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you&#39;re passionate about Older Persons Mental Health and delivering high quality care then we want to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Pyrland Ward consists of a fully refurbished Dementia Ward (Ward 2) which provides an excellent environment for our patents with a diagnosis of Dementia. Pyrland also consists of a 2nd ward (Ward 1) which specialises in the treatment of older adults with functional mental health illness. Both wards have 14 beds caring for people over the age of 65.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently taking part in the Royal College of Psychiatry Improvement Programme working towards accreditation, being part of this process will create an excellent opportunity to help you enhance your skills. You will be supported in your own professional development with opportunities to undertake a range of CPD and funded University BSc/MSc courses. You will have the opportunity to participate in research and Quality Improvement projects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Part of the role includes leading a team during the shift alongside a fellow RMN, providing evidenced-based care to our clients and working collaboratively with our community team colleagues to ensure that the admission and discharge process is effective. As an RGN or LD Nurse you will be fully supported by an experienced RMN on shift at all times as you gain valuable experience of working in Mental Health Services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll be joining a supportive and friendly team that will make your transition into the ward an enjoyable experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as of the usual NHS Benefits such as 5.4 weeks annual leave PLUS bank holidays, enhanced pay for unsociable hours to top up your income, and flexible working practices to promote a good work-life balance, you can also expect to be fully supported in your role through regular managerial and professional supervision.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Jo Harvey, Ward Manager or Natasha Kingscott, Deputy Ward Manager on 01823 368225 or jo.harvey@somersetft.nhs.uk or natasha.kingscott@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "TA2 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0324", "longitude": "-3.10144"}}, "title": "Staff Nurse RMN, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244042", "validThrough": "2020-11-16T23:59:59+0000"}