{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33638", "minValue": "33638", "unitText": "YEAR", "value": "£33,638"}}, "datePosted": "2020-11-04T09:32:43+0000", "description": "&lt;p&gt;Are you Registered Staff Nurse with 18-months post registration experience and is looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Propel your career to the next level as an experienced Nurse from the NHS or private care, where you&#39;ll join the team at Gregory House, a Learning Disability and Autism service, providing care and support to 24 adults who have a learning disability and/or mental health needs. &lt;br /&gt;&lt;br /&gt; Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. &lt;br /&gt; &lt;br /&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As an experienced qualified RMN or RNLD nurse you will ensure our patients with learning disabilities receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.  &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Things that you will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• A relevant nursing qualification and registration&lt;br /&gt;• 18-months experience as a Registered Nurse&lt;br /&gt;• Strong team-working skills&lt;br /&gt;• A high level of self-motivation and a flexible approach&lt;br /&gt;• A positive attitude and be naturally caring and compassionate&lt;br /&gt;• A commitment to high-quality care and to values and evidence-based practice&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The service operates 24/7. You will work shift patterns including weekends, bank holidays and nights. Standard shifts are 12 hours a day, working 3 days one week, 4 days the next.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Location: Furness Road, Workington, Cumbria, CA14 3PD&lt;br /&gt;&lt;br /&gt;You will be working at Gregory House, a Learning Disability and Autism service, providing care and support to 24 adults who have a learning disability and/or mental health needs. &lt;br /&gt;&lt;br /&gt;You will work alongside the team at Gregory House, helping to provide a specialist provision. The service has an enhanced level of support to allow people with continuing challenging behaviour and high support needs to be cared for in the least restrictive setting possible, but within a service which is robust and structured enough to meet their ongoing needs and risks.&lt;br /&gt; &lt;br /&gt;The service ensures people lead good and meaningful everyday lives, where they have choice and control, accessing mainstream services and facilities, engaging in work and training, in leisure opportunities, hobbies and areas of personal interest. Gregory House encourages people to be as independent as possible with the long-term aim of people moving onto a more independent living setting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• Annual salary of £33,638&lt;br /&gt;• The equivalent of 33 days annual leave - plus your birthday off!&lt;br /&gt;• Free meals and parking&lt;br /&gt;• Wellbeing support and activities&lt;br /&gt;• Career development and training&lt;br /&gt;• Pension contribution&lt;br /&gt;• Life Assurance&lt;br /&gt;• Enhanced Maternity Package&lt;br /&gt;• Flexible working opportunities&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;With flexibility and self-motivation, you will have excellent communication skills and an understanding of the importance of the therapeutic social environment, while enjoying the satisfaction that comes with seeing people in your care improve.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Workington", "postalCode": "CA14 3PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6296", "longitude": "-3.54919"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255200", "validThrough": "2020-11-30T23:59:59+0000"}