{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-21T12:47:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Advert Band 5: Special school nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Make a difference today! Support children and young people with complex health needs to access their education.&lt;/p&gt;\n&lt;p&gt;This term-time only role is an exciting opportunity for a motivated and enthusiastic special school nurse to work within new special school nursing service in east Kent.&lt;/p&gt;\n&lt;p&gt;The special schools nursing team is looking for band 5 nurse to join the team.&lt;/p&gt;\n&lt;p&gt;We work with families and partnership agencies to support school staff and make sure they are appropriately trained and competent for students to access school safely. We want to make sure school staff understand the child&#39;s condition and the potential impact it has on the student and their families.&lt;/p&gt;\n&lt;p&gt;This role will be based within a special school, however will work flexibly within a cluster of schools to make sure that care can be prioritised and delivered effectively as required.&lt;/p&gt;\n&lt;p&gt;This role will support the staff who provide one to one care to some of the students with more complex respiratory health care needs. Training in the appropriate skills will be provided plus there is access to a wide training programme at KCHFT.&lt;/p&gt;\n&lt;p&gt;If you have experience of working with children with complex health needs within a health, educational or social care setting, would like to use and build upon existing knowledge and skills, enjoy training others and working within a flexible and friendly team then this could be the perfect role for you.&lt;/p&gt;\n&lt;p&gt;The applicant must be confident in working and liaising with a diverse range of stakeholders.&lt;/p&gt;\n&lt;p&gt;Tracheostomy and ventilation experience is desirable but not essential, if you are willing to be trained.&lt;/p&gt;\n&lt;p&gt;This role is 22.5 hours per week in the school term-time only.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews are scheduled for Monday 23rd November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please contact Rebecca Lee on 07342071182 for an informal discussion if you would like to know more about the post and special school nursing service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitfield Aspen School, Dover", "postalCode": "CT16 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1583", "longitude": "1.29133"}}, "title": "Special School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236459", "validThrough": "2020-11-12T23:59:59+0000"}