{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "BAND 6"}}, "datePosted": "2020-10-14T16:31:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Practitioner (&lt;/strong&gt;&lt;strong&gt;37.5 hrs per week including nights and twilights)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a forward thinking, highly motivated, innovative, dedicated practitioner to provide care and treatment for those service users who require support from the Crisis Resolution &amp; Home Treatment Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications are also welcomed from Social Workers and Occupational Therapists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate that you reflect Lancashire Care &amp; South Cumbria NHS Foundation Trust (LCSFT) values of Teamwork, Integrity, Compassion, Excellence, Respect and Accountability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have experience of working with service users who present with complex mental health needs. The role will be located within our PENNINE HOME TREATMENT TEAM, based at both Daisy field Mill Blackburn and Pendle House Nelson.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You should be able to demonstrate evidence of care that facilitates a positive culture of patient engagement, a commitment to enhancing the service user and carer experience and of on-going professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must have the ability to positively influence and adapt to a rapidly developing service that is able to meet the needs of mental health services in Lancashire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have experience of implementing effective, evidence based care management / assessment skills and display excellent communication skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be able to work independently without close supervision as well as being committed to a Multi-Disciplinary team Approach (MDT) are essential requirements for the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the pre-employment checks, successful candidates will be required to pay for their own CRB check at a cost of £50. Deductions will be taken from the first 3 months’ salary.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; This post is subject to an enhanced CRB Clearance&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All posts are subject to the nationally agreed Agenda for Change terms and conditions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this post further or want to arrange an informal visit please contact Shirley Foster on 01254 226074 or Clare Tetlow on 01282 657222..&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pennine HTT, Pennine", "postalCode": "PR5 6AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7194", "longitude": "-2.63885"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227104", "validThrough": "2020-11-11T23:59:59+0000"}