{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "p.a. (pro rata)"}}, "datePosted": "2020-11-02T15:15:59+0000", "description": "&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is one of the largest acute Trusts in the UK, employing over 20,000 staff.&lt;/p&gt;\n&lt;p&gt;We are responsible for running a family of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;We are the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology, Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a highly motivated and enthusiastic individual to provide comprehensive administrative support for a variety of services in the Booking and Scheduling team.&lt;br /&gt;&lt;br /&gt;You must have good all round administration skills, excellent interpersonal and communication skills with customer service experience and be computer literate with a working knowledge of MS Office. &lt;br /&gt;&lt;br /&gt;You will have attention to detail and the ability to prioritise incoming work so as to meet deadlines. With a strong emphasis on customer service, you will have good interpersonal skills and the ability to liaise with people at all levels. &lt;br /&gt;&lt;br /&gt;You will play an essential role within the team, helping to maintain standards and improve the service for the benefit of patients and the clinical teams. You will be willing to adapt to change and learn new skills, having a good knowledge of NHS office procedures, together with organisational and communications skills, delivering high quality administrative services and customer care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah DaviesAdditional contact information&lt;/p&gt;\n&lt;p&gt;Sarah Davies&lt;/p&gt;\n&lt;p&gt;Service Manager&lt;/p&gt;\n&lt;p&gt;Tel 0161 291 4656&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Booking and Scheduling Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252565", "validThrough": "2020-11-11T23:59:59+0000"}