{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40400", "minValue": "40400", "unitText": "YEAR", "value": "£40,400 + £10,100 on call duties per annum"}}, "datePosted": "2020-10-23T16:30:50+0100", "description": "&lt;p&gt;Successful applicants will be appointed to the corneal service at Moorfields Eye Hospital Trust. Clinics and allocations of clinical commitments are based across Moorfields Trust sites encompassing City Road, St George’s, Croydon, Ealing, St Anns and Northwick Park Hospital. Fellows are typically allocated to either 1 or 2 main consultants for surgical supervision and times tables allow for a broad range of experience in corneal and external disease. All jobs incorporate sessions at Moorfields - City Road. General ophthalmic on-call commitments are required for the post at Moorfields in Croydon and St Georges. Time table allocations change during the year dependent on the training needs of the fellow and service requirements of the department.&lt;br /&gt;An example timetable is shown below, but this will be subject to change particularly due to the impact and uncertainty of COVID on all services. The timetable may therefore change in the future to meet the demands and recovery of this service.&lt;br /&gt;The successful applicants will be expected to participate in the diagnosis, management and follow-up of patients with complex corneal and external eye diseases under the care of the service, both under supervision and on their own. They will be expected to undertake and to teach phacoemulsification techniques and to contribute to the clinical responsibilities of the cataract service. Proficiency in uncomplicated cataract surgery is mandatory prior to commencing this fellowship. Shortlisted candidates are expected to have audited data on their previous cataract surgery and complication rates. Total cataract surgery numbers should be included in the application. There will be designated research time incorporated into each timetable. The posts are vacant from August 2021.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Martin Watson - Service Director for External Disease&lt;/p&gt;\n&lt;p&gt;Email address: martin.watson1@nhs.net or&lt;/p&gt;\n&lt;p&gt;Romesh Angunawela (Training Director Cornea) r.angunawela@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorfields Eye Hospital, London", "postalCode": "EC1V 2PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5272", "longitude": "-.089862"}}, "title": "Corneal Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241315", "validThrough": "2020-11-06T23:59:59+0000"}