{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-06T14:09:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our Multi-discipline medical team. You will be a highly valued member of our team bringing your expertise and skills in ENT, particularly intermediate mouth, minor and major ear and major nose surgeries.&lt;br /&gt;As a Practice Plus Group Consultant you will have access to great facilities in a well-structured and relaxed environment. We offer high quality day treatment in a wide range of specialties and deliver excellent clinical care.&lt;br /&gt;You will be joining a team committed to delivering the highest standards in patient care, as demonstrated by our success in obtaining a CQC rating of Outstanding in 2019.&lt;/p&gt;\n&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard whether NHS or privately funded.You will be performing ENT surgical procedures on patients referred to the Hospital, working in accordance with hospital protocols and working practices.&lt;br /&gt;You will participate in the outpatient clinic prior to surgery, and in all aspects of the operative care of the patients. It is anticipated that you will spend the equivalent of at least three days of a full time post in the operating theatre.&lt;br /&gt;As UK registered medical professional, with a listing on the Specialist GMC register, we will support you with your ongoing CPD and career development.&lt;/p&gt;\n&lt;h2&gt;Working at Practice Plus Group&lt;/h2&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. Our facilities are modern, employing the latest technology with friendly and professional staff. We have strong control processes to ensure we maintain high standards of hygiene and above all, we’re passionate about giving our patients the best possible care and helping them feel better, faster.&lt;br /&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. We’ll help you be the best you can be.&lt;br /&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;br /&gt;&lt;br /&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9049", "longitude": "-1.39408"}}, "title": "ENT Consultant - Southampton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260056", "validThrough": "2020-11-20T23:59:59+0000"}