{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T16:01:12+0100", "description": "&lt;p&gt;Working in the award winning Innovation, Informatics and Information (I3) service; you will be part of an innovative organisation, constantly striving to push the boundaries of how information and technology can support better healthcare. You will work with raw data from hospital systems to build analytics quantifying the issues the NHS faces, identifying problems we aren’t aware of yet and coming up with pragmatic solutions. With unique access to a wealth of data sources providing endless business intelligence (BI) possibilities, you will make a real difference in how information and analytics evolve and contribute to improved patient care.&lt;br /&gt;&lt;br /&gt;You will be part of of a small team of analysts in the Corporate Information Team, supporting staff from front-line department/ward staff up-to the senior management team. You will act as a translator, gathering requirements from report consumers or National policy changes and developing these into technical solutions that support the mandatory reporting requirements of an acute healthcare provider and provide assurance to the Senior Management Team.&lt;br /&gt;&lt;br /&gt;You will build upon existing, and develop new reporting processes utilising QlikView/QlikSense and SQL Server Reporting Services solutions as well as bespoke BI frameworks developed in-house.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDara HughesJob titleCorporate Information Team LeaderEmail addressdara.hughes@mbhci.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Corporate Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241203", "validThrough": "2020-11-08T23:59:59+0000"}