{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £110,683 per annum (pro rata)"}}, "datePosted": "2020-10-20T13:01:04+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Numbers: &lt;/strong&gt;919-AW-35115053-EXT-EPI&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job titles: &lt;/strong&gt;Consultant Epidemiologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; National Infection Service - Field Service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; Home-based, Flexible&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£75,914 - £110,683 per annum (pro rata)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;37.5 hours / 10 Programmed Activities&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date:&lt;/strong&gt;10 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;prospectively 04 December 2020&lt;/p&gt;\n&lt;p&gt;Public Health England exists to protect and improve the nation’s health and wellbeing and reduce health inequalities. We do this through world-leading science, knowledge and intelligence, advocacy, partnerships and the delivery of specialist public health services. We are an executive agency of the Department of Health and Social Care, and a distinct delivery organisation with operational autonomy. We provide government, local government, the NHS, Parliament, industry and the public with evidence-based professional, scientific and delivery expertise and support.&lt;/p&gt;\n&lt;p&gt;PHE’s Field Service was established to provide a national comprehensive service which is geographically dispersed and integrates epidemiological and microbiological capacity and skills, securing outbreak investigations that are consistently of the highest quality. The Field Service provides an effector arm for PHE’s National Infection Service, supporting the translation of evidence into practice as well as having a role in strengthening surveillance through closer links with the NHS and other partners.&lt;/p&gt;\n&lt;p&gt;To support PHE’s response to the COVID-19 pandemic, the Field Service (FS) is seeking to appoint enthusiastic Consultant Epidemiologists from either a scientific or medical background to contribute to the management and leadership of the FS. The post holders will work as part of one of our FS teams but also contribute to FS work across the service.&lt;/p&gt;\n&lt;p&gt;The Consultant Epidemiologist will be skilled in the application of epidemiological methods to health protection issues, including the design, conduct and analysis of outbreak and incident investigations. They will be able to lead investigation teams and provide expert epidemiological advice in outbreaks and incidents. They will work independently and under pressure against short deadlines when required.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be competent to develop, direct and collaborate on research projects and programmes in health protection. They will also have strong leadership skills, experience of teaching and supervising students and trainees in intervention and surveillance epidemiology.&lt;/p&gt;\n&lt;p&gt;The candidates must be included on the GMC Specialist Register or UK Public Health Register.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be appointed to the Consultant salary scale appropriate to their years of seniority or if from a background other than medicine to NHS Agenda for Change Band 8d.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see the job description for competencies.&lt;/p&gt;\n&lt;p&gt;Interested applicants wishing to learn more about this post can contact Obaghe Edeghere, Consultant Epidemiologist &amp; Interim Deputy Director via email (obaghe.edeghere@phe.gov.uk)&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and thefuture National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homebased/Flexible, National", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Consultant Epidemiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234482", "validThrough": "2020-11-10T23:59:59+0000"}