{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "27000", "unitText": "YEAR", "value": "£27,000 - £32,000 (dependent on experience)"}}, "datePosted": "2020-11-04T10:12:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Registered Band 5 Endoscopy Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Full Time – 40 hours per week&lt;/p&gt;\n&lt;p&gt;Orpington Endoscopy – BR5 3TW&lt;/p&gt;\n&lt;p&gt;Salary: £27,000 to £32,000 p/a (dependent on experience)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Healthshare Limited are an independent healthcare provider. With a network of clinics across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do.&lt;/p&gt;\n&lt;p&gt;Healthcare’s Orpington Clinic is a flagship unit for Lyca Health/Healthshare as their first dedicated stand-alone Endoscopy unit and includes significant investment in new endoscopy and decontamination equipment. The clinic is situated in Orpington Business Park with easy access to transport networks. The Orpington Endoscopy Centre has a small family friendly team of dedicated staff.&lt;/p&gt;\n&lt;p&gt;The post is based in Orpington with easy transport links to all sites. The successful candidate will be a Registered Nurse with experience in an Endoscopy unit.&lt;/p&gt;\n&lt;p&gt;To be considered you must have a flexible, adaptable and an innovative approach to work and be able to proactively deliver results. Our Nurses are expected to work independently, able to deliver a high standard of patient-centred clinical care, possess a friendly and approachable attitude and apply outstanding team-working, communication and organisational skills to their daily practice.&lt;/p&gt;\n&lt;p&gt;At Healthshare we care about your career development. Applicants will be keen learners and will actively participate in clinical teaching and in-service training sessions gaining experience, shadowing and supervision opportunities are provided.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Like the sound of this job? Don&#39;t miss out &lt;/strong&gt;- apply now!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Healthshare Clinical Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130138"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orpington", "postalCode": "BR5 3TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4069", "longitude": ".116773"}}, "title": "Band 5 Nurse - Orpington Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255320", "validThrough": "2020-11-18T23:59:59+0000"}