{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata for part-tim"}}, "datePosted": "2020-10-23T17:01:14+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you: &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A qualified mental health nurse? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interested in being involved in a new exciting service? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Passionate about providing high quality compassionate care to the population of Nottinghamshire? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Able to demonstrate our core values of Compassion, Honesty, Trust, Respect and Teamwork? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;… then this may be the job for you!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sherwood Oaks is a purposed designed 70 bedded Adult Mental Health Inpatient service which is due to open during spring 2021 locate on the outskirts of Mansfield.&lt;/p&gt;\n&lt;p&gt;The hospital will have 4 single sex wards and a hospital-based place of safety (Section 136 suite) all providing single person accommodation with en-suites. Sherwood Oaks Hospital will provide high quality care 24 hours a day 7 days a week to people over the age of 18 from Nottingham City and County who are experience a range of mental health and emotional difficulties.&lt;/p&gt;\n&lt;p&gt;We are seeking proactive, compassionate, caring and recovery focused registered nurses with excellent communication skills to join our existing dynamic multidisciplinary teams to be involved in extensive assessments and formulations to support the planning and delivery of patients care. The multidisciplinary teams all work in a way that is collaborative, evidenced based and responsive to people’s needs.&lt;/p&gt;\n&lt;p&gt;In return, we offer you a supporting professional network of colleagues, opportunities for career development, access to high quality clinical supervision, and an employer who is supportive of your own physical and mental wellbeing.&lt;/p&gt;\n&lt;p&gt;in addition we are also offering a Golden Hello of £2750 along with the first years NMC fees paid for all newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;For a further discussion about the available roles please contact&lt;/p&gt;\n&lt;p&gt;Sian Trainor Acting Service Manger Mid Notts - 0115 9691300 ext 10903&lt;/p&gt;\n&lt;p&gt;Kirsty Aveyard Ward Manager - ext 14140&lt;/p&gt;\n&lt;p&gt;Adam Fletcher Ward Manager - ext 10664&lt;/p&gt;\n&lt;p&gt;Karen Orme Ward Manager - ext 14039&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield", "postalCode": "NG18 4GW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.125", "longitude": "-1.15094"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241401", "validThrough": "2020-11-15T23:59:59+0000"}