{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum"}}, "datePosted": "2020-10-23T13:16:29+0100", "description": "&lt;p&gt;Community Health Newham (part of East London NHS Foundation Trust) is recruiting for a Band 5 Physiotherapist to join our enthusiastic, friendly, and supportive team in Stratford, East London. This position will be based in the musculoskeletal physiotherapy service however the successful post holder may be required on other sites within the Trust as required. The specialist team provides assessment and treatment for patients with a variety of musculoskeletal presentations and conditions.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual, who is an excellent team worker, is self-motivated and able to keep an up-to-date knowledge base in a supportive environment. An ability to work under pressure and to be able to respond and adapt to changes is a must in the current NHS environment. This post may involve working in lone clinics, as well as evenings and Saturday clinics as required. You will possess a Degree or equivalent graduate diploma in physiotherapy along with current Health Care Professions Council Registration and relevant IT skills&lt;/p&gt;\n&lt;p&gt;The post gives the opportunity to operate in the department and develop assessment and treatment skills in musculoskeletal physiotherapy intervention, as well as developing an understanding of the wider health care community. The post holder will be supporting the gym technician within the team, involving supervision and in-service. There will be opportunities to attend relevant external courses for developmental purposes.&lt;/p&gt;\n&lt;p&gt;You will be fully supported by the Clinical Lead, Extended Scope Practitioners, band 6 Physiotherapists and by East London NHS Foundation Trust as a whole, which are committed to support staff in their delivery of a quality integrated service.&lt;/p&gt;\n&lt;p&gt;Stratford is a dynamic, diverse multicultural area with excellent links to the City of London an exciting part of the Olympic legacy.&lt;/p&gt;\n&lt;p&gt;This post requires that you have the ability to travel between locations to carry out your work and to attend training and meetings; daily access to transport is therefore essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E15 4LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5428", "longitude": ".008524"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240683", "validThrough": "2020-11-08T23:59:59+0000"}