{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum plus Outer HCAS"}}, "datePosted": "2020-11-06T09:12:17+0000", "description": "&lt;p&gt;NHS South West LondonClinical Commissioning Group (CCG)is responsible for planning, commissioning and buying healthservices for people living and working in South West London. As a CCG, we’re a membership organisation made up of over 180 GP practices within South West London. We serve just under 1.5 million people across our six diverse boroughs: Croydon, Kingston, Merton, Richmond, Sutton and Wandsworth. We manage local healthcare budgets of over £2.3 billion andcommission a range of health services on behalf of our residents. The services that we’re responsible for include primary care (the services you receive at your GP practice), hospital treatment, rehabilitation services, urgent and emergency care, community health services, mental health and learning disability services.&lt;/p&gt;\n&lt;p&gt;Please note: applications from NHS staff in London at risk of redundancy will be given priority.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will have responsibility for the development and delivery of primary medical services in Kingston and Richmond. This role will work closely with senior leaders across Kingston and Richmond to ensure that primary and community health services are developed to improve joined-up services which offer a more co-ordinated support to help the borough population, looking after their physical and mental health and wellbeing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will work alongside the Heads of Primary Care Transformation, clinical leads, local service providers, stakeholders and system partners in order to support the development of primary care within the wider system transformation context in Kingston and Richmond.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will work with clinical leads, general practice contractors, primary care networks (PCN) and federations to enable the transformation of local services. This will require strong problem-solving skills and the ability to identify solutions to problems that arise.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will also support primary care with business as usual functions, including the developing innovative plans and initiates that ensure the continuation of, and maintain, a stable and robust primary care economy in Kingston and Richmond.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will build relationships with practices in across Kingston and Richmond and be a point of contact to support practices with queries. They will promote innovation and champion the development of new ways of working and service delivery by supporting the Head of Primary Care Transformation and wider Transformation Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be primarily based at the Kingston and Richmond Local Delivery Unit (LDU) at Thames House in Teddington, however working at the CCG site at 120 Broadway in Wimbledon will also be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be an experienced manager with experience of working in complex environments, building strong relationships with clinicians, with experience of leading significant change programmes and delivering tangible and sustained improvements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be familiar with the development of service redesign, improvement plans, integrated working and primary care commissioning. You will be able to engage and build effective and constructive relationships with key stakeholders and patients on every level particularly senior clinical and managerial colleague.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have outstanding communication skills able to communicate complex, sometimes contentious information to groups of leaders, staff and patients. You will have a strong working knowledge of a wide range of primary and community commissioning and contracting processes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working pattern: 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information about this post, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Attracta Asika, Head of Primary Care: attracta.asika@swlondon.nhs.uk, Tel: 07780 489 635.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South West London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128178"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thames House and 120 The Broadway", "postalCode": "SW19 1RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4196", "longitude": "-.200973"}}, "title": "Senior Primary Care Transformation Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258972", "validThrough": "2020-11-20T23:59:59+0000"}