{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Equivalent to 8 B/C"}}, "datePosted": "2020-11-05T16:36:40+0000", "description": "&lt;p&gt;Are you an experienced and clinically driven Advanced Practitioner? &lt;/p&gt;\n&lt;p&gt;Mastercall Healthcare are growing and are excited to offer opportunities to recruit Advanced Practitioners to join our fantastic Urgent Treatment Centre based in Stepping Hill Hospital, Stockport (known as UTC lite) and at Trafford General Hospital (Trafford UTC) &lt;/p&gt;\n&lt;p&gt;Urgent treatment centres (UTCs) are GP-led, open at least 12 hours a day, every day. The UTCs will offer appointments that can be booked through 111 or through a GP referral, and are equipped to diagnose and deal with many of the most common ailments people attend A&amp;E. The UTC will also operate pathways such as those for DVT’s and we are looking at expanding these as we develop the services. Every day will be different. &lt;/p&gt;\n&lt;p&gt;UTCs will also ease the pressure on hospitals, leaving other parts of the system free to treat the most serious cases. The UTC at Stockport is a co-located service and will offer the opportunity for streaming at the front door via a primary care navigator. All UTC services will be considered a Type 3 A&amp;E attendances i.e lower acuity. &lt;/p&gt;\n&lt;p&gt;We are looking for &lt;strong&gt;&lt;em&gt;Advanced Practitioners (APs) &lt;/em&gt;&lt;/strong&gt;for substantive positions to undertake face to face assessments of patients with undifferentiated diagnosis, ensuring appropriate prioritisation, prescribing independently, diagnosis and clinical management without direct supervision but APs will have support of the GPs.   &lt;/p&gt;\n&lt;p&gt;This role will allow you to be part of a supportive, innovative, dynamic team and to be part of the new changes in urgent care services that are driven by local and national &lt;em&gt;aims &lt;/em&gt;&lt;em&gt;to ensure patients get the care they need, fast, and to relieve pressure on A&amp;E departments&lt;/em&gt; (NHS long term plan).These changes will ensure we continue to deliver high quality care to our patients. &lt;/p&gt;\n&lt;p&gt;We welcome applications from practitioners that have an MSC in Advanced Clinical Practice, or who have completed 2 or more clinical skills modules in addition to Non-Medical Prescribing (NMP).&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary is depending on experience and qualifications. &lt;/p&gt;\n&lt;p&gt;If you would like any further information, please contact HR at MAHE.mastercall-recruitment@nhs.net or on 0161 476 7006. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Thursday 19th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mastercall Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130036"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport and Trafford", "postalCode": "SK7 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3782", "longitude": "-2.13956"}}, "title": "Advanced Practitioner - Urgent Treatment Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258597", "validThrough": "2020-11-19T23:59:59+0000"}