{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 pa inc"}}, "datePosted": "2020-10-23T16:45:58+0100", "description": "&lt;p&gt;&lt;strong&gt;Principal Psychoanalytic Psychotherapist/ Principal Group Analyst,&lt;/strong&gt;&lt;strong&gt; Band 8A &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Oxleas NHS Foundation Trust / Bexley Care&lt;/strong&gt;&lt;strong&gt;Erith Centre CMHT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1.00 WTE (37.5 Hours) Permanent &lt;/strong&gt;&lt;strong&gt;or &lt;/strong&gt;&lt;strong&gt;0.60 WTE (22.5 Hours) Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for two compassionate and enthusiastic psychotherapists to take a lead role in a well-established team that offers psychological treatment to service users from the London Borough of Bexley who have received a diagnosis of personality disorder.&lt;/p&gt;\n&lt;p&gt;This is a stimulating time to join the mental health services in Bexley following the recent merger between the local authority and Oxleas NHS Foundation Trust to form the highly innovative Bexley Care organisation. This new organisation aims to bring together a wide range of mental health, social care and physical health services under one organisational structure allowing for joint working and fluid referral processes.&lt;/p&gt;\n&lt;p&gt;As Principal Psychotherapists the post-holders will work alongside colleagues from a range of mental health disciplines to provide a specialist psychotherapy service. The post requires highly developed knowledge and skills in delivering psychotherapy in the context of complex presentations. The main treatment model offered by the team is Mentalisation-Based Therapy (MBT) and therefore post-holders will need to have had training and experience in this approach further to their training in psychotherapy. The post-holders will also make a significant contribution to the development and support of the personality disorder pathway in Bexley through the provision of supervision, consultation and teaching.&lt;/p&gt;\n&lt;p&gt;We would welcome applicants from any of the core mental health professions (e.g. psychology, nursing, social work, OT) who have completed an advanced level training in psychoanalytic psychotherapy or group analytic psychotherapy and hold registration with the British Psychoanalytic Council (BPC) or United Kingdom Council for Psychotherapy (UKCP). We would expect the post-holders to have at least two years of post-qualification experience working as a psychotherapist in a similar setting.&lt;/p&gt;\n&lt;p&gt;The post-holders will be based at the Erith Centre CMHT and will work alongside ADAPT, a secondary care mental health team that offers services to clients who present with complex anxiety, depression, trauma and interpersonal difficulties. Within the CMHT the post-holders will collaborate with colleagues from a range of professional backgrounds who strive to deliver holistic, person-centred care. Psychological therapists are fully integrated into the team and have developed strong working relationships across the services in Bexley. The psychological therapists come from a range of professional trainings (clinical and counselling psychology, family therapy, psychotherapy, and CBT) and deliver the full range of evidence-based interventions necessary in a secondary care setting. Supervision is provided locally by senior clinicians and there are also opportunities to attend specialist supervision across the Trust.&lt;/p&gt;\n&lt;p&gt;The Trust has a large, well-established and supportive psychological therapies service with strong representation and leadership at all levels. The input from psychological therapists is highly valued within the Trust and they undertake important roles, not only in clinical work, but also management, service development and clinical governance. The Director of Therapies, for example, is a member of the executive team for the Trust. Continuing Professional Development is supported through in-house training, specialist supervision, and links with external training providers. Service related research is encouraged by providing protected time for these activities.&lt;/p&gt;\n&lt;p&gt;Oxleas NHS Foundation Trust operates a Probationary Period, further details are available on request.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Peter De Backer Job title: Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address peter.de-backer@nhs.net Telephone number02038611144&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Erith Centre CMHT, Bexley", "postalCode": "DA8 3EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4771", "longitude": ".166671"}}, "title": "Principal Psychoanalytic/Principal Group Analytic Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241353", "validThrough": "2020-11-06T23:59:59+0000"}