{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-09T14:46:12+0100", "description": "&lt;p&gt;The Research and Development Department (R&amp;D) teams at Oxford University Hospitals NHS Foundation Trust (OUH) are part of the Joint Research Office (JRO). This was established by the University of Oxford (OU) and OUH to bring together the central clinical research support services of both organisations. The teams perform a range of activities to promote and facilitate research, as well as to support clinical researchers and their study teams to ensure that both organisations meet their legal responsibilities as hosts and sponsors of clinical research.&lt;/p&gt;\n&lt;p&gt;We wish to recruit a motivated, dedicated and experienced information systems product manager to lead on new software developments for managing clinical research at the JRO. Reporting to the Head of R&amp;D Information Systems, you will take responsibility for the development and rollout of clinical research project and portfolio management solutions and their integration with local trust and national systems with the aim of improving&lt;br /&gt;the business efficiency and productivity of clinical research at the OUH our wider partner organisations.&lt;/p&gt;\n&lt;p&gt;The role would suit someone who has worked in clinical research either as a research nurse, research coordinator, performance manager or data manager who now wants to extend their career into a more dedicated software development and support environment.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work with colleagues in the University-Hospital partnership to implement new software and technology which will make a real difference to the management and performance of clinical research.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned Interview Date: tbc&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tim Bradford, Head R&amp;D Information Systems, tim.bradford@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OUH@Cowley, Unipart House Business Centre, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "R&amp;D Information Systems Product Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220736", "validThrough": "2020-11-08T23:59:59+0000"}