{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-06T13:46:24+0000", "description": "&lt;p&gt;We have an exciting opportunity for an Associate Specialist Nurse for Learning Disability &amp; Autism to work as a key member of the Hospital Safeguarding Team. The post holder will work closely with the Specialist Nurse for Learning Disability and Autism, and the role will also offer a development opportunity within the health services of ELHT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will hold a the RNLD qualification, and you will have extensive experience working with adults and young people with a Learning Disability &amp; Autism.. This must be evidenced within your application. Experience of the hospital setting is desirable, and knowledge and understanding of the role is key. You must be confident in your role, and able to make decisions about complex situations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;ELHT is committed to supporting people with a learning disability, and providing a&lt;/p&gt;\n&lt;p&gt;high-quality frontline service across all ELHT hospitals and services. Working closely with our partner agencies we aim to strengthen our support for patients and their families/carers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The purpose of the role, and main duties include:-&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To support the improvement of the quality of care received by individuals with a learning disability in the acute hospital setting. Provide support and respond to concerns from clinical staff within our hospitals in relation to patients with learning disabilities.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Engage in the interface between mainstream general hospital services, primary care services and community specialist disability services.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Support the facilitation of open and easy access to general hospital services for people with learning disabilities within East Lancashire.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Providing advice re assessments of special needs such as mental capacity and best interest assessments.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Contribute to ELHT investigations for Safeguarding Alerts, Mortality Reviews (LeDeR), or Complaints involving people with learning disabilities. Supporting the teams to carry out Safeguarding investigations and address complaints for people with learning disabilities.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To work closely with the Specialist Nurse Learning Disability &amp; Autism and Named Nurse for Safeguarding Adults to update policies, guidelines and pathways to support people with learning disabilities within an acute hospital Trust&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual, with recent and extensive clinical experience relating to adults with Learning Disabilities. You will need an understanding of hospital services, and the ability to communicate with different professionals and agencies. You will be supported with the professional expertise and leadership of the Specialist Nurse for Learning Disability and Autism, and you will be part of the Safeguarding Team where line management arrangements are in place.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have an interest in teaching and education of staff, and you will be instrumental in supporting the development of policies and guidelines to support adults and young people with a learning disability and autism.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be supported to prioritise and manage your own workload, with the ability to work alone or as part of a wider team. Supervision will be provided as required by the Specialist Nurse for Learning Disability and Autism, and she will be instrumental in your development plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Written and verbal communication skills are essential, including the use of IT and other sources of information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have up to date knowledge of the local and national learning disability agenda in relation to adults and young people&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A person-centred approach is essential, and evidence of engagement with service users to strengthen a service is required. You will be adaptable, flexible and approachable and be able to challenge traditional views and work practices in a credible, non-threatening way.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a car owner/driver as you will cover all hospital sites and attend meetings county-wide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDiane DisleyJob titleNamed Nurse for Safeguarding AdultsEmail addressDiane.disley@elht.nhs.ukTelephone number01254 732848&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Across East Lancashire Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Learning Disability &amp; Autism Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259981", "validThrough": "2020-11-20T23:59:59+0000"}