{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17105", "minValue": "9903", "unitText": "YEAR", "value": "£9,903 - £17,105 per annum"}}, "datePosted": "2020-11-03T10:01:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Apprenticeship Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Fixed Term; minimum 18 months&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range: &lt;/strong&gt;£9,903 - £17,105&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an admin assistant to work in the Endoscopy Unit at the James Cook University Hospital.&lt;/p&gt;\n&lt;p&gt;The applicant will be responsible to help with the smooth running of the Department, to provide a welcoming &amp; effective reception area to patients &amp; visitors, to book appointments on the various departmental computer systems. Send test results out to clinicians within the hospital.&lt;/p&gt;\n&lt;p&gt;To provide a quality service through the provision of a diverse range of administrative based duties with in the Endoscopy Unit.&lt;/p&gt;\n&lt;p&gt;The James Cook University Hospital in Middlesbrough is a large Tertiary referral centre for Endoscopy services.&lt;/p&gt;\n&lt;p&gt;The Endoscopy Unit is equipped with state-of-the-art technology which allows us to have both secondary and tertiary referrals. The service provided at the unit is extensive and diverse and requires both diligence and the ability to work well under pressure. The successful candidate should prove to be both flexible and understanding to the needs of the service.&lt;/p&gt;\n&lt;p&gt;As an apprentice you will be trained in the full range of our office procedures. You will enjoy using a computer, meeting with and helping others and have a desire to provide a high standard of customer service. You must be able to prioritise your own work to meet deadlines, have the ability to follow instructions and have excellent communication skills, both verbal and written. You will be confident, have a mature and flexible approach, be a good time keeper and have the ability to work unsupervised to ensure the effective coordination of duties.&lt;/p&gt;\n&lt;p&gt;In return we will ensure that you receive all the training you need to be able to do this role fully and competently. You will be released for study and supported to achieve a Customer Service Practitioner Level 2 Apprenticeship Standard. You will receive 27 days annual leave and be entitled to a range of discounts on services and products from a number of retailers and organisations in the local area.&lt;/p&gt;\n&lt;p&gt;The minimum entry requirements are GCSE&#39;s D – E or level 1 in English &lt;strong&gt;and&lt;/strong&gt; maths (or equivalent).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants are not eligible to apply for this apprenticeship if they have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;A Customer Service qualification or apprenticeship (in the same field) at level 2 or level 3&lt;/strong&gt; (If applicants have other qualifications similar to customer service, an eligibility check will need to be completed to ensure they are eligible to do this apprenticeship)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please note that this vacancy will close once we have received a sufficient number of applications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Martin Fletcher (Manager)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: martinfletcher@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 01642 850 850 ext:54845&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Apprentice Administration Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253361", "validThrough": "2020-11-17T23:59:59+0000"}