{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-29T15:45:38+0000", "description": "&lt;p&gt;We have an excellent opportunity for an talented individual within our Care of the Elderly team.&lt;/p&gt;\n&lt;p&gt;Our aim is to bring your ambition to life. This role will take a lead focus on Elderly Care and Orthogeriatric care. Our Medical Consultant workforce are supported to develop a specialist interest, such as TIA, Stroke or Parkinson’s Disease (for discussion at interview). We have a protected training budget for medical staff which will support your development, and a focus on career development for medics at all levels.&lt;/p&gt;\n&lt;p&gt;We are currently one of the highest performing Trusts in Greater Manchester, with a number of award winning and pioneering initiatives. We are currently developing our Frailty and our Surgical Liaison agenda, and we need forward-thinking people to help us create our vision.&lt;/p&gt;\n&lt;p&gt;Your experience and vision will be supported by our skilled team of clinical staff alongside dedicated and trained nurses. You will be able to contribute to training/teaching, our leadership agenda and audit and other Clinical Governance activity.&lt;/p&gt;\n&lt;p&gt;We would also consider supporting an experienced middle grade into this role through the CESR route&lt;/p&gt;\n&lt;p&gt;The successful candidate will also be expected to participate in the Medicine on call rota with a commitment of 1:14.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ema O&#39;Neill-Jones, Directorate Manager&lt;br /&gt;0161 922 4105&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside Hospital, Ashton-Under-Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Consultant - Care of the Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248912", "validThrough": "2020-11-12T23:59:59+0000"}