{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-28T15:30:16+0000", "description": "&lt;p&gt;Older People’s residential and nursing homes care for the most frail and often medically complex elders living in our community. Due to a recent expansion in our service provision we are pleased to advertise a Band 8a Pharmacist post. As a member of our Care Home Support Team, you will work within a multi-disciplinary team (MDT) of nurses, therapists, pharmacists and clinical assistants to support the residents and staff in elderly care homes across Kirklees. This is an opportunity for at a dedicated, enthusiastic, self-motivated pharmacist to join our supportive and friendly care home Support Team. The post-holder will work alongside other pharmacists to support and review effective medicines management within elderly care homes across Kirklees.&lt;/p&gt;\n&lt;p&gt;They will reconcile medicines, undertake systematic medication reviews on admission from primary care to care home and on discharge from hospital. Provide advice on medicines usage, and deliver education and support to care homes in order to maximize patient’s independence and quality of life in relation medication.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a registered pharmacist who demonstrates an excellent knowledge and understanding of medicines optimisation, safety, legislation and best practice and be able to apply these in elderly care homes. They will have outstanding interpersonal skills and demonstrate the ability to communicate with a range of colleagues and health care professionals. The role will provide an excellent opportunity for the right candidate to develop their knowledge and skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD9 3TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5788", "longitude": "-1.7844"}}, "title": "Specialist Pharmacist - Care Homes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247174", "validThrough": "2020-11-15T23:59:59+0000"}