{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £44,780 per annum inclusive"}}, "datePosted": "2020-11-04T09:51:07+0000", "description": "&lt;p&gt;We are looking for band 5 and 6 Staff Nurses to join our Paediatric Critical Care unit which is fast paced, innovative and dynamic environment. We are a 16 bedded Intensive Care Unit and a 4 bedded High Dependency area.&lt;/p&gt;\n&lt;p&gt;Our excellent critical care services are recognised worldwide and we are proud this work has been recognised with an ‘Outstanding for Care’ In our recent CQC report.The specialist skills that are adopted throughout the varied training programmes available within the unit are transferrable for your future career progression.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a multidisciplinary team of skilled and highly motivated staff who provide high quality care to children with a variety of conditions including congenital heart disease (pre- &amp; post-surgery), acquired heart disease, respiratory conditions and thoracic surgery.&lt;/p&gt;\n&lt;p&gt;We are committed to helping you realise your potential which is reflected through a personalised training and development plan, dedicated Practice Educators and generous study leave.&lt;/p&gt;\n&lt;p&gt;The internationally renowned and award-winning, Simulated interProfessional Team Training (SPRinT) programme uses in-situ simulation to provide the multidisciplinary team involved in patient care with insight into human factors that influence personal performance and strategic crisis training.&lt;/p&gt;\n&lt;p&gt;We believe that the needs of the individual child are central to their wellbeing. We acknowledge the importance of the family to their child and work in partnership with them to provide the best possible care in a safe and caring manner. We will treat those families as we would wish to be treated ourselves; always providing the highest quality of care to all.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal conversation about the role or to arrange an informal visit please contact&lt;/strong&gt; &lt;strong&gt;Steve Tugwell, Practice Educator on s.tugwell@rbht.nhs.uk or you can call 0207 352 8121 ext. 82489&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London - Royal Brompton Hospital", "postalCode": "SW3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4897", "longitude": "-.170831"}}, "title": "Band 5 or 6 Staff Nurse Paediatric Critical Care Unit PICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255260", "validThrough": "2020-12-06T23:59:59+0000"}