{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-10-16T16:46:11+0100", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust has an international reputation for high quality patient care, education and research. Its partnership with the Institute of Cancer Research has created the largest comprehensive cancer centre in Europe.&lt;/p&gt;\n&lt;p&gt;The RMH breast unit (Sutton and Chelsea) is the largest cancer service in the Trust and of the largest breast units in the UK treating over 1000 new breast cancers per annum. We provide one of the UK’s most comprehensive breast services both as a secondary and tertiary provider with all the usual core services as well as additional services including secondary care specialist nurses, psychological medicine and a regional genetics service. RMH has 60% primary post-mastectomy reconstruction rate and a mature oncoplastic team with fortnightly oncoplastic MDMs.&lt;/p&gt;\n&lt;p&gt;This post is aimed at offering a surgical junior registrar dedicated time for research while maintaining some clinical sessions in the Breast Diagnostic Clinic. The job plan and training will be tailored to the individual. Research and audit can be carried out to follow on from existing projects or the candidate can develop their own project with the support of the Breast Surgery Team. This post is Sutton based.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ms Katherine Krupa, Consultant Oncoplastic Breast Surgeon, Katherine.Krupa@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mr Peter Barry, Consultant Oncoplastic Breast Surgeon via email Peter.Barry@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Breast Surgery Clinical Research Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231171", "validThrough": "2020-11-15T23:59:59+0000"}