{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40890", "minValue": "36479", "unitText": "YEAR", "value": "£36,479 - £40,890"}}, "datePosted": "2020-10-19T17:17:18+0100", "description": "&lt;p&gt;We have an exciting opportunity for an Recovery Practitioner to join a supportive and warm working culture at The London Clinic where your contribution is valued, and you can help us provide the best, personalised healthcare, and deliver our three core values of; Caring, Inspiring and Pioneering.&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest private hospitals, with state-of-the-art facilities located on Harley Street. We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Profile&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the multidisciplinary team the Recovery Practitioner is responsible for the assessment, evaluation and implementation of care given to patients within the recovery room without supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Job Location: This role is located at our main hospital facility in London, W1G 6BW (Close to Regents Park &amp; Baker Street tube stations).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Job Type:  This is a full-time, permanent position working 37.5 hours per week. We operate a mixed shift pattern - Earlies / Lates (typically 5 x 7.5 hour shifts between the hours of 7:30am – 9:30pm), with participation in the weekends &amp; on-call rota.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary: The attractive salary range for this role is £36,479 - £40,890 (inclusive of London Weighting), and will be dependent upon skills and experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Benefits package: We offer a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 33 day’s annual leave (inclusive of bank holidays), season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Duties&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work as a skilled member of the recovery team, carrying out nursing duties within the recovery area, and providing the highest standard of patient care.&lt;/li&gt;\n&lt;li&gt;Develop and maintain clinical skills and knowledge necessary to provide holistic, evidence based nursing care, following PREP/CPD requirements.&lt;/li&gt;\n&lt;li&gt;Participate in the monitoring and maintenance of standards in accordance with the Clinic policies and procedures, as well as maintain custody and checking of controlled drugs daily.&lt;/li&gt;\n&lt;li&gt;Communicate effectively and responsibly at all times with colleagues within the multi-disciplinary setting.&lt;/li&gt;\n&lt;li&gt;Maintain accurate and legible written and electronic records of care, ensuring that the safety, privacy and dignity of the patient is maintained at all times.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RGN / ODP qualified practitioner (NMC or HCPC registration).&lt;/li&gt;\n&lt;li&gt;Proven experience in recovery and/or intensive care setting.&lt;/li&gt;\n&lt;li&gt;Understanding of the post-operative needs of patients and customers.&lt;/li&gt;\n&lt;li&gt;Good communication and interpersonal skills with the ability to work under pressure and flexibly as part of a team.&lt;/li&gt;\n&lt;li&gt;Highly motivated individual who is Punctual, adaptable and continually maintains a professional image.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The London Clinic has approx. 1300 employees, across 8 sites located in the heart of London’s medical community. Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. Speciality areas include, General surgery; ENT; Gynaecology; Hepatobiliary; Neuro-spinal; Ophthalmic; Orthopaedic; Plastic and reconstructive; Robotic; Urology; Vascular &amp; Weight loss surgery (bariatric surgery).&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Recovery Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233332", "validThrough": "2020-11-27T23:59:59+0000"}