{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T12:01:03+0000", "description": "&lt;p&gt;&lt;span&gt;Do you excel at hands on nursing? Would you love to learn a really interesting set of new skills? Could you see yourself in a cardiac emergency team that saves lives on a day to day basis?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If so, we want to hear from you!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Cardiac Catheter Suite at The Queen Mother the Queen Mother hospital in Margate has a rare opportunity. Working in a small and very supportive multidisciplinary team, you will develop your skills in patient care, moving from the admission and recovery of day case cardiac patients, through to circulatory role in our Lab (Theatre) environment. Once those skills are attained, your next goal will be to train as a scrub nurse/first assistant. When appropriate, you will join the Trusts flagship Primary PCI oncall team for patients with STEMI. Full training from senior staff guided by robust competency documentation will support your progress through every stage. Rest assured, the phrase &quot;thrown in at the deep end&quot; has no place in the Cardiac Catheter Suite!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Lab has a nominal working day at the QEQM of 08.00 to 18.00 during weekdays. Like all parts of today’s NHS, we manage an increasing caseload and our team works flexibly with shift times to meet the needs of the patients. Almost all of our work involves X-ray screening and protective lead garments are worn for case lists. Whilst this role is predominantly based at QEQM our service is located across the trust and you will be required at times to travel to our lab at the William Harvey Hospital in Ashford for cross cover.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your advanced training and participation in our on call service are also undertaken at WHH. Travel cost incurred will of course be fully reimbursed in accordance with trust policy. Car ownership is not absolutely essential for this role, but you will need to be able to travel to William Harvey hospital at potentially short notice. Once participating in the on call service (generally around six months training) there is an opportunity to usefully increase income.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be joining a hard working but friendly team where your ability to prioritise clinical tasks, engage with patients and your interest in gaining new skills and knowledge will be highly valued and supported. We are looking for people who ideally have some previous experience of working in cardiology but we would consider applications from newly qualified or other nurses we feel are suitable. We will support and develop you to reach your full potential as a highly skilled and experienced nurse within our speciality. We would very much like to meet you for an informal look around our unit to explain our service in greater detail and answer your questions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please note previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Naomi Bailey, n.bailey1@nhs.net 01843234314&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248234", "validThrough": "2020-11-12T23:59:59+0000"}