{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum, pro rata"}}, "datePosted": "2020-10-20T14:16:35+0100", "description": "&lt;p&gt;It’s all here for you to discover at Manchester University NHS Foundation Trust (MFT). As the UK’s largest trust, we offer unparalleled career opportunities, a great work/life balance in one of the country’s most exciting cities – and the chance to do something unique with your knowledge.&lt;/p&gt;\n&lt;p&gt;As one of the two proposed hubs for Greater Manchester, you will have the opportunity to work in one of the largest and most forward looking Laboratory Medicine Division’s in the country.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity, and are seeking a Deputy Director to join the Divisional Management team reporting to, and supporting the Director of Laboratory Medicine. This role is suited to an individual who is passionate to shape and develop the strategy for pathology and be responsible for modelling new ways of operating to provide a more effective and patient focused service. The post holder will work closely with the Divisional Director and Clinical Head of Division and is expected to have a strong insight into the Pathology Modernisation agenda and be able to demonstrate, through experience, an ability of managing large scale services. The successful candidate will work with the Divisional Management Team, lead the Divisional Support Team, and ensure that Laboratory Medicine delivers on service provision, whilst driving forwards initiatives and innovation across MFT’s laboratories.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a history of operational and transformational delivery within Laboratory Medicine. They will possess excellent people skills and the credibility and ability to work with and influence at every level, be adept at working across departments and with multidisciplinary teams to drive change, delivering and shaping the agenda. We require a high calibre professional, a high achiever, motivated, flexible, with proven experience of managing challenging situations, providing strategic management planning and having excellent organisational skills. We are looking for a forward thinking individual who is keen to drive forwards Laboratory Medicine in these challenging times. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Whatever you need to be your best, you’ll find it all with us. Bringing together hospitals and community services from across Manchester, Trafford and beyond, we’re pooling our resources, state of the art facilities and specialist services to deliver even better patient care. With a diverse and specialised pathology service and an extensive ground breaking research portfolio, we are one of the UK’s largest laboratory services. So join us and you’ll discover more ways to progress. We want talented individuals from all backgrounds to choose to join our diverse teams, and so we will support your work-life balance with flexible and agile working options. And, with the best of both inner city and country living on our doorstep, you can enjoy a better quality of life too. Discover more and apply at mft.nhs.uk.&lt;/p&gt;\n&lt;p&gt;All Here for You&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDavid BrayshawJob titleDirector of laboratory MedicineEmail addressdavid.brayshaw@mft.nhs.ukTelephone number0161 701 6230Additional contact information&lt;/p&gt;\n&lt;p&gt;Alternative contact Katherine Hayden, Clinical Head of Service, katharine.hayden@mft.nhs.uk or telephone 0161 701 1106&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road Campus, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Deputy Divisional Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234752", "validThrough": "2020-11-09T23:59:59+0000"}