{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32525", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 / £32,525 / £33,587 / £34,782 / £37,267"}}, "datePosted": "2020-10-09T09:47:25+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHS Hero is something to be proud about&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental Health Nurse Band 6, Mental Health Services for Older People (MHSOP) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have both full and part-time vacancies within our Memory Service for Band 6 Mental Health Nurses. The posts are available at both our sites - The Evington / Neville Centres at Leicester General Hospital, and The Bennion Centre at Glenfield Hospital.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for enthusiastic, skilled and competent mental health nurses who have an interest in the care of older adults. The post holder will be responsible for carrying out specialist mental health assessments for individuals with memory impairment, imparting diagnosis and commencing treatment where appropriate.&lt;/p&gt;\n&lt;p&gt;The service operates within out-patient clinic settings, care homes and clients’ own homes across Leicester, Leicestershire and Rutland. The successful candidates will join an established team of Band 6 Memory Service Nurses, specialist Memory Service Psychiatrists and dedicated admin staff. You will need to demonstrate flexibility and commitment to high standards of patient care. You should also demonstrate good assessment and communications skills and the ability to work sensitively both autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and skilled RMNs registered with the NMC. Possession of a Non-Medical Prescribing (NMP) qualification or a willingness to work towards this is desirable but not essential. The team has close partnerships with the wider MHSOP community, Social Services and the voluntary sector to ensure the patient experience is maximised.&lt;/p&gt;\n&lt;p&gt;We have a strong commitment to supervisory training and professional development and the post holders will receive full support and supervision to enable the assessment, delivery of diagnosis and treatment options.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post and a car-leasing scheme is in operation.&lt;/p&gt;\n&lt;p&gt;For an informal chat, further information, or to arrange to visit one of our sites, please contact: Barathan Manicassamy, Memory Service Lead on 07717867405.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 6 Memory Clinic Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219609", "validThrough": "2020-11-06T23:59:59+0000"}