{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-10-29T17:01:16+0000", "description": "&lt;p&gt;Do you enjoy working in a busy, fast-paced, complex environment, and have a passion for working with people?&lt;/p&gt;\n&lt;p&gt;The Community Orthopaedic and Chronic Pain Services are a dynamic and innovative place to work. We are looking to recruit an administration assistant for our Orthopaedic Service, delivering services in various locations across Kent. Our administration teams are the backbone of the services, providing the support needed to enable the clinical staff to offer an excellent service to our patients.&lt;/p&gt;\n&lt;p&gt;The service is evolving and growing, working seamlessly with other organisations to provide expert Orthopaedic services to patients. We work closely with the acute hospitals, GPs and Community Services in all aspects of the Orthopaedic pathway.&lt;/p&gt;\n&lt;p&gt;As a member of our team, you can expect a huge variety of work and being part of a team who go above and beyond, and take pride in the service we offer our patients. Each member of staff is truly valued and involved in making sure we embrace new ways of working – making the changes necessary to provide the most innovative, dynamic, responsive service of excellence.&lt;/p&gt;\n&lt;p&gt;This post will focus on providing a high quality administrative service, ensuring current robust processes are adhered to at all times, such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;accurate typing and keyboard skills;&lt;/li&gt;\n&lt;li&gt;accurate data input, using our databases;&lt;/li&gt;\n&lt;li&gt;accurate record keeping on our patient database;&lt;/li&gt;\n&lt;li&gt;answering telephone calls in a friendly and professional manner;&lt;/li&gt;\n&lt;li&gt;good written English;&lt;/li&gt;\n&lt;li&gt;excellent attention to detail;&lt;/li&gt;\n&lt;li&gt;proficient using Word, Excel and Outlook;&lt;/li&gt;\n&lt;li&gt;excellent organisational and communication skills;&lt;/li&gt;\n&lt;li&gt;Car owner/driver essential, subject to the provision of the Equality Act (2010)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate should be a highly motivated and a flexible individual, who is effective in managing time and workloads, whilst being a team player.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognised qualification, which we will support. So if you do not have the essential qualification for the role, this may not be an automatic barrier to you being offered an interview. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If this sounds like you, we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 30th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caroline Domjan - 07976 442 180&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mill Lane House, Margate", "postalCode": "CT9 1LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.386", "longitude": "1.38265"}}, "title": "Administrative Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249181", "validThrough": "2020-11-16T23:59:59+0000"}