{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881 per annum"}}, "datePosted": "2020-10-28T16:01:16+0000", "description": "&lt;p&gt;This locum post is a replacement post while we are looking to appoint a substantive consultant. You will join colleagues in a very dynamic and forward looking Multi-Disciplinary Child and Adolescent Mental Health Service.  The post will be a 10 session post with 8 sessions allocated to the generic S-CAMHS service in Ceredigion and the remaining 2 sessions will be based in Carmarthen to provide consultant time to the HB wide Early Intervention Psychosis Service. &lt;/p&gt;\n&lt;p&gt;This post comes during a period of Health Board-wide service reviews, including a comprehensive reconfiguration of Mental Health, Learning Disabilities and S-CAMHS services within the Health Board.  The aim is to provide a spectrum of flexible and responsive services for the population across the Health Board.&lt;/p&gt;\n&lt;p&gt;The S-CAMHS is part of the Mental Health &amp; Learning Disabilities Directorate and there has been a significant investment in enhancing existing provision and developing new services across the HDUHB over the last 18 months&lt;/p&gt;\n&lt;p&gt;West Wales is an area of outstanding beauty that offers a variety of outdoor pursuits and beautiful coastline. It is an excellent place to raise a family. Reasonable property prices and excellent state schools contribute to low living costs and a high quality of life.  There are also good road and rail connections to Cardiff and London.&lt;/p&gt;\n&lt;p&gt;Office accommodation, secretarial support and full IT facilities including access to intranet and internet will be provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Warren LloydJob titleClinical Director &amp; Associate Medical Director MH&amp;LD&lt;/p&gt;\n&lt;p&gt;Email: Warren.Lloyd@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tele: 01267 674130&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bronglais General Hospital, Aberystwyth", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Locum Consultant in S-CAMHS and Early Intervention of Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247302", "validThrough": "2020-11-30T23:59:59+0000"}