{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15280", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 to £9.09 per hour"}}, "datePosted": "2020-10-08T09:40:22+0100", "description": "&lt;p&gt;We are currently seeking &lt;strong&gt;Healthcare Support Workers&lt;/strong&gt; to work in our &lt;strong&gt;Child and Adolescent Mental Health Service (CAMHS)&lt;/strong&gt; at &lt;strong&gt;The Huntercombe Hospital Stafford&lt;/strong&gt; located in &lt;strong&gt;Wheaton Aston,&lt;/strong&gt; 10 miles from &lt;strong&gt;Telford&lt;/strong&gt; &amp; 12 miles from &lt;strong&gt;Wolverhampton.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital is a 39 bed Tier 4&lt;strong&gt; CAMHS hospital&lt;/strong&gt; for young people aged 12 -18 years with a range of mental health disorders including eating disorders and complex needs.&lt;/p&gt;\n&lt;p&gt;We provide comprehensive assessment and treatment programmes working collaboratively with patients and their families or carers.&lt;/p&gt;\n&lt;p&gt;On the hospital site there is a purpose-built 12 bed psychiatric intensive care service (PICU) for patients with severe mental Illness who require very specialist and intensive treatment. The 15 bed eating disorders service is housed separately in the original Manor House.&lt;/p&gt;\n&lt;p&gt;The hospital is located close to the village of Wheaton Aston, 10 miles from&lt;strong&gt; Stafford&lt;/strong&gt; and &lt;strong&gt;just 6 miles from the M6&lt;/strong&gt; motorway.&lt;/p&gt;\n&lt;p&gt;At Huntercombe, our &lt;strong&gt;Support Workers&lt;/strong&gt; do something extraordinary every day. They make a difference to the lives of children and adults with complex needs such as mental health conditions, learning difficulties or brain injuries.&lt;/p&gt;\n&lt;p&gt;We’re looking for caring and committed individuals who want to work with a company that understands how important &lt;strong&gt;Support Workers&lt;/strong&gt; are to our patients/residents recovery.&lt;/p&gt;\n&lt;p&gt;Many of our patients arrive with complex and challenging needs. Huntercombe &lt;strong&gt;Support Workers&lt;/strong&gt; work in small teams with nurses, doctors, therapists and other experts, and together they make a world of difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Support Worker&lt;/strong&gt;, you will be part of a company that is understanding, strives towards excellence, is innovative, reliable and accessible and above all puts people first.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Support Worker&lt;/strong&gt; working in our &lt;strong&gt;Child and Adolescent Mental Health Service (CAMHS)&lt;/strong&gt; your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist the senior trained staff in their day-to-day duties and clinical related tasks&lt;/li&gt;\n&lt;li&gt;Maintaining and developing a high standard of care for our patients/residents by being aware of their individual needs and care programmes&lt;/li&gt;\n&lt;li&gt;Contributing towards effective communication, by reporting to the nurse in charge any information given by the patient/resident or relative of any incident or observation which may affect our patients physical/mental well-being&lt;/li&gt;\n&lt;li&gt;Providing practical assistance to our patients/residents in carrying out everyday living tasks whilst encouraging them to develop their daily living skills and realising their potential to live as independently as they find possible&lt;/li&gt;\n&lt;li&gt;To be actively involved with the day to day routine in individual and group activities&lt;/li&gt;\n&lt;li&gt;To practice within a legal framework encompassing statutory, organisational policy and guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To Join The Huntercombe Group as Support Worker you will be:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Empathetic and have a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Passionate about forming therapeutic relationships&lt;/li&gt;\n&lt;li&gt;Committed to a person-centred approach to recovery&lt;/li&gt;\n&lt;li&gt;Enthusiastic about working as part of a dedicated team&lt;/li&gt;\n&lt;li&gt;Resilient and able to work under pressure&lt;/li&gt;\n&lt;li&gt;An effective communicator with good written and verbal skills&lt;/li&gt;\n&lt;li&gt;Willing to take ownership for the delivery of quality care and demonstrate leadership qualities&lt;/li&gt;\n&lt;li&gt;Legally entitled to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Opportunity to train to become a nurse through our ‘grow our own’ nurses programme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, martial status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;Social Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wheaton Aston, STAFFORD", "postalCode": "ST19 9QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6942", "longitude": "-2.23489"}}, "title": "Support Workers", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217688", "validThrough": "2020-11-10T23:59:59+0000"}