{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-30T13:46:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: Up to 37.5 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Band 5 Staff Nurse to join our friendly Nurse led Haemodialysis Team at Easingwold Satellite Renal Unit.&lt;/p&gt;\n&lt;p&gt;Easingwold Satellite Unit is a 10 station Haemodialysis Unit caring for patients with chronic kidney disease. We are part of York Renal Services which also has a main unit at York Teaching Hospital and a satellite unit in Harrogate.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated nurse who demonstrates excellent communication and leadership skills to join us. You will be part of a dynamic forward thinking multi-disciplinary team delivering high quality individualised evidence based care. In addition to possessing excellent communication and people skills, you must also work well under pressure and use your initiative.&lt;/p&gt;\n&lt;p&gt;No previous dialysis experience is required as a comprehensive training package will be provided, although you should be able to demonstrate an interest in renal nursing. Ongoing support will be provided by other members of the nursing team and the Renal Clinical Educator.&lt;/p&gt;\n&lt;p&gt;Although based at Easingwold the successful candidate needs to be flexible to cover occasional shifts at York or Harrogate if there is a clinical need. &lt;br /&gt;You will be part of a dedicated team of nurses, and will also be expected to take part in the limited out of hour’s on-call service as required.&lt;/p&gt;\n&lt;p&gt;Our unit is open from Monday to Saturday - 7.00am to 7.00pm, 6 days per week (closed on a Sunday).&lt;/p&gt;\n&lt;p&gt;We also offer a number of other benefits for our Band 5 Staff Nurses which include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Pre-Registered Nurses who have completed their degree and are awaiting NMC registration will be paid at AfC Band 5.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;You may be eligible for financial support of up to £750 if you are relocating to join our Trust.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Refer a friend scheme; you could receive a £250 payment if you refer a nurse to us that takes up employment in our Trust (paid after the new starter completes 3-months in post).&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;We also offer a wide range of benefits which you can view by visiting the Trust&#39;s dedicated &lt;strong&gt;Staff Benefits pages&lt;/strong&gt;.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are passionate about providing the highest standards of care to patients we would like to hear from you. In return we will provide a stimulating and challenging role for you with full support to integrate into the multidisciplinary team of Renal Services.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sister Judith Hartley &lt;/strong&gt; or &lt;strong&gt;Deputy Sister Sonia Crawford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: (01904) 724800.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Easingwold Renal Unit, York", "postalCode": "YO61 3HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1224", "longitude": "-1.19722"}}, "title": "Staff Nurse - Haemodialysis (Easingwold Renal Unit)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250405", "validThrough": "2020-11-15T23:59:59+0000"}