{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48000", "minValue": "48000", "unitText": "YEAR", "value": "£48,000 + Benefits"}}, "datePosted": "2020-10-30T11:27:43+0000", "description": "&lt;p&gt;Are you an experienced Mental Health Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be? If so, propel your career to the next level as you help lead a team of Nurses at Farmfield Hospital.&lt;/p&gt;\n&lt;p&gt;As an experienced Nursefrom the NHS or private care, you&#39;ll join the team at Farmfield Hospital as a Mental Health Nurse to support some of the most vulnerable people in today&#39;s society. Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a qualified&lt;strong&gt;RMN&lt;/strong&gt;you willprovide a high profile, visible clinical leadership to the hospital wide nursing team. You will promote and safeguard the well-being and interests of all patients, employees and visitors. You will ensure that standards of patient care are maintained at all times within the parameters of operational policies and governing legislation.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Things that you will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN&lt;/li&gt;\n&lt;li&gt;Educated to degree level, or professional equivalent&lt;/li&gt;\n&lt;li&gt;At least 2 years’ post qualification experience&lt;/li&gt;\n&lt;li&gt;Management and leadership experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Farmfield Drive, Charlwood, Surrey, RH6 0BN&lt;/p&gt;\n&lt;p&gt;You will be working at Farmfield Hospital, which is a large purpose-built medium-secure service with good facilities. Working alongside a multidisciplinary team, you will provide care and support for adult men 18+ with a forensic background and enduring mental health illnesses such as personality disorder, substance misuse issues and behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;Farmfield is located North West of Gatwick airport near the village of Hookwood, with good transport links by road, bus and train. It is easiest to reach the site by car.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £48,000 depending on experience&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charlwood", "postalCode": "RH6 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1664", "longitude": "-.201944"}}, "title": "Deputy Lead Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249929", "validThrough": "2020-12-31T23:59:59+0000"}