{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-22T16:45:19+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse - Thoracic Medicine (Registered and Newly Qualified)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BRINGING YOU EXCITING NURSING OPPORTUNITIES IN THORACIC MEDICINE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be part of our incredible team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working with us will provide you with an experience like no other to fast forward your career.&lt;/p&gt;\n&lt;p&gt;We have opportunities in our unique clinical area that is renowned nationally for looking after a wide variety of specialist respiratory needs. We have a fantastic multidisciplinary approach helping with psychological and social care as well as physical needs. We also offer ambulatory care service for day‐case patients so they can be at home for much of their treatments.&lt;/p&gt;\n&lt;p&gt;Join our expanding team who are caring, friendly, dedicated and passionate. You will be given full support and training to become an expert within this rewarding field of work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Such is the care our patients receive; they often say that they see our teams as an extension of their family.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Develop a rewarding career with us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to this we have a £1,000 welcome waiting for you *&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Regular shortlisting takes place and you will be contacted for a Skype interview if you are shortlisted for interview.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our nurses say……&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“We feel fully supported and cared for, knowing there is always someone to go to for guidance”&lt;/p&gt;\n&lt;p&gt;“We love the warm environment, the team energy and camaraderie”.&lt;/p&gt;\n&lt;p&gt;“We feel valued and have regular access to 1-2-1 meetings, appraisals and professional opportunities – the success of our wards is due to the development provided to us”.&lt;/p&gt;\n&lt;p&gt;“We feel heard and the reason we remain working here is because of the patients that we care for”. “We feel privileged to be a trusted part of the patient’s journey”.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our patients say……&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“I cannot recommend the care we got highly enough”&lt;/p&gt;\n&lt;p&gt;&quot;The staff were very caring and kept us informed to all the procedures. It made the stay in hospital easy and comfortable”&lt;/p&gt;\n&lt;p&gt;“I felt very well looked after. Thank you very much for my stay, very efficient and friendly”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*£1,000 welcome payment applicable to those who commence on substantive contracts with a commitment to remain with the Trust for a minimum of 12 months (excludes Bank contracts).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Staff Nurse B5 - Thoracic Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239407", "validThrough": "2020-11-29T23:59:59+0000"}