{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-04T11:46:11+0000", "description": "&lt;p&gt;Following our exciting announcement of a multi-million pound government investment to develop the Northern Lincolnshire and Goole NHS Foundation Trust estate, we now require a Senior Technical Manager (Mechanical) to provide engineering technical support to the projects office in direct support of the delivery of the Trust’s Capital programme.&lt;/p&gt;\n&lt;p&gt;This is a fixed term role responsible to specifically offer mechanical technical advice on the estates/infrastructure and equipment schemes, and support the Trust’s Charitable Schemes and minor/additional works programme. You will support Estates and Facilities and Trust wide clinical projects programme in a comprehensive and proactive professional manner. It will be your responsibility to support the technical aspects of the projects delivery to maximize the use of capital funds to the betterment of patients, as well as contribute to the Trust’s objectives in a safe, cost effective, efficient manner and compliant with legislation and good practice.&lt;/p&gt;\n&lt;p&gt;You will be fully responsible for the provision of technical advice and support to other staff, design teams and contractors working for or within the Directorate of Estates and Facilities as appropriate. This will involve working closely with other departments within and outside of the Directorate to provide a patient centred environment and Facilities services, recognizing your contribution to the overall patient experience.&lt;/p&gt;\n&lt;p&gt;Your extensive experience of working in an Estates management role and managing multiple project streams within a healthcare setting will allow you to successfully support staff and specialist contractors, whilst also managing data and information to ensure an economic quality service, ensuring compliance with Trust standards, procedures and legislation.&lt;/p&gt;\n&lt;p&gt;If you are looking to put your skills to use in a team with a great ethos and you would relish the opportunity to enable change to people’s lives then we want to hear from you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris Conroy, Senior Project Manager&lt;/p&gt;\n&lt;p&gt;chris.conroy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide - Scunthorpe, Grimsby and Goole", "postalCode": "DN33 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5449", "longitude": "-.096217"}}, "title": "Senior Technical Manager (Mechanical)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255668", "validThrough": "2020-11-18T23:59:59+0000"}