{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-29T17:01:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitably experienced physiotherapists who wish to specialise in the musculoskeletal field. You must have significant broad based post graduate clinical experience in a variety of settings including recent MSK experience.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for an experienced band 5 or existing band 6 to develop clinical skills working in a supportive environment where CPD, service development and evidence based practice is encouraged and there is a strong emphasis on quality and excellence in clinical care.&lt;/p&gt;\n&lt;p&gt;As part of a large dynamic physiotherapy team, you will benefit from regular protected in-service training time and supervision with our experienced band 7 team leaders and clinical specialists. You will also have opportunity for learning and development through working alongside our team of Advanced Physiotherapy Practitioners. You will have supervision and teaching responsibilities for junior staff and students. We are looking for a dynamic physiotherapist who has a passion for service improvement and is able to work well both autonomously and as part of the team.&lt;/p&gt;\n&lt;p&gt;The Physiotherapy Department accept referrals from both GPs and hospital consultants so this is a role that will enable you to maintain a varied clinical caseload and use your own initiative to meet the different needs of patients. In addition to the main outpatient department within the hospital, we also provide treatment in smaller satellite clinics held in community locations.&lt;/p&gt;\n&lt;p&gt;This post will require participation in the Orthopaedic weekend rota at Fairfield General Hospital.&lt;/p&gt;\n&lt;p&gt;The department is working towards a 7 day model of service delivery and as such you will be expected to be flexible in terms of working patterns including weekends, bank holidays and extra hours if necessary.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lindsay Morrison/Lucy Knott&lt;br /&gt;Operational &amp; Professional Leads&lt;br /&gt;0161 778 3830&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Senior MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249176", "validThrough": "2020-11-12T23:59:59+0000"}