{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-28T10:32:24+0000", "description": "&lt;p&gt;Help us achieve our vision for adult acute community mental health services in Hertfordshire!&lt;/p&gt;\n&lt;p&gt;We’re looking for a talented Crisis Support Worker to work in our busy and dynamic Crisis Assessment and Treatment Team (CATT) based in Ware, South East Hertfordshire. It’s a genuinely exciting time to join – we’re developing new ways of working, which will see us delivering a 24/7 responsive adult crisis and acute care service – but we need you to help us achieve our vision. The role will provide a genuine opportunity for you to develop your clinical skills and make a difference&lt;/p&gt;\n&lt;p&gt;You’ll have experience of working with clinicians and multi-disciplinary teams to achieve service improvement. We’d like to see a real passion for community and crisis mental health services, and the difference you can make to service users and carers. It’s a challenging role, in a challenging environment, but we believe it will provide a real scope to develop and influence practice.&lt;/p&gt;\n&lt;p&gt;The Trust itself is a leading provider of mental health and learning disability services with ambitions to be the leading provider in the country. We’ve been rated ‘Outstanding’ by the CQC at our recent inspection. We are a strongly values-based organisation, so that you – and anyone that comes into contact with our services – will experience consistently welcoming, kind, positive, respectful and professional treatment.&lt;/p&gt;\n&lt;p&gt;You’ll have the opportunity to undertake various trainings and benefit from excellent promotion prospects, some state of the art clinical environments and the opportunity to be part of a fantastic multidisciplinary team of staff who are genuinely committed to improving the lives of our service users and carers. We have an excellent range of staff benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameZoe BrownJob titleTeam LeaderEmail addresszoe.brown19@nhs.netTelephone number01920443950&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet House, Ware", "postalCode": "SG12 0DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8119", "longitude": "-.037244"}}, "title": "Community Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246110", "validThrough": "2020-11-11T23:59:59+0000"}