{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32151", "minValue": "21434", "unitText": "YEAR", "value": "£21,434.40 - £32,151.60 (15 - 22.5 hours)"}}, "datePosted": "2020-10-28T10:05:32+0000", "description": "&lt;p&gt;We are currently seeking a part time Principal Clinical Psychologist to join our In-Patient Locked Rehabilitation Service for People with Intellectual Disabilities and Neurodevelopmental Disorders at The Huntercombe Hospital, Eldertree Lodge, located approximately 6 miles from Market Drayton and just 11 miles from Stoke-on-Trent and within one mile from the A53.  We would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt; NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position provides an opportunity for a Senior Clinical Psychologist wanting to progress their career within the field of learning disabilities. However, we will also consider applications from Clinical Psychologists who are earlier in their career who wish to progress within this field and support you through structured development plan.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eldertree Lodge:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Eldertree Lodge is a Specialist Rehabilitation Hospital providing services for men with Neurodevelopmental Disorders and Intellectual Disabilities and Challenging Behaviors and a Service for Women with Intellectual Disabilities and Complex Care Needs. Eldertree Lodge provides specialist care to male and female service users who are detained under the Mental Health Act (1983) who typically present with Borderline, Mild or Moderate Intellectual Disability, along with other co-morbid mental health needs including, but not limited to, Autism Spectrum Disorder, Personality Disorder, Psychosis and Complex Challenging Behaviors. There are three clinical pathways at Eldertree Lodge: (a) Low Dependency Male Neurodevelopmental, (b) High Dependency Male Neurodevelopmental, and, (c) Female Complex Care.&lt;/p&gt;\n&lt;p&gt;The Hospital employs 250 staff for 41 beds spread across six wards supported by a Multi-Disciplinary Team comprising Psychiatry, Occupational Therapy, Speech &amp; Language Therapy and a Psychology Team currently comprising a Consultant Clinical Psychologist and 3 Assistant Psychologists. At Eldertree Lodge, we have developed a strong focus on Positive Behavior Support to service users supported by a team of PBS Coaches and Practice Leaders.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred via NHS and local authoritiesand we play an integral part in contributing to new models of care outlined in the Five Year Forward View and Transforming Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Principal Clinical Psychologist, who has the ability to work autonomously within the context of a multi-disciplinary team, who will be responsible for the delivery of specialist psychological assessments and interventions to service users admitted to Eldertree Lodge.&lt;/p&gt;\n&lt;p&gt;Your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing highly specialist psychological assessments of newly-referred and newly-admitted patients to Eldertree Lodge hospital&lt;/li&gt;\n&lt;li&gt;Working alongside the Consultant Clinical Psychologist and other professionals to ensure that treatment programs are delivered effectively, efficiently and in a timely manner&lt;/li&gt;\n&lt;li&gt;Developing and implementing psychological treatment and evaluation plans&lt;/li&gt;\n&lt;li&gt;Monitoring, reviewing and developing therapeutic interventions, individual support guidelines and behavioral support programs&lt;/li&gt;\n&lt;li&gt;Developing and implementing appropriate individual and group-based psychological treatment programs consistent within individual psychological formulations and to supervise assistant psychologists and other staff where they have a role in such provision&lt;/li&gt;\n&lt;li&gt;Ensuring the provision of specialist psychological advice, guidance and consultation to other members of the multi-disciplinary team contributing directly to any patient’s formulation, diagnosis, treatment plan and admission or discharge decisions, and the dissemination of information about psychological research and theory to other members of the MDT&lt;/li&gt;\n&lt;li&gt;Undertaking appropriate risk assessment and risk management plans for allocated patients and to provide advice to other members of the multi-disciplinary team regarding psychological aspects of risk assessment and management&lt;/li&gt;\n&lt;li&gt;providing written reports on psychological assessments, formulation and treatment for internal and external patient reviews&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To join The Huntercombe Group as a Principal Clinical Psychologist&lt;/strong&gt; &lt;strong&gt;you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold a current HCPC registration as a Clinical Psychologist.&lt;/li&gt;\n&lt;li&gt;Hold a post-graduate Doctorate in Clinical Psychology (or its equivalent for those trained prior to 1996 or those in lateral transfer) as accredited by the BPsS.&lt;/li&gt;\n&lt;li&gt;Have a good understanding of the Mental Health Act (1983) and registration requirements for the hospital and work within the requirements of such legislation.&lt;/li&gt;\n&lt;li&gt;Be able to provide evidence based practice of improving patient clinical outcomes.&lt;/li&gt;\n&lt;li&gt;Have an understanding of and practical application of psychology models.&lt;/li&gt;\n&lt;li&gt;Be flexible and adaptable, well organized and able to manage time and workload effectively in line with the needs of the service.&lt;/li&gt;\n&lt;li&gt;Have a desire to expand your professional development and support organiaational change.&lt;/li&gt;\n&lt;li&gt;Have a legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;As a service we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An opportunity to work with a varied and interesting patient group.&lt;/li&gt;\n&lt;li&gt;An opportunity to develop systemic ways of working within the service in particular trauma informed care and reflective practice.&lt;/li&gt;\n&lt;li&gt;1:1 monthly clinical supervision.&lt;/li&gt;\n&lt;li&gt;Study leave and access to continual professional development.&lt;/li&gt;\n&lt;li&gt;Flexible working arrangements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working Pattern: 15 - 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a company we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Employee Assistance Program (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, STOKE ON TRENT", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245981", "validThrough": "2020-11-29T23:59:59+0000"}