{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T16:01:42+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM /SECONDMENT FOR 12 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated, experienced, passionate and dynamic nurse to join our team for a 12 month secondment covering maternity leave. The successful post holder would provide expert professional and clinical leadership to the Teenage and Young Adult (TYA) Cancer services based from the Principal Treatment Centre for Wales at the University Hospital of Wales, Cardiff. Post-holders will be responsible for all elements of the nursing services related to TYA cancer care.&lt;/p&gt;\n&lt;p&gt;The Principle Treatment Centre hosts an 8 bedded inpatient ward, day care and developing ambulatory care facility for TYA cancer patients undergoing chemotherapy and cellular therapy treatment. The unit is a fast moving and progressive area which actively supports nurse led initiatives. The post holder would provide expert clinical nursing leadership, support and education to all staff involved in the care of TYA cancer patients.&lt;/p&gt;\n&lt;p&gt;Working closely with the TYA Lead Clinician, the post holder will lead the development of excellence in nursing care for teenagers and young adults with cancer and their families across Wales. With the TYA Lead Clinician, the post holder would be expected to work alongside cancer leads from across the Network to ensure all young people in Wales have access to specialist TYA cancer services, including discussion at the TYA Multi-disciplinary Team Meeting. The post holder will act as an expert advisor to the Cancer Networks, third sector organisations, specialist commissioners and local clinical teams; providing leadership, nursing advice, service planning and strategic decision making for TYA cancer services in Wales.&lt;/p&gt;\n&lt;p&gt;The post holder will work in conjunction with the Teenage Cancer Trust to lead service improvement and review practices in line with evidence and national policy to ensure excellence in clinical care for Teenagers and Young Adults with cancer and their families.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated leader who will be required to work autonomously and exercise a high level of clinical expertise when leading and advising the many teams on the specific needs of teenage and young adult cancer patients. You will need excellent communication, interpersonal skills, expert knowledge of TYA cancers and the ability to work sensitively and collaboratively with diverse teams.&lt;/p&gt;\n&lt;p&gt;Above all we are looking for individuals who share our values;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about people we serve and the people we work with.&lt;/li&gt;\n&lt;li&gt;We trust and respect one another.&lt;/li&gt;\n&lt;li&gt;We take personal responsibility.&lt;/li&gt;\n&lt;li&gt;We act with integrity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Proctor &lt;br /&gt;jennifer.proctor@wales.nhs.uk&lt;br /&gt;(029) 21841785&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Wales, Cardiff", "postalCode": "CF14 3UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.499", "longitude": "-3.19007"}}, "title": "Teenage Cancer Trust Senior Nurse for Wales", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245315", "validThrough": "2020-11-10T23:59:59+0000"}