{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum pro rata inc HCA"}}, "datePosted": "2020-11-04T15:16:23+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Band 6 Occupational Therapist within our Frailty/ Older Person&#96;s Clinic team. The role will cover frailty, general medicine, falls prevention, older persons medicine and palliative care.&lt;/p&gt;\n&lt;p&gt;We are looking for an Occupational Therapist who is keen to gain clinical experience as a Band 6 within a forward thinking and supportive Multidisciplinary Team consisting of Occupational Therapist, Physiotherapist, Mental Health Nurse, Nurse and various Consultant Geriatricians. The team works together to achieve both positive patient experience and outcomes.&lt;/p&gt;\n&lt;p&gt;As part of our frailty service you will report to a OPC Team Lead and you will be able to access senior OT professional support and opportunities for clinical and professional training and development. There will be opportunities to enhance skills in cognitive and behavioural assessments as part specialist occupational therapy training.&lt;/p&gt;\n&lt;p&gt;You will need excellent communication and time management skills, and sound clinical knowledge. A flexible approach is required to accommodate the changing needs of the service along with the drive to influence service development.&lt;/p&gt;\n&lt;p&gt;We are passionate about patient centred care, support our clinicians to lead and deliver excellent and compassionate services and value our clinical teams as the real heart of the NHS.&lt;/p&gt;\n&lt;p&gt;Working as an autonomous clinician and as an integral part of the Multidisciplinary team (MDT) you will be responsible for assessing patients, discussing patient agreed goals and expectations, deliver highly skilled treatments and provide education for patients and carers.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will be confident with appropriate NHS experience, clearly able to demonstrate a desire to actively participate in all aspects of the role. They must be willing and able to lead on various elements of the work in this exciting and demanding community area of OT. The successful candidate must be an effective team player with excellent communication and organizational skills. They will be able to demonstrate clear clinical reasoning and have the ability to explain their decisions and actions in a way that all concerned will be able to understand. They must also be able to demonstrate evidence of recent learning and examples of continued professional and clinical development.&lt;/p&gt;\n&lt;p&gt;The role will enable the development of a broad range of skills to support your career progression. Band 6 level role will provide you with a well-rounded set of clinical skills and an opportunity to promote the value and positive impact Occupational Therapy can have on peoples lives.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beaumont House | Mile End Hospital, LONDON", "postalCode": "E1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5245", "longitude": "-.04262"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256388", "validThrough": "2020-11-22T23:59:59+0000"}