{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-26T12:16:36+0000", "description": "&lt;p&gt;NHS Wales Shared Services has an exciting vacancy part time working 25 hors per week within Payroll Services based in Companies House Cardiff. The successful post holder will work as part of team providing a comprehensive payroll service to employees working within NHS Wales Organisation as part of the South East Wales Overpayment Team.&lt;/p&gt;\n&lt;p&gt;The successful post holder will need an in depth knowledge of Agenda for Change Terms and Conditions of Service; Medical and Dental Terms and Conditions of Service; NHS Pension; Electronic Staff Record (ESR) and All Wales Employment Related Policies.&lt;/p&gt;\n&lt;p&gt;In addition, knowledge of statutory payments; statutory deductions; attachment of earnings orders; salary sacrifice and voluntary deductions is essential.&lt;/p&gt;\n&lt;p&gt;The Post Holder will need to be proficient in the use and application of Excel spreadsheets therefore a qualification in Excel and an ability to demonstrate sound experience working in Excel is essential.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to determine calculate overpayments (gross to net overpayments), prepare detailed calculations and respond to employee enquires with empathy.&lt;/p&gt;\n&lt;p&gt;Whilst the post holder will work as part of a team, there is the scope to work on a self managed basis.&lt;/p&gt;\n&lt;p&gt;Previous experience working within a busy payroll team with an ability to work to strict payroll deadlines is essential.&lt;/p&gt;\n&lt;p&gt;A good standard of education is required, but qualifications 5 GCSE(s) or equivalent which must include maths and English. In addition must have an IT Qualification including Microsoft Excel.&lt;/p&gt;\n&lt;p&gt;This is a AFC Band 4 Part Time Position working 25 hours per week - Monday - Friday. Employment benefits include generous annual leave entitlement, opportunity for membership into the NHS Pension Scheme and flexible working arrangements.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Clive ConnellyJob titleSenior Payroll SupservisorEmail addressClive.connelly@wales.nhs.ukTelephone number02920 903994&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127554.jpg", "name": "NHS Wales Shared Services Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Companies House, Crown Way, Cardiff, Cardiff", "postalCode": "CF15 7QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5659", "longitude": "-3.27787"}}, "title": "Senior Payroll Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242376", "validThrough": "2020-11-09T23:59:59+0000"}