{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20407", "minValue": "20407", "unitText": "YEAR", "value": "£12.14 per hour"}}, "datePosted": "2020-10-29T10:34:29+0000", "description": "&lt;p&gt;Do you have a passion to deliver exceptional Community-based therapy and support to our service users to improve their quality of life and optimise their function? If the answer is yes, you could be the one for us!&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic and innovative staff to join our busy and dynamic bank team, working to prevent hospital admissions for service users and to facilitate a timely hospital discharge to their homes when safe to do so. You will work in a Community setting (usually in service user’s homes) to promote independence and choice for our service users and their carers, providing help with activities of daily living, improving service users mobility and supervising and progressing home exercise programmes.&lt;/p&gt;\n&lt;p&gt;These bank roles are Primarily based at Patchway Clinic Thirlmere Road, Patchway but would be covering visits to patients homes in and around Yate/Thornbury/Filton areas. However you may also be asked to cover shifts for the Kingswood Team based in Downend Clinic, covering visits to patients homes in and around Downend, Hanham, Marchfield, Coalpit heath areas&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This is essentially a carer/HCA role visiting service users in their homes and providing them with support.&lt;/li&gt;\n&lt;li&gt;You will need to be a car driver (with business use insurance)&lt;/li&gt;\n&lt;li&gt;Previous experience of care/community work is essential&lt;/li&gt;\n&lt;li&gt;The shifts needed to be covered are split shifts (8:30-13:00 and 18:30-21:30) or a combination of mornings/evening shifts. Pretty flexible so we can have a discussion about different work patterns if required&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for those registering with the Bank we will offer:-&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexibility –&lt;/strong&gt;the number of shifts worked can be allocated according to your availability to suit your lifestyle and personal commitments&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekend shifts&lt;/strong&gt;- if you wish, with the opportunity for extra income through our enhanced weekend rates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Earning extra money&lt;/strong&gt;– through opportunities for further additional hours or extra shifts if you wish.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paid business mileage&lt;/strong&gt;- payable from an agreed base. You need to have access to a car with a full driving license to work within our community roles.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A structured and supportive training programme&lt;/strong&gt;- including job/skill specific training to support you fully in the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Good rates of pay&lt;/strong&gt;- enhancements paid for unsocial hours over weekends and Bank holidays. (Bank rates include annual leave supplement)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to chat further about this Bank opportunity, please contact the Sirona Bank team to discuss the hours, shifts and any other questions you may have in regards to this exciting opportunity on 03001245445 / sirona.bankteam@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Glos &amp; North Bristol", "postalCode": "BS34 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5317", "longitude": "-2.57349"}}, "title": "Bank Rehabilitation Support Worker Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247934", "validThrough": "2020-11-30T23:59:59+0000"}