{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-30T14:15:21+0000", "description": "&lt;p&gt;NAViGO Health and Social Care CIC provide health and social care services to a population of 158,000. We are a progressive and ambitious organisation that aims to support those living with a mental health illness, their carers and families in the simplest and most effective ways. We are different because we know working with the same methods doesn’t work forever; and we will continue to challenge the way we do things to create the best services that are centred on the people who use them.&lt;/p&gt;\n&lt;p&gt;Working together across Humber, Coast and Vale&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Why should you work for us?&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CQC overall rating GOOD 2018 – with two services rated Outstanding&lt;/li&gt;\n&lt;li&gt;We are the 25th Best Not-for-Profit Organisation to Work For in The Sunday Times Top 100 Best Not-for-profit UK Companies to work for 2019 - our fifth straight year in the top 100&lt;/li&gt;\n&lt;li&gt;Winners of The Sunday Times Wellbeing Award for commitment to employee health and welfare 2019&lt;/li&gt;\n&lt;li&gt;We are one of the top 75 best organisations to work for in Yorkshire and Humber region 2019&lt;/li&gt;\n&lt;li&gt;Outstanding national NHS Staff Survey 2018&lt;/li&gt;\n&lt;li&gt;Crisis Home Treatment service for older people accredited by the Royal College of Psychiatrists’ 2018&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Awarded for ‘Excellence in DBT’ from the Association for Psychological Therapies 2018&lt;/li&gt;\n&lt;li&gt;&#39;Highly Commended&#39; organisation in the James Legal Solicitors Inspiring Business 2019 Awards&lt;/li&gt;\n&lt;li&gt;NAViGO Simply You team crowned Heart Awards Business in Community winners 2018&lt;/li&gt;\n&lt;li&gt;Performance Team ‘highly commended’ in the best use of data category - Health Tech Awards 2018&lt;/li&gt;\n&lt;li&gt;Mental Health category winner - Medipex Awards 2018&lt;/li&gt;\n&lt;li&gt;Mental health services in North East Lincolnshire have been rated as amongst the best in the country by the people who use them&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Performance &amp; Assurance Team Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;37.5 hours/week Monday - Friday (flexible hours between 8.30am and 5pm)&lt;/p&gt;\n&lt;p&gt;Job Share considered&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A vacancy has arisen within NAViGO’s Assurance Team for a full time Band 4 Administrator based at NAViGO House. The team supports Governance and Assurance throughout the organisation including clinical audit, care quality commission inspection and policies. This role will play a pivotal part in this agenda by providing high quality administrative support to the team including minute taking at high level committees, conducting and organising audits, and coordinating policy ratification and version control. The post will also work closely with the Director of Nursing and Quality and the Quality Manager to provide administrative support to serious incident investigations and structured judgement reviews. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an opportunity for administrators/secretaries working for NAViGO or other local health providers to gain experience within an interesting and busy environment providing support to clinical teams and helping to make genuine, quality improvements to the services we provide to local people using mental health services. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NVQ level 3 in Business Administration, GCSE grades A-C in English and Maths and typing/word processing skills are essential. The successful candidate will also possess excellent communication and interpersonal skills and an ability to keep calm and work under their own initiate. Attention to detail, a high level of accuracy and analytical skills are also essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NAViGO has been named as one of the Sunday Times Top 100 Best Companies to work for over the past four years. Benefits include voting rights as part of the NAViGO Membership, discounted membership at local health facilities, lease car scheme, generous annual leave, in house-occupational health department, and access to the NHS pension scheme. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job share will be considered for those seeking part time hours.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please see Job Description for Further details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information or an informal discussion please telephone Cath McMain, Audit Lead on 01472 583004.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All positions are subject to the receipt of satisfactory references and medical clearance. Evidence of valid professional registration and appropriate DBS clearances will also be required where relevant. All posts will also be subject to successful completion of a 12 week probationary period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that all new employees joining NAViGO will be able to contribute to the NHS pension.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is classed as exempted for the purposes of the Rehabilitation of Offenders Act 1974, even those convictions that are classed as spent must be declared on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will ensure that all applicants are contacted within 2 weeks of the closing date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Navigo will keep details of unsuccessful applicants on file for a period of 6 months. Where further positions arise which we believe may be suitable we may contact those applicants with information and to advise of the further vacancy, should they wish to apply. Application at this subsequent stage/position would be voluntary and via open competition. Applicants may opt out of this by informing the recruitment team via NHS Jobs if they do not wish for details to be retained for this purpose.&lt;/p&gt;\n&lt;p&gt;NAViGO CIC takes its responsibility for the Safeguarding of Children &amp; Adults at risk seriously. Every member of staff must comply with the NAViGO Safeguarding policies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NAViGO CiC Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 0QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5631", "longitude": "-.088785"}}, "title": "Performance &amp; Assurance Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250492", "validThrough": "2020-11-13T23:59:59+0000"}