{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T08:45:45+0000", "description": "&lt;p&gt;&lt;strong&gt;We are currently recruiting for a Band 6 Community Sister, within Hambleton and Richmondshire District Nursing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced registered Nurse to apply for a District Nursing Sister which will be attached to a Primary Care Network (PCN), to lead and provide coordinated care through integrated teams.&lt;/p&gt;\n&lt;p&gt;Primary Care Networks signal a significant change in the way practices interact not only with each other, but the wider health and social care system. This will enable the traditional barriers to the delivery of health and care to be broken down to enable care to be delivered to a defined patient population, in a different way to meet the needs of that population, focused on prevention and personalisation of care, making best use of resources collectively.&lt;/p&gt;\n&lt;p&gt;The NHS Long Term Plan introduced PCNs as essential building blocks of every Integrated Care System. The postholder will have responsibility for leading and managing the community nursing workforce.&lt;/p&gt;\n&lt;p&gt;The District Nursing Sister is expected to provide exceptional clinical care, innovative practice and support to the Clinical Lead to our ever developing teams. This role will provide the opportunity to work closely with GP practices and other partners, in supporting patients with highly complex and often high acuity needs to prevent unnecessary hospital admission. This role requires an experienced clinician with excellent leadership, team working and communication skills, proven experience in the management of patients within the community setting and be expected to lead by example in delivering effective evidence based care to a defined demographic population with diverse health care and social needs.&lt;/p&gt;\n&lt;p&gt;The successful candidate need to be prepared to adapt to the changing needs of the Trust and the community models of care as they arise.&lt;/p&gt;\n&lt;p&gt;The centre is committed to providing the right candidate with a development programme that will not only enhance their academic qualifications and nursing interests, but will also provide an excellent foundation for professional development, as well as gaining an insight into the intra-organisational structure and processes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Penny Hutchinson (Clinical Lead)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 07814 901554 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: penny.hutchinson3@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Units 12/14 Omega Business Park, Throughout Hambleton &amp; Richmondshire", "postalCode": "DL6 2NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3507", "longitude": "-1.43824"}}, "title": "Community Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245756", "validThrough": "2020-11-11T23:59:59+0000"}