{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS"}}, "datePosted": "2020-10-26T10:01:32+0000", "description": "&lt;p&gt;An exciting opportunity exists to lead a team of psychologists in offering brief psychological and non psychological interventions to service users who have been assessed and who may be suitable for formal psychological therapy. You will lead on offering clinical inteventions and on advising the HAABIT (assessment team) members on whether psychological or other interventions will be useful to their referred clients.&lt;/p&gt;\n&lt;p&gt;The post will involve devising a programme of group and individual resources to be offered both phsycially and virtually to service users.&lt;/p&gt;\n&lt;p&gt;The B.I.T. (Brief Interventions Team) is a vital component of HAABIT (Havering Access Assessment and Brief Interventions Team ) which enables service users to gain access to psychological support sooner and so limits waiting times and reduces risks. You will be supported by up to three further wte clinical/counselling psychologists and managed by The Care Pathway Lead for MAP (Mood, Anxiety and Personailty) Psychology.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Probationary Period&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assessment/Interview info&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Starting with NELFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;High Cost Area Supplement – London&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameWill CraneJob titleCare Pathway Lead - Mood, Anxiety and Personality (MAP)Email addresswill.crane@nelft.nhs.ukTelephone number03903738943&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havering MAP within HAABIT Oasis House and Petersfield Centre, Havering", "postalCode": "RM3 9PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6056", "longitude": ".232396"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241952", "validThrough": "2020-11-09T23:59:59+0000"}