{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T14:57:14+0000", "description": "&lt;p&gt;The Inclusion Directorate with Midlands Partnership NHS Foundation provides Integrated Mental Health and Psychosocial teams into 10 prisons across Staffordshire and Worcestershire.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to expand our multi-disciplinary teams with the Staffordshire and Worcestershire prisons. As part of this expansion weare looking for compassionate and highly skilled RMN’s to join us. Working in prisons is both challenging and rewarding. This is an opportunity to work with some very interesting people with complex mental health needs. Working in prisons is a fantastic opportunity to make a positive difference to the lives of people who are often disadvantaged and vulnerable.&lt;/p&gt;\n&lt;p&gt;Successful applicants will work as part of a full multi-disciplinary and fully integrated Mental Health and Substance Misuse Service. Interventions are offered in line with a stepped care model with a single point of access for prisoners experiencing mental health or substance misuse difficulties.&lt;/p&gt;\n&lt;p&gt;As a senior Mental Health Nurse with the team you will need to have a sound knowledge of The Mental Health Act and its application to sentenced and remand prisoners. You will need to be confident in managing a caseload of people with complex mental health difficulties and to be able to offer supervision, support and guidance to junior members of the team.&lt;/p&gt;\n&lt;p&gt;If you are interested in this opportunity we would love to hear from you. If you are unsure about the prison environment we are happy to arrange for you to visit teams within the prisons.&lt;/p&gt;\n&lt;p&gt;Please contact aaron.parke@mpft.nhs.uk or call 01283 829 431 or antia.thomas@mpft.nhs.uk if you would like to discuss further.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132074.png", "name": "Inclusion", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Dovegate", "postalCode": "ST14 8XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8708", "longitude": "-1.78227"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247065", "validThrough": "2020-11-17T23:59:59+0000"}