{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "49,036"}}, "datePosted": "2020-10-21T15:58:01+0100", "description": "&lt;p&gt;Applications are invited for the post of Research Fellow in Sarcoma with Vascular Access and Renal Transplant Surgery. This post will commence on 6th October 2021 on a fixed term basis for 12 months, under the Trust’s Terms &amp; Conditions of Service for Junior Specialist Doctors at Higher (ST3+ level).&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;p&gt;The post holder will be expected to enrol in a full-time PhD programme for a probationary period of one year, extended on evidence of satisfactory progress in research studies and clinical performance as part of the renal transplant service on call commitment. The PhD programme will be allied to the Sarcoma Unit at Queen Elizabeth Hospital, Birmingham (Supervisor – Mr Samuel J Ford) and the School of Biomedical Sciences at the University of Birmingham.&lt;/p&gt;\n&lt;p&gt;The post-holder will contribute to the clinical activities of the vascular access and renal transplant clinical team. There is some opportunity to gain exposure to a broad range of surgical oncology.&lt;/p&gt;\n&lt;p&gt;The post is expected to provide excellent high volume operative experience allowing supervised training in vascular surgery and anastomotic techniques (greater than 400 procedures are performed within the unit per year).&lt;/p&gt;\n&lt;p&gt;This year we anticipate there being 200 renal transplants in total, the majority of which occur during daylight hours enabling the post-holder to gain significant exposure to renal transplantation over the course of this post. There will be ample exposure to live donor and recipient transplant surgery and the provision of peri-operative care for renal patients with twice daily combined medical/surgical ward rounds.&lt;/p&gt;\n&lt;p&gt;This would ideally suit a trainee surgeon with an interest in vascular or transplant surgery.&lt;/p&gt;\n&lt;p&gt;The post will participate on the on-call rota.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further information please contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Miss C Pattenden, Consultant Surgeon 0121 371 5851&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please submit an online application, ensuring you attach a copy of your CV.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 1NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4702", "longitude": "-1.91569"}}, "title": "Research Fellow-Sarcoma with Vascular Access and Renal Transplant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237180", "validThrough": "2020-11-11T23:59:59+0000"}