{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24540", "minValue": "19940", "unitText": "YEAR", "value": "£19,940 - £24,540"}}, "datePosted": "2020-10-23T20:36:45+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Health Link Worker - SFTV&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: &lt;/strong&gt;22.5 hrs per week, fixed term contract to December 2021&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £19,940 - £24,540&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Tees Valley&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the successful candidate you will work as part of a team supporting the delivery of the Health Link element of the Step Forward Tees Valley programme in Tees Valley.&lt;/p&gt;\n&lt;p&gt;You will have responsibility for supporting participants to accept, adjust to and where able recover from physical and/or mental health conditions. Working with them through every stage of their journey, you will enable them to address barriers to engagement and introduce activities to support progression into education and employment.&lt;/p&gt;\n&lt;p&gt;The position will be based across the Middlesbrough and Darlington area.&lt;/p&gt;\n&lt;p&gt;Step Forward Tees Valley is joint funded by the National Lottery Community Fund and European Social Fund and aims to support people with a health barrier across Tees Valley.&lt;/p&gt;\n&lt;p&gt;The project is led by Humankind and supported by a number of partner organisations with a well-established commitment to support people to overcome the complex reasons preventing them from finding work. These barriers could include physical or mental ill health, a lack of self-confidence, a gap in skills, a conviction or an addiction.&lt;/p&gt;\n&lt;p&gt;Mental Health Concern is a registered charity that provides a broad range of services, supporting people with mental health problems to live valued lives. Primarily based in the North East of England and employing over 260 staff, we are commissioned by the NHS and Local Authorities to provide a wide range of specialist services.&lt;/p&gt;\n&lt;p&gt;Further information on the project and MHC can be found by visiting SFTeesValley.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would like to hear from you if you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If you are an experienced Health Link Worker/Social Prescriber&lt;/li&gt;\n&lt;li&gt;Possess up to date knowledge of how mental health and related issues can affect adults&lt;/li&gt;\n&lt;li&gt;Have experience of effective action planning&lt;/li&gt;\n&lt;li&gt;Are able to work to deliver required performance targets&lt;/li&gt;\n&lt;li&gt;Are able to develop positive relationships with individuals, colleagues, and partnership organisations&lt;/li&gt;\n&lt;li&gt;Have strong interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is essential that you are able to meet the travel requirements of the post. Additional hours may occasionally be required to meet organisational deadlines.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer in return: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days annual leave plus bank holidays (rising with length in service) and with the opportunity to purchase more&lt;/li&gt;\n&lt;li&gt;A comprehensive induction and ongoing training, development and supervision&lt;/li&gt;\n&lt;li&gt;A supportive culture that values work-life balance&lt;/li&gt;\n&lt;li&gt;Access to LifeWorks, which provides excellent corporate discounts on shopping, cinema tickets and restaurants&lt;/li&gt;\n&lt;li&gt;An Employee Assistance Programme which offers 24/7 financial, legal and personal advice, including free access to counselling where required&lt;/li&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Family friendly policies including enhanced maternity, paternity and adoption pay&lt;/li&gt;\n&lt;li&gt;Cycle to Work scheme&lt;/li&gt;\n&lt;li&gt;Death in Service Insurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information / informal chat about this post, please contact Danielle Hatton (Team Lead) on 07718565679 who will be more than happy to speak to you.&lt;/p&gt;\n&lt;p&gt;Please apply through the NHS Jobs website. Please note, all correspondence will be through the email address or phone number(s) provided on your application form. To avoid missing our emails, please regularly check your Junk Mail folders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for applications is &lt;strong&gt;8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on &lt;strong&gt;16th November 2020 &lt;/strong&gt;for shortlisted candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post is subject to an enhanced DBS check, which we will cover the cost of.&lt;/em&gt; &lt;em&gt;Concern Group reserves the right to close the vacancy prior to the closing date if a large volume of applications is received.&lt;/em&gt; &lt;em&gt;If you have not heard from us within 6 weeks of applying, please assume you have been unsuccessful on this occasion.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mental Health Concern", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130357"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tees Valley", "postalCode": "TS2 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5802", "longitude": "-1.23502"}}, "title": "Health Link Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241523", "validThrough": "2020-11-08T23:59:59+0000"}