{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-02T11:20:41+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT CELLULAR HISTOPATHOLOGIST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ROYAL DEVON &amp; EXETER NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date - 4th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Devon and Exeter NHS Foundation Trust are seeking to appoint substantive Consultant Cellular Pathologists with subspecialty interests. The posts are fully job planned for 10 PAs (8.5 PAs Direct Clinical Care and 1.5 PAs for Supporting Professional Activities).&lt;/p&gt;\n&lt;p&gt;The Trust is a designated Cancer Centre providing a comprehensive range of tertiary referral services. The department of Cellular pathology is progressive, friendly and supportive, currently comprising sixteen pathologists (15.41 WTE). The department implements a system of flexible subspecialist reporting to support specialist Cancer Services &amp; MDMs. Typically each consultant covers 2-3 specialist areas and will have close working relationships with their clinical teams.&lt;/p&gt;\n&lt;p&gt;The department annually reports 34,000 histopathology requests and 3,500 diagnostic cytology requests. Workload is recorded using the RCPath Workload points system.&lt;/p&gt;\n&lt;p&gt;The department is UKAS (ISO15189) accredited and the laboratory is fully staffed to include two experienced Advanced Practitioners in Histopathology Specimen Dissection, who handle a range of benign and malignant specimens. In addition, the department also has a Consultant BMS with the Advanced Specialist Diploma in Diagnostic Cytology.&lt;/p&gt;\n&lt;p&gt;Exeter has developed molecular genetic services for cancer diagnostics locally and in conjunction with the regional service at Bristol. The Trust has been a core site for Genomics England 100,000 Genomes Project and is active in clinical research, supporting a number of clinical trials which take place in the onsite NIHR clinical research facility. Candidates with an interest in academia would be welcomed.&lt;/p&gt;\n&lt;p&gt;The department is fully involved in regional post-graduate Histopathology Training and is an established exam centre for the Royal Collage of Pathologists. The Trust has close links with the University of Exeter Medical School and the department takes an active part in undergraduate training. The appointees will be required to teach medical students.&lt;/p&gt;\n&lt;p&gt;The Royal Devon &amp; Exeter NHS Foundation Trust hosts an HTA licensed mortuary and is a regional forensic centre. The department undertook 500 Coronial autopsies last year and has facilities for high risk cases. The coronial workload attracts an above average tariff and candidates with an interest in autopsy pathology would be encouraged.&lt;/p&gt;\n&lt;p&gt;In our latest full CQC inspection, the Royal Devon &amp; Exeter NHS Foundation Trust received an overall rating of “good” and “outstanding” for Emergency and Critical Care services, and for Caring Trust wide. Cellular pathology is also member of a clinical/operational delivery network with five other NHS trusts within the South West Peninsula, developing sustainable, high quality diagnostic services across the region. The South West Peninsula network has developed a business case for a digital pathology network and LIMS spanning the Peninsula. In addition, the Trust has just implemented &lt;em&gt;MyCare,&lt;/em&gt; a state-of-the-art Electronic Patient Record and Laboratory Information Management System.&lt;/p&gt;\n&lt;p&gt;The vibrant Cathedral city of Exeter has theatres, pubs and cinemas, as well as a highly rated University (Russell Group), good Ofsted rated schools, independent schools and abundant family amenities. It is situated in the middle of the South West Region with easy access to the countryside including Dartmoor and coast of Devon and Cornwall. It is well served by rail, road and air links.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Consultant in Histopathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251758", "validThrough": "2020-12-04T23:59:59+0000"}