{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-23T13:00:42+0100", "description": "&lt;p&gt;University Hospitals Birmingham NHS Foundation Trust are looking to appoint two highly motivated and enthusiastic Audiologists (2.0wte) to join our busy, friendly multidisciplinary team. We are striving to deliver excellence in patient care and management and are looking for two Audiologists to complement our Team. The successful candidates will have the ability to be flexible, possess excellent, organisational and communication skills and to provide a professional service to staff, patients, relatives and carers at all times in these varied and challenging roles. Working on their own initiative combined with the ability to constantly prioritise changing workloads is a must. An understanding for the need for discretion and diplomacy in a confidential setting are also essential. They will have a 1:1 or 2:1 BSC in Audiology or equivalent qualification. Duties will include the assessment and rehabilitation of adults and paediatrics with balance and hearing problems referred to the Trust including ENT support. The Audiology department comprises of adults, implantable devices, paediatrics, balance, hearing therapy and a complex needs adults service. If the successful candidates are motivated there are opportunities to receive training and support within these specialist areas. We are committed to continuing professional and personal development through appraisal. We have excellent administrative support. The post holders will be based at Heartlands Hospital but the roles also cover clinics at Solihull and Good Hope Hospitals and in Community settings.&lt;/p&gt;\n&lt;p&gt;For further information please contact Milica Marjanovic, Adult Audiology Lead&lt;/p&gt;\n&lt;p&gt;Email address: milica.marjanovic@heartofengland.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 0121 424 2874&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Audiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240616", "validThrough": "2020-11-10T23:59:59+0000"}