{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45998", "minValue": "40074", "unitText": "YEAR", "value": "£40,074 - £45,998 Per annum (pro rata)"}}, "datePosted": "2020-11-02T14:01:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Number: 919-SH-23546342-EXT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Senior Partnerships Support Manager&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Marketing Directorate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; Normal permanent base for this is Wellington House, London SE1, but for the foreseeable future, the post holder will be required to work from home in line with current Govt COVID-19 restrictions. IT will be provided&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£40,074 - £45,998&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; Fixed term : 31 March 2021 with possible extension of contract for a further 6 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 16/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead nationally, and enable locally, a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health. It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally independent manner.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;PHE’s Health Marketing &amp; Public Engagement team creates award-winning social marketing programmes that help save lives. A significant element of our social marketing strategy involves working in partnership working with partners in the private, public, and NGO/charity sector to deliver major behaviour change campaigns.&lt;/p&gt;\n&lt;p&gt;We are looking for a proactive individual to support our partnerships programme. The role involves supporting the Deputy Director of Partnerships with operational management, from business planning, finance and developing our online hub for partners.&lt;/p&gt;\n&lt;p&gt;It would suit either a business support professional who would like to develop an understanding of marketing, or a marketing professional with a flair for financial management who is looking to develop team leadership skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Some experience of stakeholder management or marketing, as well as a good understanding of the local government or NHS context would be a real advantage.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post, please email toni.bennett@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria, including required competencies, which are included at the back of the job description.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Toni Bennett Email address toni.bennett@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Senior Partnerships Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252319", "validThrough": "2020-11-16T23:59:59+0000"}