{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-21T09:45:44+0100", "description": "&lt;p&gt;Applications are invited for a Consultant Haematologist post. This is a substantive joint post between East &amp; North Hertfordshire NHS Trust (ENHT) and University College London Hospital. NHS Foundation Trust (UCLH).The post comprises 10 programmed activities (PA) and an on-call commitment.&lt;/p&gt;\n&lt;p&gt;We have an excellent opportunity for the post above within the haematology department at ENHT. The appointee will join four Consultants to plan, develop and provide haematology services for ENHT and will spend one day per week at UCLH. An interest in haemato-oncology with a subspecialty interest in chronic lymphocytic leukaemia is desirable. The post-holder will participate in the on call rota which is 1 in 5.&lt;/p&gt;\n&lt;p&gt;This post will be based four days per week (8 PA) at ENHT and one day per week (2 PA) at UCLH. The new Consultant Haematologist will have an office and secretarial support at the Lister Hospital. Candidates seeking a part time appointment are welcomed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a dynamic, energetic, forward thinking consultant to provide haematology services for the changing hospital environment. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The appointee will join four consultant colleagues - Dr Judith Hanslip, Dr Muhammad Hasan, Dr Xenofon Papanikolaou and Dr Anupama Jaggia - in a progressive department.&lt;/p&gt;\n&lt;p&gt;The post will offer the opportunity to work one day per week in the department of haematology at University College London Hospital, a major tertiary centre for haematology.&lt;/p&gt;\n&lt;p&gt;Applicants must be licenced to practice on the General Medical Council (GMC) Full and Specialist Register, with a current licence to practise or be eligible for registration within six months of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Ashish NarulaAdditional contact information&lt;span&gt;Potential applicants are invited to visit the hospital by arrangement.&lt;/span&gt;&lt;span&gt;Please contact Dr Ashish Narula on 01438 288040 or Dr Momin Ahmed on 01438 314333 ext 5804. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: 6th December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235710", "validThrough": "2020-12-06T23:59:59+0000"}