{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19335", "minValue": "1200", "unitText": "YEAR", "value": "£19,335 per annum (inclusive of £1200 LD allow"}}, "datePosted": "2020-10-16T17:05:41+0100", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then aSupport Worker at The Woodhousecould be the right choice for you.&lt;/p&gt;\n&lt;p&gt;Whether you are looking for a new career or are already work in healthcare through the NHS or private care, you’ll receive training to join the team as aSupport Workerwhere you will be valued and supported, with career development opportunities available.&lt;/p&gt;\n&lt;p&gt;You will join the team that works well together to provide care to Men and women with Learningdisabilities. Whether you are have been aHealthcare Assistant or Care Worker, you will utilise your experience to support people to lead a valued and fulfilled life.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve; being able to do something today that they couldn’t do last week because of you.&lt;/p&gt;\n&lt;p&gt;The Elysium Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities in abundance. With a huge range of courses that will see you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: The Woodhouse, Lockwood Road, Cheadle, Staffordshire ST10 4QU&lt;/p&gt;\n&lt;p&gt;Working alongside a multidisciplinary team, you’ll provide person-centred care for male and female patientswith a learning disability/ autism or personality disorder. Gaining experience across low secure and locked rehabilitation environments to support better health and greater independence.&lt;/p&gt;\n&lt;p&gt;The Woodhouse haverecentlyopened a new 5 bed unit for females with Learningdisabilities, they may also have autism orpersonalitydisorders. You’ll work in environments ranging from small village cottages, where independent living skills can be developed, to 8 bedded units that facilitate the development of daily living skills. The service values positive risk-taking opportunities within a context of robust risk assessment and management to ensure those we support are kept safe.&lt;/p&gt;\n&lt;p&gt;The Woodhouse is located near Cheadle in Staffordshire, which is commutable from Derby, Stoke-on-Trent, Uttoxeter and surrounding areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annueal Salary of&lt;span&gt;£19,335&lt;/span&gt;per annum(inclusive of £1200 LD allowance)&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Well-being support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheadle", "postalCode": "ST10 4QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0003", "longitude": "-1.96242"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231223", "validThrough": "2020-11-30T23:59:59+0000"}