{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21000", "minValue": "18108", "unitText": "YEAR", "value": "£18,108 £21,000 FTE"}}, "datePosted": "2020-11-04T09:48:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Role:&lt;/strong&gt; Thrive Practitioner&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Cambian New Elizabethan School, Quarry Bank, Hartlebury, Worcestershire, DY11 7TE&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £21,000 pro rata (Actual £18,104)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;: Full time – 40 Hrs per week, Mon –Fri. Term Time 40 weeks&lt;/p&gt;\n&lt;p&gt;The Cambian Group, the UK’s largest provider of specialist services in education, mental health rehabilitation and learning disabilities. We are looking for a &lt;strong&gt;Thrive Practitioner &lt;/strong&gt;who wants to join our established and dedicated team our clinical input is a fully integrated part of the whole package of support for the young people we are entrusted to educate.&lt;/p&gt;\n&lt;p&gt;Working with the Clinical &amp; Education team, you’ll spend your supporting the development, social and emotional and behavioural needs of young people to improve access to learning. You’ll have knowledge of children’s social and emotional development and have experience of working with children and young people with challenging behaviour.&lt;/p&gt;\n&lt;p&gt;This is no ordinary role, it’s fast paced and there’s lots of variety. You’ll need to have enthusiasm, motivation and passion for supporting young people to achieve their best. You must be able to remain positive under challenging circumstances and be willing to actively contribute to the wider life of the school.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate profile&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Willing to work towards at Licensed THRIVE practitioner status&lt;/li&gt;\n&lt;li&gt;Experience of supporting young people with ASD, SEN, ADHD, and SEMH needs&lt;/li&gt;\n&lt;li&gt;Experience of supporting the development of children&#39;s social and emotional development using the THRIVE approach&lt;/li&gt;\n&lt;li&gt;Excellent creative and structured delivery of the THRIVE approach within educational settings and/or special needs environment is essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full support from a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Regular clinical supervision&lt;/li&gt;\n&lt;li&gt;Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Research opportunities &amp; support&lt;/li&gt;\n&lt;li&gt;Internal/external training on new initiatives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also learn from some of the most dedicated and inspirational people in our profession.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cambian New Elizabethan School&lt;/strong&gt; is a day school that offers outstanding opportunities for boys and girls with a diagnosis of communication difficulties, autism spectrum conditions, complex needs, challenging behaviour, and other associated conditions. We have 45 students on roll, aged 7 – 19 who come from a range of Local Authorities within a reasonable travelling distance of the school. Our school is very popular with parents and Local Authorities.&lt;/p&gt;\n&lt;p&gt;Set in large, private grounds amid a campus of historic buildings in rural Hartlebury, Worcestershire, Cambian New Elizabethan School is a relaxing place of learning, where young people receive the specialist education and combined multidisciplinary care they need from our onsite team of Clinical experts consisting of Speech and Language Therapists, Occupational Therapist, Mental Health Practitioner and a Therapeutic Education Assistant who provides the link between the education and therapeutic input.&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to meet the person specification in order to be offered this post.&lt;/p&gt;\n&lt;p&gt;Cambian is committed to Safeguarding and protecting the young people and service users within our care.&lt;/p&gt;\n&lt;p&gt;All candidates will be subject to an&lt;strong&gt;enhanced DBS check&lt;/strong&gt;and&lt;strong&gt;reference checks&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Cambian is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note vacancy may close prior to this date if a large number of applications are received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartlebury, Worcestershire", "postalCode": "DY11 7TE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3344", "longitude": "-2.23597"}}, "title": "Thrive Practitioner - New Elizabethan School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255253", "validThrough": "2020-11-18T23:59:59+0000"}