{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,615"}}, "datePosted": "2020-11-02T11:01:35+0000", "description": "&lt;p&gt;PPE/Monitoring &amp; Scrutiny Officer - Aneurin Bevan Community Health Council&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt;Band 5 – Salary from £24,214 - £30,615 per annum&lt;/p&gt;\n&lt;p&gt;37.5 hrs (Monday – Friday)&lt;/p&gt;\n&lt;p&gt;Ability to speak Welsh – &lt;strong&gt;Desirable - Can deal with the public in most situations in Welsh but turns to English when policing/using technical terminology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Aneurin Bevan Community Health Council is seeking a full time PPE/Monitoring &amp; Scrutiny Officer based in our Cwmbran office. The successful candidate will be enthusiastic, dependable and have good knowledge of office practices. He/she will be flexible and adaptable in approach to the varying day to day demands of the role, able to work on his/her own initiative, and have an ability to prioritise workload and work to deadlines.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will need to manage their own workload and provide an effective and efficient support service for the CHC, its staff and members, responding to demands made from the public or the NHS health bodies and organisations. To work flexibly as part of a team to assist the CHC to carry out its range of duties and responsibilities. To assist the Chief Officer in the day to day management, organisation and future planning of the PPE/Citizen Engagement (CE) and Monitoring/Scrutiny functions across Gwent. To assist the Chief Officer in developing the interface between the CHC and patients and public. To work with CHC members and with NHS, voluntary sector and Local Authority stakeholder groups as appropriate and ongoing liaison with patients and the public. To develop and maintain the CHC visiting programmes with its monitoring committees. The post holder will be expected to undertake other generic CHC core activities as determined by the Chief Officer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact the Chief Officer – Angela Mutlow on 01633 838516.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela MutlowTelephone number01633838516&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aneurin Bevan CHC, Raglan House, Llantarnam Business Park, Cwmbran, NP44 3AB, Cwmbran", "postalCode": "NP44 3AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6326", "longitude": "-3.00843"}}, "title": "PPE/Monitoring &amp; Scrutiny Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251693", "validThrough": "2020-11-09T23:59:59+0000"}