{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738"}}, "datePosted": "2020-10-30T08:16:51+0000", "description": "&lt;p&gt;We currently have vacancies in the emergency department for Band 5 Staff Nurses. We are seeking enthusiastic, experienced and motivated individuals who will work well within our established nursing team. &lt;br /&gt; &lt;br /&gt; St Mary’s Hospital is the West London Major Trauma Centre (MTC), receiving the highest number of trauma calls brought in by the London Ambulance Service of all the four London MTCs. The Adult and Paediatric departments see in excess of 125,000 patients a year, with a resuscitation area, majors, and ambulatory assessment areas. The department is supported with a 40 bed admission unit and a 12 bed Clinical Decision Unit (CDU), both of which are separately staffed from the department but work in close cooperation. &lt;br /&gt; &lt;br /&gt; We are passionate supporters of our nursing team at every grade. The band 5 in ED is the ideal role in which to learn clinical skills, and St Mary’s has many opportunities for learning and development, including participation in the Capital Nurse QIS course. We support rotations to ITU, Paediatrics, Ambulatory Emergency Care and the clinical research team. We have a clear development pathway for career emergency nurses, including Masters’ programmes and ENP training. We want our staff to be fully rounded nurses, who are able to bring a large range of skills to the patients’ bedside from a broad portfolio of experience.&lt;br /&gt; &lt;br /&gt; Applicants should, as a minimum, have experience as a band 5 Staff Nurse in an acute area and be able to demonstrate some knowledge and enthusiasm for Emergency Nursing. The ability to administer IV drugs is essential. Venepuncture / Cannulation, and ILS are desirable but not essential. &lt;br /&gt; &lt;br /&gt; Applicants will need to demonstrate a dynamic, hardworking, and passionate approach to delivering high quality patient care. You will have the opportunity to work in all areas of the department, supported by the Matron and charge nurses, where you can develop your own clinical and management skills as you further your career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 5 Staff Nurse A&amp;E - MIC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249359", "validThrough": "2020-11-11T23:59:59+0000"}