{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "According to skills and experience"}}, "datePosted": "2020-10-23T13:09:05+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;WE ARE RECRUITING FOR A MEDICINES OPTIMISATION TECHNICIAN IN YORK&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity and a fresh, rewarding challenge has arisen for a Pharmacy Technician to join our GP Practice based Medicines Optimisation Team at Haxby Group in York. You will support the Medicines Optimisation Team in delivering a caring, quality service to the patients across our Primary Care Network.&lt;/p&gt;\n&lt;p&gt;Haxby Group is a friendly, mutually supportive Practice with 6 surgeries in York and 5 surgeries in Hull. We pride ourselves in the provision of a caring, quality service to all our patients. We are an Advanced Training Practice with a commitment to educate, nurture and develop a range of health care professionals both traditional and innovative. Our aim is to create a sustainable and productive environment for all of our clinicians to work in.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, flexible and reliable individual who is passionate about patient care. You will have the ability to communicate effectively with clinicians, patients and support staff. You will be a highly valued member of the team, receiving competitive benefits plus ongoing personal development and training opportunities in our high achieving environment.&lt;/p&gt;\n&lt;p&gt;For more information about these opportunities, please our website and social media links.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for.&lt;/p&gt;\n&lt;p&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Haxby Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO32 2LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0194", "longitude": "-1.08207"}}, "title": "Medicines Optimisation Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240656", "validThrough": "2020-11-08T23:59:59+0000"}