{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25100", "minValue": "22800", "unitText": "YEAR", "value": "£22,800 - £25,100 per annum"}}, "datePosted": "2020-10-27T14:05:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Trust Services Partner&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location: Manchester Royal Infirmary&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary: £22,800 - £25,100 per annum&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: All successfully shortlisted candidates will be invited to interview on 18th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This critical role for the local NHS Trust provides on-site customer support for the Trust ward managers and NHSP bank workers (flexible workers) ensuring all contact with NHSP is quick, simple and helpful. Both the ward manager and worker will look to the on-site Trust Services Team (TST) for support and will expect expert advice and guidance for prompt query resolution for any enquiry that the NHSP National Service Centre are unable to help with.&lt;/p&gt;\n&lt;p&gt;The aim of the on-site team is to facilitate filling bank shifts whilst ensuring the workers requirements are also met or exceeded. Key to success in this role is to establish strong working relationships with both the ward manager and flexible worker communities, prioritising pro-active tasks to pre-empt process or service issues with the end goal of delighting our customers; our aim is to be a &quot;customer obsessed&quot; organisation&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and maintain strong organisational knowledge of both NHSP and the local NHS Trust including contractual obligations and agreed performance metrics&lt;/li&gt;\n&lt;li&gt;Deliver and promote the high standards of NHSP to existing and potential flexible workers, acting as an NSHP ambassador&lt;/li&gt;\n&lt;li&gt;Connect, foster trust and establish ongoing relationships with key ward managers&lt;/li&gt;\n&lt;li&gt;Attend daily staffing meetings, bed meetings, staffing huddles with the ward managers and respond accordingly to both urgent and longer-term staffing needs&lt;/li&gt;\n&lt;li&gt;Regularly visit wards to check in on ward manager and flexible worker satisfaction and promote NHSP to potential new workers during visits&lt;/li&gt;\n&lt;li&gt;Support the ward manager and flexible workers through the booking process to ensure it is seamless and a great experience&lt;/li&gt;\n&lt;li&gt;Respond to requests and reports from central services regarding flexible worker or ward manager outstanding actions to ensure the worker application is processed quickly and shift fulfilment is optimised&lt;/li&gt;\n&lt;li&gt;Attend weekly/monthly central services calls to keep up to date with any operational issues that need to be resolved by the Trust Services Teams or new products/services that are being introduced&lt;/li&gt;\n&lt;li&gt;Run, interpret and present data to key contacts promoting success of contract delivery and pre-empting areas of underperformance. Suggest additional training and support for ward managers that need help with the process&lt;/li&gt;\n&lt;li&gt;Gather information regarding workforce issues and feedback to relevant departments to support effective workforce planning&lt;/li&gt;\n&lt;li&gt;Pro-actively ask for and review all customer feedback and act on both positive and negative comments. Follow the complaints process for any serious issues and ensure the local Senior Trust Services Partner is informed&lt;/li&gt;\n&lt;li&gt;Think creatively about the service provision, suggest ways to continuously improve the customer experience. Put forward innovative new ways of working to the Senior Trust Services Partner/Trust Services Area Manager and Strategic Account Manager for consideration&lt;/li&gt;\n&lt;li&gt;Embrace new ways of working, either systems or new processes, that are cascaded from central services. Ensure these are embedded within the timelines requested and the impact to the customer is positive&lt;/li&gt;\n&lt;li&gt;Look for new opportunities, such as new staffing groups or additional services that the Trust may benefit from and highlight these to the Trust Services Area Manager and Strategic Account Manager for consideration&lt;/li&gt;\n&lt;li&gt;Support implementation of new service areas, such as additional staff groups or the introduction of new departments, ensuring a positive experience for both the ward manager and flexible worker&lt;/li&gt;\n&lt;li&gt;Own complaints, incident reporting and feedback through to resolution in line with the NHSP processes and complaint procedures and where necessary the flexible worker disciplinary process&lt;/li&gt;\n&lt;li&gt;Run worker clinics to deal with issues and maintain a sense of worker community support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What perks are we offering in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary with the opportunity for progression for exceptional performers&lt;/li&gt;\n&lt;li&gt;27 days’ annual leave per year plus 8 public holidays&lt;/li&gt;\n&lt;li&gt;Access to a stakeholder pension scheme&lt;/li&gt;\n&lt;li&gt;Health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Agile working&lt;/li&gt;\n&lt;li&gt;Access to a discount scheme and an employee recognition scheme.&lt;/li&gt;\n&lt;li&gt;Ability to buy and sell annual leave&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Corporate Staff", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120988"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust Based", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Trust Services Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244872", "validThrough": "2020-11-10T23:59:59+0000"}