{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15969", "minValue": "15129", "unitText": "YEAR", "value": "£9.00-£9.50/Hr + Co Benefits, Pension + Parking"}}, "datePosted": "2020-11-05T10:11:55+0000", "description": "&lt;p&gt;To provide support to Northern Healthcare Service Users in line with the Organisation’s aim to provide a high quality, reliable support service tailored to suit each of our service users individual support plans, whilst promoting independence and choice.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Role description and Key duties&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be working in one of our 24 hour supported living, mental health rehabilitation units. This role will be full time, 12-hour shifts, rotating on days (8am-8pm) and waking nights (8pm-8am).&lt;/p&gt;\n&lt;p&gt;You will be caring, compassionate and committed to provide the support that allows our clients to lead ordinary lives. A positive attitude, friendly, caring &amp; understanding nature are an absolute must.&lt;/p&gt;\n&lt;p&gt;You will assist the Service Manager to organise the day to day running of the service provision through the policies, training, supervision and guidance provided by the company.&lt;/p&gt;\n&lt;p&gt;You will maintain care skills at a current level and undertake such training and development as may from time-to-time be required to maintain practices as up-to-date.&lt;/p&gt;\n&lt;p&gt;You will support the manager in achieving the aims and objectives of the Company and maintaining the level of quality of service provided to the service users.&lt;/p&gt;\n&lt;p&gt;You will provide care in accordance with current best practices, according to policy and procedures, agreed standards, legislative requirements, relevant regulations under the direction of the Manager, and within the financial plans agreed from time-to-time.&lt;/p&gt;\n&lt;p&gt;You will supervise the care services within the unit in accordance with agreed standards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Develop effective working relationships with Unit Management&lt;/li&gt;\n&lt;li&gt;Support an open, positive and inclusive Management culture&lt;/li&gt;\n&lt;li&gt;Participate in the development of the Unit’s policies&lt;/li&gt;\n&lt;li&gt;Participate in the evaluation of the Unit against agreed organisational goals, as we all business and quality objectives&lt;/li&gt;\n&lt;li&gt;Work to establish effective employer-employee relationships&lt;/li&gt;\n&lt;li&gt;Minimise legal risks&lt;/li&gt;\n&lt;li&gt;Participate in the maintenance of The Home’s management information systems&lt;/li&gt;\n&lt;li&gt;Assist in the formulation and implementation of care policies and procedures&lt;/li&gt;\n&lt;li&gt;Assist in the implementation and maintenance of the standards required by legislation related to the registration of the unit&lt;/li&gt;\n&lt;li&gt;To maintain confidentiality at all times and carry out the Company’s confidentiality Policy.&lt;/li&gt;\n&lt;li&gt;To manage day to day service provision by producing detailed work schedules for care workers and providing written and verbal instructions and guidance.&lt;/li&gt;\n&lt;li&gt;Systematically solve day-to-day problematical issues which arise&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;br /&gt;Ideally, you will have proven supported living experience and have achieved or currently working towards your level 2 or 3 in Health and Social Care.&lt;/p&gt;\n&lt;p&gt;If you have the drive and passion in putting people first, then we&#39;d like to hear from you.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, we will pay for you to complete an enhanced Disclosure &amp; Barring Service (DBS) check, prior to starting with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135974.JPG", "name": "Northern Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shipley", "postalCode": "BD18 1BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8346", "longitude": "-1.76782"}}, "title": "Team Leader (Shipley)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257174", "validThrough": "2020-12-31T23:59:59+0000"}