{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T08:16:21+0000", "description": "&lt;p&gt;An ideal opportunity has arisen for an enthusiastic and committed individual to gain specialised skills in a senior role. We are looking for a motivated Pharmacy Technician to join the technical services team within Oncology Pharmacy.&lt;/p&gt;\n&lt;p&gt;You will join a team of oncology pharmacists, technicians and assistants who are committed to the development of pharmacy services to cancer patients and will have the opportunity to participate in new initiatives to improve our service to this patient group.&lt;/p&gt;\n&lt;p&gt;You should possess excellent communication skills with an awareness of the challenges of working within a healthcare setting, be visible and accessible with quality and standards as your priority. You will need to be flexible and resilient in order to cope with the demands of the role.&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated individual with excellent interpersonal and communication skills, be able to plan and work independently as well as being a good team player.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;You will be based at Tunbridge Well’s hospital within the pharmacy department.&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role or to arrange a visit please contact:&lt;/p&gt;\n&lt;p&gt;Hayley Rees Chief Pharmacy Technician Chemotherapy services on 01622 222056 or&lt;/p&gt;\n&lt;p&gt;E-mail: Hayley.rees2@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHayley ReesJob titleChief Pharmacy Technician Chemotherapy servicesEmail addressHayley.rees2@nhs.netTelephone number01622 222056&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Senior Oncology Technician - Chemotherapy Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249340", "validThrough": "2020-11-13T23:59:59+0000"}