{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-13T10:01:34+0100", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT IN COLORECTAL AND GENERAL SURGERY WITH INTEREST IN BENIGN COLORECTAL DISEASE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Substantive 10 PA Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; “Excellent integrated care for you and your family, when and where you need it”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Croydon Health Services provides a broad range of elective and emergency services to a population of 385,000 across the Croydon University Hospital and Purley War Memorial Hospital. The General Surgery department includes Colorectal, Upper Gastrointestinal, Endocrine, Vascular and Breast surgery. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Department of General Surgery wishes to appoint a substantive Consultant in Colorectal and General Surgery with an interest in Benign Colorectal Disease. This is a new post in addition to the 4 current substantive Colorectal Surgery consultants and will provide emergency on-call commitments on a 1:10 basis and regular endoscopy lists. The post has been developed in response to an increasing demand in pelvic floor, proctology, inflammatory bowel disease and joint endometriosis services. This post is not intended to provide regular cancer resectional surgery. The post-holder is expected to work closely within multidisciplinary teams including healthcare professionals spanning the Urogynaecology, Gynaecology and Gastroenterology departments. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants require both general and colorectal elective and emergency surgical competencies, as well as JAG certification in colonoscopy. A post-CCT fellowship and/or consultant-level experience in endometriosis, pelvic floor and inflammatory surgery is desirable. &lt;/strong&gt;The successful applicant should have an audit and research portfolio, with an ongoing interest in expanding the portfolio and experience in establishing research trials. They should also demonstrate management responsibilities and a significant commitment to teaching and training of junior staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should either already be on the Specialist Register of the General Medical Council (GMC), or within six months of eligibility to be included, and hold a license to practice. Please see the attached Person Specification for further details of essential and desirable criteria for the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details or informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Said Mohamed, Consultant Colorectal and General Surgeon, Clinic Lead&lt;/p&gt;\n&lt;p&gt;Email: said.mohamed1@nhs.net&lt;/p&gt;\n&lt;p&gt;Secretary: 0208 401 3979&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Miss Stella Vig, Consultant Vascular and General Surgeon, Clinical Director&lt;/p&gt;\n&lt;p&gt;Email: stella.vig@nhs.net&lt;/p&gt;\n&lt;p&gt;Secretary: 020 8401 3115&lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Consultant Colorectal Surgeon (Perm)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223668", "validThrough": "2020-11-08T23:59:59+0000"}