{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-11-06T10:31:08+0000", "description": "&lt;p&gt;Arden &amp; GEM is one of the largest Commissioning Support Units in the country. Our customers include more than 60 Clinical Commissioning Groups (CCG), NHS England/Improvement, local authorities and a range of care providers.&lt;/p&gt;\n&lt;p&gt;With offices throughout the Midlands, North West and South East we cover a core geographic patch that extends to Greater Manchester in the north and Essex in the south. Our services are built on a strong foundation of experienced people who build great relationships, a commitment to NHS values and a thorough understanding of our clients and the challenges they face.&lt;/p&gt;\n&lt;p&gt;We provide real value to our customers by working at scale, creating the synergies and innovation that ultimately drives improved patient outcomes and makes commissioning resources work harder.&lt;/p&gt;\n&lt;p&gt;The post is to work closely with the South West Regional NHSE/I Direct commissioning team, developing reports and processes to meet their information requirements. The post is based in a small team providing expert information analysis and insight to inform decision making and service redesign across the South West region.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFaizel MahomedJob titleSenior Manager DPRU ConsultancyEmail addressfaizel.mahomed@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127894.jpg", "name": "NHS Arden and Greater East Midlands Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3rd floor, South Plaza Marlborough Street, Bristol", "postalCode": "BS1 3NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.46", "longitude": "-2.59169"}}, "title": "Commissioning Analysis Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259227", "validThrough": "2020-11-20T23:59:59+0000"}