{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T16:01:40+0000", "description": "&lt;p&gt;Its a great time to be join the Early Intervention in Psychosis (EIP) Service as we have been awarded Mental Health funding to expand the service. This will enable us to increase the interventions provided and enable us to improve awareness of first episode of psychosis across the county leading to early referral and treatment to EIP&lt;/p&gt;\n&lt;p&gt;We provide comprehensive multi-disciplinary services and work closely with local specialist mental health teams, Children and Young Persons Mental Health Services, tertiary service providers, primary care, local statutory and non-statutory agencies, service users and carers and educational establishments. The EIP Service forms part of the Community Recovery Care Group Directorate.&lt;/p&gt;\n&lt;p&gt;The Early Intervention Services is a community service that provides assessments and NICE concordant interventions for people aged 14-65 years who present with suspected first episode of psychosis across Kent and Medway. There is an exciting opportunity for a full time and part time Band 6 RMN or Occupational Therapist to join the team - covering West Kent (based at Heathside, Coxheath). The Band 6 Community Mental Health Practitioner will need relevant experience, and be motivated to work within and contribute to the continued development of this exciting service. Experience of working with the older client group where a differential diagnosis may be indicated as opposed to first episode of psychosis would be beneficial however not essential.&lt;/p&gt;\n&lt;p&gt;Care Coordinators have capped caseloads to allow for innovative and focused interventions in partnership with service users, families and carers promoting recovery, social inclusion and well-being. &lt;br /&gt;&lt;br /&gt;Experience of working directly with people with psychosis is essential. Applicants need to be able to work flexibly, creatively and be responsive to the needs of this client group and their carers.&lt;/p&gt;\n&lt;p&gt;The Access and Waiting Time standards ensure that people are offered NICE concordant Interventions early in their treatment. Our service aims to work alongside individuals and their families by adopting strength and recovery based approach which maximises self-determination, and empowerment. There is a high level of individual and family work, as well as various group work activities including linking in with many partner organisations and professionals with an increasing emphasis on co production.&lt;/p&gt;\n&lt;p&gt;Are you someone who has a passion for working with adults with acute mental illness? Do you want to develop your knowledge, skills and expertise to ensure that we deliver high quality, person centred care at the right time and in the right place?&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated and flexible nurse to join our established team of staff, ensuring our patients are offered holistic care and support, which encompasses their physical and mental health needs.&lt;/p&gt;\n&lt;p&gt;You will need to&lt;/p&gt;\n&lt;p&gt;- Have a strong desire to support us to develop this service in a rapidly changing climate&lt;/p&gt;\n&lt;p&gt;- Have an interest in supporting the physical health of people&lt;/p&gt;\n&lt;p&gt;- Be willing to work in a challenging environment&lt;/p&gt;\n&lt;p&gt;- Be willing to engage in audit and evaluation&lt;/p&gt;\n&lt;p&gt;- Be part of a team wishing to always improve the user experience of mental health services&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hayley Miles, Team Leader EIP&lt;/p&gt;\n&lt;p&gt;Email: Hayley.Miles2@nhs.net, Telephone: 0300 303 3189&lt;/p&gt;\n&lt;p&gt;Collette Chamberlain, EIPs Service Manager, Telephone: 01227 812390&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heathside, Maidstone", "postalCode": "ME17 4AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.232", "longitude": ".497974"}}, "title": "Community Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243299", "validThrough": "2020-11-09T23:59:59+0000"}