{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 inc HCAs"}}, "datePosted": "2020-10-13T12:29:12+0100", "description": "&lt;p&gt;We are seeking to recruit a qualified AHP or Nurse to work as part of our integrated team within primary care,supporting people with long-term physical and mental health issues to maximise their potential and well-being.&lt;/p&gt;\n&lt;p&gt;Based within the Surrey Downs area, the successful candidate will have a minimum of three years experience working within community mental health services, andpossess an ability to work autonomously within a primary care community setting. You will be able to facilitate MH assessments, and formulate diagnosis and treatment/post diagnostic plans with the supervising Consultant Psychiatrist.&lt;/p&gt;\n&lt;p&gt;You will also possess an ability to foster excellent relationships between primary and secondary care services, whilst offering a high standard of care provision for the person using our service and the person&#39;s carers or family members.&lt;/p&gt;\n&lt;p&gt;The successfulcandidate will be able to demonstrate a person centred approach to practice, enabling independence and avoiding hospital admissions where possible.&lt;/p&gt;\n&lt;p&gt;Excellent risk assessment and communication, are an essential skill set for candidates, along with a willingness to problem solve and signpost to other services, where appropriate.&lt;/p&gt;\n&lt;p&gt;In return you will gain experience of working acrossprimaryteams, and associated services/agencies, where you will be able to share your knowledge and skills through facilitating training sessions, and you will be able to access training and development opportunities within Primary and secondary care. You will be supported by your line manager and a consultant psychiatrist.&lt;/p&gt;\n&lt;p&gt;If you would like to know more about this post, please contactIvana Flitton.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey Downs", "postalCode": "KT19 8GT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3393", "longitude": "-.301017"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224261", "validThrough": "2020-11-09T23:59:59+0000"}