{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5 dependent on experience"}}, "datePosted": "2020-10-07T14:50:47+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Surgical Ward | Band 5 dependent on experience | Southbank | Full Time or Part time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an exciting opportunity to develop your skills across a range of surgical specialities and we are currently undertaking cancer surgery in association with the NHS, including colorectal, urology, and breast. Other specialities include orthopaedics, cosmetic and general surgery.&lt;/p&gt;\n&lt;p&gt;Spire South Bank Hospital has been in operation for 30 years providing quality private healthcare to the local population and beyond, earning a reputation as a leader in Worcestershire. We work with some of the areas most experienced Consultant Surgeons, Anaesthetists and Physicians to deliver tailored, personalised care. We are proud of the positive patient feedback we receive and are currently undertaking refurbishment of our in-patient bedrooms following significant recentinvestment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining this high performing team of experienced nurses who constantly receive excellent patient satisfaction feedback&lt;/p&gt;\n&lt;p&gt;Delivering excellent patient care to pre and post-surgical patients. Working on a ratio of 1 nurse to 5 or 6 patients giving you the time to give complete care to your patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Jillian Fraser at illian.fraser@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR5 3YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1812", "longitude": "-2.21601"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217004", "validThrough": "2020-11-07T23:59:59+0000"}