{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T12:16:46+0000", "description": "&lt;p&gt;We are looking for a dedicated, positive individual, to join a group of innovative, inspiring Occupational Therapists to support Occupational Therapy provision within Northumberland CYPS, Neuro-developmental Pathway.&lt;/p&gt;\n&lt;p&gt;The post holder will work in community settings, providing assessment and intervention packages for children and their families referred to the service with neuro developmental issues and related mental health difficulties.&lt;/p&gt;\n&lt;p&gt;The post holder’s main duties are to contribute to the neuro developmental assessment clinic and provide Occupational Therapy to children and families in clinic settings, service users’ homes, schools and other educational environments.&lt;/p&gt;\n&lt;p&gt;Close liaison with carers, teachers, and professionals from statutory and voluntary sector is a key role.&lt;/p&gt;\n&lt;p&gt;Current Covid restrictions are being creatively and effectively managed in service delivery and are opening up new and exciting ways of working.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work independently but as part of a multi-disciplinary team, helping colleagues to arrive at a robust formulation and contributing to the young person’s journey, using principles and values of Occupational Therapy.&lt;/p&gt;\n&lt;p&gt;The post holder would be expected to demonstrate an understanding of a range of clinical conditions related to children and young people’s mental health, and to offer an occupational perspective to their assessment and intervention.&lt;/p&gt;\n&lt;p&gt;A knowledge of Occupational Therapy theories, models and approaches relevant to the clinical setting alongside more generic perspectives is expected of the individual.&lt;/p&gt;\n&lt;p&gt;The post holder will be clinically supervised and supported by a Professional Lead, Band 7 Occupational Therapist and line managed by the Team Manager for the South East and West locality.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to provide clinical supervision for a Band 5 Occupational Therapist and/or support level staff where necessary.&lt;/p&gt;\n&lt;p&gt;In house training as well as mandatory training courses are accessible to all staff.&lt;/p&gt;\n&lt;p&gt;Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust provide services for people with mental health problems and for people with learning disabilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rosalyn Hamilton Occupational Therapy Lead Rosalyn.Hamilton@cntw.nhs.uk 01670502700&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Viv Cook Occupational Therapy lead&lt;/p&gt;\n&lt;p&gt;Rosalyn Hamilton Occupational Therapy lead&lt;/p&gt;\n&lt;p&gt;01670502700&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morpeth", "postalCode": "NE61 2NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1785", "longitude": "-1.68338"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246528", "validThrough": "2020-11-11T23:59:59+0000"}