{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T15:45:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Clinical Oncologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Full Time Consultant in Clinical Oncology (Breast and Brain tumour sites).&lt;/p&gt;\n&lt;p&gt;Following the appointment of the current postholder to a prestigious research appointment at a national cancer centre, applications are invited for a Clinical Oncologist with an interest in breast and brain malignancies.&lt;/p&gt;\n&lt;p&gt;We are also one of the few nationally accredited centres for SABR for the treatment of oligometastases and support and training can be provided for the successful candidate.&lt;/p&gt;\n&lt;p&gt;The University Hospitals of Leicester is one of eleven Trusts in the country to be selected to host the regional (East Midlands) Operational Delivery Network following the publication of the Radiotherapy Service Specification in January 2019.&lt;/p&gt;\n&lt;p&gt;The University Hospitals of Leicester’s Oncology service forms part of “SEMOC” (the South East Midlands Oncology Centre) which with Northampton General Hospital and Kettering General Hospital NHS Trust forms one of the UK’s largest oncology centres. We provide high quality patient care as well as being a leader in clinical trials and serve the 1.6 million joint population of Leicestershire, Rutland and Northamptonshire, ensuring a viable and dynamic service able to meet future specialist commissioning requirements.&lt;/p&gt;\n&lt;p&gt;Situated in the centre of the East Midlands this vacancy will be based at the University Hospitals of Leicester NHS Trust at the Leicester Royal Infirmary in the purpose-built Osborne Building.&lt;/p&gt;\n&lt;p&gt;The opportunity also exists for development of other specialist interests and these can be negotiated for the right candidate. In addition the successful candidate will be expected to become involved in other exciting initiatives such as research and trials.&lt;/p&gt;\n&lt;p&gt;The UHL department is integrated with the academic unit of the University of Leicester which has achieved Cancer Research UK cancer centre status and is one of the national Experimental Cancer Medicine Centres. The successful candidate therefore also has the potential to be involved with the University in an academic capacity.&lt;/p&gt;\n&lt;p&gt;UHL has strategic objectives which include building a world class reputation in research, education and training relevant to the diverse population in Leicester, delivering an excellent patient experience and ensuring UHL is fit for purpose. UHL has recently successfully bid to host the East Midlands Radiotherapy Network.&lt;/p&gt;\n&lt;p&gt;UHL’s purpose is to deliver “Caring at its best” for all the people who visit Leicester’s hospitals, either as patients, the public or as staff. As one of the largest and busiest teaching hospitals, our vision is to move from where we are now to where we want to be and the Trust’s newly published Quality Strategy is called “Becoming the Best”.&lt;/p&gt;\n&lt;p&gt;In becoming part of our team you too can show your commitment to the delivery of high quality services to patients with our Trust values.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Description pending royal college approval&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LRI, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Consultant Clinical Oncologist (Breast and Brain Malignancies)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245258", "validThrough": "2020-11-24T23:59:59+0000"}