{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 to £73,664 pa"}}, "datePosted": "2020-11-04T17:15:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Advert ADQI – November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Want to work for a Trust rated Good overall and Outstanding for Well-led? Want to work for an organisation where the health and wellbeing of our patients and our staff is paramount?&lt;/p&gt;\n&lt;p&gt;Then come to work for Lincolnshire Partnership NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We&#39;re recruiting to the post of Associate Director of Quality Improvement and are seeking an exceptional clinical leader to join us as the Associate Director for Quality Improvement. You will be passionate about delivering and sustaining improvements in the quality, safety and experience of care that we offer to our patients.&lt;/p&gt;\n&lt;p&gt;You will be the LPFT lead for quality improvement and governance spanning patient safety, clinical effectiveness, risk and patient experience helping us to continue our journey to outstanding. It’s an exciting time to join LPFT as we work to further enhance our quality improvement programme.&lt;/p&gt;\n&lt;p&gt;Based in an area of outstanding natural beauty, Lincolnshire is a great place to live and work.A county of contrasts from the city, to the countryside and even the Coast. Be inspired by miles of stunning coastline, natural beauty in the countryside, and the Cathedral City of Lincoln. With excellent schools, picturesque surroundings and obtainable housing, Lincolnshire offers a fantastic lifestyle that you may not have considered possible.&lt;/p&gt;\n&lt;p&gt;Each one of our 600 nurses is as valuable to us as the next. As well as the wealth of exclusive staff benefits available to nurses who choose to work with us, we feel passionately about supporting learning and development to enable our nurses to be the best they can be. Our nurses work across a range of inpatient and community settings, from child and adolescent services, through to working age, older adult and dementia care.&lt;/p&gt;\n&lt;p&gt;We have strong links with the University of Lincoln - voted Modern University of the Year by the Times, and alongside a brand new Medical School, has a range of nursing, psychology and social work courses available for staff to access and develop their skills. Bishop Grosseteste University also offers a range of business and teaching courses designed to support both academic and practical knowledge, many of which can be undertaken alongside your employment with us.&lt;/p&gt;\n&lt;p&gt;But don’t just take our word for it – the results of the national staff survey mean that we are rated number 2 in the UK as the best mental health trust and Lincoln has recently been crowned as the best UK city to raise a family.&lt;/p&gt;\n&lt;p&gt;Joining us, you’ll be part of a compassionate team, in a fantastic Trust, and supported every step of the way.&lt;/p&gt;\n&lt;p&gt;To arrange an informal discussion please contact Mark Halsall Deputy Director of Nursing and Quality at: m.halsall@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Negotiable", "postalCode": "LN1 1FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2443", "longitude": "-.558276"}}, "title": "Associate Director of Quality Improvement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256783", "validThrough": "2020-11-29T23:59:59+0000"}