{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-21T12:43:58+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Nuffield Health West End Medical centre currently have an internal opportunity for a Mammographer. Continue your journey with us whilst we’ll support you to be your best.&lt;br /&gt;&lt;br /&gt;The London West End Medical Centre is located in the heart of London, just off Harley Street. It is a mult-service medical centre that provides, health screening, GP services, physiotherapy and emotional well-being alongside our mammography service. The mammography service is provided to corporate and self-pay clients who are asymptomatic and above 40 years of age.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Whether you join us from the NHS or a private setting, you will find that we offer you an unrivaled opportunity to grow the respected career that you always wanted. You will benefit from our investment in state-of-the-art equipment and our commitment to give you more time with partners. As aMammographer you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver a high-quality diagnostic imaging service.&lt;/li&gt;\n&lt;li&gt;Working with leading practitioners and experiencing new practices, equipment and facilities.&lt;/li&gt;\n&lt;li&gt;Providing a service of the highest quality, delivered with sensitivity and compassion.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as amammographer you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;High levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail.&lt;/li&gt;\n&lt;li&gt;A caring nature – to see each patient as an individual and carry out this role with understanding and empathy.&lt;/li&gt;\n&lt;li&gt;A BSC degree in diagnostic radiography or equivalent to meet the registration requirements of the Health and Care Professions Council (HCPC)&lt;/li&gt;\n&lt;li&gt;A postgraduate qualification in an area of specialization.&lt;/li&gt;\n&lt;li&gt;Radiation Protection Supervisor training and/ or qualification are desirable.&lt;/li&gt;\n&lt;li&gt;Post registration experience relevant to the role.&lt;/li&gt;\n&lt;li&gt;Excellent communication and team working abilities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership acrossall ofour Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;Salary - £35, 000 - 45,0000pro rata (dependent on experience)&lt;br /&gt;Location - London West End Medical Centre&lt;/p&gt;\n&lt;p&gt;Hours - Part time, 16 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they arereceivedand interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications.Thereforeplease apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London West End", "postalCode": "W1G 9AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5177", "longitude": "-.148349"}}, "title": "Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236415", "validThrough": "2020-11-17T23:59:59+0000"}