{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38693", "minValue": "38693", "unitText": "YEAR", "value": "£38,693"}}, "datePosted": "2020-10-30T11:55:46+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Great place to live, great place to work&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Trust Doctor FY3/CT1 level in Acute and General Medicine&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;#SMALLTRUSTBIGAMBITION &lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for dynamic, ‘can do’ SHOs who want to gain a broad experience in acute, general and specialist medicine, whilst being offered the flexibility of hours, rotations and rostering to suit you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These rotations will parallel IMT 1 and 2 placements including the mandatory placements in Geriatric medicine (4 months), ITU (3 months) and Palliative care (3 months), as well all the chance to do 3-4 month placements in Emergency medicine, Acute Internal medicine, Cardiology, Respiratory medicine, Diabetes and Endocrinology, Gastroenterology, Stroke Medicine/Neurology, Haematology/Oncology and Rheumatology. We will provide all successful candidates with e-portfolios and the appropriate educational supervision to complete a record of training, designed to support progression to IMT3 posts and higher training. We will also provide the learning and training environment to support appointees attain MRCP and equivalent postgraduate examinations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants can choose to do all 24-months of this new innovative District Hospital Medical rotation, or dip in and out of the rotations. Appointees will be asked to commit to a minimum of 6-months in any single year. All appointees will need to join the on-call rotas, to include extended evenings (17:00 – 22:00 or 24:00), 7-day ward working and overnight and weekend daytime resident on-call. These extended sessions will allow intense periods of working, in turn allowing extended periods away.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Providing we can cover the service commitments we are willing to be flexible to any variations you suggest. Pairs of applicants doing job shares or working synchronised rosters can be accommodated (to allow synchronised leave). Proposed innovations include:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Annualised hours – this allows you to do intensive weeks / months, freeing you up for blocks of leave, whilst being paid to be away.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible working – doing 50% - 100% of the rosters&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Dipping in and out of rotations, completing one block, and then having the next block off.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible start and completion dates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Minimum commitment of 6 months in every 12.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a beautiful island to live and work on. ‘Work hard, play hard’ may have been invented for doing junior doctor placements here. Huge choices of water and land sports, peaceful coastal and inland walking, running and cycling routes, great local seafood and fresh produce, simply a great place to come and work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details of the proposed rotations, placements and rosters, please see the Job Description.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information or an informal chat please contact Dr Adam Feather – Divisional director for Medicine, &lt;/span&gt;&lt;span&gt;adam.feather1@nhs.net&lt;/span&gt;&lt;span&gt; or Mrs Katy Davis, Assistant Operational Manager for Medicine Associate Director of Operations, Medicine. &lt;/span&gt;&lt;span&gt;Both can be contacted via switchboard on 01983822099.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;#GREATPEOPLEGREATPLACE&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Trust Doctor FY2/CT level in Acute and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250044", "validThrough": "2020-11-29T23:59:59+0000"}