{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-11-05T16:16:27+0000", "description": "&lt;p&gt;The Haematology and Oncology Directorate invites applications for a position of Specialty Grade Doctor for 12 months with the possibility of extension. The post is within the Haematology Department. It is essential that applicants have a minimum of 2 years’ experience within General Medicine and have obtained at least Part 2 MRCP. Past NHS experience would also be preferred.&lt;br /&gt;&lt;br /&gt;The post is available initially for a 12 month period but can be extended by mutual agreement with the Clinical Lead or converted into a permanent post if necessary. This post provides excellent opportunities for a doctor with some Haematology experience to further their experience and skills in the exciting field of Haematology. Clinical responsibilities include inpatients, outpatients, day case. This post will include on call. This post will be ideal for candidates who want to pursue a career in Haematology.&lt;br /&gt;&lt;br /&gt;Kettering General Hospital Foundation Trust is an affiliated Teaching Hospital that provides services to over 360,000 people in North Northamptonshire. Since becoming a Foundation Trust in 2008, the hospital has embarked on a programme of progressive development and innovation.&lt;br /&gt;&lt;br /&gt;The post you are applying for will be subject to a Disclosure Barring Service check that is satisfactory and all other pre-employment checks that are required by the Trust. Only shortlisted candidates will be contacted&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Mark KwanAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Mark Kwan on 01536 492629&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hopsital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Specialty Doctor - Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258525", "validThrough": "2020-11-19T23:59:59+0000"}