{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-19T14:58:00+0100", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Relocation package up to £8K&lt;/p&gt;\n&lt;p&gt;Refer a friend scheme applies – both earn up to £500 – for existing staff&lt;/p&gt;\n&lt;p&gt;• Are you an experienced, committed and dynamic mental health professional who wants to use their skills to make a difference?&lt;/p&gt;\n&lt;p&gt;• Can you work effectively with those we care for, their families, clinicians, staff and other stakeholders to deliver exceptional quality care that changes people’s lives?&lt;/p&gt;\n&lt;p&gt;• Have you ever wanted to live and work in one of the UK’s most beautiful areas?&lt;/p&gt;\n&lt;p&gt;We’re searching for qualified and experienced community mental health nurses, social workers or occupational therapists for roles in our community mental health teams (CMHTs) across Devon.&lt;/p&gt;\n&lt;p&gt;Working as part of a multi-disciplinary team (MDT) you will use your skills, knowledge and understanding to deliver exceptional quality care for adults with moderate to severe mental health difficulties.&lt;/p&gt;\n&lt;p&gt;Our CMHTs are a fantastic place to work. You will be fully supported by the MDT in all your clinical decision-making and get dedicated weekly supervision for the psychologically informed clinical care you undertake.&lt;/p&gt;\n&lt;p&gt;Ideally you will have experience of community mental health work, but we also welcome applications from those of you who have worked in mental health inpatient settings&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining us as we begin to offer psychologically informed interventions as part of people’s care.&lt;/p&gt;\n&lt;p&gt;Development opportunities are also second to none as you’ll work jointly alongside all our clinical specialties&#39;, for example community eating disorder team, personality disorder service, university student mental health team and many more.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be passionate about making a difference to people’s lives. You will directly support people in their ongoing recovery, managing a defined and complex caseload on a care-coordination basis, providing expert assessment and treatment which fully involves families and carers where appropriate.&lt;/p&gt;\n&lt;p&gt;As a care-coordinator you will become an advocate for the people in your care, supporting and signposting them, so they can get back into employment or access housing, focusing on their recovery and helping them live the life they want to live.&lt;/p&gt;\n&lt;p&gt;If you have knowledge or formal training in CBT, DBT, or therapy associated with treatment of people with mental health difficulties, you will be able to apply these skills in your role.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate specific examples of how your involvement has improved patient care, patient experience and how you have inspired teams and organisations to change.&lt;/p&gt;\n&lt;p&gt;During your career you will have worked in a multi-disciplinary and multi-agency environment, where you will have involved people in shaping their services and care.&lt;/p&gt;\n&lt;p&gt;Personally, you will be a clear and confident communicator, capable of interacting and working effectively with people who use our services, their families and cares, staff and stakeholders from all backgrounds.&lt;/p&gt;\n&lt;p&gt;Working independently, you will make decisions that change lives.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Join us and you’ll be working in one of our community mental health teams, based in some great locations across Devon. Whether you like to work in the city, or prefer the draw of rural or beach locations, we’ll help you’ll find a job in an area to suit you and your lifestyle.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting in:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Devon&lt;/strong&gt;&lt;br /&gt; Barnstaple&lt;br /&gt; Bideford&lt;/p&gt;\n&lt;p&gt;Contact Brenda McAuley on 07970 272390 for more information or email brenda.mcauley@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mid Devon&lt;/strong&gt;&lt;br /&gt; Tiverton&lt;br /&gt; Crediton&lt;/p&gt;\n&lt;p&gt;Contact John Lilley on 07870 556 404 for more information or email john.lilley@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;East Devon&lt;/strong&gt;&lt;br /&gt; Exmouth&lt;br /&gt; Honiton&lt;br /&gt; Exeter&lt;/p&gt;\n&lt;p&gt;Contact John Lilley on 07870 556 404 for more information or email john.lilley@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Torbay&lt;/strong&gt;&lt;br /&gt; South and West Devon&lt;br /&gt; Newton Abbot&lt;br /&gt; Teignbridge&lt;br /&gt; Totnes&lt;br /&gt; South Hams&lt;/p&gt;\n&lt;p&gt;Contact Corinne Lee on 01626 884451 for more information or email corinne.lee@nhs.net&lt;/p&gt;\n&lt;p&gt;If you’re unsure which area is for you explore the Visit Devon website.&lt;/p&gt;\n&lt;p&gt;We are particularly interested in hearing from you if you would like to work in the beautiful areas of North and Mid Devon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE STATE IN THE FIRST LINE OF THE SUPPORTING INFORMATION ON YOUR APPLICATION THE AREA&#39;S FOR WHICH YOU WISH TO BE CONSIDERED&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;p&gt;• Wide range of leadership development opportunities&lt;br /&gt; • Commitment to flexible working where we can&lt;br /&gt; • 32 days (minimum) annual leave&lt;br /&gt; • Refer a friend scheme and both earn £500&lt;br /&gt; • Research opportunities&lt;br /&gt; • Generous NHS pension scheme&lt;br /&gt; • Access to free recovery and wellbeing courses from our Recovery College&lt;br /&gt; • Salary sacrifice cycle scheme&lt;br /&gt; • 24/7 Employee assistance programme&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Living in Devon offers you a fantastic lifestyle and a beautiful place to live and work – even your commute to work can lead you alongside the coast or over the moors. Throughout the county there are exceptional schools, and you’ll never be short of activities to fill your evenings and weekends – from cycling, walking and water sports to city shopping trips, theatre trips, bustling nightlife and great restaurants.&lt;/p&gt;\n&lt;p&gt;If you’re looking for an innovative and rewarding place to work, plus a beautiful place to live, then joining Devon Partnership NHS Trust is the right place for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Locations", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Senior Community Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232786", "validThrough": "2020-11-30T23:59:59+0000"}