{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-03T09:49:46+0000", "description": "&lt;p&gt;Octagon Medical Practice are looking for a Salaried GP for 8 sessions per week over 4 days at our Thorney &amp; Eye Surgery.&lt;/p&gt;\n&lt;p&gt;Using Systmone, we are dedicated to ensuring a manageable and sustainable work load and are successfully using workflow optimisation, triage and care navigation. Medication reviews are increasingly carried out by our clinical pharmacist. We host multiple other services and work closely with our local community teams.&lt;/p&gt;\n&lt;p&gt;We offer good rates of pay &amp; indemnity, 6 weeks annual leave per year (pro rata) regular meeting schedules to help with appraisal requirements, flexible ways of working and above all a kind and friendly team to support you in the challenges of modern general practice.&lt;/p&gt;\n&lt;p&gt;The post-holder will manage a caseload and deal with a wide range of health needs in a primary care setting, ensuring the highest standards of care for all registered and temporary patients. The post-holder will implement and lead on a full range of promotion and management of their own and others’ health and safety and infection control as defined in the practice health &amp; safety policy, the practice health &amp; safety manual, and the practice infection control policy and published procedures. They will support the equality, diversity and rights of patients, carers and colleagues.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge and the opportunity to make a difference, we would love to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Octagon Medical Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE6"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6556", "longitude": "-.196164"}}, "title": "Salaried GP - Thorney &amp; Eye Surgery - Octagon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253329", "validThrough": "2020-11-30T23:59:59+0000"}