{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T10:31:46+0000", "description": "&lt;p&gt;We are looking for an enthusiastic Dietitian to join our team of 26 community dietitians,&lt;br /&gt;assistant practitioners and admin staff working within our community services division.&lt;br /&gt;This is a rotational post based within the Community Services Division providing nutritional care within a variety of settings including outpatient clinics, care homes and patients own homes. You will manage a diverse clinical caseload incorporating nutritional support, frailty, chronic diseases, oncology, neurology and gastrointestinal disorders. Experience of enteral feeding and multidisciplinary working is essential. You will be supported to develop your knowledge and skills in Home Enteral Feeding with a view to supporting patients with feeding tubes in the community. You will also deliver general outpatient clinics and education sessions for patients and staff.&lt;/p&gt;\n&lt;p&gt;Multidisciplinary working and a patient centred approach is essential to providing holistic&lt;br /&gt;care within the community setting. We communicate and integrate well with multidisciplinary teams and the Neighbourhood Integrated Care Teams across Liverpool, which include other Allied Health Professionals, District Nurses, Social Services, Voluntary services and GP’s.&lt;/p&gt;\n&lt;p&gt;This post is based within the Liverpool team working across the city, and you will be given the opportunity to rotate within teams covering the north, south and central localities as well as supporting the ICRAS team. We also have a team of community Dietitians working within South Sefton as well as other Dietitians working within mental health, secure services and the Liverpool Diabetes Partnership. There is an opportunity to gain experience within these settings as appropriate.&lt;/p&gt;\n&lt;p&gt;We provide student training placements for students from the University of Chester and you will be expected to contribute to the delivery of our student training programme.&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 18th - 20th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSophie WestonJob titleTeam Lead, Community DietitianEmail addresssophie.weston@merseycare.nhs.ukTelephone number01512953868Additional contact information&lt;/p&gt;\n&lt;p&gt;Please call 0151 295 3868 to arrange a time to visit or contact Sophie Weston (Team Lead Dietitian) sophie.weston@merseycare.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Riverside Centre for Health, Liverpool", "postalCode": "L8 6QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3865", "longitude": "-2.97301"}}, "title": "Community Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246084", "validThrough": "2020-11-11T23:59:59+0000"}