{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pro rata, inc HCA"}}, "datePosted": "2020-10-29T11:00:53+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for suitable candidates to join our highly regarded critical care SLT team on the Denmark Hill site. The available post is fixed term maternity leave cover 0.7 WTE (12 months approx.) based on the Critical Care Units on the Denmark Hill, King’s College Hospital site. There is a possibility of additional bank or fixed term SLT sessions within the Trust. The post will work closely with the critical care MDT and will liaise with the speciality teams on transfer into and out of the critical care units. Speciality teams include Neurology, Medicine, Trauma, Neurorehabilitation, Health &amp; Ageing, Neurosurgery, Neurosurgery HDU, and Surgery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will provide Speech and Language Therapy services across the critical care units along with the SLT critical care team. Line management and clinical supervision will be provided by the critical care band 7 speech and language therapist. Clinical leadership will be provided by the band 8a.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post-holder will be required to participate in the team 7-day rota (maximum of 1 in 4 weekends).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Denmark Hill Speech and Language Therapy team works closely with SLTs on all King’s sites and the wider multidisciplinary teams, with whom they are co-located. The Department is led by the Head of Speech &amp; Language Therapy, and the Critical Care SLT team sits within the Acute SLT service led by the Principal SLT. The service offers an established supervision system, including action learning groups, plus a range of opportunities for learning and participation in both self and service development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that all our interviews will be carried out via Microsoft Teams due to Covid social distancing &amp; space demands.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Lynne Clark&lt;/p&gt;\n&lt;p&gt;Job title Clinical Lead SLT - Acute&lt;/p&gt;\n&lt;p&gt;Email address lynne.clark1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07787514051&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Speech and Language Therapist – Static Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248008", "validThrough": "2020-11-12T23:59:59+0000"}