{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-02T16:46:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;An exciting opportunity has arisen at CUH for a nurse with experience in paediatric rheumatology to join the Child and Adolescent East of England Rheumatology Service (CHEERS) in the role of clinical nurse specialist, providing NHSE specialist commissioned paediatric rheumatology care for the East of England region. Our service is provided by closely linked expert teams in Cambridge and Norwich and a shared care network with outreach clinics. &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will join a dynamic team with a fast growing service, fully committed to providing excellent care to the region&#39;s children and young people with rheumatology conditions. You will be the lead nurse based at Addenbrookes hospital, joining a team with two consultants, physiotherapy, OT, psychology, research nurse, pharmacist and secretarial support. We work closely with our patients/parents to shape and improve our service and we are rated highly in both patient feedback and national benchmarking.&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;There will be opportunities to access training relevant to the speciality, build relationships across the east of England Network (CHEERS) and support service development. You will work closely with the paediatric rheumatology consultants to provide excellent care to children from across the region who attend for outpatient appointments, infusions and inpatient admissions as well as supporting outreach clinics.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Closing date: 15 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held in the week commencing 23 November 2020&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lennina Alban&lt;br /&gt;Job title: Paediatric Rheumatology CNS&lt;br /&gt;Email address: lennina.alban@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 01223 254988&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Paediatric Rheumatology Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252925", "validThrough": "2020-11-15T23:59:59+0000"}