{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 to £37,267"}}, "datePosted": "2020-11-03T07:12:40+0000", "description": "&lt;p&gt;We are looking for an enthusiastic Dietitian to join Dietetic Paediatric team at East Lancashire Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;This is for a part time Paediatric Ward based post which also supports the Special school adjacent to the hospital. The post is for 15 hours and can be spread across 2 days or 3 days making it suitable for school hours.&lt;/p&gt;\n&lt;p&gt;The successful post holder will work in the paediatric dietetic team based at Royal Blackburn Hospital. The team consists of 2 x Band 7 (Team Leads), 6 x Band 6 (each with their own specialist clinical area), 1 x Band 5 (rotational) and 3 x band 3 Dietetic assistants.&lt;/p&gt;\n&lt;p&gt;The paediatric dietetic team work closely with their colleagues in the family division. The Child Health Service in East Lancashire is the largest centralised children’s service in the North West and one of the largest in the country. Centralized on the Royal Blackburn site are acute, surgical and emergency care. Inpatients includes a 51 bedded ward which includes 3 HDU beds, and a purpose built 15 bedded Children’s Observation and Assessment Unit (COAU). The Level 3 Neonatal Unit is one of two in the Lancashire and south Cumbria zone, and is covered by one of the Band 7’s in the team. There are 9 Community Paediatricians, 21 acute Paediatricians and 9 Consultant Neonatologists in East Lancashire.&lt;/p&gt;\n&lt;p&gt;The team is a part of the wider Dietetic Department. The Department has 78 Staff of which 45 are Dietitians and is well supported with Dietetic Assistants , Assistant Practitioners and admin staff. The department uses the elctronic patient record system EMIS.&lt;/p&gt;\n&lt;p&gt;The post holder would be expected to clinically supervise band 5 Dietitians and support staff. The department offers student training to A,B and C placements and the post holder will be expected to be involved in clinical teaching and assessment of students on their placement so therefore previous student training experience is desirable.&lt;/p&gt;\n&lt;p&gt;East Lancashire has good transport links to Manchester, Leeds, Liverpool and beyond and we are close to the Yorkshire Dales and the Lake District. Informal enquiries and visits welcome please contact Tara Green, Dietetic Manager, 01282 804700&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £44.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. However, if you are applying for a post as a BANK worker, the payment must be made in full at the time of employment checks. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTara GreenJob titleDietetic Operational ManagerEmail addresstara.green@elht.nhs.ukTelephone number01282 804700Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal enquiries welcome please contact Tara Green, Dietetic Manager, 01282 804700 or Paediatric clinical Leads Amanda Wall and Tim Reid on 01254 734059&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Paediatric Ward Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253113", "validThrough": "2020-11-18T23:59:59+0000"}