{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45753 - £51668"}}, "datePosted": "2020-10-28T15:32:02+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the team at Imperial Private Healthcare. &lt;br /&gt; &lt;br /&gt; The Trust has one of the largest private practice in the NHS, with considerable potential to grow its revenue. This substantial contribution to our income is used to support NHS patient care and develop new services for the benefit of all our patients.&lt;br /&gt; &lt;br /&gt; For the right high-calibre professional with a proven track record of managing complex services, this is a fantastic opportunity to join a team that is pushing service delivery and rapid business growth. Working closely with site nursing and medical leads, the post holder will deliver robust day to day operational site management and an efficient service delivery for private healthcare located at Charing Cross Hospital.&lt;br /&gt; &lt;br /&gt; This will require the post holder to create excellent working relationships with consultants, nursing staff and NHS colleagues across a number of specialities as well as the wider private patient team across Imperial.&lt;br /&gt; &lt;br /&gt; The successful candidate will line manage the front of house administrative team, working to create a high performing team.&lt;br /&gt; &lt;br /&gt; Finally, we are looking for an individual who can work to performance targets and contribute towards business planning.&lt;br /&gt; &lt;br /&gt; We support and actively encourage development.&lt;br /&gt; &lt;br /&gt; For further details please contact Louise McCarthy by email: louise.mccarthy2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 8A Service Manager - PH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247217", "validThrough": "2020-11-11T23:59:59+0000"}