{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-30T15:33:27+0000", "description": "&lt;p&gt;Exciting developments are occurring in the therapy services at Leighton Hospital, Mid Cheshire NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Inpatient therapy services are expanding. Following a successful pilot of a redesigned therapy service in emergency care, supported by the NHSI Collaborative for AHPs Supporting Patient Flow, funding was recently secured to improve the level of cover for the emergency assessment areas and to increase the service from 5 to 7 days with extended hours to be offered in A&amp;E.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a Band 6 Occupational Therapist to join the emergency care therapy team to support the service provision of the 7 day roster.&lt;/p&gt;\n&lt;p&gt;The emergency care therapy team (REACT) aims to avoid hospital admission by providing comprehensive assessment within Accident and Emergency and promoting a timely discharge from the medical assessment unit and short stay unit. The REACT team ensure that for patients whose discharge cannot be avoided, their journey through the hospital is assisted with a timely therapy assessment and plan on admission. Excellent interdisciplinary working across frailty, emergency care, community services and social care has evolved to develop a supportive and dynamic work environment.&lt;/p&gt;\n&lt;p&gt;Candidates should be able to demonstrate experience of confident clinical decision making in a timely manner. Candidates need to have had post graduate experience of working within a fast paced acute/emergency setting, demonstrating they have contributed to assessment, treatment and discharge planning for patients within frailty. An understanding of the SAFER principles would be an advantage.&lt;/p&gt;\n&lt;p&gt;The candidate should have excellent communication skills, being confident in working and liaising with MDT at all levels and across the wider service. You will have skills in organisation, time management and being able to work under pressure, which are key to efficiently managing caseloads.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a dynamic developing service with continued support from the management team. An interest and knowledge of service improvement is expected, experience of implementing change in practice and contributing to audit is an advantage. The team embraces supporting student placements; therefore experience of student mentorship is essential.&lt;/p&gt;\n&lt;p&gt;You will find that the therapy team is welcoming, friendly and supportive and that there is a strong commitment to multidisciplinary working. There is a structure in place to support supervision and professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are interested in this post we would be pleased to hear from you and are available for enquires. Please contact Nicky Walker, Therapy Team Manager on 01270 273015, or email nicky.walker@mcht.nhhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer in return:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On commencing the role you will have a full induction. We offer regular supervision, setting individual objectives, promoting self-analysis/reflection and development. All staff irrespective of their post will be given equal opportunity to undertake a full variety of CPD to support and develop them in their role.&lt;/p&gt;\n&lt;p&gt;Flexible working environment and paid annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;You will have a recognised degree in Occupational Therapy, HCPC registration, a full UK driving licence and access to a vehicle, or be able to demonstrate means of meeting the travel requirements of this post.&lt;/p&gt;\n&lt;p&gt;Clear reasoning for wishing to work for the Occupational Therapy Service should be detailed in the application.&lt;/p&gt;\n&lt;p&gt;Appointment to the post will be subject to successful interview, references, CRB and Occupational Health checks.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leighton Hospital, Crewe Middlewich Road Crewe Cheshire CW1 4QJ", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Clinical Specialist Occupational Therapist – Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250780", "validThrough": "2020-11-13T23:59:59+0000"}