{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10000", "minValue": "10000", "unitText": "YEAR", "value": "£10,000 per session per annum"}}, "datePosted": "2020-11-03T11:13:43+0000", "description": "&lt;p&gt;Are you a General Practitioner looking for an exciting new opportunity? The Practice Northumberland Avenue are looking for up to 10 sessions per week.&lt;/p&gt;\n&lt;p&gt;We offer a bespoke, flexible and rewarding employment package for GPs to suit their personal and career needs, whether this is supporting you to step up into a clinical leadership role or completing additional training allowing you to specialise in an area of particular interest.&lt;/p&gt;\n&lt;p&gt;The postholder will deliver high quality clinical care to the patients registered and attending the GP surgery. Work closely with the clinical leads and local practice team to support the delivery of the surgeries operational plan.&lt;/p&gt;\n&lt;p&gt;The role will be at the forefront of delivering an innovative model of primary care service provision working with the wider teams within Operose Health sharing best practice and continuous development.&lt;/p&gt;\n&lt;p&gt;The postholder will strive to maintain quality within the practice ensuring participation in clinical governance activity and contribute to the improvement in quality of health outcomes through audit and the Quality and Outcomes Framework and contributing to the practice achieving other quality standards to include CQC standards.&lt;/p&gt;\n&lt;p&gt;For more information please contact recruitment@operosehealth.co.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130016.png", "name": "Operose Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend-on-Sea", "postalCode": "SS1 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5331", "longitude": ".730641"}}, "title": "General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253634", "validThrough": "2020-11-30T23:59:59+0000"}