{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-29T08:45:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Scheduled and Planned Care Network&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mood, Anxiety, PTSD, Psychotherapy Service (MAPPS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Psychological Therapist /Clinical Psychologist&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:Band 7 £38,890 - £44,503pa (dependent on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: St. Georges Community Health Centre &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hours: 37.5 Hours per week Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Ref: 457-20-083-PY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a team of Psychological Therapists who are working in the Mood, Anxiety, PTSD, Psychotherapy Service (MAPPS).&lt;/p&gt;\n&lt;p&gt;This full-time permanent post is based at the St. Georges Community Health Centre. The post involves working as part of the MDT providing highly specialised evidence-based psychological therapies to people with complex anxiety and mood disorders. The role involves direct clinical work with service users and their families/carers, psychological interventions for people who require highly specialised psychological therapies and for whom there has been an inadequate response to ‘first line’ interventions, or for whom these interventions are not appropriate.&lt;/p&gt;\n&lt;p&gt;This post will also involve working with staff through joint work, consultation, reflective practice and team formulation.&lt;/p&gt;\n&lt;p&gt;We are looking for a Psychological Therapist/Clinical Psychologist who is suitably qualified and registered with the relevant body (Health Professions Council, NMC, BABCP, ACAT) who is interested in working with adults with complex mental health problems. Psychotherapy and psychology roles are highly valued by the team and a positive approach to multidisciplinary team work is essential.&lt;/p&gt;\n&lt;p&gt;We are keen to ensure that this relatively small team provides a range of interventions across therapeutic modalities. The longest waiting times are for Trauma-Focused Psychotherapies for PTSD, so an ability to deliver safe, effective, evidence based Trauma Focused Psychotherapy to this population is therefore essential. This is predominantly a clinical post although the post-holder will be expected to be involved in service development projects, teaching, consultation and supervision of other therapists as detailed in the job description.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 2HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.38", "longitude": "-1.48745"}}, "title": "Psychological Therapist/Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247656", "validThrough": "2020-11-13T23:59:59+0000"}