{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-10-23T13:15:58+0100", "description": "&lt;p&gt;In Local Services we strive to take care to a new level through our skilled and committed workforce. Caring for our service users in new innovative ways is one of our key quality improvement priorities as we look to ever improve our standards of care. There really has never been a more exciting time to join West London Trust!&lt;/p&gt;\n&lt;p&gt;Come and find out what it’s like to join our fantastic team and help us make a difference. In return, we will give you a warm welcome and all the support you need to settle in and enjoy life at West London Trust while pursing your chosen career. We will interview you and confirm the outcome on the day of your assessment.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Liaison Psychiatry Practitioners which are Band 6 roles. We have vacancies in the three boroughs this service covers; Ealing (Ealing General Hospital), Hounslow (West Middlesex University Hospital)and Hammersmith &amp; Fulham (Charing Cross Hospital)&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for full time and part time permanent positions so whatever your preference – we have a role for you! Staff will be expected to work across 7 days per week and to participate in shift work which will include: long days &amp; night shifts. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Don’t miss out - we have recently secured funding to be able to offer staff the opportunity to apply for a funded place on the Liaison Mental Health Care BSc at City University of London.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role -&lt;/strong&gt;Liaison Psychiatry Practitioner&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band -&lt;/strong&gt;Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Payment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ealing - £32,257 - £41,308&lt;/p&gt;\n&lt;p&gt;Hounslow - £32,257 - £41,308&lt;/p&gt;\n&lt;p&gt;Hammersmith &amp; Fulham - £33,660 - £43,307&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for highly motivated, enthusiastic and caring professionals who can provide the best possible care with compassion to our service users. You will be comfortable working both on your own and with others from a range of different backgrounds. To thrive in this role, you need to be resilient, motivated and committed to adapt to working in an ever-changing environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you’re excited to work with us to truly care to make a difference, we’d love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please bring along with you some ID documents for verification including a passport, driving licence and utility bill dated within the last three months. If you are successful on the day we can complete your ID check which will save you having to come back in at a later date.&lt;/p&gt;\n&lt;p&gt;Why Join Us?&lt;br /&gt;We are one of the most diverse providers of mental health care in the UK and our staff are dedicated to improving lives through the wide range of services we offer. Our purpose is to help people to recover from mental illness and to find new and better treatments that allow people to lead full and productive lives. Our ambition is to be the best organisation of our type in the UK.&lt;/p&gt;\n&lt;p&gt;Below are just some of the reasons we feel that West London Trust is the place for you. We’d love to see you working in our Trust and contributing to some of the great work we do.&lt;/p&gt;\n&lt;p&gt;We positively welcome applications from people with a lived experience of either mental health conditions or learning disabilities and people who represent diverse communities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Mission&lt;br /&gt;&lt;/strong&gt;“Promoting hope and wellbeing, together”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision&lt;br /&gt;&lt;/strong&gt;Our vision is to be an outstanding healthcare provider, committed to improving quality, and caring with compassion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Values&lt;br /&gt;&lt;/strong&gt;As a member of West London staff, you can expect to be a respected member of staff at all times. We work to a set of Trust Values and uphold these in all of our interactions. Our Values are like our moral compass, reminding us of the things that matter most when we are caring for people in need. Our Trust Values are:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Togetherness &lt;/strong&gt;&lt;strong&gt; Responsibility Excellence Caring&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you feel you are a person who lives our Trust Values then we’d like to meet you! You can watch videos on our website which shows what our Trust Values mean across our organisation:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;br /&gt;&lt;/strong&gt;We offer an extensive reward package to our staff alongside an exciting and fulfilling career with our Trust. Some of the benefits you can enjoy when you join our team are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive relocation package meaning you can claim up to £8k in expenses when moving over 40 miles to join the Trust.&lt;/li&gt;\n&lt;li&gt;Up to 33 days annual leave as well as the opportunity to buy even more days or sell some leave days that you don’t need.&lt;/li&gt;\n&lt;li&gt;As a member of West London staff you will be able to request up to six shifts off work per rota&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Support towards career development and promotion opportunities within the Trust.&lt;/li&gt;\n&lt;li&gt;A supportive environment to develop clinical skills.&lt;/li&gt;\n&lt;li&gt;Access to a comprehensive online library of training, development, and resources.&lt;/li&gt;\n&lt;li&gt;Discounted gym membership – from £10 per month at our on-site gym! (St Bernard’s site)&lt;/li&gt;\n&lt;li&gt;Staff discounts at high street retailers.&lt;/li&gt;\n&lt;li&gt;Paid DBS application upon offer.&lt;/li&gt;\n&lt;li&gt;Free parking on-site.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome enquiries about this role before or during your application process. If you would like to know more about this opportunity and working at West London Trust, please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Phillip Dick&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Team Manager – Hounslow Liaison Psychiatry Service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;phillip.dick@westlondon.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0208 483 1496&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tri-borough (Ealing, Hounslow and H&amp;F)", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Liaison Psychiatry Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240663", "validThrough": "2020-11-22T23:59:59+0000"}