{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum inc"}}, "datePosted": "2020-10-26T12:16:42+0000", "description": "&lt;p&gt;This is an exciting opportunity for a Band 6 RGN to join our team and be part of our forward thinking, progressive service, that invests in staff through continuous development and career progression.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a service that is embracing the therapeutic day? Are you someone who has a passion for working with adults with acute mental illness? Do you want to develop your knowledge, skills and expertise to ensure that we deliver high quality, person centered care at the right time and in the right place?&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated and flexible nurse to join our established team of staff, ensuring our patients are offered holistic care and support, which encompasses their physical and mental health needs.&lt;/p&gt;\n&lt;p&gt;9-5 Monday to Friday.&lt;/p&gt;\n&lt;p&gt;You will need to&lt;/p&gt;\n&lt;p&gt;- Have a strong desire to support us to develop this service in a rapidly changing climate&lt;/p&gt;\n&lt;p&gt;- Have an interest in supporting the physical health of people with acute mental illness having previous experience in this setting&lt;/p&gt;\n&lt;p&gt;- Be willing to work in a challenging/often demanding driven environment&lt;/p&gt;\n&lt;p&gt;- Be willing to engage in audit and evaluation&lt;/p&gt;\n&lt;p&gt;- Be part of a team wishing to always improve the user experience of mental health services&lt;/p&gt;\n&lt;p&gt;- Be able to support the management team in a leadership role&lt;/p&gt;\n&lt;p&gt;- Offer up to date training in physical health for all ward staff&lt;/p&gt;\n&lt;p&gt;We take pride in our services which are underpinned by our values of respect, openness, accountability, working together, innovation and excellence.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In the winter of 2017, we launched our new and exciting Nursing Strategy. Our strategy will support our registered and unregistered nursing staff to provide the best care possible to our patients and their families, whilst enjoying a long and supportive career with us here at KMPT.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine Onih OladeleJob titleWard ManagerAdditional contact information&lt;/p&gt;\n&lt;p&gt;Catherine Onih Oladele&lt;/p&gt;\n&lt;p&gt;Jasmine Ward&lt;/p&gt;\n&lt;p&gt;01322927474&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jasmine  Ward, Dartford", "postalCode": "DA2 6PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4464", "longitude": ".241649"}}, "title": "Physical Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242380", "validThrough": "2020-11-09T23:59:59+0000"}