{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39813", "minValue": "34363", "unitText": "YEAR", "value": "£34,363 to £39,813 per annum"}}, "datePosted": "2020-10-29T17:00:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Procurement Partner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Partners Ltd&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting new managed healthcare services organisation, Healthcare Partners Ltd (HPL), has been created which will transform the delivery of interventional, support and facilities services to the Royal Surrey NHS Foundation Trust and other potential customers. The aim is to deliver significant operational, quality and financial benefits in procurement, contracts, medical equipment and servicing, through a full managed service provision. HPL is a wholly owned subsidiary of the Royal Surrey and a new business model which we want to develop as a leading service provider in its field.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Procurement Partner to join our Operational Supply Chain team within Supply Chain Services which comprises 27 people.&lt;/p&gt;\n&lt;p&gt;This role is banded as 6 on Agenda for Change terms or equivalent salary on HPL terms and conditions.&lt;/p&gt;\n&lt;p&gt;As part of the Supply Chain function you will support the Inventory&amp; Logistics and Buying teams in the delivery of an efficient purchasing and materials management service to your areas of responsibility and work with the Strategic Procurement team to implement cost saving programmes.&lt;/p&gt;\n&lt;p&gt;You will be accountable and responsible for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working closely with the Buying and Inventory &amp; Logistics teams to ensure that customer requirements are fully understood and realised&lt;/li&gt;\n&lt;li&gt;Ensure that the procurement service delivered by HPL is to the agreed high standards&lt;/li&gt;\n&lt;li&gt;That procurement activities in your areas of responsibility are monitored and product and service standardisation and rationalisation opportunities are implemented and the savings and benefits realised&lt;/li&gt;\n&lt;li&gt;Support the development of promoting excellent customer relationships, balancing commercial and clinical considerations in the purchasing of products and services, and ensuring these are imbedded into contractual agreements&lt;/li&gt;\n&lt;li&gt;Work with other NHS agencies, as directed to implement any changes within the supply chain in order to achieve cost effective supply solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Ideally you will be educated to degree level or equivalent but shall have A Levels or equivalent.&lt;/p&gt;\n&lt;p&gt;Possess a broad knowledge of healthcare products/procedures and be a member of the&lt;/p&gt;\n&lt;p&gt;Chartered Institute of Purchasing &amp; Supplies qualification, CIPS level 4 or above or working towards this qualification.&lt;/p&gt;\n&lt;p&gt;You will possess:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working in a customer service environment&lt;/li&gt;\n&lt;li&gt;Experience of working in similar environment of stock control, warehousing order processing and follow up&lt;/li&gt;\n&lt;li&gt;A car owner and a clean driving licence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A willingness to be flexible team player and to be prepared to cover other areas to your normal responsibilities at times of holiday or sickness is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Procurement Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249161", "validThrough": "2020-11-10T23:59:59+0000"}