{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-26T12:30:33+0000", "description": "&lt;p&gt;&lt;strong&gt;An opportunity has arisen to join the Therapy in patient team based on the acute medical/surgical wards at Leighton Hospital. The role of the Therapy Assistant is to support the qualified Occupational Therapists with the implementation of treatment plans and interventions for patients on the acute medical/surgical wards. The role will include gathering information from patients or families, following treatment plans, under supervision, providing education and practice in activities of daily living and mobility, and supporting the qualified staff on home visits. The role will require you to assist with moving and handling of patients using appropriate equipment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Administrative duties will include photocopying and filing, maintaining admission information and completing computer based statistics. There will be a requirement to write in medical notes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a motivated and organised individual who is a good communicator and able to work well within the Therapy and wider MDT team, and also have initiative to work alone. You will have experience in a healthcare environment, and ideally to have had experience working with people who have acute medical needs. You will be able to demonstrate that you are able to work under pressure on wards with fast turnover of patients, and that you have an understanding of the role of Occupational Therapy and Physiotherapy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Therapy team is a friendly supportive team, and training will be given to develop the successful applicant.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242421", "validThrough": "2020-11-08T23:59:59+0000"}