{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-03T15:16:19+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for an energetic and motivated healthcare practitioner who genuinely has a desire to work in the specialty of Infection Prevention and Control. You must be passionate about patient care, enthusiastic about exploring new innovative ways of working and a team player, to help us deliver our overall Healthcare Associated Infection improvement strategy at South Tees Hospitals NHS Foundation Trust.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are a small team with a supportive administration team and work closely with Microbiology to deliver safe, patient centered care, providing a 7 day service to our 2 acute hospitals and 3 community hospitals as well as our community nursing service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Key elements of this post will be to provide a specialist infection prevention and control educational programme for healthcare staff, patients, visitors and non-trust staff. The role will predominately cover care homes including; patient reviews, undertaking audit, surveillance, supporting campaigns, along with guiding and supporting clinical staff on Infection Prevention and Control guidelines and policies and therefore promoting safe, quality, patient centered care. You will be committed to quality improvement, engaging with patients and staff and have the ability to translate guidance and strategy into changes of care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In return you will be joining a team who are committed to supporting you in your development, providing you with the knowledge and skills to undertake your role.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will receive a 4 week induction period and be supported in the use of core competencies to assess knowledge and skills as part of their continuous professional development in this field.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon LanceJob titleDeputy Director of Infection Prevention &amp; ControlEmail addressslance@nhs.netTelephone number01642 854800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The James Cook university hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Assistant Lead Nurse Infection Prevention &amp; Control - Care Homes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254518", "validThrough": "2020-11-17T23:59:59+0000"}