{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-28T10:00:42+0000", "description": "&lt;p&gt;UHB is one of the largest teaching hospital trusts in England, serving a regional, national, and international population.&lt;/p&gt;\n&lt;p&gt;Our multiple sites, Birmingham Heartlands Hospital, the Queen Elizabeth Hospital Birmingham, Solihull Hospital and Community Services, Good Hope Hospital in Sutton Coldfield and Birmingham Chest Clinic allow people to be treated as close to home as possible.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a motivated, enthusiastic individual to join our friendly, busy Pain Management Team. We are seeking a highly motivated, enthusiastic individual with excellent communication skills and previous experience of managing a team of staff. The successful candidate will have experience and an understanding of the 18 week referral to treatment, PTL management, scheduling and waiting list management experience.&lt;/p&gt;\n&lt;p&gt;The successful candidate will play a pivotal role in contributing to the flow of administrative output, within the Pain Management Department. They will be working closely withthe operational manager, administrative team and the clinical team including;nurses, clinicians, physiotherapist and psychologists within the trust.&lt;/p&gt;\n&lt;p&gt;It is essential that the post holder has good IT skills and knowledge of Microsoft Word and Outlook. Good organisational skills and ability to work as part of well-functioning team. The Pain Management service is based across the 3 sites therefore the post holder will be expected to work across the sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of work:&lt;/strong&gt; Full time, Monday to Friday&lt;/p&gt;\n&lt;p&gt;Interviews to be held the &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;19th/20th &lt;/span&gt;&lt;/strong&gt;of November 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Pain Management Office Manager/Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245934", "validThrough": "2020-11-11T23:59:59+0000"}