{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40428", "minValue": "40428", "unitText": "YEAR", "value": "£24.05 per hour excluding holiday pay"}}, "datePosted": "2020-10-21T15:53:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 7 Pharmacist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; South London and Maudsley NHS Foundation Trust (Bethlem Royal Hospital, Monks Orchards Road, Beckenham, BR3 3BX)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Pharmacy (Mental Health)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;£24.05 per hour excluding holiday pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 36195&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:        &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A passion for putting patients first&lt;/strong&gt; …… join the bank for flexibility in how you work.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that is committed to innovation, effective interventions and improved service outcomes?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Pharmacists available at South London and Maudsley NHS Foundation Trust, specifically providing the following:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To ensure safe and effective use of medicines at ward and dispensary level. This includes adhering to Trust policies, pharmacy procedures, local and national guidelines, and legal requirements.&lt;/li&gt;\n&lt;li&gt;Providing clinical pharmacy input as part of the multidisciplinary team (MDT). This will include providing advice to clinicians on medicines, including the use of unlicensed medicines use and areas of practice where the evidence base is lacking, liaising with the medicines information pharmacists where appropriate.&lt;/li&gt;\n&lt;li&gt;To be responsible for providing a clinical pharmacy service to groups of patients&lt;ol&gt;\n&lt;li&gt;Ensure effective outcomes of treatment with medicines&lt;/li&gt;\n&lt;li&gt;Monitor patients for potential and actual adverse effects of their medicines&lt;/li&gt;\n&lt;li&gt;Ensure the effective, timely and accurate supply of medicines suitable for use as an inpatient and appropriately labelled for discharge if applicable.&lt;/li&gt;\n&lt;li&gt;Support planning for discharge, including liaising with community team pharmacists for follow-up appointments where appropriate&lt;/li&gt;\n&lt;li&gt;Take steps to ensure patients understand the purpose of their medicines and deal with any practical issues that may prevent the optimal use of their medicines.&lt;/li&gt;\n&lt;li&gt;To assess medicine regimes both during enquiry answering and/or routine ward visits, providing highly specific advice to other clinical team members on the management of often complex medicine related issues, such as complex drug interactions, high dose antipsychotic prescribing, unlicensed use of medicines etc.&lt;/li&gt;\n&lt;li&gt;To prescribe medicines within their scope of practice and in line with Trust policy if qualified and registered with the GPhC as an independent pharmacist prescriber.&lt;/li&gt;\n&lt;li&gt;To support local implementation of Trust Medicines Management Policies within own clinical area, and ensure medicines are handled safely and securely within designated clinical areas.&lt;/li&gt;\n&lt;/ol&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The South London and Maudsley (SLAM) NHS Foundation Trust is part of King’s Health Partners Academic Health Sciences Centre (AHSC), which includes seven hospitals and over 150 community based services.  It is responsible for seeing two million patients each year, has 25,000 employees and 19,500 students, and a £2 billion annual turnover.  It brings together the best of basic and translational research, clinical excellence and world-class teaching to deliver advances in physical and mental healthcare&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will be:&lt;/p&gt;\n&lt;p&gt;GPhC registered&lt;/p&gt;\n&lt;p&gt;Pharmacist with Mental Health experience&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Zsofia Kathi, Recruitment &amp; Placement Consultant on 01442915242 or &lt;span style=&quot;text-decoration: underline;&quot;&gt;Zsofia.kathi&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;@nhsprofessionals.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "Band 7 Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237171", "validThrough": "2020-11-20T23:59:59+0000"}