{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18093", "minValue": "18093", "unitText": "YEAR", "value": "£18,093.00 per annum"}}, "datePosted": "2020-10-20T13:20:35+0100", "description": "&lt;h1&gt;&lt;strong&gt;Admin Support Officer – Community Hub and Ward&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;37.5 hours per week to be worked on a rota basis which includes evenings, weekends, and bank holidays.&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Salary £18,093.00 per annum&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role provides daily efficient administrative support to our busy Community and Ward Teams. You will be responsible for processing referrals and taking calls from our Community clients, maintaining team rotas, minute taking, diary management and all input of data on to the Patient Administration Systems as required.&lt;/p&gt;\n&lt;p&gt;This is a very busy role, working with complex systems and with a large and varied workload. We are therefore looking for someone enthusiastic and excited to take on a new challenge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent customer service skills with a professional and pleasant manner. You will be a very valuable member of the Administration team and assist in the provision of a high standard administrative service. A flexible approach to working routines, the ability to do a variety of tasks at one time and to work within a team and also alone is essential.&lt;/p&gt;\n&lt;p&gt;You will be required to attend and maintain regular training courses and to follow the policies and procedures set down by Mountbatten Hampshire.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Charity environment is desirable, but training will be provided to enhance the post holder’s skill set.&lt;/p&gt;\n&lt;p&gt;Mountbatten Hampshire rated ‘Good’ by the CQC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a wide range of benefits to our employees including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Onsite Parking&lt;/li&gt;\n&lt;li&gt;Development and Training opportunities&lt;/li&gt;\n&lt;li&gt;Generous Annual Leave, Occupational Sickness and Maternity Benefit Schemes, subject to qualifying conditions&lt;/li&gt;\n&lt;li&gt;Recognition of previous Agenda for Change NHS Continuous Service for incremental progression, annual leave, maternity and sickness benefits&lt;/li&gt;\n&lt;li&gt;Pensions Schemes, including continuation of contributions to your NHS Pension scheme, subject to eligibility&lt;/li&gt;\n&lt;li&gt;Local Benefit Scheme including discounts with all ferry operators&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The post is subject to an Enhanced DBS check the cost of which is covered by the Hospice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion and visit about this opportunity, please contact Sonya Crouch on 02382 548860&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135075.png", "name": "Countess Mountbatten Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Admin Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234557", "validThrough": "2020-11-08T23:59:59+0000"}