{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pro rata"}}, "datePosted": "2020-11-04T15:45:20+0000", "description": "&lt;p&gt;&lt;span&gt;Psst - we&#39;ve got a great job right here!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you passionate about supporting adopted children and young people and enabling their families to flourish? Are you interested in shaping an expanding multidisciplinary team within a regional adoption agency? We wish to appoint a dynamic and enthusiastic Highly Specialist Speech and Language Therapist to provide Speech, Language and Communication Needs assessment and intervention as part of the OAWY (One Adoption West Yorkshire) Multidisciplinary team (MDT). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be joining a team of specialists including therapeutic social workers, education professionals and other health professionals including occupational therapists and clinical psychologists. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Based either in Leeds, Bradford or Huddersfield with extensive travel across West Yorkshire area – within the remits of the adjustments required whilst working within the COVID19 pandemic – some of this work is likely to be virtual/digital) &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Key responsibilities of the role: &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Assessment &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Establish and utilise a screening tool within OAWY to assess speech, language and communication skills in children/young people to identify any Speech, Language or Communication needs (SLCN).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Facilitate a full assessment of SLCN of identified children (either individually or as part of a broader MDT assessment) and create a plan for support, which fits in with the overall adoption support plan.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Interventions &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Facilitate individual and group based interventions to develop children’s communication skills, which are age appropriate and take into account the impact of children’s early life experiences.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Facilitate individual and group based support and training activities for parents, providing them with information about communication milestones and strategies for encouraging and developing their children’s communication skills taking into account the impact of children’s early life experiences.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Consultation &lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Support OAWY staff and the wider team around the child through consultation to increase understanding of the SLC needs of children and to ensure those needs are recognised and taken into account when support plans for adopted children are created and put in place.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Training for Staff &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Provide a bespoke training programme, which will consider SLCN in the context of children’s early life experiences.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support the OAWY staff to develop the skills and capacity to run language and communication groups, which help to develop the communication skills of children/young people taking into account their early life experiences.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Service Development &lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Contribute to the ongoing development of multidisciplinary working practices in partnership with colleagues within the MDT, the OAWY management team and the wider staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Building pathways with universal services &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;In conjunction with the MDT develop partnerships with universal Speech and Language Therapy services to ensure continuity of care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About You &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be passionate about improving the lives of young adoptees and their families. We are seeking someone with experience of working with the impact of early adversity and developmental trauma. We also wish to recruit someone with experience of working with children with neurodevelopmental conditions that affect a child’s speech, language and communication skills (such as autism). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have experience of developing and delivering training to professional and parent/carer groups and providing consultation to others. You will have experience of working collaboratively with professionals from other disciplines/ agencies for the purposes of assessing and supporting children with speech, language and communication needs. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be registered with both HCPC and RCSLT. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a team player with a willingness and desire to learn and develop alongside the team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Children’s Speech and Language Therapy in Leeds &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is a strong management/peer support structure including access to regular clinical and safeguarding supervision and a wide range of opportunities for CPD (Continuing Professional Development). You will have access to a high level of support from other Highly Specialist SLT colleagues, Clinical Leads and the Children’s Speech &amp; Language therapy leadership team, in addition to receiving support from the management team within the OAWY. This is likely to include additional clinical supervision. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a hardworking, forward thinking and supportive service. For further information please visit our website – leedscommunityhealthcare.nhs.uk/cslt &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an employee of Leeds Community Healthcare NHS Trust, you will be part of a dedicated and passionate team who truly believe in providing high quality care to all. In addition to an exciting and rewarding career, you will also receive a full induction and supervision programme, continued commitment to professional development, a supportive environment to develop your clinical skills, and much more. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Children’s Speech &amp; Language Therapy- Building Communication Skills for Life.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you&#39;re convinced you&#39;re the best person for this job, let us know more about you! Click apply to submit your application.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256476", "validThrough": "2020-11-23T23:59:59+0000"}