{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T08:45:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic and dynamic Speech and Language Therapist to join our acute speech and language therapy team in Salford. The role will involve covering a range of acute medical and surgical wards and trauma wards. The role includes contributing to the weekend working rota.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have specialist skills in managing adults with a broad range of acquired communication and swallowing difficulties. They will be able to develop and deliver high quality patient centred treatment plans in order to support patients to achieve the best recovery that they can. Experience and training in videofluoroscopy is desirable but not essential as support and training can be provided for the right candidate.&lt;/p&gt;\n&lt;p&gt;We would consider applications from candidates wanting to work 30 hours per week.&lt;/p&gt;\n&lt;p&gt;As a Trust we are committed to innovative practice, audit and research opportunities and are looking for a likeminded individual to come and join us. This is an excellent opportunity where you will have access to supervision, support and development of your clinical skills in these areas from highly skilled Speech and Language Therapists in addition to regular opportunities for learning across the MDT.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rosie McAllion&lt;br /&gt;AHP Lead for SLT&lt;br /&gt;rosalind.mcallion@srft.nhs.uk&lt;br /&gt;0161 206 4257&lt;/p&gt;\n&lt;p&gt;Sarah Brown / Karen Hawley, Acute SLT Leads&lt;br /&gt;0161 206 5450&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Specialist Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239714", "validThrough": "2020-11-08T23:59:59+0000"}