{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "187714", "minValue": "57500", "unitText": "YEAR", "value": "£57,500 to £187,714 pa"}}, "datePosted": "2020-10-12T11:46:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Bank General Practitioners&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Owing to unprecedented events regarding COVID-19 we are working tirelessly to recruit quickly for General Practitioners to join the BANK at Humber Teaching NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Bank covers would cover the following Practices:&lt;/p&gt;\n&lt;p&gt;North Point Practice, Bransholme, Hull&lt;/p&gt;\n&lt;p&gt;Princes Medical Centre, Hull&lt;/p&gt;\n&lt;p&gt;Hallgate Surgery, Cottingham, East Riding&lt;/p&gt;\n&lt;p&gt;The Chestnuts Surgery, Cottingham, East Riding&lt;/p&gt;\n&lt;p&gt;Peeler House Surgery, Hessle, East Riding&lt;/p&gt;\n&lt;p&gt;Field House Surgery, Bridlington, East Riding&lt;/p&gt;\n&lt;p&gt;Manor House Surgery, Bridlington, East Riding&lt;/p&gt;\n&lt;p&gt;Market Weighton Surgery, East Riding&lt;/p&gt;\n&lt;p&gt;As a GP within our Practices we are able to offer the ability to work remotely to undertake administrative work and also telephone and video consultations with patients. Each of our GP Practice has the support of a Multi-Disciplinary Team including Advanced Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;The Practices clinical team is also well supported by an excellent administration and management team; this allows our GPs to concentrate on clinical work.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide an excellent standard of primary care whilst supporting personal and professional development. Our people are our most valued asset and we encourage our GPs to develop their skills and interests locally and within the wider organisation.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Sue Wardlow, Primary Care Service Manager 07976 703725 or Email: susan.wardlow@nhs.net&lt;/p&gt;\n&lt;p&gt;The Bank enables staff to work varying hours on an as and when basis but can be on a full and part time capacity across a range of shift patterns including day, evening and night shifts. This also provides staff with the opportunity to work when they are available or around family commitments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants will be expected to have excellent communication and interpersonal skills, to work effectively with patients, staff and peers and to be able to work flexibly to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will rely on your co-operation as a candidate to enable us to process Pre employment checks quickly if you are successful. We intend to carry out telephone interviews and you can expect this to take place within 2 days of your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated&lt;strong&gt;Good&lt;/strong&gt;by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan WardlowEmail addresssusan.wardlow@nhs.netTelephone number07976 703725&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willerby", "postalCode": "HU10 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7726", "longitude": "-.448921"}}, "title": "Bank Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222165", "validThrough": "2020-11-09T23:59:59+0000"}