{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 pa inc HCA"}}, "datePosted": "2020-11-05T15:31:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Rotational Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to progress your physiotherapy career within our well established and dynamic therapy service. This includes rotations through both inpatients and outpatients allowing the post holder to gain experience within varied settings. The rotations are 4 months and rotate through; Care of the Elderly, Medicine, Respiratory including ITU, Surgical (incl Amputees), MSK Outpatients, Paediatrics, Acute Stroke Unit, and Orthopaedics – trauma and elective.&lt;/p&gt;\n&lt;p&gt;Each rotation is supported by a robust senior tier with a wealth of experience to help guide and support in both your individual learning needs but to also strive to ensure that the best standards of care are provided. A well established supervision, probationary, preceptorship and appraisal process is in place to help facilitate this. We also offer In-Service training opportunities and experience will be gained in the informal supervision of assistants when appropriate.&lt;/p&gt;\n&lt;p&gt;West Hertfordshire NHS Trust is a busy acute district general with most of the main caseload now centralised at the Watford General Hospital site, with the exception of the elective orthopaedic service which is at St Albans City Hospital. As a Trust we have one of the largest Acute Assessment Units which provides opportunities to provide rapid but comprehensive assessments to help support patients to the most appropriate place of care. The teams have established strong relationships with our community bedded counterparts and community team colleagues, including rapid response and early supported discharge for stroke, to enable best patient care. We additionally have a Frailty Unit service and delirium recovery pathway. We have a 19 bedded ITU offering opportunities to enhance critical care management both in respiratory and rehabilitation.&lt;/p&gt;\n&lt;p&gt;The department is 7 day working and this post would be included in that rota (frequency of usually a 1:6 weekend) with rest days in the following week, along with a requirement to be on the Respiratory on call evening rota.&lt;/p&gt;\n&lt;p&gt;Watford General Hospital is within easy walking distance of the Metropolitan line (underground) and London Midland overland Train at Watford Junction Station, which is a 20 minute journey away from London Euston.&lt;/p&gt;\n&lt;p&gt;Car drivers also have easy access via main motorways.&lt;/p&gt;\n&lt;p&gt;We are also surrounded by picturesque villages, bustling towns, great shopping, bars and restaurants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held 17th November via zoom&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Jarvis, Therapy Team Lead on Jennifer.jarvis1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 5 - Rotational Physiotherapist, Inpatient Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258365", "validThrough": "2020-11-12T23:59:59+0000"}