{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "94988", "minValue": "57705", "unitText": "YEAR", "value": "£57,705 - £94,988 p.a."}}, "datePosted": "2020-10-28T14:17:37+0000", "description": "&lt;p&gt;We are looking to recruit an enthusiastic Associate Specialist or Specialty Doctor to join our established Adult Mental Health team in Portsmouth. The post covers the Crisis team (3.5 days a week) and Older Person ward (1.5 days a week).&lt;/p&gt;\n&lt;p&gt;The successful applicant will work alongside the Crisis consultant and both OPMH In-patient consultant providing clinical expertise, clinical leadership and supporting current and future service developments. This post offers a varied job working closely with the multidisciplinary team. We put a high emphasis on quality of care, peer support and on clinical engagement in service development and management.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be interested in teaching and supervision and be committed to improving quality and service development. The trust is committed and successful with respect to clinical excellence, CPD and audit. We offer support with training and personal development.&lt;/p&gt;\n&lt;p&gt;Solent NHS Trust supports flexible working and we are passionate about staff work life balance. We would consider flexible working patterns, multiple locations and the necessary technology to support you achieve this balance. We are a supportive and flexible team and have good junior doctor cover on our wards.&lt;/p&gt;\n&lt;p&gt;Our trust shared values (HEART – honesty, everyone counts, accountable, respectable and team work) support the development of a strong working culture and guides and inspires all of our actions and decisions. They enable us to be better at what we do and create a great place for our staff to work, whilst ensuring we provide the highest quality of care to our patients. Our last CQC rating of ‘outstanding’ for care and ‘good’ for the other domains depict these.&lt;/p&gt;\n&lt;p&gt;The trust is situated in the vibrant maritime city of Portsmouth with a long naval history and excellent shopping facilities. With the New Forest and South Downs nearby, the area provides the opportunity for a wide range of outdoor leisure activities for all the family. We are a short time away from London by road and rail, with easy access to the continent by air and ferry.&lt;/p&gt;\n&lt;p&gt;We will look to interview early December for this opportunity.&lt;/p&gt;\n&lt;p&gt;We welcome informal visits or telephone contact about this role, please contact kayode.osanaiye@solent.nhs.uk directly.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO4 8FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7961", "longitude": "-1.04582"}}, "title": "Associate Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246958", "validThrough": "2020-12-01T23:59:59+0000"}