{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-30T09:46:05+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for qualified nurse who may be considering progressing their career in oncology with the aspiration to become a cancer Clinical Nurse Specialist. We are looking for an enthusiastic and motivated nurse to join the Macmillan nursing team as a band 6 Associate Cancer Nurse.&lt;/p&gt;\n&lt;p&gt;This is a part time role 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;This role will initially be with the Macmillan Lower Gastrointestinal team and we are anticipating rotating band 6 roles to improve the professional development of staff. The postholder will be required to support other teams as required in response to capacity and staffing pressures. Due to the pandemic we are currently restoring and reviewing our services so someone comfortable with and able to contribute to a changing environment is essential.&lt;/p&gt;\n&lt;p&gt;This exciting role will give the postholder the opportunity to contribute to the specialist care and management of patients, mainly in the outpatient setting, who have been diagnosed with cancer. You will gain a valuable insight into the diagnostic process and participate in supporting patients at diagnosis and through the cancer pathway, including on and post treatment and when disease recurs or advances. Late effects of the disease and treatments are becoming an increasing important aspect of cancer care so the postholder will be expected to contribute to service development in this area of practice&lt;/p&gt;\n&lt;p&gt;Having experience in cancer nursing is required, either within in a specialist oncology setting or transferable experience from a general setting and of most importance is the ability to contribute effectively within a team and at times working autonomously to improve the service and support given to patients and carers.&lt;/p&gt;\n&lt;p&gt;Many of the service users are very anxious and are faced with distressing, often complex, information that may have a dramatic impact on themselves and their families; the post therefore requires you to have excellent communication skills and the personal resilience to cope with potentially stressful situations.&lt;/p&gt;\n&lt;p&gt;The post will involve liaising with key members of the multi-disciplinary team and establishing close working relationships with the existing Macmillan teams who will provide direction, guidance and support.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Randall&lt;/p&gt;\n&lt;p&gt;Job title Cancer Matron&lt;/p&gt;\n&lt;p&gt;Email address sarah.randall1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07770 584733&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For informal contact / visits please contact the LGI CNSs&lt;/p&gt;\n&lt;p&gt;Lucinda Mackay or Gill Hilton Macmillan Nurse Specialists for LGI Cancers&lt;/p&gt;\n&lt;p&gt;Please email bsuh.lower.gi.macmillanrsch@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "cross site, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Macmillan Associate Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249545", "validThrough": "2020-11-17T23:59:59+0000"}