{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 PA inc. HCAS"}}, "datePosted": "2020-10-30T12:31:08+0000", "description": "&lt;p&gt;Specialist Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;An exciting permanent opportunity has arisen in the tri-borough Community Neuro-Rehabilitation Service. We are looking to recruit an enthusiastic and flexible Band 6 Specialist Speech and Language Therapist to join our team. The successful post holder will provide assessment and therapy to a wide range of adult clients with acquired and progressive neurological conditions. The role also covers the Early Supported Discharge Service for Stroke, to provide intensive multi-disciplinary rehabilitation to people post stroke.&lt;/p&gt;\n&lt;p&gt;You will work as an autonomous practitioner in the community, as well as having the support of a highly skilled and experienced multidisciplinary team. The post holder will be committed to improving patient experience at all times. There will be opportunities to engage in service development, including research, audits and QI projects.&lt;/p&gt;\n&lt;p&gt;You will have regular supervision with a Highly Specialist Speech and Language Therapist, and access to regular SLT meetings and peer support groups&lt;/p&gt;\n&lt;p&gt;We require a Speech and Language Therapist with experience of working with adults with acquired and progressive neurological conditions. You will be keen to learn and to develop your assessment and rehabilitation skills. The role requires someone who is flexible, organised, and patient-centred with excellent communication skills. Being a team player who can work as part of a multidisciplinary team is also essential to this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lisson Grove Health Centre, London", "postalCode": "NW8 8EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5247", "longitude": "-.169298"}}, "title": "Specialist Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250162", "validThrough": "2020-11-19T23:59:59+0000"}