{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-28T09:46:33+0000", "description": "&lt;p&gt;Applications are invited from qualified dental nurses for this full time position in Northumbria Dental Service. We are looking for a caring, enthusiastic and adaptable dental nurse to join our friendly team. Responsibilities will include assisting the dental clinician during routine clinical sessions, general anaesthetic sessions, orthodontics, school screening, dental surveys and domiciliary dental care. Staff are supported and encouraged to participate in clinical audit, CPD and in-house training days.&lt;/p&gt;\n&lt;p&gt;The Post holder may will also be required to cover 1 day a week at our clinic within Hexham Hospital.&lt;/p&gt;\n&lt;p&gt;The successful candidate will follow a set Trust and departmental induction plan and will be well supported during a 6 month probationary period.&lt;/p&gt;\n&lt;p&gt;Please note due to the current COVID-19 Pandemic there are limitations on some of the responsibilities listed above.&lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;National Certificate of the examination Board for Dental Nursing or Certificate of proficiency recognised by the Association of Dental Hospitals of Great Britain and Northern Ireland or a qualification approved by the secretary of state as being equivalent to one of the above&lt;/li&gt;\n&lt;li&gt;Current registration with the General Dental Council is required&lt;/li&gt;\n&lt;li&gt;Significant post qualification experience&lt;/li&gt;\n&lt;li&gt;Up to date clinical knowledge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In order for your application to be successfully processed we will require references from your current and previous employer(s) which &lt;strong&gt;must&lt;/strong&gt; cover a minimum period of &lt;strong&gt;three&lt;/strong&gt; years. Please ensure that the reference section of your application is completed appropriately giving the address, telephone number and work email address of each of your current and previous line manager(s). If this section is not fully completed your application may not be processed.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The successful post holder must be able to role model compassionate and inclusive leadership in order to shape the creation of a collective leadership culture within the Trust. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The post will be subject to a Disclosure and Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt;The post will be based at Morpeth Health Centre&lt;/p&gt;\n&lt;p&gt;The post-holder will be required to work at other sites within the Trust and you must have the ability to meet the transport requirements of this post to travel independently between clinics.&lt;/p&gt;\n&lt;p&gt;The post is subject to the Agenda for Change: NHS Terms and Conditions of Service Handbook.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be contacted via your NHS Jobs account within 1 month after the closing date, it is important you regularly check your emails as any interview details will be communicated to you via NHS Jobs and not by post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa SharpJob titleSenior Dental NurseEmail addresslisa.sharp@nhct.nhs.ukTelephone number01670 500967&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morpeth NHS Centre, Morpeth", "postalCode": "NE61 1JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1714", "longitude": "-1.68283"}}, "title": "Qualified Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245878", "validThrough": "2020-11-10T23:59:59+0000"}