{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 - £45000"}}, "datePosted": "2020-09-28T17:06:38+0100", "description": "&lt;p&gt;InHealth Intelligence has been and continues to be a proud supporter of the Diabetic Eye Screening Programmes across NHS England and since 2011, InHealth Intelligence has grown to offer fully managed services across the country. To increase efficiency, we also built our own software system which enables us to adapt and change to meet the requirements our employees to achieve a better user experience.&lt;/p&gt;\n&lt;p&gt;Due to our growth, we are looking for an experienced screener/grader, optometrist or ophthalmologist who has experience with Slit Lamp Bio-Microscopy to offer services to patients who are unable to have their retina screened by our standard Canon equipment, and to train colleagues to ensure we are operating at best practice.&lt;/p&gt;\n&lt;p&gt;If you enjoy working in different locations and meeting new people, this is an ideal opportunity as you’ll be travelling to sites around the Greater Manchester area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Maintain the highest standards of patient care and service delivery as well as maintaining fully compliant with the Data Protection Act&lt;/li&gt;\n&lt;li&gt;Manage clinics in a variety of community-based settings&lt;/li&gt;\n&lt;li&gt;Where applicable, identify risks to patient wellbeing and report immediately to the Programme Manager&lt;/li&gt;\n&lt;li&gt;Identify any patients requiring urgent referral at the time of their appointment&lt;/li&gt;\n&lt;li&gt;Provide first, second, arbitration, Digital Surveillance and Referral Outcome Grading&lt;/li&gt;\n&lt;li&gt;Maintain sufficient stocks of consumables&lt;/li&gt;\n&lt;li&gt;Read, understand and follow all the Retinal Screening Protocols concerned with the screening and grading of patients&lt;/li&gt;\n&lt;li&gt;Ensure all complaints, comments and compliments received, are logged and forwarded to the Programme Manager&lt;/li&gt;\n&lt;li&gt;Attend and fully participate in meetings regarding training, quality assurance, annual Personal Development Reviews&lt;/li&gt;\n&lt;li&gt;Complete all mandatory training e.g. First Aid, Information Governance&lt;/li&gt;\n&lt;li&gt;Undertake a minimum 100 SLBE grades per annum as per National Guidance; minimum 500/1000 digital gradings per annum and carry out the on-line EQA grading tests each month&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To succeed in this role, you will&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be compassionate and empathic towards the requirements of each individual patient&lt;/li&gt;\n&lt;li&gt;Be adaptable and possess the ability to think quickly and resolve problems&lt;/li&gt;\n&lt;li&gt;Have a minimum of 12 months slit lamp experience with diabetic patients&lt;/li&gt;\n&lt;li&gt;Be committed to on-going personal development by keeping up to date with mandatory training&lt;/li&gt;\n&lt;li&gt;Ideally have completed your Diabetic Retinopathy Screening Diploma or Level 3 Diploma for Health Screeners&lt;/li&gt;\n&lt;li&gt;Be Flexible and willing to operate out of multiple community sites and work some weekends&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What InHealth Intelligence can offer you!&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary plus expenses&lt;/li&gt;\n&lt;li&gt;A rewarding role where you can see the difference you are making everyday&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Intelligence Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M50"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4754", "longitude": "-2.30363"}}, "title": "Slit Lamp Examiner, Screener Grader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916203539", "validThrough": "2020-11-23T23:59:59+0000"}