{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T08:17:03+0100", "description": "&lt;p&gt;Band 4 Pharmacy Technician &lt;br /&gt;&lt;br /&gt;Are you a registered Pharmacy Technician looking for a new challenge?&lt;br /&gt;Do you want to develop yourself and our service to meet the needs of patients using your skills to improve patient care in one of the largest teaching hospitals in the country?&lt;br /&gt;If so, we’d love to hear from you!&lt;br /&gt;&lt;br /&gt;We are looking for a progressive and proactive technician with strong problem solving skills to join our friendly team. Applicants must be self-motivated and organised, be able to work effectively alone and as part of a team, and will contribute to the process of service development and innovation by your own initiative and enthusiasm.&lt;/p&gt;\n&lt;p&gt;The post will support the dispensary team leader and will include all aspects of dispensary activity and will be essential in ensuring our patients get the right medicines at the right time.&lt;br /&gt;You will also help in the training and development of our apprentices, assistants, technicians and pharmacists.&lt;/p&gt;\n&lt;p&gt;We are keen to receive applications from candidates working in any sector who hold a recognised Accredited Pharmacy Technician qualification. We welcome applications from Pre-Registration Technicians who are due to qualify in the near future. Prior hospital experience is desirable but not essential. Successful candidates would be given full training and development in order to fulfill specialist duties for this post.&lt;/p&gt;\n&lt;p&gt;UHL is one of the largest and busiest trusts in the country and provides care to over one million people in Leicestershire and Rutland. Leicester is a vibrant city with excellent transport links.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Walmsley Dispensary Team Leader&lt;/p&gt;\n&lt;p&gt;Rachel.walmsley@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;0116 2585443&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239671", "validThrough": "2020-11-09T23:59:59+0000"}