{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa"}}, "datePosted": "2020-10-28T17:00:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our busy Haemophilia Centre admin team . The Lead Coordinator is key in the effective operational delivery of our service and multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Excellent administration skills are required. The successful candidate will be an enthusiastic and a highly motivated team player, who shows flexibility and careful attention to detail. They will be required to respond in a timely manner to all enquiries from patients and all other agencies in the dealing with referrals and outpatient appointments, and providing patients with a high quality service. The role is a key link between clinical, nursing and medical teams, trust financial services and contracting departments.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to ensure accurate data submission and make the best use of resources available. They will need to make maximum use of available clinics slots, ensuring clinics are filled .The successful candidate will need to support the Haemophilia service in adding, cancelling or amending clinics/slots, under the instruction and guidance of management.&lt;/p&gt;\n&lt;p&gt;The post holder will work within tight deadlines and will require excellent prioritisation and time management skills. They will be required to carry out general office duties and to use a number of systems including Medway, eRS, Evolve and other NHS systems, both local and national. Previous experience of these systems is essential.&lt;/p&gt;\n&lt;p&gt;The Bristol Haemophilia Centre provides care to approximately 800 adults and children with heritable bleeding and thrombotic disorders in the South West region. This is a challenging and exciting opportunity for the successful candidate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Franklin Haemophilia Centre Manager emma.franklin@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;0117 3421872 / 0117 3421155&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Haematology and Oncology Centre, Brsitol", "postalCode": "BS2 8ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4583", "longitude": "-2.59763"}}, "title": "Lead Co-Ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247442", "validThrough": "2020-11-11T23:59:59+0000"}