{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum pro rata inclusive"}}, "datePosted": "2020-11-02T14:45:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Great&lt;/strong&gt;&lt;strong&gt; Ormond Street Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Admissions Coordinator - 18.75 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Operations and Images Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The admissions coordinator will have shared responsibility for scheduling admissions, relevant to a variety of specialities within surgical specialities. They will be required to achieve optimum efficiency of the use of all beds, and must ensure that waiting lists are validated, admissions co-ordinated and arranged, to meet government targets and Trust initiatives in particular during times of cross cover. They will be expected to be able to work unsupervised, and be able to use their own initiative to ensure the smooth running of all surgical admissions.&lt;/p&gt;\n&lt;p&gt;It will be important that they are a good team player, are also able to work independently and most importantly work efficiently and accurately.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who are able to use their initiative, be proactive and contribute to improving current working practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the continued effective admissions of surgical admissions in the absence of their colleagues during times of leave and sickness&lt;/li&gt;\n&lt;li&gt;To take full responsibility for the organisation, arrangement and prioritisation of admissions including diagnostic tests if needed&lt;/li&gt;\n&lt;li&gt;To take full responsibility for the emergency / weekend admissions&lt;/li&gt;\n&lt;li&gt;To take full responsibility for producing accurate waiting lists and admissions lists on a weekly basis as directed by the Admissions Manager&lt;/li&gt;\n&lt;li&gt;To ensure all patients are booked within 18 weeks RTT, and or planned list are not breaching clinically advised admit by dates.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Communication&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicate with patients and their representatives both verbally and in writing confirming pre-op and admission dates&lt;/li&gt;\n&lt;li&gt;To contact and liaise with support services and other specialities as needed by the patients and their families i.e. transport interpreters and Patient Hotel bookings, ensuring that documentation is sent to the necessary departments and parents are also notified.&lt;/li&gt;\n&lt;li&gt;To respond to requests from patients whether by phone or in writing with regards any inpatient query&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To take full responsibility for ensuring that all documentation is completed e.g. ward diaries, waiting lists, investigation and diagnostics robots&lt;/li&gt;\n&lt;li&gt;Monitor closely on a daily basis the PTL Lists, reporting bottlenecks and avoiding patient breaches&lt;/li&gt;\n&lt;li&gt;Ensuring all theatre sessions are populated 2 months in advance and planned 3 months ahead&lt;/li&gt;\n&lt;li&gt;To be able to cover for the Admissions Manager and other members of the admissions team as and when required&lt;/li&gt;\n&lt;li&gt;To undertake any other duties, commensurate with the banding of this post and within reason, as requested by the Admissions Manager.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Selina Ahmed and Munir Miah, Admission Managers on 020 7405 9200 ext: 0280 and ext 0083.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Admissions Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252478", "validThrough": "2020-11-16T23:59:59+0000"}