{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-23T09:45:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Epsom and St Helier University Hospitals NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant General Paediatrician &lt;/strong&gt;&lt;strong&gt;with Specialist Interest in Neonatology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10PA &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a Consultant Paediatrician with a specialist interest in Neonatology to Queen Mary’s Hospital for Children, St Helier Hospital, to help deliver our service in the boroughs of Merton and Sutton.&lt;/p&gt;\n&lt;p&gt;This post is a temporary post with a fixed term contract locum appointment for 6 months with potential to extend, depending on COVID-19 and will be based at St Helier hospital.&lt;/p&gt;\n&lt;p&gt;The post holder will work collaboratively with the acute Neonatal team to provide routine day to day acute neonatal services. There will also be additional on call commitment supporting both Neonates and General Paediatrics.&lt;/p&gt;\n&lt;p&gt;We currently offer our patients a wide range of acute paediatric and neonatal which this post is expected to contribute to.&lt;/p&gt;\n&lt;p&gt;Specifically this post would include providing attending consultant of the week with a 1 in 4 frequency in our Neonatology Unit.&lt;/p&gt;\n&lt;p&gt;As an organisation we are committed to develop our services in a collaborative manner with the local authorities, in ways that best suit the needs of our patients.&lt;/p&gt;\n&lt;p&gt;The successful applicant will play a crucial role in ensuring the team continue to deliver a high quality service and continue to work with our local partners in these unprecedented times. The post holder will join a team of 13 Acute Paediatric Consultants and 2 Associate Specialists. There are also 14 middle grade and 16 junior doctors on the acute paediatric and neonatal rotas, in addition to Clinical Nurse Specialist for Epilepsy, Asthma, Allergy and Diabetes&lt;/p&gt;\n&lt;p&gt;Routine educational activities include weekly junior doctor teaching programme in addition to Quality meetings, Child Protection Peer review and Mortality &amp; Morbidity meetings run as part of the monthly programme. There will be opportunities to build and further teaching and training ambitions, as we have middle grade trainees within the department.&lt;/p&gt;\n&lt;p&gt;Epsom &amp; St. Helier University Hospitals NHS Trust is rated as Good by the CQC and we’d welcome applications from individuals committed to being part of the team to maintain and build on this.&lt;/p&gt;\n&lt;p&gt;For any queries, please contact Dr Salim Yasin ext 3021 or Dr Arun Kundu ext 3021 at Queen Mary’s Hospital for Children, St Helier Hospital.&lt;/p&gt;\n&lt;p&gt;Full time, part time and Job share applications are welcome.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr. Salim Yasin&lt;br /&gt;Job title Clinical Lead, Paediatrics&lt;br /&gt;Email address salim.yasin1@nhs.net&lt;br /&gt;Telephone number X3021 via St Helier Hospital switchboard 020 8296 9600&lt;br /&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Arun Kundu&lt;/p&gt;\n&lt;p&gt;Clinical Director Paediatrics&lt;/p&gt;\n&lt;p&gt;arunavakundu@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: as above&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Mary&#39;s Hospital for Children, St Helier Hospital, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Locum Consultant General Paediatrician with Interest in Neonatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239884", "validThrough": "2020-11-15T23:59:59+0000"}