{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-20T12:00:52+0100", "description": "&lt;p&gt;This busy, expanding ICU/HDU directorate runs across several areas and cares for over 6,500 level 2-3 emergency and elective patients a year. We care for patients who need input from a broad range of specialities, including trauma, cardiac, neuroscience, vascular, general &amp; specialist medicine and surgery, obstetrics, plastic surgery and orthopaedics. Critical Care has a strong research culture and a team which encourages innovation and clinical excellence.&lt;/p&gt;\n&lt;p&gt;St Georges Healthcare is a leading NHS Trust employing over 4,000 staff and one of London’s designated Major Trauma Centres. We have several adult Intensive Care Units on the same site General (GICU) Cardiothoracic (CTICU) Neuro (NICU) We are rapidly expanding. We offer rotation opportunities as part of staff development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 –Experienced Staff Nurse Role*: &lt;/strong&gt;To deliver excellent nursing care demonstrating skills and competence in caring for a wide range of critically ill patients, to supervise and assess student and novice nurses and support the nurse in charge. To act in a responsible manner that demonstrates respect and kindness to others, in accordance with the trust values.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;*Minimum requirement of 2 years ICU experience, a nationally recognized post-registration ICU qualification with a minimum of 6 months post course consolidation and evidence of developing junior staff. Successful candidates will have outstanding communication skills and show a willingness to further expand their clinical, management and leadership skills. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnthea AllenJob titleSenior Sister GICU/ Recruitment Sister for ICU&#39;sEmail addressanthea.allen@stgeorges.nhs.ukTelephone number0208 725 0968Additional contact information&lt;/p&gt;\n&lt;p&gt;OR antheaallen@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s University Hospitals NHS Foundation Trust London, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Band 6 Experienced Staff Nurse – Adult Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234274", "validThrough": "2020-11-10T23:59:59+0000"}