{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-10-26T11:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Vacancy for a Full Time&lt;/strong&gt; &lt;strong&gt;Trust Doctor (ST4+ equivalent) in General Paediatrics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for the above post at Croydon Health Services NHS Trust to commence as soon as possible for six months - extendable to one year. We are looking for an ambitious candidate who will contribute to a friendly and collegiate environment. This post complies with the junior doctor’s hour’s regulations.&lt;br /&gt;Croydon University hospital is a large District General Hospital with links to the local teaching hospitals. The Paediatric Department has 14 Consultants; 17 middle grades and 16 SHO equivalents as well as a well-developed Children’s Hospital at Home Team service. &lt;br /&gt;The Department has an excellent reputation for teaching and training and there are good opportunities for the successful candidate to develop their own teaching skills.&lt;/p&gt;\n&lt;p&gt;Croydon University Hospital has a delivery rate of 4,000 a year and is a sub-regional Centre for Neonatal Intensive Care. The Unit has HFO as well as conventional ventilation and cooling.&lt;br /&gt;The successful candidate should have MRCPCH (part 1) or equivalent with full GMC registration as well as a minimum of two years’ experience at SHO/SPR level in Paediatrics. Part 2 holders would be an advantage. Applicants must be able to display organisational skills for the further development of the post.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further details/informal visits contact: Dr Sereesha Veleshala, Consultant Paediatrician or Dr Priya Ramaswamy, Consultant Paediatrician on 020 8401 3000 Ext 5993&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Paedatric Registrar", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242181", "validThrough": "2020-11-08T23:59:59+0000"}