{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "AfC Band 4 - pro-rata for part-time"}}, "datePosted": "2020-10-16T17:14:55+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Dorking Healthcare&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DHC is a GP Federation, representing 105,000 patients providing a wide range of quality healthcare services including elective care, Talking Therapies, community healthcare and primary care across Surrey, We are registered with the CQC (Care Quality Commission) and we are an accredited AQP (Any Qualified Provider).&lt;/p&gt;\n&lt;p&gt;As a dynamic and friendly organisation, we want our staff to enjoy working with us and fulfil their potential. In a recent survey, 73% of staff who responded told us they would recommend DHC as an employer and 80% feel enthusiastic about their jobs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Our organisation&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DHC is working at the centre of the local health system to evolve and deliver integrated care and that requires strong partnerships with many organisations. In all of our services, we aim to put the patient at the centre of their care, make sure our services are easy to access by local patients and reduce waiting times for patients.&lt;/p&gt;\n&lt;p&gt;A “can-do” attitude is a vital asset at DHC and we are looking for like-minded individuals to work with us who share the same approach and work ethic.&lt;/p&gt;\n&lt;p&gt;Recently, GP practices have been brought together into Primary Care Networks (or PCN’s) to offer services in the local community. There are three Primary Care Networks as part of the DHC Federation; Redhill Phoenix PCN, Dorking PCN and South Tandridge PCN. The PCN’s are critical to the changing NHS and are the focal point of all locally developed planning and service delivery.We are now recruiting into new roles to deliver these services; one of these new roles is that of Frailty Care Co-ordinator with the Dorking Primary Care Network of GP Practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Frailty Care Co-Ordinator&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering a fantastic opportunity for a motivated individual to join DHC to work as a Frailty Care Co-ordinator. The role will be based in the Dorking PCN, working across their GP Practice at:Brockwood Medical Practice, Leith Hill Practice, Medwyn Surgery Dorking Medical Practice and also in Dorking Hospital.&lt;/p&gt;\n&lt;p&gt;Full time is preferable but part time applications will be considered.&lt;/p&gt;\n&lt;p&gt;The Frailty Care Co-ordinator will have a pivotal administrative role in working with the GP Practices and the wider primary/community care team to ensure frail patients receive appropriate interventions to support them to live as independently as possible. The role will also have a focus on supporting the proactive delivery of care to frail patients. This will involve using patient systems and date to identify and assess those in need of proactive care and supporting the administrative co-ordination of a range of clinicians and social care to provide this care. It will involve working closely with the GP practices within the PCN and at times may include liaison with individual patients/carers to advise about health issues or provide social prescribing advice and guidance, bringing together all of a person’s identified care and support needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The person&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to really make your mark in a successful, growing healthcare organisation that is committed to seeking new, creative and better ways to deliver and develop our services.&lt;/p&gt;\n&lt;p&gt;To be successful in the role, you will need proven administrative and IT skills (including using various data sets and tools) and experience of managing a complex and varied administrative workload. You will also ideally have had experience of working in a similar role within healthcare or in the public sector, leisure or voluntary sectors, working with the general public. A good understanding of the needs of the frail elderly is essential and knowledge of community services and personalised care available would also be desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Travel between sites may be necessary so a car driver would be ideal.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;In return DHC offers staff the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salaries; for this role, we are offering the applicable NHS Agenda for Change Band 4 salary for this role (pro rata for part time).&lt;/li&gt;\n&lt;li&gt;We provide opportunities for training and development&lt;/li&gt;\n&lt;li&gt;We offer membership of the NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Some of our sites have free on-site parking (subject to availability)&lt;/li&gt;\n&lt;li&gt;We aim to be an employer of choice and conduct annual staff satisfaction surveys.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in applying, please complete an application form, referring to how your skills, qualification, knowledge and experience match the requirements set out in the person specification in your supporting statement.&lt;/p&gt;\n&lt;p&gt;You should also clearly state whether you wish to work full or part time; if part time, how many days/hours you would like to work.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130554.jpg", "name": "Dorking Healthcare Limited ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking", "postalCode": "RH4 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2259", "longitude": "-.332936"}}, "title": "Frailty Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231232", "validThrough": "2020-11-06T23:59:59+0000"}