{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-06T13:31:03+0000", "description": "&lt;p&gt;We are looking to recruit a full-time Band 7 Advanced Nurse Practitioner to work within our Personality Disorder Service.&lt;/p&gt;\n&lt;p&gt;This post requires that you have a Professional Health qualification, mental health nurse, and that you have a professional registration with the NMC.&lt;/p&gt;\n&lt;p&gt;This post will be based at any of our offices at Chesterton Medical Centre, in Cambridge, Gloucester Centre, Peterborough or Newtown Centre in Huntingdon, with having the ability to travel to our other bases throughout Cambridgeshire.&lt;/p&gt;\n&lt;p&gt;The service is a NICE compliant specialist outpatient service which operates across all four localities within Cambridgeshire and Peterborough Foundation Trust, Cambridge, Huntingdon, Fenland and Peterborough. The service has undergone an innovative redesign and is embarking on an exciting phase of delivering a high-quality service which strives for excellence for its service users.&lt;/p&gt;\n&lt;p&gt;The service provides evidence-based treatment protocols for patients with moderate to severe personality disorder which cover three main areas of impairment that the illness can present: namely psychological, occupational and social, with a specific focus on managing high chronic risk. The treatment protocols are based on models of Mentalisation Based Therapy, Dialectical Based Therapy and the Model of Human Occupation. There is an ethos of compassion for the lived experience of personality disorder, and therapeutic optimism for long term recovery that runs throughout. The service also offers consultation and training for other teams and services as well as close partnership working with GPs and primary care, and is committed to staff training, service evaluation and research.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be strong team workers with demonstrable commitment and enthusiasm for working with people with personality disorders and an understanding of the impact that personality disorder can have on quality of life.&lt;/p&gt;\n&lt;p&gt;Clinicians are expected to work in a variety of ways including the use of dialectical behaviour therapy, mentalisation based treatment and cognitive analytic therapy principles to engage and manage severely unwell patients with personality disorders. The service uses a range of different interventions, which include individual and group therapy.&lt;/p&gt;\n&lt;p&gt;Experience of facilitating group work in a mental health or social care setting would be an advantage, along with experience of working on a 1:1 basis with service users.&lt;/p&gt;\n&lt;p&gt;This is a lead role within the clinical team and is an excellent opportunity to develop your clinical and operational skills.&lt;/p&gt;\n&lt;p&gt;The ideal candidates will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Terry Boylan - Team Manager&lt;/p&gt;\n&lt;p&gt;Terry.Boylan@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01733 746800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Silver Birch, Gloucester Centre, Peterborough", "postalCode": "PE2 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5546", "longitude": "-.270029"}}, "title": "Advance Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259920", "validThrough": "2020-11-22T23:59:59+0000"}