{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-30T14:17:14+0000", "description": "&lt;p&gt;The Cardiothoracic Critical Care Unit is the North West Centre for Cardiopulmonary Transplantation. It includes the development of a VAD (ventricular assist device) programme, an established respiratory ECMO service and as part of our heart failure service we are able to provide cardiac ECMO. It consists of a 26 bedded purpose built Cardiothoracic Critical Care Unit and 5 bedded satellite Post-Operative Recovery Unit, combining both level 3 and level 2 care. As a team, we are committed to delivering the highest standards of care, and encourage and support staff development with the employment of full time practice based educators.&lt;/p&gt;\n&lt;p&gt;We are a major acute teaching Trust, recognised as a centre of clinical excellence and providing a wide range of health services to the areas of South Manchester, South Trafford, North East Cheshire and West Stockport.&lt;/p&gt;\n&lt;p&gt;You will be a committed, enthusiastic nurse joining our busy Regional Cardiothoracic Critical Care Unit. You will be able to demonstrate strong verbal and numerical skills and provide evidence of your commitment to continuing professional development. Rotation onto night duty is an essential part of the post.&lt;/p&gt;\n&lt;p&gt;Orientation, induction and mentorship programmes are fully established and we have links with the Critical Care Institute and other educational providers within Greater Manchester to support your development.&lt;/p&gt;\n&lt;p&gt;Being a nurse at MFT means you will be regarded as an equal by doctors, consultants and managers, you will have fantastic learning facilities and development opportunities, you will be respected, trusted, supported and rewarded, it&#39;s the way nursing should be.&lt;/p&gt;\n&lt;p&gt;We are committed to delivering the highest standards of quality care to our patients whilst demonstrating and celebrating the character of MFT through our values and behaviours framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Everyone matters&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;li&gt;Dignity and Care&lt;/li&gt;\n&lt;li&gt;Open and Honest.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;South Manchester is a diverse location with easy links to Manchester City Centre, great shopping, night life and sporting events. There is more than 500 square miles of inspiring woodland and countryside, crisscrossed by historical waterways and dotted with picturesque towns and fascinating attractions that make for great days out of the city.&lt;/p&gt;\n&lt;p&gt;If you would like to develop your career and be part of our exciting development across cardiothoracic critical care service please contact us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBerni CampbellEmail addressberni.campbell@mft.nhs.ukTelephone number0161 291 4836&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse - CTCCU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250537", "validThrough": "2020-11-15T23:59:59+0000"}