{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-11-03T09:46:26+0000", "description": "&lt;p&gt;We are looking for an enthusiastic Clinical Psychologist to join our inpatient (Tier 4) CAMHS unit for young people and their families. We have the option of appointment to a full time 8a post for suitably qualified and experienced candidates, or appointment to a Band 7 development post (also full time) for a newly qualified Clinical Psychologist. We will consider applications from current final year clinical psychology trainees qualifying in 2020.&lt;/p&gt;\n&lt;p&gt;The Cove is a Tier 4 CAMHS Unit which opened in Heysham in 2017. It provides an Inpatient Mental Health service for young people aged 13-18 to be treated and cared for on a single site. The post holder will work as a member of the multidisciplinary team to provide assessments, formulations and interventions for young people who have been referred to the service. This will include young people who are experiencing identity, personality and attachment difficulties, who have experienced trauma, loss and complex adversities in their lives and who are presenting behaviour which challenges us including self-harm, eating disorders and psychosis.&lt;/p&gt;\n&lt;p&gt;This is an exciting post which has been developed as part of the multidisciplinary team at The Cove. It has become available because of the career progression of the previous post holder. The post holder will be responsible for a significant part of the direct provision of clinical psychology to these young people at The Cove and their families, as well as contributing to the development of the whole staff team to become psychologically informed and to the development of a reflexive culture and community across the whole system of staff and service users. Given the high incidence of trauma, attachment difficulties and Adverse Childhood Experiences in the young people who come to The Cove, the service is committed to become a trauma informed, attachment informed provision. As part of the work that has already been done by the Psychology team, The Cove has move to a formulation-driven model of care, where all intervention, planning and recommendations are based on a thorough psychological understanding of the complex needs of the young people.&lt;br /&gt;The post holder will therefore play a significant role in the ongoing development and implementation of this fundamentally psychological model of care.&lt;/p&gt;\n&lt;p&gt;The Cove is working towards constant improvement in the safety and effectiveness of its service as well as enhancing the experience of those who use its service – actively supported, guided and informed by a group of experts by experience called “The Crew” comprising of past service users and parents/ carers of past service users.&lt;/p&gt;\n&lt;p&gt;The post holder will form part of an expanded Psychology and Psychological Therapy Team at The Cove comprising of a Consultant Clinical Psychology lead and a Family Therapist, in addition to this post, all based at The Cove in Heysham. They will maintain a direct clinical case load as well as being an active member of the multidisciplinary team. This is an exciting opportunity to be part of a dynamic team to provide the best possible care for young people and their families.&lt;/p&gt;\n&lt;p&gt;Staff working within our services have benefitted from a range of development opportunities including in-house training alongside colleagues and specific therapies training and supervision (e.g. tier 4 CYP IAPT training, DBT, DDP). There will be ample opportunity for post-qualification support, supervision and consolidation of core competencies alongside more experienced colleagues both locally and across the region. All clinical psychologists have an agreed Job Plan which protects their core clinical commitments and allocated time for agreed projects. Newly qualified clinical psychologists will also be offered a place on our cross-specialty in-house support and CPD programme.&lt;/p&gt;\n&lt;p&gt;There will also be opportunities to support the broader aims of leadership activity through indirect work, delivering training, and service development/audit activities. Where required, we will also support staff to develop competencies in clinical supervision as part of their professional development plan. We have good links with the North West Clinical Training courses and encourage staff to offer core and specialist placements to trainees.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tim Atkin by emailing tim.atkin@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Cove, Heysham", "postalCode": "LA3 2SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0359", "longitude": "-2.89155"}}, "title": "Clinical Psychologist Principal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253320", "validThrough": "2020-12-01T23:59:59+0000"}