{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa (based on full time hours)"}}, "datePosted": "2020-11-05T09:45:17+0000", "description": "&lt;p&gt;&lt;strong&gt;BAND 8a CLINICAL PSYCHOLOGIST Full time&lt;/strong&gt; or &lt;strong&gt;BAND 7 Preceptorship opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;OLDER PEOPLES MENTAL HEALTH Basingstoke CMHT &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Are you passionate about older people and their mental health? &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Band 8a Clinical Psychologist to work in the Basingstoke OPMH CMHT or a Band 7 Clinical Psychologist looking for a preceptorship opportunity.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be based at Parklands Hospital, Basingstoke. The service provides care to older people with mental health problems such as anxiety, depression, personality disorder and psychosis, as well as for people with dementia and their carers. A flexible approach to working practices is required to enable the service to meet the needs of the served population.&lt;/p&gt;\n&lt;p&gt;The responsibilities will include the provision of psychological assessment including neuropsychology and therapy to older people living in the community and to be a source of consultation, supervision and advice to the multi-disciplinary team and other mental health professionals on psychological issues. A prime aim is to enhance the psychological mindedness of the MDT and promote the delivery of evidenced based psychological practice. The post holder’s role will also be to develop stronger links with the local IAPT service, italk. Supervision of a Trainee Clinical Psychologist and contribution to service development will also be required.&lt;/p&gt;\n&lt;p&gt;Basingstoke is in the Mid and North Hampshire Division of Southern Health NHS Foundation Trust and there are currently 7 other Clinical Psychologists working with older people in the Trust. Regular clinical supervision will be provided and we also meet monthly as a group for neuropsychological supervision. There are close working relationships with Adult Mental Health Services and the University of Southampton, which is the base for the Doctorate in Clinical Psychology Course. There are opportunities to be involved in teaching Trainee Clinical Psychologists and for collaboration with other professionals and academic staff and participation in research.&lt;/p&gt;\n&lt;p&gt;The post can be appointed as a preceptorship towards an 8a role for the right applicant wishing to develop from a band 7 role and responsibilities would be adjusted accordingly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;For further information, please contact: Penny Fooks Clinical Psychologist on 07786027549 or Ros Butters-Moule Consultant Clinical Psychologist on 07769688548&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257090", "validThrough": "2020-12-03T23:59:59+0000"}