{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-07T16:46:41+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist in Old Age Psychiatry – &lt;/strong&gt;&lt;strong&gt;Gregory House, St. Martin’s Hospital, Canterbury – 10 PA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£82,096- £110,683 per annum, plus 0.5PA for on-call and 3% (of a 10 PA salary) Category A availability supplement. This is pro rata for part time staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that you will be required to submit an application form for each post you are interested in applying for.&lt;/p&gt;\n&lt;p&gt;Welcome to Kent and Medway NHS and Social Care Partnership Trust (KMPT) and the new career choice you have (or did not realise you have) been looking for.&lt;/p&gt;\n&lt;p&gt;COVID-19 has brought with it many challenges but it has also shown us alternative ways of effective working that look set to be adopted moving forward.&lt;/p&gt;\n&lt;p&gt;This includes &lt;strong&gt;home working&lt;/strong&gt; and the smart use of technology for both appointments with service users and staying connected to colleagues. Talk to us about how that could make a difference in your life.&lt;/p&gt;\n&lt;p&gt;There are many reasons to make East Kent in particular the place to live as well as work in 2020. Be it the stunning coastline, renowned and hidden histories, incredible schools, areas of outstanding natural beauty, fabulous food and drink, welcoming communities, stunning architecture and perfect days out.&lt;/p&gt;\n&lt;p&gt;Deal town has just been voted one of the best places to live in the UK this year with its cute seaside vibe, independent shops and burgeoning café culture. Either side of it are the art meccas of Margate and Folkestone, attracting world class exhibits and home to celebrated eateries and activities.&lt;/p&gt;\n&lt;p&gt;Sandwich and the surrounding villages will offer the quintessential Kent experience and are the destination if golf is your sport, with the excitement of the Open Championship coming in 2021. While Canterbury has drawn visitors for centuries; it is a breath-taking city full of heritage and attractions and the site for Kent’s new &lt;strong&gt;medical school&lt;/strong&gt;, set to benefit from your input and you from being involved.&lt;/p&gt;\n&lt;p&gt;Plus this corner of the country is often a tropical bubble when it comes to the weather and has excellent travel links to both the capital and the continent.&lt;/p&gt;\n&lt;p&gt;Take a closer look at East Kent to thrive both inside and outside of work.&lt;/p&gt;\n&lt;p&gt;As well as a new hire bonus (£15,000*) and financial support for relocation (up to £8,000*), &lt;strong&gt;we want to understand what flexibility means to you&lt;/strong&gt;. Is it a nine-day fortnight or condensed hours? Do you have caring responsibilities? Is there a certain day you cannot work for personal reasons? Talk to us.&lt;/p&gt;\n&lt;p&gt;We are stronger in our diversity with close to 60 nations represented and &lt;strong&gt;we want the real you to turn up at work&lt;/strong&gt;; it is an environment where you are encouraged to be yourself.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I can feel a real shift in feeling safer to speak up @kmptnhs We are getting better at listening without judgement. We are getting better at resisting the urge to jump to action. The networks (BAME, Faith, (dis)Ability and LGBTQ+) are reducing the effects of isolation and broadening views #stilllistening” &lt;/em&gt;- Celina on Twitter&lt;/p&gt;\n&lt;p&gt;We are all responsible for the evolving culture and the movement is tangible.&lt;/p&gt;\n&lt;p&gt;*Subject to conditions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information specific to the post&lt;/strong&gt;&lt;br /&gt;Canterbury CMHSOP is a friendly and well established team with four consultants. We provide a full range of community mental health services to people over 65 with functional psychiatric disorders and an all age service for those with confirmed or suspected dementia. It aligns with the GP surgeries of the former Canterbury and Coastal Clinical Commissioning Group.&lt;/p&gt;\n&lt;p&gt;The team receives on average 30 referrals per week. Our dementia diagnostic clinic is accredited by the RCPsych MSNAP process with medically led diagnosis appointments supported by integrated patient records between local trusts, excellent local radiology and neuroradiology services and good local access to cognitive neurology. Research is supported by the trust clinical trials unit. The team has close links with the voluntary sector, community geriatrics and a variety of other community based services through local virtual ward rounds. We host students from a number of medical schools and have post graduate training posts in psychiatry and the GP VTS programme.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have MRCPsych or equivalent and be on, or within six months of inclusion on, the Specialist Register and be fully registered with the GMC, as well as Approved Clinician and S12 approval under the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;/p&gt;\n&lt;p&gt;Please note that due to the current circumstances and travel restrictions in place, all interviews will be conducted via video link using Life Size on 30 November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re #KMPTProud &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please call Catharine Blackman on 01622 724133 or email catharine.blackman@nhs.net to make an appointment to speak to Executive medical director Dr Afifa Qazi or Deputy medical director, Rosarii Harte and click on the attached links to find out more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Richard Brown&lt;/p&gt;\n&lt;p&gt;Consultant Psychiatrist and Clinical Lead&lt;/p&gt;\n&lt;p&gt;Richard.Brown12@nhs.net&lt;/p&gt;\n&lt;p&gt;01227812083&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Efiong Ephraim&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;efiong.ephraim@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interim Assistant Medical Director&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gregory House, St Martin&#39;s Hospital, Canterbury", "postalCode": "CT1 1TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2769", "longitude": "1.1062"}}, "title": "Consultant Psychiatrist - St Martin&#39;s Hospital - Older Adult", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217373", "validThrough": "2020-11-08T23:59:59+0000"}