{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-29T12:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Team Manager (Band 7) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Older Peoples Mental Health Team Manager - Yeovil&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced Mental Health Manager looking for an exciting new opportunity in Yeovil? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For this post, we are looking to seek a Registered Mental Health Nurse, Registered General Nurse with Mental Health experience &lt;strong&gt;OR &lt;/strong&gt;an Occupational Therapist with Mental Health experience. Management experience is required.&lt;/p&gt;\n&lt;p&gt;We are currently looking to welcome a highly motivated team manager to work alongside our existing team manager for our Older Peoples Mental Health Team in South Somerset. This post offers a rare opportunity to maintain and develop your clinical practice within a leadership and management role. We would ideally like the successful applicant to be willing to complete the non medical prescribing course.&lt;/p&gt;\n&lt;p&gt;You will be expected to demonstrate that you have significant experience in the field of mental health and be a registered professional. Applicants will be responsible for the day to day management of a multidisciplinary community mental health team and a memory clinic and day service. You will be able to provide professional guidance and support to team members and carry a reduced clinical caseload.&lt;/p&gt;\n&lt;p&gt;Applications will be welcomed from professionals who already have leadership and management experience or who are able to demonstrate their aptitude to lead and influence a busy team. We particularly welcome applications from professionals who can demonstrate change management abilities and can lead and support staff effectively through service developments.&lt;/p&gt;\n&lt;p&gt;Responsibilities include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The day-to-day operational leadership and management of the Older Peoples Mental Health team.&lt;/li&gt;\n&lt;li&gt;Providing clinical leadership, support and supervision to staff within the team.&lt;/li&gt;\n&lt;li&gt;Ensuring a high standard of care and treatment for patients and their families and carers.&lt;/li&gt;\n&lt;li&gt;Meeting agreed objectives and targets.&lt;/li&gt;\n&lt;li&gt;Playing an active role in the development of services in line with the Trust’s Strategy and Business Plan and,&lt;/li&gt;\n&lt;li&gt;Working with a clinical caseload for 50% of contracted hours.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Somerset? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are able to offer a relocation package (T&#39;s &amp; C&#39;s apply) so if you&#39;re interested in relocating to Somerset, please give us a call and we&#39;d be happy to answer any queries you may have! Somerset is a beautiful county with contrasting landscapes and a diverse population. The county lies south of Bristol and North of Exeter and has fantastic links to the rest of the country. Central London is only two hours away. Whatever pace of life you’re looking for, Somerset has a place to suit. There are large vibrant towns alongside small villages and hamlets. The county boasts fantastic arts and sports facilities, spectacular shopping centres and breath-taking scenery – from the wilds of Exmoor to the beaches of Burnham-On-Sea – in short; there is something for everyone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details please call / email:&lt;/p&gt;\n&lt;p&gt;Sharon Phillips Neighbourhood Service Lead on 07557896621 or Laura Wilson Neighbourhood Service Lead on 07748 932193.&lt;/p&gt;\n&lt;p&gt;Please note the Job Description is a generic Team Manager description and the interview process will focus on the Older People Mental Health Team Manager role specifically.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Magnolia House/Bracken House, Yeovil", "postalCode": "BA20 2BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.946", "longitude": "-2.64626"}}, "title": "Integrated Team Manager, Older Person&#39;s Community Mental Health Team,", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248242", "validThrough": "2020-11-24T23:59:59+0000"}