{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110946", "minValue": "110946", "unitText": "YEAR", "value": "E6 6ZB"}}, "datePosted": "2020-10-05T13:23:56+0100", "description": "&lt;p&gt;A vacancy for 3 social work &amp; Carers Involvement post as arisen as part of our quality improvement initiatives. The successful candidate will join on of our 3 services - Personality Disorder/ PICU or Complex Rehab teams. You must be available to work 3 days a week one of which being Wednesdays.&lt;/p&gt;\n&lt;p&gt;Applicants should have at least 5 years post qualifying experience as a social worker.&lt;/p&gt;\n&lt;p&gt;As a member of the multi-disciplinary team, your duties will include providing detailed assessments of clients and advice on the clinical management team of complex cases, joint assessments with colleagues; liaison with family and patients home teams and support the implementation of Safeguarding procedures and policies. You will be expected to write a variety of reports including tribunal and CPA reports.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicants must hold a recognised social work qualification and be registered with the HCPC with evidence of relevant post-qualifying formal study. It’s essential that the successful applicant will have experience of working with service user with challenging behaviours with mental health needs and their families. You will work as part of a busy Multidisciplinary team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beckton, London", "postalCode": "DE24 8WZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9075", "longitude": "-1.455"}}, "title": "Social Worker &amp; Care Involvement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212892", "validThrough": "2020-11-27T23:59:59+0000"}