{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-26T12:30:40+0000", "description": "&lt;p&gt;South Central Ambulance Service is committed to providing high levels of patient care in a pre-hospital environment and is focused on delivering the right care at the right time to our patients.&lt;/p&gt;\n&lt;p&gt;Key to the delivery of these services will be through the expansion of specialist clinical roles, one of which is the Trainee Specialist Practitioner – Primary Care (paramedic).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This exciting opportunity involves successful completion of a 2-year training programme. The successful candidate will undertake the following development opportunities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Year 1 - Fully-funded Advance Clinical Practice modules (Level 7)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Year 2 – Portfolio of competencies in line with the ‘Paramedic Specialist in Primary and Urgent Care Core Capabilities Framework’ – once successfully completed, you will be eligible for Band 7 status.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborative working partnerships across primary care (rotational working)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Emergency Care – front line operations (rotational working)&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This exciting role will provide high quality, patient focused care and clinical leadership across the operational teams. This role will also involve collaborative and portfolio working opportunities, across a multitude of primary care settings, to include urgent care centres, walk-in centres and GP surgeries.&lt;/p&gt;\n&lt;p&gt;To develop and build on this innovative model, the Trust is currently seeking applications from registered paramedics who have the relevant clinical experience and qualifications to apply for this new development programme. Successful candidates will undertake a two-year educational programme (part-time; as outlined above). This will be a blended learning experience, which will include university modules at level 7, leadership training and clinical placements alongside operational practice. Whilst this is a supported programme, candidates will be expected to undertake some study/clinical placements in their own time during this period.&lt;/p&gt;\n&lt;p&gt;The Trust is offering this development opportunity to experienced paramedics, who are enthusiastic, dynamic and highly motivated. Applicants must participate in collaborative and portfolio working opportunities as required by the Trust (primary care settings); as well as being excellent communicators with effective influencing and negotiating skills. You will be working with multi-disciplinary teams across the NHS landscape, in order to ensure that appropriate care is provided for patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer a wide range of flexibility/shift patterns (self-rostering) to accommodate an effective work-life balance, as well as further development opportunities such as advanced clinical practice modules at post graduate level, for the right candidate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Specialist Practitioners will use specialist knowledge and skills to independently provide healthcare, focused in particular to patients with minor illness or injury, long term conditions, and other urgent care needs. The specialist will be responsible for the care of the patient including assessment, diagnosis, treatment, discharge and/or referral.&lt;/p&gt;\n&lt;p&gt;The specialist will be responsible for administering and supplying medicines, in line with Patient Group Directions. You will be expected to demonstrate evidence of taking personal responsibility for your own professional development, clinical leadership in an operational pre-hospital environment and have a strong desire to support and guide colleagues in other clinical roles. Applicants should be able to display sound clinical knowledge, including evidence of history taking and clinical triage in a sensitive manner, providing assessment, advice and treatment in line with clinical protocols and using professional judgement, and to show that they can work as part of a team or autonomously.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This programme will include study at Higher Education level 7, therefore, essential requirements for applicants wishing to apply for one of these development opportunities are:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;strong&gt;HCPC registration with demonstrable clinical experience in the operational pre-hospital setting, including RRV working. Candidates must be a band 6 clinician and have completed their NQP preceptorship period.&lt;/strong&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Full C1 UK driving licence.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;IHCD/FutureQuals Emergency Driving qualification (D1, D2).&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Evidence of successfully completing two Level 6 modules, with evidence of ‘recognition of prior learning’ (RPL). Please refer to the &#39;Additional information&#39; document for further details.&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are an internal candidate, you must not be the subject of an active or pending procedure in line with the Trust’s Discipline and Conduct Policy at the time of application, be able to demonstrate a good attendance record (subject to conditions covered by the Equality Act) and MUST provide evidence that your required Statutory and Mandatory training is up to date. All candidates will also be required to be supported in their application by their current management team, with a completed managerial nomination form submitted prior to interview (please see advert files).&lt;/p&gt;\n&lt;p&gt;Applicants should be aware that they will be expected to be deployed anywhere in the Trust during their training period, and that they will be expected to travel to the universities or other training locations, which may not be in their allocated locality. Some of the clinical placements may be outside the SCAS area. Base stations will be allocated in line with current business development needs and may be different from your current base station.&lt;/p&gt;\n&lt;p&gt;During the development period, trainees will be working and studying with registrants from other clinical disciplines.&lt;/p&gt;\n&lt;p&gt;The Job Description and Person Specification will provide further details. For further information or if you wish to discuss any element of this role please contact: Craig Barlow, Operations &amp; Engagement Manager – Primary &amp; Urgent Integrated Care craig.barlow@scas.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Shortlisted candidates will be required to attend a panel interview which will include external stakeholders.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire, Buckinghamshire, Berkshire, Hampshire", "postalCode": "HP11 2JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.629", "longitude": "-.762384"}}, "title": "Trainee Specialist Practitioner - Paramedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242430", "validThrough": "2020-11-15T23:59:59+0000"}