{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-06T15:16:50+0000", "description": "&lt;p&gt;Cornwall Foundation Trust - Child and Adolescent Mental Health Services Crisis Team are undergoing exciting development and changes due to significant investment to support crisis mental health services for young people across Cornwall.&lt;/p&gt;\n&lt;p&gt;The CAMHS Crisis Service has expanded and there will soon be a CAMHS Liaison Psychiatry team within the service; this post will predominantly work alongside and with support of the CAMHS Liaison Psychiatry Clinical Leads based at Royal Cornwall Hospital, and will offer psychosocial assessment to young people experiencing acute mental health difficulties who present at the general acute hospitals.&lt;/p&gt;\n&lt;p&gt;Where capacity allows, this post may also work with the community CAMHS Crisis Team which provides short-term intensive interventions to young people with acute mental health difficulties or are experiencing emotional dysregulation and displaying high risk behaviour, as an alternative to hospital admission. You will work closely with our new CAMHS inpatient unit and community CAMHS teams.&lt;/p&gt;\n&lt;p&gt;We are therefore looking for an individual to expand our existing dynamic team that is able to work effectively under pressure, places high worth in team based working but can also work autonomously, and who has an unrelenting passion and dedication for working with young people and their families.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining Cornwall CAMHS with the recent opening of our amazing newly built in patient unit - Sowenna; Cornwall is leading the way on a ground-breaking Clinical Associate Psychology (CAP) service, the first of its kind anywhere in England and Wales. There has also been major investment in developing care pathways for CAMHS as well as the Crisis Service developments.&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful and fun place to live, with opportunities to enjoy activities on the sea, rivers, beaches and moors. Summers are busy and full of entertainment and winters allow you to have to have peace, quiet and whole beaches to yourself.&lt;/p&gt;\n&lt;p&gt;Shifts will predominantly cover Monday-Friday, though there may be occasions where you may be asked to work weekends.&lt;/p&gt;\n&lt;p&gt;Additional support for the team is provided by the On Call Managers, the CAMHS consultants and the wider CAMHS team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Chloe Parkin&lt;/p&gt;\n&lt;p&gt;Job title CAMHS Crisis Team Manager&lt;/p&gt;\n&lt;p&gt;Email address chloe.parkin@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number07884233989&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact either Chloe Parkin (team manager), Gemma Morshead (clinical lead) or Freya Watts on 01208 834243 if you would like to discuss this role further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "IMPACT Hub, RCHT, Truro", "postalCode": "TR1 3LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2665", "longitude": "-5.09431"}}, "title": "CAMHS Crisis Senior Practitioner - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260339", "validThrough": "2020-11-22T23:59:59+0000"}