{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-01T09:15:43+0100", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;So, you’re eager to learn more about Registered Nurse opportunities within our Acute Frailty team at North Bristol NHS Trust. Here are some of the reasons we’re unique…&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are passionate about the acute care of older adults. Our Acute Frailty Unit is a 32 bedded assessment unit for acutely unwell older adults admitted to the Trust. We see a wide range of acute medical presentations. Patients are admitted for 24-48 hours assessment period before transfer to wards or discharge.&lt;/li&gt;\n&lt;li&gt;Our multidisciplinary team consists of Acute Geriatricians, Advanced Nurse Practitioners, Therapists, Pharmacists, Junior Doctors and Physiotherapists, who work collaboratively to treat a complex mix of acutely unwell frail medical patients.&lt;/li&gt;\n&lt;li&gt;•Our nurses have the opportunity tap into the expertise of band 6/7 specialist nurses and doctors as they handle patient assessment, investigation, diagnosis and the management of patients with an acute medical illness during the first 48 hours of their hospital stay.&lt;/li&gt;\n&lt;li&gt;•Our nurses move through our bespoke rotation packages across specialties, because we’re passionate about offering internal and external training for career progression and our nurses have access to an award winning in-house Practice Development Nurses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just our nursing teams which are impressive; our trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and well-being initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was&lt;strong&gt;higher than the national average&lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our staff don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations.&lt;/li&gt;\n&lt;li&gt;Staff are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Registered Nurse who is forward thinking, energetic and looking to join a dynamic developing service?&lt;/li&gt;\n&lt;li&gt;A newly qualified/qualifying nurse ready to take the leap from theory to the clinical setting, supported by a structured preceptorship and inspirational team?&lt;/li&gt;\n&lt;li&gt;A student nurse in final year of study, excited to secure your first qualified post within an innovative Trust?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So, are we right for each other? Here are your next steps…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our digital engagement events to hear on demand presentation from our clinical teams and gain an insight into working life in our Trust.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into life at North Bristol NHS Trust (search @NBTNursing onTwitter,Facebook,LinkedinandInstagram&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Senior sister lisa.herrington@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note, we are currently unable to accept applications from candidates who do not have registration with the Nursing and Midwifery Council.&lt;/p&gt;\n&lt;p&gt;Student Nurses will not be able to start in a band 5 role with us until they have received their registration and pin with the NMC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse - Emergency Zone - Acute Frailty Unit - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207619", "validThrough": "2020-11-15T23:59:59+0000"}