{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-28T10:45:11+0000", "description": "&lt;p&gt;We are looking for motivated, dedicated and ambitious nurses to join us at Alder Hey.&lt;/p&gt;\n&lt;p&gt;Alder Hey has earned its place as one of the world’s leading children’s hospitals, thanks to innovation and pioneering medical work we do. We are a centre of excellence for paediatric research and training across a variety of child health issues including being a major paediatric trauma centre. Our multidisciplinary teams provide high quality care across 60 specialities at our Alder Hey in the Park campus which was designed by children, for children. We support a widespread and diverse community across Liverpool and the North West and are a highly specialist hospital with global reach.&lt;/p&gt;\n&lt;p&gt;We are dedicated to supporting our diverse and talented community to do their best work in the best place delivering the care they aspire to and everyone’s contribution is recognised and valued.&lt;/p&gt;\n&lt;p&gt;Every single person who works for Alder Hey is critical to the care of the children and young people who walk through our doors and every single person matters and is key to creating a healthy future for our children.&lt;/p&gt;\n&lt;p&gt;We are dedicated to supporting our workforce to thrive at work and deliver the care they aspire to by leading healthy lives and support positive wellbeing through flexible working options, physical, mental and financial wellbeing support, championing our staff to make improvements in their area of work and offer a diverse range of staff support options. We have dedicated Academy in partnership with local and international partners enabling us to grow the future children and young people specialists.&lt;/p&gt;\n&lt;p&gt;We are excited to be recruiting band 5 paediatric nurses, to join our fantastic nursing team across our various wards and departments.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;For experienced nurses we offer a bespoke local induction and preceptorship package to meet your needs, created and overseen by the areas practice educator.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;For newly qualified nurses you will be supported by a team of dedicated practice education facilitators who will support you during your transition into the qualified nurse role, through a dedicated preceptorship programme and a rotational programme, which enables you to spend time across our medical and surgical divisions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have a particular interest in one of our specialities please let us know in the closing paragraph of your personal statement. (If there is no information supplied an area will be identified by the practise education team).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246138", "validThrough": "2020-11-15T23:59:59+0000"}