{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata per annum"}}, "datePosted": "2020-10-30T11:31:32+0000", "description": "&lt;p&gt;Velindre Cancer Centre is a specialist cancer treatment centre located in North Cardiff, providing services to over 1.5 million people across South East Wales and beyond.&lt;/p&gt;\n&lt;p&gt;Over the coming years, Velindre Cancer Centre is leading the way in which cancer care will be delivered in SE Wales. The Transforming Cancer Services (TCS) project aims to deliver cancer services using a ‘patient centered approach’ to care. This project will also involve building a new hospital with modern facilities and a ‘Centre of Excellence’ which will give better opportunities for audit and research in an area of medicine that is constantly changing; pharmacy being a core component of the TCS project.&lt;/p&gt;\n&lt;p&gt;Are you looking for some additional working hours or to gain experience working in a hospital environment? If the answer is YES, we are looking for a dynamic and enthusiastic band 4 Bank pharmacy technician to become part of our clinical pharmacy team. The role will predominantly involve clinical and medicines management services, dispensing medications for inpatients, outpatients and the chemotherapy day units. We will ensure that you are trained and as a valued member of our team, you will be given every opportunity to develop yourself further.&lt;/p&gt;\n&lt;p&gt;Recent hospital experience is desirable but we will consider candidates from all pharmacy sectors.&lt;/p&gt;\n&lt;p&gt;Working as a Bank Pharmacy Technician offers you flexibility. You would also be assisting the wider permanent team, covering for planned and unplanned absences.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 08/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Name: Susan Edwards&lt;/p&gt;\n&lt;p&gt;Job title: Senior Pharmacy Technician, Clinical Services&lt;/p&gt;\n&lt;p&gt;Email address: susan.edwards4@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 02920615888 x. 2206 &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123256.jpg", "name": "Velindre Cancer Centre", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123256"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Velindre Cancer Centre, Cardiff", "postalCode": "CF14 2TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5164", "longitude": "-3.22902"}}, "title": "Pharmacy Technician - BANK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249951", "validThrough": "2020-11-08T23:59:59+0000"}