{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-05T14:46:01+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist – St Martins Hospital, Canterbury CT1 1TD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£82,096 - £110,683 per annum, plus 0.5PA for on-call and 3% (of a 10 PA salary) Category A availability supplement. This is pro rata for part time staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that you will be required to submit an application form for each post you are interested in applying for.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Welcome to Kent and Medway NHS and Social Care Partnership Trust (KMPT) and the new career choice you have (or did not realise you have) been looking for.&lt;/p&gt;\n&lt;p&gt;COVID-19 has brought with it many challenges but it has also shown us alternative ways of effective working that look set to be adopted moving forward.&lt;/p&gt;\n&lt;p&gt;This includes &lt;strong&gt;home working&lt;/strong&gt; and the smart use of technology for both appointments with service users and staying connected to colleagues. Talk to us about how that could make a difference in your life.&lt;/p&gt;\n&lt;p&gt;There are many reasons to make East Kent in particular the place to live as well as work in 2020. Be it the stunning coastline, renowned and hidden histories, incredible schools, areas of outstanding natural beauty, fabulous food and drink, welcoming communities, stunning architecture and perfect days out.&lt;/p&gt;\n&lt;p&gt;Deal town has just been voted one of the best places to live in the UK this year with its cute seaside vibe, independent shops and burgeoning café culture. Either side of it are the art meccas of Margate and Folkestone, attracting world class exhibits and home to celebrated eateries and activities.&lt;/p&gt;\n&lt;p&gt;Sandwich and the surrounding villages will offer the quintessential Kent experience and are the destination if golf is your sport, with the excitement of the Open Championship coming in 2021. While Canterbury has drawn visitors for centuries; it is a breath-taking city full of heritage and attractions and the site for Kent’s new &lt;strong&gt;medical school&lt;/strong&gt;, set to benefit from your input and you from being involved.&lt;/p&gt;\n&lt;p&gt;Plus this corner of the country is often a tropical bubble when it comes to the weather and has excellent travel links to both the capital and the continent.&lt;/p&gt;\n&lt;p&gt;Take a closer look at East Kent to thrive both inside and outside of work.&lt;/p&gt;\n&lt;p&gt;As well as a new hire bonus (£15,000*) and financial support for relocation (up to £8,000*), &lt;strong&gt;we want to understand what flexibility means to you&lt;/strong&gt;. Is it a nine-day fortnight or condensed hours? Do you have caring responsibilities? Is there a certain day you cannot work for personal reasons? Talk to us.&lt;/p&gt;\n&lt;p&gt;We are stronger in our diversity with close to 60 nations represented and &lt;strong&gt;we want the real you to turn up at work&lt;/strong&gt;; it is an environment where you are encouraged to be yourself.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I can feel a real shift in feeling safer to speak up @kmptnhs We are getting better at listening without judgement. We are getting better at resisting the urge to jump to action. The networks (BAME, Faith, (dis)Ability and LGBTQ+) are reducing the effects of isolation and broadening views #stilllistening” &lt;/em&gt;- Celina on Twitter&lt;/p&gt;\n&lt;p&gt;We are all responsible for the evolving culture and the movement is tangible.&lt;/p&gt;\n&lt;p&gt;*Subject to conditions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information specific to the post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will be Consultant Psychiatrist to the In-Patient Ward in St Martins Hospital, Littlebourne Road Canterbury. He/she will provide senior medical cover for all acute inpatients (18 patients) admitted to the ward. The post-holder will be the Responsible Clinician (RC) for all detained inpatients.&lt;/p&gt;\n&lt;p&gt;The post-holder along with his/her designated GPST Trainee and Speciality Doctor will be responsible for all clinical work and related administrative work including mental health act work and along with other team members ensure that patients have good quality care in line with the trust values.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to work closely with the ward manager and other professional groups to deliver to deliver high quality and evidence based clinical care to inpatients and take a lead on clinical governance including the delivery of key performance indicators.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have MRCP or equivalent and be on, or within six months of inclusion on, the Specialist Register and be fully registered with the GMC, as well as Approved Clinician and S12 approval under the Mental Health Act.&lt;br /&gt;&lt;br /&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;/p&gt;\n&lt;p&gt;Please note that due to the current circumstances and travel restrictions in place, all interviews will be conducted via video link using Life Size in October 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’re #KMPTProud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please call Catharine Blackman on 01622 724133 or email catharine.blackman@nhs.net to make an appointment to speak to Executive medical director Dr Afifa Qazi or Deputy medical director, Rosarii Harte and click on the attached links to find out more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Vijay Delaffon Job title Interim Assistant Medical Director - Acute Care Group Email address vijay.delaffon@nhs.net Telephone number 01322622222&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Martins Hospital, Canterbury, Canterbury", "postalCode": "CT1 1TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2769", "longitude": "1.1062"}}, "title": "Consultant Psychiatrist - St Martin&#39;s Hospital, Acute", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213200", "validThrough": "2020-11-08T23:59:59+0000"}