{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus HCAS"}}, "datePosted": "2020-10-28T10:01:55+0000", "description": "&lt;p&gt;North East London NHS Foundation Trust (NELFT) is one of the largest NHS trusts of its kind in the country. Providing mental health and community services across north east London and south west Essex, we are committed to making the most of opportunities to work across traditional healthcare boundaries to bring real benefits to our patients and service users.&lt;/p&gt;\n&lt;p&gt;Our core aim is to improve the overall health and wellbeing of local people. We work closely with other organisations and are continuously looking to develop innovative, integrated and comprehensive healthcare services that support people out of hospital where possible.&lt;/p&gt;\n&lt;p&gt;With an annual budget of more than £300million, we provide care and treatment for a population of almost 1.5 million people in their own homes, in health centres and in hospital. We employ around 5,500 staff.&lt;/p&gt;\n&lt;p&gt;The extensive range of specialist services we provide means that it is possible to get a variety of different working experiences within the same organisation.&lt;/p&gt;\n&lt;p&gt;NELFT recognises its responsibility to safeguarding and promoting the welfare of children, young people and vulnerable adults and to protecting them from the risk of harm. We expect all staff to undertake this commitment and applicants will be subject to recruitment processes that support this.&lt;/p&gt;\n&lt;p&gt;--------------------------------------------------------------------------------&lt;/p&gt;\n&lt;p&gt;Do you want to help service users ‘live the life they want’? North East London NHS Foundation Trust’s mission statement is to enable our service users to recover and live the life they want. Key to achieving this is recruiting high quality staff who support our mission and values. All staff are expected to demonstrate in their day to day work the values described in the staff charter which is part of every job description.&lt;/p&gt;\n&lt;p&gt;North East London NHS Foundation Trust (NELFT) provides NHS mental health services for almost 1 million people living in Waltham Forest, Redbridge, Barking &amp; Dagenham and Havering. The extensive range of specialist services provided by NELFT include hospital based services and services in the community. Therefore it is possible to get all sorts of different experiences within the same organization by moving from team to team – either through promotion or to gain broader experiences.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapy profession within NELFT mental health services is a highly valued vibrant group based across the range of mental health services. Occupational Therapists work as integrated members of multi-disciplinary teams contributing their unique professional skills, supporting service users to increase their independence and achieve their personal goals while supporting recovery and social inclusion.&lt;/p&gt;\n&lt;p&gt;Occupational Therapy practice in NELFT uses MOHO tools to assess needs and measure outcomes and actively develops professional practice through directorate CPD groups. All occupational therapists receive professional supervision from an O.T.&lt;/p&gt;\n&lt;p&gt;The professional lead OT for mental health services is also the lead for social inclusion as is each lead OT within the directorates. If you are a forward thinking OT who wants to promote high quality practice, have opportunity to demonstrate clinical leadership and you want to work closely with principles of recovery and social inclusion, then NELFT has the following post available.&lt;/p&gt;\n&lt;p&gt;The Community Health &amp; Social Care Learning Disability Team in Redbridge is looking for an enthusiastic and committed Band 7 Occupational Therapist. This is an exciting opportunity to provide occupational therapy input to adults with a learning disability, some of whom will have additional complex needs as a result of a physical disability, mental health problems, challenging behaviour, sensory impairment, dementia etc.&lt;/p&gt;\n&lt;p&gt;The post holder must:&lt;/p&gt;\n&lt;p&gt;• • Have a diploma or degree in Occupational Therapy, and be a member of the Health and Care Professions Council (or eligible for HCPC membership).&lt;/p&gt;\n&lt;p&gt;• Have a minimum of three years post-qualifying experience as an Occupational Therapist&lt;/p&gt;\n&lt;p&gt;• Experience of working with people with learning disabilities and complex needs&lt;/p&gt;\n&lt;p&gt;• Have excellent interpersonal and communication skills.&lt;/p&gt;\n&lt;p&gt;The post holder will be the senior OT in the team. Assessment and intervention focuses on enabling people with learning disabilities to participate actively in their home lives, and in the local community, developing skills to improve their independence and safety. You will work within an integrated health and social care team, providing input alongside psychiatry, psychology, social work, nursing, speech and language and physiotherapy colleagues.&lt;/p&gt;\n&lt;p&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;p&gt;• To independently manage a caseload of service users with learning disability living in the London Borough of Redbridge, many of whom will have complex needs.&lt;/p&gt;\n&lt;p&gt;• To use clinical reasoning to assess how learning disability, mental health and physical health impacts upon occupation and performance of service users.&lt;/p&gt;\n&lt;p&gt;• To apply specialist assessments and interventions through individual and group work that is outcome focussed and promotes social inclusion and recovery.&lt;/p&gt;\n&lt;p&gt;• To provide advice and training to carers, colleagues in the Integrated Team and across mainstream health and social&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Health and Social Care Fairlop Team, Ilford", "postalCode": "IG6 1HZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5873", "longitude": ".081483"}}, "title": "Lead Learning Disabilities Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245961", "validThrough": "2020-11-25T23:59:59+0000"}