{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 -  £36,738  per annum inc"}}, "datePosted": "2020-11-02T14:01:40+0000", "description": "&lt;p&gt;Advert&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Neurosciences and Stroke Service at the Royal London Hospital is very excited to offer a brand-new rotational programme for newly qualified or experienced nurses, developing into specialist practitioners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The programme will run for 24 months across our Hyper Acute stroke unit, Neuro Monitored Unit and our neurosurgical ward, with a placement of 8 months in each area at the end of which you may choose where you would like to take up your permanent post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Barts Health is part of one of the largest academic health sciences system in the world, our Hyper Acute Stroke Unit benefits from a dedicated research team conducting cutting edge research on the ward. The neuro monitored unit and neurosurgery wards benefits from world class inventive and state of the art surgery. The aim of our service is to provide world class care to all our patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nurses will gain a wide range of experience in our monitored units and as well as nursing highly acute patients, including those with Strokes, post thrombectomy, tracheostomy, unstable spinal injury and major head injury. Our patient group is very diverse, with complex cases, as well as routine and emergency neurosurgery/neurology, head and neck and max fax.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting and excellent opportunity for newly qualified or experienced nurses to become competent practitioners, experienced in a specialist area of your choice – Stroke or Neurosurgery. You will be given a preceptor and opportunity to work alongside the Practice Development Facilitator on the unit. All Band 5 Staff Nurses will also work towards achieving the Pan London Stroke Nursing Competencies and Neurosciences Competencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this opportunity you are strongly advised to apply for this post as soon as possible. This advertisement will close as soon as sufficient applications are received.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Find out more about us and Follow Us on Twitter @RoyalLondonHosp!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information please contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Elsa Cardoza, Senior Nurse, Neurosciences &amp; Stroke &lt;/span&gt;&lt;span&gt;e.cardoza@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Elsa Cardoza, Senior Nurse, Neurosciences &amp; Stroke Elsa.Cardoza@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Neurosciences and Stroke Rotational Programme", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252322", "validThrough": "2020-11-15T23:59:59+0000"}