{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-10-29T13:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Therapy Services&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Band 6 Physiotherapist, Health Care of the Older Person&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Fulltime - 37.5 hours per week&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;FTC and / or Secondment &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We have a great opportunity for you to join a friendly and dynamic Health Care of the Elderly Team at NUH. The team work across both sites (Queens Medical Centre &amp; City) where HCOP wards are established.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role is for a band 6 static physiotherapist to join a large, well-established HCOP team working closely with other members of the MDT. The successful candidate will be responsible for their own inpatient caseload as well as supporting band 5 therapists and band 2-4 support workers . This role is supported by experienced and knowledgeable Advanced practitioners and Team Leaders. You will have the opportunity to work on various wards including the mental health unit, the integrated therapies ward and the Acute admissions ward. The clinical caseload will include patients with complex medical conditions and will give the opportunity to gain skills in working with different conditions including neurology, respiratory, orthopaedics and general medicine. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be supported to improve your own skills and knowledge through teaching and training, attendance at external courses and project work. At NUH we have a band 6 development programme which supports staff to grow in their role , improve project and presentation skills and develop as a physiotherapist for the future. You will also be expected to deliver teaching and training to the HCOP team as appropriate.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;NUH has a strong working relationship with the University of Nottingham and the successful candidate is expected to supervise students from the Universities of Nottingham and Sheffield. Experience with students is preferred but not essential. The successful candidate is expected to attend a course on clinical education if not already qualified.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In order to support patient care and the flow through the Trust you will be expected to work on the respiratory out of hours rosters, which include both weekend duties and overnight on-calls and you will need to be able to demonstrate that you have the competencies to do so.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This role is ideal for a highly motivated professional who has an interest in working within inpatient care and can communicate well at all levels. Effective team work and flexibility is essential and also leadership skills, enabling you to deputise for a band 7 in the operational day to day planning for this busy team.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you think this is the role for you please contact one of the Team Leaders for more information or to arrange an informal visit&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMike PearsonJob titlePhysiotherapy Team Leader HCOPEmail addressMichael.Pearson@nuh.nhs.ukTelephone number07812 269725Additional contact information&lt;/p&gt;\n&lt;p&gt;Also contact:&lt;/p&gt;\n&lt;p&gt;Laura Town, Laura.Town@nuh.nhs.uk, 07812 269725&lt;/p&gt;\n&lt;p&gt;Jem Thaker, Jem.Thaker@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Both, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248543", "validThrough": "2020-11-12T23:59:59+0000"}