{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26896", "minValue": "23887", "unitText": "YEAR", "value": "14.21 - 16.00"}}, "datePosted": "2020-10-14T09:12:28+0100", "description": "&lt;p&gt;Kent House is a 17-bedded Tier 4 low secure hospital for young people aged 12 – 18 years with mental health, behavioural or psychological difficulties, and an OFSTED-registered school which supports the young people with educational attainment.&lt;/p&gt;\n&lt;p&gt;The service is set in a rural environment with close links and transport to the local community and amenities.&lt;/p&gt;\n&lt;p&gt;We provide care for the young people admitted to Kent House Hospital in the least restrictive way and we adhere to the values and principles of Positive Behaviour Support (PBS). We are members of the Quality Network for Inpatient Camhs to measure and improve the quality of our care and treatment.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orpington, Kent", "postalCode": "BR5 4EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3885", "longitude": ".124811"}}, "title": "Bank Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225427", "validThrough": "2020-11-13T23:59:59+0000"}