{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T11:56:30+0000", "description": "&lt;p&gt;For 35 years Sidmouth Hospiscare has been offering care and support to people in the Sid Valley with a life limiting illness (diagnosed as palliative), as well as their carers and families. This includes commissioning and funding a specialist nursing team and hospice beds from Hospiscare in Exeter for patients with complex needs.&lt;/p&gt;\n&lt;p&gt;The demand for these services is expected to increase significantly due to the ageing population, and most patients want to remain in their own homes. Sidmouth is at the forefront of this challenge in the UK and Sidmouth Hospiscare has been working with local GPs and the RD&amp;E to understand the needs of palliative patients in the Sid Valley, including those who do not require complex nursing but they or their carers need support. They are now introducing the Sid Valley Integrated Model for Palliative and End of Life Care For All which aims to integrate the available services within the community into a “one-team” approach to provide the best possible care for all patients who are diagnosed by their GP as palliative, regardless of diagnosis or complexity, guided by the individual needs and wishes of the patient and their carer.&lt;/p&gt;\n&lt;p&gt;Hospice at Home Palliative Care Team, funded by Sidmouth Hospiscare and managed by RD&amp;E in Sidmouth, providing 24/7 care in the Sid Valley. These nurses will provide continuity of care for all palliative patients and their families, including: specialist symptom control for complex patients; hospice at home nursing care to enable more patients to remain in their own homes and prevent unnecessary hospital admissions; psychological and emotional support for all patients and families; coordination and oversight of wider community support to meet the individual needs of each patient and their family.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced and motivated Registered Nurses with a passion to support people in the palliative and end of life stages of their illness, to be part of this innovative team under the oversight and direction of the Nurse Specialist Team Manager or her deputy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Forfurther details or to arrange a visit please call Mary Ashby – Nurse Specialist Team Manager Sidmouth Hospice at Home on 07729 123709 /mary.ashby@nhs.net.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sidmouth", "postalCode": "EX10 8EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6815", "longitude": "-3.23886"}}, "title": "Nurse Specialist Sidmouth Hospice at Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242306", "validThrough": "2020-11-09T23:59:59+0000"}