{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-10-09T09:30:52+0100", "description": "&lt;p&gt;Applications are invited for a replacement post of Consultant Haematologist. The post holder will join a team of 5 consultants, 1 specialist registrar, 1 rotational core trainee, 1 specialty doctor and a team of Macmillan clinical nurse specialists. The post is based at East Surrey Hospital, Redhill, with some outpatient duties at Crawley Hospital. The post holder will be expected to work closely with all laboratory staff within Haematology and the Pathology Directorate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full-time post providing 10 Programmed Activities (PAs) excluding on call duties (1:5), however, applicants wishing to work part-time are also encouraged to apply and job plans will be adjusted accordingly, and by negotiation with appointees.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should have wide experience in Clinical Haematology and will be expected to have broad experience in all aspect of Haematology, including haemato-oncology, suitable to meet the needs of this busy District General Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Part of the role will include support in pre-clinic chemotherapy prescribing, laboratory work including blood film and bone marrow aspirate reporting as well as lab supervision of the existing team of junior doctors. There is a strong interest in the Department in all aspects of haematological malignancy including Acute Leukaemia, CLL, myeloma and lymphoma.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust has a dedicated Haematology ward comprising of 5 single HEPA filtered rooms with en-suite bathrooms adjacent to the Trust’s chemotherapy unit. Discussion with our colleagues in Medical Division is currently taking place to increase our bed base from 5 to 16 beds to respond to current in-patient demand.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be undertaking both inpatient and outpatient work, with outpatient work delivered at both East Surrey and Crawley hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is highly recommended that prospective candidates take the opportunity to come and visit the Trust and the Haematology Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Should you wish to discuss this post informally or arrange a visit please contact:-&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Pawel Kaczmarek, Clinical Lead for Haematology Department. Tel: 01737 768 511 Ext: 6473&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interview date: Tuesday 24th November 2020, East Surrey Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Pawel KaczmarekJob titleClinical Lead for HaematologyTelephone number01737 768511 Ext: 6473&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219563", "validThrough": "2020-11-07T23:59:59+0000"}