{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-11-02T11:15:41+0000", "description": "&lt;p&gt;&lt;strong&gt;CAMHS Nursing Opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Mental Health Nurse who is caring, compassionate and committed to providing excellent care for young people and their families. If you excel at working with families to promote optimal functioning and well-being and are able to work in a multi-disciplinary setting, to ensure the provision of evidence based interventions to the young people in our care, then we are interested in hearing from you.&lt;/p&gt;\n&lt;p&gt;We would also like to hear from you if you are a caring, compassionate and committed Mental Health Nurse, RGN or RSCN currently working outside of CAMHS who has experience of ADHD and would like to further develop their skills in order to provide the best possible care for young people, their families and carers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit a Band 7 CAMHS nurse for Brighton and Hove specialist CAMHS service to lead on the ADHD Pathway.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder must have at least 2 years ADHD experience and either be a non-medical prescriber, or willing to undertake this training.&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will need to be an excellent communicator, a credible and motivational role model for nurses, and keen to work in a challenging and rewarding environment. You will need to be creative, hardworking, be able to demonstrate and have confidence in your ability to manage complex clinical situations and to work effectively in a team. Some travel across your designated area is also part of the job. As a senior nurse you will provide leadership and supervision for students and junior nurses&lt;/p&gt;\n&lt;p&gt;You will receive on going supervision, support and have a annual appraisal to enhance your own skills. In return you will harness your existing skills and enthusiasm to deliver the best possible care to the young people of Brighton &amp; Hove, their families and carers who are referred to our services.&lt;/p&gt;\n&lt;p&gt;The hours are with some flexibility required.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion P&lt;/span&gt;&lt;strong&gt;lease contact either:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sarah Goodfellow - Lead Nurse tel: 07391 012431&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Abby Maitland - Locality Manager tel: 07738758230&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Aldrington Centre, Brighton", "postalCode": "BN3 4EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8303", "longitude": "-.207817"}}, "title": "Clinical Nurse Specialist - CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251734", "validThrough": "2020-11-16T23:59:59+0000"}