{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T15:46:18+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the National Bowel Cancer Screening Programme. We are looking for a conscientious, motivated hard working individual to join our Service.&lt;/p&gt;\n&lt;p&gt;The individual must be committed to delivering a first class gold standard service whilst ensuring the patients have the best possible experience throughout their pathway. Excellent organisational and communication skills is vital.&lt;/p&gt;\n&lt;p&gt;Alongside being able to work independently, the role requires the individual to work within a multidisciplinary team and support the multidisciplinary team meetings. The individual needs to manage their own case load but at the same time they should be able to work to targets.&lt;/p&gt;\n&lt;p&gt;The requirement to complete academic training which includes Advanced communication skills training and a module at Degree/Masters level at Liverpool John Moors University is compulsory, this is to ensure the individual is meeting the training requirement for this role and maintaining the gold standard of the service.&lt;/p&gt;\n&lt;p&gt;The service currently works across two sites Royal Stoke and County hospital and the post holder will be required to work across both sites. Health inequality work is undertaken by the whole team to raise awareness, this can lead to off site working and community travelling will be required.&lt;/p&gt;\n&lt;p&gt;The successful individual will be fully supported to complete their induction training and the academic module required for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarol BeestonJob titleLead Specialsit Screening Nurse PractitionerEmail addresscarol.beeston@uhnm.nhs.ukTelephone number01782 676641&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke University Hospital, Stoke on trent", "postalCode": "ST46QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Specialist Screening Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256491", "validThrough": "2020-11-25T23:59:59+0000"}