{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-30T14:16:54+0000", "description": "&lt;p&gt;Practice Development Nurse – Band 7 –- Medicine and Emergency Care Division.&lt;/p&gt;\n&lt;p&gt;*Breaking News*&lt;/p&gt;\n&lt;p&gt;Would you like to be actively involved in the growth of the workforce within Maidstone and Tunbridge Wells Trust?&lt;/p&gt;\n&lt;p&gt;The Division of Medicine and Emergency Care are pleased to announce a Practice Development Nurse Band 7 position within the Practice Development team at Tunbridge Wells Hospital. This exciting role is an ideal development opportunity for a band 6/7 nurse who has experience in practice development and supporting staff within their clinical setting.&lt;/p&gt;\n&lt;p&gt;The Practice Development Team has led on a number of initiatives which focus on person centred and evidence-based care. Committed to the recruitment and retention of staff, they are dedicated in ensuring that teams work effectively together in an innovative and forward thinking environments.&lt;/p&gt;\n&lt;p&gt;We are searching for a candidate who has a natural drive for improvement, with the right personal attributes to lead on supporting varying levels of leaners within our clinical areas. This valued team member will work to provide support to a range of clinical staff, overseeing and leading the CSF’s working within the Practice Development team. Areas of scope to include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting new starters, including overseas and return to practice nurses.&lt;/li&gt;\n&lt;li&gt;Working with clinical areas to develop learning environments.&lt;/li&gt;\n&lt;li&gt;Support clinical leaders through staff development and performance management.&lt;/li&gt;\n&lt;li&gt;Clinical skills teaching&lt;/li&gt;\n&lt;li&gt;Recruitment and retention initiatives.&lt;/li&gt;\n&lt;li&gt;Professional development&lt;/li&gt;\n&lt;li&gt;Supporting learners within the clinical environment&lt;/li&gt;\n&lt;li&gt;Consulting on Trust wide practice Development initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will need to have experience working within an acute clinical setting, have strong organisational skills, be a strong leader, be a role model, hold a Practice Assessor qualification and be able to demonstrate involvement in previous quality improvement initiatives.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal chat about this post, please contact Jules Partridge Lead PDN 07593131291&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Julie Partridge, Lead Practice Development Nurse, julieayling@nhs.net&lt;/p&gt;\n&lt;p&gt;I you would like to have an informal chat regarding this position, please contact Jules Partridge - Lead PDN - 07593131291&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross site, maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Practice Development Nurse - Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250524", "validThrough": "2020-11-13T23:59:59+0000"}