{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 Per annum"}}, "datePosted": "2020-10-16T08:16:36+0100", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT IN CLINICAL GENETICS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the above full-time (10 PA) post in Clinical Genetics based at Northampton General Hospital, Cliftonville Rd, Northampton NN1 5BD. This is a locum post for 1 year in the first instance. This post is part of the Leicester, Northampton, Rutland (LNR) Regional Genomic Medicine Service in Leicester.&lt;/p&gt;\n&lt;p&gt;We are pleased to advertise for a full-time consultant Clinical Geneticist with General Genetics training to join our team. This is a replacement post. The job plan is flexible at present and will include clinics in Northampton and Kettering as well as carrying out inpatient consultations as required. The post will have general and paediatric sessions, covering a population of about 790,000 people. The successful candidate will join a small local team based at NGH consisting of 2 genetic counsellors and administrative support and an expanding and dynamic team of Consultants and Genetic counsellors based in Leicester. Part-time or suitably qualified job-share applications will be welcomed. The service offers excellent personal development opportunities. It is expected that the successful applicant will be fully involved in the teaching of Genomic medicine and workforce development and in view of the forthcoming changes to the Genomic medicine service nationally and the implementation of the National Genomic testing directory.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the General Medical Council and be eligible for inclusion onto the GMC Specialist Register. Those trained in the UK must have evidence of Higher Speciality training leading to a Certificate of Completion of Training (CCT) in Clinical Genetics, or the expected date of award of CCT falls within 6 months of the date of the interview. Non-UK applicants must demonstrate equivalent training.&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a license to practice) and right to work in the UK are essential for this post. Successful applicants will already have GMC registration or will be able to demonstrate that they are eligible. Applicants requiring Tier 2 sponsorship should ensure that they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Lalith Chandrakantha&lt;/p&gt;\n&lt;p&gt;Clinical Director, Paediatrics&lt;/p&gt;\n&lt;p&gt;lalith.chandrakantha@ngh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01604 544559&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Jenny Carmichael&lt;/p&gt;\n&lt;p&gt;Consultant Geneticist&lt;/p&gt;\n&lt;p&gt;jenny.carmichael@ngh.nsh.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Professor Pradeep Vasudevan&lt;/p&gt;\n&lt;p&gt;Consultant Geneticist&lt;/p&gt;\n&lt;p&gt;pradeep.vasuevan@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Locum Consultant - Genetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229320", "validThrough": "2020-11-13T23:59:59+0000"}