{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-28T12:30:19+0000", "description": "&lt;p&gt;NHS Rotherham Clinical Commissioning Group (NHS Rotherham CCG) has an exciting opportunity for a highly motivated individual. The post holder will have knowledge and experience of project managing an active service with senior practitioners on a number of effective care pathways.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will support NHS Rotherham CCG in the development of systems and process that support the day to day management of an identified number of crucial functions; namely with Serious Incidents (SIs) and Never Events (NEs); Infection Control and Prevention (IPC); Learning Disability Mortality Reviews (LeDeR) and Care (Education) and Treatment Reviews (C(E)TRs).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will work with a dynamic team and therefore NHS Rotherham CCG are looking for an individual who is driven, confident and has competent verbal and written skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your responsibilities will include development and/or on-going management of data bases and systems to analyse and produce accurate and timely reports on the key areas outlined above; the post holder will link into our Business Intelligence Team. Knowledge and experience of databases is crucial. The post holder will provide and receive information which could be of sensitive and distressing nature.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All references from current and previous employers will be sought and must cover a minimum of 4 years employment. Therefore, when completing the reference section of your application form, please give the address, telephone number and work email address of each of your current/previous line managers that cover 4 years employment. Failure to complete this section may result in your application not being processed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact NHS Rotherham Clinical Commissioning Group:&lt;/p&gt;\n&lt;p&gt;Kirsty Leahy - Head of Quality and Safeguarding Adults&lt;/p&gt;\n&lt;p&gt;Tel: 01709 428724 -&lt;span style=&quot;text-decoration: underline;&quot;&gt;Email: &lt;/span&gt;kirsty.leahy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Rotherham Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128237"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S66 1YY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.422", "longitude": "-1.25419"}}, "title": "Quality Assurance Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246578", "validThrough": "2020-11-20T23:59:59+0000"}