{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 £36,461 - £44,044 pro rata pa in"}}, "datePosted": "2020-10-29T10:44:37+0000", "description": "&lt;p&gt;We are looking for a Band 6 Occupational Therapist to join the Paddock School therapy team. This is a newly created post to continue to meet the needs of the pupils at Paddock School.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapist’s role will be to provide onsite Occupational Therapy support for children and their families/carers, and to school staff. The post holder will be flexible, with a commitment to new ways of working and have an innovative approach to patient centred care and efficient service delivery. They will demonstrate in-depth knowledge in a clinical area relevant to the client group.&lt;br /&gt;&lt;br /&gt;This post is based at Paddock School. Paddock provides for children from 3-19 years with a range of severe learning difficulties and social communication difficulties. &lt;br /&gt;&lt;br /&gt;You will be part of a very friendly and supportive team of Health and Education staff and will be supported by the Paddock School Team Occupational Therapist&#39;s (2 Band 7 OT&#39;s and one Band 6) on site, as well as the Clinical Lead for Health, OT Professional Lead for Occupational Therapy. You will work closely with other health professionals as part of a multi-disciplinary team including Speech and Language Therapists, Physiotherapists, Educational Psychologist and other external agencies.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will need to have:&lt;br /&gt;• Experience working as an OT with children with complex needs &lt;br /&gt;• Independent skills to assess, monitor and provide overall OT management for children&lt;br /&gt;• Independent skills to provide specialist reports, programmes, training and support for school staff and families&lt;br /&gt;• Ability to work collaboratively with teachers, parents and other therapy staff&lt;br /&gt;• Therapeutic skills to set up and deliver classroom based groups and school&lt;br /&gt;• Experience of working as part of a multidisciplinary team, preferably in a specialist educational setting &lt;br /&gt;• An excellent understanding &amp; knowledge of up to date OT paediatric equipment &amp; resources&lt;br /&gt;• Knowledge of Sensory Integration and the impact of these difficulties on children.&lt;br /&gt;&lt;br /&gt;You will participate in clinical development with the wider OT team, and will take part in regular OT professional meetings and study days. You will also have opportunities to develop your skills via self directed study, shadowing and joint working and internal or external training courses.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElise DowellJob titleClinical Team LeaderEmail addresselise.dowell@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paddock Primary School, London", "postalCode": "SW15 5RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4637", "longitude": "-.249627"}}, "title": "Specialist Children&#39;s Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247948", "validThrough": "2020-11-06T23:59:59+0000"}