{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 per annum pro r"}}, "datePosted": "2020-11-04T10:46:13+0000", "description": "&lt;p&gt;JCF Respiratory - Medicine Business Group&lt;/p&gt;\n&lt;p&gt;Applications are invited for an opportunity to join the dynamic Respiratory workforce within the Medicine division.&lt;/p&gt;\n&lt;p&gt;You will be an integral part of the Department which comprises of 7 Chest Physicians, Registrars, JCFs and Specialist Nurses. The post will involve inpatient management of respiratory patients as well as opportunities for general medical experience.&lt;/p&gt;\n&lt;p&gt;This post is particularly suited for applicants seeking experience for a career in Respiratory or General internal Medicine. They will be given an educational supervisor and be assisted in compiling evidence of good practice to augment their portfolio. There is an active teaching programme and a dedicated simulation suite. We are exploring an exciting opportunity for post holders to be able to rotate to other specialties in medicine.&lt;/p&gt;\n&lt;p&gt;If successful, this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Angela Barrett on 0161 419 4866&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport NHS Foundation Trust, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Junior Clinical Fellow - Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255437", "validThrough": "2020-11-18T23:59:59+0000"}