{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 to £46,294 pa inc HCAS"}}, "datePosted": "2020-11-06T10:45:18+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Biomedical Scientist - Virology&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Band 7&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;The Virology Department at &lt;span style=&quot;text-decoration: underline;&quot;&gt;St Peter’s Hospital, Chertsey&lt;/span&gt; (Berkshire Surrey Pathology Services (BSPS), has a vacancy for a permanent Senior BMS.&lt;/p&gt;\n&lt;p&gt;You will, with the Lead BMS, be responsible for the participating in the organisation and performance of the service delivered by the Virology Department for BSPS.  You must be keen to embrace new ways of working and develop your knowledge and skills in order to grow in the role. You will be working with the Virology senior team to ensure a co-ordinated and effective service is provided by best use of staff and resources to continue to provide a service to UKAS ISO 15189 standards.  You will on occasion be required to work at other network sites for meetings or training to maintain quality, training and service requirements&lt;/p&gt;\n&lt;p&gt;We are looking for an energetic, enthusiastic and well-motivated BMS with appropriate qualifications and/or relevant experience to join the senior team of the Virology department.  &lt;strong&gt;You will be an HCPC registered Biomedical Scientist and have a broad post registration experience within a Virology laboratory.&lt;/strong&gt;  You will need significant experience at specialist BMS level; this experience must include health and safety, audits, appraisal and staff development and UKAS 15189 standards and quality.&lt;/p&gt;\n&lt;p&gt;The department is a large and busy hub laboratory serving the five hospitals that make up Berkshire and Surrey Pathology Services (BSPS).  BSPS is formed by St Peter’s Hospital Chertsey, Royal Surrey County Hospital, Frimley Park Hospital, Wexham Park Hospital and Royal Berkshire Hospital.  It currently provides diagnostic pathology services for these five hospitals and the surrounding GPs serving a population of over 2 million people.  The laboratory is UKAS accredited to ISO 15189 and is well equipped with a number of analysers.  These include Abbott Architect, Hologic Panther and Panther Fusion, Diasorin Liaison, Vidas, Elite InGenius.   Our staff benefit from a strong commitment to training and development, minimum 27 days holiday, access to a career average pension scheme, flexible working, subsidised restaurant facilities and childcare facilities (onsite Nursery). &lt;/p&gt;\n&lt;p&gt;If you would like further information, please contact Gemma Brahams, Acting Lead BMS, 01932 723049.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date:  Sunday 22&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; November 2020 &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;The Trust may close any advertised post before the stated closing date once enough applications are received. We recommend that you apply as soon as possible&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Interview date&lt;/span&gt;&lt;/strong&gt;&lt;span&gt;: 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; December 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Senior Biomedical Scientist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259269", "validThrough": "2020-11-22T23:59:59+0000"}