{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21748", "minValue": "20092", "unitText": "YEAR", "value": "£20,092 to £21,748 per annum"}}, "datePosted": "2020-10-27T15:38:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Reablement Liaison Officer 59971 SSAE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mill Close, Aylsham&lt;/p&gt;\n&lt;p&gt;£20,092 to £21,748 per annum (Scale E)&lt;/p&gt;\n&lt;p&gt;37 hours per week&lt;/p&gt;\n&lt;p&gt;Monday to Friday, including bank holidays on a rota basis. Occasional weekend working.&lt;/p&gt;\n&lt;p&gt;Permanent contract&lt;/p&gt;\n&lt;p&gt;‘Care for others. Make a difference’&lt;/p&gt;\n&lt;p&gt;As a Reablement Liaison Officer you will be the first point of contact and an information service for GPs, community health services, social services, service users and their families.  You will also take referrals for Norfolk First Support. The role is an office-based administrative position, answering telephones and using web-based computer programmes. You will have excellent computer skills and be able to work to tight deadlines, often making decisions independently. Full training will be given on our scheduling system.&lt;/p&gt;\n&lt;p&gt;You will have excellent customer service skills and the ability to assess risk, take appropriate action and work with a multidisciplinary team to support people to return to their homes.&lt;/p&gt;\n&lt;p&gt;Norfolk First Support delivers services to adults in Norfolk in their own homes for up to 6 weeks, assisting them to regain skills they may have lost following an illness or hospital admission. The aim is to enable them to regain their independence as much as possible, while also reviewing their ongoing care needs.&lt;/p&gt;\n&lt;p&gt;Norfolk First Support is part of the wider Norfolk First Response Service, which consists of Swift Response, which supports people with unplanned care needs, Supported Care and Accommodation-Based Reablement units.&lt;/p&gt;\n&lt;p&gt;Benefits of working for Norfolk First Response: Competitive annual leave per year, competitive pension scheme, guaranteed salaried hours, regular working pattern, paid induction and Norfolk Rewards Scheme.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding this vacancy, please contact Tracey Sparks, Service Manager, by email - tracey.sparks@norfolk.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aylsham", "postalCode": "NR11 6LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7941", "longitude": "1.23904"}}, "title": "Reablement Liaison Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245233", "validThrough": "2020-11-11T23:59:59+0000"}