{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T11:17:18+0000", "description": "&lt;p&gt;This is an advert is for a Recovery Coordinator (no requirement nursing registration) or registered RGN/RMN within Greater Manchester Mental Health (GMMH) Specialist Services Network, Substance Misuse Services here in Cumbria .&lt;/p&gt;\n&lt;p&gt;The position will be based in Allerdale and Copeland from various locations within the this footprint and occasional travel to other areas of Cumbria. Covid restrictions are in place for the health and well being of staff and for those accessing our essential services&lt;/p&gt;\n&lt;p&gt;This is an exciting and dynamic role for those who will be looking to expand their knowledge in Substance Misuse Services. With this in mind we would consider secondment opportunities so that learning from this specialism can be taken back to your place.&lt;/p&gt;\n&lt;p&gt;The post holders will offer advice, information, advocacy and support to people using substances accessing or seeking to access the service, and to provide a range of clinical interventions including, testing for blood borne viruses, management of prescribed medication and the support of detoxification pathways. Relevant training will be provided.&lt;/p&gt;\n&lt;p&gt;You will be providing a package of care for their substance misuse problems, and will support their mental and physical health needs. You will safely manage and contribute to the clinical element of the substance misuse team, working in collaboration with other health and non health providers.&lt;/p&gt;\n&lt;p&gt;The post holder will be involved in multi-agency working with other professionals to meet the needs of the population. You will also work closely with and maintain the close working relationship that is established with external agencies. The post holder will provide these in safe, effective and timely manner across the locality.&lt;/p&gt;\n&lt;p&gt;The post holder will enjoy working within a busy, friendly and professional team. Unity/GMMH is keen to support and develop all new members of staff with their training and development needs. We would welcome any potential candidates to enter discussion about this role, to look around the service and to meet the team if they wish to do so.&lt;/p&gt;\n&lt;p&gt;GMMH have been rated ‘Good’ overall by the Care Quality Commission. Our substance misuse services and leadership were rated as ‘Outstanding’&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLinzi ButterworthJob titleTeam LeaderEmail addresslinzi.butterworth@gmmh.nhs.ukTelephone number07789558770Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Benson&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;emma.benson@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;01613583753&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Allerdale and Copeland, Whithaven/workington", "postalCode": "CA28 7DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5479", "longitude": "-3.58809"}}, "title": "Recovery Coordinator/Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246262", "validThrough": "2020-11-11T23:59:59+0000"}