{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum / pro rata"}}, "datePosted": "2020-11-02T11:01:27+0000", "description": "&lt;p&gt;&lt;strong&gt;With a big national focus on improving services for children and young people’s mental health and well-being, there has never been a better time to join Oxford Health CAMHS and make a positive difference to children and young people’s life chances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitably qualified Mental Health Nurses, Occupational Therapists and Social Workers interested to join our Child and Adolescent Mental Health Service team based in Keynsham, Bath and North East Somerset. You will work across the Getting Advice, Getting Help and the Outreach Service for Children and Adolescents (OSCA) Risk Support teams to deliver a high quality, comprehensive mental health service for children, young people and their families who are experiencing mental health difficulties.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to make an active and meaningful contribution to our exciting service modernisation and redesign that is based on the i-Thrive model; ensuring children and young people get the right support, at the right time, in the right place, from individuals with the right skills. Liaison, advice and consultation with wider CAMHS, colleagues in Children Services and a range of external agencies such as Children’s Social Care, Education, Youth Offending Services and Police is central to the role.&lt;/p&gt;\n&lt;p&gt;You will focus on delivering the CAMHS School Link role for agreed educational settings, such as schools and colleges, in Bath and North East Somerset and contribute to the Getting Advice part of the CAMHS Service, by supporting delivery of pre-referral consultations and Getting Advice functions such as consultations to young people, parents/carers and a wide range of partner agencies.&lt;/p&gt;\n&lt;p&gt;The role includes supporting the delivery of the OSCA and Liaison Service by providing mental health assessments for young people at the acute general hospital and delivering interventions for young people experiencing a mental health crisis.&lt;/p&gt;\n&lt;p&gt;You will be required to participate in a flexible working pattern within the multi-disciplinary team to provide cover for a core day 8am-8pm Monday-Friday and 10am-6pm Saturday –Sunday and Bank Holidays. The flexible working patterns allows team members to work hours flexibly and for days off during the week. You will also participate in covering the service’s 24 hour on call service on a rota basis. The frequency of evening/weekend shifts and cover of the on call rota is subject to change, dependent upon the needs of the service, though would typically involve working an evening shift each week, up to two weekend days per month and covering the on call rota for up to four weeks in a year.&lt;/p&gt;\n&lt;p&gt;This is a varied and rewarding role within a highly supportive team. The post is offered at 30 hours per week but we will consider flexible working applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSaffia AhmadJob titleClinical Team ManagerTelephone number01865 903889Additional contact information&lt;/p&gt;\n&lt;p&gt;or alternatively, Ben Mogridge, Deputy Team Manager on 01865 903889&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Temple House, Keynsham", "postalCode": "BS31 1HA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4135", "longitude": "-2.49811"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251688", "validThrough": "2020-11-16T23:59:59+0000"}