{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 £28,691 - £35,207 pa inc."}}, "datePosted": "2020-10-15T11:16:30+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the Role and Service&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit passionate Mental Health Nurses to our Acorn Lodge, Bethlem Adolescent Unit, PICU Ward based at our Bethlem Royal Hospital and Snowsfield Adolescent inpatient based at our Maudsely Hospital to support adolescents and children across our services in the South London.&lt;br /&gt;&lt;br /&gt;SLaM has the largest and most specialised CAMHS services in the country and are on the forefront of personalised support for young people and children. We want to hire nurses who have a real understanding for the needs of the CAMHS group who can bring innovation and change to our services. We see these services as a genuine specialism and are offering the opportunity to be part of it.&lt;/p&gt;\n&lt;p&gt;We also operate a rotational programme that will see you changing wards after 6 months within our services in Croydon and Southwark. There is also an opportunity to work in our stand alone site in Kent as part of the rotational programme.&lt;/p&gt;\n&lt;p&gt;As part of our strong teams, you&#39;ll have the scope to share ideas and follow them through into innovative practice. Recent inspiring projects here include evening family support groups, gardening projects, community access and bespoke recovery and support plans. Factor in the therapeutic time youll be able to spend engaging with young people and their families, and you have the makings of a level of personal and professional development that is very special indeed.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Service users and their families will engage with you on a daily basis and are looking to be treated with respect and dignity. We want our nurses to be fully integrated in the mental health and wellbeing of everyone they work with and feel comfortable communicating with different stakeholders. &lt;br /&gt;&lt;br /&gt;We give you the opportunity to become a specialist in CAMHS and be involved in cutting edge care and support. We offer excellent learning and development opportunities as well as the chance to be involved in research from Institute of Psychiatry, Psychology &amp; Neuroscience (IoPPN). We want to support you in your career and give you options to progress. Our preceptorship and mentoring schemes mean you will be partnered with like-minded individuals who will be dedicated to your development. &lt;br /&gt;&lt;br /&gt;You must be a qualified RMN or LD Nurse or in the final year of your RMN/LD course, students &lt;span&gt;qualifying in 3 months&lt;/span&gt;. Its important that you have an understanding of multidisciplinary services and the challenges that face people with mental health problems. We want to hire staff that are passionate about mental health, who believe in our recovery model and who will act as advocates for the reduction of stigma in our community. You must have an excellent understanding of safeguarding and how to work within professional boundaries. Roles at SLaM are challenging, stimulating and diverse. We believe that we can offer you something different from other Trusts if you are interested in a role please apply.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;If successful at shortlisting stage you will be contacted regarding the next stage.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;**Please note that if you do not state the month and year that you have completed your Nursing qualification you will not be invited to the assessment.**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South London Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London Mental Health and Community Partnership (SLP) is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your applicatio&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Monks Orchard Rd, Beckenham BR3 3BX, Beckenham, London", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "RMN or RNLD (NHS), Child and Adolescent", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227926", "validThrough": "2020-11-07T23:59:59+0000"}