{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-11-04T11:09:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you thrive in a busy and fast paced environment? Ever considered Critical Care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so we have an opportunity for a full time band 3 healthcare assistant within the Critical Care Department. This will be an excellent opportunity as our latest CQC inspection rated Critical Care as an outstanding service. In addition, the Midland Metropolitan University Hospital will open within the next few years and will provide the highest quality acute specialist services in a purpose built facility.&lt;/p&gt;\n&lt;p&gt;The post-holder must be motivated and enthusiastic with excellent communication skills with at least &lt;strong&gt;12 months experience in an acute hospital setting&lt;/strong&gt;&lt;em&gt;.&lt;/em&gt; All applicants must either hold the Care Certificate or be willing to gain this award in post. Main duties will be to assist and support the nursing team in the delivery of safe care to the acutely ill and/or rehabilitating critical care patient. Alongside promoting infection control practices and assisting in equipment and stock utilisation.&lt;/p&gt;\n&lt;p&gt;The post will include rotational opportunities cross site between the two departments located at Sandwell and City Hospital. Role specific training will be provided within the department which will be supported by a competency package and robust mentorship. Additionally we will provide a strong team structure and the opportunity to work alongside expert clinicians within a dynamic working environment.&lt;/p&gt;\n&lt;p&gt;All interviews will be held via Webex which is a virtual meeting platform.&lt;/p&gt;\n&lt;p&gt;Please note the job advert may close early if number of applications exceed limit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon ClarkeJob titlePractice Development NurseEmail addresssharon.clarke5@nhs.netTelephone number0121 507 3214/5099Additional contact information&lt;/p&gt;\n&lt;p&gt;Sharon Clarke, telephone 0121 507 3214&#96;, email sharon.clarke5@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham NHS Trust, Sandwell and West Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255540", "validThrough": "2020-11-11T23:59:59+0000"}