{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 plus £149 HCAS pa"}}, "datePosted": "2020-10-05T11:30:26+0100", "description": "&lt;h1&gt;&lt;strong&gt;Division of Medicine &amp; Emergency Services&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Consultant in Acute Medicine&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Substantive or 12 fixed term Locum Consultant Post&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Full or part-time, with or without specialty interest&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Applications are invited for the post of Consultant Physician in Acute Medicine to join the team based in the Acute Medical Unit / Ambulatory Emergency Care Unit at St. Peter’s Hospital. We also welcome applications for a Locum Consultant, which will be offered on 12 months fixed term basis.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit (AMU) comprises a purpose-built ward and large ambulatory care area with six trolleys and two consulting rooms. The Consultant Acute Physician is responsible for the care of all medical patients referred from GPs and A&amp;E, who are directly transferred to the AMU for quick triage, rapid assessment and treatment along with patients in the Ambulatory Emergency Care Unit. Responsibility for care of the patient is transferred to the relevant specialty consultants as soon as the patients leave the unit or they have been referred and seen by a subspecialty team.&lt;/p&gt;\n&lt;p&gt;Urgent medical patients receive early senior assessment and decision-making by experienced consultants seven days a week, supported by an enhanced multi-disciplinary team, to identify care needs and ensure patients are on the right pathway, first time. We are a thriving and innovative acute medicine department located within the St Peters site. The successful applicant will join a dedicated and passionate team committed to providing a first class service in terms of quality, safety, innovation and education.&lt;/p&gt;\n&lt;p&gt;We have some exciting developments happening across the Trust. ASPH has received funding, which we will use to expand and improve our Emergency Department and Urgent Treatment Centre. Our priorities are to increase bed capacity, redevelop the current Emergency Department and relocate the Urgent Treatment Centre to better accommodation, increasing the size and improving the waiting areas.&lt;/p&gt;\n&lt;p&gt;The other exciting development at St Peter’s is the opening of the new multi-storey car park. At Ashford we are delivering lots of clinical improvement and capacity works. We are refurbishing two theatres and creating a new one as well as two new modular theatre on site.&lt;/p&gt;\n&lt;p&gt;Ashford and St Peter’s Hospitals became a Foundation Trust in December 2010. It is the largest non-teaching Trust in the region, and provides a full range of Acute Hospital Services. Ashford and St Peter’s Hospitals NHS Foundation Trust serves a population of around 450,000 from an area which includes Chertsey, Guildford, Woking, Walton-on-Thames, Weybridge, Staines, Feltham and Spelthorne.&lt;/p&gt;\n&lt;p&gt;The Trust has strong links with Imperial College School of Medicine and St George’s, with regular firms of students from each school. The Trust is located in an attractive area of Surrey, yet in close proximity to London with excellent transport links.&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the General Medical Council and be on the Specialist Register with accreditation in GIM or be eligible for admission to the Register within six months from the date of interview for the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post includes an on call and 7 day working commitment included in the 10 PA job plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For any further information and an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Cristina Russo, Acute Speciality Lead via email cristina.russo@nhs.net&lt;/p&gt;\n&lt;p&gt;or Nada Willieme, General Manager for Acute Medicine via email nada.willieme@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date:7 December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultant in Acute Medicine  - Substantive or Fixed Term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212408", "validThrough": "2020-11-15T23:59:59+0000"}