{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "26500", "unitText": "YEAR", "value": "£26,500 - £38,000 depending on skills &amp; experience"}}, "datePosted": "2020-11-06T11:36:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior MSK Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full / part time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£26,500 - £38,000 depending on skills and experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Kirklees&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a well-organised and experienced Senior MSK Physiotherapist to deliver quality clinical care for patients suffering with a musculoskeletal condition. Whilst undertaking comprehensive assessment and diagnosis of patients with a wide variety of physical and emotional needs, you must formulate, deliver, review and progress individual treatment programmes and ensure effective treatment, specialist advice and timely discharge are achieved.&lt;/p&gt;\n&lt;p&gt;We are committed to developing and promoting a positive and dynamic image and culture and it is expected that you will contribute to the fostering of productive relationships with key stakeholders such as local Consultants, GPs and corporate clients whilst provide support and training to junior staff and physiotherapy students.&lt;/p&gt;\n&lt;p&gt;You’ll be positive, constructive and approachable, along with being registered with the HCPC and a fully qualified Physiotherapist. We’re looking for you to manage a varied caseload of MSK patients, as well as the ability to work under pressure and being committed to CPD.&lt;/p&gt;\n&lt;p&gt;You should have the desire to facilitate improvement in yourself and the service. You will have excellent and confident communication skills with both patients and colleagues alike. You may have experience of working within the NHS, Public or Private Sector, bringing transferrable skills to Connect.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our mission is to deliver a quality MSK and community pain service to patients within North Kirklees. The role involves supporting patients within our Tier 2 service with musculoskeletal disorders. We offer assessment and treatment for MSK conditions and empower the community of North Kirklees through support, information, expertise and resources. We offer a single point of access for clinical assessment and treatment, physiotherapy and community pain, delivered from four sites within North Kirklees.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Connect&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Connect Health is the largest, independent provider of integrated community MSK (musculoskeletal) and physiotherapy services in the UK (including orthopaedics, pain, rheumatology, and occupational health) serving over 350k NHS patients per year across 20+ CCGs and 100+ businesses.&lt;/p&gt;\n&lt;p&gt;We provide bespoke occupational services to companies and organisations, large and small. We’re also a trusted and longstanding provider of numerous integrated community service contracts across the country for the NHS.&lt;/p&gt;\n&lt;p&gt;We’ve been treating patients with MSK disorders to keep them moving and improve their quality of life for 30 years, which means that our systems and approaches are designed to facilitate great care for patientswith MSK conditions.&lt;br /&gt; &lt;br /&gt; We have one vision, and that is to help people improve their quality of life. It’s why we exist and it’s what we care passionately about. Our services are wholly designed to focus on the patient experience and what really makes a difference to them. Being seen in the right place, at the right time, by the right clinician. It’s exactly what a patient wants, and it’s helped countless people improve their quality of life.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working for Connect&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;up to 30 days’ holiday (plus public holidays)&lt;/li&gt;\n&lt;li&gt;option to buy additional annual leave&lt;/li&gt;\n&lt;li&gt;an additional day off for your birthday&lt;/li&gt;\n&lt;li&gt;online discounts portal&lt;/li&gt;\n&lt;li&gt;employer pension contributions&lt;/li&gt;\n&lt;li&gt;salary sacrifice schemes&lt;/li&gt;\n&lt;li&gt;an employee assistance programme&lt;/li&gt;\n&lt;li&gt;performance related pay rewards&lt;/li&gt;\n&lt;li&gt;team building/away days&lt;/li&gt;\n&lt;li&gt;reimbursement of HCPC and CSP membership fees for clinicians&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;“Best thing about Connect - for me it’s the opportunity to develop”&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Connect Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Kirklees", "postalCode": "WF13 1HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6898", "longitude": "-1.63481"}}, "title": "Senior MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259457", "validThrough": "2020-11-20T23:59:59+0000"}