{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-13T17:38:43+0100", "description": "&lt;p&gt;Doctors Direct are part of NHS Professionals and owned by the Department of Health and Social Care, which means that we are part of the NHS family and sets us apart from locum agencies. Saving money and providing only the highest quality locum cover to our partner Trusts is at the very heart of what we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Consultant to work with us at&lt;/strong&gt; &lt;strong&gt;East and North Hertfordshire NHS Trust in Emergency Medicine. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dedicated doctor ready to work in a fast-paced environment at a Trust internationally acclaimed for its specialties. East and North Hertfordshire NHS Trust is made up of four hospitals: Hertford County Hospital in Hertford, the Lister Hospital in Stevenage, Mount Vernon Cancer Centre in Northwood and the New QEII Hospital in Welwyn Garden City. This role would be predominantly based in &lt;strong&gt;Lister Hospital&lt;/strong&gt; with the opportunity to work extra shifts across the Trusts’ other sites and any of our partner Trusts.&lt;/p&gt;\n&lt;p&gt;East and North Hertfordshire NHS Trust have a team of over 5,000 dedicated staff, delivering high quality, safe and effective care. Together the sites deliver a range of services including emergency, inpatient, outpatient, maternity and diagnostic care. The Trust also offers specialist services such as cardiology, urology, renal medicine and radiotherapy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors Direct recruit to the highest of NHS standards and all applicants for this role should meet pre-screening requirements before applying.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Full GMC licence to practice&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Minimum&lt;/strong&gt; of &lt;strong&gt;6&lt;/strong&gt;&lt;strong&gt;months&lt;/strong&gt; experience working within Emergency Medicine at an NHS Trust within the last 2 years&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Valid RTW status&lt;/strong&gt; – Unfortunately, we cannot provide sponsorship therefore please only apply for the job if you are permitted to work within the UK.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you can provide the details of &lt;strong&gt;three referees&lt;/strong&gt; (Consultant or above) in the area which you are applying for to support your application, as this is a Trust requirement.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Doctors Direct are part of the NHS and do not charge our partner Trusts the expensive fees associated with private locum agencies. That means every shift worked by one of our members helps save money for the Trust and the wider NHS. These vital saving can then be reinvested into what matters most, patient care and safety.&lt;/p&gt;\n&lt;p&gt;Not only do members of Doctors Direct help save money for the NHS, they receive fantastic benefits including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;li&gt;A dedicated account manager&lt;/li&gt;\n&lt;li&gt;Flexibility of work, with shifts that suit you&lt;/li&gt;\n&lt;li&gt;Book and review shifts online&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Want to know more?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Find out more about how working locum shifts through Doctors Direct canwork for youor visit our onsite teams. Find yournearest Trust here.&lt;/p&gt;\n&lt;p&gt;We have exciting career opportunities available for doctors across many grades and specialties. Once registered, you will be able to view and work in your chosen specialty and grade at any of our partner Trusts across England. If you would like to discuss career opportunities further, call us on 03330 143 652 or email doctors@nhsprofessionals.nhs.uk where our dedicated team can help you find your next opportunity.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121068.JPG", "name": "NHS Professionals - Doctors", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121068"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225185", "validThrough": "2020-11-30T23:59:59+0000"}