{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 to £76,751 pa"}}, "datePosted": "2020-11-03T14:44:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in Emergency medicine aiming to apply for a CESR.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an Emergency Medicine Physician aiming at becoming a Consultant in the UK? Royal Surrey NHS Foundation Trust is looking to appoint substantive Certificate of Eligibility for Specialist Registration Doctors (CESR) to join the Emergency Medicine Middle grade team which is funded for 15 whole time equivalent Middle-Grade doctors. In addition, we have an establishment of 12 Consultants and we have completed a £8 Million redevelopment of the Emergency Floor which has produced a bespoke ED transforming the way we deliver Emergency and Urgent care to our local population.&lt;/p&gt;\n&lt;p&gt;Are you committed, motivated and enthusiastic in embracing the CESR application to get onto the Specialist register? We are piloting a project which will support you via a programme tailored to your needs.&lt;/p&gt;\n&lt;p&gt;We are offering CESR Specialty doctor roles, with the opportunity of being mentored by CESR Consultants to guide you in your application toward a CESR and to participate in our programme – the SeSaR project - tailored to your needs.&lt;/p&gt;\n&lt;p&gt;The SeSaR (See Support and Recognition) is a locally developed programme which is targeted for both International Doctors coming to work in the NHS and non-trainees wanting to apply for a CESR in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;This is a programme which includes dedicated one-to-one mentoring and a course mapped on the GMC domains.&lt;/p&gt;\n&lt;p&gt;The programme will support you in your career progression and adaptation to the NHS.&lt;/p&gt;\n&lt;p&gt;Dedicated mentoring for CESR applicants by CESR Consultants will take you through the application process.&lt;/p&gt;\n&lt;p&gt;Practical experience will be delivered via simulation and workshops where you are at the centre of the learning experience.&lt;/p&gt;\n&lt;p&gt;The trust has experienced CESR consultants who will be available to give the successful candidates support, mentorship and coaching.&lt;/p&gt;\n&lt;p&gt;The post is intended to provide the clinician with the support and training required to successfully complete all aspects of the CESR process.&lt;/p&gt;\n&lt;p&gt;We would expect the successful candidate to have an understanding of the principles of clinical audit, clinical governance and evidence-based medicine. These are actively practiced in the department and contributions by the Middle Grades are fully supported. There is an active regional research group and research interests of the post holder would be supported.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be encouraged to lead a quality improvement project and an Audit.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Julie Booth Specialty manager via email juliebooth1@nhs.net, or Richard Gerold, Head of Service for Urgent and Emergency Care richardgerold@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Specialty Doctor Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254373", "validThrough": "2020-11-10T23:59:59+0000"}