{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-03T16:00:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Lincolnshire Stroke Service &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialist Band 6, Occupational Therapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: Boston&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing a high quality service to stroke patients? Are you an ambitious individual who relishes a challenge? Lincolnshire’s Community Stroke Service has been established for over ten years, supporting early discharge from hospitals and providing specialist rehabilitation to stroke patients in Lincolnshire. If you are a team player with a special interest and experience in the area of stroke, look no further, we are now looking to recruit to this exciting vacancy post.&lt;/p&gt;\n&lt;p&gt;The innovative Stroke Service provides high quality specialist stroke rehabilitation in the community across Lincolnshire. The service has four bases across the county and works as a very flexible team. Your post will require the ability to travel to meet the needs of this county wide service and contribute to providing access to therapy as part of a weekend rota.&lt;/p&gt;\n&lt;p&gt;You will play a key role in delivering high quality patient centred care and rehabilitation to people who have recently experienced a stroke, in their own homes as well as community settings. You will be working with a full multidisciplinary team of specialist physiotherapists, speech and language therapists and occupational therapists, assistant practitioners and rehabilitation assistants. In an exciting development for the service our staffing uplift will also include recruitment of a Dietitian and Clinical Psychologist and you will also work closely with colleagues in the wider system to facilitate seamless service provision to support patient’s recovery following Stroke.&lt;/p&gt;\n&lt;p&gt;Experience of a multidisciplinary team is essential and experience of community and neurological rehabilitation is desirable, although consideration will be given to those with the appropriate transferrable skills. We have a well-established mentoring scheme in addition to regular clinical supervision, and hold regular local and countywide team meetings; LCHS are committed to supporting continued professional development (CPD).&lt;/p&gt;\n&lt;p&gt;It is an exciting time to work in stroke rehabilitation in Lincolnshire. There are many exciting areas of service development happening, all with the aim of improving and shaping the future of the stroke service for patients to be ‘fit for our own families’, building on a model that already works well and is well-respected within the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to any further information please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Michelle Sabado – Advanced Physiotherapist, 01522 449901/ 01522 449902, 07767 005266, msabado@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alternatively, you can find out more about the Lincolnshire Stroke Service by visiting:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle G. SabadoJob titleClinical Team LeaderEmail addressm.sabado@nhs.netTelephone number01522 449901/02 or 07767 005266Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Michelle G. Sabado - 01522 449901/02 and 07767 005266, msabado@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Boston, Lincolnshire, Boston", "postalCode": "PE21 7TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9765", "longitude": "-.059069"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254707", "validThrough": "2020-11-16T23:59:59+0000"}