{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T09:46:21+0000", "description": "&lt;p&gt;This is a fixed term/secondment post for 12 months initially. If you are a SBUHB employee you will need to secure permission from your line manager before applying.&lt;/p&gt;\n&lt;p&gt;Do you welcome challenge; Do you work as a team player but equally on your own initiative? Then come and join us here at Singleton Hospital as a Support Manager in Medicine and Unscheduled Care. Applicants should be caring, enthusiastic and flexible with a drive to produce excellent patient care across General Medicine and USC Services. You will ensure services are developed and maintained with appropriate capacity to meet quality and RTT performance targets&lt;/p&gt;\n&lt;p&gt;You will require excellent communication skills to assist in responding professionally to enquiries from a number of staff groups, have a proactive and friendly attitude and be able to develop effective relationships with a wide range of staff and key stakeholders. You must be adaptable and able to prioritise at very short notice due to constantly changing circumstances.&lt;/p&gt;\n&lt;p&gt;You will allocate work to, and supervise the work of the administration staff, ensuring all mandatory training is up to date. You will be responsible for carrying out PADRs and managing annual leave and sickness.&lt;/p&gt;\n&lt;p&gt;You will be able to deal tactfully with potentially difficult and complex issues. The successful candidate will have good knowledge of Microsoft Office applications, be conscientious, methodical and enjoy working as a member of a team providing cross cover when required showing a high level of adaptability and a flexible approach to work.&lt;/p&gt;\n&lt;p&gt;You will be based in Singleton however; there will be an element of cross-site working to support staff and departments.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne WarrissService Manager&lt;/p&gt;\n&lt;p&gt;Joanne.Warriss@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Singleton Hospital, Swansea", "postalCode": "SA2 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6092", "longitude": "-3.98528"}}, "title": "Operational Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253316", "validThrough": "2020-11-17T23:59:59+0000"}