{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-10-30T11:30:18+0000", "description": "&lt;h2&gt;Haematology Oncology Advanced Nurse Practitioner&lt;/h2&gt;\n&lt;p&gt;This is an exciting opportunity for an advanced practitioner to take on this specialist nursing role working as a key member within the Haematology Oncology multidisciplinary team. The post requires vision, innovation and the ability to work across professional boundaries, underpinned by a real desire to provide the highest standards of patient care.&lt;/p&gt;\n&lt;p&gt;This post will work in collaboration with, and autonomously as part of, the haematology oncology team to support existing and new innovations across organisational, professional and geographical boundaries. This role will work closely with key areas of the Trust, working closely with the Haematology Oncology Consultants who lead and specialise in patients with haematological and oncological diagnosis.&lt;/p&gt;\n&lt;p&gt;It is essential that you possess a high level of up-to-date relevant clinical knowledge and experience in haematology and oncology, diagnosis, treatment and associated procedures, with evidence of ongoing continuous professional development. The successful applicant will be supported educationally and provides new opportunity for advanced nursing practice. You must be highly motivated with strong leadership and excellent communication skills.&lt;/p&gt;\n&lt;p&gt;Applications would be welcomed from people who have not yet achieved all of the requirements as there is potential to appoint at a Band 6 for anyone who is undertaking ANP training but has not yet achieved the required qualifications.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 20/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 26/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Haematology Oncology Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249936", "validThrough": "2020-11-20T23:59:59+0000"}