{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pr"}}, "datePosted": "2020-11-02T10:32:11+0000", "description": "&lt;p&gt;Can you see yourself working in a busy designated trauma unit delivering forward-thinking nursing care as part of a wider multi-disciplinary team? Picture yourself at Poole Hospital’s trauma unit. We’re looking for motivated nurses to join us. &lt;br /&gt;&lt;br /&gt;The unit comprises three inpatient wards caring for patients following traumatic long bone, spinal and soft tissue injuries.&lt;/p&gt;\n&lt;p&gt;Our fractured neck of femur service is the busiest in England, with some 1,000 patients presenting every year. To accommodate this demand we’ve developed a truly multidisciplinary approach, with consultant colleagues in orthogeriatrics working alongside those in trauma and orthopaedics, underpinned by our specialist nursing and therapeutic teams, and many others. As a consequence, our lengths of stay are among the lowest in the country. But we’re eager to improve further, and successful applicants – experienced or newly qualified - will be at the heart of this as we develop the service further.&lt;br /&gt;&lt;br /&gt;We’re transforming our trauma service in other areas too, creating an acute admissions area with two wards caring for patients post-operatively and who require discharge planning. Our discharge support team includes three dedicated nurses who help manage and co-ordinate complex discharges, allowing ward nurses to concentrate on providing bedside nursing care.&lt;br /&gt;There are two distinct nursing opportunities available - a rotational post working across the whole pathway from admission to discharge, or placement in one specific area.&lt;br /&gt;&lt;br /&gt;We value staff education and development and are introducing a new in-house training programme for new and existing staff. This will allow you to develop specific trauma knowledge and competencies, both in and away from the ward environment. You will be able to spend time in our emergency and outpatients departments, theatres, with therapists, nurse practitioners and be part of the daily trauma meetings with our medical teams. This will help you to understand the whole patient pathway and allow you to develop your expertise in trauma nursing. You and your ward sister will work together to formulate an agreed personal development plan, through which you will be able to access other learning opportunities. &lt;br /&gt;&lt;br /&gt;For newly qualified staff we offer a well-regarded preceptorship programme, supporting the general development of staff nurses. This provided by our education department and supported by practice educators. &lt;br /&gt;Trauma nursing is both challenging and rewarding - join the team at Poole Hospital’s trauma unit and together we can get our patients back on their feet sooner.&lt;br /&gt;&lt;br /&gt;Heard enough? Then apply now. We’re waiting to hear from you.&lt;br /&gt;&lt;br /&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary&lt;/p&gt;\n&lt;p&gt;Closing date: 30/11/2020&lt;/p&gt;\n&lt;p&gt;If you’d like to find out more, or to arrange an informal visit, contact Belinda Hewett, Matron, Phone 0300 019 2701 or email belinda.hewett@poole.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Staff Nurse - Trauma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251597", "validThrough": "2020-11-30T23:59:59+0000"}