{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-11-03T17:45:25+0000", "description": "&lt;p&gt;We are looking to recruit a Specialty Doctor in Paediatric Oncology, to commence as soon as possible. The post is suitable for a senior paediatric trainee or equivalent with prior experience in paediatric oncology. Membership of the Royal College of Paediatrics &amp; Child Health (or equivalent) are desirable. Eligibility for GMC registration is required.&lt;/p&gt;\n&lt;p&gt;The position will be based at St George’s Hospital (SGH). The Royal Marsden NHS Foundation Trust forms a joint cancer centre with St. George’s Healthcare NHS Trust. This position, funded by The Royal Marsden NHS Foundation Trust will continue the links between the Royal Marsden NHS Foundation Trust and St Georges Hospital as the unified Children’s &amp; Young Peoples Oncology centre, south of the Thames.&lt;/p&gt;\n&lt;p&gt;Children undergoing initial diagnostic investigations or requiring specialist supportive care are admitted to Pinckney ward (SGH). In addition, Paediatric Oncology patients from the local area requiring admission with febrile neutropenia or other complications of treatment are managed at the SGH site. Children undergoing surgical procedures are admitted to the paediatric surgical ward, Nicholls, under the care of paediatric surgical consultants and neuro-oncology patients requiring surgery to Ocean ward. Children requiring PICU or HDU care are admitted to the SGH paediatric intensive care unit.&lt;/p&gt;\n&lt;p&gt;This post provides day to day cover for the paediatric oncology patients at St George’s Hospital. The post is ward based and provides senior paediatric oncology input to oncology patients on Pinckney ward, PICU and those with oncology related problems in outlying wards. The post holder will support the paediatric oncology consultants at both sites to ensure that patient care is well co-ordinated across the joint centre. This post is supported by one oncology advance nurse practitioner and two oncology nurse practitioners. The post holder may be required to work across both the Royal Marsden, Sutton and St Georges Hospital sites.&lt;/p&gt;\n&lt;p&gt;There are no on call duties with this role.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to attend the paediatric oncology solid tumour MDT.&lt;/p&gt;\n&lt;p&gt;The post holder must be proficient in undertaking bone marrow aspirates, bone marrow trephines and administration of intrathecal chemotherapy without supervision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Elsje Van Rijswijk, Consultant Paediatric Oncologist, elsje.vanrijswijk@rmh.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Sepcialty Doctor in Paediatric Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254966", "validThrough": "2020-11-17T23:59:59+0000"}