{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 p.a. pro rata"}}, "datePosted": "2020-10-23T14:46:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;br /&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Our Cancer Navigators are part of a new model for delivering cancer care at Cambridge University Hospitals. They support people living with cancer to navigate the complex health and social care system, working closely with clinical teams to ensure a joined up and seamless experience of care.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The NHS long term plan is for patients to have access to personalised care by 2021. This includes a holistic needs assessment, care plan and end of treatment summary.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You will be a key contact for patients, carers and the wider health care team responsible for these assessments and care plans throughout the cancer pathway and referring patients to appropriate sources of support. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are looking for a highly motivated person to join the Macmillan CUH Cancer Support Team to specifically support those patients diagnosed with lung cancer throughout their pathway.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You will have extensive experience of working with patients in a patient or public facing role and an insight into cancer or long term health conditions. You must be comfortable or willing to learn about supporting patients virtually using digital platforms. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;As the role involves extensive facilitation, you must possess excellent communication skills and the ability to work autonomously whilst feeding into various MDT teams and working closely with the Lung Clinical Nurse Specialists.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This is a fantastic opportunity to join an expanding and innovative team in a large scale organisation and make a difference to people affected by cancer.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;If you have these skills and the motivation to make an impact, we want to hear from you.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We strongly recommended an informal conversation before application to understand the wider context of work.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Interviews are due to be held in the week commencing 23 November 2020.&lt;br /&gt;&lt;br /&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;br /&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Abbas, Macmillan CUH Cancer Support Team Manager on 07525 351032 or via email to laura.abbas@addenbrookes.nhs.uk or John Wortley, Macmillan Information and Support Specialist on 01223 250881 or via email to john.wortley@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Lung Cancer Navigator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240994", "validThrough": "2020-11-09T23:59:59+0000"}