{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-02T03:46:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic individual to join the Community Mental Health Service based at Avon House, Mount Gould Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Community Mental Health Service works with service users who have a range of mental health difficulties. We are a multi-disciplinary team of Consultant Psychiatrists, Psychiatric Nurses, Occupational Therapists, Psychologists, Support Workers and other key professionals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your role will be to support the mental health consultants with duties including audio typing of clinic dictations, arranging and re-scheduling of appointments, maintaining accurate and up to date patient files on SystmOne, arranging meetings, minute taking and report monitoring. As such, we require someone with experience of secretarial work and proficiency in efficient, precise and accurate clinical audio typing. You will have RSA 3 or equivalent plus a minimum of 2 years’ recent experience working in a secretarial capacity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Although you will primarily be supporting the team based at Avon House, there will be a requirement to cover the team at Cumberland Centre whenever needed on occasions.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The post requires excellent communication and organisational skills, good time management, and the ability to prioritise own work load, working under your own initiative. You will need a positive attitude towards people experiencing mental health problems and have excellent customer care skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL4 7QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3785", "longitude": "-4.11514"}}, "title": "Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251227", "validThrough": "2020-11-06T23:59:59+0000"}