{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T12:00:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours per week 37.5 / 37.5 + on-call&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust provides a range of hospital services to a local community of around 430,000 residents along with an increasing range of more specialised services provided outside this area. We also provide a range of community-based services across Sunderland, South Tyneside and Gateshead, particularly within Community Nursing, Family Care and Therapy Services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In-patient facilities are provided from Sunderland Royal Hospital (SRH), South Tyneside District Hospital (STDH), St Benedict’s Hospice and from the specialist Sunderland Eye Infirmary, giving a total number of beds of around 1200 Acute beds, as well as a state-of-the-art ICCU at SRH. The Trust is continuing to invest in its infrastructure with: a new Emergency Department and Integrated Assessment Unit opened June 2017 at SRH; a state-of-the-art Integrated Emergency Care Centre at STDH opened in 2012; in 2016 the Trust opened its new Endoscopy Unit at SRH; in 2017 the Trust opened its state-of-the-art Surgical Centre at STDH in 2017; in 2017 the Trust opened its new state-of-the-art MRI at STDH; in 2017 the Trust opened its state-of-the-art Durham Treatment Centre providing satellite dialysis, out-patient clinics, imaging and day case procedures across a range of specialties. The Trust also provides an outreach service to our Durham patients for nephrology, urology, ENT, OMFS and ophthalmology.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recent radiology developments include two new Interventional/Vascular Rooms, Cone Beam CT Dental Unit and replacement of two X-ray rooms to DR at the SRH site.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently looking to recruit Radiographers (or students qualifying in 2021) to join our busy and friendly Radiology Department. As a Radiographer you will gain valuable experience in all aspect of general radiography including ED, Orthopaedics, Fluoroscopy, Theatre, Mobiles and CT Heads and this role will give you the ideal opportunity to develop your skills in a supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust is a recognised student training center for several university-based programs and pro-actively supports CPD activities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You should be able to demonstrate excellent communication and interpersonal skills and understand the importance of following standard operating policies and procedures of work with a commitment to provide a high standard of service delivery and patient care as part of a multidisciplinary team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Please be advised that all shortlisted candidates must attend in person for interview as due to inclusion of an Image Interpretation assessment, we will not offer telephone or Skype interviews.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121061.jpg", "name": "South Tyneside and Sunderland NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121061"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sunderland or South Shields", "postalCode": "SR4 7TP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9024", "longitude": "-1.41015"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253851", "validThrough": "2020-11-17T23:59:59+0000"}