{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-15T14:46:04+0100", "description": "&lt;p&gt;We are looking to recruit a high quality experienced radiographer who can offer good experience in general x-ray.&lt;/p&gt;\n&lt;p&gt;The University Hospitals Dorset NHS Foundation Trust is based across two large hospitals , The Royal Bournemouth and Poole Hospitals and one Community Hospital, Christchurch Hospital. At our Bournemouth and Christchurch sites we currently have seven digital x-ray rooms, two A&amp;E digital rooms, three Image Intensifiers, three digital mobiles, two fluoroscopy rooms, one dental unit, one dexa scanner, one mammography unit, two interventional rooms , four cardiac catheter labs, 3 CT scanners and 4 MRI scanners.&lt;/p&gt;\n&lt;p&gt;This post will be based primarily at the Royal Bournemouth Hospital. We have a dynamic, advanced thinking team of radiographers who enjoy good working and social relationships. There is excellent support for advanced practice, CPD, study days and courses. This is a department committed to staying at the forefront of technology. Due to the expansion of services at the Bournemouth site we will be becoming the major trauma site for the area and going to include maternity and paediatric services. Our current A&amp;E is going to be expanded to include 3 digital x-ray rooms and a CT scanner.&lt;/p&gt;\n&lt;p&gt;If you think that you have skills to offer such a role please contact me to discuss what we can offer you in more detail.&lt;/p&gt;\n&lt;p&gt;Apply on line using the NHS Jobs website. Also, please visit our ‘Royal Bournemouth Hospital Radiology Department’ Facebook page to view our recruitment video.&lt;/p&gt;\n&lt;p&gt;The Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust and Poole Hospital NHS Foundation Trust have now merged into the University Hospitals Dorset NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Varied (FT=37.5 p/w), including earlies, lates, bank holidays and weekend shifts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interview Date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachael HillyardJob titleX-ray Clinical LeadEmail addressrachael.hillyard@rbch.nhs.ukTelephone number0300 019 4110&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bournemouth Hospital, Bournemouth &amp; Poole", "postalCode": "BH7 7DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.8205"}}, "title": "Senior Radiographer - General X-Ray", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228658", "validThrough": "2020-11-06T23:59:59+0000"}