{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T16:45:56+0000", "description": "&lt;p&gt;Come and join our evolving Research team here in Macclesfield. We are a small team with big ambitions. We provide a friendly working atmosphere whilst delivering high quality NIHR research in COVID 19, cancer, paediatrics and chronic conditions such as inflammatory bowel disease, cardiology, rheumatology, and cardiovascular disease.&lt;/p&gt;\n&lt;p&gt;We are looking for an energetic and enthusiastic team player, who can prioritise, work well under pressure, has an interest in research, a flexible attitude to working and an organised, professional manner. You need to be able to manage your own workload effectively whilst supporting team members. The right candidate will be required to work as part of a team as well as being able to use their initiative and prioritise their workload to meet deadlines, managing clinical research studies across multiple specialisms. Candidates will have proven experience with patient care and clinical trials environment within the NHS. In addition you will have enhanced communication, excellent administrative and IT skills and be supportive and open to new initiatives.&lt;/p&gt;\n&lt;p&gt;Macclesfield is a superb place to live and work. On the edge of the stunning Peak District National Park, we are surrounded by outstanding countryside and beautiful towns and villages. East Cheshire Trust provides a comprehensive range of acute and community-based services and is committed to providing the best quality care in the right place. Health Service Journal showed East Cheshire to be one of the top trusts in the North West for staff recommending the organisation as a place to work or receive treatment.&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: 37.5&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Maureen Holland Job title Senior Research Nurse Email address maureen.holland3@nhs.net Telephone number 01625 663873&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247414", "validThrough": "2020-11-11T23:59:59+0000"}