{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata for part time"}}, "datePosted": "2020-10-26T08:17:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Active Recovery – Assessment Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Generic Assessor B6 &lt;/strong&gt;&lt;strong&gt;(Physiotherapist, Occupational Therapist)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Agenda for Change Band: &lt;/strong&gt;Band 6&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full Time&lt;/h2&gt;\n&lt;p&gt;Contract: Permanent, working citywide&lt;/p&gt;\n&lt;p&gt;Active Recovery (CICS) is continually striving to meet new hospital discharge and community admissions avoidance targets. It is also working more closely with local authority colleagues in the Short Term Intervention Team (STIT) under the umbrella term ‘Active Recovery’.&lt;/p&gt;\n&lt;p&gt;We are inviting forward thinking and flexible, Allied Healthcare Professionals to come and be part of a large dynamic service caring for people in their home environment.&lt;/p&gt;\n&lt;p&gt;You will be actively seeking to maintain patients in their own homes and support patients discharged from hospital through rapid and holistic, generic assessment with immediate provision of necessary health and social input and signposting quickly for appropriate care, nursing or therapy services.&lt;/p&gt;\n&lt;p&gt;Active Recovery is a flexible, accessible, responsive, time-limited interdisciplinary service for patients, who present with acute and/or chronic complex multiple-pathology. Social Care colleagues will also be embedded within the pathway.&lt;/p&gt;\n&lt;p&gt;A Generic Assessor needs to be a resilient, autonomous practitioner with a level of experience usually associated with at extensive post registration experience. You will need to be able to demonstrate evidence of post graduate study in elderly care or associated/relevant topics.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be knowledgeable on a range of conditions and their potential deterioration/treatment. We are inviting people with community or hospital experience who are confident and forward thinking who will be able to support the assessing workforce; demonstrating well developed communication skills and robust coping mechanisms.&lt;/p&gt;\n&lt;p&gt;You will be able to work in a fast moving clinical environment, able to make decisions and be able to appropriately risk take in a controlled but sometimes challenging/complex workplace.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mark McLelland-Swann&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Operational Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: mark.swann@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Telephone: 0114 307 8100&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment Team Clinical Lead on duty – 0114 307 8106 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 7/11/2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/GZGSECLWZJ&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Generic Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241727", "validThrough": "2020-11-08T23:59:59+0000"}