{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa pro rata"}}, "datePosted": "2020-10-30T10:01:48+0000", "description": "&lt;p&gt;Maidstone and Tunbridge Wells NHS Trust is a dynamic and successful organisation with a strong focus on delivering quality care to our population of around 560,000 people. We provide a comprehensive range of secondary care services from 2 hospitals based in Maidstone and Tunbridge Wells.&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen to appoint an enthusiastic and highly motivated person to undertake the role of Doctor’s Assistant . We are looking for a highly motivated member of staff to join our very busy team within Surgical Assessment Unit at the Tunbridge Wells Hospital.&lt;/p&gt;\n&lt;p&gt;You will carry out duties working alongside Medical and Nursing staff to ensure a high quality of patient centered care is delivered.&lt;/p&gt;\n&lt;p&gt;On completion of competencies the role will include assisting medical staff with clerical jobs including compiling test results.&lt;/p&gt;\n&lt;p&gt;To work with the clinicians and provide high quality support:&lt;/p&gt;\n&lt;p&gt;- Gathering information as appropriate and/or as requested e.g. diagnostics, bloods in preparation for review&lt;/p&gt;\n&lt;p&gt;- Ensuring any appropriate tests are booked / undertaken&lt;/p&gt;\n&lt;p&gt;- Following up any appointments&lt;/p&gt;\n&lt;p&gt;Good communication skills towards patients and colleagues and the ability to organise allocated work is an essential component of this post. You will be expected to maintain confidentiality and adopt a positive attitude towards staff, patients and relatives at all times, in accordance with Trust policies and procedures, referring issues to their Line Manager as appropriate.&lt;/p&gt;\n&lt;p&gt;The role will be within the General and Emergency Surgery Directorate within the Surgical Assessment Unit, located at the Trust’s Tunbridge Wells site.. The post-holders will be supported to achieve their competencies to fulfill the requirements of the role.&lt;/p&gt;\n&lt;p&gt;Should we receive a high volume of applications for this vacancy, the advert may be closed earlier than stated.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at standard level.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Thursday 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: To be confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren ManganJob titleMatron for Emergency SurgeryEmail addresskaren.mangan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells Hospital, Tunbridge Wells", "postalCode": "TN2 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Doctors Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249602", "validThrough": "2020-11-12T23:59:59+0000"}