{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-23T16:46:18+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;We are currently looking at recruiting Band 6 Urgent Care Patient Flow Clinician&lt;/strong&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The main role of the post holder is to provide clinical support and decision making within Central Flow Hub Team. Post holder will have responsibility regarding the trust bed management and ensure it is managed in a safe manner that doesn’t compromise client’s safety. The team is overseen and further supported by the Urgent Care Lead and SMT. You will work closely with local borough bed managers and with SPA. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Central Patient Flow Team supports local boroughs by providing a centralised approach to managing inpatient beds and ensuring that all potential admissions are gatekept. The Central Patient Flow Team works closely linked with local Borough bed managers and responsible for screening and triaging all gatekeeping and bed requests for CNWL. If they accept a referral and face to face Gatekeeping is required, they will liaise with the appropriate borough first response team to conduct the assessment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return you will be supported by robust clinical leadership and supervision and we will provide support and training for this new role and on-going support in the development of your skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are looking for a new challenge, and wish to be part of a new team which aims to strive towards making a difference for our community by supporting people who are who are having mental health crisis then we want to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKingley AkuffoJob titleDeputy Head of Urgent CareEmail addresskingsley.akuffo@nhs.netTelephone number07925371966&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gordon Hospital, London", "postalCode": "SW1V 2RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4922", "longitude": "-.136089"}}, "title": "Patient Flow Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241367", "validThrough": "2020-11-13T23:59:59+0000"}