{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-05T15:00:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a qualified Social Worker looking for a new exciting opportunity in your career?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lincolnshire Partnership NHS Foundation Trust is the principal provider of NHS mental health, learning disability and social care services in Lincolnshire. We were one of the first mental health foundation trusts to be established in the country. The Trust has an annual income of approximately £100m with 2,000 staff spread across the 70+ locations. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Inpatient Social Work team is looking to recruit a Band 5 social worker to a busy fast paced friendly team covering the whole Lincolnshire area. You will be based in Lincoln at the Peter Hodgkinson Centre.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a qualified Social Worker who is committed to managing and supporting vulnerable and complex patients who have a variety of different needs, and empowering them to achieve their goals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have experience of working as part of a multi-disciplinary team? Are you a skilled communicator, with developed inter personal skills, showing compassion to patients and their carers?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have a passion to develop your career through undertaking the available professional learning on offer?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LPFT have an established ASYE programme offered to all NQSW to strengthen professional practice confidence, providing extra support during the first year of practice.&lt;/strong&gt; &lt;strong&gt;You will have access to dedicated social work professional development days throughout the year to maintain your CPD and registration.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As an employee of Lincolnshire Partnership Foundation Trust you may also be eligible to receive the following additional benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• A relocation package for rented or bought property&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;•&lt;/strong&gt;Professional fees paid (first year, newly registered professionals only)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Salary sacrifice car scheme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Opportunity for leadership and clinical qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Staff wellbeing service and fast-track physiotherapy services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer 24 hour services within our Inpatient, Crisis and SPA teams, if you are successfully appointed to posts in these areas or others that might have specified, you will be required to work unsociable hours and shift patterns.&lt;br /&gt; If you would like further information on this role, please refer to the attached Job Description and Person Specification. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To discuss the role further please do not hesitate to contact Rachel Moore Senior Inpatient Social Worker – &lt;/strong&gt;&lt;strong&gt;Rachel.Moore23@nhs.net&lt;/strong&gt;&lt;strong&gt; or 01522 307476.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our aim is to employ a diverse workforce, we actively encourage applications from under represented groups and those who have had lived experience. We also seek applications from people with protected characteristics covered by the Equality Act 2010 (Age, Disability, Gender Reassignment, Marriage and Civil Partnership, Pregnancy and Maternity, Race, Religion and Belief, Sex and Sexual Orientation).&lt;/p&gt;\n&lt;p&gt;LPFT processes staff personal information for Human Resources and Payroll purposes and we work hard to keep your confidential data secure. We regularly review our privacy notice so you are aware of how we process your data and how we ensure your data is protected. To view our privacy notice please visit our Trust website.&lt;/p&gt;\n&lt;p&gt;Preference will be given to NHS colleagues who are currently &#39;at risk&#39; and meet the minimum criteria of the Job Description &amp; Person Specification. &lt;br /&gt; &lt;br /&gt; Please provide accurate details for your references, these should cover the last 3 years and include your current or most recent employer or education to enable The Recruitment Team to be timely in their request. For internal staff we will seek a reference from your current manager. &lt;br /&gt; &lt;br /&gt; Interview Expenses will not be paid.&lt;br /&gt; &lt;br /&gt; Due to recent high volumes of applications, posts may be closed earlier once a sufficient number have been received.&lt;br /&gt; &lt;br /&gt; Where required new employees will be subject to an electronic Disclosure &amp; Barring Service check, please refer to the additional documentation above. You will be asked to attend a Pre-employment check appointment in Sleaford or Lincoln. Start dates will coincide with Induction and fall on the first week of the each month.&lt;/p&gt;\n&lt;p&gt;If you have any difficulty completing this application form please contact (01529) 222280&lt;br /&gt; You can find LPFT on Facebook and follow us on Twitter @LPFTNHS.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peter Hodgkinson Centre, Greetwell Road, Lincoln", "postalCode": "LN2 5UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2324", "longitude": "-.516409"}}, "title": "Inpatient Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258212", "validThrough": "2020-11-19T23:59:59+0000"}